{
    "title": "Bi-Weekly Discussion Thread - (July 07)",
    "author": "AutoModerator",
    "subreddit": "communism",
    "rank": 458,
    "score": 7,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 44,
    "url": "https://www.reddit.com/r/communism/comments/1dx3axg/biweekly_discussion_thread_july_07/",
    "id": "1dx3axg",
    "selftext": "We made this because Reddit's algorithm prioritises headlines and current events and doesn't allow for deeper, extended discussion - depending on how it goes for the first four or five times it'll be dropped or continued.\n\nSuggestions for things you might want to comment here (this is a work in progress and we'll change this over time):\n\n* Articles and quotes you want to see discussed\n* 'Slow' events - long-term trends, org updates, things that didn't happen recently\n* 'Fluff' posts that we usually discourage elsewhere - e.g \"How are you feeling today?\"\n* Discussions continued from other posts once the original post gets buried\n* Questions that are too advanced, complicated or obscure for r/communism101\n\nMods will sometimes sticky things they think are particularly important.\n\nNormal subreddit rules apply!\n\n[ Previous Bi-Weekly Discussion Threads may be found here https://old.reddit.com/r/communism/search?sort=new&restrict_sr=on&q=flair%3AWDT ]",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exact_Indication6815",
            "body": "I read the recent [discussion on queerness and per /u/cyberwitchtechnobtch 's request](https://old.reddit.com/r/communism/comments/1dwzd3p/i_live_in_the_southern_us_and_im_beginning_to_be/), I'm moving it to the weekly thread. I have a couple questions\n\n1. What exactly is a commodity-identity? It reminds me of MIM partially attributing gender to leisure-time, but this seems like a further complication of the topic\n\n2. How tied is queerness to women's oppression? I ask as I recognize /u/red_star_erika as someone who's interested in women's struggle as a base of struggle in the first-world, which likely influences her pushback. MIM has also raised this possibility in the past but I don't think they've ever actually tried to do so, considering their focus on national oppression",
            "score": 13,
            "replies": [
                {
                    "author": "cyberwitchtechnobtch",
                    "body": "A commodity-identity is the formation of the self following the logic of the market and mediated through the internet. This is the domain where politics is contented in the First World; MIM calls this domain \"leisure-time,\" and is a specific feature to understand about reality today and the global division of labor. In short, the imperial core has a monopoly on the highest/most advanced labor processes and to maintain that it requires the development of a culture that reflects and *reproduces* that monopoly and can utilize and advance, through technical skills, knowledge, and all-around comprehension (ideology ultimately), those advanced labor processes.\n\nThis is the landscape on which discussion of gender in the First World takes place and is a necessary precursor to critiquing the assumptions and terms presented to us surrounding queerness. MIM gives a good (though in my perception, somewhat rough) start for understanding gender that is distinctly different than what is presented within the common sense of the Left (gender is both a social construct and a form of personal expression - more on this later).\n\nFrom MIM(Prison)'s glossary:\n\n>One of three strands of oppression, the other two being class and nation. Gender can be thought of as socially-defined attributes related to one's sex organs and physiology. Patriarchy has led to the splitting of society into an oppressed (wimmin) and oppressor gender (men).\n\n>Historically reproductive status was very important to gender, but today the **dynamics of leisure-time and humyn biological development are the material basis of gender**. For example, children are the oppressed gender regardless of genitalia, as they face the bulk of sexual oppression independent of class and national oppression.\n\n>People of biologically superior health-status are better workers, and that's a class thing, but if they have leisure-time, they are also better sexually privileged. We might think of models or prostitutes, but professional athletes of any kind also walk this fine line. Athletes, models and well-paid prostitutes are not oppressed as \"objects,\" but in fact they hold sexual privilege. Older and disabled people as well as the very sick are at a disadvantage, not just at work but in leisure-time. For that matter there are some people with health statuses perfectly suited for work but not for leisure-time. (*Clarity On What Gender Is (from 1998 MIM Congress) by MC5* )\n\nMIM covers an insightfully broad understanding of how gender can be conceived, but I've found difficulty in using their foundation as a means to critique the various conceptions of gender I've encountered today. What I think is largely missing is a deeper elaboration of \"the dynamics of leisure-time\" which is where criticizing the commodity-identity is helpful (though perhaps not the final answer). Understanding the material foundation of where that arises from will help guide criticism.\n\nTo answer u/red_star_erika's question, \"what is the Communist response to trans healthcare bans\" I think the starting point is to understand what *has been* the current Communist response to the trans healthcare ban. Specifying *who* is Communist in this case is necessary though doesn't change the overall lackluster character of the response. At the very least, I assume we can reserve revisionist organizations for a separate critique of the non-Communist response, since it mostly is just tailism what already exists.\n\n(contd. below)",
                    "score": 17,
                    "replies": [
                        {
                            "author": "cyberwitchtechnobtch",
                            "body": "MIM doesn't seem to have anything specifically addressing the bans but this appears to be what their line was from 2013 on trans healthcare:\n\n>**MIM(Prisons) adds:** We appreciate this comrade expanding on what we wrote in *ULK 31*. We stand by our point: “In the article this prisoner criticizes, we wrote that we do not fight for sex reassignment surgery in the same way we don’t fight for gay marriage, because both amount to further privileges for people already benefiting from imperialism. We could equate these struggles with the fight to get more women in executive positions in companies, or the fight to get a Black man in the white house. They represent steps forward in equality for Blacks, wimmin, gays and trans people in reaping imperialist spoils of war and gender oppression on Third World peoples. These struggles do not help advance the fight against imperialism, to liberate the Third World peoples.” And as we explained in *ULK 12*, the U.$. health care system is not in the best interests of Amerikans, but on the whole they still have access to far superior care than most people in the world. So to struggle to improve U.$. health care strengthens imperialism, while ending AIDS drug monopolies challenges imperialism.\n\n[http://almhvxlkr4wwj7ah564vd4rwqk7bfcjiupyf7rs6ppcg5d7bgavbscad.onion/article.php/trans-debate-combat-all-forms-of-gender-oppression](http://almhvxlkr4wwj7ah564vd4rwqk7bfcjiupyf7rs6ppcg5d7bgavbscad.onion/article.php/trans-debate-combat-all-forms-of-gender-oppression) \n\n*(Only posting the onion link so you must use Tor to access it. Make sure you know the legality of Tor in your nation before downloading it.)*\n\nThere's not much elaboration elsewhere on this line and as a baseline it remains principled but leaves a lot to be desired.\n\nRMC's the Masses has a statement for 2024's Trans Day of Visibility where this is the expressed call to action:\n\n>Furthermore, we must understand that **the path to revolution begins with the reconstitution of the Communist Party.** As such, we call on ​​​​​all revolutionary-minded trans people to continue organizing for self-defense — both within trans-focused mass organizations and within broader organizations — for the express purpose of building the experience and knowledge necessary for the formation of a Maoist Communist Party. All work conducted, if it is to be revolutionary, must keep this goal in mind and must consciously work towards it.\n\n[https://the-masses.org/2024/04/03/trans-day-of-visibility-statement-2024/](https://the-masses.org/2024/04/03/trans-day-of-visibility-statement-2024/)\n\nThere's no mention of the healthcare bans here but the support of trans self-defense does illuminate things a bit further. An evaluation and criticism of current trans self-defense organizing  (both in the First and Third World) by anti-revisionists would likely be a very productive means to building a Communist line on gender liberation. This would also necessitate a continued struggle against the terms and assumptions presented on gender and sexuality by the Amerikan petit-bourgeois.\n\nI realized I didn't really address your second question but hopefully this is decent starting point for discussion and criticism.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "red_star_erika",
                                    "body": "to give my thoughts on my own question: could a revolutionary line be to call for a ban on cis transition care? I have been interested in the idea that cis people gender identify and undergo transition as well. this is a half-formed thought but I think it attacks the source of cis supremacy rather than defends the amerikkkan healthcare system (which in addition to being imperialist, is itself a double-edged sword for trans people given the pathologization it involves).",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "IncompetentFoliage",
                                            "body": "Forgive my ignorance, but what are some examples of cis transition care?  Or is there somewhere I can read more about the concept of cis transition?",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "cyberwitchtechnobtch",
                                                    "body": "From my understanding, it is specifically the medical realm of surgeries and procedures cis people can undergo to align themselves with their conception of gender identity. An example would be a cis man taking steroids (testosterone) to have more muscle mass to align more with the aspects of modern masculinity that favor muscularity. Or a cis woman (though anyone really) getting a BBL to align with a specific form of femininity.\n\nThis extends beyond medical procedures and really into the realm of how the individual is formed under late capitalism. I have too weak a grasp on philosophical studies to really speak in depth or with any confidence on \"the Self\" and the various conceptions of it throughout history but I can at least grasp that the Self, or the bourgeois individual, forms the kernel from which today's assumptions around gender emerge. I think that's most obvious with the term, gender expression, where gender is nearly substituted 1-1 with the word \"self.\"\n\nMore precisely, gender expression exists within self expression as perhaps a particular subset. Given that, I think the same criticisms of \"self expression\" regarding art (that it is a commodity, that it exists within imperialism, that it carries definite politics, etc.) can be extended to some degree to gender. Considering the idea that all expressions of gender are political (and more importantly, social) presents interesting ideas to explore and critique. Gender as an expression of ideology also presents further ideas to explore.",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "IncompetentFoliage",
                                                            "body": "Thank you, this is very helpful. That makes perfect sense. I guess my next question though would be this: I assume it's only a minority of cis Westerners who undergo the kinds of cis transition care you described. If so, if the majority of cis Westerners can distance themselves from the concept, does it really attack the source of cis supremacy? Don't we want something like the \"sterilize all men\" line, which almost no man can abstract himself from? Could interrogating the fact that everyone without exception gender-identifies yield something more universal? I am just throwing out ideas here from a place of regrettably very limited knowledge about this topic, so I apologize if anything comes across wrong.",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "cyberwitchtechnobtch",
                                                                    "body": "I think following in the polemical spirit of the \"sterilize all men\" line is correct and having something similarly potent regarding genderqueer oppression would be beneficial. But as you note, the strength of \"sterilize all men\" is that it reflects the othering that comes with treatment of women sex-objects back onto men and even onto men who had little to say about abortion in the first place. As for gender and trans-healthcare specifically it would be harder to take the same approach since generally, cis people want/\"need\" nothing from genderqueer people. Really the point is the suppression of our existence and where I think there is some polemical potential is around DIY HRT as the response to its emergence has drawn out reaction between both liberals, fascists, cis people, and even some trans people. Does this break from imperialism and social-fascism? Not completely, but to a greater degree than capitulating to healthcare reformism as some suppliers of DIY estrogen (I haven't researched what exists around testosterone) have synthesized it themselves outside of relying on pharmaceutical companies. There also seem to be no NGOs that specifically utilize the DIY route, instead opting for grants and financial aid to pay for the standard medical regimen. However, the chemicals they use still are bound up in the networks of global commodity chains so that does not totally absolve it, and there are other criticisms that will likely emerge upon investigating further. I still present mainly due to the political response surrounding it drawing out a united reactionary position among seemingly contradictory groups. This should be a necessary point for further investigation by Communists.\n\nAs for what you propose, \"interrogating the fact that everyone without exception gender-identifies,\" that would indeed yield something more universal and also interrogate the terms on which these discussions stand. I was specifically avoiding making this a discussion on \"transgender\" (instead opting for gender or genderqueer) struggles as I would specifically interrogate the commodity-identity of \"transgender\" or just \"trans.\" The assumption when the term transgender (or trans) is presented is that this refers to all forms of gender that aren't \"cis\" (another assumed term). As a result what I see happen is what u/Far_Permission_8659 described in the prior thread,\n\n>Euro-Amerikan or generally labor aristocratic “members of the community” can simultaneously embody the oppression faced by any gender non-conforming group and then speak over them. \n\nTheir argument is moreso drawing attention to the national and class lines that underlie these discussions but I think they also influence who aligns with trans/transgender versus other non-Euro-Amerikan forms of gender (something they also presented [in another post](https://www.reddit.com/r/communism101/comments/17byuxs/comment/k5o5edt/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)).",
                                                                    "score": 12,
                                                                    "replies": [
                                                                        {
                                                                            "author": "IncompetentFoliage",
                                                                            "body": "I think I should amend what I said above: everyone without exception gender-expresses. Of course, expression is rooted in identity, but expression rather than identity is the site where struggle becomes possible, and destabilization of identity can be effected through destabilization of expression. This is something we see every day on this subreddit, where people who present themselves with the commodity-identity of \"communist\" and express this identity in ways we are all familiar with have their mode of self-expression ruthlessly critiqued and undermined, frequently leading to identity trauma.\n\n\nPerhaps the most universal form that gender expression takes, at least in European society, is pronoun usage. Not everyone has a medical procedure as a form of gender expression or even goes out of their way to look or sound a certain way, but everyone, at least in English and most major European languages, associates themselves with gendered pronouns (I am assuming \"they\" is also considered a gendered pronoun to the extent that it is a means of expression of gender identity, precisely because it stands in opposition to other gendered pronouns in a system).\n\n\n(As an aside, it's interesting how gendered pronouns in China were introduced hardly a century ago as part of the revolutionary-democratic movement, which I think is a good example of how an external cause (European cultural influence) becomes operative through an internal cause (the Chinese national bourgeoisie and petty-bourgeoisie). I wonder why they were not eliminated after Liberation, despite the replacement of gendered titles with “comrade,” their novelty and the fact that they are a feature only of the written language and not the spoken language. The Russian Revolution reduced the degree to which the Russian pronoun system was gendered, but I assume the intent of this was just to bring the written language in line with the natural progress of the spoken language, which had already been eliminating some such distinctions.)\n\n\nAlthough due to the structure of the English language this expression must principally take the form of how one reacts to the pronouns others use, which leads me to wonder why there hasn't been (as far as I am aware) a movement to introduce gendered first-person pronouns to languages, like English, that lack them. It would seem this would put a fundamental means of putting gender expression back into the hands of the self (i.e., gender-non-conforming people), whereas it is currently concentrated in the hands of the other (i.e., gender-conforming people). I guess the convention of adding pronouns after one's name may have been adopted as a kind of substitute for this, one presumably seen as less disruptive to the structure of the language and hence easier to implement. But despite its universality, nothing I can think of relating to pronoun expression seems to have all that much potency, because its ultimately ideal rather than material.\n\n\nYour idea with DIY HRT is interesting not only because it reveals the common reactionary thread uniting disparate groups, but also because it materially subverts attempts at imposing structural control on genderqueer people.\n\n\n>Does this break from imperialism and social-fascism? Not completely\n\n\nI would think this is impossible short of revolution, which is of course not to say that the idea shouldn't be subject to critique with any inadequacies exposed.\n\n\n>As for gender and trans-healthcare specifically it would be harder to take the same approach since generally, cis people want/\"need\" nothing from genderqueer people.\n\n\nI just want to clarify on terminology: Aren't some cis people also genderqueer? I understand cis to mean one's gender identity is the same as one's sex assignment and I understand genderqueer to mean the same thing as non-binary, that one's gender identity is neither simply male nor simply female. So one term is concerned with the correspondence between one's sex assignment and one's gender identity (rather than \"forms of gender\" as such) while the other is concerned with the relation of one's gender identity as such to the socially imposed binary paradigm of gender. If this is correct, would it be more accurate to say that cis *men and women* want/\"need\" nothing from genderqueer people? I see that you are questioning the very concepts of cis and trans as well, and I fully recognize I may just be completely wrong about what all these terms mean or that they may mean different things in different contexts. I'd welcome your thoughts.",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "cyberwitchtechnobtch",
                                                                                    "body": "I appreciate the broader perspective you're introducing with the examples of gender's development within Russia and China while passing into their revolutionary eras. I lack really any knowledge on the linguistic developments within both Russia and China, but from my basic understanding of Philippine languages (purely linguistic knowledge, not speaking ability) they are similarly gender-*pronoun* neutral, and I can assume with the colonization from both Spain and the u.$., specific Western conceptions of gender started to reflect more in the language (Filipino especially, as that is the nationally developed language of the Philippine state.)\n\nDoing a quick look into research around language and gender left much to be desired but an interesting distinction I found is that of \"natural gendered\" languages of which English is actually one of them. The employment of *natural* reminds me of a footnote in Foreign Languages Press' printing of [The German Ideology](https://foreignlanguages.press/wp-content/uploads/2022/11/C37-The-German-Ideology-Marx-1st-Printing-FINAL.pdf) where footnote 12 states (I'm not sure by who, perhaps a later translator):\n\n>*Naturwüchsig* (“growing naturally”). Marx’s use of this term seems not quite consistent. He uses it (p. 20) to distinguish the economic development of pre-capitalist times, where the division of labor is determined by “natural predispositions,” e.g., physical strength, needs, accidents, etc. On pp. 47 and 51 similarly, where “natural” capital is attached to the labor and inherited environment of a guilds-man, as opposed to the capital of the modern capitalist, which is movable and can be assessed in terms of money. But elsewhere (pp. 22, 63) “natural” society is one in which there is a cleavage between the particular and the common interest, hence where men have no control over themselves or society. To this “natural” society he opposes communist society with its planning (p. 70, ff.).\n\nThis was something that stuck with me while reading the rest of the book, and I feel is an important consideration to note. While the term above, *natural gender*, refers to a linguistic phenomenon where gendered language is attached to subjects and not objects, I imagine interrogating the \"natural\" (*Naturwüchsig*) genders found within capitalism's division of labor today in contradiction with their superstructural reflections (commodity-identities?) would produce further insights. (i.e. what Far Permission stated in the prior thread:\n\n>The gender roles in each class and nation similarly vary in both their qualities and their experience with gender oppression and its confluence with other apparatuses. MIM's concept of the gender aristocracy is key here, as you point out. Is a New Afrikan man the same gender as a Euro-Amerikan man? Do they have the same relationship to gender violence and the formation of straightness?\n\nTo quickly wrap up for comment length restrictions, I'm shortening cis-*gender* as *cis*. But what your desire for clarification reveals is there is once again a contradiction between gender (a superstructural phenomenon around which commodity-identities can form) and \"sex assignment\" (or perhaps as stated above, labor/national divisions, something also noted within the MIM definition and the conception of a gender aristocracy). Genderqueer is also really its own identity and I think a better term would be what Far Permission again presented, \"gender non-conforming.\" I was resistant to say trans people instead of genderqueer (gender non-conforming is what I would say now), as when divided in two, there are trans people who actually do conform to *some* form of gender that aligns with *cisgender* people and those that do not.",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "IncompetentFoliage",
                                                                                            "body": "I'm not very familiar with Philippine languages, but as far as I'm aware Tagalog almost entirely lacks grammatical gender, the possible exception being an alternation between *o* and *a* in loanwords from Spanish. But I assume this development is the result of an organic process of assimilation due to language contact in the context of colonialism. By contrast, gender was artificially introduced to the Chinese pronoun system as a “modernizing” measure and popularized by intellectuals involved in the New Culture Movement. There were a few competing proposals for what the new pronoun system should look like and the relevant debates played out in newspapers and journals over a period of many years. Actually, the convention that ultimately won out and is the standard today was (correctly) attacked by feminists as dehumanizing of women.  It's kind of surprising it wasn't done away with during the post-Liberation language reform, but I imagine the issue must have come up.\n\n\nI assume all non-artificial languages express \"natural\" gender. At least, I would be very surprised to learn of one that doesn't. English has grammatical gender, but its domain is very limited and it mostly corresponds to natural gender. I like how you've tied in Marx's use of the term \"natural.\" It also reminds me of his term \"natural economy.\" I think you're absolutely right about interrogating \"natural\" genders as Far Permission suggested. It's similar in a way to another question I've been wanting to ask about for a while regarding the idea that \"race is class\": are a New Afrikan comprador and a New Afrikan proletarian the same race? To put it more concretely, do they experience race in the same way? I remember a statement in *Black Skin, White Masks* to the effect of \"in Martinique, if you have a certain amount of money, you are white.\"\n\n\n>*natural gender*, refers to a linguistic phenomenon where gendered language is attached to subjects and not objects\n\n\nI don't follow what you mean by subjects and objects here. If you mean that natural gender is when gender is attributed to animate nouns and not to inanimate nouns, that's not quite right. Natural gender is linguistic gender that reflects gender as socially determined in reality. Examples of non-natural gender would be how people use feminine pronouns in reference to ships or countries in English or how in German *Mädchen* means \"girl\" but is grammatically neuter.\n\n\nAnd thank you for the clarifications on genderqueer, etc. It's an interesting distinction you made by pointing out that trans people are not necessarily gender non-conforming. I'll need to do some reading to form a comprehensive picture of how all these different terms are used before approaching the bigger question of what material conditions underlie them.",
                                                                                            "score": 8,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "sudo-bayan",
                                                                                                    "body": "If I can add since I am Filipino, both /u/cyberwitchtechnobtch and you are correct in the Filipino generally lacks grammatical gender.\n\nAlso as a side note, the term \"Tagalog\", \"Pilipino\", and \"Filipino\", mean different things, Tagalog has historically referred to both the tagolog language and the tagalog people, and is even connected to the tagalog republic.\n\nThere is some contention about this though since tagalog is seen as different from the other Filipino languages such as cebuano, hiligaynon, ilongo, and many many more. There are similarities though due to being in something like the same language family.\n\nEventually this lead to conflicts over language and there was a push to name the new standard language as \"Pilipino\" to remove the tagalog bias.\n\nEventually this transformed to the term \"Filipino\" to further differentiate it, as tagalog does not have \"F\" to make it clearer as a national language.\n\nThis is a somewhat long winded way of saying that politically \"Filipino\" is preferred to \"Tagalog\" even though colloquially the difference isn't usually observed as over time due to internal migration and the influence of domestic and international mass media languages have tended to converge to just Filipino and English, though there are still many languages here that are being kept alive.\n\n\nMoving on to examples of lack of grammatical gender, there are no words for \"he\" or \"she\" in filipino, if you must specify it you have to do it after the word \"siya\", which is closest in english to \"they\". So for instance you can just refer to someone automatically as \"they\", \"kumakain siya\", they are eating. No way to say he or she is eating. \n\nYou are right about lone-words carrying grammatical gender. There are for instance spanish and english lonewords commonly used, historically it was mostly spanish but in recent time english has seen more assimilation into our language.\n\n\nThis is somewhat out of my field though as most of my knowledge on the subject comes from academic works out of our public universities.\n\nIt would be useful to have more nuanced perspectives from those who are more versed in linguistics.",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "IncompetentFoliage",
                                                                                                            "body": "Thanks for this.  I picked Tagalog because it's the only Philippine language I have any familiarity with (which is not much, from reading about it rather than learning it).  I'm familiar with the Tagalog/Pilipino/Filipino distinction.  From what I understand, Filipino is basically Tagalog with modifications like loanwords from other Philippine languages and changes to the phoneme inventory like the addition of *f*.  I would say that given the very high degree of mutual intelligibility they are (from a linguistics perspective) varieties of the same language, although politically Filipino is intended to be more neutral and may be framed as a distinct language.\n\n\nDo you know if the CPP has published anything on language policy?  I'm especially curious as to how it sees the role of English and the Baybayin script in Philippine society.",
                                                                                                            "score": 7,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "sudo-bayan",
                                                                                                                    "body": "I don't know of any specific work regarding language policy, but I will come back to you if I find one. In general though publications are usually in Filipino, English, and other regional languages (Bisaya, Hiligaynon, etc). To my knowledge the issue of language is still very much in motion, though broadly there is agreement about the need to foster and protect our national language. \n\nThere is also a concept associated with this, called \"Pantayong Pananaw\", \"From us for us\". \n\nhttps://kyotoreview.org/issue-3-nations-and-stories/exposition-critique-and-new-directions-for-pantayong-pananaw/\n\nWhich goes into why the language question is important as a tool to resist cultural colonialism (Though I have some reservations on Salazar, as he also rejected Marxism and Feminism, calling them western concepts, his student Guillermo, who wrote the above article, discusses these issues).\n\nIn terms of Baybayin, this has seen the most use in symbolic or polemic purposes. The CPP, NPA, NDFP, and various mass orgs often make use of baybayin symbols to represent themselves.\n\nThough the opposite is also true, as the government uses the same symbols for some of its organizations.\n\nI am unsure if there would come a time where it would find use as a writing system. As of now the romanized alphabet is still the most common, and documents are almost never written in baybayin. Though perhaps in the future there may yet be merit in it, as a true break from our colonial past.\n\nIn terms of English and Philippine society, there is a lot to be said there. There is a term to describe people who speak in broken Filipino with broken English, associated with the petite bourgeois, the term \"konyo\". I suppose the closest analogy in the west would be something like \"valley accent\", but the association is of petite bourgeoisie people as the actual bourgeois in this country would just speak straight English.\n\nThere is a distinction though between konyo and \"Taglish\", as Konyo is actually grammatically incorrect (for example: \"Make kuwento to me what happened...\"), while actual Taglish is grammatically correct in both English and Filipino (for example: \"Hindi kó ma-understand ang topic ng lecture niya.\"), representing mastery of both.\n\nIn terms of my own thoughts, this is something I've wanted to interrogate about myself, as I find myself writing in English more fluently than I do in Filipino, even though in every day life I converse in Filipino and English. This may be due to pressure to write in English for academic work. In recent time there has been a move in academia to start having publications in pure Filipino, so perhaps in the future this too will see change.\n\nEdit: Added Examples",
                                                                                                                    "score": 9,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "IncompetentFoliage",
                                                                                                                            "body": "Thanks, this is a really interesting comment.  I'll have to read about *Pantayong pananaw* and the *konyo*/Taglish distinction.\n\n\n>The CPP, NPA, NDFP, and various mass orgs often make use of baybayin symbols to represent themselves.\n\n\nThis is precisely why I asked, I've seen many examples of this.  I figured it was, as you said, largely limited to symbolic rather than practical use.\n\n\n>perhaps in the future there may yet be merit in it, as a true break from our colonial past.\n\n\nThis is a big question for me.  I am torn between on the one hand the recognition that the Latin alphabet is a colonial imposition in many countries where reversion to an indigenous script could symbolically reinforce a break with imperialism and promote the full development of the local culture and language and on the other hand the potential utility of the Latin alphabet in transcending national distinctions and symbolizing a break with nationalism in favour of internationalism.  I raised these questions in another thread a while back, and I still think there is a productive conversation to be had about them:\n\n\nhttps://www.reddit.com/r/communism/comments/1bgjw6p/comment/kwscl0j/\n\n\nAlso relevant is the section on language towards the end of this speech by Stalin:\n\n\nhttps://www.marxists.org/reference/archive/stalin/works/1930/aug/27.htm\n\n\n>In recent time there has been a move in academia to start having publications in pure Filipino\n\n\nI highly value initiatives like this because they symbolically represent anti-imperialism, they practically make literature more accessible to those who haven't learned a colonial language and they actually develop the indigenous language by serving as a stimulus to introduce neologisms to represent new or abstract concepts or nuances of meaning.\n\n\nAlso, on the point of accessibility, how widespread is English among the Philippine proletariat and peasantry?  I've read that the vast majority of Filipinos speak or understand English, even if it is not their main language.  That would make the Philippines something of an outlier among colonized countries (excepting the Americas).",
                                                                                                                            "score": 5,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "sudo-bayan",
                                                                                                                                    "body": ">Also, on the point of accessibility, how widespread is English among the Philippine proletariat and peasantry?  I've read that the vast majority of Filipinos speak or understand English, even if it is not their main language.  That would make the Philippines something of an outlier among colonized countries (excepting the Americas).\n\nThis is true, though there are also class distinctions. I would say Filipino peasants and proletariat would be familiar to be conversational in English, or in the least be able to read and interpret English words and signs.\n\nThis is different though from actually understanding what they read, or being able to make sense of academic or complex English.\n\nIt is problematic enough that it gets discussed in the news here:\n\nhttps://www.philstar.com/headlines/2024/01/11/2325063/explainer-students-poor-literacy-are-all-teachers-now-reading-teachers\n\n\nThough this extends as well to Filipino sadly, as though students my be more familiar with Filipino, they also struggle with comprehension, though this can come from lack of good resources and teaching in Filipino. I also think capitalist education contributes to this, as teaching, be it in English or Filipino, is significantly worse, when the philosophical trend is towards standardization and technical proficiency.\n\n\n>I highly value initiatives like this because they symbolically represent anti-imperialism, they practically make literature more accessible to those who haven't learned a colonial language and they actually develop the indigenous language by serving as a stimulus to introduce neologisms to represent new or abstract concepts or nuances of meaning.\n\nYou could look into works with the topic of Sikolohiyang Pilipino (Filipino psychology).\n\nThis is but one of many sources you can look for:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1111/1467-839X.00054\n\nBut it can be related to the overarching theme of Pantayong Pananaw, as a search for a Filipino identity from the Filipino, and more importantly trying to break free from how we are defined by our colonial masters.\n\n>This is a big question for me.  I am torn between on the one hand the recognition that the Latin alphabet is a colonial imposition in many countries where reversion to an indigenous script could symbolically reinforce a break with imperialism and promote the full development of the local culture and language and on the other hand the potential utility of the Latin alphabet in transcending national distinctions and symbolizing a break with nationalism in favour of internationalism.\n\nThis reminded me of the topic of \"Philippine English\", I am still not sure if it can be said to be distinct enough from normal amerikkkan english but there is an argument for how the Filipino has taken English and made it reflective of the Philippine context. This perhaps has merit, as the ubiquity of English (particularly due to the advent of the internet), has allowed for more cross-cultural exchange. This has the downside though of course of amplifying and over emphasizing amerikkkan culture and perspective. \n\nThere is research though on the topic so it is interesting to keep in mind together with the simultaneous importance of Filipino.\n\nLinks to some research on Philippine English:\n\nhttps://files.eric.ed.gov/fulltext/EJ1244667.pdf\n\nhttps://linguistics.upd.edu.ph/wp-content/uploads/2022/08/24-On-the-Status-of-English-in-the-Philippines.pdf",
                                                                                                                                    "score": 5,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Far_Permission_8659",
                                                                            "body": "As you bring up, I think there’s a deep critique of the trans movement that probably needs to occur and I’m glad that’s beginning to form in these conversations. For your DIY HRT or gender-affirming surgeries, I suspect these are products of the social relations surrounding trans identity rather than the cut-and-dry “apolitical” treatment for dysphoria (I’m not sure if an “apolitical” medical treatment exists anyway, but that’s a separate, though related discussion). The point of these treatments, after all, is to emulate cis womyn or men, or to be more precise in our language the preexisting gender role of “womanhood” or “manhood” within bourgeois society.*\n\nDysphoria is at its core a contradiction between one’s own identity and the gender roles capitalism imposes. The common way this is solved under capitalism is through the transformation of one’s prescribed gender role to more closely match their identity, but would socialism not do the opposite? Eradicate the imposition of gender entirely as the bourgeois family unit, the division of labor, and class/national contradictions are withered away?\n\nIn the short-term this of course feels like a cop-out— a “genderless” socialism has been used in the past to smuggle in a chauvinist downplaying of gender struggle today— but this might be a productive avenue of politics given that “passing” is an often economically exclusive category and is clearly not sustainable globally. I’m mainly thinking in the vein of “disability” (where people either spend large amounts of money to conform to the “able-bodied” form that capitalism uses, or are simply declassed and excluded) or nationalism (see [Malcom X’s discussion of New Afrikan conformation to Euro-Amerikan society](https://ccnmtl.columbia.edu/projects/mmt/mxp/speeches/mxa17.html)).\n\n*Although the key question here is *which* womanood. New Afrikan trans womyn or trans men are not necessarily aspiring to the same gender role as Euro-Amerikan trans womyn or men, though the latter two obviously monopolize the discussions surrounding this term and act as a sort of gravity for this identity.",
                                                                            "score": 8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "whentheseagullscry",
                                                                                    "body": ">  The common way this is solved under capitalism is through the transformation of one’s prescribed gender role to more closely match their identity, but would socialism not do the opposite? Eradicate the imposition of gender entirely as the bourgeois family unit, the division of labor, and class/national contradictions are withered away?\n\nYes, though this eradication would be more accurately described as sublation. Which is to say, gender roles were transformed, to eventually be absorbed into a new, socialist family unit. I don't think it's quite right to frame this as \"genderless\" considering the role misogyny has played in revisionism & counter-revolution. Anyway, it's possible that gender-identity may also be sublated. While it's true that many trans people are obsessed with passing, there are plenty who aren't for the reasons you point out. Even within the imperial core, there are plenty of trans people who're too poor to obtain the bodies they want. And so you have, say, trans women finding appreciation in having \"male\" traits like broad shoulders, or trans men appreciating their short height compared to cis men. Perhaps in the future, gender-identity could be absorbed into a new socialist culture that celebrates the diversity of human bodies. And considering the struggle against patriarchy under socialism will likely be protracted, there could still be a place for medical solutions. I don't think these ideas would cause umbrage with most trans people, I think the reactionary sentiments among them are rooted elsewhere, but maybe I'm too naive. \n\nWhat may help answer these questions is the study of queer & trans movements in the third-world. While hijra in Bangladesh may reject the term \"trans\", hijra in India seem to be using the term, [with this article sympathizing with \"trans activists\".](https://nazariyamagazine.in/2023/06/04/unity-queer-struggle/) On Twitter, its not uncommon for something like images of [khwaja siras showing up to women's marches in Pakistan with \"Trans Women are Women\"](https://x.com/Katrafiy/status/1469344337439834118) signs to go viral. Obviously this Twitter user is not part of the lowest rungs of the Pakistan proletariat, but it does raise the question of if this user is just cherrypicking or if these notions really are spreading. \n\nThe discussion about DIY HRT as opposed to state-covered HRT made me think about Butch Lee's desire for communists to provide illegal abortions to women after the repeal of Roe vs Wade, perhaps these could be useful tactics?",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Far_Permission_8659",
                                                                                            "body": ">Yes, though this eradication would be more accurately described as sublation. Which is to say, gender roles were transformed, to eventually be absorbed into a new, socialist family unit. I don't think it's quite right to frame this as \"genderless\" considering the role misogyny has played in revisionism & counter-revolution. \n\nThis is a good point. I struggled with the wording there and yours is far better. As for the critique of gender I certainly do not want to imply that communists should ignore gender or gender violence but rather critique the former and oppose the latter. There is a revolutionary queer line worth developing, and likewise a reactionary one worth alienating. Queerness is clearly not fully encapsulated within neoliberal capital (even in its most bourgeois of forms), so there is likely a revolutionary strategy here to consider, especially against the underlying form of the neoliberal prison-house as “multicultural” assimilation.\n\nMy attempts to equate it with the struggle of nationalism should indicate how important I think gender identity is, though the limits of my knowledge are showing through here. I’ll read more on this (especially what you linked) and try to add more to this discussion later.",
                                                                                            "score": 9,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "red_star_erika",
                                                                                    "body": "I think \"medical\" forms of transition will become much more relevant for trans people under socialism than superficial forms of gender expression (hairstyles, makeup, gendered clothing) since the latter will be more easily done away with than the applying of sex onto human bodies. I can see the usefulness of promoting DIY HRT but I am still interested in what I originally suggested because the way I see it, the contradiction between gender identity (that assumes commonality with third world counterparts) and one's actual status as a gender oppressor is something worth exposing in order to build a genuine feminist movement in the first world. trans and non-binary people for the most part consciously gender-indentify while cisness is assumed to be natural. therefore, I suggest going after cis transition in order to weaken this assumption. once the contradiction is exposed, perhaps engaging in anti-imperialist feminist struggle could be an act of transition (giving some usefulness to first world gender identity). these are my thoughts for now.\n\n>but this might be a productive avenue of politics given that “passing” is an often economically exclusive category and is clearly not sustainable globally\n\nthese discussions often seem to end up with critiques of \"cis assimilationism\" and passing. frankly, I don't see the relevance of it at this point in the struggle even if there are some class correlations.",
                                                                                    "score": 7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "whentheseagullscry",
                                                                                            "body": "> I think \"medical\" forms of transition will become much more relevant for trans people under socialism than superficial forms of gender expression (hairstyles, makeup, gendered clothing) since the latter will be more easily done away with than the applying of sex onto human bodies. \n\nI think Far was saying the desire for medical transition would wither away alongside its causes. But its also true that socialism bares the birthmarks of capitalism, and it's very possible that medical transitions will become more much prominent under the lower stage of socialism, with the end of medical transition not being on the table until socialism's higher stages. \n\n> therefore, I suggest going after cis transition in order to weaken this assumption. once the contradiction is exposed, perhaps engaging in anti-imperialist feminist struggle could be an act of transition (giving some usefulness to first world gender identity).\n\nI've given some thought to the concept of \"cis transition\" in the past. It's easy to describe how cishet women transition by just applying feminist critiques of plastic surgery, but I'm not sure if this framework makes sense for cishet men. To use /u/cyberwitchtechnobtch's example, how many cishet men are taking steroids for aesthetic purposes? Most of them are doing it because it's part of their job. Unless we're using an extremely broad concept of \"cis transition\" (which opens its own can of worms), cis transition is by and large in the realm of cis women, and only a tiny minority of these women at that. \n\nThe polemical power of \"Sterilize All Men\" was that it exposed the hypocrisy of half the US, but the US people isn't near as attached to cis transition. Furthermore, certain radical feminist movements proves there's [no hypocrisy in transphobia and opposing plastic surgery.](https://en.wikipedia.org/wiki/The_Transsexual_Empire) Allegedly, a [Korean translation of this book is currently making waves through South Korea's own transphobic, feminist movement,](https://www.feministcurrent.com/2018/09/06/south-koreas-take-off-corset-movement-inspire-feminists-everywhere-towards-radical-action/) which shows how difficult it is to find a polemic with as much bite as \"Sterilize All Men\" that doesn't also reproduce transphobia. \n\nI think MIM's articulation of gender has some major theoretical problems (Dworkin & Mackinnon's influences mentioned earlier is a big one), so I don't think exposing the alleged contradiction between gender and gender-identity is something that's even possible. I think locating gender in the reproduction of labor-power is a more fruitful endeavor. MIM dismisses it because of Maria Mies' first-worldist conclusions, but Butch Lee shows the \"gender = reproduction of labor-power\" line doesn't necessarily lead to first-worldism. The history *False Nationalism False Internationalism* brings suggests the lack of care for the women's liberation movement (a movement of \"gender-oppressors\" as per MIM) was a significant problem for the US Left, I think this merits more investigation, especially in the age of women being chewed up and spat out by US communist parties. I'm certain it'd provide eludication for trans people, as well.",
                                                                                            "score": 6,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "red_star_erika",
                                                                                                    "body": ">Unless we're using an extremely broad concept of \"cis transition\" (which opens its own can of worms)\n\nI am interested in opening that can. I think if cis people gender identify, it also follows that they are in a constant state of maintaining or advancing that gender identity (transition) and this involves things like clothing and behavior just as it does with trans people. a lot of male fascists are essentially trying to transition further into manhood by attempting to gain more power over women. when it comes to the medical aspect of cis transition, yeah cis people don't need it as much as trans people. but I disagree that only cis women medically transition. for cis men, there are things like viagra or hair loss prevention that I would consider to be a form of medical transition. this is tricky because trans people use those too. but that also applies to the healthcare bans targetting trans people since it only targets medicine being used for the purposes of helping transgender people transition. I won't pretend like it was a perfect idea but I think it is one worth considering. \n\n>I don't think exposing the alleged contradiction between gender and gender-identity is something that's even possible\n\ncan you elaborate on this? \n\nI will have to look more into Butch Lee's position on gender. as for *False Nationalism False Internationalism*, I agree with that statement but moreso from the view that the gender struggle was a fracture that *could've* been pushed in a revolutionary direction. I agree with MIM's belief that any genuine feminism must be centered on the liberation of third world women. this won't come about easily in oppressor nations so I don't think that statement from the book necessarily goes against the gender aristocracy thesis.",
                                                                                                    "score": 8,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "whentheseagullscry",
                                                                                                            "body": ">  I think if cis people gender identify, it also follows that they are in a constant state of maintaining or advancing that gender identity (transition) and this involves things like clothing and behavior just as it does with trans people. a lot of male fascists are essentially trying to transition further into manhood by attempting to gain more power over women. when it comes to the medical aspect of cis transition, yeah cis people don't need it as much as trans people. but I disagree that only cis women medically transition. for cis men, there are things like viagra or hair loss prevention that I would consider to be a form of medical transition. this is tricky because trans people use those too. but that also applies to the healthcare bans targetting trans people since it only targets medicine being used for the purposes of helping transgender people transition. I won't pretend like it was a perfect idea but I think it is one worth considering.\n\nInteresting ideas. I get where it comes from, it would just be a matter of turning them into a polemic that can be understood by women and trans people. That's not really something I can discuss, since making revolutionary art is not something I'm familiar with.\n\n> can you elaborate on this?\n\nThis thread was treating MIM's explanation of gender to be true, [which I disagree with]\n(https://old.reddit.com/r/communism/comments/1e49k80/marxism_and_modern_dating/ldgnc09/). Exposing the contradiction between gender and gender-identity, ie revealing first-world queer people to actually be gender-oppressors is barking up the wrong tree. That's not to say that first-world queer people shouldn't commit class suicide, but that in of itself doesn't necessitate the framework MIM uses. I think the implications of the \"gender = reproduction of labor-power\" theory is gender and gender-identity are synonymous, but I admit I still have more to study on fully explaining the existence of gender-identities. \n\n> I will have to look more into Butch Lee's position on gender.\n\nIt has some problems of its own, for example her not applying principal contradiction vs secondary contradiction in the realm of political struggle leads to her both-sidesing the Iraq War, I don't wanna portray it as perfect. But it's another road for those wish to center feminism around the liberation of third-world women should investigate.",
                                                                                                            "score": 6,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Far_Permission_8659",
                                                                                            "body": "I think your point about cis gender conformation is a good one. As you correctly point out the notion of gender conformity isn’t a uniquely trans issue— the process of simultaneously contorting oneself to fit within one’s gender role and reifying the conditions therein extends far beyond the borders of queer identity as it is commonly understood.\n\nYour criticism of my discussion of “withering away” of gender roles is also taken to heart. It’s easy to postulate about what socialism will mean for gender and its role in class struggle but this is just avoiding the problem of what communists should do to intervene *today* in the ongoing gender repression of gender non-conforming identities. \n\nAs for the questions of gender assimilationism, my point isn’t to distract from the larger issues surrounding broad gender repression today. Rather, I think neoliberalism is defined by a policy of crude assimilationism that isolates revolutionary lines while upholding the reactionary. If we can recognize this in the struggle for New Afrikan self-determination and, more recently, in the NGOification of the anti-Zionist movement, then I think there is room to discuss this within the queer space, which is dominated by social fascists. This is the place for political action and communist intervention, I think.",
                                                                                            "score": 5,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "vomit_blues",
                                                            "body": "Sorry to butt into a conversation. I’ve followed this thread and wanted to ask about something that I think you and most people here already know, but I’m out of the loop on.\n\nI think I understand the critique of self-expression through the arts. Specifically, the self isn’t something to express from within you, it’s instead a fetishization of the sum total of your social experiences. Art, then, is more like your social experiences coming out of your hands onto a canvas, keyboard, etc. Correct me if I’m wrong please.\n\nThe leap this conversation is taking that I wanted to ask for more about would be the best way to extend this critique out of art, and into self-expression in general. I think understanding the fetishization of the self is easy to follow. How do you talk about the way that fetishization extends into basically everything we see individualistically, like sexuality or gender? \n\nHere you’re talking about gender, which is something I think a lot about and try to articulate to myself or other friends. Is commodity-identity your own terminology, applied to MIM’s leisure-time, or does MIM have their own writing on that term specifically you’re pulling from? Apart from that, is this what you’re using as the foundation of a critique of the “self-“expression of identity?\n\nAny possible reading or other information would be really interesting to me. Thank you if you take the time to read and respond.",
                                                            "score": 9,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "Genuine question because I am interested in your pisistion. Why would/should cis transition care be banned? Is it because it's wastefull or it plays into gender roles?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Exact_Indication6815",
                            "body": "Can't all identities under capitalism be considered a commodity-identity? \"Trans Woman\" may be a commodity-identity, but its one that makes you not part of the patriarchy, which indicates there's something distinct about this commodity-identity compared to \"gamer\" or \"film buff\" or whatever. I agree that MIM's gender theories should be fleshed out more but I'm not sure if describing transness as a commodity-identity provides any clarity that MIM's already-existing writings don't. \n\nIf anything, it risks simplifying MIM's position, as MIM considered gender as not just a matter of leisure-time but also biology. For example, the discussion about the \"Sterilize All Men\" polemic. It's been observed that it's difficult to find an equivalent for trans healthcare, and I think that's because abortion is where the biological aspect of gender is most evident. And the polemic itself is obviously from a time where radical feminism's association between manhood and biological maleness were still influential on MIM. MIM didn't call Catharine MacKinnon \"the Hegel of Feminism\" for nothing. \n\nThat's not to shit on MIM or to push for calling trans women \"males\". What I'm getting at is users like /u/red_star_erika wants to find communist answers to the question of transness, which requires engaging with the questions MIM raised, and possibly even interrogating the circumstances in which MIM developed its line on gender. Gender is the part of MIM's line that I see a lot of hang-ups about (relatively speaking I should say, [here's one recent example](https://old.reddit.com/r/communism101/comments/1ch191i/do_marxists_have_any_specific_views_on_porn/l20b7ol/)) and it'd be useful to have more discussion of it.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "cyberwitchtechnobtch",
                                    "body": ">Can't all identities under capitalism be considered a commodity-identity?\n\nUnderstanding identity that is less explicitly marked by the commodity form is something I've yet to explore further but yes, my explanation at the very beginning implies that this extends beyond just gender, like \"gamer\" or \"Marxist-Leninist.\"\n\n>\"Trans Woman\" may be a commodity-identity, but its one that makes you not part of the patriarchy\n\nDoes it? People who come to this subreddit presenting as \"Marxist-Leninist\" *\\[quotations like the one just now, hereafter are to indicate an presumed identity\\]* clearly have not escaped liberalism despite their identity. Certainly being a \"trans woman\" shifts where you are within the greater [vector-field](https://www.researchgate.net/figure/The-graph-of-the-vector-fields-V1-V2-on-R_fig1_258227786)\\* of Patriarchy, assuming one can exist outside of it purely through a shift in identity only mystifies Patriarchy's existence.\n\n>I'm not sure if describing transness as a commodity-identity provides any clarity that MIM's already-existing writings don't.\n\nWhat I've always felt with MIM's line on gender is that it described the base social relations on which gender-*identity* can form, which I think was necessary but what I realized it lacked explanation for the superstructural formation of gender-*identity*. For example, in MIM Theory 2/3 the section: \"Diagrams of Gender Oppression: A Picture Saves a Hundred Pages\" the line after the final diagram says this:\n\n>As you can see, just about everyone will put First World men on the top and Third World women on the bottom. *What is controversial is what to say about FW women and TW men.*\n\n(*emphasis mine*)\n\nThe correct explanation is the gender aristocracy but the concept still feels underdeveloped, and only seems to raise more questions on the contradiction between identity and social relation (appearance and essence).\n\n>If anything, it risks simplifying MIM's position, as MIM considered gender as not just a matter of leisure-time but also biology.\n\nPresenting an example of the contradiction laid out above: what are \"trans women\" biologically? Obviously you agree calling them \"males\" is silly at best, and even MIM states that \"biology is not destiny,\" but there is still a distinct biological component given the fact this discussion is stemming from a fascist reaction to people *specifically* changing biological aspects of themselves. It's not clear whether you're arguing that this isn't the case, but the problem, as alluded to in my reply to IncompetentFoliage, is that we are treating the \"Sterilize all men\" line as the primary contradiction, consciously or not. The primary contradiction is between what I stated earlier, gender-*identity* (superstructure) and gender-***something*** (base). I'm not sure yet what ***something*** will be as a word but it's clear that it will be derived from the social organization we find ourselves in today, you could call it social gender or simply just *gender*, as MIM does. You would also be better off avoiding direct use of terms found within gender-identity, which where I think MIM runs into trouble. Again, their observations are correct, but the terms they use like \"male\" or \"biological-\\_\\_\\_\" raise questions about them that go unanswered and even unstated.\n\nThis is all to say that MIM understood what *gender* was, but had not yet investigated what gender-*identity* was, and its significance on politics today. I will also say that it is unfortunate that the u/mimprisons account is now inactive as they would have been able to provide necessary clarifications or point to documentation of where similar discussions like this had been had, which I'm certain they did.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "cyberwitchtechnobtch",
                                            "body": "*Footnote*: \\*I've employed the visual presentation of a vector-field, found in mathematics. The arrows show the direction of forces that are generated by an equation (in application, it is a mathematical representation of a physical/natural phenomenon) and describe the state of those forces, the field, at a certain moment in time. If you could mathematically represent society today at a frozen moment in time via an equation, and you isolated the [component ](https://www.mathsisfun.com/definitions/component-vector-.html)of \"Patriarchy\" within that equation, you would see the influence Patriarchy had on the overall forces within the field. From this you could understand how a point/particle (a person) would be acted up on within that field when places in different locations in the 2-D space (human society). But also what's again important to remember is that this is an abstraction taken at a moment frozen in time. Like Lenin warned, reality must be unfrozen and refrozen in order for our so-called \"equation\" to properly describe it as it is now. To keep the math analogy going, you could add an axis of time to the graph, making it [3-Dimensional](https://andrewpeng.dev/images/7-visualizing-vector-fields/b.png), allowing you to see how the field evolves over time, and thus make predictions of how it will change or what it will look like (historical materialism). In summary it could be said Dialectical Materialism is somewhat of a *spatial* analysis of reality and Historical Materialism is perhaps a *temporal* one. These are just some thoughts I've had floating around on analogies for Marxism found in Math and I felt this was as good a time as any to present them. Any considerations or criticisms of them I would suggest be discussed in it's own thread/post, I don't want to detract from the current discussion.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "sudo-bayan",
                                                    "body": "This reminded me of a seeming contradiction that arises from contemplating calculus.\n\nThe idea of \"instantaneous motion\", seems contradictory as how can there be motion (defined by a change in time) in an instant (a single point in time).\n\nI haven't yet worked through the mathematical works of Marx, though I am aware that this was a subject he found time to study. It is interesting for me though as it reveals an emergent contradiction when contemplating our mathematical notions.\n\nMoreover, mathematics has often attracted many idealist minded people as it seems immune to the usual demands of the natural science, seemingly coming \"purely from reason and logic\" with no basis on material evidence. I am skeptical though of such views, as mathematics just like all things is still a human endeavor and shaped by human activities. \n\nWith this, I would argue that an even deeper break from patriarchy would be questioning the boundaries of even vector fields.\n\nFor example, though this is a different concept, a vector space requires that there be an identity element (for both addition and multiplication) that would allow one to add or multiply without change the vector (a concept of adding 0 or multiplying by 1 for instance).\n\nThe degree system then cannot be a vector space as there is an instance when 0 degrees and 360 degrees mean the same thing. If we take this analogy out of math though and into society, this argument seems to play into notions that something cannot be two states at the same time, though we know in real life there are intersex people.\n\nThough a part of me tries to resist such analogies as it is easy to go wrong if one is not versed in mathematics, though I also believe it would be something interesting to discuss, as this forum gets endless questions about \"Marxist Computer Science\", so why not question it by beginning with a Marxist approach to mathematics.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Technical_Team_3182",
                                                            "body": "You should check this short blog post out.\n\nhttps://www.math3ma.com/blog/the-most-obvious-secret-in-mathematics\n\nAnd Yoneda’s lemma from Category Theory for a “concrete” example—funnily enough, category theory is up there as being the most abstract in modern mathematics, nonetheless incredibly powerful.\n\nFrom the same author \n\nhttps://www.math3ma.com/blog/the-yoneda-perspective\n\nhttps://www.math3ma.com/blog/the-yoneda-lemma\n\nhttps://www.math3ma.com/blog/the-yoneda-embedding",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "sudo-bayan",
                                                                    "body": "This is indeed fascinating, thanks for this, especially as it pertains to certain things I have been contemplating as part of my field.\n\nIt is somewhat amusing to see how closely this maps to the ideas of dialectical materialism, and I can see connections with Lenin's Materialism and Empirio-criticism. Both remarkable and telling, that the best of bourgeoisie science ends up coming to the same conclusions communists had in the 1900s, a further confirmation of Marxism as a science proper.\n\nI will have to devout some time to studying category theory, but it seems like a useful tool against idealist perspectives of mathematics.\n\nI am also curious if are familiar with any marxists works that touch on the subject as well?",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Technical_Team_3182",
                                                                            "body": "I think the only one I’ve seen with respect to category theory in particular is the work by Lawvere, a mathematician. [Here](https://raw.githubusercontent.com/mattearnshaw/lawvere/master/pdfs/1970-quantifiers-and-sheaves.pdf) is a paper of his, which also cites Mao; I’ve seen other socialist subreddits discuss it, but not here. [Here’s](https://philosophy.stackexchange.com/questions/9768/have-professional-philosophers-contributed-to-other-fields-in-the-last-20-years/9814#9814) a comment by a theoretical physicist on the practical application of Lawvere’s framework. Maybe you could look for some works by Kolgomorov and other USSR mathematicians on probability theory, etc. and the debates surrounding them.\n\nThe point is that Hegel’s logic provides us with a framework to generate new abstractions to intervene more efficiently into concrete problems in maths and sciences in general. Like Marx’s Capital, the movements of dialectical materialism is best expressed in tackling concretely defined problems, as category theory in itself is derived from similarities between different mathematical objects/structures encountered in different areas of mathematics. \n\nAs always, although the study of mathematics in general is dialectical by the constant need to critique definitions which necessitates new abstractions to intervene in problems, the issue lies in the contradiction of mathematics for immediate material utility or future potential.\n\nI don’t think there are “idealist” mathematicians **in practice** because mathematics necessitate a constantly expanding framework to tackle unsolved problems, which also arise once a new framework is ushered, like science. Mathematicians who try to philosophize on the other hand, like Poincare who was also a physicist, should be polemicized against, but that’s no different than, say, polemicizing against an analytical philosopher.\n\nThe problem of mathematics in a socialist future is finding a balance between pure maths and applied maths, i.e., what the state should prioritize in funding/promoting. During the 60s and later, socialist Vietnam had the mathematician [Hoang Tuy](https://en.m.wikipedia.org/w/index.php?title=Hoàng_Tụy&diffonly=true) who was encouraged to switch from real analysis to applied maths (although in reality, today, they’re not that far apart). For example, USSR probably made a mistake in discrediting cybernetics program OGAS (calling it idealist/imperialist, etc), which could’ve been groundbreaking for economic planning, but instead heavily funded the space race—how much of this is revisionism is another question. Number theory was deemed beautiful but useless by mathematician [Hardy](https://www.harvardmagazine.com/2015/08/mathematics-from-the-inside-out#:~:text=Hardy%20argued%20that%20the%20great,in%20his%20thinking%20and%20style.) as recent as 1940, but today it lives inside the algorithms on your electronic devices and credit cards.\n\nE: Given the immense amount of brilliance wasted on private companies maximizing profits around the world, that gives me hope for something like a reverse brain drain one day.\n\nE2: The book featured in the Hardy link in itself maybe worth an object of critique, now looking at it.\n\nE3: Philosophy of mathematics is a thing that I haven’t checked out but if anything’s worth critiquing, I’d argue that it would start from there.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "sudo-bayan",
                                                                                    "body": "Thank you for the links on category theory I will devout time to further study on it.\n\n> For example, USSR probably made a mistake in discrediting cybernetics program OGAS (calling it idealist/imperialist, etc), which could’ve been groundbreaking for economic planning, but instead heavily funded the space race—how much of this is revisionism is another question.\n\nOGAS however represented a right-ward deviation in the already revisionist USSR after Stalin's death, the problem of the cyberneticists is in how the use of a computer for state planning to solve \"problems of efficiency\" was not a problem central to state planning which is already efficient, I would argue that this is the idealist mathematics one must polemicize against as we are seeing a resurgence of such thought in regard to the views on Large language models and \"AI\". \n\nAt the same time though I do agree that it is still necessary to study and make sense of the mathematics underlying it, so that there could be some actual merit in the existence of the computer, though I would imagine that the future purpose of such machines would really solely exist for scientific and mathematical purposes, doing away with the current usage for entertainment. \n\n\nYou bring up pure and applied mathematics, which reminds me of how a course that is now taught in a pure mathematics degree is business and financial mathematics, which is testimony to what you say about how immense brilliance is wasted.\n\nI agree too with the need to critique Hardy, though it is perhaps associated with the need to critique the analytic philosophers in general, as the only real way to make sense of mathematics is in the dialecticals and not on aesthetic merits, as the way Hardy argues comes pretty close to the way the ancient Greeks viewed mathematics. \n\nAs you say though:\n\n>Like Marx’s Capital, the movements of dialectical materialism is best expressed in tackling concretely defined problems\n\n\nIt reminds me a bit of Illyenkov's line on critiquing cartesianism, from dialectical logic:\n\n>Descartes, the founder of analytical geometry, could therefore not explain in any rational way what-\never the reason for the algebraic expression of a curve by means of an equation ‘corresponding’ to the\nspatial image of this curve in a drawing. They could not, indeed, manage without God, because according to Descartes, actions with signs and on the basis of signs, in accordance only with signs (with their mathematical sense), i.e. actions in the ether of ‘pure thought’, had nothing in common with real bodily\nactions in the sphere of spatially determined things, in accordance with their real contours. The first\nwere pure actions of the soul (or thinking as such), the second – actions of the body repeating the\ncontours (spatially geometric outlines) of external bodies, and therefore wholly governed by the laws of\nthe ‘external’, spatially material world.\n\n/\n\n>(This problem is posed no less sharply today by the ‘philosophy of mathematics’. If mathematical\nconstructions are treated as constructions of the creative intellect of mathematicians, ‘free’ of any\nexternal determination and worked out exclusively by ‘logical’ rules – and the mathematicians themselves, following Descartes, are quite often apt to interpret them precisely so – it becomes quite enigmatic and inexplicable why on earth the empirical facts, the facts of ‘external experience’, keep on\nagreeing and coinciding in their mathematical, numerical expressions with the results obtained by purely\nlogical calculations and by the ‘pure’ actions of the intellect. It is absolutely unclear. Only ‘God’ can\nhelp.)\n\n\nSomething that can then be answered with Spinoza:\n\n>We formulated this problem in the preceding essay. Spinoza found a very simple solution to it, brilliant in its simplicity for our day as well as his: the problem is insoluble only because it has been\nwrongly posed. There is no need to rack one’s brains over how the Lord God ‘unites’ ‘soul’ (thought)\nand ‘body’ in one complex, represented initially (and by definition) as different and even contrary principles allegedly existing separately from each other before the ‘act’ of this ‘uniting’ (and thus, also being\nable to exist after their ‘separation’; which is only another formulation of the thesis of the immortality\nof the soul, one of the cornerstones of Christian theology and ethics). In fact, there simply is no such\nsituation; and therefore there is also no problem of ‘uniting’ or ‘co-ordination’.\n\n/\n\n>There are not two different and originally contrary objects of investigation body and thought, but\nonly one single object, which is the thinking body of living, real man (or other analogous being, if such\nexists anywhere in the Universe), only considered from two different and even opposing aspects or\npoints of view. Living, real thinking man, the sole thinking body with which we are acquainted, does\nnot consist of two Cartesian halves ‘thought lacking a body’ and a ‘body lacking thought’. In relation to\nreal man both the one and the other are equally fallacious abstractions, and one cannot in the end\nmodel a real thinking man from two equally fallacious abstractions.\n\n/\n\n>That is what constitutes the real ‘keystone’ of the whole system, a very simple truth that is easy, on\nthe whole, to understand.\n\n\nMy interest in this topic began with wanting to delve deeper into the Philosophy of Mathematics, as such I agree with the need to start any critique there, In time I hope to also come towards more thoughts on the matter, though if you find any that would also be of much help.",
                                                                                    "score": 5,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Exact_Indication6815",
                                            "body": "I took the \"not part of the patriarchy\" phrasing from MIM(P)'s glossary:\n\n> gender aristocracy: Those who are not part of the patriarchy but who enjoy gender privilege so that their interests in leisure-time and in relation to pleasure align with the patriarchy. \n\nIn one article in MIM Theory 2/3 (the Backlash review) they even explicitly say First World women are oppressed by patriarchy, despite the two generally being in alliance with each other.\n\n> What I've always felt with MIM's line on gender is that it described the base social relations on which gender-identity can form, which I think was necessary but what I realized it lacked explanation for the superstructural formation of gender-identity.\n\nThey don't directly explain gender-identity, but the terms they gave us offers a start. They agree with Mackinnon and Dworkin rooting sexual desire in power, and this is applicable regardless of sexuality:\n\n> MIM’s theory on power inequality in relationships is as applicable to lesbian relationships as it is to heterosexual ones. Capitalism socializes women to enjoy subordination and men to enjoy power. If this socialization did not extend into all relationships then lesbians would be right in advocating separatism as a utopian solution to the problems of the patriarchy. But if it did not extend into the lives of lesbians there would be no lesbian battering, an unfortunately all-too-frequent occurrence.\n\nA \"biological man\" may gravitate towards the \"Trans Woman\" identity as they were socialized into enjoying subordination instead of domination. On the flip side, a lesbian who batters their partner would be a \"biological woman\" who's been socialized into enjoying domination. It's telling that sexual sadomasochism emerged from queer communities, and that it was generally the pro-sadomasochism feminists that accepted \"trans women\" as women back in the late 20th century, eg the rivalry between the feminist magazines \"Off Our Backs\" and \"On Our Backs\" as a documentation of this. Sexual sadomasochism makes sexuality's roots in power most explicit. And if, say, you find sexual pleasure in dominating others, then it's no surprise that a \"biological woman\" may end up relating to men on some level, such as leatherdykes adopting the aesthetics of gay male leather culture and even calling themselves \"daddy\". \n\nThis doesn't contradict the \"gender-identity as commodity-identity\" concept, but the concept opens up its own flood of questions. My initial thought was that all identities under capitalism are commodity-identities, and thus describing gender-identity as a commodity-identity doesn't actually explain anything (after all, why does gender-identity alter your relationship to patriarchy but not being a gamer or a psuedo-marxist leninist?) but you seem to be allowing the possibility for identities under capitalism that aren't commodity-identities. \n\n> Presenting an example of the contradiction laid out above: what are \"trans women\" biologically? Obviously you agree calling them \"males\" is silly at best, and even MIM states that \"biology is not destiny,\" but there is still a distinct biological component given the fact this discussion is stemming from a fascist reaction to people specifically changing biological aspects of themselves.\n\nMy unwillingness to refer to \"trans women\" as \"males\" is mainly because of how often the association between \"trans women\" and \"maleness\" is used to push fascist rhetoric. \"Trans women\" weren't always hesitant to describe themselves as male/men. Regardless, there's obviously a biological component to changing your biology, I should've been more clear. What I'm saying is MIM is influenced by radical feminism, where your assigned sex at birth mediates your relationship to patriarchy. This was evident in their earlier writings, where gender aristocracy was initially defined as \"people of female biology who nonetheless have a social role of gender oppressor\", implying that a \"trans woman\" only shifts from the labor aristocracy to the gender aristocracy once they get surgery. This definition still sees use today, such as this 2024 article about Israel:\n\n> The gender aristocracy are the wimmin (and the sexual minorities, etc) who benefit from and support the patriarchy despite having the biological characteristics that traditionally put people in the gender oppressed group under patriarchy. \n\nWhich isn't to accuse MIM of being biological determinist, rather I'm trying to work through the influences of radical feminism on MIM. You see MIM using terms like \"male\" or \"biological-X\" as a result of using gender-identity terms, but to me this seems to be more like MIM using radical feminism. I'm also not sure you can use MIM's theories without relying on the radical feminist language. To take that diagram you cited, for example: MIM calls first-world biological women \"male\". In other words, their appearance is female but their essence is male. What terms do we use instead? Part of the reason I'm using MIM's own terms for these posts is because I'm not sure myself.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "red_star_erika",
                                    "body": ">This conversation escalated because /u/red_star_erika got upset over being referred to with gender-neutral pronouns, but as per MIM's theory, first-world women are male and gender-neutral pronouns should be used instead of subjectivist, inherently-idpol personal pronouns. Will this sub's queer users start thinking of themselves as \"male\" and use gender-neutral pronouns?\n\nnow why was this necessary? if you have something to say, say it on your main account.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "red_star_erika",
                                                    "body": "if it doesn't matter, switch to your main account. I prepared myself to be banned when I brought up the misgendering again so I have no desire to discuss it with someone who is being completely cowardly and hiding behind their old account.",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ernst-thalman",
            "body": "Ever since a post appeared on communism101 last week talking about the ultra left lassalle memes I’ve been reading this to study left com counter arguments against socialist construction in the USSR. https://theanarchistlibrary.org/library/aufheben-what-was-the-ussr#toc74 Curious what folks here have to say on the section titled The Deformation of Value and To what extent did the Commodity-form exist in the USSR? They argue that the products of state owned industries were commodities and underwent a circuit that alienated the proletarian from the product of their labor. Was something like a radio produced in a state owned factory really a commodity in this sense?",
            "score": 11,
            "replies": [
                {
                    "author": "StrawBicycleThief",
                    "body": "> “They did not work to produce their own needs, nor for the needs of their own families or communities, but for some alien other. While the workers worked as a means to obtain a wage through which they could survive, their labour became independent of them, directed towards aims that were not their own. In producing products that were not their own they served to reproduce their position as workers on an ever expanding scale”\n…\n\n> “Hence, like their counter-parts in the west, the Russian workers were subordinated to a process of production that was designed and developed to maximise production with scant regard to the living experience of the worker in production. As such the worker was reduced to a mere instrument of production.”\n\nThis is basically identical to a liberal argument. Notice that the subjective experience of a worker is centred and that this allows for an identity to be set up based on the obvious existence of mechanised production in the west and USSR. Another thing to notice is the use of the term “production”, instead of “profit” at multiple times throughout the piece. This is because left-communists see extensive production itself as synonymous with capitalism.\n\n> “Either they consider that Russian “capitalism” has all the basic features of classic capitalism as analyzed by Marx, to start with generalized commodity production, and that it also shows all the basic contradictions of capitalism, included capitalist crisis of overproduction and then they have a hard time discovering evidence for this. Or they admit the obvious fact that most of these features are absent from the Soviet economy, and they then have to contend that these features are not “basic” to capitalism anyhow, which in the last analysis only means exploitation of wage-labor by “accumulators”. This then implies unavoidably that there are qualitative differences between the functioning of capitalism as it exists in the West and the functioning of the Soviet economy, and that “state capitalism” is a mode of production different (i.e., corresponding to different laws of motion) from classical private capitalism. Bordiga is the outstanding representative of the first current, Tony Cliff of the second current. The peculiarity of Kidron is to try to have it both ways: he intends to eat his “state capitalist” cake and have it too!”\n\nhttps://www.marxists.org/archive/mandel/1969/08/statecapitalism.htm \n\nAs Mandel says the trick is to ignore the macro-features and focus on the appearance of wages and exploitation:\n\n> “Like their counter-parts in the West, the Russian workers worked longer than that necessary to reproduce the equivalent of their labour-power. Thus, like the their counter-parts in the West, the Russian workers alienated their labour and were exploited.”\n…\n> “But, the Trotskyists insist, products did not assume the form of commodities in the USSR since there was no market. But if products did not assume the form of commodities then there can have been no real wage-labour since labour-power, as a commodity, can not be exchanged for other commodities. Wages were merely a means of rationing products.”\n\nAnd thus the role of “accumulators” who supposedly benefit from this exploitation, not in the form of profit, but instead:\n\n> “In the USSR these relations of production were essentially the same. The workers alienated their labour. As such they did not produce for their own immediate needs but worked for the management of the state enterprise. Equally, the management of the state enterprise no more appropriated the labour from its workers for it own immediate needs any more than the management of a capitalist enterprise in the West. The labour appropriated from the workers was used to produce products that were objects of use for others external to the producers.”\n\nI did a double take here because I thought I was reading James Burnham. But seriously, this is what they actually believe: that  production was planned to produce a surplus (duh) and that wages (*in appearance*) were used to buy the goods produced. wages here are a form that is divorced from content and taken as self evident  Everything else after this is just not addressing the issue. There is talk about the circuits of capital or whatever but at the end of the day this is what they are starting from and building up to a broad claim.\n\nThe way out of what Mandel describes for Aufheben, from what I recall, is to use Ticktin’s notion of a “non-mode of production” to handwave all of this talk about the actual dynamics of a planned economy as the result of the “malfunction” of capitalism*. With the eventual defeat of the Soviet Union and other socialist countries being proof of the rule. This is absurd at a systems level (if you come into contact with COVID it is not predetermined that you will actually get it or that you will die) but also because all of human history could be painted in this way. To the point where the concept of a mode of production ceases to have any explanatory power outside of capitalism. \n\nThere is not much else to say beyond this because  everything else that they point out (that the commodity form existed, that exchange existed, etc) are things that Stalin himself notes in Economic Problems. The whole point of that is to explain the lack of capitalist features in the USSR and its general direction away from commodification in *spite* of this fact. Of course Maoism goes to the next level and tackles how the other direction was possible.\n\nEdit: here it is *\n\n>” Indeed, it would seem to us that any attempt to develop a theory of the USSR as being essentially a capitalist system must take on board and develop a critique of some of the central positions put forward by Ticktin. Perhaps most importantly, after Ticktin and of course the collapse he describes, it is obvious that the USSR can in no way be seen as some higher and more developed stage of capitalism, as some state capitalist theories might imply. What becomes clear from Ticktin is that any understanding of the USSR must start from its malfunctioning: it must explain the systematic waste and inefficiencies that it produced. If the USSR was in any way capitalist it must have been a deformed capitalism, as we shall argue.”\n\nhttps://libcom.org/article/what-was-ussr-part-ii-russia-non-mode-production",
                    "score": 17,
                    "replies": [
                        {
                            "author": "vomit_blues",
                            "body": "This is a great comment. Out of curiosity, did you come to these conclusions purely off your own reading, or are there more polemics against left communism/state capitalist theory you’ve read before as well (like the one you linked)?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "StrawBicycleThief",
                                    "body": "Well I kind of forced myself to read a lot of this stuff back in 2016 when “left book” started to become a really big thing on Facebook. There were countless communities that circulated these texts in a really smug manner and my instincts at the time were that they were wrong. After that I read *Capital* properly and Anwar Shaikh’s *Competions, Conflict and Crisis* and it became very difficult to buy the picture of capitalism that these texts paint. I also used to be in an organisation that used Tony Cliff’s state-capitalism theory which that Mandel quote points out is basically using the same logic and I could never accept its use. The other resource is this subreddit. There was an excellent comment by smokeuptheweed9 I think a few years ago about Stalin’s *Economic Problems*. I found this to make perfect sense and I went back to that text after that and got a lot more use out of it.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "whentheseagullscry",
            "body": "I read Michael Hudson's *Super-Imperialism*. I suppose its functional as a history of the US dollar but it feels like Hudson only skimmed Lenin and called it a day. Hudson seems to use \"imperialism\" as just a synonym for \"hegemonism\" so in his mind, European countries haven't been imperialist for the past few decades but the Soviet Union was because of COMECON. It's funny that Hudson condemns the Soviet Union considering this book's popularity among Dengists.",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "It seems that reddit is blocking the redspark website. Tried to post this but reddit showed it as deleted.\n\nhttps://www.redspark.nu/en/peoples-war/bandh-called-by-cpi-maoist-brings-life-to-a-halt-in-kolhan-division/\n\n> East Singhbhum District, July 10, 2024: The Communist Party of India (Maoist) successfully implemented a one-day bandh across Kolhan division in Jharkhand state on Wednesday. The bandh, called to protest alleged police brutality in the Kolhan-Saranda region, had wide-ranging impacts on daily life and transportation in the area.\n\n>The most dramatic incident occurred in the early hours of Wednesday when cadres of the Maoist party uprooted fish plates from the Howrah-Mumbai main railway line, forcing an immediate halt to all train movements. The sabotage to the railway line took place between 2 AM and 3 AM. Security forces rushed to the scene upon receiving information about the incident.\n\n>Cadres of the Maoist party placed a banner across the railway tracks between pole numbers 378/35A and 378/31A-35A on the third line of the Manoharpur-Jaraikela section. The banner, attributed to the CPI (Maoist) Southern Zonal Committee, called for support of the bandh and denounced what they termed a ‘police massacre’ in the Kolhan Saranda area.\n\n>Train services were disrupted for approximately five hours, from 2 AM to 6:10 AM, when security forces removed the banner and completed their investigation.\n\n>The bandh’s impact extended beyond the railways. In Manoharpur and Anandpur blocks, normal life came to a standstill as government and non-government establishments remained closed. The streets were for the most part deserted, with both long-distance and local vehicular traffic coming to a complete halt. Only essential services such as ambulances, milk supply vehicles, and those related to hospital emergencies were exempted from the bandh.\n\n>In Chaibasa, the district headquarters of West Singhbhum, long-distance bus services were suspended. The usually bustling bus stand was quiet, with rows of idle buses serving as a stark visual representation of the bandh’s effectiveness.\n\n>Law enforcement agencies, including local police, Railway Protection Force, and CRPF (CoBRA) personnel, maintained a high alert across the affected areas. Security measures were particularly stringent in the police station areas of Manoharpur, Anandpur, Jaraikela, Chotanagra, and Chidiya OP under the Manoharpur Circle.\n\n>The bandh was called by Comrade Ashok, a spokesperson for the CPI (Maoist) Southern Zonal Committee, in response to ongoing police and paramilitary operations in the forest areas of Trijunction Podahat, Kolhan, and Saranda. The Maoists allege that these operations, including ‘Operation Kagaar’ and ‘Operation Clean,’ have resulted in civilian casualties in areas such as Lovad and Lipunga.",
            "score": 7,
            "replies": []
        }
    ]
}