{
    "title": "Favourite lesser-known revolutionaries",
    "author": "justalilfeller",
    "subreddit": "communism",
    "rank": 449,
    "score": 20,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/communism/comments/1dz3oqi/favourite_lesserknown_revolutionaries/",
    "id": "1dz3oqi",
    "selftext": "Everybody knows about Lenin, Stalin, Mao, Trotsky, Rosa, Castro, Chavez, Che, Ho Chi Minh, etc. But who are some of your favourite lesser-known revolutionaries? I'm thinking of people like Damdin Sükhbaatar, Kaysone Phomvihane, and Charu Mazumdar.",
    "comments": [
        {
            "author": "brookssoulpenis",
            "body": "Dhoruba Bin Wahad was the field secretary for the New York Black Panther Party and did a lot of speeches and front line activism. \n\nHim along with a lot of other party members were falsely accused of crimes and sentenced to near life sentences. Dhoruba was released recently and is on Black Liberation Media’s YouTube channel and a few others doing talks. He is incredibly knowledgeable and has the credentials to be taken seriously by all comrades.",
            "score": 18,
            "replies": []
        },
        {
            "author": "None",
            "body": "came here late but, Bhagat Singh, that guy, one of the most beautiful creation humanity has ever seen(along with his comrades many of which were executed by British imperialists)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dienekes404",
            "body": "I like the story of Thomas Sankara. He's known by communists, but a lot of people haven't heard of him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "laulaurin",
            "body": "Salvador Allende! \nIk he is a revisionist (edit: I meant reformist) and that probably was part of his downfall. But the Imperial states were scared af of the only real socialist getting elected and succeeding. Also project Cybersyn was very ambitious with the recourses they had and quite successful, this approach is imo the only sensible way to go about a planned economy today.",
            "score": 1,
            "replies": [
                {
                    "author": "PretentiousnPretty",
                    "body": "Revisionism is the only way to go about a planned economy today? Why?\n\n>\"He did not lack personal courage and was ready to make, and did in fact make, the supreme sacrifice. But his tragedy was that he believed he could convince the reactionary forces through reason to give up their activity and relinquish their past positions and privileges of their own good will.\"\n\n>\"History has proved, and the events in Chile, where it was not yet a question of socialism but of a democratic regime, again made clear, that the establishment of socialism through the parliamentary road is utterly impossible.\" -Enver Hoxha, the tragic events in Chile\n\nOn Cybersyn itself:\n>\"Although Flores (one of the pioneers of Cybersyn, later the general secretary of the Chilean government) still felt that Cybersyn was useful, he came to see that it was incapable of regulating the size and scope of Chile’s economic and political problems or of changing the structure of Chilean society.\" -Eden Medina, [Cybernetic Revolutionaries](https://thereader.mitpress.mit.edu/project-cybersyn-chiles-radical-experiment-in-cybernetic-socialism/)\n\nAs much as Allende and Cybersyn raised the standards of living for Chileans, we must be cognizant of the limits of democratic socialism and not seek to formulaically repeat it.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "laulaurin",
                            "body": "Yes, all very good points. \n\nWhen I learned about the socialist revolution in Chile, it was the first time I realized that the main reason socialism not working isn't socialisms fault but the interference and sabotage by imperialist nations... \nIt is quite valuable in that regard because the telling of this story isn't that differentiated and redscared depending on where you pick it up. \n\nAs you mentioned it is quite exemplary of why democratic socialism is unlikely to work out, even with a majority of the population behind the revolution despite contradicting capitalist media coverage.\n\nAlso I tried to lean more about it, aside from great documentaries and podcasts, but had difficulties keeping my attention on the more dry parts of literature like Eden medinas cybernetic revolutionaries. This is not an issue of mine exclusive to this book, but one I have with most more theoretic work.\nIf anybody has more digestible recommendations, I'd be very thankful :)\n\nEdit: I kinda confused reformist and revisionist in my original comment :]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PretentiousnPretty",
                                    "body": "I didn't actually read the book but rather the article cited which quotes the book, I think that secondary literature is usually helpful, as long as you keep in mind that it isn't the same as the original source and will inevitably have its' own influences (ie not the most complete, most truthful version of the original source).\n\nI think in general a good way to understand things is to have a good grasp on Marxism to the point that the whole world can be understood through historical materialism, and you can interprete any event through this lens.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}