{
    "title": "Soviet Referendum in 1991",
    "author": "babuji80",
    "subreddit": "communism",
    "rank": 433,
    "score": 17,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/communism/comments/1e54y8y/soviet_referendum_in_1991/",
    "id": "1e54y8y",
    "selftext": "Hey I have often seen people talk about the referendum in early 91 when the people overwhelming voted in favour of the union.\nWhat I don't see is people talking about the referendums for independence that happened in individual republics after the union wide one in March. \nWhy is that? Were they rigged? Or were there some problem while they were being conducted?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "At this time, the collapse of the USSR was clear and apparent, which was not so much the case in early '91 (except for within internal politics). The later referendums were thus under different political conditions - I don't think there's any more reason to think they were rigged than the USSR-wide referendum before it (as a side note, rigged elections are actually quite rare historically). Its worth bearing in mind that some of the constituent republics boycotted the big referendum - many of them had already declared independence to some extent.  \n  \nI think there was a widespread acceptance that the individual republics would have to jump ship one way or another, or else get caught up in the chaos of the Russian transition away from the Soviet model. As it turned out (except in some of the Baltic states, etc), independence wouldn't alleviate the great political/economic shifts that would take place, and the 90s became hell for most of the former republics anyway.   \nThis is just my limited take - other historic factors no doubt played a role.",
            "score": 7,
            "replies": []
        },
        {
            "author": "flynnnupe",
            "body": "There is no evidence to suggest the referendum was rigged. There are however multiple reasons for the difference in results.\n\n\nThe way the question was phrased wasn't a simple \"Do you wish to be independent?\" but was \"Do you consider it necessary to preserve the USSR as a renewed federation of equal sovereign republics, which will be fully ensured of human rights and freedoms of any nationality?\". At this time Gorbachev wanted to enact the \"New Union Treaty\" to replace the 1922 Treaty on the Creation of the Union of Soviet Socialist Republics. This was supposed to make the Soviet republics more autonomous. The vote wanted to ascertain who was for these reforms, not so much who wanted independence. So the republics that participated in the vote only voted to remain in a USSR that was less centralised and gave them more power.\n\nThis \"New Union Treaty\" was never signed however. A day before the eventual signing a coup d'état was launched by hardliners who were against Gorbachev's plans. Even tho the coup d'état was quickly stopped, this destabilised the USSR significantly. This led the republics to vote for independence.  They didn't get the autonomy they wanted and the USSR was very unstable so independence seemed like the best option.\n\nAnother thing I wanted to note is that the authorities of Armenia, Estonia, Georgia (not in Abkhazia and South Ossetia), Latvia, Lithuania, and Moldova (not in Transnistria and Gagauzia) all boycotted the vote.\n\nEdit: wanted to add that the hardliners were part of Gorbachev's own government. So his own government launched a coup against him.",
            "score": 5,
            "replies": []
        }
    ]
}