{
    "title": "Role of science in popular movements/revolution?",
    "author": "xJapsRx",
    "subreddit": "communism",
    "rank": 349,
    "score": 30,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/communism/comments/1f6g9x6/role_of_science_in_popular_movementsrevolution/",
    "id": "1f6g9x6",
    "selftext": "Hello comrades, as any of you knows, we are living in a time in which the imperium is crumbling and capitalism is on the brink of imploding. For many, the fight for a liberated Palestine has ignited a spark and once again made clear that the people are the ones that hold the power. But this is also what confuses me at the moment.   \nI am a university student who has been active in organising for the pro-Palestine movement last year but still feel like many of us are as confused as I am about our role in the movement and relation to non-students/-scientists. \n\nAs a Marxist, it is clear to me that students are thoroughly part of the proletariat, even when not engaging in physical labour and having priviliges that many of us do not possess. This fact leads some of us to conclude that students should **not** enagage in a special function/role within the proletariat and should only take up the same means as other proletarians who engage in manual labour. I think this is a flawed conception.   \nI understand that the university is a colonial entitty and have personally experienced many push backs in pursuing radical studies. Can't students use their knowledge to enrich the understanding of the current events and dilemmas autnomous from the universities, and thus, truly serve the masses?\n\nDoes any of you have experience in conducting research that is thoroughly in service of popular struggle and revolution, guided by Marxist principles? Perhaps combining multiple disciplines and non-traditional methods, and what has your experience been like to engage with mental labour in a time and place where manual work is emphasised (also rightly so for the most part) and science is by many seen as being alienated from the masses?\n\nIt would also help me tremendously if some of you could recommend some good literature on the subject. I am looking specifically for science's role in student organsing/revolution or struggle and not specifically for decolonising the university. I have read quite a lot of literature on this last subject already and have found that many scientists are still stuck with serving a colonial institution in stead of conducting research that serves the measses and popular struggle.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Autrevml1936",
            "body": "> As a Marxist, it is clear to me that students are thoroughly part of the proletariat, even when not engaging in physical labour and having priviliges that many of us do not possess.\n\n\nAre Students *thoroughly* Proletarian? From My understanding, depending on the material conditions, they are Primarily Petite Bourgeois. Which doesn't mean that we should ignore them, but that we must be principled in our interactions with them and not try and focus ourselves on the petite Bourgeoisie but focus on organizing the Proletariat. The party itself must not become Petite Bourgeois and must always focus on the Proletariat.\n\n\nAlso, you're saying that there are Proletarians who do intellectual/mental Labor when, at least in the US I have no idea of the conditions outside the US, the Petite Bourgeoisie primarily works by mental Labor, a few examples are Teachers/professors, doctors, intellectuals, lawyers, small business owners, middle and lower management, etc.\n\n\nIf you want some writings on science and it's class basis then I can recommend Dialectical Materialism and Science by Maurice Cornforth \nhttps://redstarpublishers.org/Cornforth.pdf\n\n\nBourgeois science in it's imperialist era is primarily Mechanical Materialist and Idealist.\n\n\nEdit: I realize your asking for assistance with understanding class struggle in the Sciences and this is a question that I am still trying to study. How do we act Principally and engage in class struggle, apply Two Line Struggle in Science? I'm curious about the answers other Comrades have.",
            "score": 14,
            "replies": [
                {
                    "author": "xJapsRx",
                    "body": "Thank you for your reply!\n\nI should've clarified that this is also where for me the dilemma lies. While much of the current science -as you write, in the imperialist era- serves the bourgeoisie (and further strenghtening your claim that scientists are petite bourgeois) since the university is an imperialist and colonial entity, we should strive to make science serve the proletariat and revolutionary struggle. \nIt is therefore a question about interrogating and altering class relations. But how do we do that without inadvertently strenghtening the position of the bourgeoisie and becoming elitist? Does this mean a severance of ties with university or can we still use it as an entity to our benefit until we have built something better, or will 'proletarian science perhaps only be possible when a socialist state has been established?\n\n\nI have not come across a lot of writing on this topic (let alone answers to these questions) except for 'decolonial' literature. Not to understate the importance of decolonising colonial institutions but I have not come across many authors who have outlined a situation guided by Marxist ideas.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "hedwig_kiesler",
                            "body": "> we should strive to make science serve the proletariat and revolutionary struggle\n\nWhat exactly do you have in mind? I agree that scientific literacy is important and that you may use your knowledge in certain sciences to illustrate dialectical materialism - or idealism - but it's not clear what you mean by \"make science serve,\" since we don't have control over it.\n\nIf you're interested in books about dialectical materialism, there's [Cornforth's triology](https://old.reddit.com/r/communism101/comments/y0upon/how_does_antirevisionism_help_me_a_local_activist/is07139/), and this [list](https://old.reddit.com/r/communism/comments/spwg5q/a_collection_of_introductory_texts_on_marxist/?ref=share&ref_source=link) more specifically about Marxist dialectics.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Autrevml1936",
                                    "body": "I do think Cornforth is good in earlier works but After he dropped his segment on Michurinism in later works he conceded to bourgeois science and it's Idealism.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "xJapsRx",
                                    "body": "I mean that science is inherently subjective and can be utilised by both the proletariat and bourgeoisie. Since the university is an institution from the capitalist class, much reseaerch is also imbued with bourgeois tendencies or blatantly serves capitalist needs. Therefore scientists and the broader working class should work to make science be a force to uplift/support the proletariat, especially, as has been pointed out in another comment, since a large part of academics are petite bourgeosie rather than proletarian.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "hedwig_kiesler",
                                            "body": "> science is inherently subjective\n\nWhat exactly do you mean?\n\n> make science be a force to uplift/support the proletariat\n\nThere's no science that supports the proletariat without a socialist state to enforce it. And you're directly contradicting yourself when you say \"since a large part of academics are petite bourgeosie,\" because the interests of the petite-bourgeoisie go along with capitalism and imperialism.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "xJapsRx",
                                                    "body": "So, especially when there is a minority of academics that are proletarian (which differs based on context), there should be strived for science that serves the interest of the proletariat in stead of the bourgeoisie.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "hedwig_kiesler",
                                                            "body": "I've read the comment you posted below your post. Science can serve the interests of the proletariat only if it's controlled by the interests of the proletariat, i.e. under a socialist state. Your distinction between \"academics that are proletarian\" and the others doesn't change this.\n\nYou should note that the exploitation from the third world is probably greater than you imagine, and it looks this is what the other commenters were getting at. It seems like [around 95% of OECD profits can be accounted for from the exploitation of the countries not in the OECD.](https://archive.is/5GPXL)\n\nE: This is according to Zak Cope in *Divided World, Divided Class*.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "self-replicate",
                                    "body": "How can you say we don't have control over science? Science is a social process, meaning it is made up of things people are doing, therefor humans do control what science is, how it's done and who it serves. The fact that an institution is adapted to serve capital interests does not change that reality. Moreover, many things that emerge from science as an enterprise are beneficial for the working class. \n\nTake a look at Science for the People magazine.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "elimial",
                    "body": "Seeing students primarily as petite bourgeois is a bit 1st world centric, no? Are we to label Filipino nursing students or Thai teacher trainees petite bourgeois? Surely some, and the more prestigious the school the more likely… but many more are from farming and industry communities. Even in the imperial core, most college students are first generation.\n\nI question the validity of throwing teachers automatically into a petite bourgeois role. Would a day care worker also be? Why/why not? There is a qualitative difference between a British expat English teacher in South East Asia and their local co-teacher, for example, and labeling their economic role as equivalent seems flattening at best.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Autrevml1936",
                            "body": "I say *Primarily* as that's the general Case I've seen Students being, they come from petite Bourgeois households that are capable of affording sending their children to University. Of course there are differences which is why I clarified saying my example was from the US and Idk of the conditions in Peru, Chile, Zimbabwe, etc.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "elimial",
                                    "body": "The loan system is the U.S. makes it so that virtually anyone is able to attend university despite their economic status, and frankly education status since the community college system exists to move people thru it. I don’t think that is a very telling sign of how universities and their students are as a class in other parts of the world, and specifically the third world.\n\nThats my point on treating university students as a class of their own—it ignores history outside of the imperial core and prestigious universities in the capital regions of the third world.\n\nEdit: they may be a separate class or transitory class but one qualitatively different than the petty bourgeois",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SadWeb123",
                            "body": "University students are usually petit-bourgeois, it's often the only way they can afford to spend time studying without working. Also, most universities require money to access, whether through tuition fees or prep schools to pass entrance exams. This doesn’t mean there aren’t any working-class students in universities.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "elimial",
                                    "body": "Is a student supported by their working class parents petty bourgeois because they themselves aren’t working?\n\nI’m saying it’s a bit loose with the term. Petty bourgeois were those small capitalist, such as small business owners, craftsmen, etc. Now it’s just some student who has no money of their own?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Sea_Till9977",
                                            "body": "You don't have to be a \"small capitalist\" to be petty-bourgeois, unless we take a mechanical understanding of Marxism of course.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "elimial",
                                                    "body": "No, but grouping those small capitalists with poor third world university students fails to capture the material reality of both.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sea_Till9977",
                                                            "body": "Except no one is doing that, especially because the \"small capitalist\" label itself was introduced by you. People aren't operating off that premise at all and that premise in itself is un-Marxist by every means. \n\nSecond point, is that no one is saying there aren't working class students. Maoist organisations in these nations do recognise the role of students and their importance, but they are not considered an objectively revolutionary group is what the essence of the point is (if im not characterising it incorrectly). \n\nI'm not gonna go beyond that though, because I have not done the necessary study of university students in India at the very least. The major universities with more prestige are obviously very petty-bourgeoisie (universities in which there are working class students either because of affirmative actions or for other reasons), but then you have lower level universities in less developed areas. I cannot comment on the concrete aspects of this topic.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": ">but they are not considered an objectively revolutionary group is what the essence of the point is (if im not characterising it incorrectly). \n\nI am genuinely confused as to what do you mean by them not being \"objectively revolutionary group\"? Are you referring to people here in india or the third world in particular or just as is? Because students in india are a revolutionary group even if they belong to the petty-bourgeois class. This should be abundantly clear to anyone familiar with the historical role of student orgs in our country right from Naxalbari (even Presidency students - one of the most elite universities of that era and perhaps now also - had formed armed squads). We will get back to this. \n\nFurther, how are we classifying prestigious versus non-prestigious universities? Is JNU prestigious? Is IIT prestigious? But the class character of the students in both would be different given the fee difference in both. There is also the admission process, however, which culls the non-performing (read: those who did not have the comfort to prepare for entrance exams which are based on complete rote-memorization). I am making this distinction because indian academia is in a phase of transition and the previously elite state owned universities are now becoming not so elite and while the former allowed the entry of working class students, the latter despises them thoroughly. \n\nThere is little doubt that indian academia/university system is becoming more and more restrictive to the working class. For instance, this year when i was admitted to DU, the fee for phd had been increased to 17k from 4k per annum. Keep in mind that 9k a month is boundary line between 90% of the population and the 10%. \n\nThe NEP is set to privatise whatever little was left of the state-owned universities. There are no more recruitment drives for teaching positions. Scholarships for minorities have been done away with. This is all assuming that the person has had access to schooling in the first place. \n\nInterestingly, however, according to a government report, 60.56% colleges are in rural areas. And 78.6% are private. This does posit the possibility that most university students have a petty-bourgoise background. But data is difficult to find and as such is unreliable. \n\nhttps://www.education.gov.in/sites/upload_files/mhrd/files/statistics-new/aishe_eng.pdf\n\nHaving provided some context and coming back to the question of whether students are a revolutionary group, the cpi maoist has this to say on the issue:\n\n> Students-Youth – The students are a revolutionary force. They are facing severe injustice due to the unscientific and undemocratic education system. Their future is bleak. We must organise them and build struggles for free education to all, scientific education, against the saffronisation and privatization of education, culture and history, against the cut in the budget for education and against hike in fees, for the withdrawal of higher educational institutions of foreign MNCs and for the annulment of the post-modernist syllabus and researches prepared by the imperialist/comprador ruling classes and against the New Education Policy that the Modi government brought forth transforming all these into a policy.\n\n- Changes in Relations of Production\n\nMind you, this is under the subheading of petty-bourgois class.\n\nu/Sea_Till9977",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sea_Till9977",
                                                                            "body": "I meant university students in the third world in general, but I was writing most of that with India in mind of course.\n\nI don't deny that Indian students are revolutionary, that was not my point. Rather, I don't think they are 'objectively' revolutionary as the working class is but after reading your comment I'm not comfortable defending that point, since I very well may be using the word 'objectively' wrong. Regardless, my point is that students do not become automatically revolutionary because I don't believe that their revolutionary potential is immanent. Of course this inevitably takes us into the question of \"what is the class composition of students\".\n\nOf course I am aware of the role of students in Naxalbari. Even recently universities erupted in their protests against the CAA-NRC. But is a revolutionary consciousness in the interests of students regardless of which class they come from? That is what I'm not sure about. You have progressive democratic student groups, you also have revisionist ones and then outright fascist groups like ABVP. Like you acknowledged as well, universities are becoming increasingly restrictive and only accessible to the upper classes. Of course, this does not mean they cannot be revolutionary due to their petty bourgeois status. However, the reality is university is becoming increasingly less affordable.\n\nLike I said before though, I am clearly out of my depth on this topic. The main reason I wrote my comment was because OP's sentiment that you only have to be a small capitalist to be petty bourgeois is something that is used by petty bourgeois leftists commonly to avoid any sort of self-criticism of their class. Narrow definitions of petty bourgeoisie from [Marxism.org](http://Marxism.org) do not suffice and it's usually a crutch for a lack of any concrete analysis. OP also equates elite universities with those universities that are around the capital city of a third world nation, but this isn't true especially in semi-feudal nations like India where rural universities also can be restrictive considering the inequality between landless peasants and landed classes (and castes). It's almost a common meme for petty bourgeois youth in India to say \"Im not rich im upper middle class/middle class\" for a reason.\n\nEdit: In sum, I guess intentionally or not my issue is not whether students in the third world (esp India in my case) are revolutionary or not, but whether we consider them petty bourgeois or not. I read CPI(Maoist) critique of Kobad Gandhy's book \"Fractured Freedom\" and they talk about how intellectuals that enter the revolutionary movement do so as an intellectual, for intellectual reasons. Not because they have personal experience (aka the exploitation). I guess this is what I had in mind when writing.\n\nEither way feel free to critique this whole comment.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "This thread it getting buried away from scrutiny of others. I ll reply to this in a couple of days in the biweekly thread after i read the party document on ghandy's book (which to my disgust and shame i had attempted to read a year ago - had to close it off after 10 pages).",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "elimial",
                                                                    "body": "Introduced by me only in this conversation, not in the history of Marxism.\n\n>  \nPetit-Bourgeoisie\n\n>Petit-Bourgeoisie, *lit.*, “little city-folk” – the small business people, sometimes extended to include the professional middle-class and better-off farmers.\n\n> \n\n>Petty-bourgeois\n\n>1) The class of small proprietors (for example, owners of small stores), and general handicrafts people of various types. \n\n>This group has been disappearing since the industrial revolution, as large factories or retail outlets can produce and distribute commodities faster, better, and for a cheaper price than the small proprietors. While this class is most abundant in the least industrialized regions of the world, only dwindling remnants remain in more industrialized areas. \n\n>These people are the foundation of the capitalist dream (aka “the American dream”): to start a small business and expand it into an empire. Much of capitalist growth and development comes from these people, while at the same time capitalism stamps out these people more and more with bigger and better industries that no small proprieter can compete against. Thus for the past few decades in the U.S., petty-bourgeois are given an enourmous variety of incentives, tax breaks, grants, loans, and ways to escape unscathed from a failed business.\n\n>2) Also refers to the growing group of workers whose function is management of the bourgeois apparatus. These workers do not produce commodities, but instead manage the production, distribution, and/or exchange of commodities and/or services owned by their bourgeois employers. \n\n>While these workers are a part of the [working class](https://www.marxists.org/glossary/terms/p/r.htm#proletariat) because they receive a wage and their livelihood is dependent on that wage, they are seperated from working class consciousness because they have day-to-day control, *but not ownership*, over the means of production, distribution, and exchange.\n\n  \n[https://www.marxists.org/glossary/terms/p/e.htm](https://www.marxists.org/glossary/terms/p/e.htm)\n\n  \nI fail to see how that could include university students in general. Even if you expand the definition to include those children of the petite bourgeois that would not account for the majority of the students in the 3rd world--which was my point. That this label of university students as petite bourgeois is 1st world centric. I don't deny they exist in the 3rd world, but they are the minority at the few prestigious universities usually around capital regions. Joma, for example, [would label students petty bourgeoisie](https://aklatangbayan.wordpress.com/wp-content/uploads/2013/02/stuggle_for_national_democracy_third_ed_-_book.pdf) but he operated exclusively out of these relatively rich universities around the capital. Many of these students end up going to the 1st world for education because they adhere to liberal ideology, but these are a minority of student population overall. The majority of students outside of these regions have revolutionary potential given their material conditions.\n\n>... but they are not considered an objectively revolutionary group is what the essence of the point is (if im not characterising it incorrectly).\n\nWhile I agree with this (but would use the term inherently instead, objectively many have the potential to be given their material conditions), that does not make them petite bourgeois. I am not sure if I have seen a proper analysis of the situation of 3rd world university students, but if you have please let me know. Or, if there is a more comprehensive analysis of petite bourgeois in the present day that would also be of interest.\n\n>  \nThe major universities with more prestige are obviously very petty-bourgeoisie (universities in which there are working class students either because of affirmative actions or for other reasons), but then you have lower level universities in less developed areas. I cannot comment on the concrete aspects of this topic.\n\n  \nThese universities from less developed areas contain the body of students that I work with directly, hence my frustration when labels such as petite bourgeois are thrown about in an uncritical fashion, typically by the very people who are themselves petite bourgeois (from the 3rd world or not).",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SadWeb123",
                                            "body": ">Is a student supported by their working class parents petty bourgeois because they themselves aren’t working?\n\nYes, what else could they be? Do you think the proletariat is able to sell their labor in a way that not only sustains themselves but also supports their children, allowing them to study without the need to work?\n\nYour definition of the petty bourgeoisie is outdated.\n\n>Classes are large groups of people differing from each other by the place they occupy in a historically determined system of social production, by their relation (in most cases fixed and formulated in law) to the means of production, by their role in the social organisation of labour, and, consequently, by the dimensions of the share of social wealth of which they dispose and the mode of acquiring it. Classes are groups of people one of which can appropriate the labour of another owing to the different places they occupy in a definite system of social economy.\n\nThese \"working-class\" parents are not part of the proletariat. In the imperial core, this distinction is even more pronounced due to the privileged position of the working class.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "elimial",
                                                    "body": "They are inside a family unit, which has been heavily criticized and yet remains fundamental to the continued transfer of wealth to the bourgeoisie. \n\nWhich your logic all children who do not work are petty bourgeois. Taking the students as a class on their own before they break with their family seems arbitrary. Why would the cut off be university and not secondary education?\n\nI am specifically not talking about the imperial core, more so about those students attending state institutions in the third world who come very much from proletariat families. The first generation statement was to illustrate that the idea that university is reserved for social elite is itself outdated.\n\nA jeepney driver in the Philippines who scrounges up enough to pay for the fees of the local state university for their daughter does not make that daughter petty bourgeois else the term loses any connection to the means of production.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "FinikeroRojo",
                            "body": "Is it first world centric? \n\n\"In order to strengthen further the movement of the toiling masses, it is necessary to advance the movement of women and youth. In the cities, it is necessary to give particular attention to the work among the ranks of the youth-students, teachers and government employees, which are the most concentrated and most active sectors of the petty bourgeoisie.\"\n\n - from \"on mass work\" by the communist party of the Philippines. \n\nhttps://www.massline.info/Philippines/masswork.htm\n\nYour class stand isn't entirely about how shit your job is after all  serfs are not part of the proletariat",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "elimial",
                                    "body": "Then petty-bourgeois largely becomes a catch-all. I comment on Joma’s work later, but he (and the CPP under him) began by looking at university students from the perspective of elite schools in the cities—not those in the provinces. The quote itself says as much.\n\nBut yes, your last statement is correct. I do think it’s a weak analysis that lumps together such varied economical and lived experiences as one, but maybe I’m being pedantic.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sour_Drop",
            "body": "About a month or two ago, I saw this [essay](https://newlaborpress.org/wp-content/uploads/2024/06/final_student_movement_class_line.pdf) titled \"For a Class Line in the Student Movement\" posted to this subreddit that pretty much addresses the role of students in the communist movement. For one, on what basis do you see students as \"thoroughly proletarian?\" Even a liberal can see that there are clearly some rich and poor students.",
            "score": 5,
            "replies": [
                {
                    "author": "xJapsRx",
                    "body": "I should've addressed this properly, sorry for the confusion. I mean that imo students an sich aren't bourgeoisie. For sure there are vast differences but as far as I understand academics can be proletariat, although the university as a capitalist institution often tries to prevent this.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Sour_Drop",
                            "body": "\"Not bourgeoisie\" doesn't mean \"proletarian.\" And there are obviously some students whose parents are members of the bourgeoisie, making them bourgeois too. There are even some students who are \"entrepreneurs\" (i.e. petty bourgeois). But more numerous than these cases are students and professors who are *labor aristocrats*. They might sell their labor-power, but that doesn't mean they are exploited like the proletariat. Specifically, because of imperialism, they earn more than the value of the labor they produce. Because of this, they have interests that align more closely with the imperialist bourgeoisie than the proletariat.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "xJapsRx",
                                    "body": "I must say that I have based my analysis on the Dutch context. The cases where academics are actually labour aristocrats are here very few and by far most students are part of the proletariat since they sell their labour to be able to attend college/university and be housed. The Netherlands also has the highest percentage of students working part-time jobs (70%) and \"lower-level\" academics like PHDs and lecturers often are underpaid with temporary contracts.   \nLike you write, there are even 'entrepreneurs' among students, but this does not mean that 'student' as a descriptor is inherently bourgeois. As I see now, it depends on contextual and case-by case bases.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Sour_Drop",
                                            "body": "I'm not insinuating that \"student\" is an inherently bourgeois category. But you claimed students are \"thoroughly a part of the proletariat\" without saying anything further about the context in which your claim applies to. Besides that, while \"student\" is not an inherently *bourgeois* category, it isn't inherently a *proletarian* one or some other class, either. \"Student\" is not a class in the sense of Marxism to begin with. One must conduct a thorough scientific investigation to determine which students are proletarian and which are not. I don't know any more about the Dutch context, so hopefully someone else more knowledgeable can give a substantive reply.\n\nUnrelatedly, something I caught just now is that you say that students are \"thoroughly part of the proletariat\" which means \"some of us\" conclude that \"that students should not enagage (sic) in a special function/role within the proletariat and should only take up the same means as other proletarians who engage in manual labour. I think this is a flawed conception...Can't students use their knowledge to enrich the understanding of the current events and dilemmas autnomous (sic) from the universities, and thus, truly serve the masses?\" Why? The article I linked, while written in the U.S. context, is applicable to you, too. Why *should* students have a special role in the communist movement?",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "backstrokerjc",
            "body": "Check out Science for the People (https://scienceforthepeople.org/) — a publication focusing on the role of science and scientists in the fight for liberation. They had a special issue a couple years ago called LABor which specifically emphasized the role of academic student workers in the labor movement, which may be of particular interest.",
            "score": 2,
            "replies": []
        },
        {
            "author": "drunkendwarfo",
            "body": "Outside of the wrong statement that students arent petit bourgeois. Gramci has quite an interesting view in the role of intelectuals rising the class counciousnes of the class they come from(in this case refering to organic intelectuals from the proletariat) wich in return gives birth to many more organic intelectuals that come from the proletariat. Also vey through analisis in the formation and organization of the party in a given context",
            "score": 2,
            "replies": []
        },
        {
            "author": "xJapsRx",
            "body": "It seems like there are multiple comments that see either 'students 'or the result of their mental labour as 'proletarian', 'petite-bourgeoisie' or 'bourgeoisie'. \n\nIt seems useful to make a distinction between, on the one hand, the student body and academics, which -as multiple comrades have pointed out-  can on a contextual and case-by-case bases be part of the proletarian, petite-bourgeoisie or bourgeoisie (or a separate catgeory, something in-between).\n\nOn the other hand, there is the result of the mental labour, namely, scientific research/studies. This is what my question is mainly about. Research seems to currently serve more often than not the purpose of the capitalists, since the university is a capitalist institution. Since academics can be proletarian, the question is how science can **serve** the proletariat in stead of the capitalist class.",
            "score": 1,
            "replies": [
                {
                    "author": "SadWeb123",
                    "body": ">academics can be proletarian\n\nI just can’t see how academics “have nothing else to lose but their chains.” How can they afford to dedicate their time to research and receive payment for it? What allowed them to enter and sustain a career in this field? It’s evident that academia functions as a petit-bourgeois/labor aristocrat profession.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "self-replicate",
                            "body": "Science has been proletarianizing for quite some time. I work as a scientist and for many of us, conception and execution are completely separated. We perform scientific activity under the direction of a corporation. Even lead academic scientists (heads of labs) lose autonomy of project conception because of the interest of Capital via grant cycles, though, their case is far more petit bourgeois. I would say almost any scientist that isn't the head of a lab is more prole than not. Still, it is an extremely privileged position.\n\nhttps://www.philosophy-world-democracy.org/articles-1/the-proletarianization-of-biological-thought",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "self-replicate",
            "body": "Science has been proletarianizing for quite some time. I work as a scientist and for many of us, conception and execution are completely separated. We perform scientific activity under the direction of a corporation. Even lead academic scientists (heads of labs) lose autonomy of project conception because of the interest of Capital via grant cycles, though, their case is far more petit bourgeois. I would say almost any scientist that isn't the head of a lab is more prole than not.\n\n https://www.philosophy-world-democracy.org/articles-1/the-proletarianization-of-biological-thought",
            "score": 1,
            "replies": []
        },
        {
            "author": "self-replicate",
            "body": "Read the Dialectical Biologist by Richard Lewontin and Richard Levin or JD Bernal's Science in History. Marx was an avid reader of scientific publications in his day. They don't call it scientific socialism for nothing!",
            "score": 0,
            "replies": [
                {
                    "author": "Autrevml1936",
                    "body": "Richard Lewontin and Levin do have some concessions to Michurinism but they still adhere to Bourgeois science and the DNA theory of heredity. I'd recommend reading directly from Lysenko and other Michurinist's and also Maurice Cornforths stuff before he fell to bourgeois science and rejected the correctness of Michurinism. Lewontin's \"Ideology in biology\" lecture does point out ideology in science in a similar manner to Lysenko though.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}