{
    "title": "Readings on the political-administrative system of the USSR",
    "author": "Raphoyz",
    "subreddit": "communism",
    "rank": 300,
    "score": 10,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/communism/comments/1fqcd01/readings_on_the_politicaladministrative_system_of/",
    "id": "1fqcd01",
    "selftext": "I've been struggling to find good material on the political-administrative system of the USSR (in english or portuguese).\n\nI know it changed over time, but I wanted a ruff notion of its basis and practical implications (preferably on its first decades) and thought I could find some answers here.\n\n  \nThanks in advance!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrawBicycleThief",
            "body": "SOVIET COMMUNISM: A NEW CIVILISATION. BY SIDNEY AND BEATRICE WEBB. \nChapter V\nhttps://archive.org/details/in.ernet.dli.2015.217893",
            "score": 7,
            "replies": [
                {
                    "author": "Raphoyz",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Autrevml1936",
            "body": "I have a mix of things, some from the Stalin Era and some the Revisionist Era(1956 and after). I'll give you stuff about the Stalin era mainly.\n\n\nFIVE-YEAR PLAN OF THE USSR, 1946-1950\nhttp://www.directdemocracy4u.uk/dd4en-resources/soviet_library/1943-1958/1946_Five_Year_Plan_1946_50_Soviet_News.pdf\n\n\n\"Soviet Economy During The Second World War\", 1949\nhttp://www.directdemocracy4u.uk/dd4en-resources/soviet_library/1943-1958/1949_Soviet_Economy_During_Second_World_War_N_A_Voznesensky.pdf\n\n\n“USSR Builds for Peace”, by N. A. Bulganin, on the 33rd anniversary of the October Revolution, (London: Soviet News, 1950)\nhttp://www.bannedthought.net/USSR/Economy-SocialistEra/USSR-BuildsForPeace-N.A.Bulganin-SovietNews-1950-OCR-sm.pdf\n\n\n“Fulfilment of the State Plan for 1949”, Communique of the Central Statistical Administration of the U.S.S.R. Council of Ministers, (London: Soviet News, 1950)\nhttp://www.bannedthought.net/USSR/Economy-SocialistEra/FulfilmentOfTheUSSR-StatePlanFor1949-OCR.pdf\n\n\n“Soviet Economic Development Since 1917”, by Maurice Dobb, (1st edition: 1948)\nhttp://www.bannedthought.net/USSR/Economy-SocialistEra/M.Dobb-SovietEconomicDevelopmentSince1917-1948.pdf\n\n\n“Industry in the U.S.S.R.”, by E. Lokshin, (Moscow: FLPH, 1948)\nhttp://www.bannedthought.net/USSR/Economy-SocialistEra/IndustryInTheUSSR-Lokshin-1948.pdf\n\n\n“The Growing Prosperity of the Soviet Union”, by N. Voznesensky, (NY: Workers Library Publishers, May 1941)\nhttp://www.bannedthought.net/USSR/Economy-SocialistEra/TheGrowingProsperityOfTheSovietUnion-Voznesensky-1941.pdf\n\n\n“The Moscow Subway”, by V. Abakumov, (Moscow: FLPH, 1939)\nhttp://www.bannedthought.net/USSR/Economy-SocialistEra/TheMoscowSubway-Abakumov-1939.pdf\n\n\n\n\nFor the Revisionist Capitalist Era:\n\n\n**THE RESTORATION OF CAPITALISM IN THE SOVIET UNION** By w. Bland\nhttps://www.revolutionarydemocracy.org/archive/BlandRestoration.pdf\n\n\n**Restoration of Capitalism in the USSR** by Nicolas Martin(need to login on IA and borrow the book)\nhttps://archive.org/details/restorationofcap0000unse/mode/2up\n\n\n**How the Soviet economy works: interview with A. I. Mikoyan**\nhttps://archive.org/details/PerloSovietEconomy\n\n\n\n\nThis is mainly a collection of works on the Soviet economy which I've collected(some I've read others I haven't due to focusing on DiaMat and PolEcon Study). I do have stuff on Soviet Democracy and Some Soviet Science(Primarily Michurinism) and \"Environmentalism\"(in quotes as what we call \"Environmentalism\" is a more recent development in ideas which wasn't really present in the Lenin and Stalin Era) and Education if you need it.",
            "score": 7,
            "replies": [
                {
                    "author": "Raphoyz",
                    "body": "Thank you very much!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "prolepoika",
            "body": "soviet democracy by pat sloan is essential",
            "score": 4,
            "replies": [
                {
                    "author": "Raphoyz",
                    "body": "Thank you! Reading it righ now.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}