{
    "title": "Is there a good English print edition of The German Ideology?",
    "author": "thesimonleeee",
    "subreddit": "communism",
    "rank": 277,
    "score": 8,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/communism/comments/1g4iyxy/is_there_a_good_english_print_edition_of_the/",
    "id": "1g4iyxy",
    "selftext": "I want The German Ideology in print to read, and I'm curious if there are any good English translations out there people are aware of\n\nUnabridged if possible (but also interested in good abridged versions if not)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Autrevml1936",
            "body": "I'm not sure about the Quality of the FLP([Foreign Languages Press](https://foreignlanguages.press/)) physical books as I've only read their PDFs but I think their PDF of Marx's German Ideology is Good.",
            "score": 7,
            "replies": [
                {
                    "author": "vomit_blues",
                    "body": "If I’m not mistaken, their print excludes the sections on Bauer and Stirner, doesn’t it?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Autrevml1936",
                            "body": "i'm Looking back at their PDF and comparing it to what's on MIA(missing the section on Bruno) it does appear to be missing the sections on Stirner and Bauer.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lurkhardur",
            "body": "I have [this one](https://www.amazon.com/German-Ideology-including-Feuerbach-Philosophy/dp/1573922587/ref=sr_1_1?crid=1VOKBMRBW9ZOC&dib=eyJ2IjoiMSJ9.acQv3Gc9RJG5L35l1jRqBhEZAS-bEOJDu63qkFOvehHMtf2tHzdRKIX2MxkKvW75mDZabc7JnDqUfHM6slPwlXrTB4Cu2mXZxONDVKYwgLhofZ35lW6JLuv9DA8vVGaQQn5N4XdD16Rp4S2yn_8zegfYlXr_JYKL4YYcM6mmM0OWinDC9xrQNKyL0KMeZ1XHMhM3VqDnMTBy8WFv8xoP5JiIZ_fHUyZ_5bEOvkZI080.jrJct7wiucvsQ_WM0WFXMRGePZVtdMWUaLqxHfXB5VI&dib_tag=se&keywords=german+ideology&qid=1729040434&sprefix=german+ideology%2Caps%2C263&sr=8-1), it's unabridged",
            "score": 4,
            "replies": []
        },
        {
            "author": "Imaginary-Mark2113",
            "body": "C J Arthur German Ideology Student Edition is excellent as an introduction and the translation in the Marx Engels Collected  Works Volume 5 is the best so far.",
            "score": 2,
            "replies": []
        }
    ]
}