{
    "title": "Yoon Suk Yeol Declares Martial Law in South Korea. Aims to Eradicate the Opposition's “Shameless Pro-North Anti-State Forces.”",
    "author": "Waosvavbzirarnsa",
    "subreddit": "communism",
    "rank": 201,
    "score": 79,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/communism/comments/1h5prsw/yoon_suk_yeol_declares_martial_law_in_south_korea/",
    "id": "1h5prsw",
    "selftext": "Just happened half an hour ago. Developing story.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DashtheRed",
            "body": "https://www.theguardian.com/world/live/2024/dec/03/south-korea-declares-emergency-martial-law-yoon-suk-yeol-north-korea-latest-updates\n\n>The surprise move comes as Yoon Suk-Yeol’s People Power Party and the main opposition Democratic Party continue to bicker over next year’s budget bill. Opposition MPs last week approved a significantly downsized budget plan through a parliamentary committee.\n\n>The opposition has slashed approximately 4.1tn won ($2.8bn) from Yoon’s proposed 677tn won budget plan, cutting the government’s reserve fund and activity budgets for Yoon’s office, the prosecution, police and the state audit agency.\n\n>“Our National Assembly has become a haven for criminals, a den of legislative dictatorship that seeks to paralyse the judicial and administrative systems and overturn our liberal democratic order,” Yoon said.\n\n>Yoon, a former prosecutor, accused opposition lawmakers of cutting “all key budgets essential to the nation’s core functions, such as combatting drug crimes and maintaining public security... turning the country into a drug haven and a state of public safety chaos.”\n\n>The president went on to label the opposition, which holds a majority in the 300-member parliament, as “anti-state forces intent on overthrowing the regime”.\n\n>Yoon described the imposition of martial law as “inevitable to guarantee the continuity of a liberal South Korea,” adding that it would not impact the country’s foreign policy.\n\n>“I will restore the country to normalcy by getting rid of anti-state forces as soon as possible,” he said, without elaborating further other than the martial law in place.\n\n>He described the current situation as South Korea “on the verge of collapse, with the national assembly acting as a monster intent on bringing down liberal democracy”.\n\n...\n\n>Following the martial law announcement, South Korea’s military proclaimed that parliament and other political gatherings that could cause “social confusion” would be suspended, according to Yonhap news agency, which is reporting that people who violate martial law can be arrested without warrant.\n\n...\n\n>“President Yoon declared emergency martial law for no reason,” Lee Jae-myung, who has branded the declaration unconstitutional, said. “Tanks, armored vehicles and soldiers with guns and swords will soon control the country.” The last time martial law was declared in South Korea was in 1979, after the assassination of the then South Korean dictator Park Chung-hee, who had seized power in a military coup in 1961.\n\n...\n\n>South Korea’s parliament, with 190 of its 300 members present, just passed a motion requiring the martial law declared by President Yoon Suk Yeol to be lifted.\n\n>All 190 lawmakers present voted to lift the measure...\n\n...\n\n>Update: South Korean military officials have said martial law will remain in effect until lifted by President Yoon Suk Yeol, according to local broadcaster YTN, other local media reports and Agence France-Presse, despite the parliament’s vote to lift it.",
            "score": 16,
            "replies": [
                {
                    "author": "None",
                    "body": "Do you think there'll be a military coup or will Yoon just go to prison for this?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "DashtheRed",
                            "body": "Based on how it's going so far, I'd say the latter, since this appears to be deeply unpopular and has little support anywhere (edit: except the military, apparently).  But I'm also not as well versed in the current politics of South Korea to cut to the essence of what is happening -- obviously I'm rather skeptical that the Democrat opposition are secretly DPRK supporters or whatever, but I don't have much deep insight beyond the surface observations at this moment.\n\nedit: The liberal narrative of it being some corrupt old man trying to hold onto power doesn't seem like a sufficient explanation for me either.  I suspect that is true, but not the full explanation for what is happening.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Now it's confirmed that the president will lift martial law, and he is most likely to going to be impeached afterwards.\n\nI think the worst part about this whole farce is that South Korean liberals are going to pat themselves on the back for how bravely they defended their ''democracy'' by voting in their assembly. The only reason why there was no coup is because the South Korean military wasn't bothered to commit to one, and because they weren't ordered to do so by the US",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HappyHandel",
            "body": "PDP is currently protesting in front of the US Embassy (but what else is new). Has the WPK released a statement?",
            "score": 10,
            "replies": [
                {
                    "author": "DaalKulak",
                    "body": "Just some news report from them is what I've seen so far:\n\n>Pyongyang, December 2 (KCNA) -- Massive protests are going on in the puppet ROK to impeach puppet Yoon Suk Yeol who is engrossed in all sorts of dictatorship and arbitrary practices while creating the war and security crisis with the backing of the U.S.\n\n>More than 100 000 people from all walks of life, including workers, peasants and youth and students, took part in the grand candlelight march, the \"People's Action Day\" rally and civic march held in Seoul on November 30 in demand of the resignation of Yoon Suk Yeol and the special investigation into Kim Kon Hui.\n\n>The 117th candlelight rally and demonstration sponsored by the Candlelight Action was held on the theme of \"Let us overthrow Yoon Suk Yeol who is protecting Kim Kon Hui and intervening in Ukraine!\"\n\n>The participants in the rally and demonstration burst out their surging anger at such crimes of puppet Yoon as creating war crisis, seeking sycophantic and humiliating diplomacy and abusing the veto power, chanting a slogan \"Let us overthrow traitor Yoon Suk Yeol!\"\n\n>As revealed through the interference in the election rigging, Yoon took the power through the red herring in the past presidential election, they said, adding that the Yoon regime was the one which should not have been emerged as it has been engrossed in lies and fabrication from the beginning.\n\n>Recalling that 4 300 professors from 85 universities have taken part in campaign for declaring the situation as of November 29 amid the brisk campaign for the resignation of Yoon at all universities, speakers called upon all professors, intellectuals, religionists, merchants and other people at all social standings to join the campaign in protest against anti-peace, anti-democracy and prosecution dictatorship.\n\n>At the end of the candlelight rally and demonstration, the \"5th People's Action Day\" rally was held under the sponsorship of the Minju Party to denounce puppet Yoon Suk Yeol for peddling in the state affair and demand a special investigation into Kim Kon Hui.\n\n>At the rally attended by 100 000 people from all walks of life, the representative of the Minju Party and lawmakers from opposition parties revealed and condemned the crimes committed by Yoon who has been impatient to intervene in the Ukrainian war and vetoing again a draft special investigation into the irregularities and corruption of Kim Kon Hui.\n\n>Then the 3rd civic rally co-sponsored by opposition parties, including the Minju Party, and the \"national emergency action denying the veto\" was held to demand the special investigation into Kim Kon Hui and probe the peddling in state affair and deny Yoon.\n\n>The national emergency action said in a statement on the same day that the hideous power rejecting the will of the people and reigning over them will surely collapse, adding that they will surely oust Yoon by the efforts of the people.\n\n>The puppet media reported about the struggle under the titles of \"Shouts raised in Seoul in demand of 'Yoon Suk Yeol's resignation' and 'special investigation into Kim Kon Hui'\", \"117th grant candlelight demonstration-5th People's Action Day-civic march\" and \"100 000 citizens struggle for Yoon's resignation in spite of heavy snowfall.\" -0-\n\n[http://kcna.kp/en/article/q/389b4b6d4d92a66d210125543c87c1d688c7fee5bf919ed10c8a5c1dd6f0bc10.kcmsf](http://kcna.kp/en/article/q/389b4b6d4d92a66d210125543c87c1d688c7fee5bf919ed10c8a5c1dd6f0bc10.kcmsf)",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "leftist-dictator2024",
            "body": "We need a united socialist korean republic which rejects fascism and capitalism.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jwc12345678",
            "body": "If This Goes Through South Korea Will Become A Fascist State",
            "score": 1,
            "replies": [
                {
                    "author": "doc7_s",
                    "body": "Always has been.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "jwc12345678",
                            "body": "Yes fair point",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}