{
    "title": "On the Question of Women’s Liberation and Class Struggle",
    "author": "theaceofshadows",
    "subreddit": "communism",
    "rank": 169,
    "score": 8,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 21,
    "url": "https://nazariyamagazine.in/2024/12/12/on-the-question-of-womens-liberation-and-class-struggle-a-write-up-on-the-sexual-harassment-case-and-subsequent-call-out-of-nazariya-magazine/",
    "id": "1hg3a8t",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Particular-Hunter586",
            "body": "Whether or not Nazariya Magazine and the organizations behind it handled the case of relationship sexual abuse well, this is a misleading title and I'm honestly not sure what anyone not directly affiliated with the magazine could get out of it. u/CharuMajumdarsGhost and u/Sea_Till9977 might have more to say on it, having discussed the allegations and response previously on this subreddit, but I'm curious whether you posted it to spark discussion or because you feel it contains something useful for users on here.\n\nE: For the record I obviously (as a Marxist) agree with the things being said in the article about \"free sex\" not really being free, and about class solidarity and class politics being primary over gender wars.",
            "score": 2,
            "replies": [
                {
                    "author": "theaceofshadows",
                    "body": "I entirely disagree with the positions taken by Sea Till and am also appalled by the overall understanding about this matter that has been accepted here. The entire issue is of relevance to the Maoist politics in India and is a historical repeat of the much bigger Democratic Students Union and Umar Khalid split. I posted it here because it is a debate rife within the Indian Maoist movement. The original DSU split led to the end of the most popular Maoist student organisation which set the bar for student politics in North India for 3 decades and not seeing broad relevance of reiterating the concept of rectification within communist organisations in a time where cancel culture is prominent is ignorance of practical issues faced by communist organisations. It is around this time period that the Maoist Popular Women’s Movement in Brazil also wrote about the same issues. Maoist organisations in the advanced capitalist countries are already neck deep in post modernist thought, particularly in relation to their positions in terms of LGBT people. Though I’m not surprised given the dearth of organisational questions discussed in this place, no actual communist would think that these questions are settled and not relevant to advancing the communist movement. \n\nAs for my disagreements with the analysis by Sea Till and the other poster,\n\n1. That organisation has continuously said the man has already left their organisation, how will they expel someone already not part of their organisation? I’m not sure if the facts of this matter were discerned by the organisation’s statements or by Instagram comments.\n\n2. India houses the largest red power in the world and the most cohesive anti-communist counter insurgency is being waged by the Indian state against Maoists. Two organisations which have been at the forefront of countering the anti communist war of the state (beyond the PLGA,  Moolwasi Bachao Manch and the Janathana Sarkars in the areas of red power) have brought up the role of the state in this debate and somehow we are still doubting the organisations over the individual who has resorted to threatening to filing a case against the organisations, including FACAM in this matter which is the only united front in the country continuously opposing Samadhan Prahar and Surajkund Scheme in the country for the last 3 years. In a time when no news from the Maoist side is allowed to come out, Nazariya is literally the only open magazine that continuously upholds MLM. I have engaged with the communist movement from the days before DSU split. DSU’s blogspot was the sole legal outlet which would educate the world of the Maoist movement in India during that time and after its end, apart from the yearly publications of Towards a New Dawn, not a single Maoist media outlet was allowed to exist in that decade between DSU and Nazariya. At the same time, SAMADHAN-Prahar and Surajkund Offensive came up and there was no front to deal with these developing offensives apart from the comrades embroiled in class war at the frontlines. DSU’s remaining leaders were either jailed (Hem Mishra) or became inactive. The state used this period of radio silence to make great advancements. Other united fronts like CDRO and PUDR are popularly known to be infiltrated by state agents and became inactive until FACAM was formed, the bulk of the efforts coming from the students in Delhi. Now when these same students are charging another to be a state agent, we as communists are astonishingly casting doubts over these organisations?\n\nI only posted this out of the organisational value of the experience of Nazariya, which has thankfully not become defunct like DSU.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Sea_Till9977",
                            "body": "1: There is no acceptance of a narrative so far, since I haven't accepted my own understanding of the situation yet. Also, this is not your fault, but I have been messaging the other poster privately about this so all my thoughts are not necessarily on the sub itself.\n\n2: I might remember wrongly here, but I did not imply or state that the question of sexual relations of communists is not a discussion worth having. In fact my whole critique of Nazariya was based on the fact that--based on my previous reading of MIM, your answer to me about sexual opportunism and DSU some time ago, and Nazariya's previous articles--their correct statements about sex, ideology, etc did not align with how they handled the case of sexual assault. Like ParticularHunter said, because a group is facing state repression doesn't mean I cannot critique them. Although, I said smth about not seeing a point of Nazariya continuing, which I do not believe in anymore. The unprincipled reason for my change of mind is because of instagram comments implying Nazariya was just using marxist jargon in their previous articles and what not. I realised liberalism has to be combatted at all costs.\n\n3: my public comments on the topic were all based on statements and observations previous to the article you posted, which was sent to me privately anyway few days ago. Also, I did read Nazariya's statements, and I was unhappy that Mukundan was not expelled until there was a public call out (he moved on from the organisation is what was written). However, as I am writing this, I am realising that this also has to do with my lack of understanding of rectification. At least for now, I do still stand by my disagreement with how Mukundan's punishment was handled. Furthermore, I only knew he was expelled when reading the new article. I am operating based on a limited knowledge of the facts. I did misunderstand the facts available though. Again, I only wrote very basic thoughts of the situation twice. Not an excuse but yeah.\n\n4:I did not know anything about threats of cases, legal charges, or the involvement of FACAM in this at all. Nor do I know anything about the response of such organisations. My views had nothing to do with that. I never casted doubts on other organisations talking about state collaboration, but perhaps this has to do with the other poster.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "theaceofshadows",
                                    "body": "I think I should’ve been more clear on my comments, Particular Hunter edited their comment so the context is also gone but I was mostly addressing their points and not yours. I only addressed you in one point, which is on the facts of the matter. I’ll edit this comment to elaborate and try to respond in case there are still anymore points of difference left at a later time, if that is okay.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sea_Till9977",
                                            "body": "sure",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Particular-Hunter586",
                            "body": ">the overall understanding about this matter that has been accepted here\n\nWhat do you mean by this? If by \"this matter\" you mean specifically this incident with Nazariya Magazine, I don't think that there's any \"understanding\" that's been \"accepted here\", only a couple cursory comments. Or do you mean the question of sexual abuse in communist organizations? Of communist discipline in sex and relationships in semifeudal vs. capitalist countries? Of LGBT issues (though I don't really see how that relates to the article)? I think I'm misunderstanding you.\n\nI do agree that Nazariya Magazine has been an important resource, by virtue of upholding MLM. But I don't think that casting doubt over an organization's practices, specifically with regards to internal discipline and patriarchal practices, is something that should be withheld just because an organization is doing important work and facing state repression.\n\nI also think that this article was a regression compared to Nazariya's earlier work on LGBT issues (it's totally correct in saying that sexuality like all other aspects of life is subject to transformation and contingent on the base and superstructure of society, but that section both felt out of place and disconnected, and also didn't have any novel analysis or throughline to the question of class struggle besides \"this is why homosexuality was suppressed, this is how that might change\".) Though that might just be because that's outside the scope of the article.\n\nI'm also interested in how Nazariya Magazine and its central organizing committee squares its principled and developed line on LGBT struggles with an organizational ban on premarital sex given that same-sex marriage is not legal in India, though this could definitely be a lack of cultural perspective on my part. (Not that I expect you to have an answer to this necessarily, since it seems like something internal to their organization, just putting it out as something odd to me.)",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "theaceofshadows",
                                    "body": "I meant specifically this incident and I’m assuming acceptance based on the fact that no one has contested the narratives posited in the few comments. I’m not saying state repression=great organization, I’m saying that casting doubts over that organisation’s practice based on incorrect facts as well as casting doubts over multiple organisations labelling a person as a state corroborater amidst the most intense period of a historic people’s war lacks perspective. Though I noticed you edited that part out of your comment so I’ll not stress a lot on it.\n\nIt is interesting that the magazine upholds the line on premarital relations. I don’t think the position on this subject is very well known outside of the Indian communist movement. Both the Maoist Communist Centre of India and CPI ML People’s War had differing lines on conjugal relations. MCCI held the position that members of the MCCI were not to marry at all/ not form sexual relations between each other. This is a line common among some militant organisations, the two other prominent examples are LTTE and MIM. MIM’s line on this is a replica of MCCI’s line. PWG on the other hand held the line that a communist party has the responsibility of establishing the new culture and new practices of the new society within itself during the course of class struggle and cannot postpone these questions to after completion of NDR. Unlike the MCCI, PWG had work in more diverse section of society, with their work among the petite bourgeoisie being a hallmark for the expansion of the Maoist movement in India. MCCI didn’t have much work among the petite bourgeoisie and focused primarily on the proletariat and peasantry (particularly poor, middle and landless). PWG though, held the analysis that communist party members were not to engage in premarital sexual relations. PWG also didn’t mean marriage in the legal sense but in the sense of a social declaration. In semi-feudal society, working class and peasant women have struggled hard against polygamy as well as exploitative sexual relations where extra economic ties such as caste compel men to hide these relations from society in fear of honour killings and caste based violence. It was also to counter the dominantly sexual nature of romantic relations and urged members to form comradely and romantic relations on the lines that Kollontai talks about in her writings on love, over first forming sexual relations. PWG thus forbade all its members from engaging in premarital relations considering that people in their organisations first had to commit to their partners and be ready to uphold their relations in society, in public, to be ready to fight to democratise marriage and sexual relations in that context. During the 2004 unity process between PWG and MCCI when they merged into one party, it was PWG’s line that was held as correct. This was the line for the members of the party only though, so I’m not sure why Nazariya magazine members also practiced this line.\n\nI haven’t read much on their line on LGBT issues so I can’t comment much on this subject, though I don’t think this article or the PWG position contradicts what the general secretary of the revolutionary party has said on this subject.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Particular-Hunter586",
                                            "body": ">This is a line common among some militant organisations, the two other prominent examples are LTTE and MIM\n\nThat's not MIM line at all, at least as far as I can tell from the documents that they have available and what they've written on sexuality. MIM proper upheld for most of their time that cadre could not have relationships with the central command, no cadre members could have relationships with recruits, and all sexual relationships must be both declared to the party and monogamous; when MIM moved to a cell-based model, this became something that was only strongly encouraged for members (not required by organizational discipline) and required for the central command. MIM(Prisons), based on what I can tell from their website and their study pack on how MIM(P) functions, does not maintain that line (but still recommends monogamy as best practices).\n\n\"Marital relations\" referring to a social declaration of monogamy and publicity rather than a legal marriage makes a lot of sense, I was wondering if that's what I was missing when I said something about cultural context. Do you know if this is the case with Nazariya magazine as well? I had assumed not, since if I remember correctly, in one of their statements regarding Ramnit and Mukundan, they talked about the importance of marriage in the eyes of the law.\n\nE: Also calling MIM a \"militant organization\" is a stretch, and not true unless you mean it in the sense of \"militant atheist\"/\"militant feminist\" rather than militarized in any way. MIM rejected the necessity of militarization for a communist party in the First World at the current time.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "S_hloka",
            "body": "Nazariya???? LMAO They slut shamed a SA victim. They have no right to be speaking on women's liberation, they can't implement their own ideas.",
            "score": 0,
            "replies": [
                {
                    "author": "PretentiousnPretty",
                    "body": "This is complete liberalism and not a Communist critique. \n\nIf you can argue against the party line of non pre-marital sex and their usage of the word \"sexual opportunism,\" do it and let it be shown openly so that the organization can reflect and self-criticize.\n\nIf you cannot, \"no investigation, no right to speak.\"\n\n[This] (https://nazariyamagazine.in/2024/12/18/the-communist-outlook-on-marriage-family-and-sex-reiterating-communist-morality-to-immoral-communists/) is their latest article about this topic, and I found myself shocked by their principled stances and strength of ideology in MLM. \n\nDespite the harshness and hardline of their stance, given India's semi-colonial, semi-feudal society, I think their line is completely right. \n\nI know that I personally would have folded under such pressure, and I think effort should be given to critique their line on Marxist terms if you wish to critique it.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "S_hloka",
                            "body": "1) I don't owe Party a criticism on a Reddit comment section. \n\n2) Their criticism has already happened, many Communists and Communist organisations have already criticised them and called them out. I'm literally a Communist from India, who is also **connected to** Com Ramnit and has also followed this case from the beginning. Literally organisations including SFPD and Collective have called them out. Not only Nazariya but also bsCEM, for collaborating with Nazariya. \n\nWho you think you're talking to? This magazine's initial response to the case was outrightly posting a detailed description of Com Ramnit SA, then they took that post down, then they posted a slut-shamey \"apology\". I've been following all of that, I'm not new to this. They never reflected. I'm literally speaking from where it has happened. Saying that being against their slut shamey comments on Com Ramnit is \"liberalism\" shows your own lack of ideological commitment, not mine.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "theaceofshadows",
                                    "body": "Collective is an anarcho-syndicalist organisation, historical known for perpetuating the thesis of “semi-feudal patriarchy” during the DSU debate a decade ago. What ideological positions does this SfPD organization have? They are an organization born from call out culture given their split with Liberation group’s student organization. What an incoherently liberal response under the pretensions of Marxism.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "S_hloka",
                                            "body": "What's \"incoherent\" about following the exact actions of the organisation and criticising them for that? Why did Nazariya post a detailed description of Com Ramnit's rape only to later delete it (they knew it was wrong)? Why did they slut shame her in the second \"apology\"? Why is any one of these people comfortable tackling the issue of SA like this? All you can say is that the criticism is \"liberal\", but what's Marxist about slut shaming and victim-blaming? Com Ramnit was one of the main founding people of Nazariya, she's not some random woman looking to gain favours. What basis is there to accusing her of \"sexual opportunism\"?\n\nIn fact, if Liberals can criticise you on the basis of slut shaming, then it's shame on YOU. They have lower standards and a higher tolerance for bullshit than Marxists.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "theaceofshadows",
                                                    "body": "You are continuously avoiding the ideological arguments to talk of facts detached from those ideological points. What critique have you given which is not “victim-blaming” which actually engages with the stance of the organization.\n\nAs for this “detailed description,” I have followed this matter enough to know that this is nothing but the very same nonsense reiterated from the Instagram comments. They posted the investigation report that they conducted after the woman alleged first alleged sexual assault, changed the narrative to rape and claimed the organization had failed to act upon it. They also said in their statement that this report was available to those who want evidence of the same. It was this SfPD organization that was the first to demand this report. The same organization then claimed the report didn’t have dates but somehow expected the report to not have facts of the matter? What stupidity is this. At the same time, who cares if she was founding member or not a new cadre? By that logic, Lenin should have never outed Plekhanov. Feudal bureaucratic nonsense at best. Funnily though, I became curious by your comment and went to Nazariya’s earliest article. Their first articles appeared in October 2022. This person has not written a single article for this group until 6 months later.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "S_hloka",
                                                                    "body": "(cont...)\n\n>\"Hence in a class society, particularly in a semi-colonial, semi-feudal society, neither consent nor love can be free and therefore, neither can sex be free. All of these are the methods of the landlord and comprador bourgeoisie which are subservient to imperialism and imperialist cultural logic in the market.\"\n\n>\"This concept of ideological love/sex/relationships will be picked apart by the petty bourgeoisie and reactionaries, who in order to justify their own engagement in non-ideological sex, will call this perspective feudal and undemocratic. They will  even go as far as trying to claim that revolutionary organisations are arguing for celibacy when they are propagating the need for ideological sex.\"\n\nOkay, I could use the same logic and validate MacKinnon's early hypothesis that sex under Patriarchy can never be fully consensual because of the power that men occupy. So, with that logic, what should we do? If men ought to occupy the position of rapists, what does that leave out for a woman seeking egalitarian relationships? She'll never have that, because again, men have Patriarchal power even if they're nice because they ultimately do nothing to bring balance and equity to the relationship. Okay, it is implied that \"ideological sex\" will solve all our interpersonal misogyny that is tied to heterosexuality and heterosexual dynamics. That is theoretically true, very true. But what reason do I have to give men the benefit of doubt for the same, on the face gigantic Patriarchal privileges they hoard? \n\nSex is EVEN MORE complicated than that. Ideology doesn't solve sexual matters, we're now deeply conditioned to perform it in ways that are ultimately male-favouring. There's a paradoxical question asked by all women who just want to feel a sense of agency and want to feel like autonomous beings, how can any sex be performed that doesn't fall under the deep-seated feeling of it being male-favouring? Sex is complicated enough that there exists a grey region between rape and sex for women which cannot be solved by simple labelling of \"bad sex\" because \"bad sex\" for women is coming face to face with their objectification and the way they're treated like fleshlight by men. A question follows, based on my personal issue -- what if my \"ideologically compatible\" Marxist boyfriend is still bad in bed? We know men being bad in bed never means sex is bad for them, it means sex is bad for us and I just explained what \"bad sex\" means for women. Safe to assume the loss of pleasure is on my side but it's not just a loss of pleasure, rather a recreation of my objectification in moments that are supposed to be good. Am I just supposed to let it happen? What if it still continues after we talk? That is plausible because at this point we're deeply, PHYSICALLY conditioned to perform coitus in ways that are pleasurable to the male ONLY. \n\nLet me tell you, when women go out to seek love they're faced with the biggest question -- will we be sexually satisfied? You know why is that? Read the last line of the previous paragraph and if possible, read more about the sexual pleasure imbalance that directly benefits men. That is one problem. There are more problems with heterosexuality. As I said, loving men is a defeat for women. Men can negotiate their way out of what love is, women cannot. What if my \"ideologically compatible\" boyfriend can never bring me equality because he thinks it's useless bourgeois IdPol and irrelevant to us because he's a Marxist and that's enough? I've seen it happen, I've watched women get mistreated by their Communist/Leftist boyfriends. I'm sorry that we even try to seek love? \n\nSo, you'd probably say, \"Well you should leave him if he's causing you so much issues.\" Okay! Great! Who will get me another Marxist boyfriend? One better than the previous one, hopefully. They don't want me loving and fucking Liberal men, but I shouldn't have to spend life as a celibate. That's genuinely inhumane to women.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "urbaseddad",
                                                                            "body": "Can you send me the first part of your comment? It was deleted or removed but I wanna read what you wrote.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "S_hloka",
                                                                                    "body": "Uhh sure I guess.\n\nAs per what my friend, who isn't logged into Reddit, told me, my comment was removed by Mods. In fact, I wrote 3 comments not 2, but 2 were removed leaving only 1. \n\n\nI actually copied it to a doc, you can read it here. Was gonna turn it into a full fledged criticism but got too busy with life. So yeah whatever I guess. [Doc.](https://docs.google.com/document/d/1ses0ijGO-VpS_xZaiaIGwkRENvndmIOz5uZlYFlrZfw/edit?usp=drivesdk)",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}