{
    "title": "New Public Management (NPM)",
    "author": "everimkundakci",
    "subreddit": "communism",
    "rank": 148,
    "score": 7,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/communism/comments/1hmqjqj/new_public_management_npm/",
    "id": "1hmqjqj",
    "selftext": "(This is just some context; feel free to skip to the next paragraph): I recently came across the NPM (New Public Management) reforms that were making their rounds globally during the neoliberal upswing in the 80s. I'm still very new to socialist politics and theory, and I've been surrounded by people blaming government regulations and the public sector in my country (Norway) for inflation, rising prices and stagnant wages, and struggle for the past decades. When I began reading more about our history, it surprised me to learn how the labor party (currently in government) has been spearheading liberal and free market reforms steadily since the 80s, implementing the NPM model in areas of society such as healthcare. There hasn't been a total uprooting of the welfare state, obviously, but Norway and the labor party are very different today from what they used to be.\n\nDoes any of you have any reading suggestions on NPM from a Marxist/socialist perspective? Books, articles, videos, anything is fine. If you have any thoughts on the subject as well, I'd be very interested in hearing about it.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DashtheRed",
            "body": "You're not getting any replies because it's a pretty boring topic and requires someone to break down that Norway was not some once great far-left socialist welfare state lead by the \"Marxists\" of the Labour Party, now being undone by a sinister cabal of neoliberal capitalists trying to ruin everything on behalf of the 1%, but rather that the vast bulk of all Western wealth, whether in Norway, Germany, England, or Amerika, is a result and product of imperialism and the capitalist world system extracting wealth out of the Third World to provide abundance for the First.  Under the period of Keynesianism, and these imperialist superprofits overflowed for the imperialist nations, and were so abundant that it allowed the states to provide vast state services, along with inflated wages and salaries, to First World workers (tying their class interests to imperialism), and now in the era of neoliberalism, the rate of profit in the imperialist world system has declined so much that the welfare state is being eroded and eaten away to sustain the bourgeois profits.  The fact that Norway held out longer than the rest of Europe was basically fortunate geography plus oil, and a legacy of being tethered to dominant British and then Amerikan imperialism.  The underlying problem is that instead of fighting against imperialism to stop the deprivation of the Third World, most First Worlders instead try to make the debate more narrow, about making capitalism 'more fair' or whatever; with the problem being that they don't want the imperialist super-profits to stop, they just want First World workers (and their welfare systems powered by imperialism) to get a larger share of those superprofits vis a vis the bourgeoisie (who are being \"too greedy\" or whatever), but will not participate in, or even undermine, more radical politics to overthrow imperialism altogether.  In reality, the welfare state simply cannot be restored any longer (at least not a capitalist powered one), so trying to argue to save Keynesianism, or restore the Norwegian Welfare State, or Labour Party entryism, are all actually deeply reactionary because those previous systems were underpinned and sustained through imperialism (and are breaking down because the system is not sustainable nor stable), hence why your politics are being looked upon with suspicion (likely being a social democrat rather than a communist). \n\nHere's a couple of decent articles:\n\nhttps://tjen-folket.no/2019/12/13/er-velferdsstatens-tid-er-forbi/\n\nhttps://tjen-folket.no/2024/11/22/partiet-kontroversiell-bok-om-krisa-i-arbeiderpartiet/",
            "score": 9,
            "replies": [
                {
                    "author": "everimkundakci",
                    "body": "Thanks for the blunt and detailed reply, I definitely ended up hyperfocusing on a very small topic and missed a lot of the overarching trends. The articles you linked to were very informative as well",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}