{
    "title": "Why are there no revolutions or communist grass-roots movements in the global south?",
    "author": "RwnE_420",
    "subreddit": "communism",
    "rank": 142,
    "score": 0,
    "upvote_ratio": 0.49,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/communism/comments/1hpkevp/why_are_there_no_revolutions_or_communist/",
    "id": "1hpkevp",
    "selftext": "It seems to me like in Europe the classes who would be the target audience for communist ideas have disappeared, thus giving rise to the horrible working conditions we see in: Bangladeshi sweatshops, Qatar's migrant workers or cobalt miners in Congo.\n\nMy question is why under these conditions where people have the most to gain by unionizing and fostering communist political movements, haven't we've seen new communist movements showing up. The idea is already out there, so why hasn't it inspired reforms. \n\n  \nIs it because people in these countries don't have access to the information? even though it is easily reachable on the internet. Is because of bad education on communism or are their governments restricting access to resources?\n\nIt also most likely has to do with the US shutting down any genuine attempts at building communism. What do you think are the main reasons? or do I have it wrong in assuming the movement has to come from the workers in the global south? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sewati",
            "body": "you’re misguided in assuming there aren’t any grassroots communist movements in the Global South.\n\nin fact, there are active movements in countries like India (CPI(Maoist)), the Philippines (CPP/NPA), Colombia (ELN, FARC dissidents), Turkey (PKK), and Palestine (PFLP), among quite a few others.\n\nthe difference is that these movements often take the form of armed insurgencies rather than large-scale unions or political campaigns due to state repression, often backed by imperialist powers like the U.S.\n\nthe issue isn’t that people in these regions don’t have access to communist ideas—it’s that the governments actively suppress any attempts to organize.\n\nwhile the working conditions you mention are brutal, many workers are simply focused on survival and immediate needs, which makes large-scale political organizing difficult.\n\nmoreover, U.S.-led interventions and destabilization efforts have routinely sabotaged any real socialist movements, as seen in LatAm and beyond.\n\nso, communist movements do exist, but they often emerge in underground or insurgent forms due to severe state repression, not a lack of awareness, education, or desire for change.",
            "score": 59,
            "replies": [
                {
                    "author": "Deathtrip",
                    "body": "Piggybacking off this comment to link some long form content about some of the communist movements mentioned above:\n\n[Communist revolution in India](https://youtu.be/exd74uNJaeQ?si=Jl6Uev5hb4gOBmIT)\n\n[Communist revolution in the Philippines](https://youtu.be/yPwzGuSorYc?si=Ak5OwuFFaZH8v5Op)",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Sea_Till9977",
                    "body": "You are mistaken about communist movements in the third world. First, you have to identify them as Maoist movements. Second, they do not take the form they do simply because of repression, it is because a people's war is a necessity that arises out of semicolonialism and semifeudalism. Third, armed insurgencies and political campaign goes hand in hand. Guerilla war in the countryside doesn't work without political education, and campaigning.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Sewati",
                            "body": "none of what i said contradicts what you said. i was answering a question for someone who is clearly entry level. getting bogged down in the details wouldn’t have been helpful.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Sea_Till9977",
                                    "body": "talking about semifeudalism and semicolonialism isn't getting 'bogged down in the details'. it is the basic mode of production that I mentioned which you quite literally cannot ignore when talking about third world communist movements.\n\nAlso you saying the movement takes the form of armed insurgencies rather than political campaigns is quite literally false. I have faith in people's intellect that I would rather give them proper answers that are not dumbed down. I'm not going into any specifics or details of what a people's war is lmao.\n\nedit: I am speaking from experience of starting with incomplete understanding, which messes up how one understands important readings and information and leads you to incorrect conclusions.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Sewati",
                                            "body": "i think you are misunderstanding what i wrote here.\n\nmy first response was intentionally crafted for someone at an entry level of understanding.\n\nif you read it closely, i made careful use of words like “often” and “large-scale” to show that i was speaking in generalities to make the broader dynamics accessible.\n\nfor example:\n\ni said movements “often take the form of armed insurgencies rather than large-scale unions or political campaigns,” which doesn’t deny the presence of political organizing. i was highlighting that these movements tend to manifest in ways shaped by state repression.\n\ni acknowledged that political campaigns and organizing exist, but the scale and visibility of these efforts are often constrained by conditions like survival struggles and imperialist intervention.\n\nas for semifeudalism and semicolonialism, i understand their centrality to the theoretical framework, especially in Maoist thought, but this kind of terminology could overwhelm someone new to the topic. \n\nmy goal was to present something accessible while still being nuanced enough to avoid oversimplification.\n\ni agree with your point that guerrilla warfare and political education go hand in hand—this is why i emphasized state repression and immediate survival needs as obstacles to mass-scale political visibility, not a lack of desire or education.\n\nnone of this contradicts the dynamics you’re describing.\n\ni appreciate your intent to ensure accuracy and depth, but in this case, i don’t believe anything I said was “quite literally false.” instead, i tailored my response for clarity and accessibility without diving into specific theoretical terminology.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sloganlarla",
                    "body": "You may need to do more reading on PKK",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Sewati",
                            "body": "reading such as? to what end? \n\nyour comment seems to imply i’m incorrect for listing them, but some more info would be cool. \n\nas i understand it, Apo thought rejects certain aspects of state socialism and is attempting to build its version of anarchist socialism.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RwnE_420",
                    "body": "Thank you for your response, I clearly need to do more research into the current state of communism in the global south. Other responses have already recommended video essays but is there somewhere I can keep up to date with the news? \n\nThe militaristic guerilla fighters such as in Columbia aren't exactly the worker revolutions I had imagined. Have the leaders in these movements said anything about how they plan to engage workers? it seems like a large gap to cross",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RNagant",
            "body": "There ARE communist movements in the global south. Phillipines, Columbia, Swaziland, etc, there's a whole bunch",
            "score": 9,
            "replies": []
        },
        {
            "author": "BootValuable0715",
            "body": "the philippines' cpp npa and ndf is alive and thriving, comrade",
            "score": 13,
            "replies": []
        },
        {
            "author": "liewchi_wu888",
            "body": "While many people will rightly point to the various Marxist revolutions happening in the Global South Right now, like the people's war in India and the Philippines, the TKP/ML, etc. you are right to say that it is relatively weak compared to the great oppression that we all face in an era of Capitalism's decline everywhere. \"Where there's oppression, there is resistance\", but given the historic demise of Socialism everywhere, the capitulation of China from the Revolutionary to the Capitalist camp, part of it may have to do with the fact that making revolution without some sort of \"sponsorship\"- to put it very crudely, is difficult, especially when their oppressors are heavily sponsored by the capitalist imperialists.",
            "score": 6,
            "replies": [
                {
                    "author": "RwnE_420",
                    "body": "You are right of course, it is difficult to get anywhere in a capital powered society with a contrairian capital-less system. But where should the revolution come from if not the global south? \n\nI still believe communism has it's best chance on it's home continent in Europe. Though that has a long way to go.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Careless_Owl_8877",
                            "body": "the revolution should come from the global south, it’s just hard.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "C4se4",
            "body": "There are absolutely socialist and communist parties and ideas. Congo was a communist country up until the dissolution of the Soviet Union. There are active communist parties within these countries. There have been revolutions in Bangladesh where these parties played an important role.\n\nAfter the fall of the SU parties like this were pushed to the fringes because there was no way to effectively back them up, sadly. \n\nThere is still plenty of movement on the left, especially in terms of Unions, worker safety and wages. The control Capital has over the working force is immense though.[ They don't shy away from using violence to supress dissenters either.](https://www.theguardian.com/global-development/2023/jun/28/shahidul-islam-bangladeshi-labour-leader-shahidul-islam-beaten-to-death-wages-dispute) It's not straight up communism but all these people are of course very much influenced by Marxist thought.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Japeththeguy",
            "body": "you can read the latest news about the Philippines' revolution here: [https://philippinerevolution.nu/](https://philippinerevolution.nu/)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specter451",
            "body": "In Bangladesh there was a massive labor struggle that connected itself to the student movement. They had a general strike and overthrew the military junta. The problem is that there was no genuine communist party with enough influence and manpower to push it farther than a social revolution. And thus it was redirected into a pro western liberal and reformist bloc. Also the tactic of popular frontism which is utilized by Stalinist parties is a revolutionary dead end as it forces the party to tail end liberal movements and take more moderate positions. After the collapse of the USSR many of these parties became openly reformist. It took an entire lifetime for Lenin and the Bolsheviks to overthrow the Tsar. Without communists who understand the need of mass organizing it will take a long time to gather the ones and twos. Not to mention the mountains of slander and revolutionary dead ends the imperialist camp/s push new communists into. I’m incredibly hopeful for the future as the contradictions of capitalism have begun to intensify. It falls to the leadership of the movement to apply the knowledge of Marx, Engels, Lenin, and Trotsky to the present conditions.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Tascalde",
            "body": "This question and many other related to the successfulness or failure of socialism can't be fully answered, in my opinion, without deeply understanding what this book teaches us about. successfulness [Killing Hope](https://www.cia.gov/library/abbottabad-compound/13/130AEF1531746AAD6AC03EF59F91E1A1_Killing_Hope_Blum_William.pdf)\n\nThe tendrils of the United States empire as they act through the CIA has killed, sabotaged and financed too many anti-communist acts in the world.",
            "score": -1,
            "replies": []
        }
    ]
}