{
    "title": "Split in the Communist Initiative of Cyprus",
    "author": "urbaseddad",
    "subreddit": "communism",
    "rank": 123,
    "score": 23,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 6,
    "url": "/r/redcyprus/comments/1hxohnl/split_in_the_communist_initiative_of_cyprus/",
    "id": "1hxoika",
    "selftext": "",
    "comments": [
        {
            "author": "DashtheRed",
            "body": "If I'm reading this all correctly, it seems that the primary issue was deep-rooted Greek ethno-chauvinism?  I realize that's not predominant in the resignation letters, but that seems to be at the heart of what the CIC's lack of democracy or patronism et al. is really about, and what is being protected by those undemocratic means.  Or am I being too narrow and vulgar here?",
            "score": 6,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "> deep-rooted Greek ethno-chauvinism\n\nPerhaps you ought to clarify what you mean by this but personally I'm not sure I'd call it Greek ethno-chauvinism since that is what I'd call positions associated with the Greek Cypriot far-right, such as considering Greek Cypriots to be Greeks and calling for enosis (union) with Greece. I'd find that unfathomable even among AKEL leadership so I'm not sure that's the case here. If anything what has been happening here is Greek Cypriot chauvinism (which I'd say is certainly distinct from Greek ethno-nationalism or ethno-chauvinism). Even then I'm not sure how much that is what it is in essence, rather than a resulting appearance due to either bad organization (which my experiences certainly indicate they have; I cannot stress enough how badly organized they showed themselves to be to me) or bad politics. Of course chauvinism in essence too is a result of bad politics but the important thing I want to stress here is that the comrades here, and I have expressed this to them in our private exchanges already, did not focus a lot on, nor did an in-depth analysis of, the actual political line of the CIC, and tried to tie this into what certainly was the appearance of Greek Cypriot chauvinism if not Greek Cypriot chauvinism in essence, as well as the clear lack of inter-organizational democracy. If time and energy allows it I plan to do just that and if I do I'll publish it here too.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DashtheRed",
                            "body": "You're right, I meant Greek Cypriot chauvinism and my phrasing was sloppy.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "All good.\n\n\n> I realize that's not predominant in the resignation letters, but that seems to be at the heart of what the CIC's lack of democracy or patronism et al. is really about, and what is being protected by those undemocratic means. Or am I being too narrow and vulgar here?\n\n\nI forgot about the rest of your comment but I think I more or less did end up addressing it regardless.\n\n\nThe criticism of the comrades here seems to be pointing towards what you said, but I would say that perhaps it is indeed narrow or vulgar. What I think is what I more or less said in my previous comment: the bad politics is what causes the undemocratic stuff in order to protect said bad politics; the chauvinism is either a direct (if it is in essence) or indirect (if it is in appearance) side effect of the bad politics but not the cause of the latter. When I say bad politics I mean ultimately revisionism and bourgeois politics, and chauvinism in general is simply something that serves capital, it's not something that has an independent existence.\n\n\nWhat do you think? In general if you have anything else to say or ask I'm all ears, I really want to discuss this and get good communists' thoughts.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "DashtheRed",
                                            "body": "I want to say something profound or useful, but to be honest I've largely neglected Cyprus in my combing of communist history, so my understanding here is probably inadequate (by this subreddit's standard, I'm sure I'm fine compared to Reddit).  I'm not quite the repository of knowledge that someone like smokeuptheweed9 is; a lot of my best posts are just expressions and re-articulations of the correct politics this subreddit established and arrived at (mostly without me). And I still feel I'd need to spend more time learning about the history of the communist movement there before I can contribute in a useful and non-abstract way.  But I will do that, and circle back at some point if I think I've got anything useful or interesting to say.  Though I cant promise when that might be, I tend to work and study in erratic, uneven patterns.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "urbaseddad",
                                                    "body": "That's okay. Cyprus may punch above its size, both in significance to imperialism and the intensity of internal contradictions, but ultimately it is still a tiny place with not too much to speak of in terms of history of genuine communist and revolutionary politics. But that's also a factor towards why I'm somewhat desperate to get people's thoughts—the latter being that there is potentially a whole century if not more of history that Cypriot communists today need to re-evaluate, perhaps from scratch, which means there's difficulties in answering questions regarding the present as well.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}