{
    "title": "Draft Programme of the Communist Party of Britain (Maoist)",
    "author": "Dazzling_Bus_5044",
    "subreddit": "communism",
    "rank": 30,
    "score": 26,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/communism/comments/1it9b4h/draft_programme_of_the_communist_party_of_britain/",
    "id": "1it9b4h",
    "selftext": "[https://marxismleninismmaoismbritain.wordpress.com/2025/01/15/draft-programme-of-the-communist-party-of-britain-maoist/](https://marxismleninismmaoismbritain.wordpress.com/2025/01/15/draft-programme-of-the-communist-party-of-britain-maoist/)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-Marxists** - This subreddit isn't here to convert naysayers to Marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or Marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DefiantPhotograph808",
            "body": ">the United Front in Britain is to unite all popular classes under the leadership of the revolutionary proletariat\n\nWho exactly are these 'popular classes'? Britain lacks both a peasantry and a progressive national bourgeoisie, which appear in semi-feudal nations where popular fronts are usually practised by communist parties. I don't understand the purpose of this proposed united front; Britain is obviously not semi-feudal, nor in need of New Democracy.\n\nAnyways, this is just amateurish and has most likely been written up by a single person, just ticking the checkboxes needed to sound like it's Maoist, with mentions of mass line and a people's army. There's no application of Maoism when analysing the conditions of Britain, what the tasks of communists are, or the consequences of this 'worker-elite' (or labour aristocracy) for organising. Blog posts that declare the formation of a party are a dime a dozen, anyways",
            "score": 43,
            "replies": []
        },
        {
            "author": "mediocremandalorian",
            "body": "Looks as though it was written with wikipedia open in another tab. Mostly bland recitation.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Dazzling_Bus_5044",
            "body": "I recently came across this newly founded group calling themselves the Communist Party of Britain (Maoist), who published a foundation Declaration along with a Draft Programme just over a month ago.\n\n[https://marxismleninismmaoismbritain.wordpress.com/2025/01/15/declaration-of-the-communist-party-of-britain-maoist/](https://marxismleninismmaoismbritain.wordpress.com/2025/01/15/declaration-of-the-communist-party-of-britain-maoist/) \n\nThe programme has some interesting parts, but also seems somewhat confused. It correctly identifies that,\n\n>A fundamental fact is that the British people have been bought off by imperialism for decades.\n\n...\n\n>Britain is an imperialist nation. Therefore, we must understand that there is a significant section of the working class that is not proletarian.\n\n...\n\n>The interests of the British working class are therefore tied currently to the interests of British imperialist bourgeoisie.\n\nand \n\n>The revolutionary proletariat may not only be made up of a majority of migrant proletarians, but in fact may exclusively be made up of the migrant proletariat.\n\nbut muddles itself with seemingly made-up concept of a “working elite”, rather than using the Marxist terminology of labour aristocracy, and makes a false distinction between the UK and Britain, believing that Britain both exists outside of the UK and is also something worth maintaining.\n\nPart of this confusion could stem from the fact that this document was seemingly written by only one person, as seen be the self-referential use of language in the afterword. Regardless of such speculation, this programme is not without worth. If this organisation does in fact exist outside of a blog, then it would be the only organisation (to my knowledge) that takes a view of the British working class as being bought off by imperialism. For that I feel it is noteworthy and hope this can produce discussion.",
            "score": 19,
            "replies": [
                {
                    "author": "HappyHandel",
                    "body": "Ok ill bite, how is Britain not a nation?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Dazzling_Bus_5044",
                            "body": ">Ok ill bite\n\nI'm not saying this to get a reaction, I say it because it is true.\n\n‘Britain’ is, at best, a half-baked nation in which even it most ardent builders were not strong enough to complete it. There already is no ‘Britain’. Grant national independence to Britany and Corsica, and there will still be France; grant national independence to Catalonia and the Baque Country, and there will still be Spain; grant national independence to Scotland and Wales, and ‘Britain’ ceases to exist, it will just be England. If there was ever anything called ‘Britain’ historically, it was the name of an Empire. A ‘British’ nation has never existed. The three nations that ‘Britain’ currently occupies are Scotland, Wales, and England, although I hesitate to call it an occupation of England as ‘Britain’ is mostly an extension of English hegemony over the other two nations.\n\nThere is very little national sentiment towards a common 'British' national identity, in spite of efforts by the British\\* ruling class. Very few people in Scotland or Wales consider themselves party of a ‘British’ nation. Rather they see themselves as part of a Scottish and Welsh nation respectively. Even large sections of England consider themselves English over ‘British’, even with ‘Britain’ being a construct of English hegemony. Those who do consider themselves ‘British’ are primarily either bourgeois or urban petty-bourgeois and almost exclusively reside in England. If a British national sentiment does exist, it is only is large metropolitan areas, particularly around London.\n\nI will use the example of Irish Republicans, who, while aiming their fight against the British state (as ‘Britain’ and ‘the UK’ are effectively interchangeable terms), they often viewed their struggle as being against England. This is a clear separation between the state, ‘Britain’, and the nation, England.\n\nThe rejection of the idea of a ‘British’ nation is fundamental for an understanding of where revolutionary politics lies in the UK. One of our most renowned communists, John Maclean, explicitly rejected the concept of ‘Britain’. ‘Britain’ has never been a successful outlook for communists in the UK and most of the great and revolutionary communists came from the non-English parts of the Isles. Connolly, Maclean, and even MacManus, who was the first chairman of the CPGB back when it was still something of a revolutionary party, were all not English. It is no coincidence that those revisionists in the CPGB, Harry Pollitt and those who followed him, were also social-chauvinist clinging onto the corpse of ‘Britain’.\n\nWhile this is by no means a comprehensive thesis, and my study is far from complete on this issue, this is the conclusion that my investigation has led me to.\n\n(Apologies for the late response)\n\n\\*British can mean something here as a way of defining those of the UK bourgeoisie/Westminster state",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "HappyHandel",
                                    "body": "How is Scotland, which formed out of warfare between feudal landlords, a \"nation\"? This makes no sense to me.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Dazzling_Bus_5044",
                                            "body": "This is a ridiculously reductive understanding of the formation of the Scottish nation. Scotland meets all the requirements of a nation. ‘Britain’, on the other hand, does not constitute a nation. It is an English concept that has been used to subjugate other nations. \n\nIn spite of your seeming denial of the Scottish nation, that does not make the British nation a reality. So I would like to turn this around and ask, how does the British nation exist, as that seems to be what you’re defending?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "DefiantPhotograph808",
                                                    "body": "The national question isn't a matter of boxes to tick. Scottish nationalism exists, but is it historically progressive?",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OkConsequence1498",
            "body": "This just doesn't come across as very serious. Nowhere in this \"programme\" is an actual programme. \n\nNo method or focus for organising, no demands to be raised, no assessment of their current capability. \n\nIndeed the only concrete things I can see in here is seeing up a strategic command post for an army and to campaign \"no\" in any indy ref.",
            "score": 3,
            "replies": []
        }
    ]
}