{
    "title": "Applying for Jobs in 2025 SUCKS",
    "author": "freddychuckles",
    "subreddit": "videos",
    "rank": 15,
    "score": 1410,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 344,
    "url": "https://www.youtube.com/watch?v=i0yiHxA62lk&lc=UgzjYk342U6jwhBXmS14AaABAg.AFl6BXcjKCnAFlD-ZUjVdt",
    "id": "1jddi19",
    "selftext": "",
    "comments": [
        {
            "author": "notmoffat",
            "body": "Ive been searching for a new job for 7 months now.  I have 20+ years experiance.  The vast majority of interviews I've had have been based on me reaching out to someone at the company to talk about the position first, making a good impression, then getting them to get HR to reach out to me.  Otherwise, I get ghosted.  \n\n\nNever in my life have the interviews been so many (on avg 4), so in depth and so long.  Most requiring \"pre work\" assignments.  \n\n\nThe economy is fucked imo. ",
            "score": 962,
            "replies": [
                {
                    "author": "MandudesRevenge",
                    "body": "Don’t those pre-work assignments feel like a scam?  Hate that shit",
                    "score": 329,
                    "replies": [
                        {
                            "author": "Notonreddit117",
                            "body": "I applied to an education software company and they asked me for an outline of ways to deliver specific content to students using their software as a template. Halfway through writing the task it occurred to me they don't have to hire me and can just take my ideas and give it to someone already employed to do.\n\nI withdrew my application.  My gut told me I was wasting my time.",
                            "score": 147,
                            "replies": [
                                {
                                    "author": "MandudesRevenge",
                                    "body": "This was a complaint I had when teaching overseas.  “Create a detailed lesson plan based on (specific topic) and submit to this email.”  No, thanks.",
                                    "score": 68,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "rjcarr",
                            "body": "I'd much rather do assignments than stupid logic puzzles.  Plus, it is more indicative of real life work.  That said, I get it's much easier to cheat.",
                            "score": 97,
                            "replies": [
                                {
                                    "author": "Kitchen-Row-1476",
                                    "body": "It’s more that pre work assignments are insane and because it’s a race to the bottom people will just eat it.",
                                    "score": 59,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "403Verboten",
                            "body": "I had a pre assignment and 9 interviews with one company only to get rejected for missing 1 question in 9 interviews. At least they told me what I missed.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Kevin-W",
                            "body": "Yes and I instantly turn down jobs that require that kind of free labor.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "tonyprent22",
                            "body": "I don’t know…\n\nThe top comment here is “lie on your resume” so I would think it behooves a company to at least see if you’re capable of the work since the market is flooded and people seem to be willing to just say “let ChatGPT lie for me”",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "brown_man_bob",
                                    "body": "At its base level, the interview process is inherently dishonest. Companies will not be straight forward with you and will not be transparent about the job. Not to mention the massive power imbalance between the employer and the employee. Companies have the power to change the culture and quality of the candidates they take. They choose not to.",
                                    "score": 121,
                                    "replies": [
                                        {
                                            "author": "CamGoldenGun",
                                            "body": "if you make it far enough for an interview that you definitely have the skills required for it, you let them know you've got other offers as well. Sort of like dating I guess? Make it seem like if they turn you down for the job it's no big deal? But that makes you more desirable. Don't seem too nonchalant, seem excited for the job and the company but don't appear to be desperate like this is your last hope.",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "IAmDotorg",
                                            "body": "> Companies have the power to change the culture and quality of the candidates they take.\n\nThey really don't. When you need someone *now*, the last thing you can do is pull your experienced employees off their tasks and have them focus on hiring. And especially when the majority of applicants are lying about their skills and experience, it can take hundreds of man hours to narrow down applicants for a single role to a pool of a dozen to phone screen and a handful to interview. And most of *those* are just people who lied better. \n\nSo it's just an optimization game -- which resumes can you ignore quickly, what questions and tests can you do to identify liars quickly, and what can you do as quickly as possible to get someone in who won't be terrible, with as little overhead as possible. \n\nIn tech, especially, it's one of the foundational reasons for hiring H1B workers and on- or off-shore contractors -- the company you're getting them through has done that vetting and their reputation in the space hinges on it.  You can pay a premium for a contractor for *years* before you can recoup the costs of hiring. \n\nWhich is why companies *massively* prefer hiring through networking rather than recruiters or the open market.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "HemHaw",
                                                    "body": "> the last thing you can do is pull your experienced employees off their tasks and have them focus on hiring.\n\nWhose fault is this? That they understaffed and have no bandwidth for losing a person or two? That's the employer's fault, not the applicant.",
                                                    "score": 26,
                                                    "replies": [
                                                        {
                                                            "author": "IAmDotorg",
                                                            "body": "Do you really have no concept of how the real world works? Or have never had a job?\n\nIf you were an employee, would you like to be paid less to have a buffer of idle people on your team?  Teams with people who aren't contributing the way other people are are *terrible* for morale. Ask anyone who has been on one.  And, if you do have idle people, those are almost always the least important/skilled/knowledgeable ones -- and thus, useless for interviewing. \n\nThat's... moronic.",
                                                            "score": -22,
                                                            "replies": [
                                                                {
                                                                    "author": "HemHaw",
                                                                    "body": "> would you like to be paid less to have a buffer of idle people on your team?\n\nI'm a sienor level IT professional. Been in the game for decades.\n\nI want my team staffed up enough so that at LEAST 1 person can go on vacation or be sick without the workload for the rest of us increasing substantially enough to effect our QOL or mental health. That means if I need to be in an extra meeting once or twice for interviews per week, or hand a JD in to HR for a new position, so be it.\n\nThe problem is when management says a new position \"isn't in the budget\" until well beyond when it's needed, which creates the \"emergency\" scenario of needing someone RIGHT NOW. That's no one's fault but management, and it comes about 100% of the time because of the same thing. GREED, driven by their bonuses which are awarded to them by depriving us, the workers, of as many resources as possible, striving for a \"lean\" workforce.\n\nI could go on, but I won't.",
                                                                    "score": 22,
                                                                    "replies": [
                                                                        {
                                                                            "author": "-Ernie",
                                                                            "body": "The guy you replied to challenged your “real world” experience and then you turn around and fucking *define* today’s real world corporate conditions in two paragraphs, lol. \n\nEvery time I hear our VP say “we’ll just hire someone if we need to” that just means that I’ll be doing whatever it is on the weekend. \n\nI’m a PM who usually has to do technical work on my projects to keep them moving. \n\nI call it my side hustle.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HemHaw",
                                                                                    "body": "🙏\n\nI'll bet there's \"no budget\" for your annual raises either.\n\n/u/IAmDotorg seems to think that if your team is leaner, each member of the team will be paid more. No idea why they think that. It would seem to indicate that they really have no concept of how the real world works.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "IAmDotorg",
                                                                            "body": "> I'm a sienor level IT professional. Been in the game for decades.\n\nI feel for your teams, then, if that's how you run them. You're going to have bottom of the barrel people if you're treating them badly. \n\nBut I suspect you haven't actually managed any teams and your experience and view are tainted by being one of those bottom of the barrel people. Most people who have been in IT for \"decades\" -- meaning they were working in the 90's, moved up in the orgs and rode both the growth and maturation cycles of the tech industry -- retired quite a while ago.",
                                                                            "score": -3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HemHaw",
                                                                                    "body": "You make a lot of assumptions",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "someone447",
                                                                                    "body": "You feel for his teams because he tries to have enough people so that they can take off?\n\nAnd you think people who started working in the 90s or early 2000s are retired(because 2005 was decades ago)?\n\nOr did you respond to the wrong person?",
                                                                                    "score": 5,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Romantiphiliac",
                                                                    "body": "You don't have 10 people putting in 100% and 10 people putting in 0. You have 20 putting in 50%. Or whatever the ratio might be - the exact numbers aren't important. The point is everyone is doing their fair share while leaving room to redistribute the workload to account for problems or changes as they occur. If you cut it down to run on the bare minimum, when something *does* happen (and it will), the amount of work that can be done decreases, which means delays and lost profits. Hiring someone new takes more resources - and then even if they have experience in the industry, they'll need time to get up to speed with whatever work is being done. This is means even lower productivity.\n\nAssuming that entire process goes as smoothly as possible, running employees ragged leads to burnout and mistakes. The amount saved by having less people on the payroll is lost - plus a bit more - by workers slowed down from exhaustion and time spent going back to fix things.\n\nIt's the same reason you have IT or security. They're not there because you expect the computers to catch fire or have people breaking in 24/7. They're there so when something goes wrong (and it will), they're in place and familiar with the environment to start getting things up and running and prevent as much downtime as possible.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "someone447",
                                                                    "body": "All of western Europe has figured out how to do it.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TheUltimateSalesman",
                                            "body": "If everyone but you lies, then you lose.  Don't lie.  Tell the truth. Kill them with truth.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "xenthum",
                                    "body": "It's an arms race. Applicants only started to rise to the increasing nonsense of job boards. Now it's an AI-fueled war where both sides get increasingly sophisticated. The best compliment I've received this year was probably \"You're the first applicant that seems like a genuine human person that isn't using AI.\"\n\nI did not get that position. Now I've had AI touch up my resume.",
                                    "score": 29,
                                    "replies": []
                                },
                                {
                                    "author": "Spud_Spudoni",
                                    "body": "If that’s the case, then they should be more than willing to reimburse the applicant for the labor they will put in on said pre work. On the handful of applications I have done requiring pre work, none have ever been willing to budge on any sort of aid when the idea was brought up. Just sign your NDA, provide them free work and ideas that you no longer can claim, then get fucked when you don’t get hired.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "magicarnival",
                                            "body": "I'm a nurse, so I don't encounter this type of \"pre-work\" in my interview process, and I'm curious what kind of pre-work you guys are doing that you feel like it should be compensated? I can see wanting compensation if you're actually solving a problem the company needs help with, but I imagine they'd just be giving everyone the same practice/hypothetical problems to compare the applicants' skill levels? Are they giving you real issues they need help with and don't know the answer to?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "tarrasque",
                                                    "body": "Sometimes companies are honest and give out a standard hypothetical, but sometimes they are soliciting solutions to real work. \n\nSome role types lend themselves well to SMALL interview assignments making sense, like with software devs. But some companies want entire projects that take hours, and for roles that make much less sense like PM. I feel like for those companies those projects are more about being a shit test than the work you produce - ‘how much shit are you willing to put up with?’\n\nAnd medicine is not immune to the bullshit. My wife used to be a medical assistant before she moved into management and requests for practical interviews were not uncommon. All good if they were paid or no more than an hour. Less good if they keep you there for hours and either state no pay or stiff you at the end.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "I_Automate",
                                                            "body": "In a civilized country, that's reportable to the labour board and/ or professional standards association",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "tarrasque",
                                                                    "body": "Yeah, well…",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Spud_Spudoni",
                                                    "body": "I’ve answered this elsewhere on this post but I’ll re-contextualize: I’m in a creative industry. “Pre work” is essentially a test assignment. Design X product with these certain criteria/contraints in mind (if you’re lucky but sometimes it’s just design us anything). I may have roughly 10-14 days to accomplish this in my experience doing them.\n\nThen I have to generate the concept itself, usually through a period of concept sketching over the course of two days, finalizing an idea from there, then more finalized sketches of the concept from another round of a dozen or so more closely related concept iterations, then off to a dozen hand made prototypes either out of foam board or hardware store foam which takes at least a day, then usually moving to CAD to model up a rough 3D model of the final concept picked from the physical models made which can take a few days on its own, then a number or fully detailed renders with materials and natural lighting of that CAD model which can take another few days, then photograph and document all of that work into a final deliverable presentation that the hiring manager can view and see my process from.  It’s not uncommon to spend more than 40 hours on a design test like this.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "magicarnival",
                                                            "body": "I see, creative works are definitely a bit different from what I imagined (I was thinking you were like a programmer or something with more easily defined skills that can be tested consistently with a practice problem) and I can see why you'd feel compensation might be warranted since you definitely can steal ideas like that. Thanks for the response!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Spud_Spudoni",
                                                                    "body": "Not surprised you’d think that! Which is also the *bane* of industrial designer/product designer’s existence. You can see a number of post on their subreddit upset about the way “product design” has been appropriated by UX/UI designers and web developers over the past few years. When in reality, it’s far more related to service design. True “product design” by its original definitions is in soft/hard goods that are tangible solutions to problems people are experiencing. Which goes through a variety of mediums before a concept can be delivered. As we grow into a more digitally focused consumer-base, the definitions have changed, which has sort of pushed traditional product design out.\n\n\nAll of the issues mentioned in this thread are exasperated in that industry, because the large majority of “product design” jobs are now referencing a totally different line of creative work, which is a nightmare that’s occurred over the past 10-15 years or so. You can also see architects dealing with the same issue as the term “architect” is being appropriated for a wide variety of digital professions now.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "sam_hammich",
                                                                    "body": "> I was thinking you were like a programmer or something with more easily defined skills that can be tested consistently with a practice problem\n\nSure, programming skills can be reasonably tested with a practice problem, but \"pre work\" is still absolutely a thing for programmers. For education they can have you write outlines or lesson plans, pretty much any position where the capital you bring is creative in any capacity (not \"creative\" just as in art, but \"creative\" as in you create anything at all), you can and will be asked to create something for free.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "jessuvius",
                                    "body": "I was helping interview a candidate that was pretty clearly getting answers to my questions from chat gpt during the actual interview. :/",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "sam_hammich",
                                    "body": "People are willing to have AI lie for them because employers are outsourcing almost the entire application and interview process to robots. If you employ resume filters that look for keywords, is it any wonder that people will start to tailor their resumes to get past those filters? These companies are creating their own problems.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "aninstituteforants",
                            "body": "The only one I ever did i basically got Chat GPT to do but changed it up just enough to pass as my own. I got the job too.\n\nFuck wasting my time on that for potentially nothing.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Atoning_Unifex",
                            "body": "Few years back was applying for a Senior UX role. They wanted me to design a date picker on the fly in their office. I'm like, seriously? I've been doing enterprise level SaaS UX for like 15 years. And 5 years as a web designer before that. I'm not designing a date picker for you right now. That's like asking a Ferrari mechanic if he can change a tire.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Turtley13",
                            "body": "Yup.. Should be 100% illegal. If you want me to work I should be paid for my time.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "enricojr",
                    "body": "10 years experience here, in software. I'm getting insta-rejected left and right. I've been out of proper work for more than a year now.\n\nWhat's worse is that in the rare case I get an email with a rejection letter, it's a generic \"we're sorry if that's not what you were expecting\" type piece of shit from a noreply@ email so I can't even ask for feedback.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "AsSubtleAsABrick",
                            "body": "In fairness, asking for feedback is pointless. No one will give you feedback as if they say the wrong thing the next thing they know they are being sued for some sort of discrimination. So at best the feedback will be high level bullshit.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "gibertot",
                            "body": "Yeah it sucks you spend all the time tailoring your resume and cover letter and submit it and instant email back saying you’ve been rejected",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "enricojr",
                                    "body": "How is anyone supposed to provide for themselves like this? Growing up it was drilled into our heads that wed need to work to survive but corpos are laying people off left and right, anf pouring money into AI so they dont have to hire anyone anymore.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "OkSalad5522",
                            "body": "For those of you looking for roles. I am hiring for a tech lead role that has experience with [sticky.io](http://sticky.io) and preferably checkoutchamp. We're offering $40/hour (which I know is low but we're small and trying to grow). \n\nI am very motivated to hire so please DM me!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bruceleroy99",
                    "body": "> Never in my life have the interviews been so many (on avg 4), so in depth and so long.\n\nI've had a similar experience and this is probably the worst part of it all - when I was fresh out of college I had to do interviews like that a few times but now I have over 10 years experience and it is just exhausting. I thought I might be a unique case but I know a few others looking that are all running into the exact same thing, it's brutal.\n\n\nI've already turned down a couple offers because they were not a great fit in the end but the overall process is definitely wearing me down. At this point I'm pretty sure I'm going to take something way worse than I would even normally consider just to get back at it again and not have to deal with it.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "xenthum",
                            "body": "> At this point I'm pretty sure I'm going to take something way worse than I would even normally consider just to get back at it again and not have to deal with it.\n\nAnd recruiters have the gall to ask \"can you explain this gap in your resume\"",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "bruceleroy99",
                                    "body": "lol for real - often times I don't even get a RESPONSE for roles that are a level below where I am in my career.\n\nI've read a few different sources that say a number of job postings aren't even real. While I'm not normally one to listen to rumors, I would not be surprised if it was accurate given what I've seen.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "xenthum",
                                            "body": "Oh that wasn't a rumor, that was a story that ran in August. Recruiters admitted to posting ghost jobs to manipulate existing employees and lie to shareholders. They never have any intention of those positions ever being filled. The people running the survey approximated it about 1 in every 3 job listings is fake, which doesn't account for actual scam listings (which is probably another 1 in 3).\n\nhttps://www.forbes.com/sites/rachelwells/2024/08/13/36-of-job-adverts-are-fake-how-to-spot-them-in-2024/\n\n>According to the same ResumeBuilder survey, \"companies posted fake job listings to make it appear the company is open to external talent (67%), to act like the company is growing (66%), to make employees believe their workload would be alleviated by new workers (63%), to have employees feel replaceable (62%), and to collect resumes and keep them on file for a later date (59%).\"",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "zerocoolforschool",
                                    "body": "I had a recruiter ask for references before I have even interviewed. I have never had a recruiter do that before. It made no sense to me. That’s not how the order of operations goes.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "OkSalad5522",
                            "body": "For those of you looking for roles. I am hiring for a tech lead role that has experience with [sticky.io](http://sticky.io) and preferably checkoutchamp. We're offering $40/hour (which I know is low but we're small and trying to grow). \n\nI am very motivated to hire so please DM me!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WebMaka",
                    "body": "> The economy is fucked imo. \n\nAnd as the rotten cherry on top of the giant shit sandwich, the current sociopolitical situation in the US is making literally everything about employment and hiring significantly more of a mess.",
                    "score": 64,
                    "replies": []
                },
                {
                    "author": "die-microcrap-die",
                    "body": "I have been looking for over a year now and like you, 20+ years of experience.\n\nI will need to start lying to pretend being younger or have less experience because clearly, age discrimination is in full force.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "gibertot",
                            "body": "What industry if you don’t mind me asking?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "die-microcrap-die",
                                    "body": "In the IT industry.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IAmDotorg",
                    "body": "That's a trend that has been building for decades. The problem, at it's core, is there are too many jobs that are too easy for people to lie and bullshit their experience with on their resumes, and too many recruiters who are trying to place people as a numbers game. \n\nThe end result is you get literally hundreds of applicants for a job listing, and 90% of them are lying -- often extensively -- in the resume. And you're hiring because you don't have the resources to do the jobs that need to be done, so no one has time to filter out the applicants and figure out who is worth talking to. \n\nThe end result is the *vast* majority of hires are done via networking and if you're not networking -- or are new to a field and can't -- you're a minnow in a massive school of fish, with no way to stand out. \n\nIt's especially bad in tech, but pretty much any white collar job has this problem. There's, by and large, no professional certifications so there's no real way to filter people. A degree used to help, but they're both ubiquitous these days *and* largely meaningless, for most jobs, from a skill standpoint. Online degrees have dramatically impacted how meaningful a degree is. (As an aside, some people have wizened up to that and last time I was hiring, I started to see a trickle of people explicitly stating their degree was from an on-campus program.)\n\nBut if you can't get hired through the people you've worked with before, you're definitely boned these days. But that's been true for at least the last decade.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "guassmith",
                            "body": "This is a problem created by hiring managers. Instead of being honest about what kind of candidate they need, they just fill the job posting with AI generated buzzwords and requirements and experience 10x more demanding than whatever the role actually requires. So if a graduate candidate is 100% honest, they don't apply for any listings.\n\nIf the entry level job with an entry level salary is asking for someone with 5 years of experience, its obvious that the only people applying will be entry level candidates with false and over exaggerated resumes.\n\nI completely agree with you on degrees though. Businesses don't care about them. Universities and crappy online training companies know this and don't give a shit either because they're making money convincing people that they'll help.",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "alfred725",
                                    "body": "> This is a problem created by hiring managers.\n\nNo, it's fundamentally created by the fact that in the 90s companies fire their hiring staff. Everything moved to recruiters and outsourced HR.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "IAmDotorg",
                                    "body": "You're making a bunch of assumptions there that are pretty patently wrong -- like using AI generated buzzwords. Anyone older than maybe 25 who has ever had a job knows that. That's how listings have always been.\n\nThose are all filter functions -- the experience and list of skills required has largely *never* had anything to do with job requirements and everything to do with filtering out the first 90% of applicants. It doesn't *matter* if you miss some candidates -- you save 90% of your time and you're going to have to grind through them, anyway.  \n\nAnd that isn't a new thing. Companies, in a market with a glut of applicants, have *always* set requirements as the minimum skills required plus any additional requirements to reduce the number of applicants.  That's not a 2020s thing, that's been true for at least the last century. And when demand for jobs gets too high, they start to do less of that. \n\nMost white collar jobs require a college degree. Almost none of them require skills from that degree -- as demonstrated by the fact that they don't require a *specific* degree.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "OhMyGahs",
                                            "body": "I don't think you're disagreeing with them. Most of your points are rephrasings of what they said.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "IAmDotorg",
                                                    "body": "Man, either I explained myself poorly, or you have terrible reading comprehension. I apologize if I was unclear, but I was trying to make it clear they were wrong, both about what the hiring managers were doing and the motivations for what they *are* doing.",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "OhMyGahs",
                                                            "body": "I get that you are explaining stuff from the hiring managers' perspective, but the explanation don't really contradict what they said. Mostly because I didn't get the impression they said the issue was a new development. \n\nI mean, the only part you're really disagreeing is the \"AI\" part, you're still saying the the requirements are buzzwords, just adding the need of said buzzwords and that it was always this way.\n\nAbout the colleges, they say businesses don't care about degrees, you're just specifying they don't care about which degree as long as you have one, which I still see as \"don't care\".",
                                                            "score": 14,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "guassmith",
                                            "body": "I know that job listings have been filled with buzzwords for far longer than AI has been around. Ai is just the perfect tool for making them effortlessly, and is making the problem even worse now.\n\nYou're right that they inflated the requirements to filter out the massive amount of applicants, but people caught onto that years ago. It's stupid to blame candidates for lying. Job postings lie about the job, and candidates lie right back about their experience.\n\nI know businesses like people having degrees. I just think it's perverse that people spend life changing amounts of money on \"education\", when all they really care about is you showed up on time somewhere every week for 4 years.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "IAmDotorg",
                                                    "body": "They do lie, and it tends to go poorly for them. In some industries -- software development being one I'm intimately familiar with -- people across the big companies in a given region have all worked with each other, they all talk, and people get blackballed for lying. \n\nIt also gives an employer a trivial excuse to fire you for cause. And it's a whole lot cheaper in most states to fire someone for cause, so when it come time to get rid of someone, it's worth the hassle to determine if they lied on their resume.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Noname_acc",
                            "body": "> The problem, at it's core, is there are too many jobs that are too easy for people to lie and bullshit their experience with on their resumes\n\nMy experience with interviewing candidates has led me to one, incontrovertible conclusion: interviewing is a pointless crapshoot.  Even if they are totally honest, one hour of a person's day that they have prepared for is not going to tell me if they are a good employee or not.  At best, I am hoping they say something stupid and disqualifying.  On its own, this would be fine.  But there is another, very fundamental problem: actually hiring and firing people is an absolute nightmare.  Were it the case that I could just hire a probationary employee and then can them after 30-60 days if they aren't working out and resume interviewing new candidates, it would be great.  But the modern corporate landscape is such that there is 0 guarantee that I will be able to re-open my staff req after.  This leads into the same thing that you mentioned: the best way to get hired is to be well recommended by someone who is trustworthy.  A good employee's recommendation is worth a thousand good interviews because I know I can trust a good employee to not dumpster their own reputation at the firm by recommending a total clown and wasting my time and potentially losing my staff req.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "justhereforthelul",
                                    "body": "Honestly, from my experience, sometimes hiring through recommendations is even worse. \n\nBecause if the person sucks (which they usually do) it's harder to bring it up because they're the friends/family/so or whatever of a person that's part of the team and people don't want to hurt their feelings or causing an issue that might make them quit.\n\nSo people lie and say they're doing okay when they are not.\n\nYeah, the person who did the recommendation is great and trustworthy, but again from my experience you just end up hiring duds you have to carry on your back until either you finally get them up to speed or they leave.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "sam_hammich",
                                            "body": "Yeah, hiring through recommendations at my company (IT) has not been better than interviewing. This will change as time goes on, but right now at this moment in time, many of the people you've worked with before may have been coworkers pre-COVID. You probably worked with them in an office, and if you're lucky and now work on a team that is primarily WFH, you probably have no idea if that person you are recommending *can* work from home. Maybe they're one of those people who can't, and it blows up in your face. Ask me how I know.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "IAmDotorg",
                                    "body": "I totally agree -- I fundamentally have always felt that I have failed at an important part of my job if I have to hire someone from the open market. It's bad for the team someone is being hired into, and it's bad for the company. \n\nAnd the few times I've needed to, I've made the requirements stringent enough that I'd only get a handful of applicants *and* there were things in the list that were specific enough that I could trivially catch someone playing buzzword bingo and lying about it.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "SolidDeveloper",
                                            "body": "I have 17 years of experience in software engineerings, and for the past 9 years I’ve worked at pretty well known coveted companies. That said, I’ve got none of my jobs through recommendations. Instead, it’s been mostly me applying to job ads, interacting with recruiters or lucky to hear back from the company’s internal recruiter.\n\nThe problem with recommendations is that you can’t really choose what jobs they are for. Your friend at company X can put in a recommendation for you for the Y position, but how likely is it that you want that specific role or to work in their company’s industry? For me it’s almost never been a match. Maybe that just means I don’t have a big enough network.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Philo_T_Farnsworth",
                    "body": "> I have 20+ years experiance.\n\nSame. I have been a Network Engineer for 20 years. I could have gone into management ages ago but just like to work with technology so I've never risen beyond anything like a team lead.\n\nI'll just cut to the chase. I make less money right now and do more work and have greater responsibilities than I did at the job I had 2017. There are more demands on me, there is more pressure to perform, and companies are no longer staffing full teams. I'm lucky to have one person that can back me up at work, and usually that's only in a single technology area. Someone might have my back on F5 load balancing but maybe not have my back on Palo Alto firewalls, or someone might know OSPF really well but be useless at BGP, that kind of thing.\n\nIt's like this everywhere. My skills have been devalued and I am a senior level person at a 400-million dollar revenue company.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Zer_",
                            "body": "Same. I had to take a big pay cut to stay employed. When it's either that or losing your apartment you have no choice but to take the low ball offer, employers know this and will exploit it. The job market is shit. And the simple truth of the matter is we're getting duped out of fair wages.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PotatoDrives",
                    "body": "> Most requiring \"pre work\" assignments.\n\nI haven't looked for a job in years. What do these \"pre work\" assignments entail?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Spud_Spudoni",
                            "body": "I’m in creative work. Usually it’s a prompt (if you’re lucky) to generate an idea or concept based on  a few constants. If you’re unlucky, they’ll just tell you to design something in their industry with no other constraints (which is a pain in the ass to generate a brand new idea out of thin air). You usually will get anywhere from a weekend to 14 days to start this idea, and present a final deliverable/presentation to the recruiter or hiring personnel. \n\nIn every application I’ve done with said “pre work”, it’s always been over a week, and none have ever given any sort of recoup for the labor put in for said application. So it’s essentially 40-80+ hours of free labor, that in my experience, *always* starts with signing an NDA so anything you generate for the application technically belongs to the company you are applying for.\n\nAnyone with a brain can tell you that this should absolutely be illegal. I have a family member in workers comp law, that repeatedly told me to *NOT* do this sort of work for any company. But if you refuse, you just will have your application terminated. It’s a horrible, horrible practice.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "From_Deep_Space",
                                    "body": "I would immediately just stop wanting that job. If this is the employer's attitude towards unpaid labor, it's only going to get worse once you're on the payroll",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Spud_Spudoni",
                                            "body": "It’s extremely common in the creative world unfortunately. Before pivoting out of toy design, I had applications with LEGO, Hasbro, and Jazwares (two of the “big three”, with Mattel not listed) and all of them required a design test before a final decision was made. I’m positive Mattel requires the same. LEGO at least paid for our flights and room and board while we did our ‘workshopping period’. But basically, it’s unavoidable in certain industries. Also to be clear, toy design is not the only industry I’ve done design tests for during applications.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "whiteflagwaiver",
                                                    "body": "Got all that on your resume and are still struggling to find a job? Unreal. Does not inspire me to go back to school to start a new career.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Spud_Spudoni",
                                                            "body": "So these were jobs I applied for right out of school. LEGO, then Hasbro, then Jazwares. Jazwares asked for the most work and then ghosted me for 2 months until I finally got an email back. I worked in freelancing for a few years in toy design, and have a great job in graphic design that pays well and is super cushy now that still allows me time to pursue other product work on the side. Certainly wouldn’t have it any other way seeing what the job market is still like!",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "From_Deep_Space",
                                                    "body": "Oh yeah well I guess I wouldn't expect a big company like Mattel or Hasbro to be ethical employers and wouldn't have applied there in the first place",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "xenthum",
                            "body": "In my case, it's usually something like \"take this raw data and formulate a report for an executive team to review.\"\n\nIt's a good way to show general Excel knowledge and to see how a candidate chooses to summarize and display data, and when it was just like example company name, example people names, random sets of numbers I was fine with it. But lately it requires signing a privacy agreement and I'm pretty sure they're giving out real data and you're actually just generating a report template for companies who just needed a consult but didn't want to pay for one, and the job isn't actually hiring.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Smorgles_Brimmly",
                            "body": "The worst I've had was in construction management. I was sent a 15 page assignment where I needed to answer questions like \"What is a lien?\" and \"What division of the construction documents covers concrete?\". I didn't bother. Anyone who has a construction management degree knows this and those who don't can just google it. Even if you don't know it on the job, it's not hard to find out by just looking at the documents. It was hilarious because they actually gave me an extension on it when I didn't send it back. If they need people that bad, why bother sending a pre screening test? Just call the candidates!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OkSalad5522",
                            "body": "We do one for my company. It's a figma design of a landing page that we ask the developers to recode in a different language, or custom, or change something very specific. It's a great tool to see if they're telling the truth about their X skill. \n\nWe typically say it should take about 10 hours and we pay for the people for those hours. It's only $20/hour but I pushed hard for that because A) 10 hours is a lot of time to ask for a person to commit to non-paying test and I think they should be paid and B) We attract a higher caliber of developer when it's paid.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "403Verboten",
                    "body": "Took me 7 months and I also have almost 20 years experience. Thousands of applications got me 5 interviews. The job I actually got was someone reaching out to me who saw my LinkedIn and \"was impressed\". Definitely wasn't impressive enough for the other several thousand rejections. Even though I've been a lead at more than 1 fortune 500 company.  \n\nAnother funny note, I still occasionally receive reject emails from those applications and I haven't submitted an application in over 6 months. So lots of companies are taking forever to decide or just letting some automated clean up process run after x months.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "MrBaDonkey",
                    "body": "What type of jobs are you looking for? I've found be market is extremely different, depending on the type of job.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Nocto",
                    "body": "I just had 6 interviews with the same company and got ghosted.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Blizzxx",
                    "body": "Hopefully you wrote the word experience right on your resume or it might have a strong correlation",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Kadexe",
                    "body": "I gave up after a month or two, and partnered with a professional recruiter. Never regretted it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sam_hammich",
                            "body": "Are you able to expand on this?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Kadexe",
                                    "body": "There are companies like Robert Half that speak to the companies directly to find out what roles they need filled, and match them with available workers. I've used them since I graduated college, gotten a variety of contract-to-hire experience in my industry, and now recruiters come looking for me instead of the other way around.\n\nResults may vary depending on what education/experience you're bringing to the table, but it's absolutely worth trying if you've been unemployed for months.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BlackDante",
                    "body": "Probably one of the most interesting things I've found through job searching is the amount of jobs that have stupid drawn out application and interview processes, but are also complaining about being understaffed. It's almost like they're doing it on purpose...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "southpaw85",
                    "body": "The worst part is none of “work” matters. They pick you based on some arbitrary bullshit based on their personal tastes.\n\nMost recent Interview I did at a corp. abruptly fell apart in the 3rd interview (why do I have to do 4 interviews to begin with?). It was a remote interview. I showed up wearing a collard shirt and tie. The manager was wearing a baseball jersey and a matching cap for the local MLB team. Weird, really informal for a 3rd level interview but whatever. I’ve worked corporate before so I know the jargon and the talking points. We are syncing up pretty good and seem to have a good connection so I’m feeling like I’m going to get this job. Then he goes off on a tangent about baseball. I played baseball growing up but don’t watch it and have never followed it. I tell him as much and he immediately goes cold on me. He tells me everyone on his team watches his team. Can’t believe I lost out on a career because this man-child based his whole identity on liking a sports team.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fix_until_broken",
                    "body": "I did a round of interviews at a company last summer. It ended up being 6 1-hour long interviews and around 4 tag-ups with the recruiter only for them to tell me I didn't get it. \n\nOne of the hour interviews was probably the worst interviewer I've ever had. She showed up 10 minutes late, didn't even introduce herself, and just started peppering me with questions angrily. I would describe the answer to something and she kept berating me to keep it simple and I should do the math a different way. 5 minutes before the interview was scheduled to end, I interrupted her and asked her a question. She totally flipped out and refused to answer until I finished her gauntlet of questions. Anyways, she would have been my boss and I'm kind of glad I didn't get that one.\n\nIt sucks though, because the other 5 interviewers were delightful and I fully completed all of their questions with like 20 minutes to spare. One of them was done in 30 minutes and we just spent the rest of the time chit-chatting about random things.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PhilosophicWax",
                    "body": "I've went through 300+ applications. It's been about 6 months.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OkSalad5522",
                    "body": "For those of you looking for roles. I am hiring for a tech lead role that has experience with [sticky.io](http://sticky.io) and preferably checkoutchamp. We're offering $40/hour (which I know is low but we're small and trying to grow). \n\nI am very motivated to hire so please DM me!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Triple_Nickel_325",
                    "body": "THIS 💯! I'm going to assume that with 20+ years experience, you and I are around the same age - and ageism isn't only alive and well, it's infinitely worse than the last couple of years. At first I thought it was just lending and real estate (the former is my field), but EVERYONE is feeling the pain.  Current employees want to quit, and employers are scared to pull the trigger on hiring. \n\nWhen/if this freeze breaks it's going to be bonkers IMO.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Avindair",
                    "body": "I've had two jobs ask me for \"pre-work\" assignments. I immediately countered by asking how much they would pay me for that time, and for a guarantee in writing that the material I produced would not be used for commercial purposes. Nothing wrong with either question, IMO; my time is valuable, and protecting my product is part of due diligence.\n\nSurprisingly, I was not called back.\n\nThe corporate landscape is teetering right now. They're betting on people happily becoming digital sharecroppers. Don't let them succeed.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "VenturaDreams",
                    "body": "I fucking hate when they ask you to record a video as your \"interview.\" I never do those. They just use it to train their AI.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "TheUltimateSalesman",
                    "body": "Just no. Get the DM on the phone, not HR.  Don't do tests. Don't do multiple interviews.  Come in like a c-level. Hit the lynx with the president or whomever.  There are more applicants than jobs.  Why would they hire some putz putting in an application?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fuego_9000",
            "body": "Was made redundant at the end of October last year and am now job searching for the first time in twenty years.\n\nIt's absolutely awful. This is harder work than most jobs and I'm just getting more depressed the longer this goes on.",
            "score": 196,
            "replies": [
                {
                    "author": "rjcarr",
                    "body": "Ageism is real in most industries, sadly.  They'd rather pay a junior 50% to be 70% as efficient and make 10x the errors while molding them along the way.",
                    "score": 71,
                    "replies": [
                        {
                            "author": "Delann",
                            "body": "Depends on your area/employers. \n\nThere's plenty of newbies unable to find jobs because everyone asks for experience while not offering opportunities to get said experience.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "8lb6ozBabyJsus",
                                    "body": "You have to be in the sweet spot... not too young or old with a medium amount of experience",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hadtwobutts",
                            "body": "Agism also is happening the other way while out of college people are being overlooked for presumed flaws of genz",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "cr1t1cal",
                            "body": "Well, it’s not just that. In my industry you’ve got, let’s say 5 levels of employment. When someone applies with 25 years of experience to a level 3 job typically performed by younger folks with 5-10 years, it’s a red flag of “why aren’t you applying at a higher level? Is this the most you’re going to achieve in your career?” Hiring managers are looking for people with potential, not someone who has hit their ceiling 10 years go sadly :(",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "whiteflagwaiver",
                                    "body": "Vain to call it a ceiling, from an employer standpoint sounds about right though.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "cr1t1cal",
                                            "body": "Oh it is vain, but when 20 people apply to a single position, you have to have some method of down selecting :(",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AL_throwaway_123",
                    "body": "Your story is the same as mine, but it happened just as I got injured. I used to work in data center deployment. For context: I'm an American that lived outside of America for a decade, and now I'm living abroad again, this time in my wife's country.                \n\nStory in a nutshell: I joined a company in my hometown in May 2024. They do data center deployment and need a guy who speaks the foreign languages that I speak. In august, I got injured (broke a bone in my ankle, couldn't work for 12 weeks). 10 weeks after my injury, I saw the company hired 2 guys who have surnames in the foreign languages I speak. My wife was waiting on her green card and was supposed to visit me in America on a tourist visa. The tourist visa got denied, so I went abroad to see her. The reason I was fired by my company was for taking a vacation to see my wife.               \n\nSince then, I've been studying hard for new certifications and looking for decent-paying jobs.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Doesnt_everyone",
            "body": "What bothers me is that workday, Oracle, and the other vendors that primarily act as third party HR hiring shields, make me create new profiles for every company. Workday knows who I am, they service my current company, they pay me, handle my benefits, and know everything about me. Why the fuck am I creating 300 separate workday accounts with all the exact same information. WORKDAY, FUCK YOU!",
            "score": 192,
            "replies": [
                {
                    "author": "grangerage",
                    "body": "It blows my mind how large companies will farm out their HR services to a 3rd party company yet STILL somehow have 10+ HR generalists on the payroll.\n\nAny time I've needed something that falls within their scope I'm sent a link to an online portal or given the contact info for a 3rd party. \n\nReally makes me wonder what the HR staff even does in those types of environments.",
                    "score": 71,
                    "replies": [
                        {
                            "author": "nox66",
                            "body": "> what the HR staff even does\n\nAct as the royal ~~fellators~~ advisors.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "barryswienershack",
                            "body": "The HR services are not actually farmed out to 3rd party companies. Workday, SAP, etc are HR software systems where employee information is housed. Along with the HR system there is generally an Applicant Tracking System (ATS) and that is where all the jobs, applications, resumes are stored. When you apply to a job, your application goes into the ATS and that is where a recruiter will review it. \n\nSource, I work for a large global company in Talent Acquisition(Recruiting). I swear we are not bad people.\n\nFun fact, AI is not reviewing your resumes",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "madprgmr",
                    "body": "Workday is the only big-name one that fails to fully parse my resume and I have to go back and hand-edit it (loses my first bullet point character, thinks one job is actually two, and doesn't infer word-wrapping). Any time I see \"workday\" I know I'm going to be spending at least 10 minutes just dealing with workday.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Dalans",
                            "body": "Same here on the fuck Workday train. I don't even know how many accounts I have out there because I stopped bothering to save them in my password manager and I use the exact same login for them all. How hard is it to make their system federated? ADP can do it. I weep with joy when I see a page that just has a field for \"Name, email, click to upload your resume\" because at the very least, I'm only wasting seconds to not get a call back instead of 10 minutes of my existence.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "madprgmr",
                                    "body": "Yeah, my password manager has pages of workday logins; I just use the company-specific subdomain so only one password shows up for workday sites I've registered for.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Simply_Epic",
            "body": "A few years ago when I was looking for my first job my dad said something along the lines of “Just apply for 20 jobs every day”. He doesn’t understand how grating applying for just a few is. He hasn’t applied for a job in almost 40 years.",
            "score": 139,
            "replies": [
                {
                    "author": "rabidsalvation",
                    "body": "Yeah, filling out these applications takes a long time sometimes. I spent like 45 minutes on an application yesterday, I doubt I'll hear back",
                    "score": 59,
                    "replies": [
                        {
                            "author": "bdfortin",
                            "body": "”If there’s a job you really want you should apply for it every day until you get it.”\n\nWhen the application process takes 2 hours, has personality quizzes, the page crashes without saving progress, etc? No thanks, they’re clearly making the process as hostile as possible because they don’t intend to fill the position.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "rabidsalvation",
                                    "body": "In my experience, it's mostly considered poor form to apply again and again. You're just bothering them.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Tohserus",
                                            "body": "Well gosh, I wouldn't want to bother them",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ChesterComics",
                    "body": "\"Have you tried just printing out your resume and walking in and asking for a job? It worked for me (40+ years ago). \" That's the out of touch advice I got.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "HeadbuttWarlock",
                            "body": "You forgot \"Go shake the Manager's hand\". That's the second half of that line that I got from my parents in 2006 after graduation. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DoubleE55",
            "body": "My advice if you’re just starting out is if you’re living in a big metro then sign up for a staffing agency. The pay isn’t the best and the contracts are temporary but most positions will be temp to hire. At the end of the day a lot of companies don’t want to take a gamble on someone if they have to hire them outright, but if you’re on a temp contract they’ll give you a shot if they can easily get rid of you if you’re not a good fit. It saves you alot of heartache and headaches applying for jobs since the agency will try to place you where they think you’re a good fit.",
            "score": 91,
            "replies": [
                {
                    "author": "oby100",
                    "body": "For teens, the best advice is to plan a career out now and follow it until you decide to switch to something else. The worst thing you can do in this climate is go for a roundabout approach.\n\nThe deck is so far stacked against us. The staffing agencies are very predatory, but any job is a million times better than no job, so it's fair advice. The counter advice is that you need to work early to never be put into that position at all.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "VoidsInvanity",
                            "body": "You’re not wrong but it’s really difficult(doesn’t even feel like the right word here) to pick a career path when you don’t know what work really is. \n\nI had decided to become an electrical engineer at the “start” of my career path but numerous real world tragedies caused that to be put aside. I did manage to get a career I enjoy but that was luck and persistence I think.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "MrWoodenNickels",
                                    "body": "I had not a fucking clue what I wanted to do when I was in school as a kid. I had hobbies and interests and focused on getting good grades. I had a social life, a rock band, and I was in Boy Scouts and got my Eagle. In 2013 I began college because that’s what we were told to do if we didn’t wanna be failures who end up working at Ford (oh the irony, those Auto Workers are SET FOR LIFE barring automation).\n\nI took Gen Eds for two years while dipping my toes in majors and having a crisis of identity and purpose. I had friends who studied engineering, music, anthropology, mathematics and physics, friends who dropped out and worked in healthcare or trades. One friend dropped out and became an influencer and is very well off now. I stuck it out and eventually got an English degree which changed my life and helped me get my shit together but I did have a bumpy road in the job market and now I’m in the trades. \n\nBut what I’m getting at is I fully empathize with teens and young adults who aren’t on track with their peers in that kind of self knowledge. Sure, at some point, we all just need a job that pays the bills so you should approach work and education with that at the front of your mind. But knowing what you like enough to do at least for a while if not for your life, what you’re good at, what drives you, what you aren’t good at but can learn and improve at, and what you simply don’t have the skills or intelligence or innate personality/temperament/stomach for is really a lot to ask of 16 year olds. It is even harder when you consider the current state of the world and how futile the whole charade feels. Home ownership, disappearing retirement and social security, cost of living, job market saturation in fields that once seemed like guaranteed ROI like tech, academia selling a piece of paper that isn’t worth the ink printed on it sometimes, recessions, mass blanket layoffs, rising fascism, we are at the mercy of so so so many forces beyond our control and you can do everything right and still lose. I applaud any young person who still has the will and the hope and the intellectual curiosity and the desire to rise to the challenge and achieve something for themselves and find what they love to do and do it better than anyone else. But I hold no shame or judgment for those who look out at the whole thing as a moot point and endless barriers to success because for many people, it is and they are stuck.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Apriest13",
                                            "body": "THANK YOU. Been trying to find a good way to out this into words for a while now. Did my first round of college, came out in 2019 (lol right as covid shuts everything down) and was completely jaded about my degree choice. Felt pointless. \n\nBeen working retail a few years just to pay bills and I’m hoping to make my second college run next year, this time for something I might actually be more interested in. Just hope it works out better this time.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DoubleE55",
                            "body": "Sure. The pay will not be great because the agency takes their cut. I’m just very pro this route because it is the route that found me and a lot of people I know their career. Now that I’m in management and looking at people to add to our team these are the conversations we have. “He might not have exactly what we’re looking for but we can try him out for three months and see if he sticks.” I have a very bias perspective but it’s the path that worked for me. Just like to pass it along to kids who feel like they are getting no callbacks and have no working experience.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "cr1t1cal",
                            "body": "This is best. I’m a manager that does occasional hiring. Staffing agencies are, unfortunately, a bit of a red flag. It leaves the thought of “why did you feel you had to get to me through a staffing agency?” Just make a plan. Apply while you’re in school and land a job at a respectable company right out of school. Your job history is permanent. You are either a quality hire, or you aren’t. And if you’re one of the many folks that just aren’t the cream of the crop, you need to make a change, because those folks ARE applying and they are getting the job over you. Hiring is not a charity. There is no guarantees there and you need to start putting your best self forward right out of school. It’s not about bowing down to the man and putting in 60+ hours per week either. Just put in effort and you WILL get picked up.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WebMaka",
                    "body": "Not only that, but if you're young and don't have a career path picked out, temping a variety of jobs can get you some life *and* job experience that can help you work out what you want to work on/with/for.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "VoidsInvanity",
                    "body": "Certainly not a bad start. I did a year solid of working for a temp agency. I had lots of variety of jobs, and I learned a lot about what I won’t tolerate. Transitioning into my career though had little to do with the time at a temp agency directly but I do still appreciate some of the lessons I learned",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Tsquared10",
                    "body": "These staffing agencies and recruiters felt damn near vital for legal jobs. I'm an attorney with plenty of trial experience. I was leaving the DAs office to go private. Couldn't get a call back. I start reaching out to recruiters and suddenly so many interviews and eventually offers. And this isn't in a big market or anything so I can only imagine how much more of an impact it may have in a NYC, LA, Chicago area.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bdfortin",
                    "body": "I find those staffing agencies can be pretty hit or miss. I know some people who’ve signed up, gotten a call within a few hours, and by the weekend they were signing paperwork for a job. Other times it’s months of “sorry, that person isn’t with the agency anymore, your file is now being taken care of by \\[recruiter who will be gone by next week\\]“ and never actually getting anywhere due to all the staff turnover.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wasabi_kitty",
            "body": "It seems like hiring requires many more people to sign off o a candidate now. \n\nI'm a manager at my job and used to be able to hire whichever candidate I wanted provided they passed a background check. A few years back, corporate announced all external hiring would be  done through them. I get calls every day from people who applied, wanting to follow up. All I can tell them is they might get an email.",
            "score": 30,
            "replies": []
        },
        {
            "author": "lukxd",
            "body": "In my recent experience as a hiring manager, I want to highlight the overwhelming number of resumes submitted by what I believe are services based in India. This process is highly automated and done in bulk, particularly in the IT and tech industries. You can receive 200 to 400 resumes in just two days. Many of these candidates are overqualified, have keyword-stuffed resumes, and have only been at their current jobs for two to six months. Why would someone be seeking a new job when they have only just started working? Out of all the resumes I review, I typically mark five percent as qualified. This is achieved by manually reviewing all resumes and collaborating with HR to gain full access and the ability to review them all, which takes many hours. I can't imagine what HR has to go through with thousands of resumes if they don't have a hiring manager reviewing them.",
            "score": 27,
            "replies": [
                {
                    "author": "Volesprit31",
                    "body": ">Many of these candidates are overqualified, have keyword-stuffed resumes\n\nWell yeah, key word resumes exists *because* of how the hiring process works now. It's literally HR's fault. Same for overqualified people. They can't find jobs for their qualifications. At then end of the day, you need a job.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_wanna_be_black",
            "body": "If they can fire me due to ‘at will’ employment and give the barest minimum by law for severance etc. then they will. It’s rare to find a place that cares about employees anymore. My way of dealing with it has been to LIE on the resume, use ChatGPT to know how to lie well, be sociopathically friendly and then if you get the job, check out and do the bare minimum. The employee employer contract has never been so flimsy.\n\nEdit: For the people who think I’m trying to get Chemical Engineering jobs with nothing but retail experience or whatever, chill. That will never work. It behooves you in this fucking horrible job market and economy, however, to tell white lies such as attributing to your own efforts something accomplished by your team, for example. Or adding skills to software you have never used but could learn in 24 hours. Or blatantly copying a job description and putting it in your resume because HR is lazy and AI crazy. \n\nYou think this isn’t justified in this fucking trash economy and job market? Who actually thinks they can turn the tables on the corporate employee dynamic by acting in “good faith”? Face the facts: your company will NEVER give a shit about you if market forces make things difficult or if they aren’t in constant growth. You are not negotiating with a person for your rights or fair, ethical treatment. On the other side of the table is “the bottom line” and a team of people who do nothing but silently point at it when you ask them “why are you treating me so poorly after years of service?”",
            "score": 473,
            "replies": [
                {
                    "author": "rothj5",
                    "body": "It’s crazy because you use AI to create or enhance your resume and then companies use AI to filter through resumes, so it just AIs communicating with each other.",
                    "score": 261,
                    "replies": [
                        {
                            "author": "PotatoDrives",
                            "body": "Dead internet theory, but IRL.",
                            "score": 161,
                            "replies": [
                                {
                                    "author": "rothj5",
                                    "body": "What is the dead internet theory?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "WheelerDan",
                                            "body": "The idea that you are interacting with bots more than you think, that the content you view is generated by bots, the dead internet theory posits humorously that you are the only real person on the internet.",
                                            "score": 56,
                                            "replies": [
                                                {
                                                    "author": "not_nisesen",
                                                    "body": "it's true. I'm a bot",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "nokayy",
                                                            "body": "That's exactly what a bot WOULD say!",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Thundorium",
                                                            "body": "How do you do, fellow bot!",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Flatline_Construct",
                                                                    "body": "*beep, boop, beep*",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AnAnxiousCorgi",
                                                    "body": "Jokes on them I set up an AI to imitate me so even I'm not real!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sovereign666",
                                            "body": "You're one of todays lucky 10,000.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "TheGamblersDice",
                                            "body": "Just the idea that most online traffic/activity nowadays is majorly bots and barely any “real” people interact with each other on the web anymore. It falls a bit on the conspiracy theory side of things without actual useful data to prove this is in fact the case",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "anteris",
                                                    "body": "A larger portion of the “engagement” on X and Facebook is driven by this so they can lie to advertisers",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "Froggmann5",
                                                            "body": "That, my friend, is called fraud. Not only is that illegal, but it is actively monitored/tracked by advertising companies. If they only advertise to bots, they wouldn't sell any product and it wouldn't be worth advertising. You need ads to be in front of human faces for your ads to be worth paying for.\n\nIt should be more than obvious that ad companies aren't just taking Facebooks \"engagement\" at face value.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "anteris",
                                                                    "body": "And yet…",
                                                                    "score": 11,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "ChefDeCuisinart",
                                                                    "body": "Uh huh, and they've been caught doing it multiple times. Your point?",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Froggmann5",
                                                                            "body": "They haven't been \"Caught\" doing it, in the sense that Facebook intentionally employs bots to \"boost\" engagement numbers with the intention to defraud advertisers.\n\nThis also doesn't make sense when thinking about it for more than 2 seconds because:\n\n1. Facebook can completely fake those numbers without using bots.\n\n2. Advertisers track their own metrics, which don't care about the number of bots at all.\n\n3. Advertisers make money when their products sell. If they don't make money selling products on your site they won't advertise there. \n\nAdvertisers don't care if there are 1, or 1 Billion bots using your site. That's not the metric they use to determine if they should pay money to advertise or not.",
                                                                            "score": -3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "ThatGuyWhoKnocks",
                                                                    "body": "It is fraud, but as long as the X% of users who are real continue perceiving the engagement on a post as real and engage themselves, either by replying or clicking on the ad or viewing the ad, as long as the ad agencies/companies advertising are getting what they want they won’t care.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Froggmann5",
                                                                            "body": "Yup, exactly.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Llamaxaxa",
                                                    "body": "I promise I’m not a bot, are you?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Mczern",
                                            "body": "Before I respond can you complete this captcha for me so I know you're not a bot?",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "fingerpaintswithpoop",
                                            "body": "https://en.wikipedia.org/wiki/Dead_Internet_theory",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "os851",
                                            "body": "AI runs everything, all social accounts are actually AI.",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "PotatoDrives",
                                            "body": "Bots talking to bots in an endless loop.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "DaemonCRO",
                                            "body": "Bots making, let’s say, ads for Facebook, which then other bots click onto, and of course not buy anything on the other side. It’s bots making content and bots consuming it. Internet is full of traffic, but none of that is human related. At this moment more than 50% of the internet is dead internet. Just chips talking between them. That number is growing rapidly due to LLMs.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "IAmDotorg",
                            "body": "Also a lesson students these days need to learn -- if you can use AI to get your degree, the jobs that degree qualifies you for are also things the AI can do.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "tarrasque",
                                    "body": "I mean, at the end of the day, AI is a tool to assist in getting the job done. \n\nA carpenter uses a hammer to assist with driving nails, but that doesn’t mean that he will be replaced by the hammer, even if someone makes the hammer better in the form of an air nailer. \n\nOf course, this also doesn’t say that replacement will NEVER happen either. If someone makes a robot with an air nailer, then maybe the carpenter is cooked.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "IAmDotorg",
                                            "body": "> A carpenter uses a hammer to assist with driving nails, but that doesn’t mean that he will be replaced by the hammer, even if someone makes the hammer better in the form of an air nailer. \n\nNo, but the advent of power tool dramatically reduced the number of carpenters needed for a job. Just like the advent of automated pipe cutters did the same in plumbing. Or automated looms in weaving. \n\nAI isn't going to eliminate classes of jobs. But it's already eliminated the number of people needed in many classes of jobs. \n\nAnd that's the point -- if you can get your degree using AI tools, someone *already in that job* can do what you'd be doing using the same tools. And have plenty of time to do it.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "tarrasque",
                                                    "body": "Ah, note I see your point a bit better. I agree.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "buddytheninja",
                                            "body": "Eh, kinda.  \n\nI see the parallel of the equestrian industry at the turn of the 20th century from the 19th as an analogy.  \n\n“Well all the folks who worked in horse industries transitioned to automotive industries”.  \n\nThe problem with that analogy is that we are the fucking horse….",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "tarrasque",
                                                    "body": "Well yeah we are the horse, but if we automate ourselves into obsolescence things surrounding work and our economy will change. I don’t for a minute buy that the ultra-wealthy will keep 8 billion people under their thumbs in some sort of technocratic slavery hellscape.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Hendlton",
                            "body": "I'll have my AI call your AI and they can work it out.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Enigmatic_Baker",
                            "body": "When AI was first coming out there was a surge of ai social networking ai apps where your trained ai would interact with other trained ai before you actually talked to a real person. The ai would do things like apply to jobs, make dates, etc.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MagicSPA",
                    "body": "You have NAILED it.  I'm a graduate with numerous professional qualifications, and I used to believe that with a strong work ethic and diligence and \"adding value\" you could go far in your career.\n\nIn reality, most of the claims and promises and incentives offered by workplaces are absolute HOGWASH.  There is nothing behind the claim that \"we are family\" that's worth a damn, there is no \"valued employee\" that is safe from being sacked at the drop of a hat.  The system is overwhelmingly slanted towards corporate self-interest, and if you can find ANY way to get ahead that doesn't involve  swallowing the bullshit that companies spout then either use that tactic or prepare yourself to end up competing for jobs against other people who will use that tactic.\n\nLife isn't fair, and one of the least fair things about it is how workers are treated, even by companies who claim that it's all about \"respect\" and \"team\" and \"investing in people.\"  We're utterly disposable and they know it, and despite what they say, they act like it.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "I_wanna_be_black",
                            "body": "Preach.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sneezymrmilo",
                    "body": "My father worked for the same company for 22 years and was getting up in the company hierarchy. Then, just before COVID, they fired him without warning because they were making budget cuts. Treated him like he was trash they needed to take out because it was full. Company loyalty means fucking nothing, I agree with you 100%. I'll never give anything more than I have to for my job, not if companies see you as nothing more than a number.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "verschee",
                    "body": "Do the bare minimum while investing heavily into your future**\n\nTake classes, get certifications, skills training, etc.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "I_wanna_be_black",
                            "body": "Yes. This is the way",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "VNM0601",
                    "body": "My current job offers me amazing job security. I'm very close with the CEO and he loves me. And he's not known for firing people. But I'm also capped at 100K salary and there is no room for me to move up. I work from home and have little to do throughout the day. It feels like this place takes care of me. But I need more money, and switching jobs to give up this cushion sounds like a terrible idea. I feel stuck.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "I_wanna_be_black",
                            "body": "Capping your salary is like telling you your salary will be 99k next year, 97k the year after etc. inflation is a bitch",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "VNM0601",
                                    "body": "Exactly. And I live in California. Things are already expensive and not getting any cheaper.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "xenthum",
                            "body": "Since you do so little at work, consider professional development courses or online certifications (make sure it's a real certification, not some udemy or linkedin learning shit that an employer will disqualify you for trying to put on your resume) that you can do while you're on the clock. Get your 100k while you prepare for the next step.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "VNM0601",
                                    "body": "I actually am. I'm working on my Security+ certification.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SirBuckeye",
                            "body": "You may want to look into r/overemployed. Seems like you have the perfect setup to make it work. Basically you just get a second job that’s also fully remote and don’t quit your first one. It can be tricky, but lucrative.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "VNM0601",
                                    "body": "Thanks. I'll check it out. Imagine having to work two full-time jobs just to make ends meet. What a time to be alive!",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Disgustipated2",
                            "body": "What do you do that you have little to take care of but 100K a year?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "VNM0601",
                                    "body": "I manage a small customer service team for a software company.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Splendidmrfox",
                    "body": "Thanks for this, this is the exact energy I need right now.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "netkcid",
                    "body": "It’s doesn’t even stop with the hiring process, even the ramp up and onboarding is barely anything…\n\nScience/tech/engineers are suddenly being treated like cashiers and it fucking sucks.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fix_until_broken",
                    "body": "I'm at a company now that cares about their employees, but too much. Every decision requires a sign-off of 2-5 different people that have been at the company for their entire career. They don't care at all that you hired on as an already competent employee. No one wants to hear anything from you until you have the blessing from one of the golden employees. What sucks worse is these people are so entrenched, they aren't willing to do anything new. It's just the same old bullshit from 15 years ago. If you have a new idea, they aren't interested at all. \n\nSo, lots of seasoned employees join, try to do actual work, get frustrated, and then leave. The company can't keep any good employees, so they hire a bunch of contractors that don't give a shit about any of it. Meanwhile, the golden employees are slowly retiring, but no one is backfilling the positions.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "doubleohd",
                    "body": "Go ahead and downvote me, but if you're lying about skills you don't have to get a job and then plan to do next-to-nothing you are committing theft and fraud. I've had employees like you and it's very very clear what they're doing and I am quick to fire.  Most US states don't even mandate any kind of severance beyond the last day you \"worked\" + any legally protected vacation time.\n\nIf you feel so victimized then go freelance or start your own business.",
                    "score": -21,
                    "replies": [
                        {
                            "author": "Wesley_Skypes",
                            "body": "I don't think you're getting his point here at all. There's a two way street here and a lot of companies are not giving their employees the impression that they give a shit. First sign of trouble and it is layoffs. Those who do get kept on just have to suck up the workload. Guys like him are a product of bad environments. I wouldn't advocate for lying about skills wholesale. But the part about bare minimum, that's what a lot companies do for their employees, so why should he feel more invested in the company than he needs to be? I say this as somebody who is relatively senior in my company and have been consistently promoted every couple of years so it's not been my attitude towards things.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheJermster",
                    "body": "Loser mentality",
                    "score": -46,
                    "replies": [
                        {
                            "author": "I_wanna_be_black",
                            "body": "Corporate dick rider",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "its_justme",
                                    "body": "Why does one of you have to be “correct”?\n\nCorporate culture does suck and defeatist attitudes are loser mentalities. \n\nDo you both just need to be seen?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "I_wanna_be_black",
                                            "body": "Hi - have you been on Reddit before? Lol",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "its_justme",
                                                    "body": "So, was I right lol",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TheJermster",
                                    "body": "Lol I own my own business but thanks",
                                    "score": -37,
                                    "replies": [
                                        {
                                            "author": "I_wanna_be_black",
                                            "body": "Cool Jermster. I guess this CEO is really grinding when trying to take people down a peg on Reddit at 11am on Monday. I’m sure your “employees” love you",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "TheJermster",
                                                    "body": "Take you down a peg? I'm telling you your attitude is that of a loser. You have the capacity to change that. You don't like working for other people, you can change that. Learn a trade, start your own business, or do your best at the job you're at and move up. You have the capacity for change. I didn't like my position in life so I did something about it. Anyone can do that. And yeah, I'm a dentist, in between patients I chill out when people are getting numb I chill out on the Internet 🤷",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "Spud_Spudoni",
                                                            "body": "You being a dentist makes this even better tbh",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "whiteflagwaiver",
                                                                    "body": "Often, their stereotypical behavior goes over their own heads.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "TheJermster",
                                                                    "body": "Better as in.... What exactly?",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "erabeus",
                                                            "body": "You can do everything the original commenter said and still work on yourself or your other opportunities. \n\nIn fact most people probably should check out and put in the bare minimum at work so they have more time to work on their future if that future isn’t working under their current employer.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Metroidman",
                    "body": "I sucks at lying at interviews if they ask me something i dont actually know",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Paddlesons",
            "body": "It's never not sucked as long as I've been alive.",
            "score": 215,
            "replies": [
                {
                    "author": "Makabajones",
                    "body": "My first real job out of college was great, 2007, 1 interview, got hired at the end of the interview and had paid training starting the next Monday, job was entry level QA and didn't pay well but I built a career out of it, every interview since has been 3-5 interviews, temp to perm, and various other stupid hoops.",
                    "score": 94,
                    "replies": []
                },
                {
                    "author": "CharlieTeller",
                    "body": "Ive only been in the workforce for 10 years, and it used to not suck. I'm very much a people person and I like directly communicating with people. I used to send in my resume, but find a way to get the managers on the phone and it worked every time. Or linkedin, I did  early linkedin stalking and would always get responses. Now there's so much spam on linkedin, no one checks them anymore.\n\nNow it's near impossible.",
                    "score": 62,
                    "replies": [
                        {
                            "author": "MalevolntCatastrophe",
                            "body": "> Now there's so much spam on linkedin, no one checks them anymore.\n\nThey have PAID ADS THAT SEND YOU DM's. FUCK Linkedin.",
                            "score": 46,
                            "replies": []
                        },
                        {
                            "author": "johnapplehead",
                            "body": "As a corporate recruiter (please, please - gimme a minute!) I can also tell you we try our best but the job market is so volatile atm and so many people are looking for work, it’s impossible to keep up with LinkedIn messages, direct applicants, internals, referrals, WhatsApp messages, friends looking for work, etc.\n\nUltimately I do try my best but we’re human. It’s impossible to give everyone the independent experience they’re after",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "CharlieTeller",
                                    "body": "I believe you, however most corporate recruiters I meet  fit the stereotype. I hear countless stories from the large companies I've worked at saying recruiters end up throwing out resumes of the most qualified people all the time, and when that person finds a way to skip the recruiter and talk to the manager, the managers get frustrated that they keep getting told that there's no good talent when there clearly is. I wish I could understand it.\n\nI love being someone with an extremely tailored resume, great cover letters, great portfolio, and 10 years experience to never be given one single call from a recruiter for a job that has the exact title that I had and I meet every request in the job description which is also clearly listed in my resume.\n\nATS sucks and while you might be a great recruiter, most of them need to get their shit together",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "mein_liebchen",
                                            "body": "> ATS        \n\n\nApplicant Tracking System?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "johnapplehead",
                                            "body": "So…\n\nFor context, I have a senior role at a large International corporation within the talent acquisition department. And this will hopefully help you if you are looking for work or finding things frustrating! \n\nThe first situation you’ve mentioned is however, very unlikely. One of the core universal targets for a recruiter is Time To Fill (time it’s taken to fill the role from when we started searching). Because of this, if we are handed an ideal candidiate on a plate we will never say no to them as it’s a quick win. If the role has been filled or is at final stages, of course you might not proceed but most businesses will keep your CV on record if it’s that good. I of course cannot speak for 100% of the market here but that situation is extremely unlikely if you’re in the right location and have matching compensation expectations to the role.\n\nThen I’m sorry but I have to be a bit more candid but it’s really just to help. Cover letters mean nothing. Having a CV with the perfectly tailored descriptions also mean nothing. \n\nWhat is relevant is what those 10 years look like. Have you grown in a role? Have you made logical moves to companies and discuss your moves? Have you had success? Do you have gaps and can you explain them clearly? Your CV is not about matching it to the job description, it’s about outlining your career journey and showing your ready for your next step. If you get bogged down in the detail, your CV loses selling power. \n\nAnd lastly, ATS is literally just an applicant tracking system - Literally where your application goes so we can see it, understand the profile and proceed or reject if we need to. That’s it. There’s a gross misunderstanding of what an ATS is, there have been ATS’s since the early 00s.\n\nI hope this helps, a bit.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "CharlieTeller",
                                                    "body": "I appreciate the help!\n\nUnfortunately that first situation I have seen at large companies multiple times. My last role, we were looking for a copywriter for months. Eventually someone reached out to one of us on Reddit of all places and we saw that he had worked at all of our competitors, had a great resume and portfolio, but was trashed by HR team. The HR team didn't know the companies he worked for but we sure did.\n\nI agree cover letters don't matter, but a few times they have for me.\n\nThe one about 10 years experience is the problem though with what you're saying in my eyes with recruiters. So on my resume, you'll see me move from an independent contractor, to a small agency, to a bigger agency, to 3 promotions within the agency, to  VERY well known brand, 2 promotions there, and then unfortunately a layoff. My trajectory is ideal and all the companies I've worked for are household names. However, I get written off by recruiters all...the...time.\n\nI wish I knew why.  Maybe you could educate me more on this, but with my credentials which honestly are pretty solid, I sent out something like 100 resumes last year (while still employed on the hunt) and had 1 interview. 1. I don't apply to dead jobs. I usually check daily and ONLY apply when sorting by posted within 24 hours. I did this every day.\n\nIn my last stint after layoffs, I sent out 20 a day doing the same thing to quality postings. I had 4 interviews out of 150 sent out.\n\nI'd be interested to hear your advice there.",
                                                    "score": 10,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "reeemaji",
                                                    "body": "> What is relevant is what those 10 years look like.\n\nI think the core issue is (most) recruiters aren't fit to judge this. Frankly, it would be absurd to think a recruiter should be fit to judge this for the entire breadth of roles most corps need. I've worked mostly in technical roles, and recruiters do rule out candidates ALL THE TIME that should have been, at least, interviewed. \n\nOne big thing that stands out to me as a clear example of where I don't align with HR:\n\n>Do you have gaps and can you explain them clearly?\n\nNearly every person I've worked with, every manager I've worked for, and certainly in any interview process I've been a part of - We do not give a shit about this. Sometimes people have gaps, people are laid off and often people are forced to take time off work for a multitude of reasons. If an employee has relevant work experience and the skill set I'm looking for then I really don't care if they have a gap in their resume. A background check will catch anything that would disqualify them, this is just a needless question that will potentially weed out some good folks.",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Volesprit31",
                                                    "body": "No offense but I'll outline a few issues I see with your answer:\n\nAccording to you guys, what is a bad justification for a gap? If I'm telling you I got super sick or if I'm telling you I just wanted to take a very long vacation, I don't see how that gives you any insight on my skills and abilities. Honestly this is a backwards way of thinking \n\nWhat's a *logical move* between companies? How can *you* judge what was logical for me at the time? Maybe I hated my coworkers, maybe I hated the job, maybe I hated the company, maybe I was just bored. You can't explain that on a CV. \n\nSame as you can't explain a career on a CV. The only way to correctly do that is during a interview.\n\nYeah I'm bitter, and I never even had any issues finding a job.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "aquoad",
                                                    "body": "i realize that anecdotes are not data but i sure wish when I hand the recruiters at my company a candidate we’ve already basically chosen that they wouldn’t just ghost them until they get annoyed and take a different job.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "JMEEKER86",
                                    "body": "I think the main problem is that pay/benefits are stagnating so much that it's inducing high levels of churn. People shouldn't be having to look for a new job every two years just to get a raise. And the shift from pensions to 401Ks has gotten rid of any incentive not to do so. What's more, hiring people is *expensive*, so having to hire people every two years rather than every 20 years causes a lot of overhead. And in the end the corporations end up having to pay market rate to replace the people who left anyway. So it's all just a huge gamble by the corporations to see how long they can string people along to keep their quarterly numbers look good and then when it bites them in the ass they also end up jumping ship. I guarantee that all of these corporate efforts to save money are just costing them even more money in the long run, but corporations have become incredibly myopic.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Spud_Spudoni",
                                    "body": "Taking you at your word, sure. However, of the recruiters/ HR people I know, they along with those in their line of work just generally don’t give a shit about who they’re hiring as long as the personality and experience is right for the company. And generally they’re not put into a position to care because it’s enforced by the industry, which enforces who gets hired for HR. It’s an open understanding in my field, that creative portfolios generally get the *single first page* looked at by most hiring processes, and if it doesn’t impress after 10 seconds of time, it’s tossed to get to the next of a hundred plus applications.\n\nOutside of my industry, it’s just general apathy all around from recruiters. I feel like a lot of them get some cruel satisfaction out of being judge jury and executioner of people’s livelihood. You pretty much have to be a sociopath to excel as a recruiter. The system is entirely broken, and you’re unfortunately part of the problem just for being involved with it. Although there’s not much for you to do when most employers view new hires like livestock.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "johnapplehead",
                                            "body": "Most of what you’ve said there is very hard to follow so I’m not sure if English is your first language but I’ll try my best.\n\n‘They don’t give a shit about who they hire’ - just completely untrue but ok. \n\n‘They get satisfaction out of being judge and executioner’ - you’re massively over selling the part a recruiter plays in the decision process. Largely the role of a recruiter is to assess as many CVs they can in the first 2 weeks of an open role, screen/interview them - assess core, basic skills and then pass 4 - 6 candidates through to hiring managers or the rest of the process where they will make final decisions.\n\nI understand that the world of recruitment and people looking for jobs is tough, and the system needs to be reviewed. But people shitting on recruiters for literally doing their jobs has become the go-to thing when the much larger issue is there are large industries and corporations putting people out of work or creating unstable work environments, at mass and as a result, the job market is more competitive than ever meaning recruiters are flooded with applications.",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "Mudders_Milk_Man",
                                                    "body": "Their writing isn't even remotely hard to follow.",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "Spud_Spudoni",
                                                            "body": "By their other replies, they seem a bit jaded by the responses they’re getting",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "xenthum",
                                                    "body": "> Most of what you’ve said there is very hard to follow so I’m not sure if English is your first language but I’ll try my best.\n\nI think we just figured out what's wrong with corporate recruiters. They can't read.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Spud_Spudoni",
                                                    "body": "Tbh, if that was that hard for you to decipher, in plain English, then you are making a terrible point for yourself in the ability to decipher data you’re reading with the type of work you do. What a condescending response lmao.\n\n> just completely untrue but okay\n\nThis is quite literally the words spoken verbatim by friends I know and the way recruiters work while hiring for the state I live in. But okay.\n\n>you’re massively overselling the part a recruiter plays in the decision process\n\nGives example of how your job involves weeding down any and all applicants until you are responsible for presenting the handful, at most, of candidates you think are right for the role. Sounds like you’re judging a *lot* of applicants there, no? Many hiring roles are still actively involved in the decision making process past that point, even if you personally are not.\n\nI think if you’re involved with being a recruiter, being *this* defensive over the idea that there’s certainly *an ability* for recruiters to abuse their position because the system is broken to allow said abuse, says a lot.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "johnapplehead",
                                            "body": "Pick and use 2? \n\nLinkedIn is a completely open method of candidates contacting you. You can’t control who messages you. \nAnyone can apply for a role. \nAnyone can refer. \nFriends are open to contact to me. \n\nYes I’ll block all my friends and stop letting people apply for roles! Why didn’t I think of that!\n\nEdit: I’d like to add, I wasn’t complaining there. I was explaining why the recruitment process is losing its personal touch. But fuck me right",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "CharlieTeller",
                                    "body": "You can be nice ya know?\n\nAnd no it's always sucked. I never said it didn't. It was just much easier to get in touch with people. I got interviews galore and had crazy calls with important people. I remember trying to find an internship fresh out of college and easily got in touch with an exec at NBC. Now it would be near impossible.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Hendlton",
                            "body": "What I usually do is use one of these sites to find a job listing, look up the company website and find an e-mail. Then I send my resume there.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Domukin",
                    "body": "Just because it’s always sucked doesn’t mean than it’s not worse now, or getting worse or simply that it’s an issue worth correcting.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Philo_T_Farnsworth",
                    "body": "I'm just old enough to (48) to have seen middle-class people with less skilled jobs be able to raise a family and have enough left over for vacations and putting the kids through college, and then to see that lifestyle slowly degrade until it no longer existed anymore.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "LevelStudent",
                    "body": "The internet has made it significantly worse. Unless you're like 15 it is objectivly worse now. The internet has made it too easy to find candidates,  so companies are able to offer much worse and still be flooded with applications. Technology has just added more and more hoops to jump through for applicants while quadrupling the competition, all the while its gotten easier for employers.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "twbassist",
                    "body": "When I was applying for 'better' jobs back in 2008 (yeah, it was a great time to be in my mid-20's), it had started to shift to the modern way in most cases. However, the verbiage wasn't nearly as bad and I could tell what I was applying for without needing to speak any code.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "DeepSpaceNebulae",
                    "body": "One thing that definitely changed a lot over the years, companies don’t nearly want to train people as much anymore.\n\nThis is especially apparent in trade jobs.  No one wants to hire and train apprentices who themselves require that training to become licensed.  At least around where I am, but that’s less of a corporate issue",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Hendlton",
                            "body": "Really? I've always heard that there's a massive lack of tradesmen and that they're basically taking anyone with a heartbeat. At least around here they're all offering decent starting salaries even with no experience. Like you said though, it's probably due to the location.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DeepSpaceNebulae",
                                    "body": "Even where I am there is a shortage of tradesmen, but at the same time don’t think I’ve hear anyone not complain about the annoyance of finding apprenticeships even though the shortage should be driving it to be easier",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "opposing_critter",
                            "body": "Yeah this is a big one too compared to 20 years ago where they would actually train you and it was normal.\n\nNow it's fuck off we won't even look at you unless you have the training and experience from some where else.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "neohylanmay",
                    "body": "I got made redundant from a previous job at the start of 2009. I've worked a grand total of *two* jobs since then.  \nOne was in 20*17* (which I had to quit a month in because they were not scheduling shifts) and the other was a six-month contract in 20*23* (and it wasn't even the one I had applied for).\n\nEven back then I would send out an application and not hear a goddamn thing. The Internet didn't change that.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Kithsander",
                    "body": "Yay capitalism.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ChanThe4th",
                            "body": "Things were FAR worse before capitalism.",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "HendrixChord12",
                                    "body": "Well yea, they didn’t have pizza flavored combos.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "pepperoniMaker",
                                    "body": "What's your point? \n\nJust because it theoretically could be worse doesn't mean what we have now is infallible.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "The_Clamhammer",
                                    "body": "You mean like in the 1700s or something?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Soulegion",
                                    "body": "Things were FAR worse before electricity, but you don't see people lining up for their turn in the electric chair.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sir_rockabye",
                            "body": "People who post this should really modify it to \"Yay capitalism, but seriously every other system sucks worse.\"",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "Chesus42",
                                    "body": "Seriously. Do yall really want the alternatives? They are far, far worse.",
                                    "score": -6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "7point7",
                    "body": "How long have you been alive? My first professional job out of college didn't pay great out of the gate but had good progression ($37K then $45K in 2 years then promoted and made $65K in year 4). Meanwhile it was a well-run business, everyone was friendly, and people genuinely cared about the work and each other. That was 2012-2016. \n\n  \nSince then, everywhere I've been (3 other companies) has had nothing but apathy, disgruntlement for leadership, and just this corporate blood sucking culture that drains the will of everyone involved. \n\n  \nIDK if something changed in that time or if it's just natural differences in a few limited workplaces. But man... I miss that first place for real.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gottago_gottago",
                    "body": "If you're young*, you don't know that it was better once.\n\n(*): under 40.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "itsturningred",
            "body": "This resonates all too well with me. Got let go of my job in January after 11 years of working at a company, was given no reason, was given no severance, just a pat on the back and a \"good luck\". \n\n2 months to the day I'm writing this, I have sent out over 300 applications, have been given 4 first round calls, and have gotten 1 interview. \n\nWhat no one tells you is how predatory Linked In can be, users beware it is flooded with bots. As soon as you put your \"open for work\" status up, you will be inundated with fake accounts that are going to try to get you to buy a \"resume updating service\" or some product in the vein. Do not entertain this, thoroughly check the profile of anyone messaging you because 9 times out of 10, it's a bot or some scalper looking to pawn you off to a service and not actually help you. \n\nThe process is going to be draining, make sure to keep sane by exercising, eat right, and overall find something to keep you busy in the between job phase. \n\nBest of luck to all of you out there experiencing the same thing.",
            "score": 35,
            "replies": [
                {
                    "author": "7point7",
                    "body": "I had 8 interviews (5 rounds) for two separate roles at a company... after all this they decided to not even hire for either of the positions! Just wasted time. One of the roles I didn't even get the courtesy of anyone on the team or recruiter to inform me as it was decided 3 weeks after they closed out the other role. I had to find out via an automated survey about the process and networking with people at the company to find out was going on. \n\nAdditionally, I sent each interviewer a personalized thank you email and only one of them had the decency to respond. And these interviews went well too! The recruiter was very positive the whole way, reassuring me that I was the #1 candidate at the time. But I'm guessing most of the team is just pretty apathetic, checked out, and watching out for themselves in a time of great economic uncertainty... which I get. But it doesn't make it suck any less.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ussbozeman",
                            "body": ">  after all this they decided to not even hire for either of the positions\n\nthey hired, just not externally. per se (tips resume) they probably had to do it to make it seem they were actively looking, when the person who got the job had an in with the company.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "7point7",
                                    "body": "Nah, I had it confirmed by people I know at the company they are on a hiring freeze until end of Q1. Roles might open back up afterwards. Which sometimes I understand putting on a hiring freeze, but it's owned by a corporation that is in the F100 and made $6B in profit last year. I think they could afford to have an extra person on payroll for 6 weeks...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BrianMincey",
                    "body": "The “scalpers” are disgusting. If the person who contacts you doesn’t immediately name the company, just hang up and block them. A legit recruiter will never hide that.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "newtrawn",
                    "body": "Ironically, eating right is the most expensive kind of eating. Hard to eat right when you’re flat broke.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "kaltorak",
            "body": "when i was your age i just marched right into an office and said “Give me a job!” and they said “okay, son!” and i was vice president.",
            "score": 155,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 120,
                    "replies": [
                        {
                            "author": "KarIPilkington",
                            "body": "It's mad how there's a generation of people who genuinely believe that to be true.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "Mertag",
                                    "body": "It was true once upon a time. The good ol' American dream was stolen from us.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "nox66",
                                            "body": "The fact that there was a time when a company could look at your resume, say \"you could probably do it\", and make a concerted effort to _teach you_ sounds almost Byzantine. Where we are today is the result of caring about short term profits, efficiency, and nothing else.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Squiddlywinks",
                                    "body": "It was, for them, 40 years ago.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "saosebastiao",
                                                    "body": "It definitely was like that when Reagan got to office. Hell, it was like that to some degree even in the 90s. It was Reagan and his legacy that changed everything, sure, but it didn’t happen like a switch. Slow defunding of education, protectionist housing policies, socialism for the rich, etc.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "xenthum",
                                                            "body": "It was like that right up until the mid-80s for most industries. That's when Jack Welch worship started happening and corporations started copying his philosophy from GE, alongside the Reaganomics policies changing the labor landscape. Reagan funneled money to the rich and killed work protections, Welch taught every company that they should lay off x% of people per year and never give raises and that it's less expensive to pay the lawsuit than to make a good product. It was a 1-2 punch that killed corporate America.",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "WebMaka",
                                    "body": "Worse, there was a generation for whom it actually was. They subsequently ruined it for their descendants.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "saosebastiao",
                                    "body": "It’s even more maddening that *they were the generation that made it false*.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Whoa1Whoa1",
                            "body": "Well that advice actually worked before. In the 1960s, the average college tuition was around $500 per year while the average wage was $2/hr. You actually could work a near minimum wage job for reasonable hours and pay your way through college.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "akaispirit",
                            "body": "My grandma told me once she didn't understand why it was so difficult for people these days. When she had been working still there was a young lady who worked there part time while going to school and she never had trouble paying the rent on her one bedroom apartment.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Kent_Knifen",
                            "body": "Back in the day, college tuition was cheap and you literally could work a summer to pay for the next year of school. \n\nBut times have changed and older folks don't know how expensive college is, unless they're helping pay for their kids to attend.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "correcthorsestapler",
                    "body": "My dad was part of the boomer generation. He spent most of his work life in radio & retired from the VOA back in 2010 or 2011. The last time he had applied for a job was in 1990.\n\n\n\n\nWhen I was having trouble finding work while in college around 2007 & 2008, he kept telling me to just march right into a company, ask to see the manager, and hand them my resume; said that’s how he always found a job when he was in college (in the 60s).\n\n\n\nTold him that it didn’t work like that anymore, but he was persistent. So I thought, sure, I’ll give it a shot; that way I can report back and let him know. Went to one of the stores nearby, did exactly what he suggested, and got the results I expected: an eye roll from one of the employees and the manager laughing & telling me to take a hike & apply online like everyone else. Told my dad; he goes, “Well, try harder!”\n\n\n\n\nFast forward to 2015 or 2016: my dad was bored with retirement & looking for work. He tried his method a few times and got similar results. He finally caved and started applying online. Every time I visited it was a new complaint about how awful the job market was and how companies needed to do better. Despite having 20 years in the government with top secret clearance, none of that mattered to places like Home Depot or the local grocery stores. He was always pissed about how hard it was to find a job.\n\n\n\nI only told him “I told you so” once after hearing his complaints several times. He seemed a little agitated by that, but I could tell he knew I was right. He ended up apologizing for not understanding the situation when I was having trouble myself.\n\n\n\nFunny enough, he *did* end up finding a part time job with a ham radio equipment shop around 2019. Only to then discover soon afterwards that he had liver cancer, which rapidly spread throughout his body & killed him in 2021. That was four years ago this week.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Volesprit31",
                            "body": "Daaaamn, how do you get bored from retirement?! That's awful. So much time for so many hobbies!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "VicariousNarok",
                    "body": "This has the same energy as my dad telling me \"just go in and ask to talk to the manager to give him your resume in person\".  Yea dad, I've tried that, they tell me to upload it to their website.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "yaosio",
                    "body": "I want to share an unexpected experience that taught me about priorities, compassion, and the unpredictable nature of opportunities.\n\nYesterday, I was rushing to an important job interview when I spotted a distressed dog limping near traffic. Despite knowing I'd be late, I couldn't just walk away. I spent 30 minutes helping this poor pup, finding its owner's contact info on the collar, and ensuring it was safe.\n\nI called the company to reschedule my interview, explaining the situation honestly. To my surprise, they asked me to come in immediately. When I arrived...plot twist! The receptionist led me to the CEO's office where I found the SAME DOG sitting behind the desk in a custom suit!\n\n\"So, you think helping random animals is more important than punctuality?\" the dog barked through some bizarre translation device. \"Our time is valuable!\"\n\nHe then pulled out legal documents, and now they are suing me for \"wasting company resources\" and \"deceptive practices in an interview setting.\"\n\nThe lesson? Always be on time no matter what happens.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "sybrwookie",
                    "body": "Years ago, I remember the most boomer post I've ever seen.  Someone exclaiming that kids are just lazy and they should do what he did:\n\nHe grew up in bumfuck middle of nowhere.  Graduated high school, bought a good car for a couple hundred dollars and drove to Boston.\n\nHe then slept in his car that night, got up first thing in the morning, marched into the first factory he found, and got a job on the spot.  That job was enough to pay for him to rent an apartment (in downtown Boston) AND enough to pay for him to go to college there (which of course he applied for after he got there and got that job).\n\nHe graduated and was quickly given a high paying job and quickly rose in the ranks and is now very well-off because of his hard work.\n\nI explained how literally every detail of what he said how he did things does not work that way anymore, but he was having none of it.  It MUST still work that way and everyone is just lazy now!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "n0ahhhhh",
            "body": "I remember searching for my current job... I was changing careers (which in itself is already an extremely challenging thing to do) and decided to keep track of my applications and the results. I believe I stop tracking them at around 160... \n\n\nIt was the most discouraging period of my life. I eventually used one of those career services that helps you with your resume, interview skills, tech skills, etc. to help me find a job. They required you to apply to a minimum of 20 jobs a week, and if you didn't meet that quota, you were removed from the program.\n\nI was desperate. I'll admit that before them, I wasn't getting many interviews. After I started with them however, I was getting around 1 interview a week. I eventually got my current job, and I remember straight up telling my adviser that I will take the first job offer I can get because I was so desperate for an income.\n\nAll in all, I estimated that my job hunt was ~400-500 applications long. This was in 2022-2023. I'm not really happy at my current job, mostly due to my immediate manager - but I can't fathom trying to search for another job right now. It feels so daunting... but the plus side is that at least I am currently employed, and theoretically it should be easier to find a job whilst employed so... fingers crossed?",
            "score": 12,
            "replies": []
        },
        {
            "author": "smakweasle",
            "body": "I once went through four interviews for a gig where they sent me a letter saying they decided to leave the position unfilled. I knew the other candidate pretty well and we were in friendly competition for it. They did the same to him. \n\nThe time wasted for all parties was incredible.",
            "score": 22,
            "replies": []
        },
        {
            "author": "Spankyzerker",
            "body": "Every single job i apply to i get auto reply saying thanks for taking the time, but unfortunately..yadda yadda.\n\nMy older parents are always like \"Just go into the office and ask to apply\".  I'm like that isn't a thing anymore, %90 of the jobs i apply for don't even have a office to go INTO.  Its just a warehouse. lol  The %10 that do just tell you to fill in application online.",
            "score": 16,
            "replies": []
        },
        {
            "author": "EvilRyan",
            "body": "Corporate culture ruined jobs years, even decades ago. Not saying that there’s not nuance to this video, but corporations have never been anyone’s friends, and never will be.",
            "score": 14,
            "replies": []
        },
        {
            "author": "redditRW",
            "body": "This just sucks. Corporate America used to believe and train new hires.\n\n\nNow we're all getting screwed.",
            "score": 13,
            "replies": [
                {
                    "author": "sybrwookie",
                    "body": "Sure, maybe 50 years ago.  That time is LONG gone.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "redditRW",
                            "body": "Yup.  And I doubt it's coming back any time soon.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wmmartin",
            "body": "About to suck even more when the market is flooded with federal employees that were cut in the upcoming RIF.",
            "score": 9,
            "replies": []
        },
        {
            "author": "simonbsez",
            "body": "As someone who interviews and hires people, a lot of the job candidates these days suck as well. People blatantly lie on their resumes and at interviews, which in my experience wasn't as big of an issue 15 years ago (there seems to have been a big cultural shift). This creates a huge burden on the employer because onboarding costs a lot of time and money. So we have to go through multiple interviews, check with references and previous employers, pull background checks, run competency tests, etc. And we still get fooled and find out months later that this person doesn't have the learning ability to use a pencil sharpener.\n\n\nI think the job market has become so competitive that people just apply for everything they can and see what hits they get. The employers use generic descriptions, are secretive about the compensation, and ghost their applicants. The job applicants use generic resumes and lie about their abilities and ghost the employers. It's a crappy situation all around.",
            "score": 60,
            "replies": [
                {
                    "author": "garlicroastedpotato",
                    "body": "The internet has kinda ruined HR jobs.  Because yeah, you go on Indeed or Kijiji or LinkIn and people just hit one button to submit their resume to you, it leads to thousands of applicants but not all even interested in the job.  I have to do HR work sometimes when hiring season picks up and like I might spend two days calling up hundreds of people.\n\nSo many people haven't updated their resume in a long time and have put down the wrong phone number.  You call someone and they just say wrong number not looking for work.  Once you get a slate of candidates for an interview you call up their references to find out so many of them were not informed they were references or just don't know who this person is.  I called a McDonalds thinking that was an old work place, no he just put the phone number of the McDonald's down and his reference did not and never worked there.\n\nThen you get to the interview and they almost always act like they're God's gift to employers.\n\nHiring temps is even worse.  I had one days worth of work and a temp agency referred to me to a guy with the skills I needed.  He insisted he couldn't work the full day they we needed him just a half day.  Great now I have to find a temp who can work the other half of the day to fill that one job for that one day.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "HendrixChord12",
                    "body": "It seems like there just aren’t enough jobs paying a decent wage. Add in all the layoffs over the last 2 years and it really compounds. I see job ads paying $50k in NYC and want experienced people. It’s nuts.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "GoodbyePeters",
                            "body": "Come to mid west and work a Union factory job for 80-100k a year\n\nAll these white collars not working for a year gotta wake up",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "HendrixChord12",
                                    "body": "I make around that at a WFH job but thanks for the offer. Not feeling secure in my current job. When we’re about to face a recession, those factory jobs aren’t safe either.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "GoodbyePeters",
                                            "body": "This one is safe\n\nI see so many wfh people on reddit crying about work\n\nWe're always hiring. Never stopping.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "sybrwookie",
                                                    "body": "> We're always hiring\n\nAh, so that means the job is awful for one or many reasons, so you have constant turnover.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "GoodbyePeters",
                                                            "body": "No one leaves here.  It's Ford plant.  We keep expanding. 6 shifts.  2 models\n\nWe need more workers for new jobs.  Literally no one quits here. Money is too good. Insurance is insanely good.",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gonzo_gat0r",
                    "body": "I’ve been on both sides of the process and agree. But I’ll say, about 15 years ago I noticed jobs I knew didn’t require certain skills started inflating their requirements. I’d hear the excuse of it filtering out unqualified applicants, but there was a threshold where it just encouraged candidates to start lying, unfortunately. I never lied, but I saw jobs that I knew didn’t need certain skills (like a graphic designer need to know After Effects or Python) and realized honest applicants were just getting overlooked in favor of liars if those were the keywords companies used to pick candidates.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "BeyondElectricDreams",
                    "body": "> (there seems to have been a big cultural shift)\n\nCompanies abused the good-faith employer-employee relationship for decades at this point.\n\nThey expect company loyalty when they've abused the worker's good faith in the system for decades. Work hard and be promoted? No, you're irreplaceable at your low-payed position. Stay loyal to the company? Get abused with below-market-rate-for-your-labor pay with newhires you're expected to train making more than you.\n\nGive us a well written resume, that we will promptly ignore, then rewrite all of that into our proprietary form, which we will also probably ignore. \n\nGo above and beyond for us and work super hard to meet a quarterly goal, so we can reap the rewards of your work and give you a slice of pizza. \n\nDo people wonder at ALL why there's a shift?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "sam_hammich",
                    "body": "> People blatantly lie on their resumes and at interviews\n\nProbably because so many job postings are padded with bullshit requirements that have nothing to do with the job. People looking for an entry level job wouldn't feel compelled to lie just to *get* an entry level job, if every entry level job didn't require 5 years' experience.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Kent_Knifen",
                    "body": "This is an interesting contrast to read against the current top comment, which talked about lying on their resume and using ChatGPT.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "terrendos",
                    "body": "I'm sure it doesn't help that, to avoid any risk of litigation from former employees, most companies won't actually provide \"recommendations.\" The most they'll do is verify an employee worked at their company from dates X to Y. So you could potentially say you did almost anything there and it would be difficult to confirm.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "rabidsalvation",
                    "body": "Shit, man, I missed an interview this morning. Messed with the parking meter for 10 minutes, it wouldn't accept my card. I went and grabbed some change, came back, and the coin slot was broken. I just got in my car and went home. Fuck this life.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "flume_runner",
                    "body": "To give context on why the lying is high, I’m a college grad class of 22, got a great paying job after a year of searching and was let go 1 month in. Boss hated me and my work. More months go by and I get a different entry level role in a completely unrelated field. My team was slashed in half for layoffs after a new Vp came in about 6 months in. I’ve applied to hundreds of jobs. The market is so flooded with 3-5+ years experience and entry level roles alike are few and far between that lying is a must to stay competitive. being 3 years out of a college with a good degree and school I’ve had easier times getting jobs in highschool and college then my post grad career. Fuck this job market. if lying gets me ahead and allows me to put a roof over my head I could care less about how it impacts others, I have bills to pay and mouths to feed. Call this, the effects of late stage capitalism",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Tommy2255",
                    "body": "It's fundamentally a problem of respect, and the source of the problem is 100% on the corporate end. Why wouldn't you lie on your resume? Why treat a corporation with any respect when they won't do the same for you? Every time corporate profits continue to rise even as layoffs continue to get worse, it just continues to prove that companies don't have any loyalty to their employees, and any scrap of loyalty the employee foolishly offers their company is nothing but a weapon against them, used to get them to do more work for less pay.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "MinorPentatonicLord",
                    "body": "> People blatantly lie on their resumes and at interviews\n\nMy resume is full of lies because it's the only way to get hired anymore.  I wasn't getting shit until I just started making shit up.  It's actually a lot of fun to see what you can come up with.  The whole hiring process is so fucking bad that I just don't care anymore, I need money to live.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "oby100",
                    "body": "It seems the competency issue lies with you if you hire multiple people who cannot do the job.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nisas",
            "body": "Been like this for at least 10 years now. Except the part where AI throws your application in the trash. That's new.\n\nIt's why it took me 2 years to find my first job out of college. Nobody told me how this worked. Videos like this didn't exist yet and my parents never had to go through this shit.\n\nI foolishly searched for positions with no experience requirement, and the few that I found ghosted me without me realizing it.",
            "score": 12,
            "replies": [
                {
                    "author": "sybrwookie",
                    "body": "> Except the part where AI throws your application in the trash. That's new.\n\nBefore it was an algorithm looking for keywords/phrases, now they call it an AI.  Same shit rebranded.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "quietflowsthedodder",
            "body": "HR has progressed from shooting the wounded to torturing the unwary. I hate them with a passion!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Canadian_Invader",
            "body": "I got my current job by knowing a guy already temping at this company. They brought me on as a temp. I left twice to work elsewhere for a seasonal job. They'd been trying to hire me on full time after I came back yhe first time and I actually turned them down. But told them If they wanted to hire me after the summer I'd sign on. Didn't have to interview. They even fast tracked me through corporate to get me hired before the raise cut off deadline. Very nice of them. But it's taught me it's who you know. Really knowing anyone inside already is a massive advantage.",
            "score": 2,
            "replies": [
                {
                    "author": "xlinkedx",
                    "body": "It's 100% who you know. There's a reason why so many employers have an employee referral program. They'd rather take a shot at interviewing someone that a current employee is essentially vouching for than deal with hundreds of random resumes. 9 of the last 10 jobs I landed were from referrals. It lets you skip the line on applications, putting your resume on top of the AI screened stack with an additional note of \"have a human actually at least look at this one.\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "innovatedname",
            "body": "This video needs to be rammed up the ass of anyone who writes a \"why does nobody want to work\" article.",
            "score": 7,
            "replies": [
                {
                    "author": "Drago1214",
                    "body": "Not to mention all the fake jobs for company’s to get tax breaks. The job may exists but they want to 110%.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "velociraptorfarmer",
                            "body": "Or the unrealistic postings companies put up as a hoop to jump through in order to offshore the position or hire an H1B.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BizzyM",
            "body": "Q: How do I get my first job if every job says it requires 5 years experience?\n\nA: Lie.  And they expect you to.  You lie and say you have 5 years experience, and they know you're lying.  They just overlook it.  They say it doesn't matter, really.  But, down the line, they may decide that they want to get rid of you.  The easy solution to that is to say \"Hey, it's a Right to Work state, we don't need a reason.\"  But the truth to that is that they know you will push back and cause a stink about being let go.  Instead, they get you on lying on your application.  \"you didn't have 5 years experience!!\".",
            "score": 22,
            "replies": [
                {
                    "author": "blazze_eternal",
                    "body": "Or, bend the truth.  \nLooking to get a computer position but have no \"professional\" experience? Explain how you've helped friends, family, etc with relatable experiences. Discuss projects you've worked on yourself, for school, or volunteering.  \nThe \"5 years experience\" line is basically just a filter of 'please at least know what we're talking about when we train you'.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Left_Cash_8796",
                            "body": "Maybe I'm a cynic but I don't think employers want to hear about your class projects",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "velociraptorfarmer",
                                    "body": "I've had ones that were impressed that I was an engineer who had actually turned wrenches helping my grandpa fix stuff out on his land while growing up.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kent_Knifen",
                    "body": "I just yolo it with an honest application that reflects the lack of professional experience. You'd be amazed how often those experience requirements are flexible and hopeful on the employer's part.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "DoubleE55",
                    "body": "I said this further down the chain but temping for a staffing agency is a great way to get experience when you have very little to none.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "KnightsLetter",
                    "body": "Just put the years: end of 2021 to start of 2025 is closer to 3 full years but “sounds” like 5. Not a single salaried position I’ve ever applied for has cared about tenure at past positions if it’s not in the months. All their interview questions are about experience",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ricardoconqueso",
            "body": "I’ve worked in client success in software for nearly 10 years. It’s not at all what they said…\n\nBut they are dead right about the reality of applying and interviewing",
            "score": 11,
            "replies": [
                {
                    "author": "HendrixChord12",
                    "body": "Been trying to get a new job in client success. There’s always someone with more relevant experience, it’s rough.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ricardoconqueso",
                            "body": "Its been a rough go. Its either years of experience or they want very specific domain knowledge, like FinTech or MedTech. I was WFH for a long time, since just before covid really hit. In order to get a new role, I had to start only applying to Hybrid roles in my area to compete with fewer people. Even with almost a decade in CS, I was still going up against other good applicants nationally",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "HendrixChord12",
                                    "body": "That’s where I’m at too. I was a generalist for 5 of my 8 years in CS but have some experience in medtech. Not a fan of the sector but that’s where there’s still money.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xenthum",
                    "body": "The problem is that companies are lying about their roles. \"Client Success Manager\" jobs on Linkedin/Indeed post job descriptions that are just call center agents.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ricardoconqueso",
                            "body": "I’ve yet to see that and just went through a applying, interviewing cycle, eventually started a new role recently. I usually see “tier 1 customer support” for tech support/ticket based roles. But recruiters know what they are looking for for customer success. It’s not a help desk role or support. There’s too few open roles and too many applicants out there to be so generic. They don’t want customer success managers applying for service desk roles. We don’t do that. They don’t want service desk rep applying for success roles, those people don’t do that either. It’s like asking if your IT guy writes code or if your Dev supports IT Ops; 2 different roles",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "magicsouth",
            "body": "I did the quadruple interview with 4 different higher ups plus one in person over the course of 4 weeks. At the end of it all they made the lowest manager in HR tell me “no thanks” and offer a gift card as consolation for my time. (Fancy book store)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Didact67",
            "body": "Experienced long term unemployment for the first time last year and found out about all of this shit. The annoying thing is now that I have a job, I’m getting frequent emails and texts from recruiters.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Confident_Run_6257",
            "body": "I remember when I was moving from Contract to Full-Time employment (purely because they critically understaff) & they couldn't simply transition me automatically to the new delegation. Instead they re-did the interview phase & my boss asked me the same exact questions from 6-9mths prior & even dragged in other people from the dept. to engage in this performance when we all knew that I was going to be offered it, simply because to re-advertise/re-train a new hire was not in the cards!.",
            "score": 3,
            "replies": [
                {
                    "author": "DJMagicHandz",
                    "body": "My jobs has 6 contractors leaving before the end of the year and we lost a full-time rec that they have zero interest in filling. It's middle management putting the brakes on everything and it's absolutely stupid.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "opposing_critter",
            "body": "My dad thinks you can apply for jobs like its the 1970's where just walking down a road he could get a few jobs right away no problem and people are just lazy today.....\n\nMy family have given up trying to inform him that it's a very different world now. Stupid fucking boomers",
            "score": 3,
            "replies": []
        },
        {
            "author": "LordManders",
            "body": "Yeap. I've been unemployed for six months after my last job laid me off. It's brutal out there and I don't see it improving any time soon.",
            "score": 5,
            "replies": []
        },
        {
            "author": "atxcaoboy",
            "body": "I feel recruiters and HR team are out of touch with what the hiring manager or organization needs. Recruiters have been a joke. HR teams are utilizing AI to review applications, so what is their job again? And don't give me that BS of receiving too many applications; sit down and do your job!",
            "score": 2,
            "replies": []
        },
        {
            "author": "OkAd9931",
            "body": "I'm about 30 seconds in and the shitty AI voice has completely turned me from wanting to endure another second.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ObscureFact",
            "body": "This is all on purpose to discourage people from leaving the job the managed to get after going through this stupid process. \n\nManagers and HR want employees to remember what a pain in the ass the whole experience is to make everyone just stay in place rather than put themselves through the ordeal all over again. \n\nAnd an employee who stays in place is an employee who they can underpay for as long as possible until they lay you off once the job gets outsourced or the company gets sold to private equity. \n\nModern life is a scam.",
            "score": 2,
            "replies": []
        },
        {
            "author": "grammar_oligarch",
            "body": "From the other end: Reviewing applications and resumes (or CVs for me since it’s education) sucks.\n\nWe post a teaching position and get 400 applicants. Knock off half for not having minimum qualifications (good at writing doesn’t cut it buddy). \n\nSo 200 or so CVs and applications. The CVs are practically identical because the qualifications are gonna be the same…Masters or Doctorate, some classroom experience, few publications. Ignore the bullshit inflated data (GPA and success rates that are always stellar and indicative of nothing…some mother fuckers post their damned Rate My Professor score…puke). \n\nYou might knock off about 50 obviously unqualified candidates that way (a lot of University of Phoenix degrees where the final exam was waiting for the credit card payment to go through). \n\nWe require a writing sample about something usually…500 words on student experience or something. You check to make sure it isn’t obvious AI or bad writing, maybe knock off another 50.\n\nSo you have about 100 good candidates. For one post.\n\nOkay, time for HireVue! You get maybe 80 who do it…we ask about four to five questions, times two to five minutes a response…times 80…\n\nYeah, buckle in and get ready to do the x2 speed. I spend the week after HireVues listening to the worst podcast on education ever. Gym ride, commute to work…put it on the headboard and tell the missus to not mind that I’m wearing my earbuds, that sort of thing.\n\nIt’s the only way to get it done. Bear in mind I’m still doing my job while I’m doing this. Teaching classes, answering student emails, grading, doing committee work…none of that ends while I’m listening to 70 people give the same vaguely vapid response to the questions asked. They’re mostly Miss America, “I believe the children are the future” type shit that you’d get from anyone on the planet. \n\nWe gotta add a class in graduate programs on how to answer a five minute question with at least some specifics. \n\nBut 10 of them are interesting…they have specifics and you actually wanted to hear their answers. \n\nNow you have to do the face-to-face interview. You jump through hoops and manage to schedule a 10 hour day to get through all of them.\n\nAnd it’s 10 hours back-to-back of asking questions, taking notes, and conferring with a committee. \n\nAnd all ten of them are excellent. FUCK! You get pissed off that there weren’t nine fuck-ups and one perfect person because now you have to decide between ten great candidates. \n\nYou parse through and talk and talk and talk and barely decide on three names to send to the provost for one more interview.\n\nThen you find out the three of them have taken other opportunities and they have to go back to the other 7 who have already moved on, so you might have to start back at the HireVues…that’s the worst, because you have to listen to them again (or refer back to your notes, which you don’t have because ODHR asked you to destroy them since they don’t want them to become exhibit A in a law suit…like I’m writing something that’d get me sued…). \n\nI fucking hate it. I hate it so much. I’m at a point in my career where I just want to throw a dart at a bunch of random names and say “Fuck it, welcome to higher education buddy…don’t do drugs in front of your students and please don’t be a creep.” \n\nThe process is demoralizing on both ends. And I’m not even in the corporate world.",
            "score": 2,
            "replies": [
                {
                    "author": "xlinkedx",
                    "body": "Hey, I don't do drugs and I'm not a creep—how 'bout you toss a dart my way?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "pinewoodranger",
            "body": "If the economy is bad, yeah its gonna be tough. But if companies are actually hiring, ignore most of what the requirements they listed and apply anyway. Don't not send an application just cause you dont fit into their frame completely because realistically, no one does. Also, for first timers: assume the worst for every \"perk\" and let yourself be surprised when one out of the ten listed perks is actually good. First job's gonna suck (or it may not), but you can learn alot and it will help find you the next better one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medical-Duty3829",
            "body": "All my pain points exactly, I’m lucky just to have a food service job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "captain_dick_licker",
            "body": "grAId B underacheiver",
            "score": 1,
            "replies": []
        },
        {
            "author": "linwail",
            "body": "I’ve been looking for a role since august and I’ve sent out hundreds of applications. Only 2 interviews so far. Part of me wants to go back to college but I don’t think that will even help",
            "score": 1,
            "replies": []
        },
        {
            "author": "bongmitzfah",
            "body": "My first job was a gas jockey back in 2008. Walked in gave them my resume and got a call back in a couple days. Now I'm in a field where experience is the most important thing and I've got almost 10 years under my belt So I feel like I dodged a bullet with all this shit. I did get hit pretty hard after school in 2016 took me quite a while to get into my career path. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "BanGreedNightmare",
            "body": "Fudge. Stripe. Cookaes.\n\nEdit: found it: https://archive.org/details/laidoff_nojob",
            "score": 1,
            "replies": []
        },
        {
            "author": "upboat_",
            "body": "None of this applies to the trades, fwiw.",
            "score": 1,
            "replies": []
        },
        {
            "author": "king_gidorah",
            "body": "Interesting",
            "score": 1,
            "replies": []
        },
        {
            "author": "Double-Enthusiasm448",
            "body": "Immediate hire",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vevaseti",
            "body": "As someone who's had only 3 job interviews in her entire life- one being for walmart and one referred by a friend, and has been self-employed for near 15 years straight. This is terrifying lmao. Can't wait to be totally screwed when I have to dip into it all for real again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grimware",
            "body": "Oh man, i've been applying for over 5 months as a senior software developer and I hate how I experienced every point made in this video. Best one I had was after the final final interview HR telling me I got the job and will receive the legal documents tomorrow, only for tomorrow morning to arrive and them calling to say, \"sorry, the position got closed just now\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "gekalx",
            "body": "As someone who was looking for work last year and applied to 400+ places the thing I hated the most were the group interviews. \n\nLike 3-5 people talking to another 3-5 people and competing live.",
            "score": 1,
            "replies": []
        },
        {
            "author": "trane434",
            "body": "I applied for a job, went through the hoops, went to the interviews, did their assignments and paperwork only to get ghosted for months. Went and emailed them to get an update and all I got was \"we've had others have the same issue, you were emailed a week after\" only for it to be \"we're choosing someone else for the position\". I got led on for months just to get told no thanks",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeegurkeK",
            "body": "This also doesn't mention all the fake jobs that companies are posting to make it look like they're growing, but don't actually exist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lonely_Sherbert69",
            "body": "It's designed like this to deter you from leaving your current job. So you stay in your place dont get a wage increase and OBEY",
            "score": 2,
            "replies": []
        },
        {
            "author": "shadowpikachu",
            "body": "0 trust society when it comes to getting jobs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkSalad5522",
            "body": "For those of you looking for roles. I am hiring for a tech lead role that has experience with [sticky.io](http://sticky.io) and preferably checkoutchamp. We're offering $40/hour (which I know is low but we're small and trying to grow). \n\nI am very motivated to hire so please DM me!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rymasq",
            "body": "I really question what people consider a \"job search\" to be. Back in 2016 when I first started looking for work before finishing college I had almost no responses from submitting applications online. Maybe once in a while I'd find a small and obscure company that would give me a shot, but generally it was a dead end. \n\nBut my entire time in undergrad I made myself attend the career fair every single year and get comfortable talking to people in person and attending various events. Eventually through both utilizing the school's career fair and career center with on site campus interview jobs I was able to secure two offers. \n\nNow you might think \"oh well you took advantage of being in school where companies know to get people\". Yes, of course I did, but even then I still went out of my way to attend a job fair outside of my school in a local city away from my school. I showed up in person and met with people who were looking to hire and got good feedback from experienced people even if it gave me no job.\n\n2 years later I found myself out of work towards the end of 2017. What did I do? In addition to trawling job boards, one of the first things I did was google \"Job fairs\" and lo and behold there was a job fair in my industry at a local training center not too far from me. I went there, met with a gentleman at a booth who was impressed with my experience. I also met with the person that organized the job fair and she provided me with some very interesting information in regards to government programs I could take advantage of as well as a way to get a very important certification that would help me secure a high degree of job security. From there, the company I spoke with called me up to do an on-site interview and I drove one hour out to a military base to sit in a room surrounded by a bunch of old tech guys and talk about my experience. Concurrently I took a training course, gained a certification that was very relevant for my industry, took another course for free using a government program recommended to me by the job fair person, and also managed to actually get another job offer from a well known company that I applied to off...Indeed! of all places. Also, LinkedIn was a thing back then, but I was not getting much traction on my profile off of it. \n\nAnyways, I took the offer from the company that I applied to off LinkedIn and since then I have worked at 5 different companies and most of my offers now come from recruiters that reach out to me on LinkedIn or on lesser known job social networking sites. You will be shocked how many obscure places have job boards where companies are looking to hire. For example, YCombinator has a job board for companies that they back, so you can work at an innovative start-up if you really put in the effort to reach out. \n\nNow, every situation is unique, and I recognize that not everyone is a tech worker with a good skillset, but you have to think about it from a business minded PoV. How do you really add value to a company, what's going to convince someone with hiring power that you are worth bringing onto their team? It's not about the buzzwords you toss out or your ability to understand and respect the company you are looking for. It's your comprehension, competitive advantage, and ability to deliver when needed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "firaristt",
            "body": "As someone who is looking for a job currently, I can't agree more. It sucks, especially when you need visa-some permission from the government and/or you don't need local language for your work. They don't mention anything against in the ads or in the interviews, but then when they want to reject you, they ask for these. And why the heck can't we have multiple interviews at the same day and get a response as quickly as possible? Why does this interviewing processes taking so long? To interview with the other candidates to select the best one? Sure. Then why are they rushing for an answer when they gave an offer? Clearly, they have time for the position. Sorry, you are not the only company I'm interviewing/getting an offer right now. Because it takes at least a month to get an offer, and they are pushing hard to get the sign as quickly as possible to prevent further negotiations.\n\nAlso, job security become more and more just some text from the law books.",
            "score": -1,
            "replies": []
        },
        {
            "author": "TargetMaleficent",
            "body": "Boy people just love negativity porn. For my current job I just applied, got an interview, got hired.",
            "score": -13,
            "replies": [
                {
                    "author": "rabidsalvation",
                    "body": "Lucky you, my friend. Many people aren't so lucky",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ptd163",
                    "body": "Thinking everything is fine because it hasn't personally affected you is how this 25+ year plus backslide started.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "TargetMaleficent",
                            "body": "Unless you have some data to cite you are also just giving you opinion and experience, don't pretend otherwise",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}