{
    "title": "Bill Burr Credits Mushrooms For Improving His Personality | Conan O'Brien Needs A Friend",
    "author": "Phish777",
    "subreddit": "videos",
    "rank": 6,
    "score": 1255,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 110,
    "url": "https://www.youtube.com/watch?v=zI59EetRspo",
    "id": "1jdotas",
    "selftext": "",
    "comments": [
        {
            "author": "mulder00",
            "body": "\"Featherless ostrich\"  lmaaao",
            "score": 336,
            "replies": [
                {
                    "author": "Lusane",
                    "body": "Gourley's quip about not even Conan's therapist wanted him on a couch got absolutely no love (as is often the case)",
                    "score": 112,
                    "replies": [
                        {
                            "author": "Orchestra_Oculta",
                            "body": "I have no idea how Gourley isn't a bigger deal in the comic world. He's a genius. Every mention i see of him lately is as a podcast producer which is fine, honorable job, but he's an incredibly funny and creative dude",
                            "score": 36,
                            "replies": []
                        },
                        {
                            "author": "mulder00",
                            "body": "Love his quips!",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "monkeyjay",
                            "body": "I can explain. Because it didn't really have any connection to the joke that was being made apart from the word 'couch'. They were joking about Conan sleeping with executives to get a show and Conan saying that they didn't wanna sleep with him. Saying his therapist didn't want him on their couch either doesn't really work or support or further the line of the joke. It's like a dead end tributary off the main branch of the joke itself. \n\nIt's fine, if it was a friend or something who said it they'd get a 'haha yeah' laugh, but it got the love it deserved here. \n\nAnd I like Gourley.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Lusane",
                                    "body": "No thanks, I get it. Joking about sleeping to climb show business is a tired out joke, so I find Gourley's off-the-cuff joke to be a refreshing change of pace and just good classic comedy. ",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Foctjoo",
                                            "body": "The point is to not change the pace but to have a conversation flow.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Lusane",
                                                    "body": "Cool, I'm taking notes ",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Alternative-Sock-444",
                                    "body": "Are you implying Conan and Matt aren't friends? Interesting take.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "monkeyjay",
                                            "body": "No. I'm saying if my friend said it in conversation I would politely go haha yeah. About as much as it deserves. This is a comedy podcast with two professional comedians riffing with each other. The joke didn't land. The only reason I said anything is because even at the time I thought it was a very average joke and so was surprised to see someone explicitly pointing it out as good in the comments. Different comedy sensibilities I guess. It's good to go into detail about stuff like this though. Really adds to the comedy.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jamuraan1",
                    "body": "Love how you can tell Conan is not faking his laugh because he gets so entirely red in the face.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "sp0rk_walker",
            "body": "Ego death can be scary, and not a party if you aren't aware what's happening. But once you're in it and you see yourself really as an outside observer, you realize all the things you hide from yourself.",
            "score": 272,
            "replies": [
                {
                    "author": "MakeThanosGreatAgain",
                    "body": "It was like being able to witness the cage of reality I built over a lifetime of insecurities, fear, joy, and love - my ego - and how I used that cage to operate myself. I could see it and analyze it. Trim the fat. Profound stuff. \n\nA lot of the narcissism my mom had that rubbed off on me young just fell apart when I tripped for the first time. I was like, why do I talk to people like that? That's not cool. That one experience made such a huge lifetime impact.",
                    "score": 107,
                    "replies": [
                        {
                            "author": "Z0idberg_MD",
                            "body": "It’s funny I did a lot of mushrooms in the early 2000s recreationally. I’m starting to think it’s why I am so self reflective and I am honest about myself. I am often so surprised that people can be in denial about such obvious traits about their personality. Like they can lie to themselves about even the most trivial things. I wonder if that’s related.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "fistingcouches",
                                    "body": "Definitely related. First few times I did it recreationally and I noticeably felt different. I cared way less about what people thought about me and I noticed shit about myself I hadn’t really thought of before. You have to take the steps to fix the problems but mushrooms for me was like therapy in that it showed me my blind spots.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Light_of_Niwen",
                    "body": "Experiences can be VASTLY different among individuals and nobody should do them expecting some great epiphany or improvement to their lives. They can be useful but they can have profoundly negative side effects that tend to get minimized by casual users.\n\nAnd \"can be scary\" is an understatement. You can get PTSD from that shit if you're not careful.",
                    "score": 78,
                    "replies": [
                        {
                            "author": "Alternative-Sock-444",
                            "body": "Yup. I tried some mushrooms different to the regular cubensis mushrooms called Pan Cyans. I'm used to taking about 4g and having a good, fun, intense trip. Well 2g of the pans threw me into an ego death spiral like I've never experienced. I thought I was dying for a bit and had to keep telling myself it was okay. I've tripped probably 35-40 times over the years but that trip stripped away any desire to do mushrooms ever again. If you ever get a chance to try pan cyan, I don't recommend it lol.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Kaiisim",
                            "body": "Yup, I was young and my brain just suddenly realised nothing was actually real. It freaked me out, gave me derealization. It was a few months before my brain could process reality properly. \n\nDon't just dive in if you feel shit thinking \"this will fix everything\". It will change things.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "bingblangblong",
                            "body": "Yeah I heard loads of stuff about how mushrooms can change you forever and all that crap. I got really into it, grew them myself, tripped a number of times several months apart and never experienced ego-death or anything like that. I saw weird rainbow-line things around things the first couple of times, weird freaky visuals / scary faces when I closed my eyes. Then after that it just made me feel sick and really fucked with my emotions, no tripping just had some sort of mental breakdown and cried hysterically for like an hour. It was weird and unpleasant.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "DekuTrii",
                            "body": "I've always been too scared to do it because my mom is schizophrenic.  Worried I'll flip a switch that can't un-flip.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jointheredditarmy",
                    "body": "There is no escaping ego, even “ego death” is just your ego attempting to justify its own existence (by reframing as the wise observer) . You can never step outside of yourself. It’s the Hindu concept of Maya. There’s layers and layers of illusion, and although you can see through more and more layers of it, you’ll never be free of it.\n\nA lot of people do psychedelics and think they’ve achieved some form of enlightenment, when all they’ve done is climbed from one molehill to a slightly higher molehill.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "ReasonablyConfused",
                            "body": "I think I’d prefer a Universe where there is limitless complexity, rather than one that can be “easily” understood through meditation, psychedelics, etc. \n\nBut even without understanding the whole universe, it seems like you can find a better mental and emotional stance with which to navigate these unlimited layers of illusion. Simply acknowledging that you don’t know, and likely can never know the full truth of existence seems like a good starting point. \n\nI would ask that you also consider that the concept of “layers of illusion” might also be incorrect, or an illusion itself, if you will.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "jointheredditarmy",
                                    "body": "Indeed. I would bet any abstraction is an illusion, but at the same time we can’t exist as humans without abstraction. Quite a catch-22!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "faen_du_sa",
                    "body": "I feel like once it happening, you arent able to be aware. Thats why set and setting is so important. You wont be able to steer anything once you are there, just accept w/e.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tattlerat",
                    "body": "It really is hard to describe to someone who hasn’t experienced it but. I saw myself from outside myself. Saw the sad shell of a person I had become, that I hated and instead of feeling more contempt for the person I had let myself become, I found empathy. \n\nMy father’s passing, my personal health issues, my exhaustion with life and my feeling of abandonment from the few people I had in my life that I looked to for support and comfort had all built up and broken down my resilience. And I had thought myself weak for not being able to handle it all in stride. \n\nThe change that came from this whole experience wasn’t some sort of revelatory outlook on life. It was simply forgiveness. I looked at this broken person and embraced them and essentially told them it’s okay. I forgave myself for all these failures I had been beating myself up for all those years and decided to move forward in life. \n\nAll this happened in a time frame I can’t quite pin down but I know it wasn’t truly a long introspective period. It might have been 30 minutes but it felt much longer. \n\nWhen I woke up the next day it was like a weight had lifted. I had a lot of work to do, but, I wasn’t overwhelmed. I was ready and almost excited to get myself back into some shape, and emotionally ready for life again. The most powerful experience of my life to date.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bryrida",
            "body": "Love Conan and bill burr",
            "score": 65,
            "replies": [
                {
                    "author": "DrMcDreamy15",
                    "body": "Two geniuses of comedy and not a soul between them.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Bryrida",
                            "body": "No that’s why I like them, they do feel like they have souls / moral compasses",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "postvolta",
                                    "body": "/r/whoosh",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Bryrida",
                                            "body": "Yeah I guess i don’t get it 🤷🏼‍♀️",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "postvolta",
                                                    "body": "Old south park joke about how gingers don't have souls",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Bryrida",
                                                            "body": "Ohh ok I think bill being bald threw me off lmao",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "FelneusLeviathan",
                                                                    "body": "Bill can be bald all he wants, it won’t erase the smell nor fact that he’s a ginger",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "govilleaj",
            "body": "Oh man that whole thing was good",
            "score": 102,
            "replies": [
                {
                    "author": "Clay56",
                    "body": "He has a bit later on about making unnecessary sequel pitches to waste studios time. \n\n\"Two Flew Over The Cuckoos Nest: This Time We're Keeping The Fountain\"\n\nAnd \n\n\"Schindler's Wrist\" about Oskar being treated for carpel tunnel after writing so many names down. \n\nI was dying laughing, the whole episode is great",
                    "score": 77,
                    "replies": [
                        {
                            "author": "samfizz",
                            "body": "That's in this video lol",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Clay56",
                                    "body": "Lol oops",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "WaffleWarrior1979",
            "body": "Looks like the bots are out in full force attacking Bill. Seems like he’s ruffling some feathers with all his anti-billionaire talk.",
            "score": 417,
            "replies": [
                {
                    "author": "Tremulant887",
                    "body": "**Good.**",
                    "score": 88,
                    "replies": []
                }
            ]
        },
        {
            "author": "SXOSXO",
            "body": "Anywhere to watch his new special without subscribing to Hulu?",
            "score": 22,
            "replies": [
                {
                    "author": "TheGillos",
                    "body": "Learn to pirate.\n\nI used to pirate everything, and then streaming became better and easier. It was worth the money at one point but now there's no way I'm subscribing to 20 different streaming services so I'm back to torrents.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "PandaXXL",
                            "body": "And if subscribing to 20 different streaming services wasn't annoying enough, some of them are now charging an additional fee to watch without ads.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "TheGillos",
                                    "body": "Yep. They are basically pushing people towards piracy. Or just not bothering with their rapidly enshitified products.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "nmj95123",
                                            "body": "Yup. I'm happy to pay for content, but if a company makes it so that legitimately paying them results in a worse experience, I'm not going to pay.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TwoBionicknees",
                            "body": "yup, i'm fast moving back more than anything because every fucking subscription service has such a bad like, menu, or UI. It's not bad as much as the content it shows me doesn't interest me at all. \n\nAll this algorithm shit went from hey you can actually rate shows you like on a scale and we'll show you the shit that's similar to here is what WE WANT YOU TO WATCH, remove ratings and reviews and you will watch what makes us the most profit. trying to find something I want to watch on streaming services is now like doom scrolling on social media, not that, no, skip, no, that looks shit, why was this recommended I'm not into that at all, no, no, that makes me angry, no and never actually finding something I want to watch.\n\nWhen I used to pirate shit it was just this is the show I want, this is the new season line up, look up pilots and try them then I download what I want.\n\nIt also used to help that everything was on fucking netflix and netflix wasn't making as much filler bullshit and no one was paying for god damned soap operas to be streamed, or reality tv. It was like having the best 10% of content because they were trying to get new users on quality, rather than service every asshole viewer on the planet on the cheap. \n\nI miss early netflix. \n\nI also may be drunk right now so who knows. I'll also say I haven't subbed to a usenet service in a while but I did always love that over torrents just because I could always get what I wanted at max speed easily.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "weekend-guitarist",
                    "body": "You could find a friend with Hulu and invite yourself over. That’s literally what did.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Nameless_Ghoul1891",
                    "body": "It's on Disney+ and they have a promotion of $1.99 a month for 4 months which is not bad.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "geneuro",
            "body": "I could listen to burr and Conan shoot the shit all day",
            "score": 7,
            "replies": []
        },
        {
            "author": "IsThisIt_",
            "body": "Watched all 10 minutes… literally not another sentence of exposition. “Mushrooms changed me” - end of story. 👎",
            "score": 163,
            "replies": [
                {
                    "author": "MiloIsTheBest",
                    "body": "He's actually talked about the experience in detail on so many shows already that I'm surprised this is what was linked. \n\n\n... Actually I'm pretty sure it's in one of his stand up specials too ",
                    "score": 108,
                    "replies": [
                        {
                            "author": "sk8thow8",
                            "body": "Ya, he's got a whole bit about it on his red rocks special where he actually goes into detail about it.",
                            "score": 39,
                            "replies": []
                        },
                        {
                            "author": "MumrikDK",
                            "body": "> that I'm surprised this is what was linked. \n\nThis was a 5 hour old clip posted on Conan's channel.\n\nOP just got it in their feed and posted to reddit.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "kalepoweredhybrid",
                            "body": "In his latest NPR guest spot, he talks about his experience with a better delivery. In terms of it being therapeutic for him.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "dogstardied",
                            "body": "Tbf Conan’s YouTube channel will often put clickbait titles in their thumbnails and usually that topic won’t come up until the back half of the video, or it’ll be a really small part of it. If you’re not watching the videos just to watch Conan and his gang hang out and shoot the shit, the misleading titles can be a little annoying.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "kalepoweredhybrid",
                            "body": "In his latest NPR guest spot, he talks about his experience with a better delivery. In terms of it being therapeutic for him.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "operablesocks",
            "body": "Humor aside (and I found this clip funny), I am encouraged by the number of people who are publicly coming out and sharing how psilocybin, or some other entheogenic compound, have altered their life for good. I did a series of very deliberate journeys back in the early 80s after meeting someone that explained the way to use them to experience a transcendental experience, and it altered the arc of my life in very positive ways that are still being felt today. Thank you Bill Burr.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LookinAtTheFjord",
            "body": "\"You're a wizard, Oskar!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "wusurspaghettipolicy",
            "body": "The Schindler's Wrist was hilarious",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spankyzerker",
            "body": "My experience is just taking them and laughing so hard and anything that my jaw literally hurt so much for a week straight i thought maybe i broke it laughing.\n\nI don't know if that is a common experience or what, but they was in a chocolate bar, and was told \"just eat one of the squares, so not to much\".   But for the next 4 hours i was laughing so hard even considered using a tie to stop my jaw from opening. lol  I didn't have any hallucinations, or anything that blew my mind..just laughing at everything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mfmeitbual",
            "body": "LSD changed my life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CityOfZion",
            "body": "Props to Conan O Brien for finally releasing this interview after holding on to this tape since 1974",
            "score": 1,
            "replies": []
        },
        {
            "author": "magicscreenman",
            "body": "That honestly seems like a thing Bill Burr would do.",
            "score": 0,
            "replies": [
                {
                    "author": "DarthTempi",
                    "body": "What, do mushrooms? Anyone who hasn't should",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "WolfWomb",
            "body": "Nia didn't need them, however.",
            "score": -3,
            "replies": []
        },
        {
            "author": "ripndipp",
            "body": "Bill Burr cannot even hold a candle to the Great Italian  5 '3 Master Comedian Joseph Rogan",
            "score": -88,
            "replies": [
                {
                    "author": "mackinoncougars",
                    "body": "I bet Burr doesn’t even fucking take supplements.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "ripndipp",
                            "body": "He doesn't have a Dad hole!",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DarthTempi",
                    "body": "Has Joe Rogan ever even made a joke?  I know he's soon me \"stand up\" but I watched a few clips and it's just him being a try hard on stage without any punchlines",
                    "score": 22,
                    "replies": [
                        {
                            "author": "TheNastyDoctor",
                            "body": "He's fucked a lot of stools, though.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "crazyabtmonkeys",
            "body": "Are shrooms just the Ozempic for mental health issues now?",
            "score": -10,
            "replies": [
                {
                    "author": "Vrost",
                    "body": "Nah, when someone goes on Ozempic they don’t shoehorn it into literally every conversation lmao",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mushcube",
            "body": "10 minutes of talk, maybe 2 minutes of content 😅 funny guys tho.",
            "score": -111,
            "replies": [
                {
                    "author": "Froegerer",
                    "body": "The talk is the content.  This is just a shitty title.",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "Stolehtreb",
                    "body": "Of content? What do you consider content? Is the entire video not the content of the show? I do not understand your point.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Mushcube",
                            "body": "I mean yeah, i was looking for the mushroom talk, but it was just two friends talking all sort of random shit and maybe 30s about mushrooms 😅",
                            "score": -22,
                            "replies": [
                                {
                                    "author": "Jipptomilly",
                                    "body": "You keep using that emoticon. I do not think it means what you think it means.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "finnalston",
                                            "body": "I think it portrays “but I digress” in a very non-serious context perfectly",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "aircooledJenkins",
                            "body": "Content discussing specifically mushrooms.",
                            "score": -9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "keestie",
            "body": "Dude needs more.",
            "score": -113,
            "replies": []
        },
        {
            "author": "Ickyfist",
            "body": "Man gingers get scary looking as they get old.",
            "score": -118,
            "replies": [
                {
                    "author": "mackinoncougars",
                    "body": "Both these guys look good, especially for their age. What are you on?",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "jradglass",
            "body": "Burr is like Bill Maher, fake edgy boomer shit. This bitch would probably cry after eating 1 g lol",
            "score": -58,
            "replies": [
                {
                    "author": "Vrost",
                    "body": "Ha, I’ve always thought Maher to be very insincere but didn’t know how to describe it— I like your version. Burr 100% same deal for me.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "yoduh4077",
            "body": "He should take more.",
            "score": -98,
            "replies": [
                {
                    "author": "Squidorb",
                    "body": "Why?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "yoduh4077",
                            "body": "He's an abrasive asshole.",
                            "score": -39,
                            "replies": [
                                {
                                    "author": "Squidorb",
                                    "body": "I'd argue that you don't understand his comedy. He says the fucked up thing that most people are thinking, while also acknowledging that it's fucked up to think that. \n\nAs someone who has followed him for awhile, I can definitely see his shift in perception.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "yoduh4077",
                                            "body": "I used to like his comedy. Haven't watched anything with him in it for a few years because his whole \"we all suck, I feel like I'm taking crazy pills here\" just feels like \"old man yells at cloud\" now. His main schtick was great when he was younger and full of piss and vinegar, but now his act comes off as a self-righteous, angry, old man yelling at a cashier. He sounds like a male Karen now. Not a fan anymore.",
                                            "score": -18,
                                            "replies": [
                                                {
                                                    "author": "Squidorb",
                                                    "body": "Maybe his message of \"we all suck\" is just too hard for you to swallow.",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "yoduh4077",
                                                            "body": "Oh trust me, I know I suck, you didn't need to imply it. 🙃",
                                                            "score": -5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KileyCW",
            "body": "Improving his personality is subjective. Frankly he always seems like a rich know it all asshole pissed off about something. What was he like before???",
            "score": -120,
            "replies": [
                {
                    "author": "Abradolf1948",
                    "body": "I love how everyone keeps calling him \"rich\" when his net worth is like, the low millions. Yeah, I'd love that for myself, but he is also far closer to you and I and that homeless guy on the corner than he is to anyone like Musk or Bezos who he is attacking.\n\nPeople hear him shit on billionaires and they are like \"but he's rich too yada yada yada\". It's not even close",
                    "score": 22,
                    "replies": [
                        {
                            "author": "KileyCW",
                            "body": "I don't care about him shitting on billionaires. Honestly if it's comedy; my Pop had me grow up on Pryor, Carlin, and Murphy so punching down doesn't even bother me. Burr just comes off like a miserable prick imo but I've never seen his standup. I just thought he was a grumpy actor.",
                            "score": -32,
                            "replies": [
                                {
                                    "author": "MileHiSalute",
                                    "body": "lol you sure have a lot of opinions on someone that you’ve never even seen do what they’re famous for. He’s not an actor, he’s a comedian that has gotten small acting roles. Maybe sit down and actually watch him before stating strong opinions?",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "NitroTitan",
                                    "body": "Carlin was even a bigger angry grumpy man so I’m surprised you didn’t like Bill Burr. Both are affluent comedians that are a little bit self aware about their class/privilege. And are great storytellers imo.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "Lank3033",
                                    "body": ">Burr just comes off like a miserable prick imo but I've never seen his standup.\n\nIts so baffling to see people take the time to comment that they don't care for the work of someone they haven't even watched. ",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Devium44",
                    "body": "I thought the right liked rich know-it-all assholes.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Balthazzah",
                    "body": "A poor know it all asshole, pissed off about everything.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "KileyCW",
                            "body": "Lol sounds accurate. Honestly I never saw him until I watched Breaking Bad like 5 years ago so I didn't know him. Every sound bite now is him pissed off and I was like he's a comedian, just thought he was an actor? How?",
                            "score": -43,
                            "replies": [
                                {
                                    "author": "Ramikadyc",
                                    "body": "In fairness, every soundbite of Bill *ever* sounds like he’s pissed off about something. That’s his whole thing. If you like that shtick, watch his Netflix animated show F Is For Family—it’s just him being a terror of a father and husband to his family in the 70s, and it’s as funny as it is “too real” sometimes.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "bakgwailo",
                                            "body": "That's literally just being a New Englander .",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "friedmpa",
                                                    "body": "Was gonna say he's a boston suburbs boy he's always been a little asshole lmao",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "bakgwailo",
                                                            "body": "Our god-given right as New Englanders is to complain about anything and everything.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "KileyCW",
                                            "body": "Apparently r/video is very offended by any Bill Burr dislike lol. I can see this being funny, might check it out.",
                                            "score": -10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LeonardSmallsJr",
            "body": "Mushrooms changed me by making me camp out on the shitter six times a day, but no personality changes beyond that. I assume it’s the same with Bill.",
            "score": -101,
            "replies": [
                {
                    "author": "Squidorb",
                    "body": "Sounds like you didn't set your intentions or try to work on yourself",
                    "score": 11,
                    "replies": [
                        {
                            "author": "strobesglow",
                            "body": "Maybe their intention was a squeaky clean anus?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Squidorb",
                                    "body": "Sounds like they failed that with six trips to the bathroom",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheUltimateSalesman",
            "body": "He should take more mushrooms.",
            "score": -36,
            "replies": []
        }
    ]
}