{
    "title": "Hawley-Smoot Tarrif, Ferris Bueller's Day Off",
    "author": "RegnStrom",
    "subreddit": "videos",
    "rank": 8,
    "score": 519,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 31,
    "url": "https://youtu.be/yuOHbyuanbY?feature=shared",
    "id": "1jdsd9u",
    "selftext": "",
    "comments": [
        {
            "author": "SithLard",
            "body": "Ad libbed. They just told Ben Stein to talk about economics.",
            "score": 136,
            "replies": []
        },
        {
            "author": "CraigKostelecky",
            "body": "And yet, the same Ben Stein would probably say the exact opposite thing today to appease Trump.",
            "score": 188,
            "replies": [
                {
                    "author": "dkyguy1995",
                    "body": "Geez his wiki page talks about how he's anti-evolution and he of course has a Truth Social account",
                    "score": 70,
                    "replies": [
                        {
                            "author": "jenglasser",
                            "body": "That is deeply disappointing.",
                            "score": 28,
                            "replies": []
                        },
                        {
                            "author": "Piltonbadger",
                            "body": "Wants to criminalize abortion, loves John McCain and thinks Obama is the most racist president in US history.\n\nYea we can go ahead and ignore anything that comes out of his mouth.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "xenthum",
                                    "body": "John McCain had faults but I'd take 50 of him over any Republican senator in office today.\n\nThat said: yes, Ben Stein is a fucking moron.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ActuallyAlexander",
                            "body": "I used to love Ben Stein even if he was a weird Republican Nixon apologist but hot damn did I drop any admiration I had left when he made Expelled.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "oneplusetoipi",
                    "body": "What an ass. But this is still funny as shit.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "707breezy",
                    "body": "I remember when he said on Fox “Obama was the biggest racist",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "SojuSeed",
                    "body": "Was wondering about that. Dude is/was a hardcore conservative. I say was, not because he’s dead but because he’s old af so who knows how much he’s still got cooking in the brain pan. But I am curious what his thoughts would be about Agolf Shitler’s “economic” policy.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "general---nuisance",
                    "body": "And Reddit was silent about tariffs when Bidens added them.",
                    "score": -30,
                    "replies": [
                        {
                            "author": "PKtheworldisaplace",
                            "body": "Probably because it didn't tank the stock market when he did it.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "whirlyhurlyburly",
                            "body": "Do you think a person who objects and is enraged and ashamed for this:\n>”The only thing that makes sense is for Canada to become our cherished Fifty First State,” Trump again said. “This would make all Tariffs, and everything else, totally disappear…. The artificial line of separation drawn many years ago will finally disappear, and we will have the safest and most beautiful Nation anywhere in the World — And your brilliant anthem, ‘O Canada,’ will continue to play, but now representing a GREAT and POWERFUL STATE within the greatest Nation that the World has ever seen!”\n\nIs a hypocrite for not caring about this:\n>Announcing the new tariffs during a speech in the Rose Garden on Tuesday, Biden said he seeks “fair competition with China, not conflict.”\n“The fact is, American workers can out-work and out-compete anyone, as long as the competition is fair,” Biden said. “For too long, it hasn’t been fair.”",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Slavasonic",
                            "body": "what did Biden tariff?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "general---nuisance",
                                    "body": "Tungsten, Solar panels, semiconductors, EV's",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Slavasonic",
                                            "body": "Ok, now what has Trump tariffed?",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "cwfutureboy",
                                                    "body": "They sure were quick to answer your first question. 😂",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Winter_Gate_6433",
                                            "body": "So, other than tungsten, emerging high growth industries that night actually be able to support the pay required to bring manufacturing to America?  That MONSTER.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "VoidsInvanity",
                            "body": "Because the effects and scale you dolt",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "murrtrip",
            "body": "And all those kids are now internet experts on how tariffs are actually a good thing.",
            "score": 23,
            "replies": []
        },
        {
            "author": "SusanForeman",
            "body": "Fun fact, this clip was a 2025 reenactment of the movie and the audience members seen here consist of a GOP congressman, white house press secretary, and the president of the united states.",
            "score": 33,
            "replies": []
        },
        {
            "author": "yParticle",
            "body": "So relevant. And yet so relatable reactions.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Pm-ur-butt",
            "body": "This should be a commercial. Play it so often that people hate the mere mention of tariffs and, in turn , hate Trump when he talks about them.",
            "score": 10,
            "replies": []
        },
        {
            "author": "29187765432569864",
            "body": "terrible teacher",
            "score": 6,
            "replies": [
                {
                    "author": "SgtSnapple",
                    "body": "Not wrong. You can provide all the info in the world but if you just beat your students to death with it for an hour it'll get to the point that even a dedicated student may as well be hearing mandarin.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "metropolis_noir",
            "body": "isms in my opinion are not good",
            "score": 0,
            "replies": [
                {
                    "author": "Rubthebuddhas",
                    "body": "Texmexism is totally fine.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "PocketNicks",
            "body": "Another tariff?",
            "score": 0,
            "replies": []
        },
        {
            "author": "KileyCW",
            "body": "Lol this sub has become so political you dig up what a 25 year old clip about tarifs from a random non political movie to dunk on Trump? Is it uncomfortable to have Trump and Elon on the brain all day reddit?",
            "score": -8,
            "replies": [
                {
                    "author": "whirlyhurlyburly",
                    "body": "Does this mean Trump igniting a trade war, tanking the stock market, stating he wants Canada as a 51st state and saying Canada is flooding America with fentanyl (as opposed to the border sending more crime to Canada than the other way around), is something that Americans should find non-noteworthy and ignore as totally normal and minor?  Maybe it will throw both of us into a crippling recession? Does that matter? \n\nYou might have the Donald syndrome if you constantly feel the urge to explain how it’s weird to care or think about extremism and massive economic damage, instead of the option of choosing trivial drivel to celebrate and discuss instead.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "RegnStrom",
                    "body": "I just thought it was funny.  I mean, what are the odds?  Also, the kid's reactions make me think about what people hear in Charlie Brown movies when adults talk.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}