{
    "title": "First time Monterey car week",
    "author": "coneskiller",
    "subreddit": "cars",
    "rank": 15,
    "score": 12,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 17,
    "url": "https://www.reddit.com/r/cars/comments/1je0wvv/first_time_monterey_car_week/",
    "id": "1je0wvv",
    "selftext": "Coming summer, I'll be going to the first couple of days of the monterey car week. I'll be there 8-11th of August. I've already bought tickets to go to Laguna Seca on the 9th and 10th for the hill climb and stuff. I was wondering if people have any tips on places to go, things to see, spots to eat at and things I should definitely not miss during my time there. If anybody has any good spots for photography at Laguna Seca for track action that would be great to hear too!",
    "comments": [
        {
            "author": "777ssimon",
            "body": "What kind of food are you into? I'll just leave a few recommendations.\n\nSteak: Woody’s At The Airport. You can park in the small gated parking lot infront of the arrival terminals. Just bring your parking ticket into the restaurant and have them validate it. The restaurant is on the 2nd floor.\n\nFor a more upscale location, Tarpy's Roadhouse on the Monterey Salinas Hwy. This location is very close to Laguna Seca.\n\nItalian: il vecchio in Pacific Grove. There is a small parking lot behind the restaurant. Highly recommend the gelato, especially the \"foresta\".\n\nSushi: Züm Sushi in Pacific Grove. This is very close to il vecchio but unfortunately you have to find street parking. This is a small place with indoor and outdoor seating. \n\nMexican: Michael's Grill & Taqueria. They have two locations, one in Pacific Grove and one in Marina. \n\nBar food: The Crown & Anchor (W Franklin St, Monterey) near Alvarado Street. This location has great appertizers, but the deep fried Artichoke Hearts is a must.\n\nIce cream: Revival Ice Cream. Be warned that this place always have a long line but it is worth it. The Bee's Knees is their signature flavor.\n\nCake: Rosine's Restaurant on Alvarado St. They sell giant slices of cakes   in the front of the restaurant that you can order to go, no need to sit in. If you're on Alvarado St., there are a lot of restaurants but I would skip their desserts menu and go here or Revival. \n\nLet me know if you have any questions.",
            "score": 10,
            "replies": [
                {
                    "author": "coneskiller",
                    "body": "These all sound great! I love all kinds of food, so this list is awesome! Thank you!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "777ssimon",
                            "body": "I forgot one place. Since you're in the the \"Artichoke Capital of the World\", I would also recommend Phil's Fish Market. It is a bit of a drive (\\~30 minutes from Laguna Seca) but worth it. They have a portion of their menu dedicated to arthichokes and they also have great seafood.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "verdegrrl",
                                    "body": "Have you gone there since the move to Castroville?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "BrandanG",
                                            "body": "I didn't realize they moved.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "verdegrrl",
                                                    "body": "Yeah, I'm bummed because part of the charm was strolling on the sand after a meal.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "BrandanG",
                                                            "body": "I haven't been since 2019 or so, it didn't feel like that long ago.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "777ssimon",
                                            "body": "I haven't, since it is a bit of a drive for us as well. When we're in a mood for artichokes, we usually just go to the Crown & Anchor and get the fried artichoke hearts.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MasterK999",
                            "body": "Just to add to this list my family loves these.\n\nRed House Cafe on Lighthouse in Pacific Grove. Great food and service. We go to Monterey twice a year and they remember us. Great people. \n\nHula's is awesome for burgers and sandwiches. Great food, nice vibe.\n\nPizza My Heart at the Del Monte Center is great. We love the D’Lex Chicken & Bacon.\n\nBe sure to visit the Aquarium. Most of Cannery Row however is touristy and you can do it quickly or skip.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "777ssimon",
                                    "body": "Great recommendations. Pizza My Heart is my go to as well, especially the Big Sur. For a sit in location, Gianni's Pizza in Pacific Grove is great as well with gigantic bread sticks. They are always busy though so you may have to wait.\n\nTalking about Big Sur, there are a lot of great places to visit. Big Sur will take a full day to enjoy and I would go if the weather is nice and sunny. Skip if its foggy as it will block the views. These locations are in order coming down from Monterey and heading south.\n\nBixby Bridge: If you're a car lover, you may recognize this location. A lot of cars commercials are filmed using this bridge and view. You can park off to the side before/after the bridge and stroll up the hill for a great view.\n\nCreamery Meadow, Ridge, Panorama, and Bluffs Trail Loop: A moderate 8.0 miles hike offering great views of the ocean. For the best view of the ocean, do the inland part of the trail (clockwise). Be sure to bring lots of water.\n\nBig Sur River Inn: Has a great restaurant with the best apple pie. We usually go to to sit in the Adirondack chairs that are directly inside the river, a unique experience. Bring extra socks or flip flop.\n\nNepenthe: Pricey foods and drinks but on a sunny day offers incredible views. Often time when you are sitting outside, you will notice a lot of birds especially the California Scrub-Jay up close.\n\nMcWay Falls: One of my favorite place with a great view of the ocean with a unique little waterfall.\n\nWith Big Sur, it is important to check if the roads are closed on that particular day. I would also download the map/locations as cell phone receptions can be hit or miss there. If the roads are open and the weather is clear and sunny, you will have a great time.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "boomerbill69",
            "body": "Make sure to bring ear plugs for Laguna Seca. Not all of the cars are *that* loud but the ones that are (the thought of 60s Trans-Am racers still make my ears ring) are probably damaging your hearing.",
            "score": 9,
            "replies": [
                {
                    "author": "Celestial_Blue_Pearl",
                    "body": "Yeah I’m pretty sure a Ford GT LM going WOT at the Michelin bridge gave me permanent hearing damage.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "verdegrrl",
            "body": "My experiences are generally towards the end of car week, so may not reflect the time you are there.\n\nYou can stroll the pits at Laguna and most folks are happy to chat when they have time. There is everything from big dollar rigs to one or two man operations. I've never attended the hill climb, but during the Historics the weekend following there are vendor booths. You'll need a good long range lens to get decent pics on the track.\n\nRemember to wear sunscreen, bring a hat, and drink plenty of water. The air is often cool due to being near the ocean, but the sun will get you good even through the clouds.\n\nTickets to Pebble Beach are $$$, but you can do some free car spotting on Friday as cars are offloaded for the show and auction. There is a small deli across from the lodge entrance, and it features chairs overlooking the check-in area. There is a large vendor area just up the hill, but I'm not sure when they first open.\n\nCarmel hosts a free show on the main street. It's a zoo, but a lot of eclectic stuff. Lots of quaint shops and lovely white sand beach at the bottom of the hill. Exotics on Cannery Row attracts exactly the kind of crowd you'd expect to show up when people want to peacock their newer exotic car.\n\nSome of the auction houses have outdoor display areas in Monterey and if you can get a ticket to watch the action, it's very exciting (to me anyway).\n\nI like to catch sunset on the dunes from Schooners in the Monterey Plaza Hotel on Cannery Row.\n\nPrepare for long lines and traffic jams. Everything will take longer than anticipated. However, the car spotting is excellent. \n\nhttps://whatsupmonterey.com/article/activities/monterey-car-week-overview",
            "score": 2,
            "replies": []
        },
        {
            "author": "edinburghiloveyou44",
            "body": "Go to Hog's Breath Inn. Nothing too wild, just more of a cool setting. The food is good, too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BrandanG",
            "body": "Most of the good photo locations at Laguna Seca are gated off, but there are still plenty of places to get good shots, particularly around the oak trees at the Corkscrew and as cars pass under the bridge and enter turn 9. A 70-200mm lens works well to get panning between the trees there. The bleachers also let you shoot over the fence as cars pass under the tire bridge and go through Turn 4. You should also be able to get some good shots at Turn 5 at the end of the parking lot. There's also a pedestrian walkway on the west side of the hairpin that would let you shoot through a chain link fence. \n\nThere have been some good food suggestions, but Pizza My Heart in the Del Monte Shoppig Center has pizza by the slice and solid t-shirts too. Tough to beat.",
            "score": 2,
            "replies": []
        },
        {
            "author": "w0nderbrad",
            "body": "Have dinner in downtown Carmel and then walk up and down the street to see how many millions of dollars worth of cars are street parked. I saw so many mclarens and rare exotics street parked in Carmel during car week. Walk down to the beach and there might be a bagpiper playing. Don’t ask questions. \n\n\nBring a bike and do the 17 mile drive (well 17 mile pedal)",
            "score": 2,
            "replies": []
        }
    ]
}