{
    "title": "Intercom Blasts at Cordele, GA Love's",
    "author": "Meatbuns66",
    "subreddit": "Truckers",
    "rank": 5,
    "score": 110,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 21,
    "url": "https://www.reddit.com/r/Truckers/comments/1je764l/intercom_blasts_at_cordele_ga_loves/",
    "id": "1je764l",
    "selftext": "2 drivers got called out over the intercom to pull up from the fuel pumps or be towed at Cordele, GA Love's today.\n\nI was inside enjoying my Bojangles. I was not one of those drivers. \n\nHearing this made my Bojangles taste better.\n\n",
    "comments": [
        {
            "author": "MrButak",
            "body": "That's a good start for Loves. I wish they would do more",
            "score": 34,
            "replies": []
        },
        {
            "author": "Leaf-Stars",
            "body": "I would love it if every truck stop did this. There’s an armed guard at one of the pilots just outside Atlanta who is very good at getting assholes to move their trucks when they’re done fueling.",
            "score": 23,
            "replies": [
                {
                    "author": "Claim_Alternative",
                    "body": "I had to report their ass one time.  \n\nBastard threatened to have me towed as I was waiting in line for fuel.  Kept telling me that I can’t park there.  I told him I wasn’t parked, that I was in line for fuel.  He said there is no line that I’m in.  I pointed to the truck in front of me and the truck in front of that one (at the fuel pump…driver probably went inside for McDs or whatever, since it had been a good 15 minutes) and told him this is the fucking line for this pump.  He threatened to call a tow truck if I didn’t move.  \n\nWent inside and told the manager, and manager told them to chill the fuck out.\n\nPerhaps get the fuckers that are hogging the fuel lanes in busy times (every lane was backed up 2-3 deep, no one had pulled forward to the line at all, and it was the busy time, like 5pm), not the ones waiting in line behind them.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Leaf-Stars",
                            "body": "That was what happens when you hire a child to do a man’s job",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BeardedRenegade",
            "body": "I Wish Love's enforced their fuel islands like that in Texas.",
            "score": 12,
            "replies": []
        },
        {
            "author": "salaamcreddit",
            "body": "Exit 102. That one has plenty of parking, too. Probably my favorite loves on 75 in GA",
            "score": 6,
            "replies": [
                {
                    "author": "ChoneFigginsStan",
                    "body": "It kills me when there’s a half empty truck stop and people will pull up and spend 20 minutes inside.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Claim_Alternative",
                            "body": "If it’s half empty, and there are pumps open, it doesn’t bother me at all.  I’ll do the same.  But if the place is popping or most of the aisles are occupied, I make it quick.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ChoneFigginsStan",
                                    "body": "Agreed. I don’t care what someone’s doing if there’s 5 empty pumps, but when you go at 2pm and half the lot is empty, but pumps are stacked 2-3 deep, they need to go park if they’re doing more than grabbing a receipt and pissing.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Independent-Fun8926",
                    "body": "There’s a brand new one too in Valdosta, exit 13. It’s pretty nice and has lots of parking too. Also Bojangles! Better than another fucking Hardee’s location lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DrivingToMilwaukee",
                            "body": "I love this one it's been my fuel up go to..it's so easy to fuel, pull up and then creepy crawl of you gotta around the bend to the parking lot to wait out 5/10 minutes till your 30s up. Plus there always bumping mc hammer or Isley brothers at 3 am.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Twisty12223",
                            "body": "I just was at this one a few weeks ago.  It is nice and I love to be able to nab some Bojangles.  Loves seem like they are popping up everywhere",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Freightliner15",
            "body": "I've been there before. That Loves doesn't play around. You're lucky to get 10 minutes after you pull forward before they start blasting the intercom.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CaptianBrasiliano",
            "body": "Good on them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Independent-Fun8926",
            "body": "That’s 🔥🔥🔥",
            "score": 2,
            "replies": []
        },
        {
            "author": "12InchPickle",
            "body": "Something that needs to be more frequent.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BigSchmitty",
            "body": "I wish Pilot would do this",
            "score": 2,
            "replies": []
        },
        {
            "author": "mrockracing",
            "body": "I wish more truckstops had Bojangles. Actually, I want a Culver's and a Zaxby's.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JankyMark",
            "body": "About time , hopefully they keep this up",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weary-Writer758",
            "body": "Nice. It's not done enough. I was a ninja at driving around other trucks and getting to the pump. Especially when there's only 2 pumps at the Oasis on I294.",
            "score": 1,
            "replies": []
        }
    ]
}