{
    "title": "Coming to Game Pass: Atomfall, Blizzard Arcade Collection, Mythwrecked: Ambrosia Island, and More - Xbox Wire",
    "author": "Turbostrider27",
    "subreddit": "Games",
    "rank": 8,
    "score": 247,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 75,
    "url": "https://news.xbox.com/en-us/2025/03/18/xbox-game-pass-march-2025-wave-2/",
    "id": "1je4d6i",
    "selftext": "",
    "comments": [
        {
            "author": "Turbostrider27",
            "body": "**Coming Soon**\n\nOctopath Traveler II (Series X|S) – March 19\nNow with Game Pass Standard\n\nTrain Sim World 5 (Console) – March 19\n\nMythwrecked: Ambrosia Island (Cloud, Console, and PC) – March 20\n\nBlizzard Arcade Collection (Console and PC) – March 25\nGame Pass Ultimate, PC Game Pass, Game Pass Standard\n\nAtomfall (Cloud, Console, and PC) – March 27\n\nMore Games Coming to Game Pass Core on March 26: Tunic, Monster Sanctuary, Batman: Arkham Knight\n\n**Leaving March 31**\n\nMLB The Show 24 (Cloud and Console)\n\nLil Gator Game (Cloud, Console, and PC)\n\nHot Wheels Unleashed 2 (Cloud, Console, and PC)\n\nOpen Roads (Cloud, Console, and PC)\n\nYakuza 0 (Cloud, Console, and PC)\n\nYakuza Kiwami (Cloud, Console, and PC)\n\nYakuza Kiwami 2 (Cloud, Console, and PC)\n\nYakuza Like a Dragon (Cloud, Console, and PC)\n\nThe Lamplighter’s League (Cloud, Console, and PC)\n\nMonster Hunter Rise (Cloud, Console, and PC)",
            "score": 37,
            "replies": [
                {
                    "author": "BreafingBread",
                    "body": "With this month, is that all Yakuza games out of gamepass?",
                    "score": 31,
                    "replies": [
                        {
                            "author": "dadvader",
                            "body": "Damn I hope they brought it back again. I still haven't done with Yakuza Kiwami 2...",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "EdBeatle",
                                    "body": "The whole series regularly goes on sale so you can always wait for that too.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "xenthum",
                                            "body": "Since it got popular they've started cutting the sales. They don't get anywhere close to as cheap as they were",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Impossible-Wear-7352",
                                                    "body": "Its on sale now for 0-6 collection for roughly $10 each on Steam. It's definitely not a historical low but still a damn good price for the crazy amount of content you get",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "fingerpaintswithpoop",
                                    "body": "Just buy it now, if you don’t have the time to finish it before it leaves the service. You get a 10% discount on any game that’s currently on Game Pass.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "chenDawg",
                                            "body": "or if you happen to be on PC, pretty much all the games are only $11 during the spring sale",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Fortlulz",
                                    "body": "Brother just buy it",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CowardlyCannibal",
                    "body": "I was hoping MLB The Show 24 would stay longer since 25 isn't coming to Game Pass",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BigAssStonks",
                            "body": "I know I freaking hate buying yearly sports games. I will probably skip this one.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MumrikDK",
                    "body": "> Yakuza 0 (Cloud, Console, and PC)\n\nFor anyone curious about the franchise, and who don't tend to very slowly play through long games (you've only got 13 days here), this is the one to hurry up and try out before it leaves.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HypocriteOpportunist",
            "body": "I get that people scrutinize Game Pass releases on a biweekly basis, but as a subscriber for almost 5 years now, I am absolutely loving the service. Between bigger games that I sink my teeth into over the course of a month or two (Lords of the Fallen, Starfield etc.), to smaller indie releases that I loved (Solar Ash, Cocoon) and of course fantastic AAA single player games (Ninja Gaiden 2 Black, COD BLOPS 6, Indiana Jones), I can't keep up with all the fantastic games.\n\nCurrently playing through Nine Sols, and I can't help but feel like I am playing the new Metroidvania GOAT. This game is absolutely FANTASTIC!\n\nI easily get my money's worth as a lot of these games I would never bother picking up on Steam until they were on deep discounts, so it's a great way to keep up with newer releases and be part of the conversation.",
            "score": 43,
            "replies": [
                {
                    "author": "Spheromancer",
                    "body": "Gamepass is great. The only people who hate on it are console warriors, don’t appreciate not being able to own games, or just haters. The general population loves GP. The internet/Reddit is just a small percentage of humans that are vast majority haters of everything fun",
                    "score": 18,
                    "replies": [
                        {
                            "author": "FlatDormersAreDumb",
                            "body": "The only reason I don't subscribe to PC Game Pass is because the app was a miserable experience, and I still see comments saying people have issues with it.\n\nFor me it would constantly \"update\" the games...by redownloading the whole game again. I tolerated it for the $1 trial period, but at full price I expect better.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "HypocriteOpportunist",
                                    "body": "Yeah the app isn't great but it continues to make strides with every release. And with the news of Microsoft developing their own handheld, I really hope they focus hard on making the app the best way to play these games.\n\nI still love Steam and my Steam Deck, and I kind of accept that we will probably never see PC Game Pass on Steam, so the next best thing is for Microsoft to create a dedicated platform for Game Pass, and I hope they can continue to make the PC app better.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "FlatDormersAreDumb",
                                            "body": "Have you had any issues with version parity? I think I've heard the Game Pass version will be different than the Steam version as far as bug fixes or features.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HypocriteOpportunist",
                                                    "body": "Sure every now and then the updates will lag slightly behind the Steam version for 12-24 hours, it's not a huge deal. Hopefully they will get better with time, but considering how long it takes me to finish a game, I don't really mind.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Alastor3",
            "body": "I urge people to play Lil Gator Game, amazing game if you like stuff like Toem, A Short Hike, Night in the Woods",
            "score": 11,
            "replies": [
                {
                    "author": "CopenhagenCalling",
                    "body": "It’s a great game. It sucks that they removed it from Game Pass before the expansion. I would have paid for the expansion, but not now when i also have to buy the base game.\n\nI wonder if it’s worth it for them to remove it from Game Pass. Not sure how many people are going to double dip for the expansion.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "skpom",
            "body": "It's somewhat of a weak month (not too interested in Atomfall), but Octopath 2 is great if you haven't played it already. \n\nI'm more excited for next month with South of Midnight, Clair Obscur, and Blue Prince. I really do wonder if the Oblivion remake shadow drop ends up being true for April",
            "score": 28,
            "replies": [
                {
                    "author": "Twoje",
                    "body": "Clair Obscur is coming to GamePass? That’s awesome news",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "dadvader",
                    "body": "It's still hard to believe for me about Oblivion remake/remaster. I feel like they would've hype the thing more if it's true. Elder Scrolls is a big name thanks to Skyrim and project of this caliber should be announce and marketing in advance.\n\nMy fear is that it'll be more like Grove Street GTA Definitive edition. Just throw the whole game into UE5 as is. Now shadowdrop sound believable.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "CassadagaValley",
                    "body": "Atomfall is a game I'm interested in but I don't think I would have bought it until it was $10 in a few years so GP is great for this aspect. Same with Avowed. I played it for 15 hours, it was fun, I didn't finish it, but I wouldn't have touched it until it was $10 on Steam lol.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "FlowersByTheStreet",
            "body": "Man, this is a pretty brutal month for gamepass. \n\nThere were some pretty serious heavyweights that were taken off (namely, the entire Yakuza series) and I can't say that the games were added really make up for it for me. Hope Atomfall turns out to be good!",
            "score": 21,
            "replies": [
                {
                    "author": "PoPo573",
                    "body": "They've been added and removed like 3 times now. Not sure what's going on with the license for it.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "FlowersByTheStreet",
                            "body": "For sure, I'm hoping they come back but there is that rumor of SEGA starting a similar service of their own so we'll see.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dragonfirex22",
            "body": "If anyone is looking for a solid turn based JRPG, Octopath 2 is one of the best I have played in a while. If you even slightly liked the first one, the second is literally just the first but amped up. And the soundtrack has surpassed Revengance for me in how they use the music during fights.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CopenhagenCalling",
            "body": "Game Pass has kinda become a “1 game per drop” subscription. Real slim pickings with the rest of the games and tons of great games are leaving the service every single drop atm. Not much if that one game isn’t to your liking.\n\nI feel like you could buy 6 months instead of 1 year and still have time to play the games you want to play.\n\nAt some point it will mostly just be Microsofts own games, might be what they are going for so they can bring Game Pass to Playstation and Steam like EA Play.",
            "score": 22,
            "replies": [
                {
                    "author": "junglebunglerumble",
                    "body": "There's 2 drops per month though, so I'd say 2 games a month that you're interested in is actually pretty reasonable. This year they've added already: \n\n* Avowed\n* Rogue Trader\n* Balatro\n* Citizen Sleeper 2\n* Eternal Strands\n* Ninja Garden 2 Black\n* Atomfall\n\nFor me that's a solid list for January to March, in addition to the various other games added like F1 24",
                    "score": 74,
                    "replies": [
                        {
                            "author": "EpicPhail60",
                            "body": "South of Midnight and Expedition 33 next month, too. Game Pass has been pretty strong this year",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "batatasta",
                            "body": "add mullet madjack to that list. under-the-radar banger of a game.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Danistar34",
                                    "body": "+1 Yeah, don't sleep on that game, it's awesome. Really have to check each game individually. A quick first look might seem like a \"no AAA game, only small indie slop to pad out\" kind of drop, but there are so many hidden gems there, you should always keep your eyes out and at least check each game on opencritic, because you might miss something great.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ehh_littlecomment",
                            "body": "Used to be way better pre ABK though",
                            "score": -8,
                            "replies": []
                        },
                        {
                            "author": "CopenhagenCalling",
                            "body": "That’s 7 games in 6 drops, which kinda goes back to “1 game per drop”. There are obviously more, but we uses to get 6-8 games added every drop, sometimes even more. They once dropped all the Bethesda games at the same time.\n\nThe problem with fewer games is that there is a significant chance that people don’t find anything they like. It used to almost be impossible to not find at least one game every drop.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "segagamer",
                                    "body": "> They once dropped all the Bethesda games at the same time.\n\nThis was something they tried and it turned out to be a bad idea. The result is people end up playing very few of them, or people end up ignoring new stuff for a while.\n\nBy drip feeding, it keeps people subscribed, and encourages exploration of other titles - something the industry today lacks as gamers typically concentrate on the franchises/developers they know.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PurpsMaSquirt",
                    "body": "Reddit has such a weird hate-boner for Xbox. There are about 600 games on Game Pass right now. They’d need to remove ~30% of their games to match what a competitor like Sony offers, but even then Xbox includes their 1P games day one.\n\nIt’s simple. Look at the catalog. If the games appeal to you, Game Pass is an excellent value. If they don’t appeal to you, save your money for what you want.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "monchota",
                    "body": "Reddit,  want Gamepass to fail so bad that the goal posts just keep moving. If it wasn't so sad it would be funny.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "MattyKatty",
                            "body": "Especially when you look at the complete schlock coming to PS+ as well (like Dragon Age: The Veilguard)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Raidoton",
                            "body": "It's not as funny as projecting any opinion you want onto \"Reddit\".",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "monchota",
                                    "body": "I agree , unfortunately im juat calling it as it is.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "avboden",
                    "body": "for the price of gamepass if you even play 2 to 3 big games per year it pays for itself.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Raidoton",
                            "body": "Or even better if you just subscribe for the months where you actually play something.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Alexij",
                    "body": "Milage may vary but if you have multiple devices and a houshold with varied interests then the value is insane.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Late_Cow_1008",
                    "body": "Its like when Humble Bundle used to be amazing and now its generally pretty mediocre.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "gk99",
                            "body": "That's because the focus is primarily on Humble Choice now, which is still a generally exceptional deal. This month is the worst in a while and *still* worth it if you're not an anti-EA App snob. Sir Whoopass looks like genuine shovelware being carried by memes and Homeworld 3 seems to be universally disliked because it's just a genuinely boring, mediocre game, but the indie titles are genuinely interesting and well-regarded, while the EA-published ones are both really good if you can get over the technical issues with Wild Hearts (which should be super easy for anyone interested, given that it's a Monster Hunter clone and knowing months ahead of time the MH Wilds was going to run like ass didn't seem to stop anyone from buying it).\n\nThe fact that you *keep* the games does a lot of work for the service. They tried to move away from that a bit with a horrible launcher and DRM-based catalogue of games, but I'm pretty sure that crashed and burned.\n\nNot to mention the charity aspect, as diminished as that has become.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Late_Cow_1008",
                                    "body": "I was talking about Humble Choice. And its not really that great of a deal. Most months are pretty poor these days.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "-Umbra-",
                                            "body": "I feel like Humble almost did their future selves a disservice with how absurdly good the value was for the first few years with the bundles.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Late_Cow_1008",
                                                    "body": "Yes, I was a subscriber since it started until last year. The biggest thing here is I usually have at least a few of the games they are giving away, and the headliner can usually be found on sale for around the same price as the monthly fee.\n\nAlso I just have way too many games in my backlog as it is. No need to add more.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zuzucha",
                    "body": "Agree, only want to play rock and roll racing",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Captain_Freud",
                    "body": "Which is especially frustrating, because they have an entire library of Activision games that they're hanging on to for the doldrum months. Where's Crash 4? Tony Hawk 1+2? What about any single classic Call of Duty game? All of which exist in the Windows PC Store already.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Reggiardito",
                            "body": "Bringing the old COD games would get me to sub instantly, bringing more players into the old MP would be amazing, currently they're super dead in my region\n\nBlack Ops 1 my beloved",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Kozak170",
                            "body": "It’s been said again and again that they’ve actively been patching old multiplayer exploits and hacks in the old CoD games before they put them on game pass in an unplayable state",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Captain_Freud",
                                    "body": "You act like Microsoft has been saying this repeatedly when all of that is just rumors and guesswork. There have been \"classic Call of Duty games are coming to Game Pass soon!\" rumors for over a year now.\n\nAnd that's still just one slice of the Activision library. What about Prototype? Singularity? Vampire: The Masquerade? GUN? Sekiro?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Kozak170",
                                            "body": "I’m not saying that they haven’t been slacking on adding the rest of the catalogue, I’m simply saying it’s beyond silly to clamor for unplayable games primarily known for their multiplayer to be added before they get fixed.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "C9_Lemonparty",
                            "body": "All of the classic call of dury games have been added to windows store as purchasable games, so they already have an actual working version for windows ecosystem. I can only assume they are saving them all for a quiet month or something",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "AbedGubiNadir",
                            "body": "They're probably fixing a bunch of issues from those old games and they also have to make a Microsoft store version as well for PC players.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "notclever251",
                    "body": "Works for me. I don’t have time for more than maybe 1 game a month. Especially when a lot of games are 50-60 hours. I’ve enjoyed trying out some of the smaller games or niche stuff I wouldn’t have bought otherwise and see what hooks me. If I can get 4 quality games out of it a year that I would’ve bought otherwise then the service pays for itself. The other games added that I try and get sucked into or bounce off are just gravy.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "tfox245",
                    "body": "Yep, gamepass has some interesting games on the horizon, but this trend of more games leaving the service each month than joining is concerning.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Raidoton",
                            "body": "Items come and go. That's how subscription services usually work. Just subscribe for the months that you wanna use it. People seem to have the feeling they have to stay subscribed forever...",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Equal_Present_3927",
                            "body": "They’ll come back probably. Not the first time games have been removed and come back a few months later. ",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deuenskae",
                    "body": "I prefer buying my games. I tried game pass and ps plus extra a few months and it just resulted in me not enjoying the games and always switching between games fast. While when I buy a game I make an investment and am rather going to finish it. Who has time for hundreds of games anyway ? For me it just didn't work. I'm 100% back in just buying the games I want instead of having a shitty subscription.",
                    "score": -13,
                    "replies": [
                        {
                            "author": "CopenhagenCalling",
                            "body": ">Who has time for hundreds of games anyway?\n\nNo one is playing every Game Pass game, but there’s obviously a bigger chance that you find a game you like if you have more to choose from.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "BreafingBread",
                            "body": ">Who has time for hundreds of games anyway ?\n\nNot sure about Gamepass, but my yearly PSN+ subscription has already paid itself from the games I finished and I'm not even playing that much on my PS5.\n\nI finished five games totalling around 100 USD. My subscription was 110 USD and I still have 8 months left on it.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hobo131",
                    "body": "It’s a shame too. You’d think they’d renew mh rise in the same month wilds came out. I haven’t played that or the yakuza games yet so it’s a real lame game pass month for me. At least expedition 33 is around the corner.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Raidoton",
                            "body": "> You’d think they’d renew mh rise in the same month wilds came out.\n\nRise seems to be less of a selling point for the Game Pass when Wilds is breaking sales records. Also Capcom might not want to have Rise in the Game Pass while their new game releases.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Death_Binge",
            "body": "Did they ever fix The Lamplighters League? The constant crashing became unbearable but it was so good when it worked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jokerzrival",
            "body": "I was JUST JUST about to buy Octopath traveler 2 for my switch so I guess I'll just play it on Xbox now and get like unicorn overlord or civ 7 for my switch instead!",
            "score": 1,
            "replies": [
                {
                    "author": "AlacranV",
                    "body": "I would wait like 2 more years on civ 7",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "baladreams",
            "body": "The precipitous pluge of games added to game pass and it's value seems to be in coordination with Xbox's pivot to being a publisher perhaps because the service is mostly successful only on the console platform which itself is struggling. I would have thought PC game pass/ cloud would have been a incentive to continue to maintain the level of games being added to the service but perhaps they are not making sufficient inroads to justify the investment. On PC steam is understandably insurmountable. If they do intend on making game pass into EA play or Ubisoft plus it might at least add value to offer dlcs like those publishers do.",
            "score": -13,
            "replies": [
                {
                    "author": "sonicfonico",
                    "body": "1 \"just ok\" month and the Doom and gloom starts lol. There's so much stuff coming to Gamepass, like almost 1-2 day one a month.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}