{
    "title": "Smash Bros’ Sakurai says Japanese devs should focus on domestic, not Western tastes | VGC",
    "author": "megaapple",
    "subreddit": "Games",
    "rank": 3,
    "score": 1069,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 306,
    "url": "https://www.videogameschronicle.com/news/smash-bros-sakurai-says-japanese-devs-should-focus-on-domestic-not-western-tastes/",
    "id": "1je7hdj",
    "selftext": "",
    "comments": [
        {
            "author": "MikeyIfYouWanna",
            "body": "The main part from the article:\n\n\nLast week Sakurai collected his award and gave an interview to Japanese entertainment news website Entax (as spotted by Automaton), in which he said he felt that Japanese studios should focus on what domestic audiences like, rather than trying to make a game that may appeal to the West.\n\nAccording to Sakurai, Western players buy Japanese games with the expectation that they will provide something different from Western-developed games, so there’s no need for Japanese studios to adapt.\n\n“It’s not necessarily my own idea, but the trend in the games industry is that Japanese people should go for what Japanese people like,” Sakurai explained (via machine translation).\n\n“A while ago, there was certainly a culture of making Americanised products, because various works were popular in the US. However, I feel that ‘Japanese game lovers’ overseas are not looking for such things, but for something unique and interesting from Japan.\n\n“In other words, I think the ideal is to make the games the way you like them, and the people who can accept them will enjoy them.”",
            "score": 764,
            "replies": [
                {
                    "author": "Rikuskill",
                    "body": "I see, he's basically saying chasing trends that are popular elsewhere isn't as effective as making something the studio's members are passionate about and interested in, usually informed by more domestic culture.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "cyberscythe",
                            "body": "i think there's also the idea that Japanese developers might not know what the Western tastes are exactly since they don't innately have those same tastes and aren't necessarily immersed in that culture\n\ni think of it as \"painting with colors that you can't see\", a metaphor i heard by a progressive/experimental musician talking about chasing trends in popular music",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Dealric",
                            "body": "He also notices (correctly) that people want different games. Japanese games are usually valued not because they attempt to be same as western games but because they have their unique essence.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "garnish_guy",
                            "body": "I see that as being at least half of his point. The other, maybe more implied, is that we don’t live in the times where people don’t understand Japanese culture anymore.\n\nI go to the gym and always see at least one dude working out in a Goku outfit. Times have changed and it’s wild lol.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ManonManegeDore",
                                    "body": "Liking anime does not mean you understand Japanese culture.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ManonManegeDore",
                                    "body": "Liking anime does not mean you understand Japanese culture.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "garnish_guy",
                                            "body": "Feel free to elaborate with your definition of sufficiently understanding Japanese culture.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Samurai_Meisters",
                            "body": "The only western trend I want to see Japanese gamedevs chase is to make better UI/UX.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Smart_Ass_Dave",
                            "body": "Me thinking about every American re-make of an anime: \"Strongly agree.\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "VerraTheDM",
                    "body": "Thanks for providing more of the context for those who might get a negative gut reaction from the headline.\n\nWould absolutely suck for games from Japan to lose their unique essence just to mimic what is coming out of the West.\n\nEdit: Alright gamers I get it that has already happened for a good number of Japanese devs.",
                    "score": 267,
                    "replies": [
                        {
                            "author": "Sonicfan42069666",
                            "body": ">Would absolutely suck for games from Japan to lose their unique essence just to mimic what is coming out of the West.\n\nWe literally already lived through an era of this and it was bad for gamers *and* bad for trend-chasing Japanese publishers. Capcom was one of the worst offenders in the Xbox 360/PS3 generation.",
                            "score": 155,
                            "replies": [
                                {
                                    "author": "Yomoska",
                                    "body": "I would love for Capcom to take another crack at Dead Rising as I liked the original way more than the western sequels (although I did really enjoy DR2). The original had this odd take on American culture that the Westernized sequels lacked.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "GrayDaysGoAway",
                                            "body": "Judging by the Dead Rising Remake I don't trust them to do a good job with a new one. They couldn't even replicate the number of zombies on screen that the original had, let alone the atmosphere / vibe. \n\nAnd looking at their recent games like Dragon's Dogma 2 and Monster Hunter World it would probably be optimized like shit too.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "missing_typewriters",
                                                    "body": "Capcom get a lot of credit for very little these days. They keep churning out the most soulless remakes and everybody goes *“wow! Incredible! Give us more!!”*. None of them have even surpassed their original versions. RE2Remake was on the right course, but 66% of the game went to shit (a.k.a. As soon as you leave the police station)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "spez_might_fuck_dogs",
                                    "body": "Rest in peace, Lost Planet series. Went from the weirdest kaiju multiplayer sci-fi shooter to a shitty moody white guy in a slow, boring robot listening to bad country music exactly because of Capcom’s westernizing bullshit.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "taicy5623",
                                    "body": "We need to clarify though. There's a difference between stuff like Dead Rising or Resident Evil drawing heavily from western media and trend-chasing.\n\nTo a certain extent I think people are trying to forget just how much 7th gen was dominated by people chasing after COD money.",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "Sonicfan42069666",
                                            "body": "The Dead Rising sequels and Resident Evil 5 and 6 are absolutely offenders in my opinion.\n\nRE6 moreso, RE5 felt more like an attempt to capitalize on the popularity of RE4 combined with \"it's 2009 and online co-op is popular\"",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "author": "Karzons",
                                                    "body": "Yes, Capcom said as much back then.\n\nA few months before Resident Evil 6: \"[Looking at the marketing data \\[for survival horror games\\]... the market is small, compared to the number of units Call of Duty and all those action games sell,\" he said.](https://web.archive.org/web/20120325212514/http://games.ign.com/articles/122/1221455p1.html)\"\n\nThey go on to say they don't have to go \"all the way in that direction\", but they wouldn't have ever mentioned it unless that's where they were facing.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "gmishaolem",
                                                    "body": "RE5 was the first RE I actually liked at all. The controls sucked less, and one of the worst things about old RE games was limited ammo. I want to defeat enemies, not run from them. Not to mention the limited number of saves. What is it about Japanese developers/gamers who don't know the difference between challenge and punishment? Making it super slow to walk when you're low on health? Why even have a health bar at that point? You want the player to lose so bad, just make them lose.\n\nI'm glad for modern design principles.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "JoeyKingX",
                                    "body": ">Capcom was\n\nPretty sure this is relevant once again now",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "TrashStack",
                                            "body": "Yeah Capcom have *always* one of the biggest Western market chasers in the entire industry lol. I'm sure there's a lot of people that don't even realize Resident Evil is a Japanese franchise. And of course SF6 leans super heavily into western influence too\n\nBut the difference between then and the 7th gen is they haven't completely abandoned their more off beat Japanese influenced series now. Okami 2, not Okamiden",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "unrelevant_user_name",
                                                    "body": "Okamiden wasn't \"Westernized\" either though?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "cuckingfomputer",
                                    "body": "Lost Planet 2 was incredible, though. And RE5 was pretty popular, even if it doesn't really make anyone's top 3 list in the horror genre. Plus that's the same era where Monster Hunter was establishing it's roots.\n\nThere's other publishers you could probably cite to support your point, but I don't think Capcom is one of them.\n\nedit: And how could I forget about Dragon's Dogma.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Express-Lunch-9373",
                                    "body": "Didn't that give us some of the best games of that era and start off some of the biggest franchises that era saw?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sonicfan42069666",
                                            "body": "From Japan? Like what?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Express-Lunch-9373",
                                                    "body": "Dead Rising, Lost Planet, Dragon's Dogma I'd say were those would fall under the \"we want to make Western style game to appeal to the Western audience\" banner.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Important-Net-9805",
                                    "body": "it just happened with monster hunter wilds",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Shakzor",
                            "body": "Well, that happened already, as he mentioned near the end.\nPS3/X360 era was reallybad for jrpgs and adjacent genres, cause they tried to westernize.\nSO glad we're back to them doing their own thing",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Commercial_Orchid49",
                                    "body": ">PS3/X360 era was reallybad for jrpgs and adjacent genres, cause they tried to westernize.\n\n>SO glad we're back to them doing their own thing\n\n\nSquare Enix still has not received the memo.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "PKMudkipz",
                                            "body": "Between Octopath and Neo TWEWY and SaGa and Nier and Dragon Quest and Mana and Diofield and the gorillion other JRPGs they've released not named Final Fantasy XVI, I think they got the memo.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Commercial_Orchid49",
                                                    "body": "A fair point, but they're ignoring the memo on the series where it matters most.\n\nConsidering how much more money gets blown on Final Fantasy than those others (likely combined tbh), it simply has more financial impact.\n\nSE revenue is down overall for the past couple years now. Octopath, Nier, and such are neat, but they're still too small to recover the losses from failures like Forspoken, FFXVI, and Foamstars. \n\nThey're losing money doing the thing Sakurai warned against.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Dealric",
                                            "body": "Square Enix usually is years behind on memos though",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "codeswinwars",
                                    "body": "Looking at PS3/ 360 games is kind of misleading. That era wasn't bad for Japanese games at all, games in traditionally Japan-focused genres mostly just migrated from home consoles to handhelds as the tastes of the Japanese market shifted and console development got more expensive.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "VellDarksbane",
                            "body": "This is to some degree, what people are complaining about when they hate on modern Final Fantasy.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "QueenBee-WorshipMe",
                                    "body": "Wasn't final fantasy pretty much inspired by western fantasy from the get go though?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "furutam",
                                            "body": "Taking the basic aesthetic from Western Fantasy isn't the same as trying to copy a Western mindset. Berserk takes a lot of imagery from Western Fantasy, but the story structure and character arcs are very Japanese.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "XXX200o",
                                                    "body": "Fromsoft pretty much built their whole success on this. Take western inspired fantasy settings and make them unique with your japanese spin.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ManonManegeDore",
                                                    "body": "What is the \"western mindset\"? What does that even mean?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "greenbluegrape",
                                                            "body": "Gameplay trends, design philosophy, etc.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ManonManegeDore",
                                                                    "body": "You're still being incredibly broad. There is no \"western mindset\". Baldur's Gate 3, The Last of Us Part II, and Inside are all western. What exactly is the unifying trend or design philosophy you see between those three games?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "greenbluegrape",
                                                                            "body": "I'm not the person you replied to, I was just trying to give you a generalized answer.\n\nI'm not the one who invented these labels, but typically, we apply them to genres and design philosophies that are popularized in specific regions. They're not concrete labels, but they're still useful when describing particular styles that are heavily influenced by the culture of said region. It's why I can make a distinction between \"Western\" animation and \"Japanese\" animation in the television industry, and people know exactly what I'm talking about. That doesn't mean ALL Japanese animation is the same, or ALL western animation is the same, it's just a term we use to describe a generalized design philosophy.\n\nRegarding the three games you mentioned, the genres themselves may not be region specific, but they're chock full of design decisions that are far more common in the west than they are in Japan. For example, games like Baldur's Gate 3 are designed with massive, branching paths and a heavy focus on player agency. This is a style of game that rarely, if ever, gets attempted in Japan, and much of the genre's roots can be found in tabletop RPGs that were popularized in the west during the 70's and 80's. That doesn't mean Japanese RPGs as a whole aren't influenced by western trends, and it also doesn't mean that these style of games are exclusive to one region, but if a Japanese studio attempted to make an RPG with the same design philosophies as something like a Fallout, then some might argue that they're taking inspiration from a western mindset, in the same way some will argue that Expedition 33, one of the first western RPGS in a long time to incorporate a linear, turn-based combat system, is taking inspiration from a Japanese mindset.\n\nWe use these kinds of labels all the time in film and, especially, music. It stands to reason that they'd be used in video games as well.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "furutam",
                                                                            "body": "> There is no \"western mindset\"\n\nHow you gonna be saying this in a thread about a Japanese game dev talking about how Japanese game devs should not be catering to western tastes",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AnEmpireofRubble",
                                                                                    "body": "because Sakurai could be wrong and they disagree.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Monk_Philosophy",
                                                            "body": "Gonna go on a limb and say that they means \"wokeism\" or some shit.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JayCFree324",
                                            "body": "I think moreso that Final Fantasy games have strayed further and further from their turn-based origins due to Western audiences and their attention spans.\n\nWhich is kinda funny because Atlus & RGG are finding massive success by filling that void",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ManonManegeDore",
                                                    "body": "But not nearly as much success as Final Fantasy which fans are quick to remind everyone. \n\n  \nI feel like FF has been coasting off its name for a while now..",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "VellDarksbane",
                                            "body": "Yup, which is why I don’t agree completely with those people.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "ZombieJesus1987",
                                            "body": "It combines both western and eastern fantasy with a little bit of sci fi thrown in",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TheMajestic00",
                                    "body": "Square is probably the biggest offender of this in general",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "VellDarksbane",
                                            "body": "Not true. They have put out _many_ games that still have that essence, it’s just the flagship Square game series can be said to be losing some of that original essence. DQ 11, and I believe every 2D-HD game has kept their feel. There’s definitely trend chasing that is happening, like with Foamstars and Forspoken, but they have mostly been flops. SE experiments more than many other studios with “western” ideas, and that makes sense considering the roots, as IIRC, both FF and DQ were inspired by “western” TTRPGs.",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "superkami64",
                                    "body": "Tbf Final Fantasy has managed to thrive because of its willingness to change for better or worse. It's one of the reasons why Dragon Quest continues to flounder because while it's dedicated to maintaining its current audience, it struggles to garner new fans and increasing development budgets means it needs those in order to continue being around.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "MrGamer419",
                                            "body": "I wouldn't say Final Fantasy continues to thrive nowadays. Both XVI and Rebirth sold below expectations, and according to recent sales data, XVI barely has any legs.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "superkami64",
                                                    "body": "People said the same thing when FF13 and the original FF14 were knocking about. The path to improvement isn't always a steady climb and sales aren't indicative of quality given that FF15 sold so well despite being mediocre.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "AnswerAi_",
                                    "body": "Absolutely not. The thing I complain about the most is the writing, has nothing to do with chasing Western trends, and the one I thought got the closest to a return to form, was a legit game of thrones rip off. FF15 was legit chasing every western trend, and I thought the gameplay was awesome. I really liked playing FF15, but the story was so god awful I wanted nothing to do with that game.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "One_Telephone_5798",
                            "body": "I don't think people who would form opinions based on a gut reaction to a headline and not bother to do any further reading have opinions worth considering anyway. \n\nPeople like that deserve as much effort put towards their opinions as they put into their own, which is none at all.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "VerraTheDM",
                                    "body": "I mean.. sure? But I’d rather they have the chance to see the above comment before cluttering the comments with nonsense.",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "everstillghost",
                            "body": ">Thanks for providing more of the context for those who might get a negative gut reaction from the headline\n\nWhat the negative reaction one would take?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ManonManegeDore",
                                    "body": "I get his point but I'm pretty wary of anyone that perpetuates this \"East vs. West\" culture war bullshit. He's talking about gaming and millions of people are going to read this to mean that Japanese games should be homogenous and apolitical because that's what they project onto works made in that region even when it isn't true.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "everstillghost",
                                            "body": "Well, in a certain way he definitely is saying for the eastern devs to not pander to the west audience.\n\nAnd they indeed tried in the past (with terrible results)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ManonManegeDore",
                                                    "body": "Okay so exactly. So that's why I'm having a negative reaction to what he's saying. Because you think he's talking about pandering or some anti-woke bullshit while other people are saying that isn't what he means. \n\n  \nSo again, I'm wary of anyone perpetuating culture war bullshit.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "VerraTheDM",
                                    "body": "Something along the lines of \"Oh wtf what's wrong with western tastes\". I didn't have any such reaction as I'm fairly used to having to dig deeper on interviews like this (especially when they include translations) so I can't exactly tell you what they'd be thinking.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gyossaits",
                            "body": "> Would absolutely suck for games from Japan to lose their unique essence just to mimic what is coming out of the West.\n\nWouldn't mind seeing something on the level of Baldur's Gate though.",
                            "score": -4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "F1CTIONAL",
                    "body": "> I feel that ‘Japanese game lovers’ overseas are not looking for such things, but for something unique and interesting from Japan.\n\nThis is what I've been saying for years. This applies to all sorts of aspects of development, from the actual themes and subjects to how things are localized (dialog being westernized and removing eastern references in favour of more approachable, western ones).\n\nGames are a great medium for people to explore other cultures. If you don't immediately 'get it', that isn't a knock on the game but rather an opportunity for you to learn or feel something new.",
                    "score": 72,
                    "replies": [
                        {
                            "author": "taicy5623",
                            "body": ">how things are localized (dialog being westernized and removing eastern references in favor of more approachable, western ones).\n\nI've long been saying that most game localization need a relatively accurate subtitle for JP audio, with a more loose one for the dub. I remember being told it was financially unviable on this very subreddit years back, only for Yakuza to do EXACTLY THAT to relatively high praise.\n\nThere have to be changes, but half of the changes I see people get angry about, like Unicorn Overlord, are just legitimately good additions and give something for the dubbing voice actors to work with.\n\nIf the people who get really weird about this stuff were taken more seriously, we never would have gotten such a great performances from Rene Zagger as Emet Selch in FFXIV, or Ben Starr in FF16 (the best part of 16 imo). FF7Rebirth's fantastic dub would still have the weird anime ass grunts that only sound good in Japanese but just sound awkward in English, which basically ruined a certain emotional death scene in Remake.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "logique_",
                                    "body": "IIRC wasn't FF16's dialogue written in English first?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TomAto314",
                                            "body": "It was.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "taicy5623",
                                                    "body": "The english dialog and mocap was done first, the writing was done in both languages essentially in parallel.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ManonManegeDore",
                            "body": ">Games are a great medium for people to explore East Asian culture. \n\nFTFY. Games are a terrible medium for exploring other cultures because the gaming community reflexively and inherently rejects any game that is considered born of \"western\" culture. They don't want non-eastern culture in games.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "asmallercat",
                    "body": ">“In other words, I think the ideal is to make the games the way you like them, and the people who can accept them will enjoy them.”\n\nThis is the key takeaway - it's not that people should make games that fit X country's taste or not, it's that people should make the games they want to play and make. He's not even saying a japanese dev shouldn't make a \"western\" style game if that's what they like, he's just saying they shouldn't warp what they're making to try and fit that market.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "DemonLordDiablos",
                    "body": "Sakurai's such a treasure and it's gonna blow when he goes away. \n\nI don't agree with all the ways he thinks, but imo his video series should be mandatory viewing for every aspiring or current game dev.",
                    "score": 49,
                    "replies": []
                },
                {
                    "author": "One_Telephone_5798",
                    "body": "Like a Dragon pretty much proves this. I don't think Western developers could make a game quite like that even if they tried really hard.",
                    "score": 75,
                    "replies": [
                        {
                            "author": "entity2",
                            "body": "If RGG Studio ever stops being absolutely batshit fucking insane, the world will be a worse place.",
                            "score": 45,
                            "replies": []
                        },
                        {
                            "author": "NoNefariousness2144",
                            "body": "A lot of devs could learn from how the LaD games reuse assets. They don’t have to go as far as releasing a new game every year like LaD, but you look at some games with bloated budgets and dev times and wonder what is going on…",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "ZombieJesus1987",
                                    "body": "I'm surprised the culture war vultures haven't bitched and moaned about this.\n\nThey were quick to jump on Assassin's Creed and Horizon Forbidden West and calling them \"lazy\" for reusing animation assets",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Takazura",
                                            "body": "I have seen some complaints about LaD and IW being woke, though I don't remember what they were mad about.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Coolman_Rosso",
                                    "body": "In most discourse about this practice Japanese devs get a pass because it's \"smart\" or some weird infantilization of an entire group of people where they \"don't understand\" that you need to make new things.  \n\nMeanwhile if EA or Ubisoft does this they're raked over the coals and used as the poster children of lazy irresponsible devs trying to make a quick buck.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Proud_Inside819",
                            "body": "On the other hand, they are trying to make it more for western tastes. It's not surprising the game is set in the US soon after they focus more on the global audience and localising the games day 1.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "One_Telephone_5798",
                                    "body": "I don't think setting it in Hawaii is as much pandering to Western audiences as you might think. Hawaii is an incredibly popular travel destination for Japanese people and in fact Japanese tourists make up the largest source of international tourism for Hawaii. \n\nCurrently Japanese people make up 16-17% of Hawaii's population and they're the second largest ethnic group in Hawaii after Hawaiians themselves. \n\nThe decision to set the game in Hawaii was almost definitely more about giving Japanese players a fresh setting that isn't the same neighborhoods they're familiar with than any consideration for Western audiences.",
                                    "score": 82,
                                    "replies": [
                                        {
                                            "author": "WeaponisedArmadillo",
                                            "body": "Probably picjed hawaii because Kiryu isn't allowed to go to Okinawa. ",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "seruus",
                                                    "body": "Doesn't he go to Okinawa in several of the games, including 6?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "WeaponisedArmadillo",
                                                            "body": "I dont want to go into details but he's no longer allowed to now. ",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Takazura",
                                                            "body": "The ending of 6 means he can't go there.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TrashStack",
                                            "body": "Places like Hawaii are a \"kill two birds with one stone\" setting\n\nFor a Japanese playerbase the setting will be exotic and fresh, while for an American audience, even though Hawaii is still pretty different from the mainland, it will still feel more close to home than a Japanese setting. It doesn't have to be one or the other. Things can be both column A and column B. Especially since it's a Sega franchise and Sega more than many other Japanese developers really love to push Western appeal",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "chupitoelpame",
                                            "body": "And it's not even speculation, the characters actually say much of this on the game itself",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TechWormBoom",
                                    "body": "I think if they were trying to heavily appeal to Western tastes, they wouldn't have shifted to an explicitly turn-based JRPG with 2020's Yakuza: Like a Dragon when Yakuza 0 had already been an incredible success worldwide.",
                                    "score": 25,
                                    "replies": []
                                },
                                {
                                    "author": "trapsinplace",
                                    "body": "Leaning into a global audience usually works better than full sending it from what I've seen. Persona is growing as it stays true to its core but becomes a little more western-friendly. Same for Like a Dragon. Most stuff Square Enix touches on the other hand is going downhill the more they chase a western audience and change their games to fit that identity. FF as a series has lost most of its core fandom of guaranteed buyers in exchange for gambling on a massive success like western AAA publishers do and it's having some major lows for them despite a few big wins.\n\nI think Sakurai has a great point in that the reason people who like Japanese games got into them is because it was different from what they already had and they liked that difference. If devs who usually make games for their home market abandon that market for another they end up losing both their home market and all foreign fans of that market. The reverse is true too though as we can see. You can keep your main target audience while opening the door for a new audience who may realize that the games were good all along but they just never gave it a chance.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Guardianpigeon",
                            "body": "The last two decades of Capcom also prove this.\n\nThey pivoted hard to western interests and it ended up being an unmitigated disaster. Then when they abandoned that and went back to focusing on the classic Japanese based series that made them popular in the first place, they essentially entered another golden age.\n\nThere are plenty of western games I love, but there are also a ton of Japanese games that were foundational to the rise of video games. Why they thought abandoning those to chase after CoD and stuff like that was a good idea is beyond me.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "entity2",
                    "body": "I agree 100%. My interest in Japenese games came from just how weird things got.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "HBreckel",
                    "body": "I support a lot of Japanese studios because I like Japanese games, they don't need to change a thing. I hope they'll remember how things went over when a studio like Capcom tried too hard to make games for the west.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "SofaKingI",
                            "body": "Wait until you realise when Japanese devs say stuff like this they also include complaints from \"western tastes\" like garbage UI design or net code.\n\nI don't think there's anything wrong with japanese devs making westernized stuff. As long as they keep their different perspective on the subject, and don't just try to mimic, the end product will feel uniquely different. That's basically what From Software is.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "AnswerAi_",
                            "body": "Insanely hard disagree. Theres a million things that Western devs are good at, that I wished Japanese devs understood. They make online games, and then make playing the games online the most painful experiences of all time. I think Japanese devs insistence on thinking they should re-invent the wheel for some of the most simplest shit known to man, makes me lose my mind. Japanese devs by and large are some of the most incompetent game designers when it comes to UX.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AnEmpireofRubble",
                            "body": "japan so good!  west baaaaaad.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sergnb",
                    "body": "I feel like this sounds very nice and reasonable when spoken in generalities but it can mean an infinite amount of things in practice and they would interact with the market completely differently. Any negative or positive reaction to it could be right for wholly different reasons.\n\nA “game for Japanese audiences that western fans would find unique” could be an rpg/dating sim revolving around a locally famous irl idol group of 3 young girls, voice acted and motion captured by the actual girls themselves. This would be popular in japan but it would sell all but 25 copies in the entire western sphere, which I'm sure is not the strategy Sakurai has in mind. \n\nWhat does “designed for western audiences” even mean, really? Dark souls and Earthbound are very inspired by western cultures, do those count?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Melia_azedarach",
                            "body": "I think it's funny he talks about Japanese tastes. As I understand, Japanese tastes these days are heavily oriented towards mobile/F2P games that are made in Korea and China.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ManonManegeDore",
                            "body": ">What does “designed for westerners audiences” even mean, really?\n\nNo one is actually going to answer this. But the idea is that western audiences are stupid and only like CoD and Assassin's Creed. Eastern audiences are hyper intelligent and like Dark Souls and Breath of the WIld.\n\n  \nWestern audiences like bad games and eastern audiences like good games, is the argument.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PKMudkipz",
                                    "body": "Easy with the victim complex, no one is going to define it because it's an incredibly hard thing to accurately define, even though it's pretty simple to appreciate in practice. It's like how JRPGs and WRPGs are like night and day but everyone struggles to define the difference without misattributing a third of both genres.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ManonManegeDore",
                                            "body": "No one is going to define it because they don't know what they're talking about. It's some vague \"wokeism\" bullshit.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bamith20",
                    "body": "I like the take overall. Japanese games used to be more weird in general I think, which was an intriguing appeal, but more niche of course.\n\nLike, something as odd as Katamari for instance seems quite rare now.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "AnEmpireofRubble",
                            "body": "western indies make Katamari look tame.  what is this take?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mama_Mega",
                    "body": "I specifically like Japanese media because it does not pay any attention to Western sensibilities. There are some Japanese sensibilities I really hate in Japanese media too, but having to deal with shit like \"killing henchmen is okay, but actual villains should not be punished for being evil\" is a fair trade for these creatives paying no attention to modern Hollywood.\n\nPlease Japan, keep making art the way you already are. If any Westerner (including me) has an issue with it, just mock them with a \"sucks for you\" and go back to it.🙏",
                    "score": 11,
                    "replies": [
                        {
                            "author": "TomAto314",
                            "body": "> There are some Japanese sensibilities I really hate in Japanese media too\n\nThe refusing to ever show underage people drink is starting to grate on me. I'm not saying we should promote underaged drinking but half the time it's in some weird fantasy worlds were those laws don't apply or for whatever reason they just want to point out that you're too young to drink instead of just ignoring it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Takazura",
                            "body": "What, you don't enjoy anime Hitler being on his knees and MC preaching about killing him makes MC no better so he won't deal the finishing blow?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Decimator1227",
                    "body": "I really hope Japanese devs listen to him (Square Enix)",
                    "score": 14,
                    "replies": [
                        {
                            "author": "-Moonchild-",
                            "body": "SE's output over the last 5 years has been extremely japanese focused. all the HD2D games, the FF7 remake series, all the DQ stuff, a random sequel to the world ends with you, remasters of tactics ogre,  visions of mana, romancing saga and even foamstars which (while bad) was heavily copying splatoon - a series that is extremely popular in japan",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "Dealric",
                                    "body": "FF7 Id say was very americanized. DQ stuff also felt americanized in comp to previous entries. So thats not exactly helping",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "-Moonchild-",
                                            "body": "rebirth was an extremely japanese game, it just happened to take some design cues from open world games, but the actual content within that open world structure was extremely japanese. The moogle mini game and every single thing in gold saucer for instance",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Dealric",
                                                    "body": "Ti be fair I only played part 1 so far and basing in it not rebirth. \n\nFor me whole game in comparison to original felt really westernized. Im not saying its objective truth (since we dont really have any metric for it), but thats my opinion.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "phray2",
                                                            "body": "Care to explain why you think that?\n\n\nEspecially rebirth feels far more \"anime\" than the original game which was more grounded.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Dealric",
                                                                    "body": "Well again Im basing it of first one, not second. So cant talk on rebirth.\n\nFor me gameplay felt much more inline with typical western cinematic games (like many of sony exclusives), in general recent finals combat especially feels to me that way. Other would be open world and how its handled.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "darkmacgf",
                                                                            "body": "> in general recent finals combat especially feels to me that way\n\nYou don't think it's influenced by Japanese games like Kingdom Hearts or Devil May Cry? Action RPGs come from Japan.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dealric",
                                                                                    "body": "Personally I dont see simmilarities to DMC really.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mrnicegy26",
                            "body": "Other than the lack of Turn based combat, isn't FF Rebirth the most JRPG game in the Final Fantasy franchise since 10?",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "Monk_Philosophy",
                                    "body": "Ironically, while copping the aesthetics of the brown and gray PS3/360 cover shooters era, Stranger of Paradise is the most Japanese that Final Fantasy has been in ages. (excluding the MMOs, I've never played).\n\nCould not recommend SoP enough. It's a deconstructed JRPG and fucking amazing.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ohheybuddysharon",
                                    "body": "And the combat feels very Japanese despite it being action based.\n\nThere's basically no western game with melee combat that's as good as FF7 Rebirth.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "mrnicegy26",
                                            "body": "I agree. I think only Sekiro, Bloodborne and Devil May Cry 5 have better melee combat than Rebirth at this point.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "phray2",
                                                    "body": "Honestly hard to compare. to me remake/rebirth feels as much turn based as it does action.\n\n\nIt basically just takes the waiting for ATB bar to fill up of the original game and replaced that part with action combat. You are still in menu doing as much turn based menu navigating as the original games.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "extralie",
                                    "body": "Honestly, I wouldn't even call most FF games since 10 to be copying wester games tbh. Definitely not 12, 13, and 16 at least. Some people would argue against 16, but that game is a character action game, even if you don't like the shift in genre, the character action genre is mostly a Japanese dominated genre. (and even if we talking story tone, the second half of 16 is just an over the top anime)",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "red_sutter",
                                    "body": "Almost all of the people in here mentioning Square Enix are really just saying “make the next FF turn-based and linear,” since apparently ‘the west’ invented both those concepts",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Kalecraft",
                                    "body": "Yeah that's probably why it's the only AAA Square Enix game I've liked in the past decade or two",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "mrnicegy26",
                                            "body": "Isn't Nier Automota and Dragon Quest 11 also very Japanese style?",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "ohheybuddysharon",
                                                    "body": "Octopath traveler 2 as well",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "meikyoushisui",
                                                            "body": "Square's lower budget \"AA\" style games have been consistently good to great. (Think Octopath, Star Ocean 2 R, Tactics Ogre Reborn, Live-A-Live, Bravely Default, Triangle Strategy)",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "ohheybuddysharon",
                                                                    "body": "Paranormasight is also a fantastic one that more people need to play",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Kalecraft",
                                                                    "body": "That's exactly why I specifically said AAA. I adore what square has been doing for many of their mid budget games over the past few years",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Blade1587",
                                                    "body": "Seeing the square enix wikipedia it feels like there’s about 1 western inspired game for every 10-15 games they released. Since 2020 it was basically just forspoken and ffxvi",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "red_sutter",
                                                            "body": "And other than the lead characters and general setting they play nothing like any western game made",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "garfe",
                                                            "body": "Because when people are saying Square went too Western, they are only thinking of Final Fantasy and nothing else",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Kalecraft",
                                                    "body": "Never played Nier because of performance problems on PC but I definitely loved DQ11. Wild to think that game came out in 2017",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SergeantSchmidt",
                    "body": "I mean they could learn how a userfriendly UI works, and how you port something on the pc. Thats all I'm asking for.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Chezni19",
                    "body": "thanks for providing that context\n\nI think this is actually a lovely thing and I'm glad that Sakurai feels this way.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SpookiestSzn",
                    "body": "So real. Most of my favorite games of all time are from Japan and I love because of their unique style. Dead Rising 1, Resident Evil, Silent Hill, Like A Dragon series, they become much less interesting if they try watering down to western audiences. DR and SH are perfect examples of this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ContinuumGuy",
                    "body": "This is important context.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tankdoom",
                    "body": "As a Sonic fan, I feel this issue has consistently plagued the Sonic franchise, and most of the games that people actually love take the biggest cracks at appealing to a Japanese market instead of a western one. Something like Shadow Generations or SAB2 comes to mind. And then you look at something like Sonic Colors or Boom, which goes out of its way to feel very western...\n\nThat said, for that specific franchise, I think there's a delicate balance. But my overall sentiment is that Sakurai is 100% correct. The games coming out of Japan that gamers love are loved BECAUSE they feel different. Even Mario, probably the most broadly appealing IP in gaming, has a certain Japanese sensibility to it, especially in the series' most successful games imo.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MultiMarcus",
                    "body": "I think he’s very much right. If people liked the games before they started making them specifically for western audiences, I don’t think you need to change massively how you’re developing those games. I would like Japanese developers to maybe take some cues from the rest of the industry in optimisation because there have been disproportionately many badly performing games coming out of Japan that never really get fixed. It is one thing to have a game launch in a bad state but then get patched, but a game like Elden Ring is still running badly and Monster Hunter Wilds is certainly not a winner on the performance front",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ProfPerry",
                    "body": "I really like this way of thinking.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "VintageSin",
                    "body": "I agree with him except for the fact that Japanese developers should learn to make uis not so shit regardless of Japanese audiences accepting them... Looking at you monster hunter 😝",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "alurimperium",
                    "body": "Overall I agree, and see how he's right. On the other hand, Japanese devs trying to make American games is how we get such schlock classics as Binary Domain, or the action movie nonsense that Resident Evil became in 6, as well as a host of fun, stupid garbage from the 360/PS3 era. Even in a positive way stuff like Demon's Souls or Dragon's Dogma which were trying to follow a more western design philosophy, and ended up giving us a unique mishmash that worked much better than they could have hoped",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TransendingGaming",
                    "body": "Sony: “oh I’m sorry, I can’t hear you over my mountains of money? What’s that? You want to bring back Senran Kagura? DENIED! We only want “mature” video games on our platform, not disgusting otaku filth! That will push away our audiences!!!!!”",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Edheldui",
                            "body": "I hope Sony learned the right thing from Concord.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Squibbles01",
                    "body": "I think another point is that gamers like me have been playing Japanese games since our youth, so I basically have a Japanese sense of taste when it comes to gaming.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "VVrayth",
                    "body": "I understand this to a degree. But it's also just part of the weirdo \"it cannot be helped\" Japanese world view that leads to stuff like Final Fantasy XIV never, ever evolving or deviating in any meaningful way from its robotic-ass content blueprint.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Scoobydewdoo",
                    "body": "The problem is the numbers prove this guy both right and wrong. \n\nHere are the top selling games in Japan in 2024:\n\n1. Super Mario Party Jamboree (Switch) – 954,621\n2. DRAGON QUEST III HD-2D Remake (Switch) – 930,505\n3. Mario Kart 8 Deluxe (Switch) – 536,019 (Total: 6,167,617)\n4. Super Mario Bros. Wonder (Switch) – 419,854 (Total: 1,969,255)\n5. Momotaro Dentetsu World: Chikyuu wa Kibou de Mawatteru! (Switch) – 411,406 (Total: 1,207,087)\n6. Animal Crossing: New Horizons (Switch) – 377,781 (8,022,435)\n7. The Legend of Zelda: Echoes of Wisdom (Switch) – 372,903\n8. Minecraft (Switch) – 368,364 (3,762,586)\n9. Final Fantasy VII Rebirth (PS5) – 358,353\n10. Powerful Pro Yakyuu 2024-2025 (Switch) – 341,908\n\nHere are the top earning games in the US in 2024:\n\n>In 2024, the top-selling video games in the US, by dollar sales, were Call of Duty: Black Ops 6, EA Sports College Football 25, Helldivers II, and Dragon Ball: Sparking! Zero. Here's a more detailed breakdown:\n\n* **Call of Duty: Black Ops 6:** Ranked as the best-selling game in the US for 2024. \n* **EA Sports College Football 25:** Came in second place, marking the return of the college football gaming franchise after a hiatus. \n* **Helldivers II:** Claimed the third spot on the list. \n* **Dragon Ball: Sparking! Zero:** Rounded out the top four. \n* **Other Notable Titles:** Other games that made the top 20 best-selling list include NBA 2K25, Madden NFL 25, Call of Duty: Modern Warfare III, and EA Sports FC 25. \n\nThere's almost no crossover and more importantly the only non-Japanese made video game in the first list is Minecraft. So what he's saying should happen is already happening in Japan but it hasn't really translated to the Western world because the Switch isn't as popular as PC, Playstation, and XBox are.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NikothePom",
            "body": "He's not wrong. I buy Japanese games, because I want to play Japanese games. They have a certain flavor you can't get anywhere else. \n\nIf Iwant to play western games, I play western games, made by western devs.",
            "score": 230,
            "replies": [
                {
                    "author": "Dealric",
                    "body": "Isnt it true for most if not all of us? \n\nJapanese studios should stop trying to appeal to western audience and do what they do best, the way they want to do it. They will find a lot of audience that way. \n\nIf they try to make more western games they will lose on all fronts.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "PerfectAssistance",
                            "body": "People don't want Japanese game to ape a western one, but welcome a Japanese take on a non-Japanese thing. Like how Silent Hill is a Japanese take on American horror so it ends up feeling unique.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dealric",
                                    "body": "I think those are two different things.\n\nSilent Hill series (at least if you think 1-4) is very much japanese. It has clear inspirations of american horror, yes. But in core its very japanese horror still. \n\nIts not americanized japanese game. Its japanese games with american themes. First most of times fails, second absolutely can work.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BlooOwlBaba",
                                            "body": "Can you elaborate on the the difference between those (americanized japanese & japanese with american themes)?\n\n\nNot trying to argue, I have an idea in my head but not sure if it matches what you said. Interested in this topic as someone channeling western and eastern creativity in games",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dealric",
                                                    "body": "Hmm id say.\n\nFirst is imitating gameplay, mechanics and style of writing. Its supposed to feel and play more like western game.\n\nOther is still japanese game just with different themese and motives but through japanese style and writing.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SalsaRice",
                                                    "body": ">Can you elaborate on the the difference between those (americanized japanese & japanese with american themes)?\n\nEasy, think of it in terms of food. Taking some \"american staples\" and add some japanese flavors to them vs the opposite. You'd get very very different results.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "homer_3",
                            "body": "> Isnt it true for most if not all of us?\n\nNo? I buy a game because it looks good. Not because it's from Japan or the West or where ever.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gk99",
                    "body": "I do feel like he's wrong, in the sense that it comes down to cultural \"taste.\" Recently, I've been playing games from Canada, China, Korea, and Belgium. I'm not playing those games because they're some unique showing of each reason's culture, I'm playing them because they're fun.\n\nThe core difference that I see is that free advertising is at an all time high while the cost of distribution is at an all time low. Gaming is the most popular it's ever been in part because it's the easiest to get into as it's ever been. So many of these foreign game franchises as far back as like 2015, I found out about from YouTube or similar and went \"I want to play that.\" The vast majority I've bought digitally, no shipping or printing necessary on the part of the developer or publisher. If a game is great in one location, it'll most likely find a sizeable audience elsewhere, too.\n\nI still see game devs censoring character designs because of \"western sensibilities\" and it's like please go look at what Nexon has gotten away with in The First Descendant and tell me with a straight face that this is a necessary practice. People's complaints with that game are about the monetization compared to its competitors and the endgame content, not that as soon as mission 1 is over the city hub is filled with so many bikinis and bodysuit wedgies that an ass lover might legitimately think they had died and gone to heaven.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PerfectAssistance",
                            "body": "It goes both ways. China, Korea and Japan all have their own sensibilities and game design has to be changed or censored for those markets. Like Japan is heavily against blood and gore so even though Resident Evil is made by Japan, the violent scenes are much tamer and different than the one for international audiences.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "noah3302",
                    "body": "Then there’s Ghost of Tsushima which Japanese critics loved",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ManonManegeDore",
                    "body": "I personally play games I enjoy and don't make sweeping generalizations of what a game will and won't entail because of the geographical information of where it was mostly developed. \n\n  \nI never think to myself, \"I'm in the mood for a western/eastern game today!\". Anyone that does is a little bit too obsessed with East vs. West conflict with regards to gaming.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Angrybagel",
            "body": "Isn't this basically what went wrong with Capcom years ago? It seemed like they wanted an imaginary Western audience and went kind of generic to get it. They're not THAT Japanese these days, but it seems like they returned to their roots.",
            "score": 83,
            "replies": [
                {
                    "author": "DarryLazakar",
                    "body": "Yes and No.\n\nWhat went wrong with Capcom in the early 2010s is putting all their chips into Western developers developing their IPs, in no small part thanks to Keiji Inafune leading that push. He had the right idea at the time when JP devs were struggling in adapting to the HD development, but as we see in retrospect, he had the wrong execution to solve the issue. It's not all bad during this era, but most can agree that games in this era are generally not as good as its predecessors, whether its DmC, Bionic Commando Reboot, Remember Me, or RE6. And this is on top on their some bizarre, downright idiotic practices like on-disc DLC (SFxTekken), or releasing an Ultimate version just months after the base game with no way to upgrade the game (looking at you MVC3)\n\nNowadays, Capcom made a hard pivot back to Japanese developed games, but you can see the Western sensibilities and appeal are still there. Ever since Monster Hunter World, their games look very Western-oriented but the DNA in their games are still very Japanese oriented. That said, what Sakurai said is not either of these approaches, but rather wanting games as it were made in the 80-90s: making the games to appeal to their domestic fanbases rather than being easily swept away to the wider audience demands.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "APRengar",
                            "body": "MonHun World and Wild are explicitly about getting the West's attention. It makes them a buttload of money but personally I prefer the games made more for the Japanese market like Generations Ultimate and Rise.\n\n\nI disagree that World is just aesthetically Western, they made a lot of changes to massively change it in tone and content as well.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "MahBoiAdvance",
                                    "body": "World's aesthetics and tone aren't that different from previous games if we exclude GU. I'd argue that broadly speaking, World is more or less what 4U would have been if it had a higher budget (graphics, cutscenes, voices, overall polish). Obviously that had the effect of appealing to western audiences which was Capcom's goal, but they didn't compromise on the gameplay or aesthetics like they did with DmC for example.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CanipaEffect",
                                            "body": "Honestly, the main change was just making sure the game released in all territories at the same time, which wasn't a given back then.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "yusuksong",
                            "body": "Capcom def still has that Japanese flavor in their games but has embraced modern quality of life features that makes things more accessible on the global scene. More PC friendly features, better online connectivity, streamlining obtuse mechanics and UI, and updating games with modern controls all helped their games reach a wider, global audience.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "megaapple",
                    "body": "From Capcom senior staff's own words, [they focused on **GLOBAL** audience, not just western.](https://www.youtube.com/watch?v=qp9UIM9KlF0)",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Dealric",
                            "body": "TBF global almost always means western in this context.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "millanstar",
                    "body": "Cant recall of any Resident evil game set in japan with an all japanese cast...",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ok_Track9498",
                            "body": "Resident Evil is one of those series that has always been made with western audiences in mind. \n\n\nIt really isn't that rare. Am pretty sure Miyamoto was explicitely told to make something that would be appealing in the west when he was developing Donkey Kong (and by extension the wider Mario franchise). Same goes for Sonic from his character design to his personality (he is notably to this day far more popular in the west than in his home country).\n\n\nThen you have stuff like Metal Gear and Kojima's open admiration for western media...",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "garnish_guy",
                            "body": "To be fair to them, in their shoes would you want to unleash the T-virus on your own cities if you could help it? Probably feels less awkward developing when your artists aren’t being instructed to reconstruct an apocalyptic version of their own city lol.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "THIRTYFIVEDOLLARS",
                            "body": "That's not the point though?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ruinersclub",
                            "body": "They mean the sensibilities, like how RE5, 6 are action games.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Royal_empress_azu",
                    "body": "No?\n\nCapcom is at its height right now literally because most their games have changed to appeal to more than just Japan. World and Wilds are by far the most western games in the series, and it isn't remotely close.\n\nTrying to appeal to the domestic market only works when you have domestic budgets and operation cost. Sakurai is saying things that sound good to small studios and uninformed redditors while working at Nintendo who largely panders to the west for all their revenue.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "vansky257",
                            "body": "Theyre not referring to MH.\n\nTheyre referring to when Capcom completely shifted the genres of their main games. Think of all of those terrible RE spinoffs and DMC reboot back during the mid 2010s.\n\nI personally love RE6, but it definitely catered heavily towars the western market. Capcom believed at the time that their horror games had to adapt to the CoD theme to survive.\n\nCapcom was already on the path to redemption when they made MH World. Nowadays, they cracked the code on appealing to a wider audience while still being faithful to their roots. Wilds story is story extremely cheesy and what you'd see in typical Japanese-esque titles.\n\nSquare Enix, on the other hand, is trying to hard with their games. They want to recuperate the large dev costs by catering to a wider audience, but its honestly failing.Even if they have the budget, if the execution is shit, you'll still get a bad product.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "fak3g0d",
                                    "body": "That wasn't Capcom catering to a western market. Capcom has been going after the western market ever since the 2D beat em up days, and RE was criticized for becoming more action-focused since RE2. RE4 was extremely well-received despite it being a total departure from the earlier entries. My point is, it wasn't emo Dante that almost sunk Capcom. They were just releasing mediocre products and mistreating their IPs.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kourkovas",
                            "body": "> Capcom is at its height right now literally because most their games have changed to appeal to more than just Japan. World and Wilds are by far the most western games in the series, and it isn't remotely close.\n\nCapcom was at it's rock bottom when they bought into Inafune's bullshit about how Japanese games were dead and future was entirely pandering to Western audiences by even hiring Western studios. \n\nBack then World and Wilds wouldn't even happen because Inafune and his ilk would strike MH down as \"weird Japanese game Westerners won't like\" and at most hire some random American dev to make a MH for American audiences.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "DarryLazakar",
                                    "body": "Except at the time he was correct on that assessment?\n\nIt was true then that Japanese games were in a bad spot both critically and financially, beaten swiftly by the western developers that dominated that decade, and it is true that JP devs had a seniority culture (and still is today) that made them really struggle in adapting to HD development. It's why in the JP eyes, the term JRPG is an insult and a slur, because it implies something of lesser quality even though nowadays it's not.\n\nAt the time, Inafune was talking some sense. The issue is that he made the wrong solution to solve the issue and its a solution that was eventually proven to be wrong as time passes, long after he made the action, left Capcom and went AA.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Kourkovas",
                                            "body": "You can't say he was correct on that assessment when part of his assessment was that they needed to lean full on Western pandering as much as possible.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "DarryLazakar",
                                                    "body": "I never said he was correct in his assessment, just that at the time he said so, he was making sense to a lot of people at the time where Western developers were thriving.\n\nRegardless, he was the one that lean the direction that Capcom still to this day stuck around, with or without Western developers. The ethos is still there in terms of aesthetics and design since World, but thanks to experience, they rarely fell to the same pitfalls they usually do at the early 2010s.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Kourkovas",
                                                            "body": "> I never said he was correct in his assessment\n\nBut again, at the time he wasn't correct either, since part of his assessment was that Japanese publishers needed to lean on Western audiences as much as possible.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "meikyoushisui",
                            "body": ">World and Wilds are by far the most western games in the series, and it isn't remotely close.\n\nWhat about these games makes them \"western\"? Large budgets?",
                            "score": -3,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Rayuzx",
                                    "body": "IMO, Resident Evil always seemed to be more focused on emulating western horror over Japanese horror. Especially considering how often the franchise stays in America or Europe.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Equivalent_Trash_277",
            "body": "I completely agree. The western audience that enjoys Japanese games likely enjoys them because of their Japanese influence on style and/or game design. Making Japanese games to appeal to Western style/design is literally the opposite of what I, and I imagine many other people want.",
            "score": 22,
            "replies": [
                {
                    "author": "TechieBrew",
                    "body": "Resident Evil",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CertainDerision_33",
            "body": "This is just good sense. International fans were attracted to Japanese games because they were Japanese games. ",
            "score": 20,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -6,
                    "replies": [
                        {
                            "author": "BusBoatBuey",
                            "body": "Are you telling me a non-Japanese developer would turn a crime gang leader into a retro pirate in modern Hawaii?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BikingThroughCanada",
                                    "body": "If the Saints Row series hadn't killed itself, then maybe.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Supreme42",
                            "body": "Your analysis is shallow.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TechieBrew",
                    "body": "Resident Evil",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dishonoredbr",
            "body": "I think what they need to learn some of good quality of life changes that came from Western studio , but still hold to their own uniqueness as a culture. \n\nI don't want them to mimick Western or try to appeal to us, but please make some good UI and ports your games for more platforms.",
            "score": 11,
            "replies": [
                {
                    "author": "Psychic_Hobo",
                    "body": "True. There's something to be said for deliberately not holding the player's hand too much, but you do also need to recognise that some things are just archaic.\n\nSouls games are great for encouraging the player to be able to do their own thing and learn in their own way, and are especially great for a clean HUD - but they definitely had to evolve through multiple elements of jank to get to the accessibility of Elden Ring.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Streetperson12345",
            "body": "Devil may cry and DMC is the biggest example of this.\n\nAlthough DMC was a good game, it's not what people wanted from Devil may cry.",
            "score": 6,
            "replies": [
                {
                    "author": "Coolman_Rosso",
                    "body": "I didn't hate DMC, but the definitive edition is the only way to enjoy it due to the gameplay tweaks and technical improvements \n\nI would argue Yaiba: Ninja Gaiden Z is a better example, as the game was a complete mess",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vexamas",
            "body": "I think I agree with Sakurai here, but I'll provide a bit of pushback because a lot of the comments in this thread are to the effect of:\n\n>**\"Yeah! I want more Japanese flavor in my games, and not catering to the west!\"** \n\nLet's take a step back and remember that Sakurai is mentioning this as the director of Super Smash Bros. \n\nIn 2008, one of the infamous decisions (within the **western** audience) of Super Smash Bros. Brawl was the addition of the 'Trip' mechanic. \n\n**This was specifically added because the Japanese audience treated and wanted Super Smash Bros as a party game, not a competitive game.**\n-\n\nUltimately (no pun intended) the west **did** influence Sakurai by proxy because the west treated the game as an esport and that scene permeated into Japan, **NOT** the other way around, which pushed Sakurai to incorporate that demographic into their design decisions. \n\nHad Sakurai continued the path of treating Super Smash Bros as a party game exclusively and continued to add features that detracted from the casual play in lieu of Japan-esque humor gaffs such as tripping randomly, I promise the game wouldn't have been as popular and this article's comments would be met with \"Yeah, look how good that worked out for Super Smash Bros... everyone only plays your first version...\"\n\nAll that to say, it's easy for the casual /r/games user to circlejerk into agreeing with any director that deem 'good' without really thinking through the implications or if that opinion is truly based in objectivity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GaijinFoot",
            "body": "Agreed. In fact I think we will look at the end of the ps3 and ps3 era as the dark days of Japanese game devs. Major studios making grey and beige cover shooters, focusing on Polish over gameplay loops, just so soulless. By the end of the ps3 you'd think Sega and capcom were done for. Outside of a few IP keeping the banks rolling it was bleak. Compare to Sega and capcom now making hit after hit, it's really something.",
            "score": 6,
            "replies": [
                {
                    "author": "yusuksong",
                    "body": "Now if Square can start getting more consistent with their output and Konami make a comeback we can have another golden age of Japanese games.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GaijinFoot",
                            "body": "I knew a guy who worked at square on ff15. It was so fragmented and broken. They'd use a different engine per game and had very little shared resources between the development teams. Sounds like a mess. I feel like From Soft ushered in a strong wave of Japanese creativity though.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ned_poreyra",
            "body": "If developers from every country/region focused on their country/region, we would have the most diverse industry.",
            "score": 24,
            "replies": [
                {
                    "author": "BlooOwlBaba",
                    "body": "We most likely do now though. There are thousands of games released a year (of varying quality of course) from people inspired by their own culture and/or others.\n\n\nI don't understand how what you imagine is more diverse than what we have now.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheNinjaTurkey",
            "body": "Well, yeah. That's what makes Japanese games so unique when compared to western games. They have their own vibe.",
            "score": 11,
            "replies": [
                {
                    "author": "BusBoatBuey",
                    "body": "Except US localizations will ruin the vibe anyway without the developer's input. Kirby is a relevant example of being made angry for no reason.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TomAto314",
                            "body": "That's just the box art and they stopped doing that like a decade back. But it's still kinda funny they did.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BusBoatBuey",
                                    "body": "They still do it with other games. JP/EU titles will have art covers while NA will have 3D renders with some generic color scheme.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HappierShibe",
            "body": "This is how it should always work.  \nThe studio should produce the game the artist wants to produce.   \nThe localizers should do their best to present the creators vision as intended to as many people as possible.     \nThe publisher should provide the organizational and financial support they need to make that possible, and work with distributors to get the product to the widest audience possible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iTzGiR",
            "body": "I’ll go against the grain of everyone here, and say devs should probably just focus on what they want to make. \n\nSilent hill is one of my favorite franchises, and a huge reason of that is because how unique it feels, with a huge reason of that being it was a japanese made game, that was their interpretation of american horror, at least for the first four games (which imo are the ones that actually feel special/unique). I really don’t think games like silent hill 1-4 would have ever existed under different context, or if they only focused on what domestic interests would be. \n\nSame thing goes for the first few resident evil games, seeing Japanese people make the most over the top, americanized zombie game, was a huge part of the original charm.",
            "score": 32,
            "replies": [
                {
                    "author": "piepei",
                    "body": "I mean, without the clickbait that’s literally what Sakurai said…\n\n> In other words, I think the ideal is to make the games the way you like them, and the people who can accept them will enjoy them",
                    "score": 55,
                    "replies": []
                },
                {
                    "author": "Jimmy_Space1",
                    "body": ">I’ll go against the grain of everyone here, and say devs should probably just focus on what they want to make.\n\nIs that against the grain? That's exactly what Sakurai is talking about, and seems most everyone agrees\n\n> “In other words, *I think the ideal is to make the games the way you like them*, and the people who can accept them will enjoy them.”",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "197639495050",
                    "body": "This sounds like it’s going with the grain. Sakurai didn’t say it specifically needed to be related to Japanese things. Just that people wanted to see the Japanese take on things, in SH’s instance American shows like Twin Peaks, horror and generally enigmatic media",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Psychic_Hobo",
                            "body": "Eh, there is that general vibe in the comments though. A mild strain of the Japanophile for sure, particularly in relation to any discussion on Square Enix (whose main problems I'd argue were just general mismanagement in a variety of areas)",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RedShibaCat",
                    "body": "You gotta read the article man not just the headline.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Raidoton",
            "body": "Devs should make whatever they want. Western audiences get influenced by japanese media and japanese audiences by western media. They should just create what they like.",
            "score": 14,
            "replies": [
                {
                    "author": "meikyoushisui",
                    "body": "That's what he's actually saying if you read the article:\n\n>In other words, I think the ideal is to make the games the way you like them, and the people who can accept them will enjoy them.",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "BuckSleezy",
            "body": "Yes. If I want a western game I’ll buy a western game from a western developer.\n\nCultural and national flavors being so readily available is one of the best parts of gaming. No other entertainment industry can match the global availability of products. KCD2 and Monster Hunter and Avowed all coming out so close to each other from developers and minds all over the world is literally magic.",
            "score": 4,
            "replies": []
        },
        {
            "author": "YukYukas",
            "body": "Not wrong tbh, kinda did worked out well for Monster Hunter. One of their criticisms in World was for their ass weapon designs, which apparently happened because they wanted to appeal to the Western audience. That didn't bode well, so they went back to the usual come RiseBreak/Wilds.",
            "score": 7,
            "replies": [
                {
                    "author": "hutre",
                    "body": "Worlds became popular *because* it was westernised, so I don't think that necessarily is true. It was incredibly niche back during what I would say was the peak MH experience (3DS era)",
                    "score": 9,
                    "replies": [
                        {
                            "author": "YukYukas",
                            "body": "I wouldn't say it got popular because it was westernized. The fans already wanted the series to go to bigger consoles way back. That, plus the word of mouth on the quality of the series along with goodwill, pretty much solidified the game's rise to mainstream. \n\nNot to mention that nothing really is like MH. There were lots of competitors before, but they didn't make it. The ones who did could never compare, sadly. (MH NEEDS COMPETITION OTHERWISE CAPCOM IS GONNA GET COMPLACENT)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ReverieMetherlence",
                            "body": ">Worlds became popular because it was westernised\n\nIt became popular simply because it was the first Monster Hunter released on PC.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CipherZer0",
                    "body": "Wilds sets are actually worse than World. RiseBreak's were good",
                    "score": -13,
                    "replies": [
                        {
                            "author": "RareBk",
                            "body": "...They're objectively not. Most of the weapon designs in World were the same weapon just with a part of a monster slapped on, they were *awful.*",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "YukYukas",
                            "body": "Design-wise? Absolutely not. World weapon designs were just template + shit skin for the most part. Only alleviated in Iceborne by just a little bit.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "CipherZer0",
                                    "body": "Oh you said weapons, I missed it. I thought it was gear set designs",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "YukYukas",
                                            "body": "Gear set designs, World's definitely better lol. \n\nWilds' version of gear sets where you can interchange between male and female sets as opposed to the usual alpha and beta sets just scream rushed development lmao.\n\nNo doubt they'll add the actual beta designs come expansion, which is a long ass time away from now",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TechieBrew",
            "body": "I haven't seen so many gamers miss the point so hard and then go out of their way to agree with the headline. \n\nA lot of y'all have no idea how successful Japanese games without a Japanese focus are. Stop cherry picking y'all are ridiculous",
            "score": 1,
            "replies": []
        },
        {
            "author": "Benhurso",
            "body": "Video games took the world by storm exactly because they were crazy (to us) japanese products. Westernization of gaming just led the industry towards live service, dlc, micro transactions and other overly capitalist practices.\n\n  \nSo yeah, not trying to appeal to westerns is a good way to appeal to westerns, unironically.",
            "score": 1,
            "replies": []
        },
        {
            "author": "197639495050",
            "body": "Japanese devs are mostly over it but there are changes at the foundational level that I don’t think we’ll ever see a complete and total revert back to before major Japanese companies’ attempts at trying to appease a western audience first and foremost. \n\nFanservice and raunchiness in general is definitely one aspect that’s been tamed down to a substantial degree. Boob slider in Xenoblade Chronicles X being gone, TMS basing the remaster off the censored western release, Dead Rising Deluxe Remaster removing the Erotica category. There’s a lot more examples where they’re still trying to appease western sensibilities and are starting to get outdone by Korean and Chinese devs",
            "score": 8,
            "replies": [
                {
                    "author": "IceFire2050",
                    "body": "I'll never say no to a boob and an ass slider in a character builder.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "j_one_k",
            "body": "I think you have to draw a line between catering to the tastes of the US (and other non-Japanese) audience and considering technical features important to those audiences.\n\n\nJapanese games used to be infamous for poor PC ports because of the (then) small PC user base in Japan. Japanese games lagged US games in implementing high-quality netcode, because it wasn't as important inside Japan. \n\n\nThis line sounds obvious, but I don't think it's so easy for a development studio to really maintain a focus on international technical needs and domestic tastes at the same time. Studio management isn't strictly divided between the creative and technical sides. Staying on top of the best technical innovations requires studying games from other countries, but I think it's natural to also pick up some creative ideas when you do that. And not every feature is obviously on one side of the technical/creative divide. ",
            "score": 4,
            "replies": [
                {
                    "author": "IceFire2050",
                    "body": "The netcode thing is largely due to Japan having an old hat problem. It's still an ongoing issue but seems to be getting better as more examples of \"X makes money\" pile up.\n\nBasically it's a country run by old men who refuse to listen to the younger generations with more current knowledge, and a younger generation that doesn't (publicly) criticize their superiors and their elders because that's just not something you do.\n\nSo you end up with a nation of businesses run off of fax machines and ancient pcs because why would they update? Not because there's a security concern or some company critical piece of software that is incompatible with newer machines, but just because they used these back in the boss's prime days and they worked fine, so why wouldn't they be fine now?\n\nSo when a company like Sony creates an incredibly shitty netcode for the PS3 that is obliterated by Microsoft's, why would they bother to update. The big head at the top says it's good enough and you filthy unwashed gamer shouldn't dare to question that decision.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MadeByTango",
            "body": "You’re about to get a big taste of that strategy with Silent Hill F; let’s see how it works out for Konami",
            "score": 2,
            "replies": [
                {
                    "author": "adrianmarshall167",
                    "body": "It's the game I've been hoping for since Silent Hill 4 embraced that Japanese horror flavor, so I'll be supporting it every way I can.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RUNPROGRAMSENTIONAUT",
            "body": "They absolutely should. \n\nI feel like newer Yakuza/Like a Dragon game lost some of its charm because of it. Early games were made and then localized. These days the development and localization go hand in hand and I feel like it influence the games overall too much.",
            "score": 3,
            "replies": [
                {
                    "author": "HerrHypocrite",
                    "body": "Sorry dude, hard disagree on this. I’m far into Like a Dragon: Infinite Wealth, and the changes feel like a breath of fresh air. It’s amazing how the games are changing with the times (from Yakuza 1 when the Yakuza were a real influential social force, to now when Yakuza are being rejected with the anti-organized crime laws in Japan), and with the inclusion of Hawaii it is perfect to bring in the Western side to help design that part of the game too. And of course, the Japanese flavor is still there in Ijincho as a good contrast.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "sw1ftkill",
                            "body": "But the Hawaii setting doesn't even compare to the Japanese locations. RGG is best at their game when making a Japanese crime drama set in Japan, it's why most Yakuza fans favorite is Yakuza 0. I also remember recently reading an article where Yokoyama talked about making newer games with the western audiences in mind, which is exactly not the reason people like Yakuza in the first place.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CanipaEffect",
                                    "body": "I think you're getting a bit mixed up there. He said that they keep in touch with the localization team regarding the script throughout the process and keep the doors open to feedback. This process has been the case ever since Yakuza 0. https://automaton-media.com/en/news/20230201-26517/",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "197639495050",
                    "body": "They have become a bit of a caricature of themselves at this point",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Avenge21",
            "body": "Does the specter of keiji inafune still hang over japanese game devs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "this + the industry should start recognizing that Western tastes are a lot less of a monolith than they've been treated as for a long time -- or at least that they have evolved",
            "score": 1,
            "replies": []
        },
        {
            "author": "Asad_Farooqui",
            "body": "I mean isn’t that what Konami is doing with that new Silent Hill game?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hilarial",
            "body": "He's right, feel like Japanese games have just flattened in personality a little as they've chased global sales to maintain investor hype.",
            "score": 1,
            "replies": []
        },
        {
            "author": "metallee98",
            "body": "Makes sense. People already want what they are making. Why make something similar to stuff we already have?",
            "score": 1,
            "replies": []
        },
        {
            "author": "awkwardbirb",
            "body": "I disagree. They should focus on what *they* want to make. If a JP dev wants to make a game that appeals to a global audience, I say let them. If they want to appeal to just Japan, that's fine too. Definitely seen quite a few JP devs that have been pretty happy to be able to connect with an international audience with their games. It's really nice to see they enjoy Western games as well on the reverse end.",
            "score": 1,
            "replies": []
        },
        {
            "author": "localfeller",
            "body": "I think they either mix both audiences or make two games, one western, one domestic, and sell them to both audiences.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Individual_Good4691",
            "body": "Didn't read the article, but I wholeheartedly agree with the headline! As a lifelong weeaboo I want Japanese games and not just games made in Japan. Every time they try to cater to an American audience (that's what they mean by western), the games suck, because not only do they no longer have that quirky charme, but they also don't know anything about other places.\n\n\nErr...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adrian_Alucard",
            "body": "Yes please. I've never been a fan of western videogames. (with very few exceptions) and it sucks when a japanese developer makes a \"westernized\" game",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kurovi_dev",
            "body": "Developers should make the games they want to make. It’s as simple as that.\n\nIn this order:\n\n1) make the games you want to make\n2) make good games\n3) make games that appeal to enough people to be successful",
            "score": 1,
            "replies": []
        },
        {
            "author": "Morticide",
            "body": "Smash brothers ultimate has some of the worst online I've ever played. Like honestly, so bad. \n\nSo while I agree with him, I think \"online\" should be included in things Japanese devs could do better as well. I'm sure good online would cater to domestic tastes as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "headphones_J",
            "body": "Is there an example of them ever focusing on Western tastes?",
            "score": 2,
            "replies": [
                {
                    "author": "TheFergPunk",
                    "body": "Capcom had a very bad reputation for this back in the 360/PS3 era.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "CKT_Ken",
                    "body": "Here’s the new interview with the Silent Hill F director, new writer (Ryukishi07), and Akira Yamaoka.\n\nhttps://youtu.be/0pPKJevpvZI?si=7IyG3DWZw_mkF8BS\n\nThe director outright says exactly what fans had been repeating: the newer Silent Hill entries were westernized and not Japanese horror, which is exactly what people liked about the older ones. The fact that the director admitted this probably means that there was indeed an internal attempt to make the series more Western, and it failed.\n\nThere’s also been online drama over altering aspects of games to “appeal to a broader audience” and such but at the end of the day directors are just realizing that there’s actually a high demand for Japanese stuff. It’s probably a holdover from the days when Kirby had to be given angry eyebrows to keep the cover art from being too cute or whatever.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "yukiaddiction",
                            "body": "Using Silent Hill is kinda weird though.\n\nNot all Western made Silent Hills are bad like I like Shattered Memories a lot.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "headphones_J",
                            "body": "Not to be obtuse or argumentative, but I'm not seeing the Westernization here. It's literally Japanese kids, in a Japanese village, getting chased around by Japanese style ghosts. The original Silent Hill is way more Westernized than this IMO.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "TrashStack",
                                    "body": "In the video they're referring to titles like Silent Homecoming and Downpour. Which were made by Western studios.\n\nThey are saying that Silent Hill f is being made to be extremely Japanese as a response to those titles so the series can go back to it's J Horror roots",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "CKT_Ken",
                                    "body": "They’re not talking about the upcoming **Silent Hill F** being western, the issue is the most recent Silent Hill games that aren’t F (not counting the recent remake ofc). It’s a really common complaint among fans that the first 2-3 games were extremely unique, and lost that as the series went on. And based on what the director said, it looks like it was part of an intentional move to appeal to overseas players. The idea behind Silent Hill F is to test if the core of Silent Hill’s horror is indeed the Japanese horror perspective by using a more familiar setting.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "King_Artis",
                    "body": "Been state that Resident evil 5 and especially 6 they took more of a focus on action trying to appeal to the shooter (more specifically cod) players.\n\nBelieve that's why DmC also did a sort of soft reboot with an edgier looking Dante that was meant to appeal more to the west.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "tairar",
                    "body": "Maybe the infamous flop that was the entire metal gear series\n\nOr those obscure platformers about an Italian plumber\n\nEdit: the only actual example I can think of would be Nier on the 360, which used the old man dad protagonist instead of the pretty twink brother, but like .. I don't think anyone could look at the entire rest of the game and claim it was anything but japanese\n\nDouble edit: and if I remember correctly the dad was the original protagonist, and was changed on the PS3 to make it more appealing to the japanese audience",
                    "score": 4,
                    "replies": [
                        {
                            "author": "JusticeOfKarma",
                            "body": "There's a difference between 'trying to develop for another culture's tastes' vs. 'taking inspiration from and utilizing other culture in your work'. \n\nSome of the most fascinating games come from a fusion spurred on by the latter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tairar",
                                    "body": "To be clear I was being very sarcastic with the metal gear bit, I definitely agree with you re: the fusion",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Geoff_with_a_J",
                    "body": "Twilight Princess and Breath of the Wild",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ThassahUffyn",
                    "body": "Metaphor refantazio. The writers trying to center around the racism theme in a multicultural society without life experience on it resulted in a mediocre and non-impactful story.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Coolman_Rosso",
                            "body": "I respected what they tried to tackle with that message, but the execution was so bad. \n\n>!Especially the reveal that our reality was the real reality, and explicitly using Shinjuku as the backdrop example of a world without conflict due to racial prejudices!<",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "scytheavatar",
                    "body": "Naoki Yoshida said that FFXVI was designed specifically to appeal to the kids that grew up playing COD and GTA.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Geoff_with_a_J",
                            "body": "FFXV was aimed at western audience too",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ReverieMetherlence",
                    "body": "Street Fighter 6 is as americanized as possible; last Final Fantasy games (15 and 16) were designed for western auditory; all these censored remasters (Dragon Quest, Dead Rising, new Xenoblade) also aimed at more western tastes",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "King_Artis",
            "body": "I'd agree\n\nI get the idea of wanting to be appealing to as wide an audience as possible... but I also think that limits creativity because now you're trying to make something for everyone over something for a more specific group. \n\nI've been playing Japanese games basically since I started gaming, and have always had a deep love for them because they're always willing to just try something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Davemusprime",
            "body": "He's absolutely right. That's the problem with entertainment today in general: by trying to include everything in a megagame you alienate everyone that wanted a clean gaming experience.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShogunDreams",
            "body": "He is absolutely right. I have been supporting Japanese games for about 25 years.  I keep buying their JRPG's, horror, puzzles, and adventure games because I love it when they infuse their culture into it. Their games have a certain personality that Western developers won't do. A good example is Yakuza. \n\n\nTheir blend of seriousness and unique humor is why I buy them day one.  Also, the majority of my top ten favorite games are Japanese made.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Explosion2",
            "body": "I can't say I disagree. I'm not much of a weeb but the Japanese things I like are *very* Japanese. Dan Da Dan was so much fun to watch because of all the Japanese folklore and pop culture references that I basically had to look up after every episode. I never felt like I was being catered to, just that it it's a good show that knows what it wants to be.\n\nPersona is the same way. Atlus has said the popularity of 5 has always surprised them because they made an unabashedly Japanese-centric story but I think it works on a worldwide level because it shows that our struggles and lives aren't that different even an ocean or a continent away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sloppymoves",
            "body": "I don't know. Japanese developers really love a lot of menial and somewhat grindy gameplay elements for the majority of their development history. They like to bloat their games in ways that are typically unappealing.\n\nI feel like tighter more concise story telling, especially in the JRPG world, would be so much better. If that is a “Westernized” concept, then I think they should learn it. I loved Metaphor: Refantazio, and it is probably my favorite game of past year. But 90 hours and the actual amount of interesting and story defining content is most likely like 20-30 at most.\n\nEven some of the heralded best Japanese Development style games from the likes of Nintendo even have their issues with lack of meaningful content wrapped up with system bloat and artificial time sinks.\n\nI am all for great and original Japanese fueled games, but all developers should really learn from what is happening around the globe as far as game development goes. It isn't great to be in your bubble world.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheTrueAlCapwn",
            "body": "Nah how about you fix the netcode in smash. Yeah it probably works fine in Japan but everywhere else its trash.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rockface5",
            "body": "If I want a first person game, I look at western studios. If I want a third person game, lots of the best ones are Japanese. That’s very much simplifying it, but it’s kinda true.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nongtles",
            "body": "This is the same problem with Anime too\n\nI don't understand that why some people including dev and animation studio why people love these thing when it is just simple reason that it is 'japanese' and that's japaneseness is why people love it to begin with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Troop7",
            "body": "That SquareEnix Rebirth director literally just said the opposite of this like a month ago lmao. No wonder Square have been struggling",
            "score": 1,
            "replies": [
                {
                    "author": "echoblade",
                    "body": "Square has been struggling for other reasons lol. Who they want to market to is not the reason they keep walking into a brick wall and wonder why it hurts.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Marcos1598",
            "body": "He's right, look at Square Enix and mainline FF, every entry from XIII onwards has tried and failed to catter to western tastes, XIII devs were even dissapointed the localization team picked a song by Leona Lewis instead of making an original one for the ending. XV and XVI were also critiziced for abandoning the \"J\" in JRPG, not helped by Yoshida saying he hated the label.",
            "score": -6,
            "replies": [
                {
                    "author": "MadeByTango",
                    "body": "They’re misreading the feedback they have received; it isn’t about FF failing to appeal to the west, it’s about them changing the *gameplay* from what made the video *games*  successful in the first place. You go from a turn based product to an action based product and you lose customers. No one goes to Burger King for high grade sushi.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "sw1ftkill",
                            "body": "The director of FFXVI said he made the game more catered towards the younger gamers who grew up playing shooters, and that group is mostly westeners so yes it's also them changing the game for western audiences.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Caliber70",
            "body": "Yes please, we got good stuff like stellar blade and Wukong from other east Asian studios.  Leave the western world to rot in mediocrity.",
            "score": -10,
            "replies": [
                {
                    "author": "starstreak0",
                    "body": "Wukong is pretty mediocre just pretty.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "framesh1ft",
            "body": "True because western games are largely dogshit, and western people have terrible taste. It’s like Steve Jobs said, people don’t know what they want until they have it. That’s being an actual visionary, not pandering to crappy slop standards of the west in hope for a hit",
            "score": -4,
            "replies": []
        },
        {
            "author": "DropApprehensive3079",
            "body": "What western takes do they make? All the characters they make are embellish generic White looking.",
            "score": -8,
            "replies": []
        },
        {
            "author": "Anthr30YearOldBoomer",
            "body": "He's right. I avoid Japanese games because they are unique and tuned specifically towards an audience that has no taste. I think it's important to keep those without taste starved of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperVaderMinion",
            "body": "This is super reasonable and I agree until I run into a datable character who looks like she's ten but is \"actually 400 years old\"",
            "score": -7,
            "replies": [
                {
                    "author": "UrawaHanakoIsMyWaifu",
                    "body": "Not every game needs to be for you 👍",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GunplaGoobster",
            "body": "\"Man wants companies to cater after his tastes, not others\" more news at 11.\n\nUntil the profit incentive is removed entirely you can bet that companies are going to develop games for the largest possible market.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IceFire2050",
            "body": "I agree... somewhat. But when you have a concept with global appeal, injecting a specific culture in to it for no reason other than \"domestic appeal\", is not the best idea.\n\nThe best example I can think of is Pokemon Conquest. Which is actually a really good game and very highly rated, but is absolutely soaked in japanese culture. Despite its high rating and high quality only sold around 1 million copies globally. Pokemon Ranger, widely panned for its poor gameplay and writing, but with a more generic setting to its design, nearly doubled its sales.\n\nTo say nothing of Pokemon Black and White which combined sold more than 2 million on their first day and over 11 million copies total.\n\nIt just comes down to where you want your game to sell. If you want global appeal, then sell to a western audience. Asian Culture is still largely alien to the western world.",
            "score": -1,
            "replies": []
        },
        {
            "author": "TypographySnob",
            "body": "I kind of hate to admit this, but as one of my favourite game franchises, I wish Tekken was more Westernized. Or at least had a Western analog. It's become more and more anime to the point where it feels like less of a mechanically deep martial arts game, and more like Dragon Ball Z. I see this as Bandai Namco choosing to not cater to Western tastes, and I can respect that. But the game is so corny and weird now. It's almost embarrassing to play.",
            "score": 1,
            "replies": []
        }
    ]
}