{
    "title": "Croc Legend of the Gobbos coming April 2nd!",
    "author": "ImAnthlon",
    "subreddit": "Games",
    "rank": 7,
    "score": 129,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.youtube.com/watch?v=bTbQv0NENaA",
    "id": "1jea3lt",
    "selftext": "",
    "comments": [
        {
            "author": "Dr_Popodopolus",
            "body": "Day One Purchase, no hesitation! KERSPLAT!",
            "score": 1,
            "replies": [
                {
                    "author": "Fish-E",
                    "body": "It's a shame it's not coming to Steam, but yeah, day 1 buy for me regardless. It's going to be a good hit of nostalgia.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ImAnthlon",
                            "body": "I'm more than happy to support GOG in this, the store with the best mission statement",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lifeonbroadway",
            "body": "This just unlocked some memories. God that crocs face is so familiar.",
            "score": 1,
            "replies": [
                {
                    "author": "ThatBoyAiintRight",
                    "body": "The box art was simple, but it did stand out on the Blockbuster shelf you know? Even if you haven't played it, you've seen that box art and it made you at least curious about it.\n\n\nI think it stood out mostly because PS1 games art at that time weren't so greens, blues, bright colors like N64 games. Also the fact the case for a disc was much smaller than an N64 box. So the simplicity cut through the generally busy art of its contemporaries.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pavemnt",
            "body": "I’ll probably pick this up, played it a lot as a kid",
            "score": 1,
            "replies": []
        },
        {
            "author": "BIGTIMEMEATBALLBOY",
            "body": "i JUST bought a ps1 copy of this. great game",
            "score": 1,
            "replies": []
        },
        {
            "author": "wizzyULTIMATEbreed",
            "body": "Once this is out, the waiting game begins for an I-Ninja remaster! At long last, my chance to replay one of my favorite platformers and 100% it will happen...",
            "score": 1,
            "replies": []
        },
        {
            "author": "EmeraldOil",
            "body": "Fingers crossed for a physical release. Have some memories of Croc from when I was very young, I'd love to return to it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RosaReilly",
            "body": "The title of this game is probably my dad's favourite name of any piece of media. He never even played it but he brings it up to this day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Green_Filter",
            "body": "This has unlocked some buried memories aha. I think I’ll indulge my nostalgia a little and pick it up",
            "score": 1,
            "replies": []
        },
        {
            "author": "SyrioForel",
            "body": "Did they fix the horrible camera system and the laggy controls?\n\nI own the original game, I have played it extensively as a kid, but it was always little more than a poor man’s version of Mario 64. Still to this day the worst $50 I ever spent.\n\nCroc is the definition of, “We have Mario 64 at home.”\n\nIf you want to see what an actually good Mario-like game is from that era, then check out Banjo-Kazooie instead.",
            "score": 1,
            "replies": [
                {
                    "author": "Lights-Camera-Axshen",
                    "body": "I mean, the trailer literally says “smooth modern controls”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OllyOllyOxenBitch",
                    "body": "Did you watch the trailer, or did you just come here to vent? Your first question would've been as easily answered.\n\nAlso, it is a bit funny seeing Croc roasted as \"we have Mario 64 at home\" when the original prototype for it (*when Yoshi was the planned character*) was what led Miyamoto and company to create Super Mario 64 in the first place.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IAmBLD",
                            "body": "That last claim is dubious at best - iirc, the source is pretty much the guy who made Croc, and his source was \"Trust me bro\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}