{
    "title": "Well, this should be interesting if it makes it to the SCOTUS",
    "author": "BrooklynRedLeg",
    "subreddit": "Anarcho_Capitalism",
    "rank": 385,
    "score": 6,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 83,
    "url": "https://storage.courtlistener.com/recap/gov.uscourts.rid.58912/gov.uscourts.rid.58912.96.0_2.pdf",
    "id": "1ime9qj",
    "selftext": "",
    "comments": [
        {
            "author": "30_characters",
            "body": "District Court judges have been increasingly willing to claim authority to bind the president. SCOTUS has already signaled disagreement with this, and will not let this stand much longer.\n\n\n\nIn Hawaii v. Trump (aka the Travel Ban case that media called the \"Muslim Ban\"), in a concurring opinion,  Justice Thomas wrote:\n\n\n> In sum, universal injunctions are legally and historically dubious. If federal courts continue to issue them, this Court is dutybound to adjudicate their authority to do so.\n\n\n\n\nhttps://supreme.justia.com/cases/federal/us/585/17-965/",
            "score": 9,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "It will be hilarious to watch the meltdown from the Left when the SCOTUS does knock the lower court in the head over this....",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Acceptable-Take20",
            "body": "His daughter also “works” for the Dept. of Education.\n\n“Daddy, orange man bad. I’m moving back home with you.” - Daughter\n\n“Fuck that shit” - Judge",
            "score": 7,
            "replies": [
                {
                    "author": "Wishpicker",
                    "body": "“Fuck that shit” sounds more like one of those three word slogans that team orange farts out every once in a while.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hblok",
            "body": "All this popcorn is not good for my diet!",
            "score": 12,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "Be sure to floss!",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Intelligent-End7336",
                    "body": "Kettlecorn is best corn",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "BrooklynRedLeg",
            "body": "https://preview.redd.it/u3fyn2vk2die1.jpeg?width=900&format=pjpg&auto=webp&s=4e70c3145e80037020686c181ddce705f1227f4d\n\nFor the TL;DR",
            "score": 13,
            "replies": [
                {
                    "author": "denzien",
                    "body": "Is that a federal judge?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BrooklynRedLeg",
                            "body": "Yep. One of the 'Lifetime Appointments' that need to be impeached and removed office for Judicial Overreach. I hope the SCOTUS smacks this f'cker across the snout for this.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Will-Forget-Password",
            "body": "What is Trumps argument?",
            "score": 2,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "Probably that this is judicial overreach....",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Will-Forget-Password",
                            "body": "Sorry, I meant what is Trumps argument for pausing the already approved funding?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SirBiggusDikkus",
                                    "body": "Seems like, in addition to other comments, just because funding is approved, doesn’t mean the executive hands it out willy nilly. Especially if the exact recipients aren’t specified (which seems likely since Congress uses a lot of executive branch shall…nebulous language).",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "A large group of states got together to sue Trump, and named specific department secretaries -- the implication is that specific statutory programs issuing funds to *states* are being blocked by Trump.  Why else would they have standing to sue?  If that's the case, then the specific recipients are clearly defined, and this TRO isn't universal in scope.\n\nThis needs more context and analysis to make sense of.  We're seeing one snippet of an ongoing legal proceeding without any of the prior activity.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Will-Forget-Password",
                                            "body": "Which law supports that argument?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SirBiggusDikkus",
                                                    "body": "Which specific law doesn’t?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Will-Forget-Password",
                                                            "body": ">he shall take Care that the Laws be faithfully executed",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "GoogleFiDelio",
                                                                    "body": "Which law says we have to pay for trans surgeries in Guatamala?",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Will-Forget-Password",
                                                                            "body": "The law that congress passed and the president signed.",
                                                                            "score": -4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SirBiggusDikkus",
                                                                                    "body": "Again, does the law specifically say that? Or, like usual with Congress, does it say something very broad like build relations in Central America?",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Will-Forget-Password",
                                                                                            "body": "Do not ask me. Go directly to the source.\n\n>“Federal agencies cannot pause, freeze, impede, block, cancel, or terminate any awards or obligations on the basis of the OMB Memo, or on the basis of the President’s recently issued Executive Orders.”\n\nNotice \"any\" awards or obligations. This judge is saying Trump does not have the authority to freeze payments by executive order. Congress is irrelevant.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Acceptable-Take20",
                                                                                                    "body": "Oh, you or something in block quotes. Seems legit!",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "BrooklynRedLeg",
                                                                                                    "body": "I'm waiting for this to be struck down because that is Congress interfering in the Executive Branch's domain.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Will-Forget-Password",
                                                                                                            "body": "I got the opposite. This is Trump interferring with congress. Congress passed the budget. Biden approved. Trump is trying to alter the legal budget.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "BrooklynRedLeg",
                                                                                                                    "body": "I'd bet dollars to donuts this isn't specified in the budget. Congress is supposed to Earmark everything. Too long they've sat on their ass and just tossed money to bureaucrats. Maybe I'm wrong. Hopefully we'll see soon. I'm praying Trump is not a retard who will defy the courts and will let the SCOTUS decide this (cause it involves unchallenged statutes on the books).",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                            "body": "Trump is already defying the courts. He is not following the restraining order.\n\nI think Trumps problem is he went too wide. If he would have specifically targeted \"unspecified funding\", it would be a lot harder for the States to sue. Instead, Trump broadly froze all funding. (I am not a lawyer.)",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "BrooklynRedLeg",
                                                                                                                                    "body": "I'm half wondering if he wanted a showdown to force the Democrats into a corner. Trump isn't dumb. He's an egomaniac and a blowhard, but part of that is an act. Plus, after the shellacking he took for the last 8 years from the Establishment, I'd half expect him to hold a LOT of resentment and (hopefully) being advised to play it strategically. Democrats have shown, time and again, to be inveterate asswipes who cannot leave well enough alone. I warned my Lefty friends that if they kept pushing the Abortion at Any Time no matter Viability, it would bite them in the ass. And it did. \n\n  \nFor all his faults (and he has A LOT, on top of being a scumbag in general) shithead Mitch McConnell warned a bunch of them back when he was the Junior Senator that the Republicans would eat the Dems lunch for what they did to Bork back in the 80s (no thanks to drunkard fucktard Ted Kennedy and kid-sniffer Joe Biden). Trump gave that to them and his changing the court has upended a lot of previously accepted stuff. Revenge is a dish best served cold.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                            "body": "None of that is beneficial to the people. \n\nIt is a big club. And we aint in it.",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "BrooklynRedLeg",
                                                                                                                                                    "body": "True, but even incrementally leveraging their boot of our neck is at least something. I don't trust Trump as far as I could piss on him, despite what people in this sub think of me. But I'll damn sure take him using lube to buttfuck us over Kamala going in dry before letting all her buddies gangbang us.....",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                                            "body": "Your analogy does not work though. Both scenarios result in being buttfucked. There is no reduction in buttfuckery.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "BrooklynRedLeg",
                                                                                                                                                                    "body": "Yes...but it's better to at least get LUBED UP beforehand. Less shitting blood afterwards. Presumably Trump might also use a condom instead of raw dogging you like Kamala would.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                                                            "body": "I agree. But buttfuckery is buttfuckery. I do not accept being buttfucked.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": []
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        },
                                                                                                                                                        {
                                                                                                                                                            "author": "ILikeBumblebees",
                                                                                                                                                            "body": "I've got to be honest -- I don't give a smidgen of a shit about any of this.  Are my taxes going up or down?  Are government interventions directly affecting my life more or less?  Any other consideration is irrelevant.\n\nIf I want to watch a bunch of pompous blowhards engage in staged combat with each other, I'll turn on a WWE match, because watching two groups of parasitic grifters play tit-for-tat with each other is not nearly as entertaining.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "GoogleFiDelio",
                                                                                    "body": "Which law?",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "lochlainn",
                                                                                            "body": "The one he pulled out of his ass.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Will-Forget-Password",
                                                                                            "body": "[https://www.congress.gov/](https://www.congress.gov/)",
                                                                                            "score": -3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "GoogleFiDelio",
                                                                                                    "body": "LOL didn't think so.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Will-Forget-Password",
                                                                                                            "body": "Are you not allowed to click on links? \n\nI would bet money I know what happened. All this shit you are complaining about was passed in a 1,000 page omnibus bill that no one in congress bothered to scrutinize.",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                    "body": "You literally didn't link to a law, troll.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                            "body": "I linked to all the laws. Look for whatever you want. It will even tell you who voted.",
                                                                                                                            "score": -2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                    "body": "Fail.",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                            "body": "Ok, tell me which law you want to know about. I will link all the details.\n\nKeep in mind, this is domestic funds we are talking about here. I think 22 Union States are in this particular lawsuit.",
                                                                                                                                            "score": -1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                                    "body": "The one you referred to.",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                                            "body": "[https://crsreports.congress.gov/AppropriationsStatusTable?id=2024](https://crsreports.congress.gov/AppropriationsStatusTable?id=2024)",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                                                    "body": "That doesn't do what you claimed.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                                                            "body": "Does not do what?",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "GoogleFiDelio",
                                                                                                                                                                                    "body": "That doesn't do what you claimed.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                                                                            "body": "What did I claim?",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "denzien",
                                                                                    "body": "Which one was that?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Will-Forget-Password",
                                                                                            "body": "You tell me. This is the first time I am hearing about trans surgeries in Guatamala. Since that is totally a real thing, yall should be able to show where the funding came from.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "WendisDelivery",
                                                                                    "body": "The law doesn’t guarantee coverage for blank checks. \n\nTrump is putting the courts on the spot. Either they’re going to defend corruption, in which case they get turned down on appeal but slow the process down or the separation of powers will need to be confronted. \n\nThe example of USAID has proven that there is a fourth, unelected branch of government spending TRILLIONS of dollars with no oversight. \n\nYes, constitutionally Congress has the power of the purse and they’ve pawned it off in large part to this 4th branch. No elected representative is going to go out on the floor, in front of the cameras and argue in favor of funding “transgender surgeries in Guam.” The same exact thing with the “Green New Deal”. Even AOC wouldn’t touch that in front of the cameras. \n\nIt’s way past time for this to be corrected.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Will-Forget-Password",
                                                                                            "body": ">The law doesn’t guarantee coverage for blank checks.\n\nLink the blank checks please.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "WendisDelivery",
                                                                                                    "body": "Oh c’mon. \n\nhttps://youtu.be/L27N_I9Yg98?si=o5jZEUky3HaG2wOX\n\nAre you accusing Musk of lying??? Better come “with links” to prove otherwise.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Will-Forget-Password",
                                                                                                            "body": "Blank checks leave a physical paper trail. It should not be this difficult to show evidence.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "WendisDelivery",
                                                                                                                    "body": "Again, I’m at a loss here. As Musk said, quote: “How do you reconcile the bank statement with blank checks?” No addressee, no amount. \n\nThere is no dispute that we are going to find out who and for how much the checks are made out for, by check or control numbers after they’ve been deposited. This is why Trump put a freeze on USAID because no one knew where the funds were heading.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                            "body": "Someone cashed the check. There is the addressee and amount.\n\nNext step, compare to the appropriations. Make sure the addressee and amount match the appropriations. \n\nLegitimate spending is not harmed and fraudulent spending is revealed. \n\nThat is why Trump is getting fucked by the courts. He is harming legitimate spending with blanket spending freezes.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "WendisDelivery",
                                                                                                                                    "body": "Last I heard, the sign was getting taken down on the USAID building. The judge is a partisan hack who’s only attempting to to slow down the audit. \n\nThere’s nothing in it for you. Why are you protecting bureaucratic criminals?? Are you one of them?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                            "body": "I am not protecting anyone. I am having a discussion on the internet.\n\nI am an independent. I want to hear all the evidence.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "WendisDelivery",
                                                                                                                                                    "body": "“Independent” lol.👌",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Will-Forget-Password",
                                                                                                                                                            "body": "Way more independent than you. I am not politically affiliated. I am not monetarily affiliated.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "XDingoX83",
                                    "body": "You are on an anarcho-capitalists forum who the fuck cares what the argument is? Less government is good.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "GoogleFiDelio",
                                            "body": "OP is the sub socialist.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Will-Forget-Password",
                                            "body": "USA is not ancap. \n\nAncap would not have a president, congress, or taxes. This entire situation would not be possible in ancap.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "XDingoX83",
                                                    "body": "And?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Will-Forget-Password",
                                                            "body": "Trump is not ancap. You are not getting less government with Trump.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "XDingoX83",
                                                                    "body": "Don’t let the perfect be the enemy of the good.\n\nHe is trying to reduce government. I’ll take it.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Will-Forget-Password",
                                                                            "body": "Trump is not good. Increased taxes. Reduced civil rights. \n\nTrump is not trying to reduce government. See increased taxes and reduced civil rights.",
                                                                            "score": 6,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GoogleFiDelio",
                                    "body": "It was treason.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Will-Forget-Password",
                                            "body": "What was? And who committed it?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "GoogleFiDelio",
                                                    "body": "The judge enabling more treason.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Will-Forget-Password",
                                                            "body": "Your current story:\n\nTrump is allowed to pause already approved funding because a judge is enabling more treason.\n\n(Irrational)",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "GoogleFiDelio",
                                                                    "body": "Leftist judges protecting leftist treason is rational, for them.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Will-Forget-Password",
                                                                            "body": "Your story is irrational. You need to find a law that supports Trumps use of executive orders.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GoogleFiDelio",
                                                                                    "body": "Nah, you need to find a law prohibiting them.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Will-Forget-Password",
                                                                                            "body": "I did. The constitution.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "BrooklynRedLeg",
                                    "body": "That its wasteful, is contributing to our deleterious economy, annual deficits and the ballooning national debt.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Will-Forget-Password",
                                            "body": "Shame on me. I forgot Trump does not argue law.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BrooklynRedLeg",
                                                    "body": "https://i.redd.it/qn3ez4lh1fie1.gif",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Will-Forget-Password",
                                                            "body": "Fuck yall.\n\nTrump is not leading us to Ancap. When he issues an EO abolishing taxes yall can start simping for him.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "rasputin777",
                                    "body": "Approved funding has never been required to be spent, especially in a given timeframe unless the law written required it.  \n\nBiden paused funding to Ukraine to bribe them into firing a prosecutor as an example.  \n\nGWB slowed his stimulus spending specifically so Obama could spend some.  \n\nNo one ever cared before but now we're pretending that an approval to spend is a requirement to spend.  \n\nIt's called appropriation, that term means something very specific.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Will-Forget-Password",
                                            "body": "No one here has linked the laws in question.\n\nI will look at the lawsuit later. Maybe the States specified in their complaint.\n\nEDIT: The Defendants must immediately restore withheld funds, including those federal funds appropriated in the Inflation Reduction Act and the Infrastructure Improvement and Jobs Act. The directives in OMB M-25-11 are included in the TRO.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}