{
    "title": "The irony is deafening",
    "author": "ancienttribeofthesky",
    "subreddit": "Anarcho_Capitalism",
    "rank": 349,
    "score": 337,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 102,
    "url": "https://i.redd.it/zcrwq0tjinie1.jpeg",
    "id": "1inkm7c",
    "selftext": "",
    "comments": [
        {
            "author": "NeoGnesiolutheraner",
            "body": "So they want to beat Government regulations by Capitalism. Has anyone told them yet?",
            "score": 168,
            "replies": [
                {
                    "author": "ThinkySushi",
                    "body": "https://preview.redd.it/5v7nf9aqipie1.png?width=720&format=png&auto=webp&s=0b0e9d69a6faf40865eb3e7946bf2ba2b42956a3",
                    "score": 64,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fox_Mortus",
            "body": "Do they think that small business is the opposite of capitalism? These idiots seem to think that whatever corporations do is capitalism and anything that goes against corporations is anti-capitalist.",
            "score": 285,
            "replies": [
                {
                    "author": "Grouchy_Competition5",
                    "body": "Finally! Let’s defeat capitalism by selling goods in a free market at prices determined by buyers and sellers -  or by “supply” and “demand,” if you will.",
                    "score": 131,
                    "replies": []
                },
                {
                    "author": "standardcivilian",
                    "body": "The brainwashing is fully complete.",
                    "score": 92,
                    "replies": []
                },
                {
                    "author": "JewelJones2021",
                    "body": "It seems the word capitalism has a different meaning to different people. Maybe us marketists should use that word instead of capitalism, so that it is not confused with the implied definition above which resembles corporatism or corporate capitalism.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "RireBaton",
                            "body": "That's why I eschew the term capitalism in favor of \"free markets\". Capital refers to the goods and money itself, free market refers to the more important concept of the ability to voluntarily trade however you want without interference from another party.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "EconGuy82",
                                    "body": "I see a lot of leftists on Reddit who will say someone is all the way to the right on economic issues because they’re “capitalist,” which means that they support private ownership of the means of production.  Nevermind the fact that they support heavy regulation of the market restrictions on trade…",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "trufin2038",
                                    "body": "If you retreat every time you are challenged in language you will never win any arguments. They will take any words away from you and keep painting you with slurs.\n\n\nLook at \"climate change\" for a prime example.\n\n\n\nIt's time to be bold and proud capitalists. \n\n\nLet's push back now and not wait for a pendulum swing so extreme it blows right past us.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Fox_Mortus",
                                            "body": "The term capitalism was originally coined by communists as a way to disparage laisse-faire economics. If anything, you are adopting their language by using it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "trufin2038",
                                                    "body": "The communists did not coin the word, although they did use it quite a bit.\n\n\nIronically they ended up proving it was a good thing, the antithesis of communism.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JewelJones2021",
                                            "body": "I agree that you should be bold and proud and not let people paint you with slurs. \n\nBut, it's also good to understand that words have connotations or emotional meanings. So that, if you use a word that has a very negative emotional meaning while talking to someone, they may think negatively about your ideas. You have to communicate with people in a way both of you can understand, if that includes shifting your language so that you aren't misunderstood, maybe it's worth the difficulties involved. \n\nSlowly take back the word capitalism, by being very clear about what we mean when we say it, and asking others what they mean, then comparing definitions with them.\n\nMaybe. What do you think?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "trufin2038",
                                                    "body": "I agree we need to take it back. And make it clear we are proud of everything capitalism is.\n\n\n\nAs for clarity abiut the term, for example, i often find that i have to explain that corporations are socialism.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Big-Pickle7985",
                                            "body": "THIS",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "uuid-already-exists",
                                    "body": "Anarcho Free-Marketism if you will lol.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "old_guy_AnCap",
                                            "body": "Individualist propertarian market anarchist, but that's a bit unwieldy.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Cappdone",
                                            "body": "Maybe just free-marketism? Given it already means without state by definition",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "JewelJones2021",
                                    "body": "Yes, and there's a lot less room for misinterpretation.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Big-Pickle7985",
                            "body": "I feel like this is conceding ground to the left in a way it should not be conceded, we are already called anarchocapitalists, we should embrace this and stand firm on our own territory.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "TBD a LOT of people from all ends of the political spectrum don't understand the difference between capitalism and corporatism.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Vinylware",
                    "body": "Economic literacy was never their strong-suit.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Saysonz",
                    "body": "I think they want to try dodge the tariffs which they think will be better for both the buyer and seller.\n\nPretty much they want a true free market without regulations and govt involvement distorting prices, kinda what we want..?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Big-Pickle7985",
                    "body": "And corporations are literally extensions of the state. They are not actually run by the CEO, they are run by the Board of Directors which for large companies often includes politicians.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "No-One9890",
                    "body": "So I believe the anti-cap part is the not price gouging. Setting prices below market value out of generosity",
                    "score": -30,
                    "replies": [
                        {
                            "author": "PitsAndPints",
                            "body": "Is that generosity? Or is it catering to an adjustment(or outright rejection) of the current market value? Anyone willing to sell below the current market value gains a competitive edge and opens themselves up to gaining otherwise-uninterested new customers\n\nAll of this is being done(it seems) without a demand for state interference from the group in OPs screenshot",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "No-One9890",
                                    "body": "Good point",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kapitaali_com",
                    "body": "going against corporations is anti-capitalist in most cases",
                    "score": -74,
                    "replies": [
                        {
                            "author": "loonygecko",
                            "body": "\"Capitalism is an economic system characterized by private ownership of the means of production..Under this system, business owners retain ownership of the goods produced.\"",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "GunkSlinger",
                                    "body": "...\"or that which they exchange them for.\" Taxation is theft.",
                                    "score": 25,
                                    "replies": []
                                },
                                {
                                    "author": "kapitaali_com",
                                    "body": "you sure af aren't a capitalist if you're a small business owner",
                                    "score": -54,
                                    "replies": [
                                        {
                                            "author": "GunkSlinger",
                                            "body": "I'm a small machine shop owner. I produce goods all the time. I've even produced machines that produce other goods. You have a very limited perspective on what a business is.",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "kapitaali_com",
                                                    "body": "the capital is owned by corporations (capitalists), this was the case in marx's time and nothing has changed since then",
                                                    "score": -19,
                                                    "replies": [
                                                        {
                                                            "author": "EconGuy82",
                                                            "body": "Small business owners own capital and means of production… WTF are you talking about?",
                                                            "score": 14,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Secretsfrombeyond79",
                                                            "body": "Marx himself referred to small producers as Petit Bourgeoise.\n\nI know socialists won't touch a book on economics to save their lives, but for the love of god can you at least read fucking marx himself ???",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "GunkSlinger",
                                                            "body": "LOL. Ok Kommisar.",
                                                            "score": 11,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "kura44",
                                            "body": "You don’t know what capitalism is.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "kapitaali_com",
                                                    "body": "how many billions in your bank account bro?",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "kura44",
                                                            "body": "…What?",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "thermionicvalve2020",
                            "body": "Lolol",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "Official_Gameoholics",
                            "body": "\"Does he know?\"",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "slowpoke_1992",
                            "body": "Bad bot",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "beast_mode209",
            "body": "Whoops they just got shut down for health code violations and lack of permits 😂",
            "score": 141,
            "replies": [
                {
                    "author": "Secretsfrombeyond79",
                    "body": "They are risking the spread of diseases and encouraging tax evasion, they'd rather buy cheaper eggs than help the poor, we need a ban in assault eggs right now !!!\n\nBut seriously, it's like the USA left is slowly remembering why their party was called LIBERAL. It's funny and heartwarming in a way.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "pepe_silvia67",
                            "body": "I think we should drop a comment in the thread about banning high capacity egg cartons…",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "xPofsx",
                                    "body": "Why do we need high capacity egg cartons?  Chickens don't wear kevlar vests",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "loonygecko",
                    "body": "IDK if you are joking or not but they could well  be.   I doubt all these people have all the million licenses and permits to sell food items.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "WendisDelivery",
                            "body": "These people have no idea what small businesses and manufacturers have to deal with.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "livinglife_part2",
                            "body": "Farmers market. I sell about 30-40 dozen eggs a week, and I'm not a commercial chicken farm, I'd need about 500-1000 chickens before USDA would require permits and really start to care.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "uuid-already-exists",
                                    "body": "About roughly how many chickens does it take to get 30-40 dozen per week? That sounds like a lot of chickens.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "xPofsx",
                                            "body": "That's because it's a fuck ton and they're definitely skirting regulations.  Google says upwards of 5 hens per dozen per week.\n\n\nSo if we took their average (35 dozen/week) and the average hens (4 hens/dozen/wk) that means you need 140 hens, or a legitimate farm.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "beast_mode209",
                            "body": "I’m joking for sure but you know that’s going to happen",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "eico3",
            "body": "They don’t even realize that this is the capitalism they hate so much.",
            "score": 43,
            "replies": []
        },
        {
            "author": "jazrad50pt3",
            "body": "Beat capitalism with capitalism.",
            "score": 41,
            "replies": [
                {
                    "author": "EconGuy82",
                    "body": "It’s only fair, given that the Republicans twice elected a socialist to own the libs.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "andyc3020",
            "body": "Let’s just let them think they’re fighting capitalism.",
            "score": 71,
            "replies": [
                {
                    "author": "loonygecko",
                    "body": "That's a good point, we could just relabel all the stuff we like with names they'll like more and they'll probably go for them.   For instance, instead of saying 'lower taxes,' let's call it, 'govt income assistance.'",
                    "score": 36,
                    "replies": [
                        {
                            "author": "Unlucky-Pomegranate3",
                            "body": "Brilliant.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unlucky-Pomegranate3",
            "body": "Apparently, capitalism is when the USDA orders a hundred million chickens slaughtered.",
            "score": 26,
            "replies": []
        },
        {
            "author": "thermionicvalve2020",
            "body": "Lefties fighting the results of Democrat policies, lol.",
            "score": 41,
            "replies": [
                {
                    "author": "Secretsfrombeyond79",
                    "body": "\"Lefties fighting the results of Democrat policies, lol.\"- By doing everything they were opposed to, free market and unregulated purchase of goods. \n\nThe irony is so delicious I can't eat regular food anymore.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ultrafisk",
            "body": "Honestly I don't care what they call it. If they implement free markets, avoid paying taxes and call it beating capitalism I won't be there to bitch about semantics.",
            "score": 35,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "Like Jefferson said: \"In matters of style, swim with the current; in matters of principle, stand like a rock.\"",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "We’ll use capitalism to defeat capitalism!!!!",
            "score": 10,
            "replies": []
        },
        {
            "author": "Baller-Mcfly",
            "body": "![gif](giphy|9MJ6xrgVR9aEwF8zCJ)",
            "score": 8,
            "replies": [
                {
                    "author": "vbullinger",
                    "body": "![gif](giphy|H1wPB41Fn5dfWfGxYi)",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Solinvictusbc",
            "body": "Geographical differences in prices are funny. They are wanting eggs under 6 bucks and here I am not wanting to buy at 5",
            "score": 9,
            "replies": [
                {
                    "author": "RireBaton",
                    "body": "My thought exactly. I've never spent that much for eggs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shoot_2_Thrill",
            "body": "TIL that the market rushing to meet demand by following high-price signals is… checking notes… defeating capitalism\n\nShortages lead to high prices. High prices lead to increased production. Increased production leads to price and supply stability. Wasn’t this literally day one of Econ 101??",
            "score": 8,
            "replies": [
                {
                    "author": "bongobutt",
                    "body": "Brave of you to assume they took Econ 101. More likely they took these (https://lsa.umich.edu/lsa/academics/majors-minors/the-environment-major.html) :  \n  \nEARTH 144: Climate Change in the Age of Humans (only if taken FA16 or later).  \nBIOLOGY 171: Introductory Biology:  Ecology and Evolution;  \nEARTH / ENVIRON 120: Geology of National Parks and Monuments.  \nENVIRON 290: Food:  The Ecology, Economics, and Ethics of Growing and Eating.  \nBIOLOGY/ENVIRON 281: General Ecology AND BIOLOGY / EEB 372: General Ecology Laboratory;  \nSTATS 250: Introduction to Statistics and Data Analysis.  \nENGLISH 290 section titled \"American Environments: History, Thinking, Reps\", 317 section titled \"Greek Indigeneity\", 319 section titled \"Literature of Climate Change\", 328, 346 section titled \"Embodiment / Environment / Community\".  \nEtc.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WeedRambo",
            "body": "Hahahahahaha \"let's use capitalism, that'll help us overcome capitalism.\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "Rogue-Telvanni",
            "body": "My god, they're SO CLOSE.",
            "score": 5,
            "replies": []
        },
        {
            "author": "uuid-already-exists",
            "body": "Fighting capitalism with more capitalism if hilarious. Putting that aside though, I haven’t noticed any egg shortages in Texas. Is it really that bad in other parts of the US? Every grocery store I’ve been to in my area has them stocked quite well.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SpeedyCheese1776",
            "body": "Denial is a river in Egypt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LightningMcRibb",
            "body": "They want to beat capitalism by using capitalism",
            "score": 2,
            "replies": []
        },
        {
            "author": "Great_Opinion3138",
            "body": "How do ppl not get that price is literally the fucking signal the whole way through the supply chain from supplier to purchaser. It allows efficient allocation of resources to those who gain the most value. Basic economics by Thomas sowell should  be essential reading in school and colleges would help solve so many problems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Johnykbr",
            "body": "They don't make any mention of the King Sooper's strike that they are Yas Kweening about.",
            "score": 1,
            "replies": [
                {
                    "author": "Entmeister",
                    "body": "Naw that's just every other post on all the denver subreddits. Denver has gone full retard",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "lethalweapon100",
            "body": "Today we beat capitalism through the use of… *checks notes* capitalism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HODL_monk",
            "body": "I'm not sure if setting up a free market between people in goods and services is 'beating' capitalism. Seems more like 'joining' capitalism, but maybe the very world capitalism does not mean what they think it means ! Like only a big business that ships things from China is capitalism, and anything else is Rebel Scum...",
            "score": 1,
            "replies": []
        },
        {
            "author": "dr_brapple",
            "body": "I’ve noticed most people who claim to be anti-capitalist are really just against government intervention, as they should be. They’re just too angry at the big buzz word to sit back and realize that America is NOT a free market capitalist society and that the ideal world they imagine actually IS free market capitalism. \n\nI always tell commies that under a truly unregulated capitalist society, they would have the freedom and ability to form their own commune and set forth whatever rules they want for how goods and services are produced and distributed. Communism and socialism fail because of human greed and selfishness (usually from the gov side), so if you vet everyone you let Into your community personally and don’t allow corruption to seep in, then yes you could easily have a functioning society. I sure as hell wouldn’t have shit to say about it, and would fight like hell if that community had its rights threatened due to gov intervention even though it’s not a community I’d be interested in personally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MysticalWeasel",
            "body": "So they want to “beat Capitalism” with… Capitalism…",
            "score": 1,
            "replies": []
        },
        {
            "author": "eggyframpt",
            "body": "Oh no, the free market strikes again!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LibertyFive3000",
            "body": "This is the most Denver shit imaginable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flatulence_Tempest",
            "body": "I hate capitalism.\n\nHere, buy my eggs, they are good and at a cheaper price.\n\nI sold a LOT of eggs.\n\nTake that capitalism!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tertinian",
            "body": "Capitalism defines the relationship between people with access to capital and those without, and the power dynamic between those two groups.\n\nFree-Market is not synonimous with Capitalism or the other way around.\n\nYou can have Capitalism without free-market, take Fascist Economies where private ownership isnretained, but the state imposes prices, wages and production goals, thus taking control of the markets. E.g. Nazi Germany.\n\nSame way you can have Free-Market Socialism, e.g. Slovenia during the Cold War.",
            "score": -4,
            "replies": [
                {
                    "author": "old_guy_AnCap",
                    "body": "If the state imposes prices, wages and production controls then the \"owners\" of the \"means of production\" aren't truly \"owners\". Ownership means control.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Tertinian",
                            "body": "That's a bad definition for ownership. By that logic, talking in absolute terms, no one owns anything, ever.\n\nYou need someone else to help you control something? Since you cannot have supreme control of that helper, you don't trully own anything\n\nAnd obviously, the state's regulations and laws are also a lack of control for all whom are subjects to it.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Tertinian",
                            "body": "Of course, if we go for the fuzzy terms, then my example of fascist economies is valid, as one would still figure as the owner as far as the government is concerned. If they can make profit, it's theirs.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tertinian",
                    "body": "Why you boing me, I'm right",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Intelligent-End7336",
                            "body": "From a marxist perspective maybe.  From an anarcho-capitalist perspective you've missed the mark and frankly presented yourself as the enemy.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Tertinian",
                                    "body": "From an anarcho-capitalist perspective, multiple people organizing a new free market is a good thing.\n\nBut somehow, it's dirty socialism.\n\nWell done, Reagan would be proud.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Intelligent-End7336",
                                            "body": "You're defining capitalism like a Marxist, as a power dynamic rather than a system of voluntary exchange and private property. Capitalism without free markets isn’t capitalism; it’s just state control with a capitalist facade. Calling a fascist economy \"capitalist\" misses the point, if the state controls prices, wages, and production, that’s just another form of central planning, not a market economy.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Tertinian",
                                                    "body": "And yet, in a fascist economy, if you can make profit, it's yours, you are the owner of the enterprise. \n\nOn the other hand you can always sell your assets if you cannot make it in the (state controlled) market ( sell the enterprise ).\n\nYou can enter and leave willinglly. You decide how to run the business, you keep the profits, suffer the losses.\n\nSounds pretty capitalistic to me imo\n\nHonestly, it's just the sigma controlled market compared to the beta free-market.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Intelligent-End7336",
                                                            "body": "> Honestly, it's just the sigma controlled market compared to the beta free-market.\n\nCute meme, but controlled markets aren’t capitalism. If you ever want a real discussion, let me know.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Tertinian",
                                                                    "body": "That's my point. Capitalism can exist and exists with or without free-markets of any kind.\n\nYou can purchase and own a productive asset using money in the hopes of achieving a profit.\n\nThe medium of the asset is not relevant.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Intelligent-End7336",
                                                                            "body": "You're defining capitalism in the broadest, most superficial way possible, just private ownership of assets. But if you can “own” something while the state dictates what you do with it, that’s not capitalism, that’s corporatism or state control with a capitalist mask. Capitalism without free markets is like calling a hostage free because they can still breathe.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Tertinian",
                                                                                    "body": "The mythical and pure capitalism, like the mythical and pure communism, is an utopic ideal.\n\nIt is my opinion that capitalism results in corporatism and/or state capitalism so reliably, they might as well be part of the same phenomenon.\n\nHaving a client base which you can force to buy your goods or services is as conducive to business growth and innovation as the free-market, albeit with a different type of competition.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Intelligent-End7336",
                                                                                            "body": "You’ve moved from defining capitalism as “owning productive assets” to claiming it inevitably turns into corporatism or state capitalism. If that’s the case, then why does government intervention always play a key role in creating those outcomes? Corporatism isn’t the natural result of free markets, it happens when businesses and the state get entangled. Blaming capitalism for that is like blaming personal freedom for dictatorship because people sometimes elect bad leaders.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Tertinian",
                                                                                                    "body": "Free Markets, with no state interference, naturally leads to an unfree-market the following way:\n\nA competitive and innovative business can earn a good profit.\n\nIf the medium of exchange can be stored indefinitely\n\nThis business can stockpile enough money as to eventually drive out and buyout their competition by lowering their prices to the point of unprofitability for an extended amount of time.\n\nThis business can further gate-keep other businesses from entering the domain and even more importantly, expand to other domains.\n\nNow imagine the business managed to achieve a monopoly in something essential like medical services or water and power distribution, stuff you literally can't stop buying. Sure for a physical person, it takes some effort, but they can procure their own, but for anyone busy with their business, they have to buy it since they cannot compete.\n\nAt that point, a monopoly means the market is no-longer free.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "Tertinian",
                                                                                                    "body": "I'd go even further. Anti-trust laws are/should be enforced by the government to help keep the market free.\n\nNot to sound too much like a dirty communist, but capitalism, in any form, cannot exist without a state, for it naturally generates a state.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Tertinian",
                                                                    "body": "To illustrate something that isn't capitalistic in hopes of making my point clearer:\n\nConsume-Cooperatives' purpose is providing a good or service to it's owners at the lowest price possible, if not free. Profit isn't the purpose.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Tertinian",
                                                    "body": "In a state controlled economy, there is no profit and there is no market ( except the black-market). One doesn't control the assets capable of economic activity. The inputs and outputs are monitored and regulated and capital cannot be used to acumulate more capital.\n\nIt's literally State Capitalism. Capital exists, it's just all owned by the state and everyone used monopoly money essentially.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}