{
    "title": "Bryan Caplan: For Some, It's Either Break the Law or Never Come",
    "author": "Historical_Donut6758",
    "subreddit": "Anarcho_Capitalism",
    "rank": 326,
    "score": 5,
    "upvote_ratio": 0.59,
    "num_comments (reported by reddit)": 35,
    "url": "https://youtube.com/shorts/Jn4BuAuDUl0?si=k5AZyZnF7cwfoeAg",
    "id": "1ioynnb",
    "selftext": "",
    "comments": [
        {
            "author": "Dangime",
            "body": "The 3rd world produces 80 million new poor people per year. \n\nModern, westernized society, whatever you want to call it. It's not designed to take in 80 million foreigners per year. It's already busting at the seams after 4 years of Biden handing out benefits to anyone willing to come over. You're not doing some kind of humanitarian good or holding to libertarian values, you're just destroying your own society and dooming it to become a 3rd world socialist state.",
            "score": 3,
            "replies": []
        },
        {
            "author": "upchuk13",
            "body": "Caplan turning it up to 11.",
            "score": 5,
            "replies": [
                {
                    "author": "orwll",
                    "body": "204 views and 9 likes so far. He's really got his finger on the pulse.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GoogleFiDelio",
            "body": "The voters didn't want them \"around\".\n\nI don't care if they never come. We can't afford to take in all of the third world.",
            "score": 6,
            "replies": [
                {
                    "author": "brewbase",
                    "body": "Yeah, once “the people” decide you’re “them” and not “us”, immoral and amoral fucks are going to justify all kinds of evil shit happening to you.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "GoogleFiDelio",
                            "body": "The fact that you think having a border is that shows the depths of your psychosis.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "brewbase",
                                    "body": "Believing you and your neighbors have a right to tell peaceful people where they can live means two things:\n\n1. You’re in the wrong subreddit. \n\n2. You’re evil.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "GoogleFiDelio",
                                            "body": "I could easily say the same if you think you have the right to allow the entire third world here to rob me in taxes.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "brewbase",
                                                    "body": "Never said anything like that.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Historical_Donut6758",
                    "body": "thord worlders come to the US and often do better than americans. persons who study history know that third worlders come here( and yes once upom a time that includes white people like irish catholics ) come here and do well for themselves",
                    "score": 0,
                    "replies": [
                        {
                            "author": "GoogleFiDelio",
                            "body": "If that was the case the government wouldn't be bankrupting itself paying for their welfare. \n\nStop lying for socialism.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "G1nSl1nger",
                                    "body": "The government is bankrupting itself to pay for illegal aliens' welfare? I assume you have a source for such a bold claim. It will need to be greater than a trillion dollars spent to stand up.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GoogleFiDelio",
                                            "body": "They literally looted FEMA and numerous other organizations to pay for their hotels and gimmes.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "G1nSl1nger",
                                                    "body": "Sauce?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "GoogleFiDelio",
                                                            "body": "They just stopped a payment of $59 million to house them in a hotel.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "G1nSl1nger",
                                                                    "body": "$59M bankrupted the country?\n\nSource for your claim?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GoogleFiDelio",
                                                                            "body": "That and thousands of other grifts like that add up.\n\nSource? Math.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Kinetic_Symphony",
                                    "body": "The government is bankrupting itself by paying for US citizen's welfare (social security, medicare and medicaid) and of course, our military industrial complex.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "GoogleFiDelio",
                                            "body": "Yep, so explain how adding the entire third world to the welfare state improves things.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "orwll",
                            "body": "If we send back the Irish can we regulate immigration then? Because I'd take that deal.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "GoogleFiDelio",
                                    "body": "Imagine 60 million Irish-descended Americans being moved to Ireland, population 5 million. Their culture would be obliterated.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "orwll",
                                            "body": "We can start with the Kennedys.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "GoogleFiDelio",
                                                    "body": "Not, RFK, though, he's got work to do.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bongobutt",
                    "body": "The voters didn't want the Jews around. They can't afford to feed them.  \nThe voters didn't want the Japanese around. They can't afford to risk having spys.  \nThe voters didn't want having drugs around. We can't afford to pay for your overdoses.  \n  \nThe business doesn't want those people around. They can't afford to treat everyone like a charity case.  \n  \nOnly one of those is justified. Here's a hint: it's the one that involves private property.  \n  \n\"Voters\" don't own shit. You don't own someone else's property or body because a survey says so. You own your own property.  \n  \nIt doesn't matter if drugs are bad - you don't own their body. Trying to take the drugs away simply doesn't work. It doesn't matter if you don't want people to sneak into the country. Trying to keep them out doesn't work. The worst part of the drug trade is the fact that it is a black market - which is caused by the drug war itself. The worst part about illegal immigration is that it breaks the legal and welfare systems, which is the fault of the law itself.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "GoogleFiDelio",
                            "body": "Importing the third world for votes steals my private property.\n\nDeal, commie.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "bongobutt",
                                    "body": "How? Did they buy the house from you? Then it's not stealing. Did they vote to take it away from you? Then the government stole it from you.  \n  \nCommies are the ones who call capitalism slavery, because they deny how consent works and lie about definitions to win arguments.  \n  \nSo what were you ~~lying about~~ saying?",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "GoogleFiDelio",
                                            "body": "They're stealing from me via taxes.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "bongobutt",
                                                    "body": "\"They\" -> The IRS.  \nThe IRS -> Paying for welfare.  \nWelfare that shouldn't exist -> Established by Congress.  \n  \nWhere does the immigrant fit into this situation? Oh yeah, by existing. They aren't doing a damn thing to you. It's the state all the way.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "GoogleFiDelio",
                                                            "body": "Wrong, if they weren't here we wouldn't be paying for them.\n\nAnd they're bringing them here so they can vote for more socialism. \n\nYou can have open borders after you abolish the state, not before.\n\nWe're not talking about immigrants, we're talking about illegal aliens.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "bongobutt",
                                                                    "body": "What is your plan to get rid of them? ICE? Deportations? Magic incantations?  \n  \nWhat if I told you that *they already tried enforcing the law*? For 50 years. And it did nothing.  \n  \n>*We would've won the Drug War already if we just tried harder and spent more money.\"*  \n  \nSame vibe.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GoogleFiDelio",
                                                                            "body": "ICE, deportations, cutting off all welfare, fining and jailing employers and landlord...\n\nIf they enforced the law we wouldn't have 30 million illegals.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "bongobutt",
                                                                                    "body": "If they enforced the law, we wouldn't have pot or fentanyl. Right?  \n  \nIf they can't keep the contraband out of the country, what makes you think I'd be easier if the contraband literally had legs?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "GoogleFiDelio",
                                                                                            "body": "Because it's larger and can't be hidden as easily.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}