{
    "title": "Based Jack Dorsey declares \"no state is the best state\"",
    "author": "maxcoiner",
    "subreddit": "Anarcho_Capitalism",
    "rank": 174,
    "score": 108,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iw157l/based_jack_dorsey_declares_no_state_is_the_best/",
    "id": "1iw157l",
    "selftext": "[https://x.com/jack/status/1893487168133173327](https://x.com/jack/status/1893487168133173327)\n\nHe's getting a lot of opposition on the thread though, give him a hand when you get a minute.",
    "comments": [
        {
            "author": "livinglife_part2",
            "body": "Jack Dorsey was such a tool for the left and big government that it would be hard for me to believe him. But hey, maybe the dude had a moment of clarity.",
            "score": 89,
            "replies": [
                {
                    "author": "Infamous_Bus1578",
                    "body": "hes posted anatomy of the state by murray rothbard before and is a bitcoiner.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "livinglife_part2",
                            "body": "Yes, but when he was the CEO of Twitter, he had ex CIA personnel as \"advisors\" working for him. So, it's a bit suspicious, but people can change.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "mxracer888",
                                    "body": "Chameleons change their colors but otherwise stay the same. \n\nThe question becomes who's just being a chameleon and who's actually had their awakening. Zucc is in the same boat as far as I'm concerned, just changing colors in the effort of self preservation",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "dangered",
                                            "body": "Dorsey figured it out a decade ago and gave into censorship in an effort to “play both sides”. Zuck has been a shitbag but recently learned the game. Can’t trust either.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "maxcoiner",
                                                    "body": "Overrulled by his board does not mean gave in. Dorsey was a hardcore cypherpunk and long considered in the very top most likely people to be the actual Satoshi Nakamoto.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "maxcoiner",
                                    "body": "Were they working for him? Or hired by that dirty board?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Infamous_Bus1578",
                                    "body": "i agree he fumbled extensively and repeatedly with twitter and understand the skepticism. But, for whatever reason, my instinct is that he’s being genuine in all of this.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Quantum_Pineapple",
                            "body": "Dude was all about censoring free speech and even had a representative give non answers for him in circles on Rogan.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "maxcoiner",
                    "body": "He got kicked out of twitter for not playing ball with those people. Have you heard his side of it? He actually cheered Elon on for uncovering all the dirty stuff the twitter board was up to that led to the Twitter files.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "danibberg",
                    "body": "Yeah, but you can see him changing over time. Looks like the penny dropped. I’ll give him the benefit of the doubt.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "livinglife_part2",
                            "body": "Which is good. People that get stuck in a singular mindset never grow, and having as many people as possible waking up to the idea that we don't need the government is a good thing. Especially if they have a larger reach than us here in this little corner of the internet.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "temapone11",
                    "body": "Maybe he was blackmailed. I don't trust him tho.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "livinglife_part2",
                            "body": "Yeah, it's hard to say what the government had against him to know. That's why I'm a bit suspicious of his views.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sledgecrowbar",
            "body": "This is the exact same guy who turned Twitter into a liberal echo chamber by censorship, just to put it in perspective.",
            "score": 27,
            "replies": [
                {
                    "author": "Quantum_Pineapple",
                    "body": "This sub is ignoring this inconvenient fact.\n\nRemember the Rogan episode where he had that woman with him giving all non-answers?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "maxcoiner",
                            "body": "No we're not. You people are ignoring his excuse for that censorship... He stated for years that the twitter board of directors continuously overruled him on just about everything up until they kicked him out. Then he got behind Musk and cheered for them to be replaced.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lone_jackyl",
            "body": "Dorset is scum and let the fed use Twitter to censor people.",
            "score": 17,
            "replies": [
                {
                    "author": "bananabastard",
                    "body": "I think this is why he admires Elon. For the bravery Jack never had.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jeremy-Juggler",
            "body": "Can’t lose if you play both sides kinda move",
            "score": 9,
            "replies": []
        },
        {
            "author": "Quantum_Pineapple",
            "body": "This dude shilled so hard when “the state” was on his side.\n\nOf course he’s arguing for “no state” when he’s not on the controlling lobbyist side anymore lmao.\n\nThis is the exact billionaire the left should be against, and they worship this dude.",
            "score": 4,
            "replies": []
        },
        {
            "author": "danibberg",
            "body": "It was a matter of time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "afieldonearth",
            "body": "This guy is not based. Or maybe he has a based inner monologue, but every time he’s been put in a position of power, or put under pressure, he makes awful decisions.",
            "score": 2,
            "replies": [
                {
                    "author": "maxcoiner",
                    "body": "Tell us you haven't been following Jack Dorsey since he was fired from Twitter without telling us you haven't been following Jack Dorsey since he was fired from Twitter.\n\nHe's been an absolute mega-hero to Bitcoin and the lightning network ever since the day he got booted and told us all about the horrors his board of directors at twitter were up to. Probably spent a BILLION on developing open source tech since then.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}