{
    "title": "Simple path to 1000 prospera?",
    "author": "CauliflowerBig3133",
    "subreddit": "Anarcho_Capitalism",
    "rank": 173,
    "score": 2,
    "upvote_ratio": 0.6,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iwuirg/simple_path_to_1000_prospera/",
    "id": "1iwuirg",
    "selftext": "Create private cities like Prospera. Give share to every eligible voters in the country. Give extra share to those who live in the area. The rest go to investors. \n\nIt could be some share of revenue or actual shares. \n\nLet politicians campaign based on that in next election. Allow this private city somewhere far away with 0.5 percent of our territory and each eligible voters got $50 per year. Full privatization means $10k a year.\n\nOkay the number may be less or more. Many poor voters would love that and we need only 51 percent. \n\nGive it a try see if it works. The beauty of win win deals is we just scale up if it works and back down if it doesn't. \n\nIt works and voters like the money they will vote for more and more private cities. \n\nThen all cities are privatized. \n\nThen capitalism.\n\nhttps://www.lesswrong.com/posts/SnqHwiYAQuerCoBek/expevolu-a-laissez-faire-approach-to-country-creation",
    "comments": [
        {
            "author": "Sea_Journalist_3615",
            "body": "Prospera isn't a private city. It is still under the rule of a state. Collective ownership is not legitimate either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DMBFFF",
            "body": "A more practical solution would be for the government to, say, take 1600 square miles of land by eminent domain, paying fair market prices to the owners.\n\nNext divide into 4 parcels each 20 x 20 miles: give or sell one to Musk, one to Bezos, one to ABC, and one to Meta.\n\nThey create private cities from them, and run them like they were their own countries.\n\nThose who want to live there can each sign a 200+ page contract that is heavily in the favour of the corporations.\n\n&#x200B;\n\nHey, it'd be better than how Democratic libtards run the shithole cities in the US like NYC, Chicago, Detroit, DC, Philly, LA, Frisco, et al.\n\n&#x200B;\n\nFuck Democratic libtards!\n\n&#x200B;\n\n^((now upvote this, ideologues!)^)",
            "score": -1,
            "replies": []
        }
    ]
}