{
    "title": "Data that supports anarcho capitalism",
    "author": "No-Alternative7997",
    "subreddit": "Anarcho_Capitalism",
    "rank": 138,
    "score": 2,
    "upvote_ratio": 0.55,
    "num_comments (reported by reddit)": 32,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iy7qay/data_that_supports_anarcho_capitalism/",
    "id": "1iy7qay",
    "selftext": "Can you share any numerical data that supports minimized to no government?",
    "comments": [
        {
            "author": "MakeDawn",
            "body": "Small gov. = 3 piles of dogshit\n\nBig gov. = 200 piles of dogshit\n\nno gov. = no piles of dogshit\n\nIts simple mathematics really.",
            "score": 43,
            "replies": [
                {
                    "author": "tacocarteleventeen",
                    "body": "🤣",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "RandomGuy92x",
                    "body": ">no gov. = no piles of dogshit\n\nSomalia would like to have a word.",
                    "score": -14,
                    "replies": [
                        {
                            "author": "Somhairle77",
                            "body": "Go back and listen to Tom Woods' episode on Somalia again.  Seems like you forgot something.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "puukuur",
                            "body": "Without government, Somalia improved it's metrics of human development faster than neighboring government-controlled countries.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "vegancaptain",
                            "body": "Who told you to say this? This is programmed dude. You're being used.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Impressive-Door3726",
                            "body": "Somalia has 17 states.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "vbullinger",
                            "body": "Somalia is a collapsed, Socialist country full of Socialists. And they are WAY better off now than with their old government. They also have governance and are trying real hard with a lot of help from the outside to get a government going again and will obviously go the Socialist route again and will fail again.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Banned_in_CA",
                            "body": "Multiple failed socialist governments != no government",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "When AnCaps say gov we mean a state of authority without producing anything (can be gov, social construct, etc..).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fun_Assignment_5637",
            "body": "there is data on how economic freedom translates to high standard of living. An example is Singapure, another is Dubai.",
            "score": 12,
            "replies": [
                {
                    "author": "arto64",
                    "body": "Those are both pretty authoritarian, though. The question is more about the “anarcho” component, not the “capitalist” one. You can easily have capitalism under authoritarian rule.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "jozi-k",
                            "body": "How so? Capitalism is privately owned means of production. No place for authoritarian as I can see it 🤷‍♂️",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "unbiasedfornow",
                                    "body": "There are plenty of capitalistic opportunities in Russia. You just have to give a share of profits to the supreme commanders.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "arto64",
                                    "body": "The state enforces property rights, you just need the state on your side and you’re set.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "prometheus_winced",
            "body": "Do the work yourself. Pull data on economic freedom of all countries on earth. Run statistical analysis on quality of life factors like life expectancy at birth, maternal mortality, literacy, and others. \n\nYou won’t believe any data that you don’t generate yourself. \n\nThe correlations make it very clear. The more free a country is, the higher all quality of life metrics. \n\nIf there was a peak amount of state, the correlations would have a hump, or convex curve, and begin to fall again with “too much freedom”.  We don’t see this, so there is still more quality of life to be had further on the freedom axis.",
            "score": 7,
            "replies": []
        },
        {
            "author": "jmorais00",
            "body": "GDP per capita vs. Ease of doing business index\n\nhttps://preview.redd.it/cr33xb4wtgle1.jpeg?width=960&format=pjpg&auto=webp&s=d139075b4d807bf8dd3f21fd6edd883cd3c8ef99\n\nAn ancap territory would achieve maximum ease of doing business. Wait and let economics work\n\nAlso, there is theory. Anatomy of the State and the 6 Lessons are a good start. When you're done you can read Man, Economy and State and get a full grasp",
            "score": 7,
            "replies": [
                {
                    "author": "jmorais00",
                    "body": "I must say that economic prosperity is a fortunate consequence of the morally correct notion of reducing (abolishing) the State. Even if it weren't economically preferable, liberty would still be morally correct",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "myadsound",
            "body": "You have to purchase it",
            "score": 4,
            "replies": []
        },
        {
            "author": "ThatOtherGuyTPM",
            "body": "Nope.",
            "score": 0,
            "replies": []
        },
        {
            "author": "RandomGuy92x",
            "body": "I don't think there is any such data. Laissez faire capitalism was an experiment that was tried from the 19th century until around the early 20th centruy but was later resoundingly rejected all over the world.\n\nToday pretty much every single country on earth has given up on laissez faire capitalism. So just like communism has failed every single time it was tried so has laissez faire capitalism. It was replaced by mixed economics and more regulated forms of capitalism.\n\nSo yeah, laissez faire capitalism seems to have been a failed experiment I'm afraid.",
            "score": -26,
            "replies": [
                {
                    "author": "SteakAndIron",
                    "body": "That was the greatest growth in wealth and prosperity of all time.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "RandomGuy92x",
                            "body": "Actually since the 1950s, under more regulated forms of capitalism, global GDP has grown at a much faster rate than it did during the laissez faire era of the 19th century.",
                            "score": -18,
                            "replies": [
                                {
                                    "author": "SteakAndIron",
                                    "body": "No, its that gigantic economic powers adopted some of the free market principles of the west. China, India, Russia, etc.  we have seen a separation of productivity and wages in the west since at least the 1970s as regulations and government spending has increased year over year.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "LiberalAspergers",
                                            "body": "Hard to argue that the West got more free market from 1920 to 1950, but 1950 is is the beginning the the great wave of economic growth.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "RandomGuy92x",
                                            "body": "> we have seen a separation of productivity and wages in the west since at least the 1970s as regulations and government spending has increased year over year.\n\nActually after the 1970s what happened in the US was primarily about de-regulation. I'd say de-coupling the dollar from the gold standard is a form of de-regulation. And in the 1950s and 1960s taxes in the US used to be extremely high actually. After the 1970s there were massive tax cuts, much more global free trade agreements were negotiated, and there's been a ton of banking de-regulation, weaking of union rights, antitrust laws etc. etc. \n\nChina has obviously benefited from adopting more free market principles since they were a hardcore communist country, which is also pretty bad. But in the US the seperation of productivity and wages happened largely because of the neoliberal policies and de-regulation that happened under Reagan and the Presidents after him.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "kurtu5",
                                                    "body": "> Actually",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "puukuur",
                                                    "body": "How in the heck is removing the backing from the currency you force people to use at gunpoint a form of deregulation?  \n  \nA form of deregulation would be *not forcing* *people to use dollars*.  \n  \nInflation is a form of taxation, so even if you reduce the nominal tax percentage but finance government spending by stealing purchasing power through printing money, then the tax rate effectively rises.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "vegancaptain",
                                    "body": "That's just bad logic.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "kurtu5",
                                    "body": "> Actually",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AToastyDolphin",
                                    "body": "GDP is a garbage metric.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kurtu5",
                            "body": "So no data then?  Gotcha.  Any other observations and we will say, \"no data\".  Right RandomGuy92x?",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}