{
    "title": "Title",
    "author": "ElRonMexico7",
    "subreddit": "Anarcho_Capitalism",
    "rank": 103,
    "score": 152,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 22,
    "url": "https://i.redd.it/yfq146vp3jle1.jpeg",
    "id": "1iyuud9",
    "selftext": "",
    "comments": [
        {
            "author": "Intelligent-End7336",
            "body": "Here's a fun recap for anyone curious about how internet debates go sideways.  \n\nHow This Debate Went Sideways (And What I Should’ve Done Differently)\n\nStarted with a legit critique:\n\n *   I pointed out the irony of Napolitano using the Judge title while being associated with Mises, since he leans more constitutionalist than anarchist.\n\nWhere it went wrong:\n\n   * The other guy responded with mockery instead of engagement (images, sarcasm).\n    I took the bait and got emotional, calling him a bootlicker.\n    That let him shift the conversation away from the argument and onto my tone.\n    Once it became about whether I was being hostile, the original point got buried.\n\nWhat I should’ve done:\n\n   * Stayed focused on the contradiction, not on his attitude.\n    Ignored or called out the deflections, instead of escalating.\n    Forced him to engage with the actual point, making his dodging obvious.\n\nLesson learned: If someone won’t answer your argument and just mocks you, don’t take the bait—make them explain why they’re dodging.",
            "score": 10,
            "replies": [
                {
                    "author": "ElRonMexico7",
                    "body": "Your purity test(hOw dArE tHeY cAlL NaP bY hIs sTaTisT tItLe) is even gayer than your loquaciousness.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SlateWindRanch",
                    "body": "Damn. I don't think I've ever seen this level of introspection in a comment section ever. Well done. \n\nAnd yeah, good point on Napolitano, definitely weird for him to use the state bestowed honorific while disparaging the state and being associated with Mises. Head scratcher.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ElRonMexico7",
                    "body": "![gif](giphy|Is0AJv4CEj9hm)\n\nTu quoque, vir ingeniosus.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Intelligent-End7336",
            "body": "Why is the Mises Institute a watermark on the picture?  Napolitano is probably more worried about whether decentralization or constitutional limits work better and not whether the state should be torn down.  I mean, he still uses the Judge Honorific as a means of legitimacy or appeal to authority within a system he critiques.  He likes the prestige that comes with \"Judge.\"",
            "score": 2,
            "replies": [
                {
                    "author": "ElRonMexico7",
                    "body": "https://preview.redd.it/ly7gdof6bjle1.png?width=995&format=png&auto=webp&s=7c63fa224d8f02a93a33697b72aa7e9a64a743ee",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Intelligent-End7336",
                            "body": "Oh boo hoo, go Lick the boot somewhere else",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "ElRonMexico7",
                                    "body": "https://preview.redd.it/54q4h9itjjle1.jpeg?width=600&format=pjpg&auto=webp&s=8650f93da769b48d61171a45fa7855ec93890de7\n\nyOu dOn'T hAtE tHe StAtE LIkE i hATe tHe sTAtE! yOu MuST nOt HaTe tHEm aT aLL!",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Intelligent-End7336",
                                            "body": "So you never answered the question, is this an official Mises meme?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ElRonMexico7",
                                                    "body": "How dense are you? Why would anyone go around doctoring such a thing?                 \n\n\n\nEdit: https://mises.org/library/judge-napolitano-worst-supreme-court-decisions",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Intelligent-End7336",
                                                            "body": "> How dense are you? Why would anyone go around doctoring such a thing?\n\nGiven the minimal effort you put into the submission, your overall level of animosity and condescension, you seem like just the type to doctor something like that.  \n\nIt's probably not fair to Mises to associate you and your behavior with them even though your posting their content.  \n\nOverall it highlights an interesting issue.  Trying to mix a statist like Napolitano with Mises and having a angry fur ball like you spreading the message, I wonder overall how much the message was served.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "ElRonMexico7",
                                                                    "body": "It's not that deep, I shared this photo on my FB eight years ago, it popped up in my memories and now I'm sharing it here. I would seriously advise you to find a hobby or even better start a new side hustle, you seem have too much time on your hands man.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Intelligent-End7336",
                                                                            "body": "I started this with a legitimate question and you answered with mockery.  Don't try and get high and mighty.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ElRonMexico7",
                                                                                    "body": "\"I started this with a legitimate question\"\n\nDebatable, you started with a question that could be answered with a quick reverse image search or ten seconds of logical thought followed by strange and judgmental rambling. \n\n \"you answered with mockery\"\n\nIndeed.\n\n \"Don't try and get high and mighty\"\n\nI wasn't and I don't see how any objective analysis could conclude as much.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Intelligent-End7336",
                                                                                            "body": "> I wasn't and I don't see how any objective analysis could conclude as much.\n\nYou framed your comment as ‘advice,’ but let’s not pretend it wasn’t a veiled insult.   If you weren’t trying to be high and mighty, you wouldn’t be acting confused when called out on it.\n\nAnd yes, my question could have lead to a discussion of whether having a former judge offer advice on the state in a subreddit dedicated to the removal of the state is a worthwhile endeavor.  It could have also spurred a discussion on whether Mises.org hosting content from a former judge is helpful to advocate for a stateless society or not.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ElRonMexico7",
                                                                                                    "body": "You framed your comment as ‘advice,’\n\nYep sarcasm, funny how you got that the first few times.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "s3r3ng",
            "body": "All government, at all levels, is EVIL.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CommandStrict943",
            "body": "tyrannical = civil rights and child labor laws and minimum wage",
            "score": -2,
            "replies": [
                {
                    "author": "C0WM4N",
                    "body": "Civil rights = forcing people to do things at gunpoint",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CommandStrict943",
                            "body": "outlawing slavery = forcing people to do things at gunpoint too",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "C0WM4N",
                                    "body": "Lincoln stated that his main priority was keeping the union together not abolishing slavery. Also not being a slave is a human right not a civil right.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "CommandStrict943",
                                            "body": "who enforces human rights",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}