{
    "title": "Why do anarcho communists say that anarcho capitalism requires a state or government to exist?",
    "author": "rebeldogman2",
    "subreddit": "Anarcho_Capitalism",
    "rank": 106,
    "score": 24,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 132,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iz1xtm/why_do_anarcho_communists_say_that_anarcho/",
    "id": "1iz1xtm",
    "selftext": "",
    "comments": [
        {
            "author": "ImpressiveMongoose52",
            "body": "They think you need a government to enforce contracts.\n\nThey somehow don't think you need a government in a centrally planned economy. And also that they don't need a government to equally and fairly distribute goods and services to all the people. \n\nAnarcho-communism is the dumbest idea.",
            "score": 92,
            "replies": [
                {
                    "author": "GurlNxtDore",
                    "body": "Sounds like an oxymoron.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "GnomeAwayFromGnome",
                            "body": "Fittingly popular with morons who waste oxygen!\n\n*ba-dum tish*",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Bubbly-Ad-1427",
                                    "body": "ah yes, the one totalitarian system of economics and they wanna remove the government from it",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BobbyB4470",
                    "body": "I still can't get any of them to explain to me how they'd prevent me from creating my own means of production and charging money for things I make using them, without force.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Friedrich_der_Klein",
                            "body": "Yeah i once asked a commie what would prevent me and my homies from creating our own ancap microcity in this ancom utopia, without violating anyone else's rights, and he outright said that it would be illegal and \"the people\" would use force to stop us from practicing our freedom. Of course he couldn't answer how \"the people\" would organize, nor how different this is from a state.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Classy_Mouse",
                            "body": "They wouldn't have to. Anarcho-communism and anarcho capitalism are completely compatible. If you have either one, you can not prevent the other. So they can have their commune, and you can have your business",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "BobbyB4470",
                                    "body": "I would say in anarcho-capitalism, yes. If you have capitalism operating in anarcho-communism, it's not really communism anymore",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "oceanofice",
                                    "body": "They are not compatible at all but theoretically you are right. Anarcho communism is opposed to private property, but in a theory they cannot abolish private property without force so they merely wouldn’t participate in the voluntary market economy that ancaps would organize.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "harry_lawson",
                                    "body": "Well no, if you have two different groups of people with two different perceptions of property rights, you'll get conflict and the inability to coexist.\n\nAncoms would reject the legitimacy of ancap claims on land and resources, while ancaps will reject the legitimacy of the public ownership of resources through violence. \n\nIn what world can these coexist, without one system ceding to the other?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mattmayhem1",
                    "body": "Arbitration destroys their entire argument. Lol.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "flamingspew",
                            "body": "The one who wields the biggest gun, holds in their hand the greatest arbiter.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Derpballz",
                    "body": "This.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "harry_lawson",
                    "body": "You seem to be a bit confused because you describe authoritarian communism, then say anarcho communism.\n\nAn-coms don't want a centrally planned economy.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ImpressiveMongoose52",
                            "body": "Maybe I am. What i think I know I only got from dudes on reddit. But they never were able to answer simple questions about how it would work without at least some force from some authority.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "harry_lawson",
                                    "body": "Damn dude maybe do some supplementary reading, at least if you're going to speak on the topic. If all your information on opposing political opinions comes from Redditors, you'll get dumber even just listening to all the drivel.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ImpressiveMongoose52",
                                            "body": "Yeah, probably. But I'm not wasting my time reading commie fantasy novels. You have a shot right now to enlighten me. You tell me how communism works with no authority structure, and I'll never make fun of an-coms again.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "harry_lawson",
                                                    "body": "Bro I'm not a communist and this isn't a job interview, go look it up yourself. I'd literally be parroting the little ancom theory I've read from the likes of Kropotkin.\n\nI seriously suggest researching opposing worldviews in general, instead of outright dismissing them; that's very arrogant. We can often learn more about ourselves and our own ideologies by reading those in opposition. \n\nHonestly you sound like a teenager\n\nEdit: ah, it's just tren rage no worries",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ImpressiveMongoose52",
                                                            "body": "Na, I'm good on the reading commie literature\nI guess i am arrogant when it comes to hating communism. (I know I'm right about it)\n\nTren rage? You lift bro? Then you really must not be a communist.\nThat's a joke. I lift too. Compete in powerlifting and strongman.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "harry_lawson",
                                                                    "body": "Nice man just sarms or full TRT?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ImpressiveMongoose52",
                                                                            "body": "Played around with a cycle of prohormones and S4 but never competed on it. Other than that still natty. Getting older now. TRT is tempting",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "harry_lawson",
                                                                                    "body": "If your bloodwork (free test) is good still you're fine.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HonorFoundInDecay",
                    "body": "Anarcho communists don’t want a centrally planned economy which you’d know if you actually knew what anarcho communism is.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "oceanofice",
                            "body": "Nah, but they typically want decentralized economic planning and that’s as anti-market as a centrally planned economy.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "arto64",
                            "body": "They always just pretend AnComs want USSR and Stalin but no state and then call them dumb.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": " all Anarcho are dumb in some ways and all have good ideas, some more than others but still every Anarcho way runs into a logical wall that stops their ideas as a whole because society has too many mixed bags of shit that will always be.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "ijxy",
                            "body": "I agree with some core principles of anarcho capitalism, but I'm here mainly because I like taking ideas to the logical extreme as a thought experiment. When I come to think about it, I use the same principle at work: When I create a policy, or someone comes with a new software architecture for feedback, I have them give me the purest form of it and envision it big, then tone it back down to a level where it is possible to implement; we retain some of the benefits, but it is possible to implement given our constraints. I guess that is what I'm here for too, just for politics.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "arto64",
                    "body": "Anarcho-Communists don’t want a centrally planned economy. Communism is not about central planing, Marxism-Leninism is, for example (which is an authoritarian form of socialism). I suggest you look up what AnComs actually believe and want.\n\nIt’s easy to criticize AnComs if you pretend communism and the USSR are the same thing.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "ImpressiveMongoose52",
                            "body": "Dress it up however you want, but communism doesn't work without the gulag",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "arto64",
                                    "body": "Capitalism requires an oppressive state to enforce property rights.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ImpressiveMongoose52",
                                            "body": "I'm not an an-cap. Why do you think it's oppressive to legally protect people's property rights? \n\nCommunism requires an oppressive state to enforce compliance. To direct production and distribution.\n\nWhat do you value politically? For me, it's liberty and individualism. \n\nI'm asking because I'm genuinely curious. I want to know what communists want.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "arto64",
                                                    "body": "I’m not even sure I’m a communist, I’m more of an anarcho-socialist.\n\nCommunism is defined as a classless, stateless society, where the means pf production are collectively owned. There is no need for oppression, because there is no belief in private property (distinct from personal property) in a communist society. If you find this utopian and silly, fair enough.\n\nSocialism is when the workers own and democratically manage the business they work at. I don’t see any reason why anyone would be against that, especially not a worker.\n\nI also value liberty and individualism (to an extent, there’s value in collective effort). I don’t see capitalism offering either of those. Capitalist businesses are authoritarian and strictly collectivist (in service of the business owners) by their very nature. This is precisely why I am an anarcho-socialist. No state oppression, business is run by and to the benefit of the workers that put in all the effort and provide all the value.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ImpressiveMongoose52",
                                                            "body": "That's a pretty good explanation. Thank you.\n\nThat business model you described is a co-op. They are pretty cool. They do still have to provide value with what they produce, though. Otherwise, they go out of business. I don't know how your co-op. Would decide what and how much to produce without a marketplace to sell  it on. \n\nSo the question i am stuck on is this. Are we collectively owning a company and selling goods on the market? Or are we collectively owning a company producing goods for the collective?\n\nIf it's for the collective, how do you get around not having an authority direction who produces what and where it gets sent?\n\nIf it's the market, then your business model of worker owned company totally works with capitalism. These companies exist.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "arto64",
                                                                    "body": "Both are possible, but I would say producing goods for the collective would be inevitable in a fully-automated, post-scarcity society (if people allow it to happen).\n\nMarket socialism (where at least the majority of companies are worker-owned) is a more immediately reachable step. I know coops already exist, but I would like to have them be the standard way of running business, not a rare outlier.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "I_Never_Use_Slash_S",
                    "body": "Ya you obviously don’t need a government to have legally binding contracts. They’ll be enforced by the Ministry of Unicorn Farts.",
                    "score": -21,
                    "replies": [
                        {
                            "author": "MakeDawn",
                            "body": "You really don't. Reputation is a very important resource and people that are constantly breaking contracts don't make it very far in the market.",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "Wrathofsteel",
                            "body": "Usually, withheld service is enough. No ministry is needed.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Secretsfrombeyond79",
            "body": "They think the right of property steams from the government, aka for them property is not a natural right but one created by the government.",
            "score": 22,
            "replies": [
                {
                    "author": "cH3x",
                    "body": "Specifically land. Land ownership has been derived from sovereign claims, land grants, treaties, registering homesteads, etc. Unless there is a general reset of land ownership, anarchocapitalism would continue to rely on this government foundation. Land deeds would trump natural rights. So goes the argument.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "Nah.  Land is no different from any other rival good.  In real life, transfers of land ownership in common law systems are just based on deeds written by sellers to buyers, with no central registry being necessary, and no \"government foundation\" having to be involved.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Wrathofsteel",
                                    "body": "Deeds could be block-chained in the absence of government to prevent falsification.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "A deed registry would actually be a good application of blockchains, but we wouldn't even need that, since government is barely involved in the first place.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Tertinian",
                    "body": "Whats your take on the coconut island scenario?",
                    "score": -4,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "Worst-case outliers are not useful for extrapolating general-case rules.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Secretsfrombeyond79",
                            "body": "I got no fucking idea about this scenario, but considering this is a troll account, I expect it to be nothing but a complete ridiculous reductionism of nature where the only possibles choices are to create a socialist utopia, or let poor Timmy who was born with no legs and needs constant medical care starve to death.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Tertinian",
                                    "body": "I've had 5 cake days. You don't fit in here. Look for the other subreddit",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "Secretsfrombeyond79",
                                            "body": "> I've had 5 cake days.\n\nYeah I can count. And in 5 years you have less than 2k of karma. Which means this is a multi account you barely use only to say crap. \n\n> You don't fit in here. Look for the other subreddit\n\nSure unlike you, who support that tenants should have the right to basically steal someone's house if they feel like Anarcho\\_Capitalism/comments/1iwx4d6/comment/meiqk3f/\n\nYou clearly belong to the anarchCAPITALIST sub more than I do.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SopwithStrutter",
                            "body": "It assumes too many variables before the initial assertion of the question",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ExcitementBetter5485",
            "body": "Because they conflate capitalism with government in order to criticize capitalism, despite the fact that they are simply criticizing government.",
            "score": 49,
            "replies": [
                {
                    "author": "Rieux_n_Tarrou",
                    "body": "Are they stupid?",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Nakedsharks",
                            "body": "Yes. Incredibly. ",
                            "score": 30,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ijxy",
                    "body": "There is a youtuber talking about this, TIKhistory. I remember he argued that publicly traded companies where there are no dominant owners are communist in nature. That you need few (one?) owner at the helm of a company (owning the means of production) for it to be capitalist.\n\nNot sure if I agree, or if I managed convey his argument correctly, but it is an interesting take.\n\nTIKhistory: \"[Am I an Ancap? And what is Anarcho-Capitalism?](https://www.youtube.com/watch?v=aSfiEniyUBY)\n\nWhat I can say, as a business owner, is that the dynamic in a small company like mine is very different from that of a publicly traded company. The biggest difference is in power dynamic. In a company owned by a few individuals, the owners have total power via their board appointments and hired management. However, in a publicly traded company there is downward shift of power to the often non-owning board and management/CEO. The owning \"masses\" become someone the CEO manages like other stakeholders. Sometimes going as far as criticizing the owners or making enemies out of them; (which pisses me off to no end when I hear about). In that sense I can kind of \"feel\" the argument a bit, because the CEO kind of becomes a bureaucrat more than the arm of the owners.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "jaaaaayke",
                    "body": "In all fairness, capitalism was a product of the state. They didn't emerge separately.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "Additional_Ad_4049",
                            "body": "This is one of the dumbest things I’ve ever read. May god have mercy on your soul",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "oceanofice",
                            "body": "I think private property predates the state, but that delves into the philosophical question: what is private property and what is the state. It would be more logical to say the government was supposedly created to protect natural rights despite it being the most common violator.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Chr1st_1s_K1ng",
            "body": "No idea. You could ask them, but all you’d get is strawmans and hypotheticals",
            "score": 11,
            "replies": []
        },
        {
            "author": "ogherbsmon",
            "body": "Cope - Projection",
            "score": 8,
            "replies": []
        },
        {
            "author": "welcomeToAncapistan",
            "body": "Might be better to ask them. I suspect it's because ancap does not fit the typical image people have of anarchy - and that likely goes for ancoms as well.",
            "score": 7,
            "replies": [
                {
                    "author": "rebeldogman2",
                    "body": "When I ask them they say that you guys want a state to exist and that a state is needed in order to have capitalism, or private property. It confused me",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Bagain",
                            "body": "That’s a perfectly reasonable response. The problem is that they are looking at the issue from a perspective that only allows for capitalism to exist via the existence of a state, which necessarily, invalidates anarcho capitalism as a concept… as was already stated, their version of anarchism requires a system that has power over others in order to enforce a set of rules that where decided for them by councils or assemblies or panels or… a governing body who gets to decide for you, you know, a government.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "freebilly95",
                            "body": "Property rights are believed by ancaps to be basic human rights that are naturally bestowed upon everyone who exists. Ancoms believe that property rights are government given rights because the ownership of land is hard to discern without a written deed or other such documentation. \n\nIn essence, the ancap will say, \"I am in possession of this thing, and thus I own it, and any infringement upon my ownership will be treated as a threat.\" Whereas an ancom would likely respond, \"If you leave that thing somewhere and someone happens upon it, who is to say you own it if the government does not exist?\"\n\nIn fairness to ancoms, this argument holds some weight. As we would all agree here, possession is the greatest indicator of ownership, so if I left my truck somewhere and someone took it, they possess it and in an ancap society where I didn't have a title for it, who is going to support me when I say that it is my truck and the person who currently possesses it stole it? And, if I defend my property as per the NAP, do the people around the thief believe that I was in the right to do it, or do they believe I wrongfully stole the thief's property and think I am in violation of the NAP?\n\nHowever, what ancoms fail to realize is that the ancap society as a whole relies on the NAP not as a means of reaction to aggression but as a deterrent to it. While it may be borderline naivety, the idea of the ancap society is that people will be brought into line through a mutual understanding of the NAP and what it means if you break it.\n\nI could point out the flaws in ancom ideology too, considering that their core tenant of \"From each according to his ability, to each according to his needs\" fundamentally requires a power structure to enforce because it is against human nature. They are naive enough to believe that humans will always help each other out when they're in need and that it's just the government that has stopped that from happening (which is fair to a point, but not explicitly true.)",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "rebeldogman2",
                                    "body": "Well said",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gratedfumes",
                            "body": "Just because you're choosing your government in a market system it doesn't change what it is. \n\nAlso Capitalism as it's commonly known is extremely hierarchical and this dependency on hierarchy and the obsession with currency is a bit antithetical to anarchy. People around here will disagree with this as they use some individual, esoteric, nebulous definition of Capitalism that ignores how it functions in the world. Kinda how Communist say it's \"All about cooperation and anyone that tells you different is a dumb liar\"",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OnePastafarian",
                    "body": "They will likely ban you immediately for asking",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Character_Dirt159",
            "body": "They believe private property can’t exist without the state. It’s essentially a fundamental misunderstanding of human nature as well as the role of capital in production.",
            "score": 7,
            "replies": [
                {
                    "author": "trufin2038",
                    "body": "Without the state, private property is the only kind of property.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ozarkafterdark",
            "body": "Trick question. There's no such thing as anarcho communism. It's an oxymoron.",
            "score": 6,
            "replies": []
        },
        {
            "author": "FreitasAlan",
            "body": "Because they’re so communist they think states invented private property.",
            "score": 6,
            "replies": []
        },
        {
            "author": "matadorobex",
            "body": "They can't imagine coexistence without compulsion.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Deja_ve_",
            "body": "They subconsciously think that government gives someone natural rights, which by the way, completely destroys their argument for communism and doing away with the state and currency. They also think you need government to enforce contracts, when contracts don’t need to be physical in order to be in place. They can’t differentiate between legal contracts and moral contracts.",
            "score": 4,
            "replies": []
        },
        {
            "author": "deaconxblues",
            "body": "They’re confused and have it precisely backwards",
            "score": 5,
            "replies": []
        },
        {
            "author": "Senior_Flatworm_3466",
            "body": "What in the fuck is an \"anarcho communist?\"",
            "score": 6,
            "replies": [
                {
                    "author": "arto64",
                    "body": "Maybe go look up what it is before you bitch about it.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Vegetable_Steak_3063",
                    "body": "a hippie that wish to be free from social hierarchies. they believe getting ride of hierachies are possible and necessary to have true communism.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "bpg2001bpg",
            "body": "Communism can't work in a state nor anarchy. At some level, there has to be an authority to keep people from owning things. In effect, that authority owns everything. Whoever controls the authority is not equal with everyone else in the commune. \n\n\nAnarchy works perfectly with capitalism. People naturally want to own things. People naturally understand that if they can own things, so can others. Even kids know that if they want something someone else has, they need to trade for it. Some people might argue about who owns what. We don't need a state or any authority to mediate. Contracts and arbitration work fine with voluntarism and the NAP.",
            "score": 4,
            "replies": []
        },
        {
            "author": "GunkSlinger",
            "body": "They think they have a right to shit on your coffee table and you need the state to stop them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JohnBosler",
            "body": "My best guess is you are both wrong. It would be a coalition of libertarians that individually families would be of a specific ideology within their household. And each business entity would run under its own ideological philosophy. It would be a gigantic mismatch of ideologies that unite under the philosophy to each his own. There would be a wide variety of left middle and right wing libertarian communes",
            "score": 2,
            "replies": []
        },
        {
            "author": "MonadTran",
            "body": "They heard this phrase from another anarcho-communist so they are repeating it. There is no logic to it, but if you disagree you're a heretic. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "shizukana_otoko",
            "body": "Why? Because they can’t/don’t think, and only repeat what they’ve been told. Critical thinking is not their strong suit. If if were, they wouldn’t be communist.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beneficial_Slide_424",
            "body": "Any anarcho communist here? Can anyone explain me what is the difference? Isn't anarchism \"capitalistic\" by default, i.e, free voluntary exchanges between individuals?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Impressive-Door3726",
            "body": "Usual anarchist intolerance. Most ancoms will find any reason they can to hate us. The ones who are genuinely smart aren't present.",
            "score": 2,
            "replies": []
        },
        {
            "author": "1986Cutty442",
            "body": "i find anarcho communists to be the funniest oxymoron in general. like how do u support an extremely totalitarian  system and at the same time argue u dont want a state? ik that the whole thing is seize the means of production for a stateless classless society but the fact they think that going full authoritarian to complete liberty is realistic is so fucking funny",
            "score": 2,
            "replies": []
        },
        {
            "author": "EGarrett",
            "body": "You actually don't need a government. Check out a video called \"Law without Government: Conflict Resolution in a Free Society\" by Man Against the State on Youtube.",
            "score": 2,
            "replies": []
        },
        {
            "author": "beating_offers",
            "body": "The real answer, I think, is that anarchocommunism doesn't require any codified rules.  No distribution, take what you want.\n\nAnarcho-capitalism requires you to recognize people keep what they earn or create.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Leading_Air_3498",
            "body": "There are two forms of government. I call them libertarian and authoritarian. A government is really just a relative monopoly on the use of force. So long as we all consented to give a group some of our money in exchange for various services, then that government would be libertarian. Taxation renders the state authoritarian.\n\nThere's no such thing as without government. Even if the formal government dissolved in its entirety today, people would simply band together and agree to help one another out, and likely help protect each other from outsiders who might attempt to vandalize, rob, or harm them in some way. This would still just be a government. Many nations have had systems like this in the past (some still do).\n\nThe smallest government in the world is Vatican City, with a landmass of 0.44 square km, and a population of 764, and it's been around since 1929.\n\nCommunism also requires a state to exist. Communists will try and tell you that communism is a moneyless, stateless society, but that's nonsensical. Money isn't real, it's an abstract idea. Money is basically a counting mechanism for merit. You could destroy all current money today and people would just start trading items or services and writing down who provided them services and who they owe services to. This \"tally\" would just be money lol.\n\nAnarcho-communism is an oxy-moron because anarchism means without rulers and in order to have communism you have to have authoritarianism because the moment you have a society of complete free trade you now just have capitalism. Calling it communism would just be semantics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gullible-Historian10",
            "body": "It’s funny because Marx calls for the dictatorship of the proletariat, meaning communism can never be stateless",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patient_Pause_6478",
            "body": "Anarcho-communists assume that people can't operate with a gun to their head; which is ironic given the \"anarcho\" in their name.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RacinRandy83x",
            "body": "You probably should ask them",
            "score": 1,
            "replies": []
        },
        {
            "author": "odinsbois",
            "body": "Cause they don't know anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Derpballz",
            "body": "Because they don't realize that r/AlCaponeIsStatist",
            "score": 1,
            "replies": []
        },
        {
            "author": "CommandStrict943",
            "body": "You need a government to enforce contracts, protect pr*vate property, etc..\n\ncorporations would basically become governments anyway",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordXenu12",
            "body": "Because the defined private borders around a population agreeing on their personally preferred criteria objectively constitutes a state with a government according to technical definitions",
            "score": 1,
            "replies": [
                {
                    "author": "rebeldogman2",
                    "body": "But they say anarcho communism doesn’t require a state",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LordXenu12",
                            "body": "Can’t have a state without defined borders of private control",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fit_District7223",
            "body": "Because property rights need enforcement, and without a government, relying on private courts and insurance companies would create a patchwork system. This could lead to inconsistent enforcement where different regions or corporations have different standards, essentially creating quasi-governments with their own agendas. It could end up exacerbating the problems anarcho-capitalism tries to solve, but now on a local level where the rich and powerful might have more control.",
            "score": 1,
            "replies": [
                {
                    "author": "rebeldogman2",
                    "body": "And in an anarcho communist society everyone just agrees with property rights so there are no disputes ever? Or is a government required there too?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Fit_District7223",
                            "body": "In a communist society, there are no private property rights because private property, by definition, requires a legal framework to enforce ownership, something that doesn’t exist in a stateless, classless, and moneyless system.\n\n\nPersonal property, on the other hand, refers to things you use regularly, like clothes, furniture, or personal electronics. Private property in the Marxist sense refers to means of production, factories, land, and businesses, owned by individuals or corporations for profit. Under communism, these would be collectively owned, eliminating private property in that sense, but not personal belongings.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "rebeldogman2",
                                    "body": "So it’s just might is right then when it comes to disagreements ?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Fit_District7223",
                                            "body": "No, 'might makes right' isn't the principle at play because under communism, resources and production are collectively managed rather than individually owned. Without private property, disputes wouldn't be about exclusion but about fair use and distribution within a communal framework. Conflict resolution would rely on social consensus, cooperation, and agreed-upon norms rather than coercion. The whole point is to eliminate the power imbalances that make 'might makes right' a necessity in capitalist frameworks.\n\n\nLet's talk more about anarcho-capitalist private property rights as this was the original subject of the post, no? How do anarcho-capitalist private property rights even exist when, by definition, they require legal enforcement, and there’s no government to provide that? What stops the private agencies handling enforcement from becoming mini quasi-governments with their own rules and power structures? And if protection is just another service you have to buy, doesn’t that mean the wealthiest get to decide whose property actually matters? What’s stopping anarcho-capitalism from devolving into corporate feudalism, where power, not rights, determines everything?\n\n\nLet’s set aside the whataboutisms and actually put your philosophy under the microscope.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "rebeldogman2",
                                                    "body": "Collectively managed? But societies are made up of individuals. So what if one wants to exclude use of “community property”? Wouldn’t the “community” become a government that forces the “fair use” of said property?\n\nI feel that in both anarcho capitalist and anarcho communist societies this issue would be solved the same way. Through force between individuals. Unless everyone agreed to the terms of the society they lived in. In which case there would be no conflict in either society.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Fit_District7223",
                                                            "body": "You're right that societies are made up of individuals, but in a truly anarchocommunist society, the goal is to eliminate the need for coercive force altogether. The concept of 'community property' isn't about one individual imposing their will on others, but rather about collective management where resources are shared for the benefit of all. If someone wants to exclude others from using community property, it wouldn’t be about a government forcing them to share, it would be about mutual agreements within the community, based on consensus and social norms.\n\n\nIn an anarchocommunist framework, conflict resolution comes from cooperation, not force. The idea is to create a society where everyone agrees to share responsibility and resources, so the need for violent force diminishes. Of course, that requires widespread consensus, but the point of this model is to create a system that reduces the need for force in the first place.\n\n\nNow, in an anarchocapitalist society, the situation is different because property is still individually owned, and there's no central authority to mediate disputes. What you're describing would just be a continuation of capitalist dynamics, where disputes over property and exclusion would likely be handled through private enforcement and essentially, more force, but distributed across private actors. This could easily devolve into a situation where the wealthiest individuals or corporations control the rules, creating more inequality and coercion.\n\n\nSo while you're right that in both societies conflicts would need to be resolved, the difference lies in the systems through which they would be resolved: one is focused on mutual cooperation and shared responsibility, and the other relies on competition and private enforcement, which can easily perpetuate the very power imbalances that anarchocapitalists claim to oppose.\n\n\nBut you've still not really addressed how private property works in anarchocapitalism, especially when there’s no central authority to enforce it. How do we ensure that private enforcement agencies don’t just become mini governments themselves, creating power structures and rules that end up resembling the state? What’s to stop them from exploiting people, especially in a system where protection is a service you buy, meaning the wealthiest can essentially decide whose property matters? These are key issues that need more clarity\n\n\nDo these enforcement agencies have a monopoly on force? If not, what makes any ruling they issue binding when one side can simply refuse to comply and invalidate the decision entirely? If they do have a monopoly on force, why? That would make them no different from a government, especially if they establish overarching frameworks that all enforcement agencies must follow. In that case, it starts to sound a lot like consumer protection laws, which, again, essentially makes them a government.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "rebeldogman2",
                                                                    "body": "I think that in an anarcho capitalist society the goal is to get people to a point where no one would want to or need to take something that someone else owns, since “personal property” exists in an ancom society, this seems like it would be handled in a similar way in both societies. \n\nThe goal is to not have to use force in both societies.\n\nThe society we have now is the one where the wealthy can influence the government to act on their behalf and become even more powerful and more wealthy.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Fit_District7223",
                                                                            "body": "You’re sidestepping the core issue. You’re framing anarchocapitalism as an ideal where people simply don’t take what isn’t theirs, but that doesn’t explain how private property is actually enforced. Hoping people will just respect ownership without any real mechanism to resolve disputes isn’t an answer. It’s wishful thinking.\n\n\nI’ve already pointed out that enforcement agencies in an ancap system would either have no real authority (making rulings meaningless) or would act like a government with a monopoly on force. Instead of addressing that, you’ve shifted to saying the goal is to avoid force, without explaining how that would actually happen in practice.\n\n\nAnd your comparison to personal property in anarchocommunism ignores a key difference: personal property under ancom excludes land and capital, while ancap depends on enforcing private ownership of both. That’s a huge difference in practice.\n\n\nYou call other systems utopian, but you’re not offering anything beyond surface level optimism for your own. If ancap is supposed to be a serious political theory of social organizing, you need to address these major problems.\n\n\nI’m going to ask one last time: how do ancaps enforce private property without private enforcement agencies becoming mini-governments themselves? How does private property even exist when, by definition, it requires a governing body to create and uphold the laws that make it possible?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "rebeldogman2",
                                                                                    "body": "You’re also framing anarcho communism in that ideal … you act as if no one would want or try to get “private property” or “land” in a way that isn’t in accords with the community, and if they do you act like a heirarchy wouldn’t be formed to exclude them or take from them what they believe is theirs. \n\nI’m not sure if I’m an ancap or an ancom since they are so similar. I believe both systems are utopian. But there is nothing wrong toward working toward utopian ideals.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Fit_District7223",
                                                                                            "body": "You’re still dodging the core issue. You claim ancom and ancap are “so similar,” but that’s just not true. The fundamental difference is that ancom abolishes private ownership of the means of production, while ancap depends on enforcing private property rights. You keep acting like ancom would inevitably form hierarchies to exclude people, but you’ve yet to explain how ancap prevents private enforcement agencies from becoming mini-governments themselves.\n\n\nYou’re also strawmanning ancom by assuming it wouldn’t have mechanisms for handling land disputes in a fair and collective way. The entire point is cooperative decision making instead of coercion. Just because YOU think conflict is inevitable doesn’t mean every system has to default to force as the solution.\n\n\nYou call both systems utopian, but there’s a key difference: Ancap is utopian because it relies on the wealthy simply choosing not to exploit everyone, while ancom is “utopian” to you because you don’t think people can collectively make decisions. My brother in Christ, humans have lived in ancom adjacent societies for far longer than the current economic system. Mutual aid, collective resource management, and community-driven decision-making are not some fantasy, they've existed throughout history.\n\n\nIf your argument is that people will inevitably form hierarchies in ancom, why wouldn’t the same thing happen in ancap, except worse, because those hierarchies would be based entirely on wealth? You’re willing to believe that corporate fiefdoms will magically self-regulate, but not that communities can make decisions together? That’s not skepticism. That’s selective faith.\n\n\nAnd let’s be real, you still haven’t answered the question. How do private property rights function in ancap without private enforcement agencies effectively becoming governments? If enforcement is just another service people buy, then the wealthiest will dictate whose property actually matters. If those agencies impose universal rules, then they’re a government in all but name. So which is it? You keep shifting the goalposts instead of actually engaging with the critique.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "rebeldogman2",
                                                                                                    "body": "Your assertion that private property is only able to owned with a state is false. It is a state that determines what private property is. In absence of a state I can own whatever I want, it is only when a collective group , a government, comes along and takes it from me after making a determination that it was “private” property and not “personal” property. Otherwise there is no difference between then. \n\nAnd if it is true that “private” property can only be acquired  with a state , then there would be bo private property in anarcho capitalism as there is no state.\n\nThe difference between personal and private property is completely arbitrary. As it depends on a central authority, “the community” in your case, determining where the line is drawn and how to rectify that determination with force.\n\nHow can the wealthy exploit me if I don’t choose to do business with them or to use or trade in their form of “wealth” ?\n\n“Community” decision making is two wolves and a sheep deciding ok what is for dinner.\n\nAnd I do believe that hierarchies could form under either system. I think the goal of both ancom and ancap is to try and stop that from happening. And I mean a real heirarchy. Not someone choosing to voluntarily trade or do work with someone else. I mean a master and slave relationship like we have with governments today\n\nNot to mention, almost anything can be considered “means of production”. A piece of wood, a cloth, my hands…\n\nWhat would happen in ancom society if someone tried to take someone’s “personal property”? There are no hierarchies, no security forces private or government, so back to my original point, it goes back to might makes right. Which would happen in ancap as well.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Fit_District7223",
                                                                                                            "body": "4 minutes to type this load of nonsense?\n\n\nYour claim that private property can exist without a state is not true. Private property absolutely requires a state or some governing authority because property rights are fundamentally laws that protect those claims. Without a state or authority to define and enforce these laws, there would be no formalized concept of private property. In a stateless society, like anarchocapitalism, the problem remains: who enforces property rights? Without a centralized authority, disputes about property would be resolved by competing private agencies, which would likely evolve into entities with coercive power, essentially becoming mini-governments themselves, contradicting the very idea of a stateless society.\n\n\n\n\nThe distinction between \"private\" and \"personal\" property is not arbitrary. Personal property is what you directly use for personal needs (clothes, tools, personal items) things that are tied to your personal well-being. Private property, however, refers to resources (land, buildings, etc.) that can be controlled, used to generate wealth, and excluded from others. This distinction is vital because it highlights different roles in the economy and the management of wealth. It's not just an artificial distinction set by a state or “the community.” In anarchocapitalism, the line between personal and private property blurs when enforcement is outsourced to private companies. Likely creating exploitation and power imbalances where the wealthy can maintain control.\n\n\nAs for your point on exploitation: if you don’t choose to do business with the wealthy, how can they exploit you? In an anarchocapitalist society, the wealthiest control the means of enforcement. Protection and services are bought, so they would have the resources to enforce their interests. This creates an environment where wealth, not merit or need, decides who has their rights respected. That is exploitation by default.\n\n\nThe “community decision-making” critique you raise about anarcho-communism is flawed. It’s not just about a majority deciding on something for their own gain. It’s about creating a system that upholds fairness and the equitable distribution of resources. In a real community-based decision-making system, there’s no inherent \"two wolves and a sheep\" problem because the community agrees on the needs of the many. It’s about cooperation and collective benefit, not coercion or imposition.\n\n\nFinally, you mention that almost anything can be considered a \"means of production,\" but this isn't an argument against anarchocommunism. The point of ancom is not that everyone must produce the same way or that personal items are collectively owned, but that the means of production, resources that are necessary to produce wealth on a large scale are shared, not concentrated in the hands of a few. If someone tried to take someone's personal property, the community would have mechanisms for resolving that issue through mutual agreement, and not through force.\n\n\nIn both anarchocapitalism and anarchocommunism, hierarchies can form, but the key difference is that ancom actively seeks to reduce those power imbalances and structures, while ancap inevitably creates a system where wealth and coercion determine who has power. Both systems aim to reduce coercion, but ancom does so by emphasizing community and collective decision-making, while ancap does so in theory yet fails in practice when wealth and enforcement become the determining factors.\n\n\nBut again, instead of addressing the core questions being asked, you're sidestepping with \"whataboutisms\" or asking \"What does x really mean?\" It feels like you're putting more effort into avoiding the question than most ancaps put into explaining how their system truly works, outside of blind faith and the \"I'll just take my business elsewhere\" spiel. You're one person, but we already see in our current system that when a business is too convenient, people don’t actually take their business elsewhere. So what makes it different in an ancap society? Actually, don't bother answering. At this point, it’s clear we’re not getting anywhere. Have a nice day, man.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "rebeldogman2",
                                                                                                                    "body": "If anything can be a means of production, the community can take it from anyone if they decide it is private property and not personal property through an arbitrary decision. Fairness is subjective. Each individual decides what is fair.\n\nI’ve told you I’m not sure I am an ancap. I’m asking questions about these systems to decide what I am. Your system seems to require just as much force and still seems exactly the same to me as ancap. The only difference seems to be in your mind everyone agrees that everything js owned communally and there would be no disagreements or minimal ones.\n\nA private security force comes down to an individual or a group of individuals who decide they will protect someone else. Which could certainly happen in an anarcho communist society it seems to me.\n\nYou really think no one has taken their business elsewhere ever ? I personally have and I know people who have as well… haven’t you personally maxed out a choice to deal with someone but not someone else ?\n\nlol ya don’t bother answering since you can’t provide a coherent answer. Sure.just keep repeating , in my system  that wouldnt happen because COMMUNITY and PERSONAL property not PRIVATE…",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Fit_District7223",
                                                                                                                            "body": "Lol, dude, we're clearly not getting anywhere. I get it, you've got the art of sidestepping questions down. It's almost like you’re preparing for a political career with how you avoid giving straight answers. Instead of actually addressing the 2 questions I’ve asked multiple times, you cherry-pick parts of what I say and misinterpret or strawman them. If you can’t explain how private property exists without an authority figure with a monopoly on force to protect it (without just hoping it works out) and how to keep private enforcement agencies from just becoming mini-governments then there’s nothing left to discuss. Take care.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                    "body": "I’m not side stepping questions. Anarcho communism obviously has private security forces too. You try to steal my “personal property”, I or people I have convinced to help me stop you. Private security force. How is this different than what would happen under ancap ? You just pretend it isn’t a private security force and that you call it a community decision instead. Even though it is just individuals acting in their own self interest. \n \nYoure the one who can’t prove there is a difference between personal and private property.\n\nYou also can’t prove that a community that “owns the means of production”, like my hands or my piece of wood, isn’t a government that has authority over my “personal property”. \n\nCognitive dissonance at its finest.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                            "body": "Claims to not sidestep the questions, then immediately sidesteps by saying, ‘Anarcho-communism has private security forces too.’\n\n\nThat isn’t an answer to either question. You’re literally dodging with ‘but what about x problem with ancom’ instead of addressing the actual points I made. And now I’m pissed. Reread my fucking answers, you dunce. I’ve already addressed your whataboutisms, but you can’t even answer two simple questions.\n\n\nSo I’ll ask one last time: How does private property exist without an authority with a monopoly on force to protect it? How do private enforcement agencies not just become mini-governments?\n\n\nAnd before you try the same weak deflection again, no, ancom doesn’t function like ancap. In ancom, enforcement of norms is decentralized and based on community consensus, not a market-driven service where the wealthy buy more ‘protection.’ Under ancap, security is literally a commodity. Meaning those with the most resources decide whose property gets defended. That’s a power imbalance functionally identical to a state.\n\n\nMy brother in christ you’re intentionally blurring the line between private and personal property. Personal property is what you directly use (your hands, your toothbrush, your house.) Private property is capital, land, and resources leveraged for profit. No one is saying the ‘community’ owns your hands that’s a blatant strawman dipshit. The point is that the means of production, under ancom, are collectively managed so that no single person or corporation can monopolize access and exploit others.\n\n\nThe real cognitive dissonance here is pretending ancap somehow isn’t just feudalism with extra steps.\n\n\nI won’t respond unless your next answer actually addresses my questions. But honestly, at this point, I’m reminded of that Mark Twain quote: ‘Never argue with stupid people, they will drag you down to their level and then beat you with experience.' The fact that I'm hurling insults at you for you lack of basic reading comprehension, has proven him right. Have a good night, you fucking idiot.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                    "body": "Private property exists by the people who own it defending it. The same way community property exists, only with community property it is a group of individuals who mutually decided to defend it.\n\nI think it’s funny you choose to insult me rather than even touching on any of the points I made. Typical of those who use force against those they disagree with rather than trying to come to a mutual agreement or understanding. Funny coming from someone who supposedly is all about mutual aid and cooperation and supposedly against force and hierarchies. Unless someone tries to “own private property” or doesn’t want to share “community property” lololol",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                                            "body": "Okay so if I chose to defended your property, it's now mine. If all disputes are solved by force or the threat thereof then there has to be a monopoly or essentially 'property rights' just comes down to whoever has more firepower. \n\n\nSo basically anarchocapitalism just results in a wild west style society because there'd be no real system in place to prevent this. ",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                                    "body": "If you chose to defend MY property, then you made an agreement with your behavior to help me. Otherwise you would be the one trying to take the property from me… \n\nAnd how would anarcho communist be any different than individuals defending their own property, or choosing to join together to do so ? Just because everyone agreed that everything is communal and no one would contest this ? So no one would ever even try to take “personal property” right? Without “hierarchies” like having someone do work for someone else voluntarily, or if no one owned the “means of production” like my hands or a piece of wood ( which you have both referred to as private property and personal property during this conversation) no one would ever even want to take someone else’s “personal property”? Is that it? 😂",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                                                            "body": "If I defend 'your property' better than you and I out gun you, it's mine. That's what would happen in an ancap setting. And if if I had more resources than you to ensure private enforcement agencies stay out of it or back me, there's not a damn thing you can do about it. But again we're off on a tangent as you still haven't answered my original 2 questions ",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                                                    "body": "Well you wouldn’t be defending my property then. You would be confiscating it from me. That is also what would happen now.. or under anarcho communism, or under a monarchy. Usually the monarch or government will win in the end though… but still in all situations the strongest will win. That’s a fact of life. Just like how I have to expend effort if I want to live",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                                                                            "body": "All these words just to not answer the 2 questions I've been posing ",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                                                                    "body": "I’m addressing points you made, which you won’t do to me. You asked how property would be defended without a state? I answered by the people who owned the property.",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                },
                                                                                                                                                {
                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                    "body": "Things leveraged for profit … every action any person engages in is because they profit in some way. Because they feel better about doing it than not doing it. \n\nIf I used the means of production of my hands and carved a piece of wood, another means of production, and traded it to my neighbor for something else, I profited from the transaction. If I help my neighbor bc I wanted to I profited from the transaction. But by your definition I have “private property” since I made profit and used means of production so your “community” could seize it at any time. Even though at the same time you are saying it’s “personal property” and that that wouldn’t happen lol. \n\nYou intentionally only think of fiat monetary profit, something that likely wouldn’t even exist in a society without government. And if it did who cares, you wouldn’t have to use it . Not like a government would be forcing you to pay your taxes on it to live on their land…",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                                            "body": "Cherry picking and strawmanning again. Nice. Anyways, I still have 2 questions needing to be answered. If that's too challenging for you, I completely understand. Have a good one.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                                    "body": "I already answered. Property would be defended in either an anarcho capitalist or anarcho communist society the same with, by individuals who wished to defend the property. Without the coercion of a state involved. Now maybe address any of the points I brought up that destroy your argument that you are choosing to ignore ?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                                                            "body": "You haven't made points good enough to address. You ignore that the actual literal definition of property rights say that they are legal rights. Without a government to enforce these laws how does private property even actually exist? If individuals are enforcing their own 'property laws' then enforcement will differ drastically along with what is actually considered property. It will always devolve into the right is right mentality if you rely on the childish optimism that either private enforkent agencies and psychopaths will actually play by the rules.\n\n\nI've also explained to you multiple times how ancap and ancom differ but it's clear that you're an idiot. So I'll just leave it at this. Have a good one. We're going in circles where you answer questions that weren't even asked such as 'how people will protect private property' then cherry pick, strawman, or ignored the rest of my points.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                                                    "body": "And how would this not happen under anarcho communism. No authority to define what “private property” or “public property” is. No authority to regulate disputes other than childish optimism that everyone will agree to communally own everything.\n\nI don’t think anyone will play by the rules under any system. Everyone is looking out for themselves in all actions, even charitable ones.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": []
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        },
                                                                                                                                        {
                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                            "body": "And do you know what’s insane to me? Earlier, you claimed to be neither ancap nor ancom, and I’m a socialist, so neither am I, but somehow I understand both ideologies better than you. You don’t even grasp the basic definitions of key terms or relevant concepts, yet you’re out here debating political philosophy with an elementary school level understanding. How are you this confidently uninformed? Like seriously there should be an award for this",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                    "body": "You’re just looking at definitions that don’t make sense when you take more than a second to scrutinize it or look at the reality of the situation. If individuals choosing to defend something they consider to be theirs isn’t a private security force then what is? If my hands aren’t a means of production even though they can be used to make things that profit me then what is? If profit isn’t a gain or an advantage then what is it ? If people aren’t engaging in activities to get a greater sense of wellbeing than why would they do them ?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                                            "body": "If you can't answer my 2 question, there's nothing to talk about. Have a good one",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                                    "body": "Nice job not addressing a single point I brought up after I answered your questions several times. There are so many logical  inconsistencies with your thinking that you’re just choosing to ignore.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Fit_District7223",
                                                                                                                                                                            "body": "Now you know how it feels. You still haven't answered how property rights actually exist without someone with a monopoly on force to define and enforce them or how to stop private enforcement agencies from becoming mini-governments themselves. ",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "rebeldogman2",
                                                                                                                                                                                    "body": "I don’t think “rights” exist. If I have a “right” to life and someone kills me it didn’t do me any good. It’s up to me to do my best to keep myself alive. And I believe I would be far better off doing that than relying on a government who confiscates my money and signs me up for their protection plan I never wanted. Likewise what good is my “right” to property if the government decides to use eminent domain against me ? \n\nI just think the world would be a better place if people stopped trying to use force against people they disagree with.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": []
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}