{
    "title": "Preppers are mad there could be less nukes and they won’t need to hide in their bunkers.",
    "author": "different_option101",
    "subreddit": "Anarcho_Capitalism",
    "rank": 31,
    "score": 60,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 41,
    "url": "https://i.redd.it/nthhu7zt6lme1.jpeg",
    "id": "1j30rbm",
    "selftext": "",
    "comments": [
        {
            "author": "RonaldoLibertad",
            "body": "So many people are mad there may be no more ongoing wars.",
            "score": 29,
            "replies": [
                {
                    "author": "LoneHelldiver",
                    "body": "They aren't really people.  It's USAID money spent to propagandize the American people.  Or if that is truly cut off, money from some other source, mostly likely American still, not foreign countries, though that happens too.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "There won't be any need for war once no one can defend themselves and Russia and China get to rule the world unopposed.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "RonaldoLibertad",
                            "body": "You do know nuclear weapons are used as a deterrent, right?\n\nDo you also know trade partners don't typically go to war with each other? You know, it's destroys business.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thesauciest-tea",
            "body": "That sub used to be good but got taken over by those afraid of COVID and became \"preppers\". Just another lefty sub now",
            "score": 17,
            "replies": []
        },
        {
            "author": "Ziegweist",
            "body": "If he actually manages to slash the military budget, I'm all for it.",
            "score": 34,
            "replies": []
        },
        {
            "author": "uuid-already-exists",
            "body": "That sub is wack. There’s not really any preppers in there anymore.",
            "score": 23,
            "replies": [
                {
                    "author": "HotelHero",
                    "body": "It started during Covid and I used to love that subreddit. Then it turned gay.",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ya_Boi_Konzon",
            "body": "I HOPE he cuts the military budget in half!",
            "score": 38,
            "replies": [
                {
                    "author": "Random-INTJ",
                    "body": "I hope he cuts the budget",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "DMBFFF",
                    "body": "at least in half.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lanracie",
            "body": "Watch the leftists be pronukes.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 8,
            "replies": [
                {
                    "author": "different_option101",
                    "body": "If I have to guess, all the talk from most American politicians about China is pure envy ‘cause they can’t do the same to Americans.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "No-One9890",
                            "body": "If it's not tru, then what r they envious of",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "trufus_for_youfus",
                    "body": "They ain’t bothering me.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Icy_Macaroon_1738",
                    "body": "China's military power is focused inward, to defend their territory. \n\nNews reports of China being a military threat are wildly overblown. \n\nWere China to attempt a land invasion of Taiwan, which is right next door and a minor power comparatively (assuming the US doesn't intervene), the military would need a significant amount of time to realign itself. \n\nThe United States' military is instead focused on projecting power outward. There are roughly 750 US military bases in 80 nations, compared to China's 5 foreign bases.\n\nThe US citizenry is what protects the mainland. The Chinese citizenry is obviously not armed. \n\nChina, rather than military power, focuses on economic and political power, which the US has failed at for many years. \n\nChina owns a large amount of US land, including around military bases, controls precious mineral mines, lobbies and blackmails US lawmakers.\n\nGoing to war with the US would be bad for business.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Foreign_Ad_7504",
                            "body": "Interesting points to consider. \n\nAdding that they also own some 800+ billion of US debt. They keep the yuan roughly pegged to a fraction of the dollar for a few reasons. The global shell game continuing is in their own interest.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Wrathofsteel",
                            "body": "I think the mainland being involved would be the closest coming together. The left and right in the US would have since 9/11, probably best for a foreign power to avoid that, lol. \n\nCreate a society of psychopaths (x)\nand let them have guns (x)  /j lmao",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fluffy-Feeling4828",
            "body": "Denuclearization, *and* 50% less military spending? Depending on where that money goes, it could be Christmas in March.",
            "score": 6,
            "replies": [
                {
                    "author": "deathsnuggle",
                    "body": "It’ll go to Israel",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "GunkSlinger",
                    "body": "\\>Depending on where that money goes, it could be Christmas in March.\n\nIf it doesn't go back to the people it came from then it is going to the wrong place.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Fluffy-Feeling4828",
                            "body": "That would be the preference, yeah. Kinda why I said \"depending\".",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Midnight-Bake",
                    "body": "Pretty sure he said he wants to start discussing military and nuclear cuts once the middle east and Ukraine are \"sorted out\"... so I won't be holding my breath for the moment.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Fluffy-Feeling4828",
                            "body": "Fair",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BlacksmithSeaSmith",
            "body": "Nothing wrong with a backup plan. Problem nowadays is the fear porn",
            "score": 3,
            "replies": []
        },
        {
            "author": "WadeBronson",
            "body": "Lmaoooo",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vegetable_Steak_3063",
            "body": "you should had added some comments because this just look like prepper prepping for the worst like usual. their are reasonable prepping communites that prep for the worst but still try/hope to prevent the apocalypse.",
            "score": 2,
            "replies": [
                {
                    "author": "different_option101",
                    "body": "Good point. There were a few common sense comments that did get some upvotes, also a few common sense comments if you sort by controversial. The rest is TDS.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mountain-Snow7858",
            "body": "I know I’m going to get downvoted into oblivion here but I think that is an extremely unwise decision to make. The US nuclear deterrent is essential to the survival of the US and our allies. If anything we need to be modernizing and expanding our nuclear arsenal. Someone who is no threat today could be an enemy tomorrow.                                 Our nuclear arsenal is very much like the individual citizens that are armed to the teeth in preparation for anything; our military needs to be ready for anything. If anything expanding and modernization of our nuclear arsenal could very well allow us to cut down on conventional forces and shut down some of our overseas bases. Why would we need so many bases overseas when we could have a nuclear submarine armed with SLBMs patrolling off the coast of the same country?       Eisenhower did this during his administration and was able to cut the military budget because at the time nuclear weapons were cheaper to build and maintain than a massive conventional force of troops and tanks etc.       I don’t want war with Russia, China or North Korea or Iran at all, that is the last thing I want or the world needs but I don’t think we can trust them especially China and North Korea. Now is not the time to be reducing our nuclear arsenal, it is simply far too dangerous a time to do so. I also think that South Korea and Japan should build their own nuclear arsenal to help strengthen the nuclear umbrella that the US provides both countries. SK having a nuclear arsenal gives NK pause in doing something stupid and Japan having a nuclear deterrent gives NK and China time to think long and hard about what they are going to do. Are they going to start some shit or are they going to want to decide what to do peacefully?",
            "score": 2,
            "replies": [
                {
                    "author": "AgainstSlavers",
                    "body": "I agree.  I want all black budgets eliminated, but military should be cut less than social security and Medicare.  The overwhelming majority of spending is on those \"social programs\" which are as antisocial as can be.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "LoneHelldiver",
                            "body": "Porque no los dos?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "Ideally, government gets abolished entirely.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Southernboiiiiii",
            "body": "they're mad, because russia has nukes and the us doesn't if they go through with it",
            "score": 0,
            "replies": []
        },
        {
            "author": "IntentionCritical505",
            "body": "A bunch of links we can't click from a conspiracy theorist?",
            "score": -5,
            "replies": [
                {
                    "author": "Fluffy-Feeling4828",
                    "body": "If what's in question is his sources, nothing stops you from googling the title and publisher.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "IntentionCritical505",
                            "body": "This obfuscation is a method trolls use to lie. The effort-wall of having to type in the headline is too much for most.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "Fluffy-Feeling4828",
                                    "body": ".... Screenshoting a post.... With linked articles? This is also a thing people do to share things they've genuinely found, which is why any obfuscation method using it exists in the first place. If you have any *proof* that *this* is a troll, I might be interested in what you have to say. But otherwise, this could also just be a dude who doesn't know, or *care* about, what the share button does.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "IntentionCritical505",
                                            "body": ">This is also a thing people do to share things they've genuinely found, \n\nSo is posting a hyperlink to the original post on this very website.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "Fluffy-Feeling4828",
                                                    "body": "So not doing so means troll? Me thinks there's a leap in action.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "kurtu5",
                                                    "body": "Where have you been for the last decade?  People rarely post anything but an image anymore.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}