{
    "title": "Mandatory conscription exists in your country",
    "author": "LocalImpressive7530",
    "subreddit": "Anarcho_Capitalism",
    "rank": 14,
    "score": 66,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1j3q9qs/mandatory_conscription_exists_in_your_country/",
    "id": "1j3q9qs",
    "selftext": "You're just too innocent to believe they just couldn't change the law tomorrow and make you die for a war you don't care about. And don't think of escaping; they can remove your passports and force friendly countries to deport you one way or another.\n\nGiven this reality (and it is happening now in Ukraine, with male Ukrainians not getting their passport renewed), what would you do to prevent this to affect you? Double nationality? Living in a country that's enemy of yours, so that you can always escape by claiming refugee status?",
    "comments": [
        {
            "author": "jimmietwotanks26",
            "body": "Ever heard of “fragging”?",
            "score": 32,
            "replies": []
        },
        {
            "author": "kendoka-x",
            "body": "eventually they will have to give me live ammo.",
            "score": 31,
            "replies": [
                {
                    "author": "lone_jackyl",
                    "body": "There's a trick to this. Just buy it for yourself",
                    "score": 16,
                    "replies": [
                        {
                            "author": "kendoka-x",
                            "body": "yes, but then i don't get access to the key training infrastructure.  shooting random cop < Shooting training officer/NCO and showing the other conscripts it can be done.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PacoBedejo",
                    "body": "I spawned into the match with live ammo.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Referat-",
            "body": "U talking about the US? pretty sure they prosecuted like 2% of draft dodgers in Vietnam and gave up",
            "score": 24,
            "replies": [
                {
                    "author": "ProtonixPAC",
                    "body": "And Carter later pardoned them with Proclamation 4483.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ur_a_jerk",
                    "body": "now imagine if it was an actually big war, for survival. do you think dodgers would get off so easy?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "AgainstSlavers",
            "body": "Doug Casey has been telling everyone to get multiple passports for decades now.  He spends most of his time in Uruguay now because it has a weak government but not so weak that worse criminals take over.",
            "score": 6,
            "replies": [
                {
                    "author": "LocalImpressive7530",
                    "body": "I don't know about that person or about the strategy of multiple passports, can you elaborate? How does that solve the lack of renewal (Ukraine is not renewing passports)? Like, if your passport expires in 3 years, what do you do when that happens? No country would let you stay without one unless you have citizenship.\n\n\nAn idea I've had is getting a new citizenship before it expires, and abandoning the previous one. Not sure how feasible it is, but sounds good enough.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AgainstSlavers",
                            "body": "Passports have different utility for different countries. US is not that good because US supports israel, so American passport is banned in some countries. In general, the more passports, the better, but they are extremely expensive.  Visas are also difficult for long term, as you said.  You may have to become a nomad if you can't get residency status anywhere.  If you can't leave, you might have to die fighting your government or the war they force you into.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "LocalImpressive7530",
                                    "body": "I'm researching into the multiple passport thing, didn't think about it before. Thanks for the idea.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "golsol",
            "body": "If you're talking about America, most people are too fat or otherwise unhealthy to be useful to the Army. Conscription might get numbers up but won't create very useful soldiers.",
            "score": 7,
            "replies": [
                {
                    "author": "LocalImpressive7530",
                    "body": "I thought of cutting off my legs, but being obese is actually easier. Thanks for the idea.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Rollercoasterfixerer",
                            "body": "Just carry a gun, it’s way easier then cutting off your legs.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "goneskiing_42",
                    "body": "Be that as it may, when the military gets desperate enough they will take anyone they can get. Ultimately the only solution is one that we're fortunate enough in the US for which is the right of being armed. You can't press-gang someone who will shoot back.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mathaiser",
            "body": "Probably jump the border like they did during Vietnam… move through Mexico or Canada, Money to bitcoin, boat to and live in Thailand or Philippines",
            "score": 8,
            "replies": [
                {
                    "author": "LocalImpressive7530",
                    "body": "Comparing 1965 to 2025 is cute, as if states didn't grow massively since then.\nHow would you stay in Thailand without passport? They'd deport you on sight.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "mathaiser",
                            "body": "Claim refugee status?  Find a country that would accept that? Maybe make my way into Laos or Cambodia.  Hell, maybe I’ll just take a migrant boat into Europe and claim there.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "LocalImpressive7530",
                                    "body": "Yeah, refugee status is a solution, unless the country you reside in is friendly with the one prosecuting you.\n\n\nIf you escaped from US to UK during next American mandated conscription, the most likely scenario is that UK makes your life hell until they deport you because you don't have a valid passport anymore.\n\n\nEuropean Union is abandoning Ukrainian males to their luck, at best, and not giving them any refugee status.\n\n\nFor example, Poland or Germany are trying to remove welfare aid and state services for Ukrainian males that escaped Ukraine, which is literally the opposite of refugee status.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Numinae",
                                            "body": "Ofc they aren't being given refugee status; they're white. ",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "mathaiser",
                                            "body": "Yeah, I think Southeast Asia would be more accommodating.  Maybe somewhere in Peru or Argentina.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LocalImpressive7530",
                                                    "body": "I have to agree, unfortunately I dislike those countries (to reside in them), but they sound like the best for this purpose. Thanks.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jozi-k",
            "body": "Get second passport ASAP. As a side effects, it can save you during times like covid 😉",
            "score": 2,
            "replies": []
        },
        {
            "author": "harry_lawson",
            "body": "If it happens just develop an eating disorder, they all disqualify a person from service.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArtifactFan65",
            "body": "I don't even have enough money to pay rent so there's nothing I can do about it lmao.\n\nBut if I did I would just try to avoid the countries that are nearing a state of war or already have conscription obviously.\n\nAnd try to accumulate as much wealth as possible to defend myself with. Probably try to get passports in multiple countries across the world as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WishCapable3131",
            "body": "We have national legal weed, we just have to change the law. There is NO gun control, we just have to change the law. There is no income tax, we just have to change the law.",
            "score": 1,
            "replies": []
        },
        {
            "author": "2strokeYardSale",
            "body": "So far, their propaganda efforts have been enough to get gullible young men to volunteer for their wars. They won't need conscription again unless that fails.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlatAssembler",
            "body": "I think that, if the Croatian government calls me to join the military, I will accept that and kill myself with the gun they give me. Shooting yourself in the head is a fairly certain manner of suicide. You will probably wake up in some parallel universe where the war didn't even start, or at least hasn't affected your country. Quantum immortality is probably true, make use of it! I don't know whether you will live forever. There probably aren't infinitely many parallel universes, and perhaps a universe in which you will live for 200 years isn't possible. But a universe in which a war hasn't affected your country is certainly possible.",
            "score": 1,
            "replies": [
                {
                    "author": "LocalImpressive7530",
                    "body": "Thank you, never thought of this option.\n\n\nAs of now, I'm seriously considering swimming to the nearest abandoned island, becoming obese, cutting off my legs, preparing an attack to a lieutenant or higher rank, living in 9 countries for 5 years each to collect multiple citizenships, and quantum teleportation via headshot.\n\n\nAll funded by Bitcoin.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ejpusa",
            "body": "A 1 year mandatory service would help a lot of young people. As long as no one is shooting at you. Just the social media break would save them.\n\nIn my polling, GenZ was 100% on board. Them seemed far more enthusiastic than me. You learn basic life skills which people are missing out on glued to their iPhones.\n\n—- GPT\n\n\nAs of March 2025, several European countries maintain mandatory military service for young people. The specifics of conscription, including duration and eligibility, vary by country. Here’s an overview:\n\nCountries with Mandatory Military Service:\n\n\t1.\tAustria: All able-bodied male citizens up to 35 years old are required to serve six months in the military. Conscientious objectors can opt for nine months of civilian service.  ￼\n\n\t2.\tCyprus: All men are required to complete 14 months of military service.  \n\t\n3.\tDenmark: Conscription is mandatory for all physically fit men over the age of 18, with approximately 4,700 conscripts undergoing basic training annually. The government aims to increase this number to 5,000 per year.  ￼\n\n\t4.\tEstonia: Healthy men between the ages of 18 and 28 are required to serve 8 to 11 months in the military, depending on their education and position.  ￼\n\n\t5.\tFinland: All male citizens are obligated to serve either 6, 9, or 12 months in the military, depending on the specific duties assigned. Women may serve voluntarily.  ￼\n\n\t6.\tGreece: Mandatory military service of 12 months is enforced for all adult men.  ￼\n\n\t7.\tLatvia: Compulsory national defense service was reintroduced in 2023. Males born after January 1, 2004, are subject to mandatory service, while both males and females aged 18 to 27 can apply voluntarily. The service includes military and alternative (civil) options.  ￼\n\n\t8.\tLithuania: Military service affects men aged 19 to 26, who must complete a 9-month period.  ￼\n\n\t9.\tNorway: Employs a form of mandatory military service for both men and women. While many are called for examination, only those motivated are selected, resulting in about 8,000 to 10,000 conscripts annually.  ￼\n\n\t10.\tSweden: Military service was reintroduced in 2017 for both men and women, with conscripts serving 9 to 12 months.  ￼\n\nRecent Developments:\n\t\n•\tCroatia: Announced plans to reintroduce a two-month compulsory military service starting January 1, 2025, in response to regional tensions.  ￼\n\t\n•\tSerbia: Decided to reintroduce compulsory military service for men, 14 years after its abolition. The new program includes 60 days of training and 15 days of exercises, with service remaining voluntary for women.  ￼\n\nIt’s important to note that conscription policies can change based on political, social, and security considerations. For the most current information, consulting official government sources or recent publications is recommended.",
            "score": -1,
            "replies": []
        }
    ]
}