{
    "title": "Ukrainians are protesting Trump at an emergency rally in New York City today",
    "author": "carlanpsg",
    "subreddit": "Anarcho_Capitalism",
    "rank": 37,
    "score": 0,
    "upvote_ratio": 0.38,
    "num_comments (reported by reddit)": 32,
    "url": "https://v.redd.it/akh1eadmsrme1",
    "id": "1j3qw28",
    "selftext": "",
    "comments": [
        {
            "author": "GurlNxtDore",
            "body": "Did someone take up a collection for Ukraine at this rally? Or do they just want a blank check from taxpayers?",
            "score": 20,
            "replies": []
        },
        {
            "author": "AgainstSlavers",
            "body": "I see not all the USAID money has dried up yet.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Agitated-Can-3588",
            "body": "If every Ukrainian has to die so we can feel good about ourselves so be it.",
            "score": 28,
            "replies": [
                {
                    "author": "Ribblan",
                    "body": "Having seize fire is not really that hard, i mean ukraine could at any point just put down their gun and concede. But you have to ask yourself at what cost, Ukraine already fought in the past when they where under USSR to get their independence, they already gave away they nukes in trade for US, UK and Russian security assurance. And now 20 - 30 years later they are at it again still fighting for their indepence, now they have fought for 3 years, somewhat successful since putins plan was to take over ukraine in 3 weeks. They have now lost about 20% of their land, US demand a big part of their resources in trade for security from Russia. And the worst part, are that Trump hasnt discussed security yet, what will US do if Russia invades, trump as far as I know has not provided any formal obligations so far. So understandably ukraine is very worried, because unlike Trump, Ukraine dont trust Russia, and sees their word as meaningless. If russian words meant anything, the budapest memorandum with still hold, so their signature as far as zelensky sees it is worthless. What they need are backing from allies to escalate incase Russia decides to continue, and it needs to be from trusthworthy allies. I would also argue UK and US on some level also failed ukraine in 2014 when they didnt intervene when ukraine sovereignty was breached by russia, they should have escalated as they where justified in doing so, the budapest memorandum is clear on this.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Turban_Legend8985",
                            "body": "Russia can anytime get the fuck out of Ukraine.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ribblan",
                                    "body": "Yes, but they wont. The only thing reason they will get out of Ukraine is if its in Russias best interest. The only way we can make it their best interest is if its difficult for them to take Ukraine.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jupit3rle0",
            "body": "I hope they're marching towards LaGuardia for one way flights to Kiev!",
            "score": 28,
            "replies": [
                {
                    "author": "AgainstSlavers",
                    "body": "Ukrainian Foreign Legion is recruiting!  They can finally die for their cause.  What a rare opportunity we all should envy!",
                    "score": 10,
                    "replies": [
                        {
                            "author": "jstbcs",
                            "body": "before i started reading the comments I checked flights I dont see anything going into Ukraine from NYC, but I see flights real close to their eastern border for a hair under 600 bucks. They could all be on a flight within a few days. I'm sure they can take a bus from there, then the volunteer recruitment forces can pick them up in the city and take them to the front lines.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lone_jackyl",
            "body": "Gaggle of fools",
            "score": 12,
            "replies": []
        },
        {
            "author": "Cologio",
            "body": "Stand with Ukraine. While we sit here in comfort not fighting for our country",
            "score": 25,
            "replies": [
                {
                    "author": "Connect_Stay_137",
                    "body": "Cool if they want to keep fighting, but keep US taxes out of it",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Poway_Morongo",
            "body": "I see a lot of fresh conscripts",
            "score": 8,
            "replies": []
        },
        {
            "author": "Me_MeMaestro",
            "body": "Angry enough to comfortably protest, not angry enough to go fight, but sure as hell want some other people to go die for them",
            "score": 8,
            "replies": []
        },
        {
            "author": "Foot_Positive",
            "body": "The Ukraine milirary need to set up recruitment stands at these rallies.  They are running low of soldiers and would probably get a lot of new recruits here.",
            "score": 7,
            "replies": [
                {
                    "author": "ClimbRockSand",
                    "body": "not a single one there is willing nor able to fight for his or her purported beliefs.  anyone who was has already flown to ukraine and joined the foreign legion.  this is probably a USAID psyop.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Foot_Positive",
                            "body": "I was joking. It's only a way for them to virtue signal and feel like part of a group.  Am sure that if you set up a donation bad at the end of the rally probably wouldn't have more than a couple hundred $.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "ClimbRockSand",
                                    "body": "Probably even less than that.  I bet those people got paid to be there, and they're not letting any money go to anything other than destroying their lives with vices.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kagerou_werewolf",
            "body": "Here is the russo ukranian conflict in a nutshell\n\nso a bully has come and he is way stronger than you and he is going to take your lunch money no matter how hard you fight. Are you going to endlessly defend yourself or just give up the lunch money? Youre in an unwinnable position, checkmate in two, essentially. it would probably be easier to just give the bully what he wants even though it will hurt. But would you rather get the shit kicked out of you instead?",
            "score": 4,
            "replies": [
                {
                    "author": "ClimbRockSand",
                    "body": "worse than that; someone bigger told you to fight the bully and he's got your back but he kinda half asses it and then says \"nevermind.\" most of your family told you not to fight the bully because they're also cousins with the bully, but you force your family members to fight and die for something they didn't want anyway.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "kagerou_werewolf",
                            "body": "worse than that, instead of asking for brute force and firepower you ask for billions of dollars to \"fight the bully\" and dump it into your grade a colombian stash- i mean weapons factories and then the bully looks at the bigger guy and goes \"yeah idk wtf hes doing either\" and the bigger guy realizes its a circus act and leaves",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "00lalilulelo",
            "body": "Of course it's New York. Something something tunnel with blood and feces stained mattress. Pepperidge farm remembers.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Senior_Apartment_343",
            "body": "The comments show how people actually feel about Ukraine. The majority of Americans do not want to send any more $$$ to Walmart Putin. The majority feels the same way about Palestine . Uncomfortable I know but true",
            "score": 2,
            "replies": [
                {
                    "author": "ClimbRockSand",
                    "body": "Ukraine conflict was easily avoidable if the US had just stayed out of it.  Palestine is because the UN felt like it had authority to just tell palestinians \"hey sorry.  the jews just got holocausted so now they're coming to your land, and they'll have the support of Britain to murder you if you don't leave.\"  They are not comparable conflicts other than that the major western powers unnecessarily started them.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Senior_Apartment_343",
                            "body": "Why did Obama want war with Russia?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "carlanpsg",
            "body": "Pro-Ukraine protesters in NYC march to City Hall chanting “Stand With Ukraine” ahead of President Trump’s speech to Congress. Protesters demand U.S. support for Ukraine resumes",
            "score": 1,
            "replies": [
                {
                    "author": "AbatedOdin451",
                    "body": "No one is stopping them from sending their own money or aid packages or better yet, from going over and fighting for Ukraine. This is all for optics and feel good points. Not a single one of these people would miss a meal on behalf of Ukraine let alone shed blood for them",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "somecrazymetsfan",
            "body": "Do I want Putin to win FUCK NO he’s a tyrant. Unfortunately Ukraine doesn’t have the man power to regain the territory they lost. I just hope trump doesn’t totally bow down to him",
            "score": 1,
            "replies": []
        }
    ]
}