{
    "title": "iykyk",
    "author": "feir0x7",
    "subreddit": "cyberpunkgame",
    "rank": 2,
    "score": 12606,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 233,
    "url": "https://i.redd.it/g0xm3sjp9fpe1.jpeg",
    "id": "1je1jpf",
    "selftext": "",
    "comments": [
        {
            "author": "Gaburski",
            "body": "\"Listen, I know this'll sound insane, but-\"",
            "score": 1,
            "replies": [
                {
                    "author": "quirkyyhamster",
                    "body": "V and him would definitely get along \n\nIf they did it the first time, the 2nd time would surely be no different",
                    "score": 1,
                    "replies": [
                        {
                            "author": "thatonemoze",
                            "body": "because by the time V dies they’re literally turning into Johnny, as in their brain thinks like Johnny",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Platnun12",
                                    "body": "Is it bad I side with him to a degree. \n\nLike even during the game it was a slow turn to his side. \n\nI was going to go with Arasakas ex bodyguard but then Johnny started to grow on me after ALT. \n\nI felt genuinely bad for him in that moment and actually listened to him. \n\nI went into the dlc tho but never finished it entirely.\n\nI gotta do a replay honestly and go right to the end",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "thatonemoze",
                                            "body": "nah fuck arasaka and fuck the corps, johnny was insane but not wrong",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Platnun12",
                                                    "body": ">johnny was insane\n\nErratic but not insane. The actual insane people are the people like Arasaka and Smasher. Johnny is just the end result of the society they created. \n\nBlame not the freedom fighter for he was not responsible for the conditions he had to fight under",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "illy-chan",
                                                            "body": "Plus, you know, the whole child soldier thing. \n\nBorn in '88 - sent to the front in '03, poor SOB wasn't even old enough to have a driver's license. And then people are surprised he's completely screwed up.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Distinct-Pirate7359",
                                                                    "body": "He lied about his age to enlist, it’s not like he was forcefully conscripted",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Useful-Soup8161",
                                                                            "body": "It was 2003 it’s not like they couldn’t have figured out his actual age. They probably knew he wasn’t 18 and they just didn’t care.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Distinct-Pirate7359",
                                                                                    "body": "For sure, but it’s just as likely they didn’t know if he looked even slightly mature. Still happens to this day even in 1st world militaries",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Useful-Soup8161",
                                                                                            "body": "Hell my grandpa lied about his age to join WW2. He was 15 or 16. It’s not too surprising to me that they didn’t try to look into that in the 40s.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "illy-chan",
                                                                            "body": "Sure but 1) it's not like young teens are renown for fully considering long-term consequences and 2) no fucking way the adults looked at this 14-15 year old kid with all the tech and records at their disposal and believed him. Probably didn't even have a convincing ID for booze much less military enlistment. They just didn't give a shit about anything aside from more meat for the grinder.\n\nHe's right as an adult about how screwed up the military complex is.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Distinct-Pirate7359",
                                                                                    "body": "They don’t have to believe him, they just have to look the other way. Usually how it goes unless the enlistee has forged papers. That’s how a guy in my AIT cycle got kicked out",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "illy-chan",
                                                                                            "body": "Which is also extremely fucked up. Kids shouldn't be sent off to kill. War is awful anyway but allowing that stuff is still fucking evil.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "agentofmidgard",
                                                            "body": "Imma save this comment cuz it goes hard fr",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "blazingTommy",
                                                            "body": "We live in a society.\n\nBottom text.\n\n(Sorry for the lame meme joke)",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "VerySoftx",
                                                            "body": "Nah, Johnny is literally insane. He has cyberpsychosis and talks to his arm.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Then_Management_1976",
                                                            "body": "I’d disagree, Johnny is a cyberpsycho and a narcissist. He’s terrible to the people closest to him, Alt Kerry and rouge, is an addict and a terrorist who killed ‘innocent’ (no one’s truly innocent in night city) people in what amounted to a pretty unsubstantial and pretty much meaningless mission that if anything gave arasaka an even better position to extort and control night city. \n\nJohnny is your extreme anarchist, he takes all the worst traits of an anarchist and all the ‘moral’ ideology’s we have and melds them into one. Johnnys the epitome of correct message wrong messenger. The Johnny we interact with isn’t even his real self. He’s been softened a bit and has a less extreme fuck everyone and everything attitude, he tries to reconcile with Rouge and Kerry. Johnny isn’t supposed to be a ‘good guy’ in fact he’s arguably the stories greatest villain but because in the fucked up world of night city he’s more morally aligned with us in the real world we look past his glaring flaws and come to really like him. I mean he’s THE rockerboy and is Keanue how could we not fall in love with Johnny! But lets not forget Johnny tries to kill you and steal your body at the beginning, he tells you exactly who he is and what he’s about human life means nothing just collateral in the war against corps. \n\nEngram Johnny does slowly change but I’d argue that’s the relic assimilating Johnny’s personality to V’s brain and they are becoming more alike so Johnny starts to care as V takes on the characteristics of Johnnys only one true love: himself and it becomes harder to tell where Johnny ends and V begins. \n\nAlso he is just trying to manipulate you into either blowing up or at least fucking up arasaka. It’s not until the end of the main story that Johnny actually has a real conversation with you as a person not some puppet he can manipulate into joining his cause and continuing his fight so he didn’t die for nothing.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ProbablyYourITGuy",
                                                                    "body": "Everyone should try the suicide ending once.  It's cool hearing Johnny and V talk before it's over and getting to see that side of them, and very depressing seeing the video messages of the people you left behind.  I haven't done any of the other endings yet, but comparing the first few hours of knowing Johnny to the last few minutes were cool.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "ChloeB42",
                                                                    "body": "This, even in his faulty memories we live through where he believes he's the big hero who blew up Arasaka, that it was his OP that completely erased Morgan Blackhand's involvement AND Thompson's, he's still a complete fucking ass to people close to him. \n\nLike Johnny wasn't even going to go on that OP to bomb Arasaka initially, he only tagged along because he was going after Alt again. Yet the engram believes it was his idea, that he was Adam Smasher's biggest rival, that he somehow survived the encounter to get kidnapped by Arasaka \n\nHe only cares about him and what people can do for him. It's why V even mentions to Vic after reliving his memories they felt hatred towards Night City, everyone, and everything. \n\nHe's a broken clock, right about hating corpos and that's about it.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GodwynDi",
                                                                            "body": "Honestly, the game version of what happened is better than the authors.  Morgan Blackhand is a Gary Stu with plot armor.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ChloeB42",
                                                                                    "body": "I mean that's Solos in a nutshell, plus the fact Blackhand was Mike's character in play. \n\nI also have the theory that it was actually Morgan that Arasaka captured, soulkiller-ed and the memories edited to be Johnny, or somehow fused with Johnny via Alt. I know the game hints that he might still be out there, but the general consensus in the books and game is that he hasn't been seen since the bombing.\n\nIt's definitely a crackpot theory, but I like the idea. Especially because both CDPR and Mike agree that Johnny's and unreliable narrator \"at best\"",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "CAST-FIREBALLLLL",
                                                                            "body": "People latch onto his hatred of corps, and the fact he has no one to talk to, but V. Sure, you can be 'friends', but he's nothing more than what Alt became. Even he knows this, which Alt hints.\n\n\"Everything changes, you know this.\"\n\nThe more you trust him, the more you agree with him, the more you respond like him. That's the chip doing it's job.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Serier_Rialis",
                                                            "body": "Johnny was a straight up cyberpsycho, blamed the hand for some of the shit he did, like beating up Thompson.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Signupking5000",
                                                            "body": "A system made by diplomacy can be destroyed with deplomacy, a system made by force can only be destroyed by force.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Useful-Soup8161",
                                                            "body": "Johnny is a cyber psycho. It’s actually cannon.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ContentPizza",
                                                            "body": "no he is literally insane",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AdInevitable2377",
                                                    "body": "exactly, someone had to bring an end to arasaka, at least he DID something about it",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Eeeef_",
                                                    "body": "The most wrong thing about him was his methods, and the most wrong thing about them is that they ultimately weren’t effective at toppling corporatocracy.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "hotdiggitydooby",
                                                    "body": "Johnny did nothing wrong (in regards to corps, he did a ton wrong in every other aspect of his life)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Elrecoal19-0",
                                            "body": "Reminder: 1. His memories migjt be biased and even not be real so things might have gone worse than he remembers, making him look better and 2. V turns into Johnny as much as Johnny turns into V  by the end of the game, so that might be why he becomes more agreeable by the end.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Odok",
                                            "body": "Johnny ain't wrong, but the tragedy there is all his rage is meaningless. One man cannot change the world even with overwhelming violence. 'Saka got nuked and just came back all the stronger. Hell, it didn't even hit the zeitgeist. It's not some grand memory in the public's consciousness - nobody thinks about, it's just a thing that happened. All that hatred and pain and death and all Johnny got was a drink at the Afterlife.\n\nIs it worth sacrificing everything - **everything** - even your own soul, just to give God a black eye that'll heal by tomorrow? Does it make you feel better, getting to vent all that anger and scream at a city that doesn't give a shit? How is that any different than any other psycho?\n\nOr... you could let all that go. Try and live your best life in spite of all that. Give up on all these goals, your ideals, your \"legacy.\" Give up on Night City itself, because Night City will eat you alive in time. Is that selfish? Does fighting for yourself make you a bad person? Are you just letting the corpos win, after all that struggle?\n\nMaybe. Maybe it doesn't even matter. Maybe you're doomed to burn out, and the only control you really have is how bright you burn before the end. Doesn't matter. Eddies are low and your fixer just called. Time to do the dance, at least one more time. You can think about it more tomorrow. Just like you said yesterday.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "wildmoosey",
                                                    "body": "This is so poetic, you have beautiful writing. Poor man's gold 🥇",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "VerySoftx",
                                            "body": ">Is it bad I side with him to a degree.\n\nNo, that's kinda the whole point of his character. Johnny's beliefs are very relatable to the average person but his ideas on how to achieve those beliefs are insane and of a domestic terrorist. He can wildly charismatic in one mission, and a complete douche in the next. Johnny is the grayest of grays.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DaRealGrey",
                                            "body": "You can also do phantom liberty all the way through and not finish the game. That's what I did.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Single_Listen9819",
                                    "body": "I feel like Johnny would hate another Johnny",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Xythian208",
                                            "body": "If he just met someone just as much of an arsehole as him, sure. The way it happens with V though, looking from behind someone's eyes and watching them slowly come around to your point of view, plays exactly into Johnny's ego.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "cc88291008",
                                            "body": "Absolutely.\n\nImagine the same side of two magnets.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SagittaryX",
                                    "body": "Well not entirely, their minds are merging. V becomes more like Johnny, and Johnny becomes more like V.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ClockworkDreamz",
                                    "body": "Johnny would hate Johnny.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Riker1701NCC",
                                    "body": "But Johnny is also starting to think like V. As shown in one of the endings. As in you the player make him change",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BananaBread2602",
                            "body": "I wonder if the only reason that they got along was because of the mind colliding shit. So each of them could see each other’s memories, understand each other better and they were slowly turning into one another, essentially becoming the same person.\n\nNot sure if it would work without that part of the equation.\n\nSince Johny did start with hostility and only chilled down after he saw V’s memories and “changed his mind”",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Clever_Angel_PL",
                            "body": "relic's Johnny is heavily influenced by Blackhand memories so it's not that certain",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "coffin_birthday_cake",
                                    "body": "why even is that?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Clever_Angel_PL",
                                            "body": "lore reason? Johnny wanted to be cool, but wasn't as badass as Morgan, and being 50 years as a construct messes your memories up (and makes you forget what you experienced and what you dreamed of) - however one of the memories consists of what Blackhand experienced *after* Johnny's death. Also Johnny is actually Robert btw.\n\nreal reason? Johnny has a vastly richer character while Blackhand is cooler, so CDPR just combined them into one character this way",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "coffin_birthday_cake",
                                                    "body": "wait so, morgan blackhand exists in the game. and johnny was meshed into what morgan did in the lore/game books. does that just mean that morgan didnt do anything in arasaka tower, but since the 2077 game is canon, what does that mean for the 2020 lore?\n\ndoes the lore ever explicitly say that johnny was messed up with memories of morgan blackhands exploits? does the lore ever explain it? is it because his engram was at 84% that he believes these things?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Clever_Angel_PL",
                                                            "body": "I am not an expert, but Alt (in the game) definitely mentioned that Johnny isn't a reliable witness in nature, and can boast about things he didn't do.\n\nSo, it's still original lore friendly - it's not that Johnny did those things - it's just that Johnny claimed he did them so much, that he forgot about Blackhand existence, and started believing into his own lies, then transferring the warped memories onto V\n\nOne good example is an attack on the Arasaka tower - in the flashbacks, they organised a concert under it... but the Samurai band was broken down 10 years before that event.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "coffin_birthday_cake",
                                                                    "body": "i knew johnny was an unreliable narrator, but i guess i didnt factor that bleeding into memory as well...\n\nso cdpr blended morgan and johnny into one person for narrative reasons, but it wasnt really blending them and more that johnnys memories were corrupted because of the engrams lower integrity, that his mind was left to wander for 50 years with his delusions of grandeur, and because johnny would be more interesting that way?\n\ni didnt even realize the concert was under arasaka tower. i kind of thought it wasnt even a connected event and thought it was part of the 2020 reunion tour. the one with shirts of it in the game.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CMDR_kamikazze",
                    "body": "Johnny will have quite a time listening to V telling everything that happened with his chooms and how things unfolded in the end. Would need a couple of bottles of very strong tequila to handle all of this.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BananaBread2602",
            "body": "“Hey man.\n\nMe and your chatbot were big homies after you died, nice to finally meet you in person”",
            "score": 1,
            "replies": [
                {
                    "author": "vlad_kushner",
                    "body": "Johnny: shit, another of those annoying fans. Cant even go to hell in peace.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Extreme-Kitchen1637",
                            "body": "In the future ai husbando's will help you illegally download a car",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "drakoman",
                                    "body": "How often do people complain about your pfp? Because I am 😂",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AetherBytes",
                                            "body": "I hate you more for pointing it out, I'd have been fine if you didn't.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "kakucko101",
                                    "body": "you wouldnt download a car?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hellknightx",
                    "body": "\"So Arasaka made a copy of you, and it was basically my BFF.\"\n\n\"Kid, if you weren't already dead, I'd kill you myself. \"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Hupablom",
                            "body": "\"We destroyed Mikoshi and crippled Arasaka in the process.\"\n\n\"Nevermind, I love you\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Illjudgeyou665",
                                    "body": "Hmm I always wondered if johnny was a real person, would he hit on us",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hollow---",
                                            "body": "\"He's pulling his cock out!\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "GrayFarron",
                                                    "body": "https://i.redd.it/mg1jv9j9xhpe1.gif",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DietAccomplished4745",
                                            "body": "Well femV is 23 and not very smart while Johnny is a boy failure rockstar so their copulation is inevitable",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Livid_Compassion",
                                                    "body": "What makes V not smart?\n\nAlso are femV and mV different ages?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "DietAccomplished4745",
                                                            "body": "Have you played the videogame?\n\nEdit: also no they're both the same age. 23. The pl game director claims that was always the intention and it was internal miscommunication that gave them the wrong age originally.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Livid_Compassion",
                                                                    "body": "No I'm on a sub for a game I've never even heard of before... C'mon dawg. You made a claim, explain it. It's a game where the character acts how you choose they act. If the character is dumb in your game, I might have some bad news for you mate.\n\nI played a corpo femV. She regularly out shone others, poked holes in their shitty plans, came up with better plans, read wannabe players to filth, knew insider knowledge that gave her an upper hand, etc. Definitely didn't come off as stupid to me.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DietAccomplished4745",
                                                                            "body": "You can roleplay however you want. V still starts off the story as an ignorant and naive person that either falls to that ignorance and naivety or manages to gain enough understanding and knowledge to find a better way for the story to conclude. Just having fallen out of their previous life and hitching along with Jackies legend fantasy is a very ignorant thing. Cuz V is young and is still discovering himself/herself. \n\nThe stupidity stuff is more of a meme about all the terrible brain dead choices V is allowed to make during the game usually involving putting things into their head when they really shouldn't. I don't understand why you'd assume that having a dumb protagonist is a criticism. I love my dummy protagonist that got fucked over by life and makes the best of his/her bad situation while getting to know new people and learn about their lives",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Livid_Compassion",
                                                                                    "body": "On the matter of dumb choices, I can never bring myself to do that sketchy BD scav kidnapping mission. It's such an obvious bad idea and I never play that dumb of a V but it kills my completionist side so much! I wanna kill scavs but I'd never do the digital version of using some strangers needle to shoot up on their shitty couch lmao.\n\nAlso, I could agree on the naive bit to an extent. But I still don't think naive or ignorant equal dumb. But then we'd have to talk about the different types of intelligences. Technical intelligence, emotional intelligence, \"street smarts\", etc. It quickly becomes a huge discussion that I simply don't have the energy or expertise to get into.\n\nAnyway, sorry if I came off too combative. Hope you have a good day! And have fun playing however you like!",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "HospitalLazy1880",
                                            "body": "Yes. Yes, he would. He would me nothing by except sex but he would have.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Such-Dragonfruit3723",
                                                    "body": "What?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Mr_D_Stitch",
                                                            "body": "“He would me nothing by except sex but he would have.” Hope this helps.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Livid_Compassion",
                                                                    "body": "Dick 😂",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Illjudgeyou665",
                                                            "body": "https://preview.redd.it/fshdj56mthpe1.png?width=513&format=png&auto=webp&s=0b0b91839645523101edd17cda16000a4c3d5dbb",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "General_Hijalti",
                            "body": "\"In attacked Arasaka tower solo, killed Smasher, hooked Alt up to the tower to desroy Mikoshi and fry everyone. Also Hanako died at somepoint during the attack and Arasaka have retreated to Japan\".",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AHunkOfMeatyGlobs",
            "body": "Most bizarre realisation I had playing this game was that Johnny is just an AI and has never met V in his life.",
            "score": 1,
            "replies": [
                {
                    "author": "vlad_kushner",
                    "body": "Not even a identical copy. Its a broken version of him.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Gm24513",
                            "body": "Yeah it’s hard to say if even a single memory is correct.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "vlad_kushner",
                                    "body": "Johnny lie even in his memories.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "COGspartaN7",
                                            "body": "All Relic Johnny do is eat out hot girl and lie.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "vlad_kushner",
                                                    "body": "Or get fucked in the ass by a cop against his will lmao",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "RareResearch2076",
                                                            "body": "Wth?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "coffin_birthday_cake",
                                                                    "body": "river romance i assume",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "RareResearch2076",
                                                                            "body": "Oh. I turned him down. My V is pragmatic and doesn’t see the point in a romance when she’s terminal. Is it hinted River likes playing the back 9 or something?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "coffin_birthday_cake",
                                                                                    "body": "no idea, i never romanced him. i just know hes a cop and that johnny would definitely not want v doing the nasty with one",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "RareResearch2076",
                                                                                            "body": "gotcha",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "illy-chan",
                                    "body": "The last word to Kerry was true. Plus it's not like normal living people can't have their memories fail - take it from someone with ADHD that sometimes gives me *false* memories (always a fun time). \n\nI think people are a bit too quick to assume things are black and white with engrams, I get the impression that it's purposely very muddy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Gm24513",
                                            "body": "Everyone has false memories. It feels more like the old folks getting sad he’s so pathetic now and just going along with it.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Livid_Compassion",
                                            "body": "Hell people don't even need ADHD or any other psychological impairments or something to have their memories fail or even be manipulated by others.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "illy-chan",
                                                    "body": "I meant more that my brain just randomly spawns \"memories\" from no where. Like to assume it doesn't make me less of a real me. \n\nSome of the arguments I see discounting Relic Johnny's alleged personhood tend to not take into account that a lot of totally normal irl humans gave all sorts of memory stuff wrong too. Which, aside from dodging the question of \"what makes someone a person\" kinda rubs me the wrong way to use logic that'd dismiss humans irl.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "_Diggus_Bickus_",
                            "body": "To be fair og Johnny is broken",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BIaidde",
                    "body": "It's a little weird cause they specifically state that they would transfer his \"consciousness\" which implies the opposite",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FeralTribble",
                            "body": "Perhaps it’s in universe Layman’s terms?\n\nLike “transfer Johnnys consciousness” sounds alot easier to swallow than\n\n“Ripped apart by an advanced AI and reconstructed into a digital AI construct and uploaded to a special server to be downloaded to a special chip which allows a user to interact with said AI personality.”",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aduckonquack97",
                                    "body": "I think people get caught up in whether it’s *”actually”* him or not. To me, the way the game answers this question is not “He is just an AI and you’re being fooled into thinking this is the real Johnny.” Rather, (Relic) Johnny directly establishes that it does not matter whatsoever if he is the “real” Johnny. Relic Johnny is here now, with desires, emotions, room for growth, etc. \n\nWhether or not he is the original Johnny is irrelevant to the discourse in the game. What matters is that the Johnny in your head is a real person, even if it’s a copy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "blazingTommy",
                                            "body": "I feel that Johnny, V and Relic Johnny would meet in the afterlife if souls were real. Like, same with Saburo, the moment he takes over Yorinobu, he'd be a new soul, not the same exact Saburo than before.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "-HumanMachine-",
                                                    "body": "Depending on your ending there might be two V's; Real V and post-Soulkiller V",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "wareagle3000",
                                                            "body": "There's a reason we had that sudden cutscene when V died.  You're basically playing a walking meat puppet for the entire game.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "OtherwiseRabbits",
                                            "body": "> Whether or not he is the original Johnny is irrelevant to the discourse in the game.\n\nNo, that *is* the discourse.\n\nIt's the Star Trek teleporter question, if your physical body is torn down and rebuilt after going through it then is it still you on the other side. \n\nThe relic is a rebuilt Johnny, the whole theme of the game is resurrection. The regular Jesus imagery, the ghostly unfinished business, the *bar named Afterlife...*\n\nThe philosophical question is whether something exists beyond whatever incarnation we occupy, if that soul does exist then what is it bound to? A body?  A person?\n\nRelic Johnny being a person independent or otherwise is an answer to this discourse, not in disregard of it. That answer which just creates more questions about what constitutes sentience, and if ChatGPT can mimic conversation and easily pass the Turing Test then does it earn the same respect as a living being.\n\nThe whole culture of Cyberpunk is putting low value on your fleshy components, yet that contrasts hard with the idea of your person only exisiting within them.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Aduckonquack97",
                                                    "body": "I don’t disagree, but while the game poses the question, I don’t think it bothers to answer it one way or another—and that’s actually the genius of it.\n\nV has a conversation with monks about whether the engram is a copy or an actual digitized soul. When V asks Johnny what he thinks he is Johnny replies, “What difference does it make? You heard him. I’m trapped in a few lines of code… and your body.”\n\nV: “Maybe Johnny Silverhand is dead. Maybe you’re just a…”\n\nJohnny: “What, imitation? That what you wanted to say? If the real Johnny Silverhand is dead then that’s his problem, not mine.”\n\nTo me, the interesting thing about this theme is *not* that it raises the question and answers it one way or another, but that it actually pushes it to the side in favor of perceiving the relic as fundamentally alive and human *regardless* of whether it is the original person or not. \n\nThroughout the entire game, we grow attached to a virtual program, watch “it” grow, seek and achieve revenge/retribution/forgiveness, experience an array of emotions, form strong opinions based on surroundings, etc. All of these things are distinct to personhood and being alive.\n\nMy main gripe is not with your interpretation, but with people reducing the idea that the Relic is not the original Johnny Silverhand and by that very fact arguing he is not alive whatsoever.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Description_Narrow",
                                    "body": "If you have watched invincible its like the smasher twins. It is you in everything that matters. But your current self continues as is. It's worded this way so for old man arasaka can sell the concept. \"You're going to die but you'll also have a twin that has your memories will continue regardless\" probably won't sell, and the people who buy it and use it won't ever know the difference.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Elennoko",
                                            "body": "Honestly kinda like SOMA to a degree too. \"It isn't actually you, just a perfect mental copy of you.\" Just it has less existential dread than SOMA.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Mundane-Sir-7483",
                                                    "body": "One thing nobody seems to talk about is that the same thing happens when you grow up or age, nearly everything about you changes in that process literally every molecule is replaced it's almost like the old version died and you just think that you're him because of your memories.\nThere are certain things that definitely carry over but they aren't actual things and just having similar traits doesn't make you YOU because we know that creating an exact copy isn't enough to transfer your pov(probably) to that thing so it's definitely not about the traits.\nContinuity seems to be an illusion.\n\nAs technology advances, we finally have to face these questions because when we get advanced enough, we will change things about our bodies and brains.\nAnd I think the key to these questions lies in growing up, whether if it's the same thing as creating a copy and if the old one actually dies in growing up too(the younger version of you).\n\nWe also have to figure out what death even is because it seems like nothingness isn't exactly a thing and what we call ourselves is the world becoming aware of itself so when everything is the world you don't really die you never even existed in the first place, it's all just the world",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "FoxReeor",
                                                            "body": "What you are describing with aging boils down to the problem of The Ship of Theseus. The continuity itself is the consciousness (atleast in my opinion). The moment that continuity ends (aka the complete shutdown of the brain) \"you\" stops to exist.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "wareagle3000",
                                                                    "body": "My favorite thought experiment.  Working IT I got to experience it.  I've replaced every last piece to a desk space and the problem still persists.  If at this point I have a totally new workstation after every piece has been changed then what the hell is the problem other than ghosts?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Mundane-Sir-7483",
                                                                    "body": "What consciousness is seems to be very very complicated. but my favorite explanation is that it is the ability to integrate information and the illusion of continuity, introduces consistency in that ability",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "samurairaccoon",
                                                                    "body": ">The moment that continuity ends (aka the complete shutdown of the brain)\n\nWhat about sleep? Like those moments in between falling asleep and dreaming. Where's the continuity there? Hell for that matter what about dreamless unconsciousness like when you go under anesthesia? Does everyone who gets an operation have to confront their existential dread now?! Augh! *Help*",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "FoxReeor",
                                                                            "body": "Your brain doesn't shut down when you sleep, it enters a \"rest\" state. Basically battery save mode so it doesn't siphon away the energy from the body as it heals/recovers",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "samurairaccoon",
                                                                                    "body": "Yes, but what is the difference between being \"off\" and being at \"rest\"? If in both instances you have no continuity of consciousness? In what meaningful way is your consciousness continued? Just because the vessel its housed in doesn't cease function that has no bearing. You can copy a consciousness between two systems that never shut off, but you can definitely say that the continuity has been interrupted. \n\nAlso, what about people that are clinically dead, but are then brought back to life?\n\nAnd you never touched on unconsciousness from anesthesia. That isn't your brain at rest, you aren't sleeping and going through your bodies natural healing cycle. The anesthesia has just suspended your ability to be awake.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Mundane-Sir-7483",
                                                                            "body": "Also consciousness isn't exactly IN THE BRAIN there is no one part of the brain that causes consciousness it's different parts working together to produce a narrative, so you can't view the brain as this ONE thing that creates consciousness, it like your body is constantly changing and replacing parts of it, everything we do is change it causes change in us, death is just a big change that's why it feels like a big deal in reality we probably die many times, only thing giving us the feeling of being ourselves is that illusion of continuous existence of being one thing when in reality we are not like that at all",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "samurairaccoon",
                                                                                    "body": ">when in reality we are not like that at all\n\nThat's not the first time I've heard someone philosophizing that we aren't actually anything like we think we are. The human experience is more like a collective illusion that we are all sharing in because it was beneficial to the species.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "WasabiSunshine",
                                            "body": "> It is you in everything that matters.\n\nWell, except for basically the only thing that matters for me, consciousness",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ReptAIien",
                                                    "body": "In that case it shouldn't matter, since that's literally all it is. It's your consciousness.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "wareagle3000",
                                            "body": "In a way you do live!  The clone you.  From the clone you's perspective they are you and did cheat death.  Their memories go from past to future.  In reality they were \"just born\".  It's like moving a hard drive to another exact copy computer.  From the computer's perspective nothing has changed.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Tuaterstar",
                                    "body": "The Arasaka marketing team likely boiled it down to that for the sake of getting people to actually want to do it. \nIf I was a millionaire and was told “hey we can make you live* forever cause we can make an AI dissect and figure out exactly how your brain works and upload it into a chip which may get slotted into a coma patient half your age.” \nI don’t think they would get my money. We see advertising for the soul Killer prior to the mission with it, meaning they did plan to sell it to the general public soon.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "wareagle3000",
                                            "body": "To me it was also likely something they developed in R&D followed by marketing running to the bank with the idea.  It's really hard to work with an AI that knows it is an AI when you want it to act human.  So before you use the soul killer instruct the subject that the device is going to move their soul and consciousness to the device.  The very first thing the AI is instructed is that, \"I have had my soul and consciousness moved to a machine, I am still me\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "wareagle3000",
                                    "body": "Might be to help the AI process the whole arrangement.  You don't want to start off with an AI that immediately thinks and knows it's an AI.  Lie to it and tell it it crossed over to the digital hellscape.  It's kinda what we do with AI currently anyway.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "djc23o6",
                            "body": "I think the transferring “consciousness” is just something saburo is using to lie to himself. This isn’t going to save him or anyone else from dying but “uploading your memories into an AI that will pretty much be you but the real you will die” sounds a lot less favorable to him and the target demographic for the relics",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SirButcher",
                                    "body": "The good ol' transporter problem.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "djc23o6",
                                            "body": "Beam me up Johnny",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Flik-Is-Best-Ant",
                            "body": "Queue SOMA the VIDEO GAME!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hellknightx",
                                    "body": "It's SOMA, but with slightly less existential dread.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Daan_aerts",
                            "body": "When they say ‘transfer’ they meant copy and put into the chip, technically his original consciousness is long gone",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "auraseer",
                            "body": "They say elsewhere that it's a copy of the consciousness. For example in one of the side jobs, a target plans to use the Relic to make a backup copy of a living person.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AHunkOfMeatyGlobs",
                            "body": "Alt does explain that it is a copy and also how you will die if you accept Johnny's plan",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Saikotsu",
                            "body": "A major element of the cyberpunk genre is tackling the question of \"what makes a human.\" The idea behind engrams is tied to that theme, because you have to wonder, is it Johnny's consciousness? Is it his soul? Or is it a realistic AI built using his data? And regardless of which answer you come to, is it Johnny? If you copy someone's personality and memories and skills and put them on a chip and that chip in a new body, is it still that person? Or someone new? \n\nIt's the Ship of Theseus essentially. If I replace all my limbs with chrome and download my mind onto a chip and put that chip in a cyber brain, am I still me? If not, at what point am I no longer myself?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MinimumApricot365",
                            "body": "Not transfer, copy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "FLYK3N",
                            "body": "It's kind of like the same situation with teleportation paradox. All your atoms and cells are dissolved in the initial location and reconstructed exactly and perfectly as you're brought into point B, with the same thoughts, appearance and memories. Is it really you or are you just now a copy of the original?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Mundane-Clothes-2065",
                            "body": "And Tesla will release FSD in 2020, yet here we are. Cyberpunk stretches corporate greed to the max. If they could tell you they created god and you need $5 subscription to meet with god, they would.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Russian_Spy_7_5_0",
                            "body": "We know it's a copy because Saburo was copied. Saburo was still alive with a backup self copy still around. After he died and (ending dependent) gets his consciousness uploaded to Yorinobu.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ultimattt",
                            "body": "But they also subjected him to “soul killer” which quite literally sounds like his soul is dead and gone.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Renard_Fou",
                    "body": "Ngl if I wanted to ponder whenever a perfect AI replica really is a person, I would just play SOMA",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "surelynotjimcarey",
                    "body": "I had this epiphany a little bit ago so I thought long and heard about it. \n\nI realized it’s not true during (don’t) fear the reaper. When V, alt, and Johnny are all digitized (I forget the lore words) and the three of you decide who gets V’s body, V is in that digital world making decisions with Johnny and Alt. Because of this, I decided this is V’s true consciousness and not a copy. Therefore when you’re talking to Johnny and Alt in that same space, I think that is also their true consciousness and not just a copy. 99% of my play through I believed Johnny was a chatbot, until that decision.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pocketjacks",
                    "body": "And the Johnny in Vs head is a construct that could have been edited by Arasaka.  He's an unreliable narrator, especially if you consider the original canon story of the Arasaka Tower job.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Leading_Business534",
                    "body": "Even the V we play past the eist in not V it's just an ai that tried to tied back the pieces of V brain back together",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "_Diggus_Bickus_",
                    "body": "Reading through these comments, I'm learning that I'm one of the only people who figured soulkiller blurred the line so thoroughly it's not obvious that wasn't Johnny. They pretty explicitly say transfer consciousness. \n\nLike I figured it was left as an intentionally vague unanswered question as a thought experiment on transhumanism.\n\nBut I guess the opinion is \"nope it's a program lol\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Drewelite",
                    "body": "Well you could say you're a new person every time you wake up. You're just very similar to the one that fell asleep.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hardcore_Daddy",
                    "body": "He talks about how dying felt, though it was left a bit ambiguous if that was his death or yours",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Majestic_Bierd",
            "body": "You just KNOW the real Johnny would call the relic Johnny a \"cheap Saka copy\" and how it \"was soft\" and \"a pale imitation\"",
            "score": 1,
            "replies": [
                {
                    "author": "unwittingprotagonist",
                    "body": "\"Except for the impressive cock.  That was real.\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NotACatfish",
                            "body": "I can hear that in his voice.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ok_Koala9722",
                                    "body": "This doesn't make my mistake of thinking this was Johnny Gat at first any easier to dismiss.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Houtaku",
            "body": "Just start out with ‘Hey, Johnny. Want to hear a story about yourself that you don’t know?’\n\nMan’s egotistical AF. Of course he does.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScreechingPenguin",
            "body": "Johnny: This my house, entry please!",
            "score": 1,
            "replies": []
        },
        {
            "author": "NOIRQUANTUM",
            "body": "Spoiler ahead for people who haven't gone over Cyberpunk RED or played the Black Dog \n\n>!The real Johnny Silverhand might be alive in 2077. His body was recovered from the AHQ wreckage and it was transported to Los Alamos Lab in New Mexico. A mysterious techie known as Angel, widely theorized to be the real Alt Cunningham, receives the body in a cryo pod and says, \"Hello, my love\" !<\n\n>!This is a universe where immortality is possible through a variety of different ways so it makes sense for the real Johnny Silverhand to be alive.!<\n\n  \nOne of the many things I love about Mike Pondsmith's cyberpunk universe: the very rich and deep lore.",
            "score": 1,
            "replies": [
                {
                    "author": "AnotherNobody1308",
                    "body": "I don't believe this as we all know Johnny would crawl back to Arasaka to nuke it again",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NOIRQUANTUM",
                            "body": "1.) Cyberpunk RED was written by Mike Pondsmith, the creator of the Cyberpunk universe, he was the same man who created Johnny. \n\n2.) In 2023, it wasn't even Johnny with the nuke nor it was his job to nuke it. In the AHQ attack, Johnny's team was supposed to to infiltrate the Soulkiller laboratories on the 120th floor in order to retrieve Alt Cunningham, who was trapped inside the Arasaka network, and destroy Soulkiller 3.0. There were 2 other teams involved. The second team was supposed to reach the Reliquary Database located in the subbasement, where the Arasaka Command Center was currently located, and to either retrieve the data or destroy it. The goal was to render the database project unusable for the rival corp by using a tactical nuclear device. The third team -which was led by Morgan Blackhand- was to act as fire support, reinforcement, and rescue if needed.\n\nin 2077, it was well established that Johnny's memories aren't even accurate nor they're his.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "excaliburxvii",
                                    "body": "I bet the original plan for 2077 was to allow the player to take a path that would've led to any of those three ~~paths~~ outcomes. I remember Morgan Blackhand and Johnny Silverhand being options for your \"hero inspiration\" or something like that in one of the demos.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SirEdwardRaziq",
                            "body": "Second this",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Useful-Soup8161",
                            "body": "It’s cannon whether you believe it or not. There’s a lot of information about this world that’s not in the video game.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Johnychrist97",
                    "body": "I doubt Johnny is still alive, no way we get Blackhand AND Silverhand alive after the Arasaka job. We'll probably be lucky to get one of the two to be confirmed alive",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Useful-Soup8161",
                            "body": "We don’t know if Johnny is actually alive but some chick named Angel did get ahold of his body. What she ended up doing with it is still unknown.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "NOIRQUANTUM",
                            "body": "The fate between Silverhand's corpse and Angel(Alt) were left ambiguous at the end of the Black Dog Story line in the 2040s. We can assume that there is more to the story. keep in mind, Alt invested heavily on human cloning. \n\nMike Pondsmith himself confirmed Morgan is alive. He said that he's working on a story for Morgan Blackhand on what he was doing since the ending of the 4th corporate war. He dropped hints like Morgan lost a lot of weight, stating he doesn't work for the corps anymore. Also said that he was with more cyberware. \n\n[https://www.reddit.com/r/LowSodiumCyberpunk/comments/zhd3iq/comment/izypjgt/?context=3&utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/LowSodiumCyberpunk/comments/zhd3iq/comment/izypjgt/?context=3&utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) \n\n[https://www.reddit.com/r/LowSodiumCyberpunk/comments/zhd3iq/comment/izzp6y2/?context=3&utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/LowSodiumCyberpunk/comments/zhd3iq/comment/izzp6y2/?context=3&utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "davidtwk",
                    "body": "Was that Angel a guy too 😂 iykyk",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NOIRQUANTUM",
                            "body": "LMAO, no. A different Angel. Boy, the video game was something else during launch.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OneSaltyStoat",
                            "body": "*crickets*",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Goose5342",
                                    "body": "Nah, I got a chuckle lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shreddlykroger",
                    "body": "where are yall getting this from? theTTRPG? like i know there’s a wiki, but where do you find all this type of  lore and stuff?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NOIRQUANTUM",
                            "body": "TTRPG from the Cyberpunk RED corebook.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Hupablom",
                            "body": "No it doesn't. They are explicitly set in the same timeline, as has been confirmed multiple times by RTG and CDPR",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Actual_Echidna2336",
                                    "body": "Well that's good to know, thanks",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SirBeefWell",
            "body": "This seems kind of depressing? It'd be like reuniting with a life-long friend but only one of you remembers everything. Especially for V, it'd be like coming to terms with the possibility the Johnny they knew was nothing more than a replication of the real person; a genuine bond formed with a fake person. All V could do is reminisce of a Johnny that only exists in their head (literally and metaphorically). \n\n'Course, it's all up to perspective. The engram Johnny could very well be considered his own person but the idea seems depressing. Ignoring that the meme says both are in hell :P",
            "score": 1,
            "replies": [
                {
                    "author": "TheBlueEmerald1",
                    "body": "Considering most of the endings, AI Johnny might take a long time to die ehat with being merged with the computers and all.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "South-Cod-5051",
            "body": "technically, that's true, Johnny has never met V in his life because he was long dead before V was even born.\n\nSince the engram is simple data copy, it doesn't have a soul, so Johnny in hell would have no ideea who V is.",
            "score": 1,
            "replies": [
                {
                    "author": "ADAMracecarDRIVER",
                    "body": "Almost like they killed it or something.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TectonicTechnomancer",
                            "body": "Almost like his soul was destroyed, like, with some sort of software, that kills souls, may be relevant in the lore.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CocoaMonstee",
                                    "body": "So theoretically that means there isn’t even a Johnny **IN** Hell. The only remnants of his soul are the engram taking over V",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TectonicTechnomancer",
                                            "body": "The Christians don't see the soul as something that can be killed off or shattered, The soul is you, and the body is a vehicle you drive around the world of the living until you leave it to go somewhere else, Soulkiller is some pagan shit, pure marketing. In Christian mythology Johnny's soul is 100% in hell, V is a more complicated case, because they get slowly erased, and the bible doesn't cover that scenario, I guess V ends up as a blank empty soul in a vegetative state, and the body ends in control of the Engram AI, which just thinks its Johnny.\n\nBut in Cyberpunk, i guess Johnny goes straight to the void since he becomes soulless.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Glitchmaster88",
                            "body": "Say that again",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Amerakee",
                    "body": "Spoilers ahead if anyone here somehow hasn't played yet. \n\nTechnically, V wouldn't know Johnny either. When Dex shoots you in the head, V dies. Soul killer rips a copy of V into an Engram, which is why the original engram on the chip of Johnny responds the way it does and is trying to overright the new data.\n\nV and Johnny are both Engrams on the same chip.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "anderskants",
            "body": "Even funnier if it's fem V 😆",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDaemonair",
            "body": "I just like the fact that OP believes that V and Johnny are both going nowhere else but hell.",
            "score": 1,
            "replies": [
                {
                    "author": "Notagamedeveloper112",
                    "body": "One nuked an inner city area and the other killed as many as a nuke",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CAST-FIREBALLLLL",
                            "body": "My V hasn't killed anyone. Pacifist playthrough ftw!\n\n![gif](giphy|9Q249Qsl5cfLi)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Trandoshan-Tickler",
                                    "body": "My V didn't kill anyone either.  They all just fell on her sword.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "hellomydudes_95",
                                    "body": "V didn't kill anyone. The bullets and the electricity did.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Xechwill",
                    "body": "\"Fun fact! According to traditional Christain doctrine, <V> is going to burn in hell\"\n\n - Skippy",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Useful-Soup8161",
                            "body": "Unless you choose puppy loving pacifist.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HammyBoy0",
                    "body": "With the amount of bodies they stack up by the end of the story, yeah probably.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "VelvetAurora45",
            "body": "I mean he died getting his brain scrambled into an engram, the idea wouldn't be far fetched if he remembers that happening",
            "score": 1,
            "replies": [
                {
                    "author": "Useful-Soup8161",
                    "body": "What he remembers isn’t what happened though. Soul killer isn’t even what killed him. He actually died when Smasher shotgunned him.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "VelvetAurora45",
                            "body": "OOh yeah you're right, I forgot the whole unreliable narrator thing",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Appropriate_Golf2558",
            "body": "All V would have to say is that they shot up Arasaka and Johnny would be chill",
            "score": 1,
            "replies": []
        },
        {
            "author": "izwald88",
            "body": "That's the whole thing about the mind uploading. \n\nIt might be the closest humanity can ever come to immortality, but it will never be anything more than either a copy and paste or a cut and paste.",
            "score": 1,
            "replies": [
                {
                    "author": "ForeHand101",
                    "body": "Ship of Theseus, but with the human mind. \n\nThe scary part about soulkiller is that it destroys the original \"ship\" in the process of creating the new one. Because of that, you can never compare the two versions directly.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bress196912",
            "body": "V went through hell n back for Johnny just for him to hit em with the \"who r u\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "PresentAd8823",
            "body": "That deserves like 20k upvote, one of the most brilliant and hilarous meme I've ever seen about the game 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "Such-Classroom-1559",
            "body": "its the whole star trek teleportation-discours again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wyyan200",
            "body": "I bet with enough time (they are in hell afterall) V could convince Johnny about literally everything since V knows Johnny's story by then",
            "score": 1,
            "replies": []
        },
        {
            "author": "an_agreeing_dothraki",
            "body": "expectation:  aiBackup(consciousness &you)  \nreality: aiBackup (consciousness you)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Salt_Issue6268",
            "body": "Serious question, know it's called soulkiller, but, using the Christian velief system bc ots the only one I really know, theoretically, does Johnny's soul exist in the engram, is he in the afterlife (not the bar), seperate from the engram?. And backup question, if V were to turn to Johnny fully, then died, should the soul in the afterlife be the original V prior to the Plaza heist, or the new form?",
            "score": 1,
            "replies": [
                {
                    "author": "TectonicTechnomancer",
                    "body": "using Christian logic Johnny is in eternal suffering for his sins, and the Engram is a copy of silverhand without a soul which slowly kills V soul leaving them as a soulless husk at the end, so basically:   \nJohhny: Hell.   \nV: Neither heaven or hell, the bible doesn't have a clear destiny for the soulless, you can say purgatory, but that is for soul purification, few are the people who believe in the ultimate destruction of the soul or the void, V can also end up in the Abyss, and empty boundless prison, kinda like a Maximum Security purgatory.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PurplePoisonCB",
            "body": "Would the Johnny in V’s head get to go too?",
            "score": 1,
            "replies": []
        },
        {
            "author": "majora11f",
            "body": "If we let Johnny take over would he be meeting himself?",
            "score": 1,
            "replies": [
                {
                    "author": "izuuubito",
                    "body": "Seriously. If souls are a thing how do brain conditions affect them? Whether its relic or something possible IRL like dementia",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ressque",
            "body": "Spoilers!!!****\n\nLet's not forget that Johnny is not actually the one responsible for all the death at Arasaka. It's revealed in a memo pad and terminal Johnny thought the building was evacuated and Arasaka that deliberately left it chalk full of people because they knew what the kind of press it would bring. It makes perfect sense when you realize that they lost essentially nothing because of it and in fact played the victim card to their advantage for decades to come.",
            "score": 1,
            "replies": []
        },
        {
            "author": "XxJackGriffinxX",
            "body": "V, johnny AND engram johnny",
            "score": 1,
            "replies": []
        },
        {
            "author": "WrappedInChrome",
            "body": "Not to mention how far diverged V's head Johnny would be from the real one by that point.  Influenced by both V's brain and experiences... the real Johnny would be completely different.",
            "score": 1,
            "replies": []
        },
        {
            "author": "weellyy1",
            "body": "Might be the most clever meme about cyberpunk out there, well done",
            "score": 1,
            "replies": []
        },
        {
            "author": "Will_ennium",
            "body": "Lol that would probably be devastating for V. Not just because he wouldn't know him but because Johnny's whole character arc where he comes to terms with how scummy he treated people close to him and tries to somewhat better himself doesn't take place, so the \"actual\" Johnny is probably still a completely self absorbed asshole.",
            "score": 1,
            "replies": []
        },
        {
            "author": "S10Galaxy2",
            "body": "This actually presents a unique religious question. If heaven and hell exist in the cyberpunk universe, and I mean legitimate biblical heaven and hell and not just a digital afterlife, then what does that mean for Johnie’s soul? Was the digital construct just a machine and the real Johnie’s soul passed on to the afterlife? Or did Johnie’s soul get taken out by soul ripper and his soul lived on as a machine? \n\nMabye it’s both and the machine is a piece of Johnie’s soul while the other half died and passed on. What would that mean for V though? If V goes with Alt at the end of the game does Vs soul dies and Johnie’s soulless ai inhabits his body? Or if Johnie’s ai has a soul does it replace V’s? Maybe it mixes both their souls or does johny simply inherit V’s soul and lives in V’s body with Johnie’s mind and the soul of someone else. \n\nNo matter what I have a feeling the real Johnny would chalk it up to a confusing cluster fuck of philosophy and try to forget about it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StewartConan",
            "body": "I thought the V and Johnny of Kpop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DismalMode7",
            "body": "that's a good point since many people still don't understand V doesn't interact with the true johnny but only with an AI mimic johnny personality",
            "score": 1,
            "replies": []
        },
        {
            "author": "ContributionOne2343",
            "body": "I meant technically, this is true. If you believe in the concept of a soul, then you’ll know that the real Johnny was already gone, and we were just talking to a literal digital copy, a perfect copy of him, but that’s all he was, a perfect digital copy that sounded like him, responded like him, looked like him, but I was never him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PaxUX",
            "body": "Jonny is literally an AI program in Vs head telling him to kill arasaka 🤣 \n\nCan't want to see what OpenAI and ChatGPT get up to",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational_Term_436",
            "body": "This always bother me it does \n\nThey explain that Johnny consciousness got download into the relic, meaning the johnny sliverhand that died infront of the corpos is also same one in V head hence ending when he can have the body \n\nBut also there’s many other things unaccount for",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlakyRazzmatazz5",
            "body": "Nah my V isn't dead the Aledcados will help him!",
            "score": 1,
            "replies": []
        },
        {
            "author": "that_one_shark",
            "body": "to be fair, the engram literally fused with Vs mind, so i think the johnny in the engram would still be with V, even if the real Johnny isnt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PlusDays",
            "body": " This got me remembering Simon’s speech in SOMA when he took the elevator down into the abyss.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Z3R0Diro",
            "body": "V would just need to start spilling out all of Johnny's secrets and thoughts.\n\nBro will be dumbfounded.",
            "score": 1,
            "replies": []
        },
        {
            "author": "King_of_Doggos",
            "body": "oh yeah i forget sometimes that the shard is just an arificially intelligent copy of a person not the person",
            "score": 1,
            "replies": []
        },
        {
            "author": "gztozfbfjij",
            "body": "Remember the first time you meet Johnny? Dudes a raging cunt.\n\nI like to believe that by the time you get to play the game during that section, Johnny and V have already merged significantly, as to mean they're even able to get along to the level they do.\n\nSo we have. Timeframe from the \"Got a smoke\"/Pill-crawling scene to when you get out of bed and can leave the apartment?\n\nIt makes sense that the vast majority of the merge would happen sooner rather than later, especially given that V was \"killed\" for it to even trigger.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jayciel1000",
            "body": "in the temperance ending v gives up their body for an ai.. makes me wonder if it even has a consciousness.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KuraziDiamonda",
            "body": "Imagine how confusing it would be for both of them though",
            "score": 1,
            "replies": []
        },
        {
            "author": "Faded1974",
            "body": "I'm surprised to see this upvoted because all my interactions with this fan base has shown that people definitely didn't understand the relic doesn't have Johnny's actual soul.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MassUnemployment",
            "body": "this is funny?..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Akatas",
            "body": "If you think of it that most of the players choose the Female V - which is clearly closer to the Canon - this meme makes absolutely no sense and has a really bad quality as well.",
            "score": 1,
            "replies": [
                {
                    "author": "Present-Ranger-1861",
                    "body": "Casually just taking facts out of their ass to back up a headcannon that does not exist in either side. The only possible canon would be the setup of V, which is apparently pistols, mantis blades; either way, there's no gender canon. If you're thinking of the recent marketing, Fortnite skin, that's probably because Male V has been, in the past, in most marketing materials - cinematics, the game image. It's just time for fem V with the marketing for Phantom Liberty, and stuff.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Akatas",
                            "body": "You know what the really funny thing is? All the wannabe fans downvote my comment by ignoring the official numbers of the gameplay.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Present-Ranger-1861",
                                    "body": "Elaborate? I don't know what you're talking about - I'm interested (They didn't elaborate.)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "slash-summon-onion",
                    "body": "Yoooo bro u totally got them, meme DISMANTLED!!! (Also about 73% of players pick male V so maybe not)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DueCoach4764",
                    "body": "there's no canon in cyberpunk",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ConfusedAndCurious17",
                            "body": "There definitely is, but we don’t know what it is exactly until the next R Talsorian release. That’s how Johnny Silverhand, the time of the red, and the net being filled with black ice became canon. In every cyberpunk iteration everything you do or don’t do is canon until the next campaign you run or the next release and then we find out what “actually” happened during that time period and move along.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Present-Ranger-1861",
                                    "body": "We just won't. I doubt CD will make callbacks of 2077 - of the \"right way\" to play Cyberpunk.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ConfusedAndCurious17",
                                            "body": "No but if the next game (either TTRPG by RT or video game by CDPR) takes place post 2077 then certain key events will definitely be canon and certain ones will not.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DueCoach4764",
                                            "body": "it'd be cool in the next game they talk about V like they're a myth, like theres 2 npcs having a conversation. \"You hear about V? what ever happened to them?\" \"i heard they left night city with a bunch of nomads. \" \"well i heard they raided Arasaka Tower alone. \" \"Really? I heard they killed themselves. \"\n\nor something like that",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HammyBoy0",
                                                    "body": "The new vegas approach",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Present-Ranger-1861",
                                                    "body": "That's actually pretty fair. Good theory",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Devixilate",
                    "body": "Why does it matter?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Chaines08",
                    "body": "What are the arguments for Female V being canon ? genuine question here",
                    "score": 1,
                    "replies": [
                        {
                            "author": "The_Elder_Jock",
                            "body": "I like it = canon.\n\nThe same kind of misguided but inoffensive logic came out in Mass Effect too. Fans would scream about female Shep being more canon and more popular. Then the official stats were released. 70% of playthroughs used male Shep.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pimp_yu",
                    "body": "Who cares.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "vlad_kushner",
                    "body": "The canon on your head. Anyone who play the game make their own canon.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}