{
    "title": "Judy <3",
    "author": "saddiq_bs",
    "subreddit": "cyberpunkgame",
    "rank": 11,
    "score": 77,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 9,
    "url": "https://i.redd.it/6pe2cb82ihpe1.png",
    "id": "1jeasrd",
    "selftext": "",
    "comments": [
        {
            "author": "Fr4ct4lS0ul",
            "body": "I just did this mission a couple of nights ago, and it was very emotive. Initially when meeting Judy I could tell she was very guarded with her emotions, nerdy and very hyperfixated on BDs and their tech, she doesn't hand out her trust easily and has been burned by doing so before (you can tell by the conversation you have the next morning). During the mission, you can tell that she's really opening up to you by showing you what she shows you - she wants you to know more about her, she wants that connection. She has a ton of depth as a character, and I enjoyed doing the missions for her.",
            "score": 1,
            "replies": [
                {
                    "author": "ChaseBank5",
                    "body": "She has the most interesting and developed character ark in the whole game.\n\nI love her, but she isn't my favorite character. And there are a lot of AMAZING characters in this game, but she grows and changes the most over time and you learning more about her is incredibly fun and powerful.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lordtaco",
            "body": "Judy: V I got some friends who are in trouble, can you help.\n\n\nPanama: V I NEED YOUR HELP STEALING A FUCKING TANK",
            "score": 1,
            "replies": [
                {
                    "author": "Ham_Fighter",
                    "body": "Yeah but you get to \"connect\" in the tank. Judy be like \"I need some time alone\" after I merc like 30 people and she's still emo.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "InsanePyro1990",
            "body": "I did not expect this mission to give me feels like it did, I knew it was a major mission and that was it\n\nDisappointed we never got to see the BD tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "NittanyScout",
            "body": "I agree 100%",
            "score": 1,
            "replies": []
        },
        {
            "author": "lungshenli",
            "body": "<3",
            "score": 1,
            "replies": []
        },
        {
            "author": "em_paris",
            "body": "You should see her in her MaxTac uniform",
            "score": 1,
            "replies": []
        },
        {
            "author": "ndem28",
            "body": "I honestly might like her romance better than Panam’s , I’m not really sure why. I also like the fact that she leaves with you in the star ending , and that you can leave with both Judy and Panam",
            "score": 1,
            "replies": []
        }
    ]
}