{
    "title": "Should I seek ADHD-specific in a therapist?",
    "author": "lamallamalllama",
    "subreddit": "ADHD",
    "rank": 499,
    "score": 5,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/ADHD/comments/1j1zi1g/should_i_seek_adhdspecific_in_a_therapist/",
    "id": "1j1zi1g",
    "selftext": "I already have a psychiatrist I like for medication management. Thinking about trying out talk therapy as I'm realizing that other struggles like perfectionism, procrastination, social anxiety, etc aren't going to be solved by medication and organizational strategies (should have been obvious lol). I think some of these struggles have root causes related to having had undiagnosed ADHD for a long time, and some do not. \n\nDo you think it's important to find a therapist who specializes in ADHD, versus just somewhat aware of it? Can you share why yes/no? What sort of things do you look for in a therapist? Located in the US if that's helpful context. TIA",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/lamallamalllama and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "adhd6345",
            "body": "If you’re looking for ADHD specific support, then a therapist with ADHD may be able to help.\n\nThe biggest thing is finding a therapist that’s not dismissive of your ADHD struggles.",
            "score": 4,
            "replies": []
        },
        {
            "author": "JuciekWorld",
            "body": "I personally have a therapist that told me that she doesn't really like to focus on a person's diagnoses, but rather on the difficulties that  the person is struggling with. She obviously is aware of my diagnosis, and if a method of working on something is not gonna be really helpful for me because of it, she doesn't suggest it for me. \n\nFor me the most important thing is that the person who you're working with isn't gonna deny any of your diagnoses OR the struggles that are related to it. Doesn't have to be someone who specializes in treating ADHD, but I would recommend someone who is very much aware of the difficulties that come from it. I think it might be safer to get one that specializes in ADHD cause it decreases the chance of them saying some awful shit about the diagnosis or difficulties that you're experiencing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fernoppi",
            "body": "My therapist is not an expert on ADHD. I had mentioned one time my consideration of getting evaluated and then life happened and I got sidetracked. Later she brought it up again and was like - maybe you should consider getting evaluated because I think it's something else. This was after working on my traumas etc. She's been a great therapist and have tried to understand my ADHD so it wasn't really needed for her to be an expert. I would say that some of my issues are worsened due to my ADHD and she is very intuitive. Someone who understands ADHD can be helpful because it can be hard for us to just change our thinking. I would say at a minimum, someone who is open to ADHD and doesn't have a negative view of it",
            "score": 2,
            "replies": []
        },
        {
            "author": "preventworkinjury",
            "body": "If you have the option, then I would definitely say YES.  I was diagnosed way late too.  If you go on YouTube and search ADHD or Neuro science or some sort of related word there’s some good videos out there that you can watch. - ADHD was related to my perfectionism because I always feared negative feedback.",
            "score": 2,
            "replies": []
        },
        {
            "author": "peach1313",
            "body": "In my experience, yes. Even better if they also have ADHD.",
            "score": 2,
            "replies": []
        },
        {
            "author": "theblackd",
            "body": "I think it’d be really helpful. This will mean they are more knowledgeable in your specific struggles and likely more experienced with issues that often stem from ADHD like the ones you mentioned. If you can, I would recommend that.\n\nI lucked myself into this, with a therapist specializing in ADHD, it wasn’t why I picked him at all because I never suspected I had ADHD. But it’s turned out to be a really nice thing and helped me get diagnosed, but the knowledge helps with the many things where ADHD intersects with other mental health stuff",
            "score": 1,
            "replies": []
        },
        {
            "author": "Foutchie5",
            "body": "Yes!! Find one that is neuroaffirmative and trauma informed. I think trying to treat a problem without reference to or knowledge of the root cause is ineffective at best and dangerous at worst. Don't be afraid to shop around for a good fit. Good luck!",
            "score": 1,
            "replies": []
        },
        {
            "author": "OWIBJM",
            "body": "YES! I’ve been in and out of therapy for many years. Having an ADHD therapist was an absolute game changer for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Numerous-Cod-1526",
            "body": "I need help not with adhd but with other stuff as well so I need probably a general one or adhd  one idk",
            "score": 1,
            "replies": []
        },
        {
            "author": "GameGreenBean",
            "body": "Y E S.  I've dicked around with people who say \"oh yeah, I see ADHD patients\" snd its not the same. They just don't \"get\" it and tend to try to fit you into the same solution-boxes as all their other patients and I never had success with them.  Im not saying all of them arent good, but all the ones I went to weren't as helpful.",
            "score": 1,
            "replies": []
        }
    ]
}