{
    "title": "ADHD Meds: Placebo Effect, Tolerance, or Wrong Prescription?",
    "author": "pcheur",
    "subreddit": "ADHD",
    "rank": 450,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2dm6w/adhd_meds_placebo_effect_tolerance_or_wrong/",
    "id": "1j2dm6w",
    "selftext": "I’m just trying to understand what’s going on, and any thoughts or advice are welcomed. I don’t have the energy to go back to my GP, and therapy or psychiatrists aren’t an option financially. Just looking for insight from the community—thanks for reading.\n\nI was prescribed 5mg of dexamphetamine three times a day. It worked really well for the first week.\n\nI knew there could be a “honeymoon period,” so I kept my expectations in check. At first, I had more control over my thoughts, could bring them back on track, and initiate tasks with ease. I could sustain effort and attention.\n\nThen, after a week, it just stopped working. Overnight, there was no difference between being medicated and unmedicated. Literally nothing.\n\nI understand tolerance, but I don’t understand how it stopped so suddenly and completely.\n\nMy GP switched me to 30mg of lisdexamfetamine (slow-release). I felt zero effects. Then, I got bumped up to 50mg, but I still don’t know if it’s actually working.\n\nI have more energy, and my thoughts are clearer, but I can’t control them like I could at first. It’s not that my brain isn’t responding—it’s just not helping with what really matters: concentration and initiation.\n\nBut what if it is working? Even non-ADHD people procrastinate or lack motivation. Meds won’t magically fix everything. Maybe it worked at first because I was so excited to finally feel capable, and now that excitement is gone.\n\nMaybe that’s all it was—just the excitement.\n\n“Yeah, I can read, but I’m over that now.”\n\nWhat if meds only make you capable of doing what you want, but the real problem is… I don’t actually want to do anything?\n\nSo then why don’t I?\n\nWhat do I actually want? To waste every day lost in my thoughts? And then get upset about it?\n\nWhat’s the point of meds if they only make me better at staring at a wall?\n\nOr maybe these just aren’t the right meds. But then, why did they work at first? And why didn’t they work again when the dose was increased?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/pcheur and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sobol2727",
            "body": "You are right, meds help you focus but they won't do the job for you. You need to find the motivation yourself. Nonetheless at that dose you should feel something even if not exactly help in motivation",
            "score": 1,
            "replies": []
        }
    ]
}