{
    "title": "Is Vyvanse not for me? (Irritability & Apathy)",
    "author": "VirtualAlgorhythm",
    "subreddit": "ADHD",
    "rank": 390,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2oz7d/is_vyvanse_not_for_me_irritability_apathy/",
    "id": "1j2oz7d",
    "selftext": "Hello all,\n\nI was diagnosed with ADHD-HI (hyperactive-impulsive) just a few months ago and started taking Vyvanse. My doctor slowly increased my dosage, starting from 10mg, and now at 40mg. During that time, I found 20-30mg to be very helpful at work - but nowadays, even 40mg has not been much help at all, especially when it comes to studying (engineering student). I've also noticed that I've become a very soulless individual and also very irritable. This has been affecting my relationships and is becoming increasingly concerning for me.\n\nNow, as someone with ADHD-HI, I was wondering if the medication was removing my depression (that I had been using my entire adult life to hide my bad HI symptoms) and that this irritable behaviour was kind of just... who I really was. But now that I think about it, I think it's still gotten a bit too bad.\n\nIs it worth trying other medications at this point, such as Concerta? I think if I increase my dose of Vyvanse again, I'll just become even more irritable. I have been on name brand Vyvanse so I don't think it would be a manufacturer-specific issue... I have finals in the next month so ideally this wouldn't interfere with that. I can only see my doctor every few weeks.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "PartAcrobatic",
            "body": "It's absolutely worth trying (but obviously discuss this with your doctor). Different meds tend to work differently for different people. Concerta didn't do much for me, except at the highest dosage, which also sent my heart rate through the roof; Elvanse seems to work at 30mg. In your case, it may well be the other way around. Even Ritalin and Concerta, which have the same active ingredient, can be experienced differently because... pharmacology.\n\nWhile we are on the subject, are you also taking any antidepressants? ADHD meds as such don't necessarily influence depressive symptoms; in my case, I'm combining Elvanse and bupropion, and this seems to be more or less working (several previous combos did not). So this is also something to consider and discuss with your doctor.",
            "score": 2,
            "replies": [
                {
                    "author": "VirtualAlgorhythm",
                    "body": "Thanks for the ideas and I hope I can bring some of this up with my doctor. I actually used to take Wellbutrin (before my ADHD diagnosis) but found it useless after the “rush” of focus ran out in just a few days (150mg XL). I’m not sure what I would ask to try first but I guess I’ll see. The Vyvanse has actually increased my HR a good bit as well so perhaps switching to Concerta would help reduce that too.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}