{
    "title": "Splitting a focalin xr.",
    "author": "SwyvCrux",
    "subreddit": "ADHD",
    "rank": 374,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2s4kh/splitting_a_focalin_xr/",
    "id": "1j2s4kh",
    "selftext": "So I usually alternate between 27 mg concerta with 10 mg ritalin ir at end of day or i take a 25 mg mydayis whichever easier for pharmacy. Recently a friend offered me a 40 mg focalin xr to try before asking psychiatrist to commit me to a full month but I feel 40 mg would be too high. It's a capsule with beads and curious if I opened it and took half or even a quarter if it be the same as if I took a 20 or even 10 mg dose? I've read focalin is mg for mg double the strength of ritalin/concerta. I may call my psychiatrist and ask if this is safe and explain the situation as well as asking for experience here. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jayg76",
            "body": "I've always been told you can't split extended release meds.",
            "score": 2,
            "replies": [
                {
                    "author": "SwyvCrux",
                    "body": "I know concerta can't be split because it's coated. Focalin xr is beads inside a capsule",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jayg76",
            "body": "Quick Google says no.  Half the beads are XR and half are IR.\n\nSo, no.",
            "score": 1,
            "replies": []
        }
    ]
}