{
    "title": "Can you tell me if it's ADHD?",
    "author": "elsuenito",
    "subreddit": "ADHD",
    "rank": 396,
    "score": 1,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2sct4/can_you_tell_me_if_its_adhd/",
    "id": "1j2sct4",
    "selftext": "I can concentrate on one task. But after a while, I'll want to rest. That seems normal.\n\nBut there are other problems. I have thoughts in my head all the time, either one and in a circle (rumination) or different ones, about everything.\n\nI put things off for later, or do them at the last minute. Most likely because I don't have the energy and strength to do them. Or I don't see the point of it at all.\n\nI attribute it to anxiety, but after reading other people, it sounds like there is something similar to ADHD. \n\nI was on SSRIs and my head was empty, sleep got better (rhythms), but also acquired PSSD....\n\nGoing to bed, I have tons of thoughts(questions, solutions) about life, problems, etc, but I don't even begin to address them.\n\nSo what do I have? Depression, anxiety, and consequent poor sleep.\n\nOr a norepinephrine problem?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/elsuenito and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "-BlancheDevereaux",
            "body": "Reddit can't diagnose you. A professional can. Go get evaluated.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Senko_Kaminari",
            "body": "ADHD can’t really be self diagnosed. Only a professional can diagnose you with ADHD.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MaccyGee",
            "body": "It’s perfectly normal to be thinking all the time, you’re a conscious human being after all. If you have hyperactivity, impulsivity, forgetfulness, trouble focusing and these are severe enough to affect your life then get assessed by a professional. See a doctor about your concerns either way and they can tell you whether its possible that it’s adhd or diagnose and help you if it’s depression anxiety etc",
            "score": 2,
            "replies": []
        },
        {
            "author": "bouncingnotincluded",
            "body": "Some of the things you mention are things that are a part of ADHD, but it cannot be gauged based just on this, it needs a thorough psychological examination. Important is to ask questions like whether it has happened throughout your life (ever since a young child) and if other people notice this as well, Like a teacher/boss complaining about a procrastination habit, or family/friends noticing inattentiveness. Think whether the symptoms cause problems in your daily life, and if they do, you can visit a licensed psychologist for it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Twentie5",
            "body": "i would make an appointment with dr or therapist and tell them your concerns.\n\nI will say i spent a long time undiagnosed",
            "score": 1,
            "replies": [
                {
                    "author": "vvhitee",
                    "body": "I second this.\n\nI was told as a child at age 5 I was to my parents, but they didn't have the funds or belief/knowledge.  \nThen again during all of school.  \nHad ADHD diagnosed friends tell me I was during uni.\n\nThen now at age 27 I only got diagnosed and medicated last year. I was almost certain and had enough to guide me, but you still need a diagnosis and professional.\n\nAs 1, it may be something else, or 2, you may just be experiencing normal problems that can occur for ADHDers but are not ADHD.\n\nIt probably is, but no one here can give you the confirmation to the level you will truly need and the threads echo that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Professional-Elk3750",
            "body": "Just start the process now. I figured out I had ADHD like 5 years ago. I just got an evaluation (which has been ongoing for months, my psych likes going very in-depth). I also got diagnosed with Bipolar 1. \n\nPoint is, if you think something is off, it probably is. None of us can say for sure, but it sounds possible if not probable. \n\nGood luck!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Giant_Dongs",
            "body": "Hopefully you don't live in the UK because adult testing for ADHD has been non existent with huge 10+ year backlogs for quite some time.\n\nFor me the only thing the diagnosis would help with is getting the meds, I don't care anymore and just accept my life on welfare and being a useless burden on society.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unafragger",
            "body": "Reiterating that you need to see a doctor for a definitive diagnosis, but that sounds a lot like me.\n\nCheck out Executive Dysfunction symptoms too, it sounds like you struggle with that quite a bit. It can be caused by ADHD, but also other things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theCannonBallZ",
            "body": "All any of us can do is suggest getting professionally evaluated. \n\nAside from self help habits you could potentially implement(that regardless of having ADHD or not, could potentially improve your daily life,) there's nothing really \"official\" that can be done to help you without a diagnosis.",
            "score": 1,
            "replies": []
        }
    ]
}