{
    "title": "Strattera- Adderal - Wellbutrin",
    "author": "Such-Concert-4080",
    "subreddit": "ADHD",
    "rank": 341,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2xqp1/strattera_adderal_wellbutrin/",
    "id": "1j2xqp1",
    "selftext": "I have been on Strattera for about 3 months, titrating slowly from 18 mg to 40 mg. I loved how it made me feel, my mood was regulated, my attention span was slightly better (enough for day to day work and it helped with anxiety too. It does make me very tired, I feel very fatigued and out of breath just walking a stair (never happened before, I lift heavy weights 4x a week). My doc gave me Adderall XR 10 mg to supplement when I need to hyperfocus (watching lectures, doing homework, reading long documents).\n\nAt 40 mg Strattera, the fast heartbeat and random overheating were out of control. My doctor told me to go back to 25 mg but it made the symptoms worse. So I just stopped it completely. I have stopped Strattera for almost a week now and the brain fog was crazy. All I want to do is go to sleep and when I'm awake I can't think at all. So to function at work, I've been taking Adderall as it completely removes the brain fog.\n\nI'm just curious if the brain fog is a symptom of weaning off Strattera or of not taking Adderall every day. I wanted to try Wellbutrin as a daily medication because I want to avoid depending on Adderall for the habit-forming potential and also the shortage. All the side effects of different things make me nervous so I want to hear people's experiences from similar transitions or med combinations.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "General_NakedButt",
            "body": "I had a similar experience with Strattera. I feel like it was starting to help at 60mg but it was causing my heart rate to go up and I was sweating profusely. Ended up going off and switching to stimulants and yeah there were a couple weeks where I felt off due to discontinuing the Strattera. The sweating has stuck around permanently which really sucks.",
            "score": 2,
            "replies": [
                {
                    "author": "Such-Concert-4080",
                    "body": "Dang that’s annoying. How are you doing with stimulants? I feel ok on adderall and wouldn’t mind if that’s the only med I take for this. Idk if I could survive the strattera withdrawal without it. But I’m exploring non-stims because I don’t want to deal with the shortage",
                    "score": 1,
                    "replies": [
                        {
                            "author": "General_NakedButt",
                            "body": "Eh I wouldn’t worry too much about Strattera withdrawal, discontinuation is very manageable compared to most psych medications. As far as stimulants go I tried Adderall for maybe a year and the sleep disruptions never relented. I felt I was getting to reliant on Ambien to sleep so I tried Ritalin again but it doesn’t work nearly as well. I guess it’s a trade off where Adderall is more effective but has worse side effects and Ritalin is less effective but has more manageable side effects. I might be going back to Adderall because my productivity and motivation at work has plummeted since switching to Ritalin. I feel like I’m stuck between having a decent home life and sleep and having a good work life.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Azzbolemighty",
            "body": "What did your doctor prescribe for you first? I am currently trying to get medication but hearing mixed feedback on which medication people recieve initially. I want to make sure I get something effective because I think my ADHD is a lot worse than I ever thought it was.",
            "score": 1,
            "replies": [
                {
                    "author": "Such-Concert-4080",
                    "body": "Strattera was the first ADHD med I was put on partially because the psychiatrist probably didn’t believe I had it. I was uneducated about ADHD and the stimulant abuse and the psychiatry department at the hospital I went to wasn’t taking new patient so I just hopped on a telehealth site and told a psychiatrist I thought I had ADHD 😂. I later got assessed at a different facility and switched to a different psychiatrist but kept working with Strattera until recently.\nEvery medication works differently and I do think I feel the most normal on Adderall, which makes sense because it’s the first line of drug for ADHD. It’s annoying to get on and off so many meds but I think you just need to try it out. Also depends on what you want. I just want to see if any non stim works for me before committing to Adderall",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "loools",
            "body": "Honestly, i think most of the side effects are from the stimulants for me. But I think I've gathered there are times I just need them ,as strattera and coffee is not enough most of the time. \n\n\nIm back to trying strattera, and find it always is a life line with my anxiety from situations or meds are just much. When I was off it I remembered I was always in my head, and this med just basically allows that to part of me to be better. (Less freaking out, better memory, always something to help me focus). \n\n\nI've done different levels of doses/meds and honestly most are never consistent. I plan on trying to give strattera a full shot, and going up beyond 40mg.  \n\n\nAnd for brain fog, honestly the only thing I've ever found to help it, is extremely hard cardio. ",
            "score": 1,
            "replies": [
                {
                    "author": "Such-Concert-4080",
                    "body": "Interesting. Did you have any physical side effect from strattera? I honestly wanted it to work but I gave up 🥲",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}