{
    "title": "i guess my adhd impacts my life more than i thought it did",
    "author": "RelativelyMango",
    "subreddit": "ADHD",
    "rank": 339,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/ADHD/comments/1j34mlm/i_guess_my_adhd_impacts_my_life_more_than_i/",
    "id": "1j34mlm",
    "selftext": "i got diagnosed with adhd this summer, but it’s something i’ve been struggling with for years. i thought that i was managing my adhd moderately well. i struggle a bit with paying attention in meetings and classes, and i sometimes zone out in conversations, but i thought things were mild and manageable. today i had a friend text me about wanting to take a break from our relationship. they told me that our conversations felt one-way and that i never listened or paid attention to them when they were speaking. i am devastated. i thought i was managing my adhd well and was able to converse and pay attention to people well, but i guess from an outside perspective, it doesn’t seem that way. i feel awful about all the other people in my life who might be feeling the same way and i don’t want to be hurting anyone in any way. i’ve always been unmedicated and i’ve never even considered taking adhd medication, but i’m considering it now. it doesn’t help that my attention has been worse lately and that i’ve been struggling more with focusing on work and school. i’m definitely going to talk to my therapist and psychiatrist about this, but i just feel bad for the people in my life who are impacted by this. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/RelativelyMango and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oiggamed",
            "body": "Tell all of this to your friend. If they don’t understand they were never your friend.",
            "score": 1,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "i’m worried that they will just tell me that i’m\nusing adhd as an excuse for my actions instead of taking the blame for it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Oiggamed",
                            "body": "That’s no friend. That’s an antagonist. A good friend would support you.  If that’s how they com across they are no friend. They never really were.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RelativelyMango",
                                    "body": "no they are definitely a good friend and we’ve been friends for a long time and have supported each other in a lot of tough situations. they’re just upset at me right now and i’ve never really shared with them how adhd impacts how i engage with other people, so it would be understandable if they have that sort of reaction. they’re trying really hard to have a respectful conversation with me about it and have been utilizing their therapist to help them communicate with me because they know that they don’t handle these situations well, but i’m worried that me saying that will result in a negative reaction from them because they’re really emotional and upset about it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "fretsore",
            "body": "I've spent a lot of my adult life terrified of this scenario (being called out), as I often find myself talking \\*at\\* people or info-dumping about whatever I am fixated on.",
            "score": 1,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "it’s super difficult to manage. it’s not like we’re intentionally trying to do these things.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}