{
    "title": "To all the long term medicators, what pro tips do you have for those new to meds?",
    "author": "Sufficient-Front2006",
    "subreddit": "ADHD",
    "rank": 290,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j36wfd/to_all_the_long_term_medicators_what_pro_tips_do/",
    "id": "1j36wfd",
    "selftext": "Keen to hear pro tips that have allowed you to find your \"rhythm\" over numerous years with minimal dosage increases etc? What lifestyle changes, insights and advice to you have for those feeling their way thru the initial stages. It can be very daunting and discouraging reading all the posts relating to tolerance and meds not working anymore... I would love some positive stories of how people have found a sweet spot where you are maximising your meds and your lifestyle to effectively manage symptoms over many years? What would you love to tell yourself at the beginning of this journey? Appreciate everyone that has a bone to throw our way! No matter how big or small. Thanks very much!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Sufficient-Front2006 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "tdammers",
            "body": "In principle, you shouldn't need regular increases - tolerance buildup on therapeutic doses is relatively rare after the first couple of weeks. I've been on meds for almost 3 years now, and haven't changed my dosage except for the initial titration process, which took less than a month.\n\nWhen \"meds stop working\", it's more often \"psychological tolerance\" - that is, your brain gets used to the effects, and your medicated state starts feeling \"normal\", as if the meds weren't doing anything. Going off meds for a day or two will make it pretty clear that that's not the case, that your unmedicated self is much worse than you remembered, and that the meds are, in fact, still working fine, you've just adjusted your expectations.\n\nAnother thing that happens often, especially with people who are new to medication, is that you take meds, they work, you feel like you could take on the world, and so you increase the demand you put on your brain, until you feel \"normal\" again - except that that \"normal\" is the same level at which you had been overworking your brain on a daily basis before meds. You get more done, but you're still wearing your brain out. And because meds can only do so much, there will come a point where your brain is so worn out that the meds can't keep up anymore, and it feels as if they're not working anymore, when in fact they are, but you're countering that with increasing the demand. So when it feels like the meds \"aren't working anymore\", that could just be a sign that you need to reduce the stress you put on your brain, take a day off for self care, and rethink your schedule.\n\nOther than that: lifestyle changes, strategies, etc., are definitely useful, if not needed, whether you're medicated or not. They are more likely to be effective when you're medicated though. As to what those changes and strategies could be: this is a vast topic, and you'll find plenty of information on this sub and elsewhere, but the gist of it is that you need to try a bunch of things and see what works for you (and what doesn't). Learning a bit more about how ADHD affects your brain is also massively helpful, because it allows you to understand *why* things work (or don't work), and how you could change them to work better.",
            "score": 9,
            "replies": [
                {
                    "author": "Sufficient-Front2006",
                    "body": "Wow thanks for the reply! Thank you for the time taken to type it out, I appreciate it. Your points make complete sense. Adjusting one's expectations once that feeling of \"normal\" is found is great advice. And I agree with learning about how the ADHD brain works as i find it helpful when i identify symptoms these days... Im able to more easily \"move on\" if that makes sense. Did u happen to have any book recommendations?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Candid-Song9817",
                    "body": "true have experienced it",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}