{
    "title": "What do you do while watching something?",
    "author": "daisy_engineer1234",
    "subreddit": "ADHD",
    "rank": 158,
    "score": 49,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 90,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3ankp/what_do_you_do_while_watching_something/",
    "id": "1j3ankp",
    "selftext": "I can't sit still while watching stuff so I usually fidget or eat or do something on my phone to do something and not just watch. I can't just watch something unless it's a horror movie or something really really interesting. I tried fidget cubes but I keep losing them and also they're not as fun(?) and I tried doing hobbies like crocheting but I need more attention on the crochet so I drift from the show's content. \n\nPlease let me know some good things to do while watching stuff!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/daisy_engineer1234 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "NefyFeiri",
            "body": "Pick on my cuticles until they bleed, pick on my lips until they bleed, constantly talk and ask questions 🙃 i wish i could stop",
            "score": 21,
            "replies": [
                {
                    "author": "Living_Bar1538",
                    "body": "I was a card carrying trichotillomaniac for about 30 years. When I started taking a stimulant, the hair pulling just kind of…stopped. What a feeling.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "NefyFeiri",
                            "body": "I hope i get diagnosed one day so i can get on medication too and stop. I cant imagine how life would be without picking my skin constantly 😭 I'm so happy for you that you were able to stop!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Prior_Researcher_492",
                                    "body": "For me, medication has not stopped the cuticle biting/picking 😭 I still do it until they bleed and hurt. Maybe it’s just habit now from how long Ive been doing it 😫",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Extreme-Jelly-9572",
                    "body": "Haha actually same. I always hold a bloody finger or toe up to my husband during our shows as his cue to get some bandaids and say \"baby whyyyy\"!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KeyMajestic6444",
            "body": "Match socks, go through papers, sometimes I will even haul boxes or death piles around the chair I watch tv in to sort through.  Anything above matching socks makes me distracted from the tv but honestly I kind of trick myself into doing it bc I can watch tv all day w no problem but sorting and organizing things I put off like crazy so doing it this way is how I get it done usually. I usually catch enough of the show to keep up with it but I miss plenty of it this way too lol. I also have to be on my phone or checking my email at the bare minimum when I’m watching tv. I also need the captions on so I can read the conversations as well.  I use to just never watch any tv now I feel like all I do is watch tv lol.",
            "score": 17,
            "replies": [
                {
                    "author": "Lindsay1970",
                    "body": "This makes me so happy. I have a terrible time sorting boxes or piles, because I worry about each object and overthink it. I'll try sorting doom boxes while watching a show I've already seen and enjoy.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheAimlessPatronus",
            "body": "I am basically always knitting. I have different complexities of projects depending on how engrossing my other activity is.\n\n(Socks for transit, blankets for meetings, the fun complexities for evening movie or show, etc)",
            "score": 14,
            "replies": [
                {
                    "author": "whatsasimba",
                    "body": "Crochet for me. \n\nI hate when I'm crocheting and I look up and notice that for the past 2 minutes they've been showing text messages or paragraphs of exposition and I have to rewind and really WATCH.  Or it's a show in English, but 20 minutes in, it's all subtitles (The Night Agent killed me having season 2 half in Farsi.)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "TheAimlessPatronus",
                            "body": "This works for me because I like to rewatch comfort shows. I'm on my third watch of Real Housewives of NJ and I still have no clue whats going on half the time.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Burphybaby",
            "body": "I mainly watch horror too lol. Sometimes I roll out the yoga mat and exercise or stretch while I watch.",
            "score": 8,
            "replies": [
                {
                    "author": "Subject-Solution-830",
                    "body": "Me too!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Phunkbox",
                    "body": "Moderate exercise or stretching is the best while watchinf tv!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Leading_Result_8345",
            "body": "puzzles!! I like to organize by color when first starting which is especially great for watching tv",
            "score": 7,
            "replies": []
        },
        {
            "author": "Secret_Squirrel_6771",
            "body": "Play on my phone,  crochet, drink coffee,  ask a million questions.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Sufficient_Cap_3457",
            "body": "Loll same questions I was thinking of doing. Embroidery",
            "score": 4,
            "replies": []
        },
        {
            "author": "Liploxxx",
            "body": "I’m on my phone, pick at my nails or sometimes I attempt to read and put the volume at 1 or I end up falling asleep lol but majority of the time I’m on my phone and picking at my nails.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Subject-Solution-830",
            "body": "I do small art, like paint medication bottles.  I even blinged out the tylenol bottle 😂\n\n(We've been sick like the WHOLE month of February and I was sick of seeing ugly bottles).",
            "score": 4,
            "replies": [
                {
                    "author": "Subject-Solution-830",
                    "body": "I'd post a pic, but can't find how on this thread...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ashitaka1013",
            "body": "I usually play games on my phone- but because so many require watching ads, I always have a secondary activity on hand which I’ll switch back and forth from lol \n\nI folded 1000 paper cranes last year. I’ve felted little animals. Currently making embroidery thread friendship bracelets.",
            "score": 5,
            "replies": [
                {
                    "author": "Splashum",
                    "body": "Needle felting was where I drew the line on my TV watching activities...I could just envision one going through my hand 🫣",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ashitaka1013",
                            "body": "lol I’ve definitely poked myself a few times but no serious damage done",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BrowniesWithNoNuts",
                    "body": "Thats me, only 3 mobile games at once on 3 devices.  Lots of ads, so usually just starting or ending ads .  Some parts of the games pretty much run themselves so its not like i need 3 hands.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Competitive_Emu5795",
            "body": "puzzle games (most games) on my phone help me to be able to stay tuned into the tv or movie im watching.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Altruistic_Abroad_37",
            "body": "I love watching shows on my phone when I’m doing dishes and laundry. A tablet would be less insane but I am a single mom and live in an apartment so this is practical for R rated shows. I use fidget toys for watching movies together when the popcorn runs out.\n\nI recommend crocheting water balloons out of blanket yarn if you are comfortable with them being vague cylindrical blobs. They make great gifts for kids or adults who are fun and playful. You can sell or donate them very easily if you accumulate too many and people will actually use and appreciate them. Very easy to make with no pattern or frog and redo if you fuck up.",
            "score": 3,
            "replies": [
                {
                    "author": "KindofLiving",
                    "body": "My two brain cells just cannot make crocheting and water balloons jive. Please give an ADHD explanation. 😵‍💫😅",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Altruistic_Abroad_37",
                            "body": "So you basically make a little fuzzy blob out of thick swishy yarn, then you soak it in a bucket of water and throw it at your friends. They are  machine washable and you don’t make a bunch of ballon litter everywhere. They also get people very wet when they hit without breaking. It’s like a hollow washcloth ball I guess, like an unstuffed crocheted squish sphere.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "KindofLiving",
                                    "body": "Okay. I imagined a crotchet cover for filled water balloons. 😶‍🌫️",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "chasing_rainb0ws",
                                            "body": "My brain refuses to let me imagine them as anything else than little water balloon sweaters",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "KindofLiving",
                                                    "body": "😄",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TomJD85",
            "body": "Get used to putting your phone in a drawer and watch with the lights off. Also, as a 40 year old with a tendency to want to complete everything, it took me a long time to accept that if I’m not that into something it’s ok to just let it go. That doesn’t mean it’s bad, or that you don’t get it. You just don’t have to watch something if you’re not that into it.",
            "score": 5,
            "replies": []
        },
        {
            "author": "thepatientwaiting",
            "body": "Mostly brainless phone games that aren't timed or require a lot of attention. I might cross stitch but only if I'm not really paying attention to the TV 😆 \n\n\nI really like Tangles (look up Tangle creations). They are a little bigger than fidget cubes. An employee of mine bought me some after they noticed I stripped the coil cord from my desk phone down to the wire from playing with it. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "thecrookedfingers",
            "body": "Crochet! Keeps my hands busy without being too distracting",
            "score": 2,
            "replies": []
        },
        {
            "author": "brau_miau",
            "body": "I play with hand puzzles and fidget toys, like the magic cube. If I don't, I will scratch and bite my own cuticles and stop the movie repeatedly to google something or scroll my phone.\nI thought about crochet but I don't like hobbies that produce more objects, so for me ordering a bunch of hand puzzles from Temu was the best solution.",
            "score": 2,
            "replies": [
                {
                    "author": "Phunkbox",
                    "body": "\"I don't like hobbies that produce more objects\" I feel this so hard",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZoeShotFirst",
            "body": "Have a go at knitting! Because there are two sticks (instead of crochet’s one) I can knit without looking. \n\nYou’ll end up with a lot of garter stitch squares/rectangles - I can’t do anything very complicated - but it’s better than my other options! (Eating, scrolling on my phone)",
            "score": 2,
            "replies": [
                {
                    "author": "daisy_engineer1234",
                    "body": "this makes sense, I tried it once but I never pushed through enough to be able to do it without looking though haha I'll retry this month",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ZoeShotFirst",
                            "body": "Although I can now knit without looking the “continental” way, I had to learn with the yarn in my right hand (the “English” way, apparently) - this is the slower way, but I never minded, as I was just using the fidgeting to help me concentrate on the tv. So, try to learn with the yarn in your main hand and “throw” it over the needle, instead of “picking” it up. \n\nGood luck!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DisplacedNY",
            "body": "Knitting, cross-stitch, organize my digital storage, organize photos.",
            "score": 2,
            "replies": []
        },
        {
            "author": "notapeacock",
            "body": "Draw, paint, fold laundry, play mobile games, play with a fidget toy, etc etc\n\nIf I don't do any of those things, I end up picking at my cuticles. Ow.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lle-ell",
            "body": "I solve sudokus! I *cannot* just sit and watch things, it’s impossible.",
            "score": 2,
            "replies": [
                {
                    "author": "daisy_engineer1234",
                    "body": "I used to do this for a while, I guess I could get back to it on paper or something because I would always end up switching apps haha",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "EduK8rOHYA",
            "body": "I play solitaire on my phone.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Impossible-Bear-5724",
            "body": "I often do some kind of artist hobbie, like embroidery or drawing. I also more often play video games on one screen and watch my show on the other lol!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Parking_Buy_1525",
            "body": "i’m at a point where i can’t even watch anything anymore \n\ni assume medication would help, but i don’t want to so i just find short clips and focus on other things instead",
            "score": 3,
            "replies": []
        },
        {
            "author": "BIRD_II",
            "body": "Write about my experiences, either recently (diary) or on a topic (thoughts) - Watching something usually prompts my memory to remember a bunch of stuff that's tangentially related to it, which is useful as I really struggle to remember stuff to write if it's what I'm actually focussing on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sunset-Papi",
            "body": "I used to be able to crochet and watch TV or YouTube for hours. But now I just scroll through reddit and read AITAH while playing Mr. Nightmare, Mr. Ballen, or MJV Animations on YouTube. Or I eat and watch YouTube. Or BizarreBub scary video compilations. You actually have to watch and pay attention, or it isn't as scary 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "someRandomUser636",
            "body": "I tey to get a fidget or I will start playing withvmy nails.. that wont end good lol!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aggressive-Sale-5414",
            "body": "Watching or reading about politics, sports, music, or fashion in my phone",
            "score": 1,
            "replies": []
        },
        {
            "author": "Trebol_Demon_King",
            "body": "Rainbow loom, minecraft, writing, play on my phone. Many different things. Anything I can get my hands on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Count4815",
            "body": "Often Times i got my Laptop on my lap and am gaming White watching a series.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lindsay1970",
            "body": "Knitting! Depends on the pattern, though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "queenbeepdx",
            "body": "Fold laundry. If I’m watching something I’ve seen before, sometimes I will doodle or color in a mandala coloring book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Difficult_Standard_1",
            "body": "Study, eat, Reddit, doodle, knit socks, weave, clean my docs, game with one earbud in so I can hear the tele, or sleep with my eyes open, bc I don’t watch the tele😂 it’s like it will kill me if I sit and stare at the thing I’m suppose to be watching.",
            "score": 1,
            "replies": []
        },
        {
            "author": "herethereeverywhere9",
            "body": "I usually have a laptop in front of me working through photography stuff/photoshopping.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ohmfthc",
            "body": "Knit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "llkiasll",
            "body": " I am a student in uni, so I do find that writing notes in my book for a class I am in allows me to focus on both the writing and the TV. Because I have only minimal interest in both most times that multi tasking works for me. If a show I liked was on I'd prolly put the book down\nThe notes are subjective to scenarios. Sometimes I do bill tracking which adds my phone into the mix.\nGrocery list. Sometimes I research things. I like learning but I just look for new words with short definitions and add to the book. Between each line I glance up to take in what's happening and go right back to writing",
            "score": 1,
            "replies": []
        },
        {
            "author": "KindofLiving",
            "body": "Funny, I was searching for other activities than reading, playing solitaire, surfing the internet. My thumbs need a break. I previously painted my nails, worked on my hair,  folded laundry, and jigsaw puzzles. Unfortunately, I miss details and memorable scenes. I struggle to recall most scenes and characters. I have long watch lists because I miss the best parts when people reference films and shows I have watched. Co-activities make it even harder.  Friday, I conscientiously began to watch stuff and just enjoy the experience. I am too old and missing too much quality content.✌🏽\n\nBy the way, does anyone use Reddit emojis? Just curious.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Live-Ad2998",
            "body": "Crochet, play freecell",
            "score": 1,
            "replies": []
        },
        {
            "author": "BitterRucksack",
            "body": "Doodle or take casual notes on the thing I'm watching. Helps me focus better and can jog my memory later if I forget details! ",
            "score": 1,
            "replies": []
        },
        {
            "author": "ContactHonest2406",
            "body": "Play guitar.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dontmesswithtess1121",
            "body": "Crochet. I mainly make simple blankets, which are made of repeating the same stitch over and over, so I can mostly watch tv without having to look down very much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far-Translator-9181",
            "body": "Mindlessly snacking or doomscrolling while constantly rewinding all the parts I missed until I eventually pass out on the couch",
            "score": 1,
            "replies": []
        },
        {
            "author": "th4d89",
            "body": "Play something mindless like binding of isaac, dead cells,  balatro or slay the spire.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iTammie",
            "body": "Sort and fold laundry, organize mail and other papers, eat too many snacks, do small repairs on clothing or toys, Gardenscapes, Block Blast, Wordfeud and Reddit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "beeezkneeez",
            "body": "Oh man. Sometimes I don’t really watch but rather listen for the background noise. I usually do other things while it’s playing. Sometimes I “watch” something on an iPad but scroll on my phone at the same time 😁 I know it’s bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "orcasmik",
            "body": "Everything but watching",
            "score": 1,
            "replies": []
        },
        {
            "author": "crystal_visions98",
            "body": "Yeah, I struggle with sitting through an entire movie too (watching on a big screen is better for me since I'm in a way 'forced' to sit if I don't want to miss anything but my broke ass hasn't been able to afford tickets lately...)",
            "score": 1,
            "replies": [
                {
                    "author": "crystal_visions98",
                    "body": "And when I am watchin at home, I usually stop after like 15 min. just to run around the room and listen to music, then I watch another 15 min. and geylt distracted by some other thing 😉",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Golintaim",
            "body": "If the show can't keep my attention I'm going to end up not paying attention to it at all. If I pick up my phone while watching something I might as well turn the TV off",
            "score": 1,
            "replies": []
        },
        {
            "author": "fatfat2121",
            "body": "I have tried watching while playing games but I don’t really like how my attention switches like that. If I cannot focus on something, I just don’t do it nowadays",
            "score": 1,
            "replies": []
        },
        {
            "author": "CozySweatsuit57",
            "body": "Crochet. \n\nThis annoys other people if we’re watching together so in that case I eat or drink. Not a great mentality but something that can be dragged out over a long period of time like popcorn gets the job done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spudmcloughlin",
            "body": "I crochet but only projects that I don't need to read a pattern for. I've made so many star blankets that I just know how to do it, and it's easy for me to get lost in the repetitive motion and pay more attention to the tv",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bluedino_1989",
            "body": "Fidget",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ma_jix",
            "body": "Everything and nothing at the same time",
            "score": 1,
            "replies": []
        },
        {
            "author": "CautiousClutz",
            "body": "Eat and work on whatever little busy craft I have going on at the moment - crochet/knit/cross stitch etc",
            "score": 1,
            "replies": []
        },
        {
            "author": "airysunshine",
            "body": "Eating, fidget squishy balls, drinking something, playing mobile games, petting my cat, coloring, googling the show and going down the rabbit hole of the actors’ life stories….",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaptainKurticus",
            "body": "I drive a work truck with an actual TV I put in it. I watch a bunch of old sitcoms I never got to see. Somehow, I drive better with no rage and get paid to sit in traffic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unicorn-chinchilla",
            "body": "Expensive markers! And those thick marker color books! The feel of a $7 marker is unlike anything else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "p365x",
            "body": "Same",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baxtir",
            "body": "I'll listen to music, sometimes mess around with my shortwave and scanner radios though it's better to use with TV off, get some work done, read on my phone, Google things, or play simple games. Oh, and I can't forget the best side activity while watching TV, I love cuddling with my dogs!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Small-Tooth-1915",
            "body": "Treadmill \nEat \nFold laundry",
            "score": 1,
            "replies": []
        },
        {
            "author": "Extreme-Jelly-9572",
            "body": "Cross stitch!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glittering_Drop9118",
            "body": "Besides picking at my nails and cuticles .. I just start looking up stuff on Google or scroll Facebook while I listen to what's on the TV.  I can't just sit abd watch something... will also snack if nothing else to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "itspknt",
            "body": "This is going to sound gross, but I’ll usually try to find scabs in my scalp or back so that it can bleed and form a new one that my future self can pick at. 😅 I’ll subconsciously do this for whenever I’m sitting down in general. I also eat something or straighten my hair (I have naturally curly hair).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Variable851",
            "body": "3D modeling on my laptop. I can watch programs and still be creative and it lets me jump between different things I'm designing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Serious-Mode",
            "body": "If it's a show or movie I'm interested in, I hyperfocus on it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "April_Morning_86",
            "body": "Stir the clothes in the dye bath like it’s 1776.",
            "score": 0,
            "replies": []
        }
    ]
}