{
    "title": "Do you ever struggle to see either the big picture OR the individual details of a problem or topic?",
    "author": "CozySweatsuit57",
    "subreddit": "ADHD",
    "rank": 251,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3c8fp/do_you_ever_struggle_to_see_either_the_big/",
    "id": "1j3c8fp",
    "selftext": "I have always struggled because I usually have to decide between seeing all the small details of a subject or seeing the big picture. This was especially a problem in history class, which I sort of worked around by memorizing how the teacher told us the details related to the big picture. But I often struggled understanding how individual events and situations led to big things like wars. \n\nNow I’m a SWE and it’s the same thing. I’m trying to become proficient in a new part of our codebase. My boss is super kind and helped walk me through the process. It feels like I can either see the steps or the end goal but not both at once. It’s like seeing just the 2D magic eye pattern or seeing just the plain 3D image (like they show at the back of the books) but not actually being able to get the pattern to overlap and truly see the image as it was intended. (Ironically I’m freakishly good at magic eye puzzles.)\n\nAnyone relate?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/CozySweatsuit57 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "KuramaYojinbo",
            "body": "I can’t even make a cup of coffee without spiraling for a few minutes. I’ve been so bad ive had to write a list from a “how to” online for a 4-5 step process and then i lost the paper.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fyre-Bringer",
            "body": "Yes! Either I'm like, \"I need to wipe down the table. How do I wipe down the table?\" Or, \"I need the past 500 years of history to understand what's going on in this situation.\"",
            "score": 2,
            "replies": []
        }
    ]
}