{
    "title": "When should you just stop?",
    "author": "Mr_Deps",
    "subreddit": "ADHD",
    "rank": 192,
    "score": 9,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3es23/when_should_you_just_stop/",
    "id": "1j3es23",
    "selftext": "So I've been having a good couple of weeks, been sticking to just a couple of creative projects & really felt like I was making progress. \n\nWent to bed last night & couldn't get to sleep for thinking about what I wanted to do today, then today came & I haven't focused on any one thing for more than 10 minutes.\n\nI went out for a walk after lunch to try & reset my brain but alas, still doing nothing 🤦‍♂️ now it's 4:30, in under an hour I need to be cooking dinner, should I just accept that today was a total bust & just hope tomorrow is better?\n\nIs it sometimes better just to accept that you're not in the right frame of mind to get something done? It seems ridiculous to me, but maybe if I can just accept it & not be too hard on myself I'll be more likely to have a good day tomorrow?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Mr_Deps and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmallLumpOGreenPutty",
            "body": "Definitely best to accept that today isn't a good brain day. Otherwise you can start to bully yourself and talk yourself down for not being as productive as you \"should/could\" have been. And that can be really demotivating.",
            "score": 11,
            "replies": [
                {
                    "author": "pixiekendall",
                    "body": "it’s so hard for me to do that, i am constantly bullying myself for what i don’t do while also thinking of all the things i have to do and then i end up in overstimulated paralysis. how do you make yourself accept that a day just wasn’t a good brain day?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "SmallLumpOGreenPutty",
                            "body": "It's taken several years of reading this sort of thing online and trying to internalise it, and trying hard to be as gracious with myself as i am with others, plus basically forcing myself to accept that i deserve patience as much as anyone else. Plus a little bit of spite as i became aware that other people were less patient and understanding towards me than i was to them.\n\nIf other people aren't going to support me on a bad day then I'll support myself, sort of thing.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "pixiekendall",
                                    "body": "love that! especially that last sentence. thanks for responding!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vordh0sbn-",
            "body": "There's always tomorrow. Don't be so hard on yourself. Every day doesn't have to be productive.",
            "score": 3,
            "replies": []
        },
        {
            "author": "llkiasll",
            "body": "The feelings you have are completely valid! Of course wanting to be productive and getting further is a great boost in happiness. Sometimes your future self will feel better knowing you didn't force yourself to do something because not being in the right mindset can lead to mistakes and more frustration esp if it doesn't go your way. Understand that you didn't get the sleep you needed to be the best you, you could be and that rn you are the tired equivalent of the best you, you could be. It wasn't a bust day today because you are up, you are still doing something with your day. You took the time to excercise, you will be taking the time to cook yourself a meal. That's plenty.\nI'm proud that you have taken the time to try and help yourself.\nTomorrow's a new day, make the best of what you can.\nAnd push to get yourself some more sleep tn\n\nFrom\nA stranger who didn't sleep the entire night either\nAnd it's now 8:40 am ❤️",
            "score": 3,
            "replies": []
        },
        {
            "author": "Icy_Answer2513",
            "body": "I've had one of those days.\n\n\nGot a few small bitty bits done and largely f all else. Feel really down on myself.\n\n\nHopefully tomorrow will be better for all of us!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aggressive_Worth3527",
            "body": "it’s all about flow, if there was a continuous flow of creativity you would never be grounded to what makes it so special in the first place, some days your so full of that energy and can get many things done in one day, but now you have to decompress all that energy fully until you can get fresh “ideas” or creativity, at our core we as humans weren’t supposed to make art (from a biological standpoint) so any rate of creativity coming out of you is amazing and you shouldn’t take that for granted",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mr_Deps",
            "body": "Thanks folks, it's just so frustrating",
            "score": 1,
            "replies": []
        },
        {
            "author": "jsteele2793",
            "body": "Yes it’s really hard sometimes but I try to give myself a lot of grace. I spent so much of my life being angry at myself for not getting stuff done. It’s part of my disability and part of accepting myself is that sometimes I just don’t accomplish a lot. And that’s ok.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Witch-in-Wisteria",
            "body": "I think it’s very important to accept that some days are harder and some days you won’t be as “productive”. This might just be a day that you need some rest, and if you shame yourself for not doing xyz then you won’t really be getting rest",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnimalPowers",
            "body": "Yes.  \n\nIt's not \"when should you stop\", it's \"when should you start\".\n\nDon't start on a project you don't have a space for.   Literally nothing good will come from it.  You literally can't do it, which is why you shouldn't.   \n\nUnwind, take a week off or whatever, then get back to it.   You'll find you get more done in 10 minutes when you're actually invested and dedicated to the task with \\*true\\* intention.   You could spend 20 hours and still not be nearly as productive as those 10 minutes.\n\nListen to your body, always, always, always.   That little voice in the back of your mind that \"you should\".  Give it a megaphone, listen to it, don't second guess it, that's the most important voice you will ever hear.  \n\nChillax, life is good, get some food, get some water, enjoy the day above the ground that you have been given.   Literally all of your 'progress' is meaningless, when you're buried, it doesn't matter then, so why should it matter now?\n\nFor me, there's weeks where I'm on, there's weeks where I'm off.  I can't do anything about it.  I just gotta go with the flow.  After observing myself for long time I've realized that I literally get nothing done when I'm not \"in the zone\" . it's just wasted time that makes you frustrated, angry and creates bad habits.   Nothing good, all bad.",
            "score": 1,
            "replies": []
        }
    ]
}