{
    "title": "Best way to gameify my everyday life?",
    "author": "thursdayreadsreddit",
    "subreddit": "ADHD",
    "rank": 228,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3gh0y/best_way_to_gameify_my_everyday_life/",
    "id": "1j3gh0y",
    "selftext": "I struggle to finish daily and long term tasks (and take enjoyment in them) and it seriously damages my uni life and my personal life. I love video games a lot and my friend suggested to try to gameify my life. Problem as always, the task to suddenly set up something feels overwhelming to me and I dont know what to begin with. Does anyone have some tips? What works for you, where to begin, what is sustainable and fun way to do this, etc? Thank you all ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/thursdayreadsreddit and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mbarlowsg",
            "body": "I use a note taking app called Obsidian. It has an open source plugin ecosystem where community members create plugins that you can use. I use the app to track my daily habits (e.g. meds, meals, sleep) and make use of plugins to create views of this data. There are many plugins to view habit tracking data in different ways but I really like the one that looks like the GitHub activity graph. \n\nYou could setup almost anything that you want as the app is incredibly customisable. For example, you could create a streak counter that shows how many days in a row you do a certain habit.\n\nYou don’t need to know how to code or have much technical experience to use the app, but if you, it definitely helps with setting up and testing less popular plugins (or creating your own). The community is also very active on Reddit and the obsidian forums so help is always available.\n\nAll that being said, it does take some effort to set up and use. For me, this is one of my hyper fixations (I’ll literally go to bed thinking about new things I can do with Obsidian) but for others the setup can be quite a bit of work. However, if this is something you’d be interested in, I’d be more than happy to help you get started.",
            "score": 2,
            "replies": [
                {
                    "author": "thursdayreadsreddit",
                    "body": "OH I know that app! I used the desktop version a little bit for taking lecture notes, it wouldnt occure to me that it has such possibilities. Thanks for the idea!  Do you have some plugins that you really recommend?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Mbarlowsg",
                            "body": "I actually came across a plugin called \"Gamified Tasks\" by dromse a couple of day ago and it sounds exactly like what you're looking for. \n\nHere's a link to the Github page if you want to read up on it more: https://github.com/dromse/obsidian-gamified-tasks\n\nI've never used it before but it looks pretty easy to setup and use but after just looking at it again, I might start messing around with it.\n\nI'd also recommend \"Full Calendar\" by Davis Haput. It gives you a \"full\" calendar view where you can schedule events and tasks. You can either connect to your daily note where tasks/events are created inline or to a folder (directory) where \"full page\" events are created as individual notes. These notes can be edited and notes on the tasks/events can be written within them. One thing to keep in mind is that this plugin was last updated two years ago, I've been making small changes a forked version of the code for personal use but if more people are having issues with it I'd be happy to try to create and release a permanent solution.\n\nLastly, I'd recommend using \"Tasks\" (Martin Schenck and Clare Macrae) and/or \"Dataview\" (Michael Brenan). Both track data throughout your vault and can help source tasks. This can be useful as you can create tasks in your notes as you go and just find them with either of these plugins.\n\nI know the difficulty of feeling overwhelmed when trying to handle something like this and I'd like to help in any way that I can. Please feel free to DM me if you have any questions about Obsidian / need help setting something up, or if you just want to chat!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "thursdayreadsreddit",
                                    "body": "Thank you!! Ill check these out! And ill let you know once i do if the offer will still stand then ^",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Mbarlowsg",
                                            "body": "No worries mate. I look forward to hearing from you.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Akmal20007",
            "body": "I tried this concept on my little brother which helped him.\n\nIt's like you have an xp bar and you gain xp from missions (things to do like studies or something else) then you level up\nWhen you level up you have 3 prizes and you choose only one of them, these 3 prizes will be the most 3 things you really want to do right now\n\nYou take the prize and you can use it now for a limited time like 15m or 30m or you can put it in your inventory\n\nIt's not complicated but if you really thought about it it'll be so much better\nOfc it'll get harder and harder to gain xp so it'll be boring so you'll have to reset the game every week or something or you can make 2x xp one of the prizes for a whole day\n\nJust gamify your shit and it'll be better, the problem is that you'll have problems with dealing it alone\nYou'll need someone to write all of this and always writing the stats. I thought about this for whole 2 days and it worked for one week with my brother then he felt frustrated again when he losed\nSo reset the stats every 5 days or a week and take a break for one day to regain your energy (sorry for my English it's my second language)",
            "score": 2,
            "replies": [
                {
                    "author": "thursdayreadsreddit",
                    "body": "Sounds interesting! This is very near to something I've had in my mind. Thanks for warning too. (No need to apologise, I think your English is very good^^ and it's my second language too)",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}