{
    "title": "ADHD Medication Disappointment",
    "author": "International-Fix799",
    "subreddit": "ADHD",
    "rank": 201,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3litm/adhd_medication_disappointment/",
    "id": "1j3litm",
    "selftext": "I started Elvanse 30mg a week and a half ago - for the first two days I felt more focussed, but I think honestly it was just excitement. I do feel a general quietness in my head, but honestly I was expecting so much more. I know i’ll probably have to go up a dose, but i’m starting to realise maybe the medication is not the crazy life changing solution I thought it would be.\n\nThis has kind of lead me to feeling like this is it and I feel kind of down. Does anyone know if it makes an actual meaningful difference and are you actually supposed to “feel it” or is it more just you sense yourself focussing more?\n\nThanks!\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/International-Fix799 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Username_1379",
            "body": "Hi! That’s frustrating. It’s hard when we have an expectation in our mind that doesn’t get met. \n\nI’ve been on Adderall XR since late December of last year. I was diagnosed then too, and so this is the only med for ADHD that I’ve been on. \n\nMy head is quieter for sure. And for me, I had been waking up each morning with heavy feelings of dread/guilt and just feeling like I got beat up overnight. I had zero energy. With the medication, I feel like I mostly rested overnight. I wake up feeling ok. I can start and finish tasks (not all) without becoming overwhelmed. I have a steady stream of energy throughout the day. My memory didn’t necessarily improve, but I can recall some information a little quicker. As for focus, I can kind of focus to get those tasks done, and I can read more of a book or a news article before ‘tapping out.’ But I’m also not in school, so I don’t have deadlines or assignments or anything. I’m at stay-at-home mom to a 3.5 year old and a 20 month old. \n\nI will say though after the first month-ish, I wasn’t as motivated or energized. So it was like the ‘novelty’ wore off a little bit. However, I can still get things done, and my anxiety has remained significantly decreased. I feel like a person again rather than a shell of myself. \n\nFor me, I feel it was life changing. It didn’t cure me though. I still struggle with time management, burn-out, frustrations and the stuff I mentioned above. However, I feel like I can now better make routines/stick with them and I have the mental energy to work-through things where before I was just getting worse and worse mentally and just physically burnt out. \n\nIt’s possible your dose is off, or maybe the med you’re on isn’t quite right for you. Which is also frustrating because we all want to feel better sooner rather than later. Definitely talk to your doc. They can help you figure out if it’s a dose thing or a med thing. They should have the knowledge/experience/bedside manner to really hear you out and work to find a solution. \n\nHopefully some of this is helpful. I wish you the best!",
            "score": 3,
            "replies": [
                {
                    "author": "International-Fix799",
                    "body": "this is super helpful actually, thank you",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "moanngroan",
            "body": "Meds do nothing for me. Well, at 100g/ day of Strattera, I’m finding my food cravings slightly dampened. But nothing besides that with any meds I’ve tried.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nilahlia_Kitten",
            "body": "I love my Vyvanse. Helps life so much. I have never been so focused, but not so hyperfocused. I can still multitasking like nobody's business, but I can almost do 1 thing at a time.",
            "score": 1,
            "replies": []
        }
    ]
}