{
    "title": "Can’t focus for the whole duration span of a school test and it is affecting my grades",
    "author": "Me_Islander",
    "subreddit": "ADHD",
    "rank": 130,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j44mgi/cant_focus_for_the_whole_duration_span_of_a/",
    "id": "1j44mgi",
    "selftext": "I just want to begin this post with stating that I do not have an ADHD diagnosis, even if I might’ve suspected that I perhaps could have it.\n\nI’ve been having this issue where I lose focus during tests in school and end up either not doing the rest of the test or just waste a lot of the time I’m given trying to get back my focus. \n\nI thought maybe it had to do with my sleep so I slept more, but that didn’t help. I tried preparing better which only helps a little. I’ve tried other methods like chewing gum but it never helps. I’m not very well educated on ADHD so I don’t know if this is something that is common for someone with an attention deficit or if this might just be because I am dumb. \n\nI’ve been having this issue and it’s starting to really(!!!) affect my grades so I was wondering  if maybe anyone on here might have some kind of advice?\n",
    "comments": [
        {
            "author": "Polyventurer",
            "body": "Your first step, if you can, is to get diagnosed! \nADHD can be very debilitating, and there isn't an easy \"hack\" to get better focus during an exam. \n\nDoes your school offer psychiatric services? That would be a good place to start. Then, if diagnosed, you can get support, medication, and possibly special accommodation during exams like more time, a quiet room, etc. \n\nOther things that might help long term are things like meditation (I recommend the Balance app, you can get a year subscription for free) , and obvious things like sleep, exercise, and a high quality diet.",
            "score": 1,
            "replies": [
                {
                    "author": "Me_Islander",
                    "body": "Thank you for the advice! I guess I’ll ask around and see if there are any psychiatric services! I’ve never been really sure if I was the problem or if I could potentially have an attention deficit but I guess at least looking it up might be a good start.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}