{
    "title": "How can I stop doing things impulsively?",
    "author": "fr33zRAY",
    "subreddit": "ADHD",
    "rank": 65,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/ADHD/comments/1j4fqwc/how_can_i_stop_doing_things_impulsively/",
    "id": "1j4fqwc",
    "selftext": "I am constantly buying things, destroying things, yelling and self harming just out of pure impulse to do so. I hate it and it makes me feel like a stupid monkey brain. Monkey wanna do this, monkey do it.\n\nI spent a tenner on Harry Potter figures the other day, for no reason other than I wanted it. I just ordered a 45rpm vinyl of Surfin Bird by the Trashmen just because birds the word. (It cost me 15 quid) \n\nI absolutely hate being like this, so does anyone have advice for not being so goddamn impulsive? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/fr33zRAY and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "KronusEdits",
            "body": "take your medicine lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "OopsAllStardust",
            "body": "I have this problem too, and still struggle with it, but something that has helped me so far this year has been tracking my purchases. Not checking my bank account, that shit’s fuckin’ scary, but I have a spreadsheet that I have numbered 1-27, and I can only purchase 27 games this year. I’ve been writing each title down, along with the date.\n\nIt’s already been working for me, too. I strained and moaned when I REALLY wanted a game, but I had juuuuuust gotten game number 2 last month. But the rule stayed in place.\n\nPersonal accountability is hard, too, so I’ve told my friend about it, and she’s been a little helpful in reminding me that it exists, and that I can do it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Variable851",
            "body": "If you find out let me know. In the fall, I impulsively started taking the bolts out of my garage cabinets without bother to empty them with no one else home. Balancing them on my head or shoulder while reaching in and pulling out items to drop them on the ground apparently taught me nothing because I did it again with other cabinets a few weeks later.",
            "score": 1,
            "replies": []
        },
        {
            "author": "One_Towel3663",
            "body": "ADHD makes it worse, but that doesn’t mean you have zero control. The problem isn’t just impulsivity, it’s the fact that you’re not putting up any barriers between the thought and the action.\n\nStart forcing a pause before acting. Seriously, just 10 seconds. See something you want to buy? Count to 10 before making a move. If you still want it after, count to 30. Then an hour. Make waiting a habit. Impulse thrives on speed—slow it down.\n\nSecond, create friction between you and your impulses. Want to buy something stupid? Delete your saved payment methods, make it a pain in the ass to check out. Want to smash something? Put it in a box first, walk away, and come back in an hour. By then, you’ll probably have cooled off.\n\nThird, channel the energy elsewhere. You’re acting on impulses because your brain is constantly craving stimulation. If you don’t direct that energy somewhere productive—gym, music, creative hobbies, literally anything that engages your brain—it’s going to keep manifesting in destructive ways.\n\nYou’re not a “monkey brain,” you just haven’t built systems to override this yet. But you can. And if you don’t, this cycle will only get worse.",
            "score": 1,
            "replies": []
        }
    ]
}