{
    "title": "Contractors keep ghosting/blocking me",
    "author": "JosephCraftHD",
    "subreddit": "HomeImprovement",
    "rank": 1,
    "score": 22,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/HomeImprovement/comments/1jeccuw/contractors_keep_ghostingblocking_me/",
    "id": "1jeccuw",
    "selftext": "Hello! I'm in a weird pickle that I have never experienced before. I'm in Central Florida in a home that is below grade.  I'm a fool for buying a house like this but live and learn.  This house floods fairly often and I've been working to come up with a solution to prevent future flooding from occurring. The problem is, every time I have a contractor come out and look, they completely ghost me afterward. \n\nThe first time it happened, the contractor came out, and we had a great appointment.  He explained to me a solution and said he'd get me a quote that night.  I never received a quote, so I called the company and the owner of the company answered and said that he'll reach out to the contractor for an update. Crickets.  The following week I called again and did the same thing. \"I'll call the contractor and let them know to get the quote out to you tonight.  Even if I have to write it myself.\" Once again, no quote.  So I call again the following day and it goes straight to voicemail and continues to go straight to voicemail for a full week.  So then I get suspicious and call from my wife's phone and lo and behold, the owner answers and when I explain who I am, the owner gets frazzled and says he'll call the contractor to see what's going on.  I also asked if he blocked me and if I did something to upset them, I'm sorry. The owner swore he didn't block me and is unsure what's going on.  So I said I'd keep an eye out for a quote.  Unsurprisingly, the quote never arrived. This time I hid my caller ID and called again and the owner answered and said \"Look, it seems like the contractor may not want to work on your project\". Then I said, \"That's fine! I just wish you guys didn't wait this long to tell me, so I wasn't spinning my wheels with you all.\" Businesses have the right to decline services, so I'm not going to argue with them.  I'd rather have a business that wants to work with me. \n\nSo then I moved on to the next company. The guy who came out was awesome! He understood the problems and how to fix them. He offered multiple solutions and said he would write me up a few quotes to see which works best for me financially. They were also going to replace my flooring as well. Because the company was essentially a \"jack of all trades\" he said it would be a few days before they could get the quote for everything out, which was fine. After about a week I called up and asked about installing drywall as well and he said to send him the dimensions and he can see how much that would cost. He also apologized and said he didn't forget about me, he's just waiting for all the quotes to come in so he can send them all in one. So I sent him the dimensions a week ago and went to call for an update to find out that I've been blocked from them as well. \n\nWhat gives?!  All of these appointments have been pleasant and friendly.  I've been very direct with them and each appointment gave me confidence that we can solve this house's problems. Why is everyone blocking me? ",
    "comments": [
        {
            "author": "JJJonReddit",
            "body": "Probably they don’t want you to sue them when the fix doesn’t work. Despite what some people will tell you, climate change is real and your problems are probably only going to get worse. Insurance companies know this. Serious business people know this. I’d sell the house now while there are still a lots of people drinking the Kool-aid.",
            "score": 31,
            "replies": [
                {
                    "author": "JosephCraftHD",
                    "body": "Thanks! We’re actually selling the house in October, but I wanted to make some repairs so the next people don’t have issues.  Sounds like I might just have to disclose some of the problems the house has",
                    "score": 9,
                    "replies": [
                        {
                            "author": "llDemonll",
                            "body": "Your real estate agent will tell you what you legally have to disclose. If they can’t, get a new agent.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "JJJonReddit",
                            "body": "Good of you to do that, but I wonder if a disclosure might be better overall. Tricky situation.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "poopandpuke",
                            "body": "Your real estate agent is not an attorney. They cannot tell you definitively what you do/do not have to disclose. An agent gets paid to sell the property. They have an interest in selling as fast as possible for as much as possible, so they are not neutral. If you fail to disclose or under-disclose, it falls on you. Not the agent. At best, if you have written communication that your agent tells you not to disclose something, then they have some liability.\n\n\nI say all of this having just gone through this process. It was rough and I'm really glad that I disclosed as much as I did and even then it almost wasn't enough. It was costly. ",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "JosephCraftHD",
                                    "body": "That’s the plan.  I don’t plan on giving this house to someone in this condition unless I sell it “as is”.   I want to fix the problems it does have and give someone a pretty nice home to live in. I don’t want to be slimy about it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "lurkymclurkface321",
                                            "body": "You can be honest and transparent without dumping your money into an “investment” that won’t net you a return.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Monktrist",
            "body": "I have a buddy who likes to check the court records of the client for any red flags.  If this is the case, they probably wouldn't check for the initial visit but after they know the scope of work and if it is over a certain dollar amount they may take that step.",
            "score": 1,
            "replies": [
                {
                    "author": "JosephCraftHD",
                    "body": "What would court records pull up for me though?  I’ve never been through court so I should have a clean record.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Severe-Conference-93",
            "body": "Maybe the project is difficult and requires a lot of work. Then there is a warranty that they need to back it up with. Many on contractors do not want to be involved with projects they are not familiar with.\nThe liability will lye on their back and and repercussions.\nThey may have enough work to keep them busy with out the headaches",
            "score": 1,
            "replies": []
        }
    ]
}