{
    "title": "Why is it that when I'm using a magnet, I can find studs 24\" apart but with the electronic stud finder, I'm also finding a stud in the middle of those studs that my magnet can't stick onto?",
    "author": "No-Leather-1436",
    "subreddit": "HomeImprovement",
    "rank": 3,
    "score": 14,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/HomeImprovement/comments/1jedxdi/why_is_it_that_when_im_using_a_magnet_i_can_find/",
    "id": "1jedxdi",
    "selftext": "I'm living in a 1970s apartment and trying to mount some shelves and maybe a TV in my living room. My electronic stud finder is finding studs 12 inches apart from each other, however, with my magnet, it's only sticking onto studs 24\" apart. \n\nAny ideas on what the \"studs\" in the middle of the 24\" spaced studs could be? It's consistently like this all around my living room. The walls have gypsum board drywall if that matters.",
    "comments": [
        {
            "author": "deadfisher",
            "body": "Maybe you have a party wall and it is seeing studs that are for the apartment next to you? So your drywall is only fastened to your side every 24, and the studs for the other apartment are set back a little?",
            "score": 41,
            "replies": [
                {
                    "author": "Dioscouri",
                    "body": "This is common practice for party walls. \n\nWe use 2X6 top and bottom plates and then stagger 2X4 studs 12 inches on center. One on the side of each unit. We then weave sound insulation through the wall so you're not hearing your neighbors fart.\n\nIt's not done in all units, and sometimes there's a 1 inch gap that extends from top to bottom and double drywall for a fire barrier. It depends on the municipalities and various fire codes as to which one is used.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "deadfisher",
                            "body": "Thanks for confirming the possibility.  I had seen that done before but have no idea if a stud finder would see the setback 2x4.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Particular_Resort686",
            "body": "The magnet is finding drywall screws. If there are studs every 12 inches, they may not have screwed into every stud, just the edges and one stud down the middle.",
            "score": 22,
            "replies": []
        },
        {
            "author": "Korazair",
            "body": "If it is a shared wall they likely used offset/staggered studs to provide better soundproofing between apartments. So the studs that the magnet is not finding are actually set back an inch or so from your wall and connected just to the wall on the other side limiting the amount of noise that can be transmitted between the 2 walls.",
            "score": 12,
            "replies": [
                {
                    "author": "ruhlhorn",
                    "body": "Yep I bet this is a sound wall. And those studs you aren't finding are 1.5 inches from the drywall, not good choices for hanging.  And connecting to them will also decrease the soundwall effectiveness.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "just_me_steve",
            "body": "Are the walls thicker than a 2x4 wall.  Maybe the used alternating 2x4 on a 2x6 plate for sound barrier",
            "score": 4,
            "replies": []
        },
        {
            "author": "Underwater_Karma",
            "body": "Your likely finding an ABS vent pipe",
            "score": 1,
            "replies": []
        },
        {
            "author": "atticus2132000",
            "body": "In an apartment, the walls might be built with sound walls where the studs are offset like [this](https://images.finehomebuilding.com/app/uploads/2017/03/28130557/021266080soundproof.jpg).\n\nYour magnet isn't sticking to studs.  It's sticking to the nailheads or screw heads that are used to mount the drywall to the studs.  If it's not sticking to anything, then the drywall isn't anchored to those studs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nochinzilch",
            "body": "Could be just a random hunk of metal inside the wall. Or an old screw they used to mount something.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Awkward-Fennel-1090",
            "body": "Yikes, too many people here not realizing wood is not magnetic.",
            "score": -24,
            "replies": [
                {
                    "author": "Newspeak_Linguist",
                    "body": "Nobody is thinking that.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "wildfirerain",
                            "body": "Oh yeah? What about ironwood.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "crackeddryice",
                                    "body": "Ha! Gottem!",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Awkward-Fennel-1090",
                            "body": "Nobody is pointing it out!",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ohaple",
                    "body": "Magnetic stud finders are used to find drywall screws, which are presumably screwed into the wooden studs.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Awkward-Fennel-1090",
                            "body": "So a screw finder? You know they sell stud finders that find the wood stud yeah?",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Newspeak_Linguist",
                                    "body": "OP explicitly mentions both.  You really need to work on your reading comprehension.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Underwater_Karma",
                                            "body": "It's always awkward when someone realizes they've made an ass of themselves  and just dig their feet in \n\nIt's like \"oh  I misunderstood\" just isn't an option due them",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Awkward-Fennel-1090",
                                            "body": "The comment I'm replying too is about the magnet. You really need to work on your reading comprehension",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Newspeak_Linguist",
                                                    "body": "No, you weren't, you keep changing your context to try justify your previous mistake, instead of just admitting you were wrong and moving on.  Let me summarize and add context:\n\n**You**: People don't realize wood isn't made of metal\n\n**Me**: Nobody thinks that. They're referring to using a magnet to detect drywall screws, it's mentioned in every single post in here about stud finders.\n\n**You**: You know they sell stud finders!!?!?!?!\n\n**Me**: Of course, everyone knows that, including OP who explicitly mentioned using one.\n\n**You**: bUt I wAs TaLkInG aBoUt ThE mAgNeT!!!!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Awkward-Fennel-1090",
                                                            "body": "Do you always have to change wording to win your arguments?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Newspeak_Linguist",
                                                                    "body": "That's it exactly.  I'm convinced it's this mentality in online discussions that it's a contest and there's going to be a winner.  That's what encourages so many people to act like complete douchebags and refuse to acknowledge they were incorrect about something so trivial.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Awkward-Fennel-1090",
                                                                            "body": "Project much? I bet this is why people leave you.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ohaple",
                                    "body": "I own two electronic stud finders and one magnetic stud finder. They both have their uses. OP even mentioned both types. If you're going to be wrong, try to be courteous about it.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "crackeddryice",
                    "body": "Awkward.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Awkward-Fennel-1090",
                            "body": "Yeah",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}