{
    "title": "TSLA puts 20k$ gain",
    "author": "TerraDeaGenesis",
    "subreddit": "wallstreetbets",
    "rank": 11,
    "score": 364,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 21,
    "url": "https://www.reddit.com/gallery/1je8owy",
    "id": "1je8owy",
    "selftext": "My biggest option win (yet)! Bought yesterday before close and made nearly 2 annual salaries (shitty 2nd world country) in less than 24h. Total 40k gain from TSLA puts over the last two months, but this is the biggest individual win. \n\n23 250 TSLA in total +40%. Recovered most of my tariff tax thanks to this. ",
    "comments": [
        {
            "author": "VisualMod",
            "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 56 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Black_Squirrel",
            "body": "Almost back at 0%, congrats with the trade",
            "score": 78,
            "replies": [
                {
                    "author": "MilkyWayObserver",
                    "body": "To be fair, at his lowest -15%, he outperformed most of this sub",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Samdewhidbey",
                            "body": "If they could read, they’d be really offended.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Bulky-Gene7667",
                            "body": "Lol I love when I get to see my emerging markets hombous telling my us hombres to put the fries in the bag. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheEdes",
            "body": "\\>2nd world country\n\n\\>$10k annual salary\n\nPoland detected \n\nAnyway don't spend it all in one place if you're going back in at least keep your principal.",
            "score": 17,
            "replies": [
                {
                    "author": "NOSjoker21",
                    "body": "MOST GLORIOUS POLSKA!\n\nDzień dobry, fellow TSLA Put enjoyers",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Quintevion",
            "body": "Congrats and fuck Elon",
            "score": 36,
            "replies": [
                {
                    "author": "anthonyb5615",
                    "body": "Like Elons buddy’s are not buying puts too!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cscrignaro",
            "body": "Hope you sold.",
            "score": 15,
            "replies": [
                {
                    "author": "TerraDeaGenesis",
                    "body": "Of course. Might buy back at close",
                    "score": 14,
                    "replies": [
                        {
                            "author": "cscrignaro",
                            "body": "I'd wait",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "anthonyb5615",
                            "body": "https://preview.redd.it/k5otf53ujipe1.jpeg?width=828&format=pjpg&auto=webp&s=55c6d8edc60107904c32b09d358e0a41cef4de85\n\nMaybe Start buying calls!!",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Manbearpup",
                                    "body": "High volume, people thinking more puts forces price up a little?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tinnit3s",
            "body": "please make another post when you lose it all",
            "score": 7,
            "replies": [
                {
                    "author": "AdamHorn8",
                    "body": "Exit liquidity spotted",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TommyOnRedditt",
            "body": "In simplest terms, is “a put” essentially putting in a future order to be executed when the stock reaches your desired low point? I’m still brand new to all of this, so please show mercy.",
            "score": 4,
            "replies": [
                {
                    "author": "labgrownmeatmod",
                    "body": "chatgpt.com\n\nBasically, someone writes a contract saying \"At X date, I will buy 100 shares from you of Y stock at Z price\". This means that if you bought a put dated June 1st, for TSLA $200, you will have to sell the creator of the put contract 100 shares of TSLA for $200 on June 1st. Now, if TSLA is say $190 on June 1st, you're in the money $10 a share, cause you can buy 100 shares at $190 and immediately sell for $200. But if it's say $210, you're out of the money $10 a share.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "posttruthage",
                    "body": "https://www.investopedia.com/terms/o/option.asp",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Hmt79",
                    "body": "I'm sure this is more dumbed down than others would like, but here's my tutorial I gave my niece recently on options...\n\nYou've got buyers and sellers for both puts and calls. Both puts and calls are considered \"options.\"  All option contracts are for 100 shares.\n\nIf I buy a single put option with a $200 strike price on date X/X, I'm buying the right to sell 100 shares on date X/X for $200 each. I'm the buyer of the put, so the seller of the put charges me a premium for selling me this \"option\". That means that the stock has to be under $200 for me to make money when the put expires. If it's not, I won't exercise the option, and the seller will walk away with the full premium. \n\nOf note, you don't have to sell the shares to exercise the option. You can just sell the option itself anytime between your purchase date and its expiry date. Additionally, there are in the money and out of the money options. If the stock price is already below the exercise price, a put is in the money (and will cost more).\n\nI always remember Puts versus Calls this dumb way, which may be a useful mnemonic for you. P is close to S in the alphabet, so buying a Put is buying the right to Sell at a given price. You do this when you think the price is going to go down. You're aiming to lock in the right to sell at a price that exceeds what the stock is trading at once your option is expiring. You're effectively betting the stock will go down.\n\nSimilarly, C is close to B in the alphabet, so buying a Call option is buying the right to Buy at a given price. This is effectively a bet that the stock will go up. If the stock is wildly above said price, you can exercise (buy 100 shares at that low price) and then immediately turn around and sell the shares for more. \n\nYou buy puts when you're betting the price will go down. You buy calls when you're betting the price will go up. \n\nBuying calls or puts, your downside is limited to what you pay for the option up front. It's important to note that you're buying an \"option\" to buy or sell at a given price point. You are not obligated to actually buy or sell at that price. You can choose not to, your option is then not exercised, and you're just out the money you paid for it. Most retail investors are buying puts when they short stocks. \n\nWhile the buyers of puts and calls have the option, the seller on the other side must buy or sell shares if the option holder opts to exercise. Hence, there's more risk to the sellers of puts and calls.\n\nYou can make money on options even if the stock price is lower than your strike price come expiration. The way to do that is to sell the option before expiration. You can also, of course, freak out and sell an option at a loss only to see the share price fall later on so far that you would have made money had you held on longer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EdvardMunch",
            "body": "looks like TSLA puts are over now that were seeing gain posts",
            "score": 1,
            "replies": []
        }
    ]
}