{
    "title": "Will Bitcoin Burn Everyone This Time?",
    "author": "TrainingAffect4000",
    "subreddit": "wallstreetbets",
    "rank": 3,
    "score": 765,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 365,
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1jeis5p/will_bitcoin_burn_everyone_this_time/",
    "id": "1jeis5p",
    "selftext": "MicroStrategy has accumulated nearly 500,000 BTC, but they are now slowing down their purchases. If they start liquidating strategically, they could crash Bitcoin without anyone noticing until it's too late.\n\nImagine the perfect play:\n\nThey sell slowly OTC to avoid scaring the market.\n\nMeanwhile, they short BTC with leverage to maximize profits.\n\nOnce support breaks, they dump everything, triggering liquidations.\n\nBitcoin crashes below 30k, ETFs see massive outflows, and they cash in billions.\n\n\nIf BTC no longer grows exponentially, MicroStrategy is trapped. They either exit now with a profit or risk imploding with the asset. And if they decide to sell, we could witness the biggest Big Short in crypto history.\n\nToo paranoid or a plausible scenario?\n",
    "comments": [
        {
            "author": "VisualMod",
            "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrassChew",
            "body": "https://preview.redd.it/oqhwl8ql5jpe1.png?width=1080&format=png&auto=webp&s=d12fd3e383fcba0388571d2cfaa5e4fc8686fc4d",
            "score": 821,
            "replies": [
                {
                    "author": "zhouyu24",
                    "body": "Pamp eet? \n\nDump eet.",
                    "score": 212,
                    "replies": [
                        {
                            "author": "GrassChew",
                            "body": "Phome",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Long-Horn_Capital",
                                    "body": "Dumping 💩🌽.    Time to make in to real money.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "getapuss",
                            "body": "Shit lips",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "santiago-de-rio",
                            "body": "My lord, Wojak isn't selling.\n\nWhat should I do?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "123supreme123",
                    "body": "While we're on conspiracy theories, what if he decides to move all the bitcoin into cold storage, then moves to the bahamas.  Or makes a tic tok video of himself destroying $27 billion in bitcoin with a baby hammer",
                    "score": 68,
                    "replies": [
                        {
                            "author": "olearygreen",
                            "body": "Does it blend?",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "suizman",
                                    "body": "Will it blend?*",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "bufonia1",
                                    "body": "is (the wallet) cake? oops, no it wasnt",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "elkab0ng",
                            "body": "Where does one get one of these “baby hammers”?\n\nAsking for a friend\n\n— sent from seat 37B",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "qw1ns",
                    "body": "Read this \n\n[https://www.reddit.com/r/wallstreetbets/comments/1j8k5ai/microstrategy\\_mstrstrk\\_now\\_officially\\_a\\_ponzi\\_to/](https://www.reddit.com/r/wallstreetbets/comments/1j8k5ai/microstrategy_mstrstrk_now_officially_a_ponzi_to/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/1jdbzol/mstr\\_ponzi\\_watch\\_march\\_17th\\_11m\\_strk\\_issued/](https://www.reddit.com/r/wallstreetbets/comments/1jdbzol/mstr_ponzi_watch_march_17th_11m_strk_issued/)\n\nAny MSTR issue offering to match their dividend payments\n\nhttps://preview.redd.it/359txleigjpe1.png?width=1057&format=png&auto=webp&s=85de921ba63c2a6aa5baa408c5654830d4cc0d8c",
                    "score": 13,
                    "replies": [
                        {
                            "author": "GrassChew",
                            "body": "That's cool. I use Fidelity but I'm just a wage cuck in his 401k",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "manikwolf19",
                    "body": "![img](emote|t5_2th52|4271)",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "carbonpro",
                    "body": "We need Sminem more than ever",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SirHolyCow",
                    "body": "😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SenBaka",
            "body": "Saylor not selling any btc lol he’s really zero or hero and he thinks hero is for sure",
            "score": 407,
            "replies": [
                {
                    "author": "MyLifeIsDope69",
                    "body": "He wants to be a trillionaire or go bankrupt. It’ll eventually be one or the other virtually a 100% chance long term",
                    "score": 165,
                    "replies": [
                        {
                            "author": "becomingreatinall",
                            "body": "Wants to make MSTR as a BTC bank.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "MyLifeIsDope69",
                                    "body": "Mstr would need to pay off all their debt they used to acquire that bitcoin first. Can’t really use it like a bank until it doesn’t need to be held as collateral\n\nOr I mean they “can”, but they would FTX themselves by investing money that’s already used as collateral",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "SenBaka",
                                            "body": "The debt converts to equity in this scenario. They don’t need cash flow. Literally whole mste capstack is convertible bonds with less than 1% interest or participatinf preferred that PIKs. Its like he selling cheap options that will be exercised.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "MyLifeIsDope69",
                                                    "body": "Ah yea I think Saylor got smarter about how he structured things after the first few waves. I know earlier they were a lot more handicapped but this bond interest scheme he cooked up is perfect for them",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "SenBaka",
                                                            "body": "This “scheme” is just saylor having access to capital markets that nobody else has, but everybody wants. If every pubco could raise this product it would be extremely accretive to equities and the death of lenders. Idk why creditors agree to give him capital on these terms but when you buy mstr thats what you’re buying. Its not btc. It’s the most horny capitalization / levfin products anywhere for equity holders.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "MyLifeIsDope69",
                                                                    "body": "Lmao yea I love that description. My point still stands though I just misinterpreted slightly, no one trusted him enough to offer those leveraged financial products until btc spiked above $30k. I know because I was there I bought MSTR at $90 BEFORE the 10:1 stock split. He was a laughing stock and I felt like an idiot for a solid while until it panned out and that’s what gave him access to more capital now it was more proven out. Early he was diluting shares to get more BTC",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SenBaka",
                                                                            "body": "Kudos to you. Im not even a big believer in btc. I just see that its a asset which has become legitmate enough that it is unlikely to go anywhere now. And when you can get leverage like this to buy that kind of collateral, its unheard of. And somehow, he’s able to keep doing it. Imagine somebody giving you a 0% mortgage to buy $1 billion of real estate and all they ask is that if it becomes $10billion that you give them like 3% of the pie. Insane",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MyLifeIsDope69",
                                                                                    "body": "That’s essentially central bankers in a nutshell. Holy shit he’s really catapulted himself into a new class of elites with all this bullshit",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "SenBaka",
                                                                                            "body": "This has nothing to do with the central bank that capital is mostly from investment firms",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "MyLifeIsDope69",
                                                                                                    "body": "Not what I was saying. He’s created An infinite money glitch for himself like becoming a central banker",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SenBaka",
                                                                                                            "body": "Oh lol. Yea free money thats why im balls deep in mstr. The capital markets part of the equation is easy. Now btc just gotta not tank or hopefully grow 20% / yr while mnav expands cuz saylor keeps acquiring with extremely accretive leverage",
                                                                                                            "score": 0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ResponsibilitySea327",
                            "body": "It will probably be both",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "MyLifeIsDope69",
                                    "body": "The Trump strategy to wealth I see. How intelligent to bankrupt himself on purpose 🕵️‍♂️",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pizzamaphandkerchief",
                            "body": "Satoshi himself said zero or infinity",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Meme_Stock_Degen",
                            "body": "I feel him. He’s been rich for a longggggg time I imagine there isn’t much else to do but yolo",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "United_States_ClA",
                    "body": "I didn't know it was possible for a corporation to do so many different types of offerings\n\nAnd he just throws it all at Bitcoin, the conviction is nutty",
                    "score": 19,
                    "replies": [
                        {
                            "author": "michaelt2223",
                            "body": "Not really he’s working for Silicon Valley to pump the price. His exit is kickbacks from the valley",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "WasteFront1988",
                                    "body": "lol",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Lucifer_Jay",
                                            "body": "I have friends give me free drugs all the time. You need to look in the mirror in more than one way.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "joeg26reddit",
                    "body": "SAYLOR MOON",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "JoJackthewonderskunk",
                    "body": "It would be the most hilarious thing to ever happen though. Unless there is some weird sec rule for selling assets that I don't know about just the selling part would be completely legal. If they dumped their 40ish billions on the open market for some reason it would not be against the nonexistent laws.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "upboat_",
                    "body": "Yeah maybe an hero. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BIGBADLENIN",
                    "body": "He is only saying what is in his interest. The man is a conman and a convicted fraudster. Of course he will cash out when he thinks it's his best option",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SenBaka",
                            "body": "He can say whatever he wants lmaooo that doesnt change whats on the term sheets for the capital he raises and in turn how accretive is to mstr shareholders",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Accomplished_Net7386",
                    "body": "Nah that motherfucker gives off scammer vibes. He’s already been done for fraud once, what’s to stop him doing it again ? Especially seeing Crypto is practically unregulated and what would the crime even be, if he dumped his bags on everyone?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SenBaka",
                            "body": "What fraud could he possibly be committing? Every mstr product is published and regulated by the sec and is purchased by willing and educated market participants who understand the laundry list of risks associated with any mstr security. Like investing in any startup or pubco or other company sometimes it works sometimes it doesnt but he is not defrauding investors hes doing exactly what he says hes going to do with the capital🙄 if you want an example of fraud check out what happened at nikola",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Accomplished_Net7386",
                                    "body": "I should have worded that differently. I’m not saying he’s committing fraud fraud, I’m saying he might be “defrauding” investors in that he’s putting on the” Hero never gonna sell act” while he secretly has an exit plan. I brang up the previous fraud as an example that he has no problem lying to investors.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "daRaam",
                    "body": "Don't be a fool, his game plan is use bitcoin to accumulate wealth. As soon as Elroy and Frump got involved that is all now in question.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "SenBaka",
                            "body": "They are the most pro btc / crypto of any admin ever. Just listen to the orange man when it comes to money. He wants crypto up it will go up. Easy mode is back",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "Reasonable-Low-1789",
                                    "body": "He’s always been great in business. From casinos to steaks to colleges. Unregulated financial instruments? Certainly can’t go tits up lol",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "SenBaka",
                                            "body": "Since you have more money and power than him you must know better. I respect you and im going to listen to you👍 man in the arena",
                                            "score": -14,
                                            "replies": [
                                                {
                                                    "author": "corydoras_supreme",
                                                    "body": "Hey, I love toots and jokes too, but that's a pathetic take.  Go tesler.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Emotional-Price-4401",
            "body": "Hello fellow MSTR bag holder",
            "score": 201,
            "replies": [
                {
                    "author": "baybridge501",
                    "body": "Collect those sweet covered call premiums. They’re always juicy on MSTR.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Emotional-Price-4401",
                            "body": "I dont have options but i should lol",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "SugarLanded",
                            "body": "Covered calls don't make much sense. Why are you in any position you think is going to go down? Covered calls give back like 1% vs. what you lose on owning 100 shares. And then when it goes up you've limited your gains. \n\nJust don't own the stock if you think it's going down. Covered calls are like trying to time or guess the market.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "baybridge501",
                                    "body": "Covered calls are how you make money off a stock you are bag holding and don’t want to keep.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SugarLanded",
                                            "body": "How are you making money doing that? You either lose money when the stock falls or have to sell your shares at an unfavorable price if it goes up. If you own a stock and it goes down, you need to get out or continue to DCA into the stock....or do nothing.\n\nYou should only do covered calls when you own a stock that has gone up a large amount. Then from a position of power, you sell a covered call with the assumption that the stock will pull back. Even then I'd never sell more than .10 delta call and be very quick to exit if the stock starts going up again. \n\nCovered calls don't give much protection when, by default, you have to own 100 shares of the underlying. So you will never be net positive from a downside move. Luckily you can just do spreads to balance delta exposure if you need protection.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "baybridge501",
                                                    "body": "This is basically the options wheel idea. It’s not for stocks you want to hang onto long term. And you sell at a favorable strike, not at the current strike where you’d lose a bunch of money if your shares got called.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cwep2",
            "body": "If they short in the size they would need to do just to hedge their longs, whoever they do it with is going to hedge *that* position by selling BTC anyway. Either way if they want to short then >=500k BTC is being sold.\n\n5-10% of kind of size would put BTC sub their breakeven (~70k).",
            "score": 38,
            "replies": []
        },
        {
            "author": "Oxy_Moronico",
            "body": "From r/buttcoin u/depressedrepo\n\nA trader thinks that the prices of eggs are going to increase, and so he contacts his broker and asks him to buy 1,000,000 egg futures at $1.70\nSure enough, a week later, the price of egg futures is $2.50, and the trader, happy to ride his winners, places an order for 3,000,000 more egg futures\n\n\nNext month, at $4.30 a piece, he pats himself on the back and restructures his liquid investments to buy another 10,000,000 egg futures\nAt the end of the quarter, egg futures are trading at $7, and the trader finally calls up his broker and tells him to sell them all\nThe broker replies: “To who? You’re the egg man!”\n\n\nMichael Saylor having bought $21B+ Bitcoin at ~$100k is the ultimate egg man.\nAs soon as his ability to buy dried up, the market tanks as we found out he was the only and last buyer.\n\nEdit- Credit to someone in buttcoin sub for this but I screenshotted it and can’t find the comment.",
            "score": 366,
            "replies": [
                {
                    "author": "Bottle_and_Sell_it",
                    "body": "Wait, then who is the walrus?",
                    "score": 80,
                    "replies": [
                        {
                            "author": "namtab00",
                            "body": "Vladimir Ilyanovich Lenin!",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "silentpopes",
                                    "body": "STFU Donny!",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "___tomk",
                                            "body": "The egg is not the issue here",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Obsidianram",
                                                    "body": "Goo Goo Ga Joob...",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SocialSuicideSquad",
                            "body": "Jim Carrey",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "buckrode0",
                            "body": "Billy shears or whoever is paul McCartney lol",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "geo2515",
                                    "body": "That’s Ringo dude",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bmarvin35",
                            "body": "I am",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Tha_Sly_Fox",
                            "body": "The same ones kicking Edgar Allen Poe",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Greensentry",
                            "body": "Always has been Rick Astley.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GSmithDaddyPDX",
                    "body": "🤔 what if you buy the egg futures with a fund of other people's money to begin with though\n\npeople's 401ks and other investment funds unknowingly in egg futures while trader continues to buy them up with his own personal and other's money, then knows exactly when the price will go up, and when it will crash, allowing him and friends to sell personal and buy shorts at the optimal time 🧐\n\na wealth transfer of the ages, straight from people's 'automatically managed' retirement accounts\n\npump the price with other people's money and let them hold the bag when you sell it off - ez pz get me in wallstreet",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "1toughneighbour",
                    "body": "You copied this whole thing word for word from a post on Buttcoin called \"Saylor is the Egg Man\"",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Oxy_Moronico",
                            "body": "100% and I didn’t have the original posters username but I’ll find it and edit it tagging them now.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "1toughneighbour",
                                    "body": "No worries. You acknowledged it and were honest with your intentions. May Health and Wealth be with you!",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Oxy_Moronico",
                                            "body": "Didn’t expect anyone to read it but the op of the egg man was an impactful post I saved the screenshot so I should’ve expected others would enjoy the story as much as I did so it was 100% my bad",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Miserable_Message330",
                            "body": "Probably a bot",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "doomslothx",
                    "body": "This ignores the reality that 500k BTC is only 2% of the total supply of BTC. It also ignores the ~ amount that Blackrock hold, and others with ETF stakes who will control price flux to maximise investor portfolio fees. \n\nIt ignores the 1m wallets that hold 90% of the total value of BTC in them that have has a 30d average increase of anywhere between 5-15% in holdings during the sell off , it also ignores the exchanges that push trade volume that fluctuates between the hundreds of millions to billions a day. It ignores the whale who bough 45k BTC off kraken over a 3 day period etc etc. \n\nWhile this analogy works in a space where millions or billions move the dial, billions at this point for BTC does not have that much influence on price flux. For BTC to drop 7% it took $200b in liquidation. \n\nBTC at this point is scattered across too many scenarios to have one person influence its price. Look at the recent 500m leverage as a case study. Bunch of regards on Twitter tried to liquidate a 40x leveraged short and barely moved the dial in a “coordinated attack”, granted their total attack was less than 50m in volume the point remains. \n\nThe egg man analogy works for shitcoins, but BTC is in a different realm. Also not a maxi, just making a point about how narrow viewed people are when it comes to market cap and how wide the support structure for bitcoin price is given it’s growing popularity as a store of value.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Wise-Start-9166",
                    "body": "That really zigged where I thought it would zag.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pmercier",
                    "body": "Well, not exactly… still have the Bitcoin act, coming to a theatre near you",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dheera",
                    "body": "If countries start buying bitcoin he will have buyers.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Oxy_Moronico",
                            "body": "SOON tm",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Qwerty177",
                    "body": "Sell to me. I’ll buy",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "shift_or_die",
                    "body": "To whom?*",
                    "score": -5,
                    "replies": [
                        {
                            "author": "BrutalHunny",
                            "body": "You’re bitch panties are showing.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "shift_or_die",
                                    "body": "Your* (thanks for teeing me up like that)",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "BrutalHunny",
                                            "body": "It wasn’t easy, autocorrect kept changing it. 😂",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MarcoRuaz",
            "body": "\"There are three ways to make a living in this business: be first, be smarter, or cheat. - Margin Call.\n\nRug pull about to happen.",
            "score": 15,
            "replies": []
        },
        {
            "author": "youyololiveonce",
            "body": "Yep you should short it !",
            "score": 74,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                    "score": 178,
                    "replies": [
                        {
                            "author": "Felis23",
                            "body": "Good bot",
                            "score": 50,
                            "replies": []
                        },
                        {
                            "author": "United_States_ClA",
                            "body": "You are not a bot any longer",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Kali-Lionbrine",
                                    "body": "Hilarious profile mr Ligma",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "AutoModerator",
                                            "body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "BigEE42069",
                                                    "body": "ligma balls bish",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "AutoModerator",
                                                            "body": "ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "IceShaver",
            "body": "lol in that scenario bitcoin crashes to a few thousand not 30k",
            "score": 34,
            "replies": [
                {
                    "author": "TomatoSpecialist6879",
                    "body": "I'm ultra bearish on MSTR but you regards are really extra strength regarded. They're a publicly traded company, not a regarded p&d Discord group consisting of a bunch of retail traders. Everything from selling of assets to raising money through bonds have to be publicly ANNOUNCED to their investors and APPROVED by the board before it ever starts",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FallenWiFi",
                    "body": "Nobody is selling past 16k",
                    "score": -4,
                    "replies": [
                        {
                            "author": "dinglebarryb0nds",
                            "body": "Remind me!  20 years",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "RemindMeBot",
                                    "body": "I will be messaging you in 20 years on [**2045-03-19 00:40:49 UTC**](http://www.wolframalpha.com/input/?i=2045-03-19%2000:40:49%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1jeis5p/will_bitcoin_burn_everyone_this_time/mije6v8/?context=3)\n\n[**7 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1jeis5p%2Fwill_bitcoin_burn_everyone_this_time%2Fmije6v8%2F%5D%0A%0ARemindMe%21%202045-03-19%2000%3A40%3A49%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201jeis5p)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RazvanTheRomanian",
            "body": "If they would sell, I am sure they will buy back more at the bottom ;) saylor will die without Bitcoin",
            "score": 19,
            "replies": [
                {
                    "author": "ModeForJoe",
                    "body": "It's his spice",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adorable_Paint",
            "body": "You have copied and pasted this to like 4 different groups now. Shorting, I guess?",
            "score": 16,
            "replies": []
        },
        {
            "author": "420osrs",
            "body": "Op, For some reason you think that microstrategies public wallets aren't tracked.\n\n\nYou can't sell on the OTC market without moving it to an intermediary wallet.\n\n\nThis post is actual misinformation or you lack the capabilities of using a computer. This is fundamental misunderstandings of how things work on a base level. ",
            "score": 14,
            "replies": []
        },
        {
            "author": "cannythecat",
            "body": "Did everybody forget Saylor destroyed the market back in 2001 when he initiated the bursting of the dot com bubble when MSTR's stock price collapsed after being exposed for accounting fraud? Now we gonna let him do this shit again?",
            "score": 57,
            "replies": [
                {
                    "author": "wallstreetstonks",
                    "body": "This statement is a mix of truth and exaggeration. Let’s break it down:\n\t1.\tMichael Saylor & MicroStrategy (MSTR) in 2001\n\t•\tIn March 2000, MicroStrategy (MSTR) restated its financials due to aggressive accounting practices that overstated revenues.\n\t•\tThis caused MSTR’s stock to collapse from about $300 to $30 in a day, erasing billions in market cap.\n\t•\tThe SEC charged Saylor and other executives with civil fraud, and they settled without admitting wrongdoing.\n\t2.\tDid this “initiate” the dot-com bubble burst?\n\t•\tNo, the dot-com bubble was already at a breaking point due to widespread overvaluation, excessive speculation, and unprofitable business models.\n\t•\tThe NASDAQ had already peaked on March 10, 2000, before MicroStrategy’s crash.\n\t•\tWhile MSTR’s collapse shook confidence in tech stocks, it wasn’t the primary cause of the crash—it was just one of many overhyped companies that unraveled.\n\t3.\tIs he “doing this again” with Bitcoin?\n\t•\tSaylor has heavily leveraged MicroStrategy to buy Bitcoin, making it a de facto Bitcoin ETF.\n\t•\tIf Bitcoin collapses, MSTR could face massive losses, potentially triggering a stock crash.\n\t•\tHowever, unlike in 2000, there’s no fraud accusation—just high risk, high leverage, and extreme bullishness on BTC.\n\nVerdict:\n\nThe statement is partly true but misleading. Saylor’s 2000 fiasco hurt markets but wasn’t the cause of the dot-com crash. His Bitcoin strategy today is risky, but it’s not equivalent to accounting fraud.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "EQRLZ",
                            "body": "ThanksGPT",
                            "score": 32,
                            "replies": []
                        },
                        {
                            "author": "Bekabam",
                            "body": "Couldn't you have put even 1% effort into making this response less AI?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "wallstreetstonks",
                                    "body": "Nope, it’s fully a fact check from chat gpt",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "PM_ME_RYE_BREAD",
                                            "body": "ChatGPT gets very simple details blatantly wrong with alarming frequency when I use it, I would not rely on it to “fact check” things with zero outside confirmation.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ZKarz7",
                            "body": "No accounting fraud YET.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "paranoidindeed",
                            "body": "Breaking point due to widespread overvaluation, excessive speculation, and unprofitable business models. Thank god it doesn’t sound like crypto at all",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BlackeeGreen",
                            "body": "> In March 2000, MicroStrategy (MSTR) restated its financials due to aggressive accounting practices that overstated revenues.\n\nAKA the SEC charged them with fraud and they had to settle.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sam-sung-sv",
            "body": "I highly doubt MicroStrategy or ETFs would liquidate if that were to happen.\n\nMicroStrategy didnt sell when it went below 18K so yeah",
            "score": 7,
            "replies": []
        },
        {
            "author": "123supreme123",
            "body": "While we're on conspiracy theories, what if saylor decides to move all the bitcoin into cold storage, then moves to the bahamas.  Or makes a tic tok video of himself destroying $27 billion in bitcoin with a baby hammer",
            "score": 8,
            "replies": []
        },
        {
            "author": "Underwater_Grilling",
            "body": "If yall bought 10k worth 10 years ago, you'd be a cabinet member",
            "score": 6,
            "replies": []
        },
        {
            "author": "NoPrimary2497",
            "body": "I hope so , so sick of broke people telling me this shit gonna moon when the government buys it",
            "score": 51,
            "replies": [
                {
                    "author": "BurtDickinson",
                    "body": "It did moon. It’s on the moon.",
                    "score": 55,
                    "replies": []
                },
                {
                    "author": "Son_Of_Toucan_Sam",
                    "body": "Bruh someone figured out a way to essentially have a car idling 24/7 to produce solved sudokus you could trade online for heroin\n\nAnd now each one of those sudokus trades for as much as $100k\n\nThat’s not even going to the moon anymore; that’s inventing a moon from scratch",
                    "score": 44,
                    "replies": [
                        {
                            "author": "djchanclaface",
                            "body": "I love this breakdown ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "groovemonkey",
                    "body": "AFAIK, the government isn’t “buying” any.  They’re just holding on to what they’ve confiscated.   Just the concept that they can confiscate a decentralized asset kinda makes it a little sketch to me.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Bottle_and_Sell_it",
                            "body": "Maybe if it had any sort of central authority they wouldn’t be *able* to confiscate it, BTC ever thought ab that huh?!",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Zephyr4813",
                            "body": "You cannot picture a scenario where the government can seize bitcoin?\n\nIf you know anything about bitcoin, you also know how you can make it impossible to seize.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Weekly_Village7338",
                    "body": "Massive cope.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Ok-Efficiency-5728",
                    "body": "Crypto bros call themselves investors, but their 'net worth' is just vibes",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "mapoftasmania",
                    "body": "They ain’t buying any. They just decided to transfer all the BTC they seized into one place, rather than sell it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adventurous_Garlic58",
            "body": "This is the signal to buy more mstr everyone has been waiting for.",
            "score": 5,
            "replies": []
        },
        {
            "author": "PastaVeggies",
            "body": "Dont tease me with 30k bitcoin",
            "score": 9,
            "replies": [
                {
                    "author": "joefunk76",
                    "body": "20 years from now: Don’t tease me with 30m bitcoin.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "balls-deep_in-Cum",
            "body": "“Will bitcoin burn everyone this time?” Said everyone last time and the time before that. And then also said “man i wish i bought at 16k” people just needa shut up and wait. Its volatile. It was 112 a month and a half ago it MOVES fast. People tend to have short memories. Dont miss out",
            "score": 23,
            "replies": [
                {
                    "author": "karsnic",
                    "body": "Nailed it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tikiterps",
            "body": "Put the meth pipe down buddy and dump your bags so we can rip again lmao",
            "score": 5,
            "replies": []
        },
        {
            "author": "Basedandtendiepilled",
            "body": "Why does this sub suddenly have a hate boner for bitcoin",
            "score": 26,
            "replies": [
                {
                    "author": "Oxy_Moronico",
                    "body": "You used to get banned for writing bitcoin, which is where corn 🌽 comes from. It’s getting the same hate, just we’re able to voice it",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "DJ_Crunchwrap",
                    "body": "Half the sub hates it because they never bought any and missed out. The other half hates it because they're down money.",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "GiantCorncobb",
                    "body": "Suddenly? BTC has been 🌈 for years",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Normal-Tune-6819",
                    "body": "Nevause of Trump. average reddit behavior infiltrating the sub",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "spoofy129",
                    "body": "Crypto bros are insufferable and I'd imagine most people are sick of hearing about how \"revolutionary\" crypto is even though we are nearly 20 years deep without any real world  commercial applications",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Ok-Efficiency-5728",
                    "body": "Crypto bros saying 'we're early' like being broke is impressive",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "michaelt2223",
                    "body": "We’ve hated you losers since you started saying HODL",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 18,
            "replies": [
                {
                    "author": "pulkxy",
                    "body": "there's already quantum proof encryption according to my cyber security friend",
                    "score": 6,
                    "replies": [
                        {
                            "author": "ExaminationWise7052",
                            "body": "Eso significaría actualizar todas las direcciones, piénsalo es imposible y si lo fuese millones de BTC se perderían por el camino. Y todo esto tendría que hacerse antes de que fuese posible descifrsrlo luego la seguridad estaría comprometida para siempre.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EchoChamberReddit13",
                    "body": "Quantum computing is literally a decade out.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "gtwizzy8",
                            "body": "More like 3 but still it is coming.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "shawnbttu",
                                    "body": "in 3 decades i will be too busy drinking my neighbors blood for sustenance as the climate wars rage on around me so btc can be zero for all i care",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Broccoli--Enthusiast",
                            "body": "Its been a decade out since the 90s",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "EchoChamberReddit13",
                                    "body": "You know the blockchain can be updated and many have discussed it to great lengths.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "EchoChamberReddit13",
                                                    "body": "Do you think it’s going to just pop up and spread like wildfire? Look at how controlled usage of AI was. It will be tightly guarded and measures across the board will be resolved before its mainstream.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ribdrag",
                            "body": "MSFT chip turned decades into a few years until practical use",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Whatdosheepdreamof",
                    "body": "Won't it be over for all encryption?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kindly_Revert",
                            "body": "Post-quantum cryptography is being explored, but rewriting large parts of the block chain algorithms to use it is another story.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Whatdosheepdreamof",
                                    "body": "?? You'll have to fundamentally rewrite everything, not just BTC algorithms. All financial transactions use encryption. I don't understand the point your trying to make when your entire financial life revolves much more heavily around everyday banking which have the same security flaws...",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Kindly_Revert",
                                            "body": "Give it a read, it's already in the works for the major operating systems, at least for encryption in-transit. At-rest is another story.    \n\nhttps://www.microsoft.com/en-us/research/project/post-quantum-tls/",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "michaelt2223",
                                            "body": "Because who’s gonna be the one to save bitcoin and the blockchain. Europe will defend the euro. What military is gonna defend bitcoin for you?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Whatdosheepdreamof",
                                                    "body": "Why are you talking about military when this is purely about information security. BTC was invented by someone, so someone will help keep it alive. If BTC isn't salvagable, then it's value will go to 0.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "michaelt2223",
                                                            "body": "Because when things collapse militaries decide the future. Btc was invented by “someone” maybe. Might also be a gov project and that gov won’t need to save it",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Whatdosheepdreamof",
                                                                    "body": "It's pretty clear that politicians decide the future. There are 6 military juntas across the world. There are 195 countries. That makes 6/195 countries that are not run by some form of Government. In most circumstances where a military is used to restore collapsed countries, there is a transition back to traditional government. There have been 51 military take overs in modern history, of that 6 are left. So 6/51 chance that a military that holds power will stay in power in the proceeding years. So I'm not sure where you came to the conclusion that militaries will run the future governments of the world. But it's not based in reality.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zephyr4813",
                    "body": "If quantum computers break encryption the bitcoin network will be the last of your worries.\n\nAlso, it won’t. Bitcoin protocol would change if there were a snowballs chance in hell of it happening anytime soon.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "InclementBias",
                    "body": "there are already contingencies in development for this. not saying they're fully baked or ready but I think that level of encryption breaking will potentially break society and tradfi rather than just wallets",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "occitylife1",
            "body": "This dude has more BTC than US and China combined.  That’s ridiculous and a bit scary.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Goldleader-23",
            "body": "It's all a giant ponzi scheme",
            "score": 17,
            "replies": [
                {
                    "author": "fourbutthick",
                    "body": "America is a Ponzi scheme!",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Gig-a-bit",
                            "body": "You misspelled “World”!",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "joefunk76",
                    "body": "Every investment is a Ponzi scheme. You buy it in hopes of selling it to someone else for more than you paid.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "mttdesignz",
                            "body": "but that's not what a Ponzi scheme is..",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "Ok-Efficiency-5728",
                            "body": "Or, you know, to receive a dividend..",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zuziannka",
            "body": "MFer saylor ruined bitcoin",
            "score": 6,
            "replies": []
        },
        {
            "author": "TopherBrennan",
            "body": "\\> If BTC no longer grows exponentially\n\nIt's worth more than 10% of all the gold in the world. Even in the best-case scenario it doesn't have much more room to grow. And I don't even think it'll make it that far—Trump II seems too incompetent to do the bitcoin strategic reserve right.",
            "score": 6,
            "replies": [
                {
                    "author": "Zephyr4813",
                    "body": "Bitcoin doesnt need the strategic reserve. Hell, it hit $68k last cycle and there werent even ETFs.\n\nBitcoin will meet gold parity ~1m per bitcoin and go up from there, because it is better than gold",
                    "score": 0,
                    "replies": [
                        {
                            "author": "PuzzleheadedWeb9876",
                            "body": ">because it is better than gold\n\nGold is useful. So has that going for it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TopherBrennan",
                                    "body": "Bitcoin is useful too! Unfortunately all the uses are crime which is a big problem in terms of regulatory risk.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Zephyr4813",
                                            "body": "Yeah good thing good old US dollars arent involved in anything shady!",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "TopherBrennan",
                                                    "body": "Yeah and there's a reason everyone (including, importantly, banks) is required to report cash transactions of $10,000 or more, regulators are ALSO suspicious of fat stacks of C-notes.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Zephyr4813",
                                                            "body": "Yeah and when inflation makes the average rent price >$10k we can make our noble overlords aware of even more of our transactions! Lovely",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "TopherBrennan",
                                                                    "body": "This is irrelevant to the question of regulatory risk.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Zephyr4813",
                                                                            "body": "So you just want bitcoin transactions above an arbitrary size to be reported to the government authority? Lmao",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TopherBrennan",
                                                                                    "body": "I am not saying that, and you seem confused about the meaning of \"regulatory risk\": [https://www.investopedia.com/terms/r/regulatory\\_risk.asp](https://www.investopedia.com/terms/r/regulatory_risk.asp)",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Zephyr4813",
                                                                                            "body": "Who cares? Everything has regulatory risk. Maybe spell your point out plainly?",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Zephyr4813",
                                    "body": "Golds “utility” is secondary and it was used as money/store of value long before electronics.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PuzzleheadedWeb9876",
                                            "body": ">Golds “utility” is secondary and it was used as money/store of value long before electronics.\n\nYeah electronics weren’t really a thing back in the late 1800s. Now it’s supremely useful. Meanwhile BTC has yet to find a single practical use case.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Zephyr4813",
                                                    "body": "You cannot imagine a single practical use case of bitcoin?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "PuzzleheadedWeb9876",
                                                            "body": "Used to be drugs when privacy wasn’t a concern.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Zephyr4813",
                                                                    "body": "I want you to think real hard for me because it is embarrassing if you cannot imagine one. Feel free to use an LLM to help you",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PuzzleheadedWeb9876",
                                                                            "body": "No. Why don’t you tell me?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Zephyr4813",
                                                                                    "body": "Transferring value through space AND time\n\nKeeping your capital in your brain (seed phrase) in an unseizable way\n\nCollateral for loans\n\nFleeing a corrupt country while taking stored value with you and not losing everything to a government that debanks you, takes your property, etc?\n\nThis is the top of my head. You have a lot of reading to do if these did not occur to you my friend.",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PuzzleheadedWeb9876",
                                                                                            "body": ">Transferring value through space AND time\n\nCannot every crypto currency do this? Don’t buy the time travel aspect though.\n\n>Keeping your capital in your brain (seed phrase) in an unseizable way\n\nNot a use case. That’s just memorization.\n\n>Collateral for loans\n\nIs this the best you can come up with?\n\n>Fleeing a corrupt country while taking stored value with you and not losing everything to a government that debanks you, takes your property, etc?\n\nAgain cannot every crypto currency can do this? Why not use a stable coin or something more privacy focused instead?",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Zephyr4813",
                                                                                                    "body": "So youre just comparing to bitcoin to crypto at this point? Gave up on gold already? Lmao\n\nWhat is the stablecoin tied to?\n\nWhat crypto has held its value better over time than bitcoin?\n\nWhat crypto has the largest and strongest network?\n\nWhat is the most widely accepted cryptocurrency?\n\nMost importantly, what other crypto is completely decentralized and trusted to have no issuer who can manipulate it?\n\nPlease just read some books. Broken Money by Lyn Alden is a good start.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Manwithnoplanatall",
            "body": "I think these people actually believe crypto will save us all… all the while having zero clue how the economy, the government, and money works.",
            "score": 3,
            "replies": [
                {
                    "author": "Zephyr4813",
                    "body": "Bitcoiners typically know the most about these topics.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Objective-Name-811",
            "body": "Trump's people already have said they want to be aggressive and keep buying BTC.\n\n\nTake that for whatever it may mean",
            "score": 6,
            "replies": [
                {
                    "author": "Vegetable-Shelter974",
                    "body": "Trumps people will benefit, you will not. He’ll tell you one thing and then do the other.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "npcdisrespecr",
                            "body": "man, i'm so sick of normie redditors in this sub. begone!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Agile_Sheepherder_77",
                    "body": "Putting faith in anything that Trump touches is idiotic.",
                    "score": 46,
                    "replies": []
                },
                {
                    "author": "realestatedeveloper",
                    "body": "It means they are piling up shorts and are doing exactly what OP suggests Saylor should do (and probably is personally)",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Accomplished_Fix5702",
                    "body": "What would they buy it with... Where is the cash coming from - taxes?  Mythical savings in federal spending, which even if real could be spent on something better or returned to tax payers. Doesn't make sense to me.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Zephyr4813",
                            "body": "Sell assets like gold, issue bitcoin bonds like a lot of companies are doing, or just print money lol USD isnt backed by anything hard",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Objective-Name-811",
                                    "body": "Probably why him and Elonia Trump wanted to check out the gold at Ft Knox",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Huckleberry-V",
            "body": "Too paranoid. MicroStrategy isn't what keeps bitcoin secure, it's the continued investment of people with other assets like Blackrock.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Stuning_brave_potato",
            "body": "Whatever you’re smoking I want some!!!! Because you are not looking at historic data and pulling wild theories out of your ass😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "Comprehensive-Log144",
            "body": "For those lucky enough to have sold, congratulations. This is gambling, except the house controls the rules, they will decide when they when and how they win. You are the fools who are being scammed. \nIn every scam, some folks make money so others will join in for the promise of riches for all. Good luck. I told you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "throwaway923535",
            "body": "I could absolutely see Saylor orchestrating something like this.  Sell all his shares, short it aggressively then start dumping.  Total slimebag",
            "score": 2,
            "replies": []
        },
        {
            "author": "watchface38",
            "body": "You are paranoid but i like your take.\nSaylor is sus from the beginning",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unique_Name_2",
            "body": "There arent really any short btc options big enough for them to do that meaningfully.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PontificatingDonut",
            "body": "Setting up a short and then selling tons of bitcoin to lower the price is scammy but a very normal thing that happens in the cryptoverse. I don’t know what Saylor is going to do if bitcoin drops a lot but I know he has options",
            "score": 1,
            "replies": []
        },
        {
            "author": "cointalkz",
            "body": "That would ruin the entire ethos of MicroStrategy since Saylor says they're never selling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "United_States_ClA",
            "body": "As soon as someone noticed any of the MSTR wallets doing any sort of funky business there'd be a clown fiesta with the common stock",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdamAThompson",
            "body": "Reap the whirlwind?",
            "score": 1,
            "replies": []
        },
        {
            "author": "PersonSeenAtYourDoor",
            "body": "I hope so",
            "score": 1,
            "replies": []
        },
        {
            "author": "easily_erased",
            "body": "Smart money is quietly moving toward the exits with respect to MSTR; just looked through the prospectus for the STRF 10% preferred shares they announced today and it has some pretty tough terms when it comes to liquidation preference/missed dividend payments. Outside of BTC cultist circles clearly people have taken note of the fact that this company is piling up debt, and is soon to be piling up more debt to pay dividends on the old debt... 🤔",
            "score": 1,
            "replies": [
                {
                    "author": "Zephyr4813",
                    "body": "Why is debt bad?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "nevyn",
                            "body": "It's basically a giant FX trade of USD vs. BTC. If USD goes down (inflation) and BTC goes up, they print money. If USD stays flat and BTC goes down, they have problems.\n\nGiven the clowns running the US govt. option 1 seems more likely, so it's fine/good. If anyone stops the clowns, it's probably bad.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Zephyr4813",
                                    "body": "Lol ill bet on 1",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comfortable-Spell-75",
            "body": "Define “everyone” ![img](emote|t5_2th52|12787)",
            "score": 1,
            "replies": []
        },
        {
            "author": "syrozzz",
            "body": "One thing I'm dead sure of if things go awry, Saylor is going down with the ship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nevergonnastawp",
            "body": "I saw this post already today",
            "score": 1,
            "replies": []
        },
        {
            "author": "danjl68",
            "body": "Both",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whatever801",
            "body": "IDK man maybe maybe not",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaybeYesMayb",
            "body": "I think bitcoin either sky rockets or saylor might be willing to suck on the barrel of a 9mm",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaybeYesMayb",
            "body": "I think bitcoin either sky rockets or saylor might be willing to suck on the barrel of a 9mm",
            "score": 1,
            "replies": []
        },
        {
            "author": "BagofBabbish",
            "body": "This is stupid. He’s not going to be able to do a massive pump and dump of Bcoins.\n\nYou can’t treat them like a whale or a hedge fund manager. They’re a public company that has to comply with disclosure laws and cannot knowingly provide shareholders with misleading information. Yes, Elon got a slap on the wrist for $420 funding confirmed, but this is completely different. You can’t petition Congress to adopt a bitcoin treasury, file your intentions not to sell your company’s crypto reserve in your sec filings, write books about not selling your bitcoin, rename your company “strategy” with a Bitcoin logo, and then pull a mega pump and dump rug pull on your shareholders. This isn’t like Elon and his DOGE PA. That’s wire fraud, securities fraud, and a litany of felonies.\n\nThere is a scenario where they sell, but that would require extenuating circumstances where they had to in order to avoid insolvency. Again, this isn’t like a company adding an immaterial amount of bitcoin to their balance sheet and noting they’re marketable securities (or whatever you’d call crypto) that may be sold, or a pumper with their PA. This is a company that made their logo the Bitcoin symbol.\n\nI will also caveat that I don’t expect Bitcoin to hold up indefinitely - it will likely fall, just like it does in every other cycle, and Saylor very well might get burned. This scenario detailed by OP isn’t going to happen though lmao. If it does, Saylor will be going to jail longer than Bernie Madoff.",
            "score": 1,
            "replies": [
                {
                    "author": "Zephyr4813",
                    "body": "I’m glad at least one person here is capable of seeing how stupid this post is.\n\nI will add that MSTR already stomached a bear market for bitcoin. It always goes up over a period of at least 4 years though.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "BagofBabbish",
                            "body": "I used to do IR for sketchy companies. I know very well what’s permitted and what’s not.\n\nWhen you make your company logo the Bitcoin symbol, dedicate half your earnings call to Bitcoin, give speeches telling people they should “never be selling your Bitcoin”, lobby Congress about adopting Bitcoin, share your $1B+ per coin price target explaining WHY you never sell your Bitcoin, list your allocation and intention not to sell your Bitcoin in your filings, establish a “Bitcoin yield” and pioneer Bitcoin convertible notes… you can’t just pull a pump and dump. It’s effectively giving guidance without a safe harbor.\n\nrump and the US government COULD very easily decide to liquidate whatever the hell makes it into the strategic reserve. A company that adopts a bitcoin allocation in their corporate treasury could very easily strategically allocate as needed, including liquidations at perceived peaks, just like managing their debt stack. MSTR is stuck with their Bitcoin until they state otherwise.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Euler007",
            "body": "I just hope this time they put Saylor in jail for a few hundred years, one less bad actor for the next bubbles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jesmatz8",
            "body": "Air - Remember",
            "score": 1,
            "replies": []
        },
        {
            "author": "endless_looper",
            "body": "You belong here",
            "score": 1,
            "replies": []
        },
        {
            "author": "AddisonsContracture",
            "body": "How many times are you going to post this exact same thing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "old-bot-ng",
            "body": "Just wait for the right narrative. Exchanges and standard bandwagon are ready for the “what do you want? Do you want money or do you want coins?”. Hodlers are ready too 🤭",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amazing-Treat-8706",
            "body": "Who is going to buy microstrategys bitcoin?   There no buyers for that much.  I’m pretty sure his strategy is to buy and hold forever.",
            "score": 1,
            "replies": [
                {
                    "author": "Zephyr4813",
                    "body": "Anything they buy is removed from exchanges forever imo",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FalseFurnace",
            "body": "https://preview.redd.it/kblnhy35gjpe1.jpeg?width=822&format=pjpg&auto=webp&s=dddebeaa976b888ff6496a7613f1543774bbba9f",
            "score": 1,
            "replies": []
        },
        {
            "author": "Significant_Donut967",
            "body": "Lmao if you see what trumps doing and don't think a huge dump is coming.... don't get fucked over.",
            "score": 1,
            "replies": [
                {
                    "author": "Zephyr4813",
                    "body": "Tell me, what is Trump doing? Planning to dump bitcoin for something the US can print?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ElderGoose4",
            "body": "Inverse wsb",
            "score": 1,
            "replies": []
        },
        {
            "author": "Financial_Load7496",
            "body": "Time will tell which is exciting.  When i play monopoly .. I make sure to check the pockets of my shady playing partners.  Fack your shitty dollars.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotMe357",
            "body": "Lif he did that, then 🥭 will deport him lol. I don't think he dared to do that ![img](emote|t5_2th52|4640)",
            "score": 1,
            "replies": []
        },
        {
            "author": "rmgraves67",
            "body": "Just write a program to repost this trash every week for the next 20 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aranthos-Faroth",
            "body": "OP’s post history is creative",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wise-Start-9166",
            "body": "It's funny because BTC at 30 or 40 is what we should expect irrespective of what micro strategy is up to",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Jolly-Joker",
            "body": "I feel stupid-er having read this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "michaelt2223",
            "body": "Yes bitcoin is a scam and Silicon Valley is currently exiting the scam. They do want to push it up again before the bitcoin reserve purchases lets them fully cash out",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClarkFable",
            "body": "Allies kaput",
            "score": 1,
            "replies": []
        },
        {
            "author": "Antique-Flight-5358",
            "body": "Letting one corporation accumulate so much Bitcoin defeats its purpose.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tx_traveller",
            "body": "Mstr has been red almost all of last year. I shorted when it reached around $400 . Going long puts on this business that creates nothing",
            "score": 1,
            "replies": [
                {
                    "author": "TrainingAffect4000",
                    "body": "Mee too",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OkStandard8965",
            "body": "MSTR is a standard ponzi, on top of that they hold such a large position that their own liquidation will likely cause a price decline leading to a snowball effect. \n\nAs soon as people think they won’t make money buying bitcoin, it’s over",
            "score": 1,
            "replies": []
        },
        {
            "author": "danuser8",
            "body": "You forget that micro strategy is not just own BTC directly but is also leveraged in BTC.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1toughneighbour",
            "body": "It's a publicly traded company - which means they're subject to strict regulations and reporting requirements. \n\nAre people on this sub just stupid like OP or am i missing something? \n\nBesides they can't just sell OTC in secret slowly when their wallets are known to the community. \n\nOP do you even understand how any of this works? Before you make posts like this, why don't you try asking an LLM if your scenario is even plausible?",
            "score": 1,
            "replies": []
        },
        {
            "author": "DisgruntledTexan",
            "body": "Not yet.  But in 10 years, when Russia, China and NK all sell, yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "critikalhd",
            "body": "https://preview.redd.it/3oioarvrejpe1.jpeg?width=682&format=pjpg&auto=webp&s=dbcf4b40bc981b68f1a0f95c8b984a47dcf933f6\n\nWe have no confidence in your ability to identify macroeconomic trends.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ninerjoe",
            "body": "Can they buy puts on themselves on expiration day and dump BTC? BTC going down would be more than made up for with those worthless puts going ITM.",
            "score": 1,
            "replies": []
        },
        {
            "author": "edwinchs",
            "body": "I think in human history, all assets/technology leads to some sort of bubble.  \nMaybe bitcoin is just another one, maybe it will lead to another actual crysis, who knows?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Able_Web2873",
            "body": "I wanna see corn back up over $100k and Mstr at $500 to fuck you",
            "score": 1,
            "replies": []
        },
        {
            "author": "ModeForJoe",
            "body": "https://preview.redd.it/o7g697f4ojpe1.jpeg?width=888&format=pjpg&auto=webp&s=44adae8ffc401d1ceeff9997e4dccf430cc8718a",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpaceX2024",
            "body": "I don't believe it. Saylor is a degenerated Bitcoin maxi. He really means what he's brabbling all day. They won't sale.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrassSmall6798",
            "body": "It wont, dont worry about it. Just hold for years. It barely moves with mstr purchases. The distribution of btc is spread out well. Even satoshi only owns 5 percent. It cant even tank more then 5 percent from his sale. 18 lost, its like 75 percent in the hands of individuals. Governments are slowely losing there chance to own btc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "veryfatcat",
            "body": "then I will buy more pepe coin",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoldenMegaStaff",
            "body": "Imagine the value if they corner the market on Bitcoin and own all of them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrometheanEngineer",
            "body": "Who's buying that 500,000 BTC? \n\nMaybe the feds at this rate actually",
            "score": 1,
            "replies": []
        },
        {
            "author": "CommonExamination416",
            "body": "Sell just to fuck Saylor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TripleNubz",
            "body": "Makes bitcoin sound like a new great way to transfer wealth to a select few. Very interesting. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mimir_the_Younger",
            "body": "Tesla’s gonna burn everyone, probably (though we won’t know if it’s arson or if the stock just sometimes spontaneously combusts like the cars). \n\nNot sure about Bitcoin. It’ll drop. I’m dumb; I can’t understand what it’s for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "literalyfigurative",
            "body": "500k is less than 3% of all available Bitcoin, That's not enough to control the market like you're describing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RaechelMaelstrom",
            "body": "I think I just got a message from Fidelity saying MSTR is issuing more shares.",
            "score": 1,
            "replies": []
        },
        {
            "author": "colinallbets",
            "body": "Man you are all such unimaginative losers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jasperCrow",
            "body": "These sort of titles were interesting 10 years ago 🙄",
            "score": 1,
            "replies": []
        },
        {
            "author": "Obsidianram",
            "body": "DCA'ing *upward* is always the preferred method...ask Mikey",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeonsTheory",
            "body": "Pretty sure the long term game betting governments will eventually print is more stable",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaltyFuckingProcess",
            "body": "I think they should take the 50 Cent approach to bitcoin",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cheeky_Star",
            "body": "lol probably explains that 333 million short position. They know some liquidation may have to happen...![img](emote|t5_2th52|4271)",
            "score": 1,
            "replies": []
        },
        {
            "author": "SolanaToTheMooon",
            "body": "Yet another doom post - this here folks is another reminder to buy or hold right now",
            "score": 1,
            "replies": []
        },
        {
            "author": "wawaweewahwe",
            "body": "Saylor / MSTR owns what? 5% of BTC? Crazy to think about.",
            "score": 1,
            "replies": []
        },
        {
            "author": "teaux",
            "body": "No one should be \"invested\" in Bitcoin; it's a fucking obviously stupid concept.  Bitcoin is for money laundering, sneaking money out of China, and buying drugs - all of which are transactional.  The people who invented cryptocurrency never intended for it to be used as a store of value and it's atrocious in this application.  It's simply a tool for obscuring transaction details - it's *in the fucking name*.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Smh1282",
            "body": "I just need mstu to get close to 7 please for the love of god just one more good day",
            "score": 1,
            "replies": []
        },
        {
            "author": "Classic_Caramel_4258",
            "body": "I think you may think your actually on to something",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-End-2947",
            "body": "Maybe, but why do you think it will be different this time? \n\nIf we go into bear mode, next halving it's likely to pump to new ATH - so what makes you think the pattern has changed? \n\nIsn't trading mostly following the trend and being selectively contrarian?   \nThis screams of being contrarian and selectively following the trend \n\nMicrostrategy own about 2.5% of the total circulating BTC supply so they aren't a centralising factor - proof of work is the key mechanism here, not proof of stake (unlike ETH) so ownership doesn't mean anything in the long run. Miners secure the network and holders don't get to dictate direction  \n  \nYes they could move the price, but there are buyers waiting   \nExponential growth days are certainly over, but long term sustained growth is pretty much baked in",
            "score": 1,
            "replies": []
        },
        {
            "author": "sixty9shadesofj",
            "body": "Hubris and greed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "One13Truck",
            "body": "It’ll be fine. It’s died 795,643 times already and still going strong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raddish53",
            "body": "Or the theory that it's a government company so that when they ditch the dollar to go cashless and zero the national debt-  they have the controlling lions share.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mdanor789",
            "body": "That's like settling for your prom date who's your cousin.",
            "score": 1,
            "replies": []
        },
        {
            "author": "djchanclaface",
            "body": "It would be a swindle for the record books.\n\nMSTR is a ticking time bomb in so many ways. Every angle is a new more insane way it could blow up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pastor-of-muppets69",
            "body": "If you don't see the value of an alternative to currencies controlled by governments right now, I don't know what to tell you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GSAT2daMoon",
            "body": "Satoshi to the rescue 🚀",
            "score": 1,
            "replies": []
        },
        {
            "author": "Qwerty177",
            "body": "Sounds like bitcoin going on sale to me",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Laker8show23",
            "body": "That’s why most are diversifying.  And BTC is feeling it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guerillaunit",
            "body": "Mike is holding for a while buddy lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rosebunse",
            "body": "I just think Bitcoin's issue is that people treat it like a stock. Women just don't have the imagination for it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlyGateIsReal",
            "body": "If bitcoin crashes to 30K then it will not be profitable to mine bitcoin.  The network wide failure of bitcoin would occur and it would be over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "silentrawr",
            "body": "How would you sell BTC \"OTC\"? To private buyers with a contract, but... without transferring the coins? Maybe I'm OOTL, but wouldn't the transactions would be public no matter what unless they didn't specifically execute the transactions yet?",
            "score": 1,
            "replies": []
        },
        {
            "author": "PowellBlowingBubbles",
            "body": "Bitcoin is a Ponzi Scheme. If the banks fail and we are all gardening in our back yards to survive, do you really think it will be the default currency? Please Mr. Farmer, I need two bushels of corn and I will pay you with this snippet of code. See, there’s only 21,000,000 of these. Farmer says, “Get the fuck off my land.” Fiat currency, gold, silver, whisky will be currency. Only tangible things!",
            "score": 1,
            "replies": []
        },
        {
            "author": "HaMMeReD",
            "body": "The thing about a public ledger is nothing is hidden.\n\nIf MicroStrategy sold 1 Satoshi, it'd probably be on the news within an hour.\n\nAnd tbh, it probably would be the straw that breaks the camel's back. They are currently trying to raise 500m by offering 10% years dividends ($50m/yr expense to the company) to buy BTC.\n\nIt probably will make it bullish or at least sidewise while they prop up the buy side, but once they are done the sell side is going to swing it's way.\n\nAnd then MicroStrategy is going to have to either liquidate to fulfill their investor commitments, which could snowball in the other direction. \n\nI assume they don't have much CoH since they are all in on BTC, and their earnings are off a cliff, and they'll have to pay investors somehow, so BTC liquidations may be in their favor. I mean 10%/yr cash dividends? That's a good deal, it not \"tied to the performance of BTC\" so if you are bearish on crypto you might want to park on MicroStrategy, which is bearish itself for BTC (less buyers, more sellers).\n\nHowever, I put the \"tied to the performance of BTC\" in quotes, because while you'd get that 10%, if MicroStrategy bursts the bubble, they are probably going down with it. They are essentially trading with leverage and we all know that leverage is big wins but also big losses.",
            "score": 1,
            "replies": []
        },
        {
            "author": "typo9292",
            "body": "It can only ever burn everyone, stop pumping in money and watch what happens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "coffeymp",
            "body": "What if a bomb falls on ya head?!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dougiejurgens2",
            "body": "Btc at $30k would probably be a “generational” buying opportunity ",
            "score": 1,
            "replies": [
                {
                    "author": "Rino-Sensei",
                    "body": "You are getting downvoted for saying the truth ...",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Oxy_Moronico",
                    "body": "It was 30k like 18 months ago…and also like 60 months ago",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "iAmMattG",
            "body": "Ponzi schemes never end well. \n\nMSTR / BTC won’t be any different.",
            "score": 0,
            "replies": []
        },
        {
            "author": "stuntycunty",
            "body": "I’ve said this a hundred times \n\nTrump ruined bitcoin",
            "score": 1,
            "replies": []
        },
        {
            "author": "ahmong",
            "body": "Saylor is too much of a crypto bro, liquidating is the last thing on his mind. Unless...",
            "score": 0,
            "replies": []
        },
        {
            "author": "InTheMomentInvestor",
            "body": "BTC is the modern equivalent of Chuck E Cheese tokens or Disney Dollars.  You trade them for \"real\" money and spend them in controlled environments (ie Chuck E cheese or Disneyland)",
            "score": -2,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "InTheMomentInvestor",
                            "body": "Btc isn't spent. It's a sucker's paradise that means on more sucker's.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "me_xman",
            "body": "Throwing money at ponzi scheme",
            "score": -1,
            "replies": []
        },
        {
            "author": "FartsLord",
            "body": "Unless they you know, don’t use it buy lunch and just hold it.",
            "score": -2,
            "replies": []
        },
        {
            "author": "DropoutDreamer",
            "body": "I have morbid curiosity to see Microstrategy blow up",
            "score": -1,
            "replies": []
        },
        {
            "author": "Expensive-Anxiety-63",
            "body": "If bitcoin really really crashes by the fuck out of puts on stocks that invested in it and become generationally wealthy ezpz.",
            "score": 0,
            "replies": []
        },
        {
            "author": "winston73182",
            "body": "Saylor will absolutely end up in jail if your scenario happens. Not because he bought Bitcoin and said it would keep going up, but because in that scenario he manipulated the stock sales through the ATM.",
            "score": 0,
            "replies": [
                {
                    "author": "TrainingAffect4000",
                    "body": "Why MicroStrategy’s Strategy Would Be 100% Legal\n\n They can sell their assets whenever they want – No law forces them to hold BTC forever. Selling is a legitimate business decision.\n\n Shorting BTC before selling is just risk management – Companies and hedge funds do this all the time to hedge against market downturns.\n\n Selling gradually via OTC avoids market panic and stays compliant – As long as they don’t publicly lie about their intentions, there’s no market manipulation.\n\nBottom line: This wouldn’t just be legal—it would be a genius move.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "billyburgess",
                            "body": "Doesn't matter how they offload it. Btc is, for the most part, unregulated. That's its whole appeal.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "winston73182",
                            "body": "My god man listen to yourself. The whole premise of MSTR is Bitcoin’s appreciation relative to USD. If he exchanges BTC for USD >20% below the ATH and materially below many of his purchases, then what the fuck is the point of the company? Generating a LIFO loss and then somehow trading at a premium to his USD holdings? It’s the opposite of genius. Saylor has no choice but to go down with the ship.\n\nAs for the legality, selling stock to acquire Bitcoin and then selling the Bitcoin at a loss is a classic pump and dump.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gh0st_Pirate_LeChuck",
            "body": "I don’t think his goal is to just be ultra mega wealthy though.",
            "score": 0,
            "replies": [
                {
                    "author": "joefunk76",
                    "body": "Of course it is. He’s a multi-billionaire. He can already afford to live whatever lifestyle he wants so what else is he still working for. The one thing a billionaire can never have is ‘enough’.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RadAirDude",
                            "body": "Mega-billionaires have clinically insane fixations on making their numbers go up, supreme levels of greed and addiction",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Efficiency-5728",
            "body": "Crypto bros clap when their plane lands",
            "score": 0,
            "replies": []
        },
        {
            "author": "VenserMTG",
            "body": "You know who else owns a lot of bitcoin? Tesla",
            "score": 0,
            "replies": []
        },
        {
            "author": "mapleflavouredbacon",
            "body": "Why wouldn’t they sell it off on the next pump, since they would make more that way rather than slowly offloading it? They could still short it and make money after that, since they know that their dumping will tank it. I feel like the next pump is gonna be a massive one up, and an even bigger ride down. The biggest roller coaster ride is just pulling out onto the tracks right now.",
            "score": 0,
            "replies": []
        },
        {
            "author": "M41414",
            "body": "Trump ain’t buying any. Just gonna keep what they already have seized. Saylor, well Forbes doesn’t miss. When they put him on the cover that sealed the deal for me on ponzi. Puts in MSTX have been nice.",
            "score": -4,
            "replies": [
                {
                    "author": "Internal-Strength-74",
                    "body": "That's not entirely true. He said the reserve could make budget-neutral BTC purchases. For example, they could sell gold and use the proceeds from that sale to purchase BTC. That would be a budget-neutral way of purchasing BTC.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrassChew",
            "body": "Bring it all down",
            "score": -6,
            "replies": []
        },
        {
            "author": "JPAAZ",
            "body": "Bitcoin is a manipulation scheme disguised as a financial revolution. A fool’s game where speculators profit at the expense of the naive. It creates no value, has no real utility, and survives only through collective delusion and the criminal activity it enables. It’s not money, not a store of value—just an unregulated digital casino, pushed by opportunists who cash in while the gullible lose. In the end, it’s a scam that persists only because there’s always someone ready to believe the next lie.",
            "score": -5,
            "replies": [
                {
                    "author": "Zephyr4813",
                    "body": "“I dont understand bitcoin but youre wrong about it!!’",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Kevin3683",
                    "body": "That applies to everything except water, food, and shelter.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Typical_Breadfruit15",
            "body": "If Microstrategy does that Saylor will be charged with market manipulation and considering the magnitude of it he will be locked up in jail for a long time. I think bitcoin will be around as long as it remains an effective way to circumvent embargoes and/or good for borderline transactions,  basically it has replaced the anonymous bank account that Swiss banks used to offer.",
            "score": -4,
            "replies": []
        },
        {
            "author": "luke1lea",
            "body": "If there's one thing I can assure you with Bitcoin, is that it, 100%, without fail, will definitely\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SearcherRC",
            "body": "There is no point in accumulating unless you plan to sell at some point.",
            "score": -1,
            "replies": [
                {
                    "author": "Kevin3683",
                    "body": "You can get loans using collateral that you don’t have to sell.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Zephyr4813",
                    "body": "What is collateral?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "2x_tag",
            "body": "Knowing that North Korea now has a significant amount of bitcoin, is it in the interest of any government to still pursue a strategic bitcoin reserve?\n\nMy answer is No.\n\nI think Solana will outperform bitcoin long term. And North Korea is the reason. Thus, I wouldn't bet alongside Saylor.",
            "score": -1,
            "replies": [
                {
                    "author": "Zephyr4813",
                    "body": "LOL",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}