{
    "title": "NPR suspends veteran editor as it grapples with his public criticism",
    "author": "Maxcactus",
    "subreddit": "progressive",
    "rank": 193,
    "score": 108,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.npr.org/2024/04/16/1244962042/npr-editor-uri-berliner-suspended-essay",
    "id": "1c5c2h7",
    "selftext": "",
    "comments": [
        {
            "author": "WillingShilling_20",
            "body": "It's nutty that he claims that NPR has \"lost the public trust\" because it's one of the few news outlets that doesn't peddle sensationalist garbage. If anything I think they're too charitable to conservatives. \n\nLet the right-wingers whine. There's no appeasing someone who's determined to hate you.",
            "score": 44,
            "replies": []
        },
        {
            "author": "Zen28213",
            "body": "To the Right the truth sounds like an attack. This right here is why the press hasn’t been as straightforward with Trump as they should have been from the beginning",
            "score": 72,
            "replies": []
        },
        {
            "author": "None",
            "body": "I'm a long time public radio junkie and we need NPR now more than ever. He can go work at Fox or whatever if he wants to be in touch with MAGAts.",
            "score": 58,
            "replies": [
                {
                    "author": "MagicalUnicornFart",
                    "body": "Exactly...Why keep him on, when his intentions are clear?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "ElysiumSprouts",
            "body": "Wow. From that article, it's hard to imagine how this guy got an NPR job in the first place.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Positronic_Matrix",
            "body": "He’s a useful idiot undermining the confidence in public news.\n\n> Yet the public radio network is grappling in other ways with the fallout from Berliner's essay for the online news site The Free Press. It angered many of his colleagues, led NPR leaders to announce monthly internal reviews of the network's coverage, and gave fresh ammunition to conservative and partisan Republican critics of NPR, including former President Donald Trump.\n\n> Conservative activist Christopher Rufo is among those now targeting NPR's new chief executive, Katherine Maher, for messages she posted to social media years before joining the network. Among others, those posts include a 2020 tweet that called Trump racist and another that appeared to minimize rioting during social justice protests that year. Maher took the job at NPR last month — her first at a news organization.",
            "score": 9,
            "replies": [
                {
                    "author": "John_Hunyadi",
                    "body": "Yeah I gotta say, if I gave a public interview criticizing my employer that got that much traction, I wouldn’t expect to keep my job.  I don’t think anyone reasonable would.  Even if they’re right.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "fikustree",
            "body": "I read Berliner’s piece about things that NPR covered poorly and I had some issues with it. First he acted like the Muller report proved Trump/Russia was a Hoax and so NPR just dropped the story but that’s not what the report says, it concludes Muller didn’t think he had the authority to bring charges but that’s not the same as not guilty. Maybe I’ve been brainwashed and biased and didn’t understand but that’s what I remember about the report.\n\nThen he’s also mad that employee inclusion groups are helping decide the words that NPR uses on the radio. I don’t see what’s wrong with that. If saying someone got a sex change operation is incorrect or hurtful then what’s wrong with saying gender confirming surgery. That part just made him sound like a typical boomer who is mad about times changing.",
            "score": 5,
            "replies": [
                {
                    "author": "Nuclear_rabbit",
                    "body": "I read the full Muller report, and if I remember correctly, Muller even stated how he found 11 counts against Trump while Nixon only ever had 1 count brought against him, BUT Muller stated his ideological position that federal law enforcement should not have taken any action against Nixon and he won't take any action against Trump; only Congress could punish Trump in his eyes. Muller was touting absolute immunity during presidency, except by impeachment.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "fikustree",
                            "body": "Thank you for this comment. It’s been a minute and his article made me question what I would remember.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Charming-Charge-596",
            "body": "Truth leans left.",
            "score": 1,
            "replies": []
        }
    ]
}