{
    "title": "DEA Agrees To Reclassify Marijuana Under Federal Law, AP Reports",
    "author": "__The__Anomaly__",
    "subreddit": "progressive",
    "rank": 173,
    "score": 260,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.forbes.com/sites/ajherrington/2024/04/30/dea-agrees-to-reschedule-marijuana-under-federal-law-ap-reports/",
    "id": "1cig09y",
    "selftext": "",
    "comments": [
        {
            "author": "Euthyphraud",
            "body": "I'm having a THC drink now, regardless of the scheduling. Thanks Nevada! \n\nLegalize it federally already.",
            "score": 57,
            "replies": [
                {
                    "author": "mf-TOM-HANK",
                    "body": "Good luck getting regressivists in the GOP to agree to it",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Armenoid",
                            "body": "They’re making money on it too. Like Boehner",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "dust4ngel",
                                    "body": "can't you make more money by having it both ways:\n\n* sell sort-of-illegal weed\n* use it as an excuse to incarcerate populations you don't like\n* get those sweet slavery tendies",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "djerk",
                                            "body": "Yup that’s exactly why they love riding the line.  \n\nNow that you mention it… Do you think they’re trying to make Abortion the same way?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "mf-TOM-HANK",
                                    "body": "And he's not in a position to vote on legalization anymore\n\nI'll tell you who is, though.  Tons of legislators in the pocket of private prisons where med/rec is not yet legal.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "__The__Anomaly__",
            "body": "Next do shrooms please! In fact, time to do away with the whole disastrous war on drugs entirely.",
            "score": 37,
            "replies": [
                {
                    "author": "xiofar",
                    "body": "We gotta ask all the DEA officers for permission because they make a lot of money going after people that use and sell certain drugs.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "disdkatster",
            "body": "Thousands of lives have been destroyed because of this intentional misclassification. This should have happened decades ago and it is a shame on both parties that it is just now happening.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Pubsubforpresident",
            "body": "Progress.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Bodie_The_Dog",
            "body": "Didn't we see a bunch of posts about \"pending rescheduling\" last year, and the year before that, and when Biden was running for office?  And we still wont' be able to smoke/possess it on federal lands, like the national forests that make up so much of the western U.S.   And we still wont' be able to deposit legally-gained profits in the bank.\n\nCall me skeptical and underwhelmed.",
            "score": -13,
            "replies": [
                {
                    "author": "decatur8r",
                    "body": "> Call me skeptical and underwhelmed.\n\nHow about brainwashed and politically biased.\n\n> And we still wont' be able to smoke/possess it on federal lands\n\nYou will if the GOP don't block the bill in the senate...but they will. So lets piss on the one guy doing something good...wonder why?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Bodie_The_Dog",
                            "body": "Are you ever critical of your leaders?  Can they do no wrong?  Are you not into honest examination of their strengths AND faults?  \n\nDude campaigned on legalization, and here we are, still celebrating intentions instead of results.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "decatur8r",
                                    "body": "> Are you ever critical of your leaders?\n\nyep when they do something stupid...when they do something like this I campaine for them...how about you are you going to vote for Biden now he has done the right thing?...I doubt it becasue policy is not what drives people like you...it is generally hate.\n\n\n>Dude campaigned on legalization\n\nand there is a bill in the senate as we speak...don't have any idea how goveremnt works do you?\n\nand...\n\n>But Biden said he would **“decriminalize cannabis use”** during the 2020 campaign\n\nnot  legalization",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "> Didn't we see a bunch of posts about \"pending rescheduling\" last year, and the year before that, and when Biden was running for office?\n\nYes, and this is an announcement that it's moving from \"pending\" to \"happening.\" Like, what is the administrative change you want if not this?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "midnight_toker22",
                    "body": "Such an interesting pathology that leads people, in the face of progress, to look for the negatives…",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Bodie_The_Dog",
                            "body": "Such an interesting condition, the Cult of Personality, celebrating fails as wins, never questioning their leaders' actions.\n\nEven Taco Bell employees get annual reviews.",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "broc_ariums",
                                    "body": "Sounds like you've spoken to Republicans. \"\"Cult of personality celebrating fails as wins\".",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "-ParticleMan-",
                                    "body": "Where is the fail?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}