{
    "title": "McDonald's says it is revising some of its diversity practices",
    "author": "Maxcactus",
    "subreddit": "progressive",
    "rank": 10,
    "score": 142,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 37,
    "url": "https://www.npr.org/2025/01/07/nx-s1-5250778/mcdonalds-dei-diversity-revision",
    "id": "1hwi3jq",
    "selftext": "",
    "comments": [
        {
            "author": "dawgfan24348",
            "body": "How about they revise bringing back their 24 hour breakfast",
            "score": 84,
            "replies": []
        },
        {
            "author": "bdboar1",
            "body": "Cowering to right wing lunacy",
            "score": 149,
            "replies": [
                {
                    "author": "MrVeazey",
                    "body": "It's what the rich always do because they have no principles beyond greed and fascists let them rob from the poor even more than liberals do.",
                    "score": 38,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thausgt01",
            "body": "One more reason to avoid them, and go get cheap food/drinks at Costco instead...",
            "score": 12,
            "replies": []
        },
        {
            "author": "cortlandjim",
            "body": "Until the next time cops unalive someone and it causes a national scene...",
            "score": 7,
            "replies": [
                {
                    "author": "Bay1Bri",
                    "body": "\"unalive\"\n\n🤦‍♂️",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Arkhamman367",
                            "body": "It’s going to be a minute until TikTok migrants figure out you can swear on the rest of social media.",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "Bay1Bri",
                                    "body": "\"Kills\" isn't even a curse lol it's just a easy to get around content monitors so videos don't get removed. They do the same things on YouTube now too avoid getting demonetized. Self censorship mixed with cringe.",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "cortlandjim",
                                    "body": "Fuck off!. \nIs that better dipstick, I don't even have a tiktok account.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Positronic_Matrix",
                            "body": "It’s a Gen-Z term created to work around online censorship.  It is very possible that it could enter the English language as a near synonym for murder or suicide, used exclusively in online venues.  I say near synonym, as other words which have joined the online lexicon, such as “doge,” have slightly different connotations than the original word.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Bay1Bri",
                                    "body": "Yes I know what it is. I also know it's one of the cringiest slang terms of all time.\n\nAdded lmfao this is honestly the saddest \"reply then block\" I've ever seen. I verified a land slang term and you block me? Toughen up buttercup",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}