{
    "title": "Dino in Dolores Park, SF",
    "author": "dittidot",
    "subreddit": "MadeMeSmile",
    "rank": 102,
    "score": 10116,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 34,
    "url": "https://v.redd.it/0onaqiuq6hme1",
    "id": "1j2ii9d",
    "selftext": "",
    "comments": [
        {
            "author": "ColdIndividual8477",
            "body": "nice park. doggo scared of the dino hehe",
            "score": 228,
            "replies": [
                {
                    "author": "Reasonable-Rice1299",
                    "body": "Im from Wisconsin. I have a very good friend right there. My immediate thought was \"man that's gonna piss off a bunch of dog owners. Then I remembered it's fucking SAN FRANCISCO!\" Those dog owners love it and everyone accepts the weird! Keep weirding!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Force_Appetitnaya",
            "body": "SF is never going to lose its weirdness.The other day, I saw a woman shopping at Whole Foods wearing a kink leather dog mask, and no one even batted an eyelid.",
            "score": 167,
            "replies": [
                {
                    "author": "Simpanzee0123",
                    "body": "She was definitely following instructions.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "HatedMirrors",
                            "body": "Love it!  I wonder what my wife and I would \"make\" each other do if we lived in SF.  I think it would only work there.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "inkfanatic95",
            "body": "Doggies are not loving it 😂",
            "score": 102,
            "replies": [
                {
                    "author": "Megotoschool",
                    "body": "Music is kinda... Stressful for them I guess.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "inkfanatic95",
                            "body": "I was thinking it was the big ass costume 😂I mean if I was a dog seeing that would be a bit freaky",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "recyclopath_",
                    "body": "It's good for pups to experience weird shit as positive experiences. To practice dealing with stress, the stress passing and going back to their regularly scheduled lives. That's literally dog socialization. It's not about interacting with people or dogs, it's about experiencing the world and learning to be chill about it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SicilianUSGuy",
            "body": "Where do I get that please?",
            "score": 30,
            "replies": []
        },
        {
            "author": "Then_Passenger3403",
            "body": "Brave pups want to save SF. AhhhRoooo!",
            "score": 21,
            "replies": []
        },
        {
            "author": "I2iSTUDIOS",
            "body": "That's amazing",
            "score": 11,
            "replies": []
        },
        {
            "author": "Curious-Profile3428",
            "body": "This but at a festival",
            "score": 9,
            "replies": [
                {
                    "author": "Maleficent-Skin1052",
                    "body": "It was actually at burning man last year!",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "GoodPeepsEverywhere",
            "body": "Not just good people everywhere.... Good dinosaurs too!",
            "score": 9,
            "replies": []
        },
        {
            "author": "Weird-Cantaloupe3359",
            "body": "Absolutely love it. ❤️❤️❤️❤️❤️❤️❤️",
            "score": 7,
            "replies": []
        },
        {
            "author": "RachelRegina",
            "body": "So you're saying the next franchise crossover will be Tron X Jurassic Park lol",
            "score": 8,
            "replies": []
        },
        {
            "author": "ofthejourney",
            "body": "Tron-asaurus",
            "score": 6,
            "replies": []
        },
        {
            "author": "vc6vWHzrHvb2PY2LyP6b",
            "body": "I saw this guy at Bay to Breakers last year! He complimented my dick.",
            "score": 5,
            "replies": []
        },
        {
            "author": "nheabutter",
            "body": "I’m sad I missed it",
            "score": 4,
            "replies": []
        },
        {
            "author": "CrazyCanvas35",
            "body": "That is so f****** cool!!",
            "score": 5,
            "replies": []
        },
        {
            "author": "captain_ender",
            "body": "Damn I miss the Fruit Shelf, some of the best days living in SF spent there getting tipsy with the and a post brunch nap.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Trifula",
            "body": "That is one of the coolest things I've ever seen. God damn.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mobeylicious",
            "body": "Cybersaurus",
            "score": 2,
            "replies": []
        },
        {
            "author": "question8all",
            "body": "Wayyy too many dogs, especially loose dogs.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Assaulted_Fish",
            "body": "Don't get me wrong, this is totally amazing and I'm sort of jealous however, the sheer dichotomy of the insanity of Trump and then this person just enjoying their life is jarring.",
            "score": -9,
            "replies": [
                {
                    "author": "anothernother2am",
                    "body": "One, you can’t see depression or pain. You have absolutely no idea what anyone is dealing with at any given moment. \n\nTwo, despite, or better, in spite of trump, we need to keep living. That doesn’t mean ignore what’s going on with him, but if you have the ability to have some joy, do it, because you need to give yourself something to keep going. This isn’t going to be over tomorrow. There are plenty of people who are fighting and doing what’s right, but that doesn’t mean they can’t live for themselves too. You can’t pour from an empty cup. And even if people did vote for trump there, which they overwhelmingly don’t, suffering is not going to solve anything either.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Assaulted_Fish",
                            "body": "Oh I don't disagree.  I know how important these moments of people kicking back are going to be very soon,  it's just more remarkable because we know we're going to need it soon, you know?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FancyTeaPartyGoose",
                    "body": "Sf voted 15% trump absolutely insanely low favor for him and I bet most of those people don’t leave their high rise apartments in down town (this is miles away)",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}