{
    "title": "Conan O'Brien bought all of the seat fillers a box of complimentary snacks at the Oscars",
    "author": "holyfruits",
    "subreddit": "MadeMeSmile",
    "rank": 90,
    "score": 58855,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 615,
    "url": "https://i.redd.it/i3b9y6ybiime1.jpeg",
    "id": "1j2ol02",
    "selftext": "",
    "comments": [
        {
            "author": "emcee_pern",
            "body": "Conan is just a nice guy. If you'll indulge a short personal story:\n\nWhen my partner and I got married our friends and family put together a nice video of well wishes for us. While watching it for the first time we were shocked to suddenly see Conan O'Brien pop up chatting like he had known us for years, teasing us, and wishing us the best in all sincerity. A close friend who had previously worked on his show had talked him into doing this after telling him about a bit about us. We've never met the man in person. This was years before Cameo existed and clearly the two of them just thought this would be a hilarious thing to do. He was genuinely warm and funny and it's certainly something I won't ever forget.",
            "score": 15116,
            "replies": [
                {
                    "author": "MasVonBoxen",
                    "body": "As someone that has a family member that works with him, I can confirm he's very nice to everyone. He's always doing things to make people feel appreciated as part of Team Coco and beyond.\n\nMy sister lives on the west coast and our family is all on the east cost and her birthday was only a week ago. She spent it low key and I really felt upset that she didn't get a big celebration. That worry was put to bed when she sent a video of Conan and team singing her happy birthday. Taking time out to do the little things while everything is ramping up for the Oscars. I know my sister feels appreciated and it makes it easier knowing she's working for someone who is genuinely a good person.",
                    "score": 1469,
                    "replies": [
                        {
                            "author": "GREGismymiddlename",
                            "body": "He had some quote about work hard and be kind and you will be successful.  Think it may have been on one of his last shows at NBC.  If he is not a shining embodiment of that ideal, idk who is.",
                            "score": 417,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 156,
                                    "replies": [
                                        {
                                            "author": "Black_Magic_M-66",
                                            "body": "Anyone here actually watch his Tonight Show?  Not saying he's not a nice guy, but his Tonight Show sucked.  I absolutely love his [Old Timey Baseball](https://www.youtube.com/watch?v=GS39vMhag-A) thing from his old show.",
                                            "score": -13,
                                            "replies": []
                                        },
                                        {
                                            "author": "ghostkittykat",
                                            "body": "I had never seen \"Old Timey Baseball,\" so I clicked & watched and thought it was funny! \n\nFor some reason, it reminded me of one of my favorite comedians sketches on SNL...\n\nhttps://youtu.be/JYqfVE-fykk?si=ceplFt-qw8ZAwnLC",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Brightlightsuperfun",
                                    "body": "Tell that to the rest of Reddit. This site firmly believes the only way to the top is to be evil and exploit people. ",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "acrazyguy",
                                    "body": "Decent message, but I wish things like that would be amended to “and you greatly increase your chances of success”. This idea that working hard *WILL* make you successful leads to a lot of burnout in people who are missing the all-important but never discussed factor of pure luck",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FirebirdWriter",
                            "body": "Nice to know he isn't an Ellen",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "LopsidedPotential711",
                            "body": "Conan [razzes] the INTERNS: https://youtu.be/ffVbnPjl86A?si=AkJYBcHLl8hUion_",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "taolbi",
                            "body": "I recall listening to an episode of smartless where Conan was on. Now, will Arnett is a funny guy and I think he has a handle on his persona really well. But there was a moment where Conan called will out on something, I recall it was just Arnett reaching for low hanging fruit, it was real subtle because it was one of those moments where everyone was talking. Even Arnett was like, \"come on man... I'm just....\" And the conversation moved on\n\n\nConan seems to respect his art of comedy so much and has high expectations of those around him as well. It's the type of professionalism and expertise that I hope to develop one day.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zootnotdingo",
                    "body": "What an awesome story! It really was a hilarious thing to do! I can only imagine your faces when he showed up!",
                    "score": 1602,
                    "replies": [
                        {
                            "author": "emcee_pern",
                            "body": "He played it so straight too, as if we should have expected him to show up the whole time due to our long history together.",
                            "score": 1109,
                            "replies": [
                                {
                                    "author": "Macho_Chad",
                                    "body": "Haha, that’s so on brand for him. Glad you and yours got to experience that. Conan’s hilarious",
                                    "score": 113,
                                    "replies": [
                                        {
                                            "author": "spermdonor",
                                            "body": "His hilarious what?",
                                            "score": -4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Macho_Chad",
                                            "body": "Hair.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "JenicBabe",
                                    "body": "Did u ever post the clip of him online somewhere???",
                                    "score": 126,
                                    "replies": [
                                        {
                                            "author": "emcee_pern",
                                            "body": "No. It was a nice little personal moment and I think we'll keep it that way.",
                                            "score": 1365,
                                            "replies": [
                                                {
                                                    "author": "HeyItsMeDrPhil",
                                                    "body": "And that’s exactly what it was, I was happy to see this response. Good for you and yours 🤟🙂",
                                                    "score": 285,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "eekamuse",
                                                    "body": "Good for you",
                                                    "score": 186,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "mancow533",
                                                    "body": "But how will you feed you children without all that internet karma!? \n\n/s",
                                                    "score": 112,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TheDeadlySpaceman",
                                                    "body": "Class",
                                                    "score": 58,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Son0faButch",
                                                    "body": "YouTube or it didn't happen!\n\nJk I think it's great you're keeping it for yourselves",
                                                    "score": 80,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "kinggudu13",
                                                    "body": "You’re a throwback in the best way possible",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "generic-usernme",
                    "body": "You know what's funny? Conan made an appearance at my Bachelorette party lol. He just happened to be at the Same place we were. He came over and chatted for a while and was so sweet and hilarious. He said he wouldn't strip for me but offered to crash my husband's bachelor party and report back😂😂. It was a hilarious interaction but the funniest part is that when he left he littlerally disappeared into thin air and left a little note similar style to the one above",
                    "score": 470,
                    "replies": [
                        {
                            "author": "degjo",
                            "body": "I bet he's a pro at the Irish Goodbye",
                            "score": 195,
                            "replies": [
                                {
                                    "author": "Master_of_Snek",
                                    "body": "Many Bostonians are actually genetically ingrained with the ability to do it. It’s like pointer dogs it’s just *in us*. \n\nWill confirm people from other parts of the country find it rude but when you have 43 first cousins it’s important to say goodbye to everyone by saying goodbye to no one. ",
                                    "score": 187,
                                    "replies": [
                                        {
                                            "author": "whimsical_trash",
                                            "body": "It's pretty popular out in California too, you're like do I really need to do social conventions like say goodbye, they all know how I feel about them. \n\nIt's absolutely painful when I visit family in South America and have to say goodbye to 50 people individually, it is literally my version of hell",
                                            "score": 56,
                                            "replies": [
                                                {
                                                    "author": "ghostkittykat",
                                                    "body": "It is SO painful and emotionally draining to have say goodbyes to dozens of kinfolk after an annual family get-together (at least it is for me).\n\nI'm from the \"South\" as in the Southern US, and it's the same here!\n\nSo many aunts, uncles, cousins, cousins twice removed, e.g. to say farewells to at every family gathering!\n\nI was lucky enough to participate in an exchange program in which I lived in South America (Paraná, Brasil), for ~ a month and I have some of the best memories from the time I spent there!",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "whimsical_trash",
                                                            "body": "Yeah, I mean the comradery and closeness of the family in South America is probably worth the tradeoff of endless goodbyes lol. When I think of my family and memories down there (who I am only related to through my cousin), I just think of warmth.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "ghostkittykat",
                                                                    "body": "I certainly am not taking anything away from the closeness of our family.*\n\nI'm so glad I was lucky enough to spend a lot of weekends at my Mamaw & Papaw's house next door (one cow field over, lol). Most of my immediate family (aunts, uncles, & 1st cousins) were there usually 2-3 times a month. \n\nWe only got together with the extended family twice a year (summer and the 1st weekend of Dec.) since they lived over an hour away, but we always just picked up right where we left off (~6 months ago, lol). I know I could call on any of them, and they'd help me (and vice versa).\n\n*I have ADHD and have trouble remembering names. Especially when it is someone I only see a time or two a year.\n\nMy stress/anxiety was amplified by my guilt for not remembering every. single. family. member's. name.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Mammoth_Sell5185",
                                            "body": "It's also actually polite to NOT say goodbye to the party hosts. First, it means you're interrupting the party to be like \"LOOK AT ME, I'M LEAVING\" which sort of sends a bad vibe, like, hey the party's ending, and then the hosts are inundated with ALL of their guests saying goodbye. Unless you're literally from another country and won't see them for years, just peace out and leave quietly.",
                                            "score": 27,
                                            "replies": [
                                                {
                                                    "author": "littlemacaron",
                                                    "body": "I got Irish goodbye’d by 6 of my friends at my own birthday party.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Sensitive-Initial",
                                            "body": "I'm jealous! I'm from Midwest swiss/German Apostolic Christian stock- so we spend an hour saying goodbye to our 50 first cousins (thankfully only like 20 relatives at a time except for the reunion every 2 years)",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "mehhemm",
                                                    "body": "Meet, greet, eat, tweet, repeat",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RageIntelligently101",
                                            "body": "THIS!",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "pungent_queefer",
                                                    "body": "THAT!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SrGrimey",
                                            "body": "Oh my god, you’re right.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "countrysadballadman9",
                                    "body": "I love how that changes name according to the country you're in",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "degjo",
                                            "body": "In Ireland they call it",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "countrysadballadman9",
                                            "body": "Honestly no idea, i'm guessing french exit? I've Heard germans call it a polish exit, Poles an English exit (as in brits) and so on",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "degjo",
                                            "body": "(I didn't finish the sentence because I already left)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Marsupialpolis",
                            "body": "That’s like a fever dream,  I’m so jealous 😂",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "generic-usernme",
                                    "body": "I def still question myself about if it really happened😂😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PIeaseDontBeMad",
                            "body": "Do you still have the note? That’d be cool to see!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Itsnotmyfirst",
                    "body": "I met Conan in person ages ago when he came into my work (a famous NYC day spa at the time) to buy a gift certificate for either his producer/ assistant or girlfriend (it’s been so long I don’t remember). There was very long line of at least 20 ppl during our rush and next thing I know, I look up and the next customer is this red- headed giant. He looked very lost and sheepish and told me he needed a gift for this person who was very special. He basically came in himself to buy this gift, waited on line patiently (at least 20-30mins) and asked for help to pick something out. He was the sweetest person and never complained once about having to wait on line with 20 women just buy a gift for someone special.",
                    "score": 206,
                    "replies": [
                        {
                            "author": "jawndell",
                            "body": "When Conan was in NY you could spot him regularly (hard to miss).  He’d always have a funny quip if you tried to interact with him.  You can tell he loves his fans. ",
                            "score": 114,
                            "replies": [
                                {
                                    "author": "Mike_with_Wings",
                                    "body": "Now you just need to yell “there was talk of gerbils!”",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "tinstinnytintin",
                                            "body": "RIP, Mickey....you're a real one for that.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Leading-Fig27",
                                    "body": "Isn’t there a cameo of him walking through the back of a scene on The Office?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tothesource",
                    "body": "What a great friend and what a great Conan. Warms the cocks of my cold, dead heart",
                    "score": 178,
                    "replies": [
                        {
                            "author": "CRT_SUNSET",
                            "body": "Did you mean cockles or did I fail anatomy",
                            "score": 156,
                            "replies": [
                                {
                                    "author": "tothesource",
                                    "body": "No, no. I meant cocks. \n\nWhy? Are you homophobic or something?",
                                    "score": 130,
                                    "replies": [
                                        {
                                            "author": "Fun-Jellyfish-61",
                                            "body": "Just how many cocks do you have?",
                                            "score": 25,
                                            "replies": [
                                                {
                                                    "author": "tothesource",
                                                    "body": "How much cocks is too much cocks?",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "Fun-Jellyfish-61",
                                                            "body": "Two. I'm going to go with two.",
                                                            "score": 21,
                                                            "replies": [
                                                                {
                                                                    "author": "degjo",
                                                                    "body": "I think anything over 15 at a time is a bit much",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "imbringingspartaback",
                                                                            "body": "Don’t be an underachiever",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "things_U_choose_2_b",
                                                            "body": "Hard to say, really. Lots of variables. \n\nIs there lube involved? Are you going to use a dilator to warm up, or going straight for the record? \n\nHow big are the cocks? There's probably a 'sweet spot', too small and you won't get more than one in, too big and you won't get more than one in.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Colonel_Fart-Face",
                                                    "body": "I heard that motherfucker has, like, 30 god damn dicks.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "elmwoodblues",
                                            "body": "Everyone is edgy these days",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "author": "Raesong",
                                                    "body": "Not me, I'm just edg*ing*.",
                                                    "score": 26,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "tothesource",
                                                    "body": "No, you just sound like a deeply closeted gay man.",
                                                    "score": -11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BrickNMordor",
                                                    "body": "I'm not gay. I'm deeply closeted.",
                                                    "score": 23,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "elmwoodblues",
                                                    "body": "It's a joke, grrrl. Need to dish?",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "tothesource",
                                                    "body": "Is \"grrrrl\" the sound of the joke/reference going right over your head?",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BigFatDynamo1988",
                                                    "body": "You dirty dog!",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SpeedRacerWasMyBro",
                                            "body": "[Maybe it was somewhere in the subcockle region?](https://youtu.be/UrgpZ0fUixs?si=1d8I1MDXqizdp5nk)",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "goat_penis_souffle",
                                                    "body": "Just an average Joe?",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Sax_OFander",
                                            "body": "No, not at all. In fact, my uncle when he died left me a stash of his gay porn. It was okay porn, I guess. But it was just a whole bunch of dudes fucking.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DiggityDooWop",
                                            "body": "I was trying to figure out if we had carcs existing in our hearts.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HalKitzmiller",
                                    "body": "[Schlansky-esque](https://64.media.tumblr.com/e377f021596068cd0bfbccbe651c92bf/tumblr_nnlilwqUr11qdqyxho1_1280.jpg)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Punny_Farting_1877",
                            "body": "*coccyxs",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "tothesource",
                                    "body": "My grandma broke that once on her 4-wheeler out in the dunes then my stupid uncle had to come live with us and he ruined all our lives and ate all our steaks.",
                                    "score": 44,
                                    "replies": [
                                        {
                                            "author": "blackbencarson_",
                                            "body": "damn, at least your uncle ate the steaks. Mine liked to chuck them at my face while I was riding a bike. Would knock my glasses clean off",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "tothesource",
                                                    "body": "Damn. Sounds like he had a rocket for an arm. Could probably throw a steak over some mountains",
                                                    "score": 13,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Punny_Farting_1877",
                                            "body": "As someone who just paninied one of the best steaks I have ever eaten, I will join you in calling your uncle stupid. Although, he did have free steaks.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "tothesource",
                                                    "body": "Panini a steak?! Why, I've never!",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Punny_Farting_1877",
                                                            "body": "Don’t try it unless the steak’s at least a minimum thickness and your instant read thermometer is actually instant. And has an alarm. And smooth plates not grilling plates. And one at a time. And don’t walk away. And a little oil brushed on the plates after they come to temp.\n  \nPanini is a fickle mistress.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "tothesource",
                                                                    "body": "Damn. Gonna have to try this soon. Thank you! \n\nAbout what thickness do you think is best?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Punny_Farting_1877",
                                                                            "body": "Seriously, about 1 inch so the thermometer will read meat temp not plate temp. I run the plates at highest setting.\n  \nIt’s so quick that from medium rare to medium well is nothing. \n   \nAnd it definitely needs resting for a few minutes.\n  \nIt might not be your cup of tea but for me it takes longer for me Griddler Junior to heat up than it does to cook. This is for a quick meal using a lower quality steak with little marbling.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "tothesource",
                                                                                    "body": "Never thought I'd be getting badass steak tips when I started commenting in this thread, yet here we are. \n\nThanks again!",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Punny_Farting_1877",
                                                                                            "body": "YW! I season with coarse black pepper, sea salt and onion powder before dragging the panini out. People do use the grill mark side of the plates too on YouTube.  Like one of them points out, weather dictates if you can grill outside. Much of the year, I can’t.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "OutragedPineapple",
                                            "body": "See that's when you eat the uncle. He takes your food, he becomes your food.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "tothesource",
                                                    "body": "Plus if he's been eating delicious steaks he will be equally as delicious. Like when they feed Iberian hams on an all acorn diet.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BorisDirk",
                                            "body": "But your uncle could throw a football over them mountains",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Dorkamundo",
                                            "body": "You have a cigarette for a grandma?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "CharlieKeIIy",
                                                    "body": "Extra reference in there, I like it.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Dorkamundo",
                                                    "body": "uhhh... Filibuster.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "restorology",
                                            "body": "Knock it off tothesource and make yourself a dang quesadilla",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "tupeloh",
                                            "body": "Why didn’t you just make yourselves a dang quesadilla?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TimequakeTales",
                            "body": "gotta warm those heart dicks",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "tinstinnytintin",
                            "body": "cold heart cocks are considered a medical red flag...you should go see a doctor",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "tothesource",
                                    "body": "Who do you think did the implant for the cold-heart cocks?! I'm meant to go to them for further advice?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Scrumptious_Foreskin",
                    "body": "Makes my love for him grow even more. I have never heard a single bad thing about Conan.",
                    "score": 72,
                    "replies": [
                        {
                            "author": "Alexander_the_What",
                            "body": "Eh don’t google “Conan” and “Barbarian” if you want to keep this illusion",
                            "score": 82,
                            "replies": [
                                {
                                    "author": "JustinHopewell",
                                    "body": "The Hyborian Age was a long time ago, I think he's earned his redemption.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "No_Beach9428",
                                            "body": "Why do democrats always get second chances but right wingers done haha",
                                            "score": -6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Blibberywomp",
                                            "body": "what the fuck are you talking about",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "JustinHopewell",
                                            "body": "He's a MAGAt making a dumb joke about cancel culture.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "any_other",
                            "body": "The head of his production company is Henry Kissinger's son. I think that's about it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "518doberman",
                    "body": "Well in real life to talk directly to Conan you need clearance first!",
                    "score": 23,
                    "replies": [
                        {
                            "author": "DubbleCheez",
                            "body": "Only I may dance",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "TimequakeTales",
                                    "body": "Sit perfectly still",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Iamnot1withyou",
                                    "body": "Love this",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "fueelin",
                            "body": "Seems like he wouldn't need a friend so badly then, right?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "afriendincanada",
                            "body": "Larry David doesn't have Conan Clearance",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zephyr_555",
                    "body": "He’s the best! If we’re sharing stories, my mom’s best friend is an avid cyclist. She was cycling up some canyon road one day (I want to say Mulholland Drive) and there was one other cyclist keeping pace with her, and the two of them ended up kind of racing each other to the top. When they both made it to the top of the hill, they took a break and just chatted with each other for half an hour. Some twenty minutes in he pointed out that they’d never gotten each other’s names, took off his helmet, and introduced himself as Conan. This was during the height of his run on Late Night and she was absolutely floored.\n\nEvery story I’ve ever heard about him paints him as the friendliest, most down to earth guy with a passion for shocking and messing with people.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Smiley_bones_guitar",
                    "body": "Do you still have the video? The way you phrase it, it sounds like it’s lost to time.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CherryblockRedWine",
                    "body": "the seat filler boxes are adorable and so is this story!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ramsee",
                    "body": "He's got that super positive radio host energy eh, he just seems genuinely happy most of the time.\n\nImagine asking someone like Corden or Letterman to do this for one of their staffers 😆",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "grumpvet87",
                    "body": "Conan AI bot2000",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Captain__CheeseBurg",
                    "body": "That’s hilarious and I bet he got such a kick out of doing that lmao",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OkCurve487",
                    "body": "He seems so genuinely nice and caring. And I love his podcast!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SeeingEyeDug",
                    "body": "Funny Freudian slip talking about Conan and saying \"after telling him about a bit about us\".",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "msweigart",
                    "body": "Massive Zionist but OK",
                    "score": -17,
                    "replies": []
                },
                {
                    "author": "LongKnight115",
                    "body": "And he loves onions.  Ew.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zapz564",
            "body": "Conan seems like a legitimately awesome guy.",
            "score": 4861,
            "replies": [
                {
                    "author": "theshook",
                    "body": "On his podcast he talks about how he really likes when people come up to him in public. And that it seems like the other people end up ending the conversation earlier than he would like...I really think he's a genuine dude who really loves what he does as well as people in general.",
                    "score": 2609,
                    "replies": [
                        {
                            "author": "EquivalentDizzy4377",
                            "body": "This may explain his cameo on Curb, I can’t remember exactly but it was some guy that you couldn’t actually approach and talk to in public. F*ing hilarious.",
                            "score": 521,
                            "replies": [
                                {
                                    "author": "StockAL3Xj",
                                    "body": "Not just being approached but that anyone who wanted to talk to him had to be cleared before hand. Conan was great in that episode.\n\nClip for those interested\n\nhttps://www.youtube.com/watch?v=awOjImEFXmk",
                                    "score": 204,
                                    "replies": [
                                        {
                                            "author": "LoveLadyThirteen",
                                            "body": "The way he yells *”GEE-ZUSSSS!”* when LD runs up and knocks on the window 😂\n\n(RIP to Lewis. I loved every scene he had with Larry. They were iconic together.)",
                                            "score": 77,
                                            "replies": [
                                                {
                                                    "author": "MagicBez",
                                                    "body": "I also love his delivery of \"it's fun!\"",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Equivalent-Honey-659",
                                            "body": "That’s amazing.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ChangeVivid2964",
                                            "body": "This is just Seinfeld but with some old bald guy.",
                                            "score": -12,
                                            "replies": []
                                        },
                                        {
                                            "author": "non-",
                                            "body": "Yea that's what we like about it.",
                                            "score": 17,
                                            "replies": []
                                        },
                                        {
                                            "author": "DoctorJiveTurkey",
                                            "body": "George was based on Larry",
                                            "score": 13,
                                            "replies": []
                                        },
                                        {
                                            "author": "z31",
                                            "body": "Just some old bald guy who co-created and was the head writer/showrunner and producer on Seinfeld",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "taelor",
                                            "body": "Yes, exactly.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "dmtdmtlsddodmt",
                                    "body": "You need to get clearance first.",
                                    "score": 106,
                                    "replies": []
                                },
                                {
                                    "author": "grein",
                                    "body": "Yep. Conan would also be crying laughing at that Fatty Arbuckle joke. He's such a dork for old time references. 😆",
                                    "score": 32,
                                    "replies": []
                                },
                                {
                                    "author": "ConejitoCakes",
                                    "body": "He did a cameo on The Office also :)",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Maleficent_Gas5417",
                                            "body": "And How I Met Your Mother",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "phluidity",
                                    "body": "The show has not aged well, but one of the best Conan cameos was on How I Met Your Mother.  He is just a background extra in a scene at the bar. Does not interact with the main cast at all, does not do anything outrageous. Just stands there in a jacket drinking a beer in all his 6'4\" glory.",
                                    "score": 30,
                                    "replies": []
                                },
                                {
                                    "author": "Dounce1",
                                    "body": "Yeah but even then he still lets Larry borrow his car.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "plug-and-pause",
                                    "body": "Oh wow I remember that cameo, but the context here definitely makes it an even deeper joke.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "doggwithablogg",
                            "body": "I’ve had a run-in with him at a local LA coffee shop a few years prior to COVID and he’s genuinely so nice and funny. Had some quick banter and went on with our day.",
                            "score": 61,
                            "replies": []
                        },
                        {
                            "author": "kearneycation",
                            "body": "Him and his assistant have talked about it a lot, and the fact that often he's the one who wants to hang around and keep chatting with people",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "CunningWizard",
                                    "body": "And that they have to keep him moving or he’ll just end up spending all day talking to random people and making jokes. Dude is a human golden retriever, a guy who is just genuinely happy to be here.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "tagitagain",
                                            "body": "You shouldn’t stereotype golden retrievers (or any dogs) that way.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "poopoopirate",
                            "body": "His selfie story where he takes the selfie with the wrong guy is fucking hilarious",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "Notmyproblem923",
                                    "body": "Isn’t it though? I heard it a long time ago & recently they played it on his Sirius XM station & I laughed just as much.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "IHateTheLetterF",
                            "body": "He was asked whether he tires when meeting people, and he said 'No.. They tire!'",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Lordborgman",
                            "body": "Would have been interesting for him to run into my father, I have never see him end a conversation.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "ImNotAWhaleBiologist",
                                    "body": "Physics doesn’t allow for perpetual motion.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DemThrowaways478",
                            "body": "if I was someone people actively admired and wanted to talk to I would more than indulge every conversation",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "jawndell",
                            "body": "I just mentioned in another post, when he was in NY fans (myself included) would always spot him (hard to miss) and he’d interact with them regularly.  Even like on line at a deli. ",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Lying_Kat",
                            "body": "KEDAKAI!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "pagoodma",
                            "body": "There was talk of gerbils!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Blenderx06",
                    "body": "I'm really glad he hasn't turned out to be a disappointment like so many celebs. His was the only late show I would watch way back when I only had broadcast tv years ago. Back when it was him and Andy.",
                    "score": 97,
                    "replies": [
                        {
                            "author": "burd_turgalur93",
                            "body": "Instant flashback to my favorite bit as a kid; how even after the year 2000, they kept it as IN THE YEAR TWO THOU SAAAAAND",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Blenderx06",
                                    "body": "I heard this in my head 😆",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "VirginsinceJuly1998",
                            "body": "He is a disappointment, if you ask Sona and Jordan.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IHateTheLetterF",
                    "body": "He has over 30 years in the business and I have legitimitaly never heard one bad story about him, despite so many people having met him.",
                    "score": 51,
                    "replies": []
                },
                {
                    "author": "sharilynj",
                    "body": "I had the chance to interview him briefly in 2018. Those 20 minutes turned me from a casual fan to a huge fan. The absolute best.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "lepsek9",
                    "body": "I don't really care about celebrities, but Conan is one of the few I'd love to grab a beer (or gummy) with.",
                    "score": 48,
                    "replies": []
                },
                {
                    "author": "duhellmang",
                    "body": "He's always shouting out the crews behind the camera and the work behind the camera.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Diaperedsnowy",
                    "body": "A friend was an intern for him.\n\n  \nShe confirmed he was legit nice.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "LoosieGoosiePoosie",
                    "body": "I think he might actually be one of the good ones.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "HowDareYouAskMyName",
                            "body": "Don't jinx it 😬",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wintoli",
                    "body": "I went to one of his shows before and met him very briefly, overall he’s just a wonderful and kind guy",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "moep123",
                    "body": "it's cool he literally talks about everything even gaming. he knows hideo, was part of the game death stranding, tested Mortal Kombat, God of war and other games with guests etc. cool guy infront of the cam at least.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "soulcandiwaifu",
            "body": "He used to make me laugh so much when I was a kid, really appreciate him!",
            "score": 1862,
            "replies": [
                {
                    "author": "StarlordeMarsh",
                    "body": "His podcast is great, highly recommend. It’s a much more subdued Conan compared to the late night shows, but funny as ever and really shines in more long form interviews.",
                    "score": 543,
                    "replies": [
                        {
                            "author": "theSandwichSister",
                            "body": "Plus Sona and Gorley are wonderful and very witty ",
                            "score": 172,
                            "replies": [
                                {
                                    "author": "ghostlythoughts",
                                    "body": "Love Matt so much. Glad he's on a very successful/very listened-to podcast after years (decades even) of being on very niche podcasts",
                                    "score": 44,
                                    "replies": [
                                        {
                                            "author": "jopepa",
                                            "body": "Those deep cut Gourley shows are so good. I’ve never had much interest in 007, but the James Bonding Podcast was a small contribution to a free pitcher one trivia night.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ghostlythoughts",
                                                    "body": "Superego, pistol shrimps radio/mallwalkin', I was there too, the Andy daly podcast pilot project, and of course James bonding are all stellar (he makes James Bonding more bearable since I don't like Matt Mira all that much) \n\nGourley's never not funny and he's got such a unique style of comedy. I really need to do a deep dive on Conan O'Brien Needs a Friend",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "SloppyCheeks",
                                                            "body": ">Gourley's never not funny\n\nNo, that's Pardo! \n\nPistol Shrimps Radio was such a good time to be a comedy fan. Mark and Matt will forever be my boogies.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "No_Foundation1136",
                                                    "body": "I have listened to every gourley and rust episode and I don't even like 95% of the movies they cover",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Global_Kiwi_5105",
                                            "body": "shout out to Film Junk",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GoldberryoTulgeyWood",
                                    "body": "So sad about Sona's house burning down!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ladrac1",
                            "body": "I tune in often even when it's an actor or celebrity I know absolutely nothing about. Conan is a master at conversation and humor.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "GawkieBird",
                            "body": "I watched his show all the time in college, and one time dreamed he had gotten out of showbiz and was getting by on giving tours of NYC. He'd get annoyed when people on his tour would be like \"Hey Conan, why aren't you being funny?\" He would say \"It's an ACT!\" like he was tired of all the performative humor and just wanted to be treated like a human for once. I had an even softer spot for him after that, wondering what he was like hanging with him in person. His podcast is more like the real him, I think - and I don't think he would ever fully give up the comedy like he did in my dream",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "2ChicksAtTheSameTime",
                            "body": "one thing i love about his podcast is it is NOT a nostalgia filled \"let's talk about my days on Late Night\" - it's much more topical and it's not trying to win the audience by rehashing the old days.  I feel like a lot of other podcasts by celebs are exactly that.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "vaporking23",
                            "body": "I love long form interviews. There so much more interesting than the short late night stuff that’s there for fluff to promote something. \n\nIf you like long view I’d check out off camera with Sam Jones.  He doesn’t do it anymore but he’s got some great long form interviews with some interesting people and he’s really good at having conversations and getting people to talk.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "mistuhgee",
                            "body": "Watch the Kevin nealon interviews, they're incredible",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SkinNoises",
                            "body": "> podcast\n\nPass",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "wynnduffyisking",
                            "body": "You’re missing out",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SkinNoises",
                            "body": "K",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mistrblank",
                    "body": "I did not appreciate enough what I had when he was on the late late show.  My fridays were always Letterman and then Conan because that's all I could get without a cable box in my room.   \n\nIt was a magical time we called the 90's.",
                    "score": 58,
                    "replies": []
                },
                {
                    "author": "_NoTimeNoLady_",
                    "body": "I learned English with him. Our teacher always gave us one hour of using media in English language per week as homework. NBC was our only American channel on TV and I definitely would never have watched an hour of news.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "anewfoundmatt",
                    "body": "He still does but he used to, too.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "macchiatomama",
                            "body": "Love a good Hedberg in the wild!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Punny_Farting_1877",
                    "body": "Three Inch Bees made me laugh decades ago.\n  \nIt still does.\n  \nAlso the Queen Mother wishing Happy Birthday to Cobalt O’Bunion.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Outside-Drag-3031",
                    "body": "I grew up with him on the Conan show and man I loved it. Also how I first discovered Nick Offerman",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "soulcandiwaifu",
                    "body": "Whoa, never got this many upvotes, thanks guys!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "BoJackMoleman",
                    "body": "He burped at me when I was a kid.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Atillion",
            "body": "Like a THC gummy? 🤣",
            "score": 1645,
            "replies": [
                {
                    "author": "trwwypkmn",
                    "body": "This is LA, so definitely.",
                    "score": 736,
                    "replies": [
                        {
                            "author": "charliesk9unit",
                            "body": "BS. I think Sona took them all before they could include them into the gift bags.",
                            "score": 74,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MothsMyBeloved",
                    "body": "That’s what I was thinking 😭 that would have been a blast lol",
                    "score": 373,
                    "replies": [
                        {
                            "author": "obamnamamna",
                            "body": "He couldn't put them in the boxes, but I'm pretty sure Sona brought enough for everybody",
                            "score": 56,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OnTheEveOfWar",
                    "body": "THC gummies are extremely common in California. I live here and can get them delivered. They’re great because it’s easy to manage the dose and you don’t smell like smoke/weed.",
                    "score": 180,
                    "replies": [
                        {
                            "author": "Character-Tea5714",
                            "body": "I see we’re opposites, I love gummies because they can send you to space in ways a joint never could.\n\nIt also helps that they don’t obliterate your lungs lol",
                            "score": 117,
                            "replies": [
                                {
                                    "author": "SuburbanEnnui2020",
                                    "body": "The only problem with gummies is that, for me, they take too damn long to kick in.  Rice crispy treats on the other hand…",
                                    "score": 39,
                                    "replies": [
                                        {
                                            "author": "GrayDaysGoAway",
                                            "body": "The other problem is that some of us have a gene which causes us not to metabolize THC from edibles properly. I have to eat hundreds of mgs before I feel a thing. And even then it never hits me like it does other people.",
                                            "score": 45,
                                            "replies": [
                                                {
                                                    "author": "eh_meh_nyeh",
                                                    "body": "I'm glad to find someone else with this issue, thought it was just me.",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "burd_turgalur93",
                                                            "body": "It means you don't produce an enzyme called DenoZal  Nucleic Triglyceride-Z. More commonly known as Deez Nutz",
                                                            "score": 9,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ComboBreakerrr",
                                                            "body": "I have the same thing as you. I’ve found that live resin ingestibles seem to circumvent this issue. Still takes more than the average user to provide the same effects, but if you’re interested, give it a try.",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Successful-Bike-1562",
                                                            "body": "Another one checking in. I want in on all the cool edibles too :(",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "GrayDaysGoAway",
                                                            "body": "You're def not alone. It affects like 1 in 4 people iirc.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "SuburbanEnnui2020",
                                                            "body": "My wife suffers from this a bit. I take a whole gummy, and I’m as high as a kite.  She takes a whole gummy and she’s like “I’m not feeling anything”. She has to really load up to get high.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "chucktheduck213",
                                                    "body": "Do you know if that gene also affects other orally ingested things? I’ve noticed it not just with edibles but also like mdma and shrooms. I’ve tried to look it up before but I never got concrete answers",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "ipraytowaffles",
                                                            "body": "Wait same! I’ve had to take 200+ mgs to get a palpable affect. I also am highly unaffected by painkillers.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "bobthemusicindustry",
                                                    "body": "Pretty sure this is me. I’m in PA with a medical card so I tried the gummies starting from 10mg. Felt absolutely nothing from it so I took two and still nothing. Got some that are 50mg a piece and I took one before going bowling with friends and it felt like a mild anti-anxiety pill but definitely didn’t get me stoned. I hate being like this because I would love the convenience of gummies but they don’t work!",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "campfirevilla",
                                                    "body": "Oh my god I didn’t know this was a thing. I’ve downed a bag of 10 gummies in one go and felt nothing, made homemade edibles and felt nothing. I just wanted to see what all the hype was about damnit. Thank you for saving me from trying this again in the future, kind Reddit hero.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "QuantumKittydynamics",
                                                    "body": "Sames! Although I kind of appreciate it - it still gets rid of my PTSD-induced nightmares, but I don't blast off to space, I just drift off to sleep happy as a clam.\n\nI mean, I'm definitely curious what it feels like to be high, but it's probably a good thing that I'm not off my ass every night.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "thomasrat1",
                                                    "body": "I feel that. There are people out here taking 1 gummy. 10mg?\n\nI legitimately would need like 200mg\n\nThat being said, for some reason the baked goods do way better.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "marrell",
                                                    "body": "Same. And when I finally do take enough to feel it, it really doesn’t last much longer. I have friends who feel 5mg for hours. I take 150mg and get maybe an hour of feeling warm and fuzzy.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "kohitown",
                                                    "body": "I fear this might be me...I found out the hard way that if I buy a pack of gummies that are 10mg each, it takes me at least 5+ of them to feel anything :') I vape instead for this reason, but I hate to think about my poor lungs. I've always wished that edibles worked better for me",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "kniselydone",
                                                    "body": "Hey! 👋🏼 I'm your equal and opposite weed twin. I don't metabolize THC from inhalation properly.\n\nI can just smoke and smoke and vape and vape like a chain-smoker with his favorite pack of cigarettes and eventually I get a mild high lol. Thankfully for me there are drinks and gummies that do metabolize normally for me. Never knew there was someone with the opposite thing.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ipraytowaffles",
                                                    "body": "Ugh I’m jealous, can we swap?",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "MsLogophile",
                                                    "body": "Wait yes. Also same with vapes.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Turbulent-Jaguar-909",
                                            "body": "nano infusion, its like 15–20-minute onset in my experience vs like 40-1hr+",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "sheepthechicken",
                                            "body": "Same! As another commenter said, some of the “nano” gummies are faster, but I appreciate gel caps. No taste, fast acting, and I find them to be more consistent!",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Darksirius",
                                            "body": "Also helps to eat them on an empty stomach - so don't eat for a few hours before.  That way, they are they only thing to get processed at the time.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "BillDino",
                                            "body": "Try a thc soda, they kick in about 15 minutes",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "underthe-cherrytree",
                                    "body": "But obliterating your lungs is half the fun!! \n/s",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Theoretical-idealist",
                                    "body": "They make me fucking shiver so badly",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "rkthehermit",
                                    "body": ">I see we’re opposites, I love gummies because they can send you to space in ways a joint never could.\n\nI've never seen them stronger than 10mg in WA so no cosmic journeys for us.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "adaranyx",
                                    "body": "Really? In Michigan you can get a pack of one 200mg gummy for like $3.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "possum_party420",
                                    "body": "i just take two 10mg gummies and im in space lol",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "thomasrat1",
                                    "body": "Medical grade edibles.\n\nThey can be like 50 per gummy.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Character-Tea5714",
                                    "body": "I have multiple nerd ropes that are 320 mg each lol",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "wandering-monster",
                                    "body": "That's the thing about being easy to manage: it's easy no matter what your goal is!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "COMMENT0R_3000",
                                    "body": ">\tsend you to space \n\nNever again lol",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EvilSporkOfDeath",
                            "body": "Edibles can definitely make your breath smell like weed. More discreet than smoking for sure, but not odorless.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "lookalive07",
                                    "body": "Depends on the dose and what type of edible it is.  I've made cookies and the butter I infused definitely had a flavor and aftertaste, but the edibles I take these days are basically like eating candy with no other taste.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "FreewayPineapple",
                            "body": "Try 1000mg",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BuddahSack",
                    "body": "Yeah, it's California and Conan definitely partakes haha\n\nEdit: I guess Conan doesn't smoke haha... I know Andy Richter does haha",
                    "score": 85,
                    "replies": [
                        {
                            "author": "what_did_you_kill",
                            "body": "He's said he's tried marijuana a few times but never really got high or enjoyed it, and that his only poison was alcohol.\n\nHe's also remarked at how his doctor didn't believe him when asked if he ever did cocaine and conan insisted that he never did; while the doctor was like \"I've watched your show dude..\"",
                            "score": 127,
                            "replies": [
                                {
                                    "author": "Reead",
                                    "body": "I could 100% believe Conan has never done cocaine. He's a guy without an off switch, and if it weren't a completely natural part of who he is I think it would've burned him to a crisp by now.",
                                    "score": 97,
                                    "replies": [
                                        {
                                            "author": "emeraldeyesshine",
                                            "body": "His energy doesn't really say cocaine to me, and I've spent a shitload of time around cocaine due to being a chef and musician.\n\nHe's high energy but it isn't a coke energy.",
                                            "score": 68,
                                            "replies": [
                                                {
                                                    "author": "redditin_at_work",
                                                    "body": "It is theater kid energy",
                                                    "score": 76,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TimequakeTales",
                                            "body": "Hey told this story about SNL where he walked in on some guys doing coke.  They offered him some and he was like \"ACTUALLY MY FATHER IS A DOCTOR HE SAYS THERE ARE ADVERSE CARDIVASCULAR EFFECTS...\"",
                                            "score": 43,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DrHem",
                                    "body": "[He had Seth Rogen as a guest in one of the last episodes of his TBS show \\(maybe 2nd to last show\\). Conan talked about not liking it but eventually lit a joint](https://www.youtube.com/watch?v=FXrJNExqIvs)\n\nI don't think Conan really inhaled. Andy on the other hand...\n\nThe entire video is worth a watch, but skip to 3:40 for when they light up",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "BlackbirdDesignRI",
                                    "body": "I’d guess that as a Massachusetts native who was in Greater Boston in the mid-‘80s, Conan was probably reluctant to get anywhere near cocaine after Len Bias’s death.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "asupernova91",
                                    "body": "Right! I vaguely remember a segment from his show where he, Ice Cube, and Kevin Hart help a girl pass her drivers test and they end up smoking and he certainly looked like he doesn’t do that often lol.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "djfdhigkgfIaruflg",
                                    "body": "Lmao ",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "what_did_you_kill",
                                    "body": "We've seen him \"get high\" on camera twice, once being in close proximity to weed when doing a segment with ice cube and the other time when seth rogen passed him a blunt. Guy seems like a total square.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Where_Im_Needed",
                            "body": "Unless hes lying he always says he never does any drugs. And i believe him some people are just natural crack heads.",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "obamasmole",
                                    "body": "On the latest Conan O'Brien Needs a Fan, the were interviewing a glassblower who sent In a bong. He's either a better actor than Daniel Day Lewis, or he knows shit all about weed.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Where_Im_Needed",
                                            "body": "Yup and hes always givin sona shit about smoking and eating edibles, so its either a bit that she doesnt call him out on… or more likely true that he really never does anything but an occasional drink. Who knows tho celebs only let us kno what they want us to",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "fckspzfr",
                                    "body": "Agreed! Although I could imagine he might have started since the legalization, sure seems like a guy who _might_ enjoy its effects",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "axxl75",
                            "body": "He’s been very open on his podcast that he doesn’t. Although in a recent episode a fan gifted them a 3 way bong and he promised to smoke with his cohosts this summer.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "BobTheFettt",
                            "body": "He says it doesn't do anything for him",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FrostyD7",
                    "body": "Half that crowd has a tolerance and enough drugs currently in their system to render any gummy useless.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "toddlertoads",
                    "body": "dunno why disney would axe anything else",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "TimequakeTales",
                    "body": "Sona is a bad influence!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Atillion",
                            "body": "Protect her at all costs!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Swimming-Scholar-675",
                    "body": "yeah i mean we see the tv version but i imagine it's a lot of sitting around not doing much so rather than getting hammered, get a lil buzz haha",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "s3rila",
                    "body": "probably recommended by Sona",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "kapitaalH",
                    "body": "No the artificial sugar laxative Gummies. Disney was worried that the event might be turn into a disaster",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "khe22883",
                    "body": "Do you think he had the inclusion of a single, ordinary gummy candy vetoed by Disney?\n\nDoes that seem likely to you?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MariachiStucardo",
                    "body": "That’s the joke",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jednatt",
                    "body": "I thought the joke was they cause constipation, thus a \"hard pass\" lol...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "whalesalad",
                    "body": "yes",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "2ChicksAtTheSameTime",
                    "body": "Yeah. And Disney made the cartoon The Gummi Bears and so it was be a bad cross over.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Nidis",
                    "body": "This is the guy that helped write the best seasons of the Simpsons, so yeah",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 347,
            "replies": [
                {
                    "author": "Carbon-Base",
                    "body": "He's awesome for sure. And not only that, but he went out of his way to diss someone without a track.",
                    "score": 36,
                    "replies": []
                }
            ]
        },
        {
            "author": "momoenthusiastic",
            "body": "Conan is great. Oscars should be his TV show going forward ",
            "score": 506,
            "replies": [
                {
                    "author": "KayakerMel",
                    "body": "He really reminded me of seeing Billy Crystal hosting when I was a kid!",
                    "score": 65,
                    "replies": []
                }
            ]
        },
        {
            "author": "Doodlebug510",
            "body": "I am always impressed when megastars acknowledge the little people.",
            "score": 1609,
            "replies": [
                {
                    "author": "SeminaryStudentARH",
                    "body": "There’s a great video on YouTube that shows how good Conan is a host, how he takes command and settles his guests when they’re nervous. He’s so good.",
                    "score": 593,
                    "replies": [
                        {
                            "author": "CautionarySnail",
                            "body": "He’s a true professional.  \n\nProfessionals know that the success of their career is dependent on a multitude of humble folks doing their jobs competently. And they have real and consistent gratitude for that.   \n\nThis is also true of competent leaders in general.",
                            "score": 285,
                            "replies": []
                        },
                        {
                            "author": "Doodlebug510",
                            "body": "That so heart-warming 🥰",
                            "score": 54,
                            "replies": []
                        },
                        {
                            "author": "Captain_DuClark",
                            "body": "I would love to see that video, got a link?",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "SeminaryStudentARH",
                                    "body": "Had to search haha. It’s a little long, but there’s a great bit around the 8.5 minute mark where he breaks down an interview with Rooney Mara. The whole thing is great though. \n\nhttps://youtu.be/4cjBFa6MdUQ?si=JMRaNWCXDsapMF0L",
                                    "score": 93,
                                    "replies": [
                                        {
                                            "author": "KIDA_Rep",
                                            "body": "I was already a huge fan of him, but when I saw that Rooney Mara interview I was in awe of the master class he showed, he knows when and how to drive the conversation and when to let other people drive, e.g. Bill Burr and Norm Macdonald.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "SeminaryStudentARH",
                                                    "body": "Right! He’s so good.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Captain_DuClark",
                                            "body": "Thank you!",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "Darksirius",
                                                    "body": "Yeah, that was an awesome watch.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TimequakeTales",
                                            "body": "Man, those Fallon clips are brutal",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "BenR1ghtBack",
                                    "body": "If you search “Conan” on YouTube I think you’ll find it. There can’t be too many videos of this guy.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "Scrumptious_Foreskin",
                                            "body": "This will also inform you on the time of his life when he was also known by “The Barbarian” and I recommend everyone check out that part of his life",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "JinGilly",
                                                    "body": "There is also his childhood as a detective.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "djfdhigkgfIaruflg",
                                            "body": "Lol. Picturing someone drowning on vids",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "dirtyshits",
                                                    "body": "Or absolutely swimming in previously unknown conan content. I wouldn't mind discovering conan for the first time right now. I coould waste a year of my life just binging conan.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "StyofoamSword",
                                    "body": "Here's another good one, animal expert is on the show and it goes a little wrong, and Conan just jokes about being careful next time. The same guy did come back over the years.\n\nhttps://www.youtube.com/watch?v=QjNvbxNzW54&pp=ygUTY29uYW4gYW5pbWFsIGV4cGVydA%3D%3D",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BobTheFettt",
                            "body": "He also loves talking to his fans so much, that they'll often get bored of talking to him before Conan is done talking",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SeminaryStudentARH",
                                    "body": "That’s actually kind of hilarious. And i feel like very on brand for Conan.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HolySHlT",
                            "body": "Unless you're Jordan Schlanksy . . .",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SeminaryStudentARH",
                                    "body": "Hahahaha poor Jordan. But i mean, it’s really on him for working there that long.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Wakkit1988",
                    "body": "He's 6'4\", most people are little people to him!",
                    "score": 49,
                    "replies": [
                        {
                            "author": "Doodlebug510",
                            "body": "Lol good point",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "gin_and_toxic",
                            "body": "No treats for Shaq.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RusTheCrow",
                    "body": "I thought it was cool when Colin Farrell was accepting a golden globe for Penguin and he gave a special shout-out to craft services for keeping him hydrated while he wore that fat suit.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Doodlebug510",
                            "body": "I love it.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Capt_Murphy_",
                    "body": "Thing is, he actually GETS IT that the \"little people\" are as important (or even more important) than him. This shouldn't be a rarity, but unfortunately it is. He will endlessly have my respect for being both a genius AND a good person.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "heirbagger",
                    "body": "He and his family donated to a lot of GoFundMes after the fires in LA. Just regular people. Such a good dude.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Breadstix009",
                    "body": "Little people. Wow. Hey mega stars are also just humans too. You don't need to idol worship them.",
                    "score": -24,
                    "replies": []
                },
                {
                    "author": "Doodlebug510",
                    "body": "Someone doesn't understand tongue in cheek.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Glittering_Wind7424",
                    "body": "This is a nice gesture but also is for sure put together by production using a handwriting robot. Conan didn’t have anything to do with this.\n\nEDIT: I’m a union Assistant Director in the LA area. This is literally my profession.\n\nYeah sure guys, Conan O’Brien himself went out and packed goodie bags for hundred of audience members. He even did a little doodle of himself on every single card. How caring. He even went out and bought the snacks, it definitely wasn’t some group of PAs in their personal vehicles bouncing from Trader Joe’s to Trader Joe’s across hollywood.",
                    "score": -52,
                    "replies": []
                },
                {
                    "author": "Doodlebug510",
                    "body": ">This is a nice gesture\n\nYes it is. Whether or not he personally created these, if it was Conan's idea, that deserves credit as well IMO.",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "Glittering_Wind7424",
                    "body": "It’s very industry standard to provide snacks to audience members. I promise you every year prior the audience has also received snacks with a card or something of that sort. \n\nI don’t have a lot of experience in live production, but if there are union actors/fill ins under contract there then it’s required to provide food.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "EatsYourShorts",
                    "body": "From another post about this earlier, I learned that Kimmel gave people snacks, a “handwritten” note, and donated to St Jude’s in their name. Not trying to say Kimmel is better than Conan, just that this sort of thing isn’t unprecedented and not the kind of thing we should be praising him for.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ChoiceReflection965",
                    "body": "We should praise each other, all the time, as much as we possibly can. For any conceivable act of kindness, no matter how big or small. The world is a dark place and we have the power to make it a little better by recognizing the good in one another :)",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Glittering_Wind7424",
                    "body": "It’s just industry standard event fluff. I’ve worked so many jobs over the course of my career, I’ve hand packed a fuck load of goody bags, I’ve wrangled studio audiences, I’ve worked live events. This is just how these things go.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "KronoFury",
                    "body": "A handwriting bot...? Do you know what a copy machine is?",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "cliffy_b",
                    "body": "Plotters are used sometimes so copies look handwritten.  \"Handwritting bot\" is a pretty apt description.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "IWantALargeFarva",
                    "body": "Back in the early 90s, some stores had plotters as a sort of vending machine. You could choose from a set of greeting card styles, personalize it with your name and the name of the recipient, and then watch the plotters do its thing. I had so much fun just watching it draw, switch pens, do its little robotic thing. I can still hear the sounds of the machine.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cliffy_b",
                    "body": "I missed those, (was also pretty young in the early 90s) but that sounds awesome.  Thanks for sharing!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Glittering_Wind7424",
                    "body": "I work in film production lol. Yeah I’m guessing Reddit knows more about my profession than I do. That’s always the case around here.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TomThumbTwo",
            "body": "What's a seat filler?",
            "score": 348,
            "replies": [
                {
                    "author": "Flare_Starchild",
                    "body": "Someone that can just come in and isn't actually nominated or anything they just go and sit in a seat for the cameras so the place doesn't look half empty.",
                    "score": 719,
                    "replies": [
                        {
                            "author": "Blahblahblahrawr",
                            "body": "Do you know if they’re just regular people or also actors? I never know about this!",
                            "score": 219,
                            "replies": [
                                {
                                    "author": "mrsxpando",
                                    "body": "They work for the accounting firm that counts the votes. Thy have to apply and it’s a privilege to be chosen. \n\nSource: I worked for PricewaterhouseCoopers. ",
                                    "score": 690,
                                    "replies": [
                                        {
                                            "author": "Blahblahblahrawr",
                                            "body": "Aww that’s so cute! Thanks for sharing!",
                                            "score": 98,
                                            "replies": [
                                                {
                                                    "author": "DetBabyLegs",
                                                    "body": "You can apply to be seat fillers for events. Went to maybe 5 award shows when in college for free. Sometimes got other perks like free food and drinks at the video game awards. Fun thing to do as a broke college kid",
                                                    "score": 83,
                                                    "replies": [
                                                        {
                                                            "author": "Blahblahblahrawr",
                                                            "body": "That’s so cool, I never knew this was a thing, sounds like it was a ton of fun!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Massive_Caregiver476",
                                                    "body": "I love this genuine interest it’s so adorable",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Blahblahblahrawr",
                                                            "body": "❤️",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GypsySnowflake",
                                            "body": "Oh interesting! I was assuming they were the guests of the nominees, or just regular people who paid for tickets.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "author": "broad5ide",
                                                    "body": "The nominees do get to bring guests, but there is a limit to how many they can bring and the tickets open to the public are based on a lottery.\n\nSource: have a family member in the industry that's been to the Oscars and we tried to get extra tickets.",
                                                    "score": 29,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sanesociopath",
                                            "body": "That makes sense for the amount of vetting needed to get a non paid person to sit there that wants to be there",
                                            "score": 27,
                                            "replies": []
                                        },
                                        {
                                            "author": "joggle1",
                                            "body": "That's nice, but it would've been funny if they hired actors for the role of being actors nominated for Oscars. So while you aren't good enough to actually be nominated for an Oscar, you *are* good enough to pretend to be such an actor.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Blahblahblahrawr",
                                                    "body": "lol this is what I thought it was, like actors famous enough to be recognized and not stand out as a random but not famous enough to be nominated 😂",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "HummousTahini",
                                            "body": "Did you ever have to go, or if you didn't, talk to folks who did? What's it like? I think this would make an interesting AMA!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "mrsxpando",
                                                    "body": "I never went. They went by office location and mine wasn’t chosen while I worked there. \n\nIt had been chosen a year or two before. One woman who was chosen said she was asked by a couple major actresses if they looked okay after a visit to the restroom. The  nominees would be nervous etc. \n\nMostly it was discreetly sitting in a seat for 5-10 minutes and then moving to the next seat assignment. ",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Odd-Goose-8394",
                                                            "body": "Seat assignment? Can you explain? Why for only 10 minutes and not the whole show? Sorry I’m naive and confused lol",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Blahblahblahrawr",
                                                            "body": "Aww that’s sweet to hear the vulnerable side of super famous people too. 💕",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GonnaTry2BeNice",
                                            "body": "Why does an accounting firm count votes for movie awards?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "plantsadnshit",
                                                    "body": "I mean, I guess you'd assume they're good with numbers.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "hc221970",
                                            "body": "My son has been a seat filler for the past three years. He is a film archivist for the Oscars. This year, someone didn't show up so he was in the third row behind Demi for the entire show!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "natigin",
                                    "body": "I have a family member who is plugged into the NYC theatre scene and has done seat filling for the Tony’s for a couple years now. Its one of those opportunities you get if you know people.",
                                    "score": 104,
                                    "replies": [
                                        {
                                            "author": "demoshots",
                                            "body": "Kosmo?",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "rraattbbooyy",
                                                    "body": "Scarsdale Surprise.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FancyJesse",
                                    "body": "People usually line up outside the place early in hopes to get in. \n\nYou see this a lot for shows like America's Got Talent or similar. The line starts hours before the live recording for the show starts.\n\nAnd sometimes those recording sessions take very very long. The judge panel and crew take lunch breaks and they expect the audience to just wait. They don't want anyone to leave. And they usually never provide snacks or anything for the audience.\n\nSo you're SOL if you didn't eat well before getting inside.\n\n\nSo Conan providing these snack boxes is amazing.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "SwissQueso",
                                            "body": "Thats true for regular shows, but the Oscars has a dress code.  I would imagine there is a lot more vetting.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "mickey-waffle",
                                    "body": "It can be just regular people. Sites like 1iota post for seat fillers for award shows, or you just have to know people.\n\nMy friend regularly seat fills for the Emmys and she has no connection to Hollywood at all. She has gotten me videos from my favorite actors in Grey's Anatomy and other shows. Super cool.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Current_Guidance_989",
                                    "body": "Students in a certain track of the film dept in my college got to be seat fillers but I think they axed it after some other party threw a fit.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Blahblahblahrawr",
                                            "body": ":( that’s such a perfect group of people to go and feel inspired",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Flare_Starchild",
                                    "body": "I'm not sure but I assume they are friends and family due to security.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Blahblahblahrawr",
                                            "body": "Ahh that makes sense! That would be cool for family and friends to get to attend",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "FrostyD7",
                                            "body": "Security concerns aside... Why would you invite random people when there's a long waitlist of people actually connected to the event that want to attend?",
                                            "score": -7,
                                            "replies": []
                                        },
                                        {
                                            "author": "silverwingsofglory",
                                            "body": "Because they only get a seat when the star goes to the bathroom or gets a drink, then when the star returns they get up and leave and wait for the next empty seat.  It's a job not something for someone who actually wants to attend and enjoy the show.",
                                            "score": 22,
                                            "replies": []
                                        },
                                        {
                                            "author": "FrostyD7",
                                            "body": "Sure, I get it, but why would this logic not still apply?  There's presumably no shortage of non-random individuals connected to the event who are eager to do this.",
                                            "score": -2,
                                            "replies": []
                                        },
                                        {
                                            "author": "silverwingsofglory",
                                            "body": "If you're connected to the event it would either be insulting (\"we don't have a seat for you but here's a thankless job you can do for us!\") or you might be bad at the job by trying to socialize with people you know.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "FrostyD7",
                                            "body": "An insult lol... I'm not just talking about celebrities.  There are hundreds of people involved with planning the Oscars that don't get to attend or expect to.  I promise they'd jump at the opportunity to join the Oscar festivities.  Otherwise they just have to sit at home.",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "silverwingsofglory",
                                            "body": "Yes, an insult.  Again: they're not \"joining the festivities.\" It's a low wage job. You're supposed to fill a seat, not talk to people, and get herded around like cattle.  If someone is \"involved in planning the Oscars\" I'm guessing there's some avenue for applying, but I'd imagine it would be insulting if you feel you deserve a real seat for your work just to get put in a backroom waiting for a commercial break or someone to go to the bathroom.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "FrostyD7",
                                            "body": "You are being ridiculous.  I'm talking about people who work on kraft services, interior decorating, writing, coordinating the filmed segments, etc.  Tons of people who have *zero* reason to expect to sit in the audience at the event.  Why would it be an *insult* to merely be offered that chance?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "silverwingsofglory",
                                                    "body": "Because those are well paid highly skilled jobs and you're offering them a low-wage entry level job as a \"reward\" instead of an actual seat to the thing they worked on.  You truly don't understand human nature at all. Or Hollywood.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "FrostyD7",
                                                            "body": "Human nature is the part where they'd gladly accept the offer because the alternative is sitting at home and not attending the Oscars.  You can say whatever you want about how it isn't actually attending, but I think most people aren't so cynical.  Anyone active on social media would salivate at the opportunity to brag about being at the Oscars.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "silverwingsofglory",
                                                                    "body": "Nah, I work in Hollywood.  You don't understand this world.  Later.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "FrostyD7",
                                                                            "body": "Sorry you didn't get invited to the Oscars bro.  No need to apply your bitter experience in that world to everyone else.  Plenty of the folks working on the Oscars are just people hired to set up events.  They aren't \"Hollywood\".",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "silverwingsofglory",
                                                                                    "body": "Again: working a minimum wage job as a seat filler isn't \"getting invited to the Oscars\" you weirdo.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "FrostyD7",
                                                                                            "body": "You don't even get paid so that shows how much you know about any of it.  They fill the need with volunteers because people want to do it.  You are in denial for some reason even though this is all easily verifiable.  Your claimed experience seems to just be your opinions.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "silverwingsofglory",
                                                                                                    "body": "I went to college in LA and back then there were fliers up for paid jobs as seat fillers for various awards shows. Even then it seemed like a shit deal because you had to provide your own black tie attire.  If they're no longer paid, that's even sadder.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "asupernova91",
                                    "body": "Other award shows do use regular people though! You can register to do it through a company named Iota.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Blahblahblahrawr",
                                            "body": "Thank you! Sounds fun!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Eborcurean",
                            "body": "Lewis Capaldi while on Graham Norton's show said he got confused with a seat filler while at the Grammys and another one came up to take his seat.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "charliesk9unit",
                            "body": "I think specifically for seats vacated by people going to the restroom, etc.\n\nKramer was a seat filler.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Blahblahblahrawr",
                                    "body": "Was the character a seat filler on the show or in real life?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "chrisaf69",
                    "body": "I have a friend who does it. Just like the name says, they fill the seat if someone gets up for whatever reason. I'm guessing it's so it makes the crowd always look full.\n\nKinda bizarre to me, but he gets to get paid to view a lot of cool events. So a win win I guess. Haha",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "sahm8585",
                    "body": "When someone wins an award and gets up to give their speech, a person runs in and sits in their seat so the crowd shots look full. Then they leave when the winner comes back.",
                    "score": 105,
                    "replies": [
                        {
                            "author": "liosistaken",
                            "body": "And for when someone needs to go to the bathroom.",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "bigdrubowski",
                                    "body": "Or to perform, etc.",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "zcewaunt",
                                            "body": "Or to go do blow, etc., in the bathroom.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "LongLongMan_TM",
                                                    "body": "Or when you need, you know, to tie your shoes.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "bigdrubowski",
                                                    "body": "Whatever you do, wash your hands.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dav136",
                            "body": "From interviews I've heard it's mostly because half the crowd is at the bar at any given time",
                            "score": 44,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cottesloe",
                    "body": "[https://youtu.be/YzlmdM11Hws?t=94](https://youtu.be/YzlmdM11Hws?t=94)\n\n  \nWorth the watch. Educational.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "innerdork",
                    "body": "I was one for NFL honors in Vegas last year. Saw everyone. Fist bumped Baker Mayfield. Very cool experience. And yes you just sit there to fill the seat and if someone takes your seat you wait for the next open one and sit there. I only had to change seats twice then took in the ceremony.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImmediateNature2103",
            "body": "I wonder how long it took Sona to fill all those boxes.",
            "score": 186,
            "replies": [
                {
                    "author": "Mugwumps_has_spoken",
                    "body": "Lol. He made her do it to pay off the coat we keep hearing about?",
                    "score": 66,
                    "replies": []
                },
                {
                    "author": "funkboy27",
                    "body": "lol Sona wouldn’t be caught dead doing actual work.  That is what David Hopping is for",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "ahmc84",
                    "body": "What do you think actually happened to those gummies?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "leg_day",
                            "body": "Sona ate them. She chomped them like scooby snacks.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IHateTheLetterF",
                    "body": "She has enough time on her hands. It's not like she has to do housework or anything (I'm sorry Sona, you're amazing)",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Purple-Adeptness-940",
                            "body": "Ohhhh burn!! Oh wait... 🙃",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BobTheFettt",
                    "body": "Oh you know it was David",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "NightOwlsUnite",
            "body": "Well now I want to see what all was in there lol",
            "score": 70,
            "replies": [
                {
                    "author": "avocadolamb",
                    "body": "a soft pretzel, mustard, raisinets, and water lol",
                    "score": 58,
                    "replies": [
                        {
                            "author": "goddamnitwhalen",
                            "body": "Soft pretzels are best pretzels.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "IcyTiger8793",
                                    "body": "Only if they’re good. A bad soft pretzel is worse than a bad crunchy one.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xmal16",
            "body": "Conan paid all of his writers during the original strike, and kept the show going without them so they all kept their jobs until it was over. \n\nExtremely common Conan W",
            "score": 62,
            "replies": []
        },
        {
            "author": "ZeroAgentTV",
            "body": "Mr O’Brien lived in the town over from me when I was growing up. My first job was valet parking cars and I used to park his silver Range Rover all the time. He was the nicest dude in the world. Can confirm this is on brand for him.",
            "score": 113,
            "replies": []
        },
        {
            "author": "myWobblySausage",
            "body": "Was trying to think why Disney wouldn't allow Gummy Bears.  Wondering if it was a copy right thin... *click* ahhh, a gummy.",
            "score": 138,
            "replies": [
                {
                    "author": "circuit_buzz79",
                    "body": "You and me both.  And I'm Canadian.\n\nAre those even legal in the States?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Prestigious_Egg_6207",
                            "body": "Depends on the state. They’re definitely legal in California.",
                            "score": 52,
                            "replies": []
                        },
                        {
                            "author": "AbstractThoughtz",
                            "body": "Some states yeah",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "56473829110",
                            "body": "Federally, no. Statewide, yes depending on the state. It's a grey/green area.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "HammerSmashedHeretic",
                            "body": "About half of the states yeah",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Mythoclast",
                                    "body": "You got a recipe?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Killarogue",
                            "body": "100% legal in california",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Barbaracle",
                            "body": " California baby. Can get edibles delivered in 15 minutes or there's like 5 by my house with 20+ different flavors, brands, gummies, cookies, chocolates, etc. Some of the shops feel like a luxury boutique stores lol. Clean and safe in gentrified areas. Or grow and cook my own. All legal stateside.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RusTheCrow",
                    "body": "ABC, owned by Disney, has the broadcast rights until 2028",
                    "score": 4,
                    "replies": [
                        {
                            "author": "OkYeah_Death2America",
                            "body": "Oh, I was thinking Disney had purchased all of media while I wasn't looking instead of just 80% of it.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ReynardMuldrake",
                    "body": "Disney does own the Gummi Bears, but I don't think that's what he was referring to.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "2ChicksAtTheSameTime",
                    "body": "Disney did do a Saturday morning cartoon show called The Gummi Bears.\n\nhttps://en.wikipedia.org/wiki/Adventures_of_the_Gummi_Bears",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Soft-Company-6762",
                    "body": "I thought it was a word play because gummies are soft but then I connected the dots when I read this thread.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dirtyshits",
                    "body": "Weed. He's talking about weed. To make the show less of a drag or to get a few more laughs lol.\n\nIt's a liability that Disney doesn't want on their hands.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ATATImperialWalker",
            "body": "I was an intern for late night the winter of 2007-2008, during the writer’s strike. It was such an odd experience, no writers around but there was Conan wandering around the office daily, chatting with his interns and employees, sometimes with his guitar and amp slung over his shoulder jamming.  He was a really nice guy and it was bittersweet I didn’t get to experience the show in its full glory due to the strike, but it was still awesome and helps confirm that yeah, he’s a great person.",
            "score": 43,
            "replies": []
        },
        {
            "author": "ElectricDaisyFlower",
            "body": "Conan always being the best.",
            "score": 24,
            "replies": []
        },
        {
            "author": "dumbinternetstuff",
            "body": "He seems like a genuinely good person. The world needs infinitely more people like him. ",
            "score": 18,
            "replies": []
        },
        {
            "author": "ImpalaGangDboyAli",
            "body": "How can anyone hate Conan",
            "score": 39,
            "replies": [
                {
                    "author": "johannes1234",
                    "body": "Only Jay Leno thinks he knows.",
                    "score": 37,
                    "replies": []
                }
            ]
        },
        {
            "author": "yuyufan43",
            "body": "Seat fillers should get the exact same gift bags the other people get. They're important too",
            "score": 17,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 48,
            "replies": [
                {
                    "author": "ATLAuto",
                    "body": "Disney owns ABC",
                    "score": 97,
                    "replies": [
                        {
                            "author": "kelsobjammin",
                            "body": "Disney owns a lot",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "Scrumptious_Foreskin",
                                    "body": "Disney? That animated show with the cartoon mouse?",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "phl_fc",
                                            "body": "That mouse is rich AF.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "primum",
                                            "body": "Willie, the Steamboat captain?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SagittaryX",
                                    "body": "Disney owns a studio lot? That seems a bit far fetched to me.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Due-Comb6124",
                                            "body": "Disney owned Star Wars for 6 years before Disney plus was announced......",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "intelligentprince",
                            "body": "Ever wonder why ABC News has so many news items about Disney parks etc?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "RusTheCrow",
                            "body": "And ABC has the broadcast rights for the Oscars until 2028.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Loofa_of_Doom",
                            "body": "blech, I did not know that.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "goddamnitwhalen",
                                    "body": "They have for decades lol.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "lookalive07",
                                    "body": "You give more money to the Mouse than you realize.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Godfuckingdammit91",
            "body": "My husband and I scored tickets to his TBS show taping the same day Letterman taped his last show. When the time came that Dave would be on, Conan shouted at the studio/would-be home audience to switch the channel to Dave to send him off. Class act.",
            "score": 12,
            "replies": [
                {
                    "author": "StyofoamSword",
                    "body": "Not surprised, he took over Late Night from Letterman, and when he was struggling early on, Letterman came on the show and talked about how much he liked what Conan was doing.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "KinshasaPR",
            "body": "I've never heard a story that's made me think Conan is not a great person. Every one who's worked with/under him speaks highly of him and how it never felt like he was the actual boss, but more like a friendly coworker.",
            "score": 24,
            "replies": [
                {
                    "author": "thisismyanimealt",
                    "body": "I'd say, \"Maybe you need to hear a few stories from Jordan\" but that would probably put you to sleep so fast, you still wouldn't have heard a story that's made you think Conan is not a great person.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "KinshasaPR",
                            "body": "Jordan Schalansky?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "K-Tronn3030",
                            "body": "He threw me a bachelor party in my office that I didn't want. He took my coffee machine, he squirted my fancy olive oil all over my desk. He made me punch in using an old timey punchcard machine.  He made fun of the alkanity at which I prefer my water.\n\nI could go on.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Askol",
                                    "body": "But the funny thing is you can tell Jordan STILL loves Conan despite all of that.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "things_U_choose_2_b",
                                            "body": "Yeah the \"you ruined Star Wars by sitting behind me\" story is the epitome of that. I love hearing them bicker, could listen for hours!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "YOLO_Tamasi",
            "body": "Not to take away the Conan narrative, but seat fillers have always gotten a box of snacks/goodies at the Oscars.",
            "score": 10,
            "replies": []
        },
        {
            "author": "sovereignxx12",
            "body": "I need to know how to be a seat filler",
            "score": 21,
            "replies": [
                {
                    "author": "shesalive_dammit",
                    "body": "I had no idea this was a thing.  \nI watched an episode of Great News, and one of the characters was a seat filler for some small awards ceremony. She wore a sign around her neck that said \"Not a person.\" It was a very silly episode. I thought it was made-up. 😂",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Literary_Lady",
                            "body": "I really liked that show, was disappointed it didn’t get renewed ):",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MarvinHeemeyersTank",
            "body": "Did he include some...\n\n( •_•)\n\n( •_•)>⌐■-■\n\n﻿(⌐■_■)\n\n...'coco' powder?\n\n#YYYYYYYEEEEEAAAAAAAAAAHHHHHHHHHHHH",
            "score": 21,
            "replies": []
        },
        {
            "author": "scaredshizaless",
            "body": "He was my very first celebrity crush when I would sneakily watch his laye night show even though I wasn't allowed to.",
            "score": 8,
            "replies": []
        },
        {
            "author": "whiskybean",
            "body": "Hollywood is full of insufferable people who only care about themselves - why else would you need a \"seat filler\" to make it appear like your program celebrating yourselves is full all the time like an overproduced TV drama?\n\nAnd then there's Conan - HE i would like to share a beer with",
            "score": 7,
            "replies": []
        },
        {
            "author": "PreciousRoy666",
            "body": "I actually met Conan when I was 11 as part of a charity thing. I tried to play it cool cause I was starstruck and he called me out on it and made a joke about how disappointed I was that he wasn't very funny.\n\nEdit: wow, I actually found a [video](https://youtu.be/LEC_lkpD3rM?si=leNPwHK9byDwTTpE) of it on YT!",
            "score": 7,
            "replies": [
                {
                    "author": "jdowney1982",
                    "body": "😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "reckonergolsen",
                    "body": "Damn, he looks so young there!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zissoum",
                    "body": "Well played sir, well played",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Southern_One3791",
            "body": "TIL there are seat fillers at the Oscar's. Now I want to be one.",
            "score": 7,
            "replies": []
        },
        {
            "author": "trwwypkmn",
            "body": "Please, God, don't let Conan turn out to be a horrible person.",
            "score": 29,
            "replies": [
                {
                    "author": "K-Tronn3030",
                    "body": "At this point, we've got about 30 years of data points strongly suggesting that he is not.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "Askol",
                    "body": "You know he's not a horrible person because like his entire staff has worked for him forever - you don't stick by somebody (especially considering all the changes he's had) unless they're truly a great boss/person.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "DodecahedronSpace",
                    "body": "My exact thoughts. May he join the \"never found being a shit-heel club\"!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MacduffFifesNo1Thane",
                    "body": "He wouldn’t let Bart dance.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HammerSmashedHeretic",
                    "body": "The way reddit is spamming pictures of him, seems like he is about to be exposed for being a diddler",
                    "score": -9,
                    "replies": []
                }
            ]
        },
        {
            "author": "TwilightPandaChime",
            "body": "name a better ginger than Conan. u cant",
            "score": 12,
            "replies": [
                {
                    "author": "RusTheCrow",
                    "body": "I dunno about \"better\", but Bill Burr is equally good",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PretentiousMouthfeel",
                            "body": "Bill Burr is cool and all, but he's also a giant asshole (One I usually agree with, for the record), so no, he's not \"equally\" good.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "pupetmeatpudding",
                                    "body": "I dunno, everything I hear about Bill Burr suggests he might be equally \"good\", but certainly not equally \"nice\".",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SuperPookypower",
            "body": "Impressive to see him look out for the little guy. Everyone’s nice to the celebs.",
            "score": 6,
            "replies": []
        },
        {
            "author": "5td_1game",
            "body": "One of my favourite Simpsons writer",
            "score": 7,
            "replies": [
                {
                    "author": "TwoPennyRaven",
                    "body": "Marge vs. the Monorail is one of my favorite Simpsons eps & I love the fact he was the one who wrote it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Jordan818",
                            "body": "\nIn case you haven’t seen this! [https://youtu.be/-ymOWS-z7kg?si=jIrGPLKq2-Y8-YWG](https://youtu.be/-ymOWS-z7kg?si=jIrGPLKq2-Y8-YWG)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "harrymwag",
            "body": "i tell everyone i know but i met conan on the streets of boston last year. he was so sweet, my friend and i got a picture and when we asked why he was in boston, he said he was visiting his brother in the hospital. we felt so bad and just said “we are so sorry have a great night”",
            "score": 6,
            "replies": []
        },
        {
            "author": "MashedPotatoesDick",
            "body": "I was a seat filler for one segment of the William Shatner roast. I made sure to consume as much of the mixed nuts at the table as I could before I was sent back to the poors.",
            "score": 7,
            "replies": []
        },
        {
            "author": "JoeTodayJoeTomorrow",
            "body": "Ah Conan, what an amazing person. I remember walking out of work in Belfast to see him drinking outside a pub, chatting away to people passing by and sitting near him. He pretty much held court and got selfies with everyone who wanted one. Ps... he's so fucking tall.",
            "score": 7,
            "replies": []
        },
        {
            "author": "No_Bedroom_5906",
            "body": "Stop his little drawing of himself 🥺🥺🥺",
            "score": 18,
            "replies": []
        },
        {
            "author": "Garbagecan_on_fire",
            "body": "Conan has always been a class act.",
            "score": 11,
            "replies": []
        },
        {
            "author": "GhostRider85",
            "body": "Anyone else want to know what snacks were in the box?   OP let us know!",
            "score": 5,
            "replies": []
        },
        {
            "author": "GoodPeepsEverywhere",
            "body": "How come gummy bears are against the rules?",
            "score": 5,
            "replies": [
                {
                    "author": "archgen",
                    "body": "I don't think Disney wanted the seat fillers getting high for some reason, almost as if they had a job to do........",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImAlreadyTracerBoii",
            "body": "Conan’s a real one for trying the gummy lol",
            "score": 5,
            "replies": []
        },
        {
            "author": "Key-Spirit-6865",
            "body": "I was a seat filler for the Emmys about 25 years ago. I got to get dressed up and sit next to Laurence Fishburn, Gary Sinise and Jimmy Smits. I even made it on camera!",
            "score": 6,
            "replies": []
        },
        {
            "author": "duke_silver001",
            "body": "These were for everyone not just seat fillers. That’s why it says star/seat fillers. There have been multiple videos of people opening them at the Oscar’s to show what was inside. Still a nice gesture but everyone received one.",
            "score": 7,
            "replies": []
        },
        {
            "author": "SarcasticBench",
            "body": "Begs the question of what kind of gummy Disney said no to.",
            "score": 24,
            "replies": [
                {
                    "author": "ohnono5",
                    "body": "edibles probably",
                    "score": 76,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -8,
                            "replies": []
                        },
                        {
                            "author": "ekso69",
                            "body": "What",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "trwwypkmn",
                    "body": "thatsthejoke.jpg",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "throwaway12junk",
                    "body": "*Flintstone* gummies. Can't be featuring the competition.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Necronaad",
            "body": "The fact they hire people as seat fillers to make themselves seem more interesting is hilarious",
            "score": 3,
            "replies": []
        },
        {
            "author": "tiny_chaotic_evil",
            "body": "*i am guessing he means a \"gummy\" and not a gummy*",
            "score": 4,
            "replies": []
        },
        {
            "author": "stevemw",
            "body": "It was all the seats. Note \"Dear Star/Seat Filler\"",
            "score": 11,
            "replies": []
        },
        {
            "author": "N8ThaGr8",
            "body": "These were under every seat, the seat filler thing is just a joke.\n\nAlso there's no way Conan actually paid for these himself lol, they just added the note from him to personalize it. Oscars always have insane giveaways including a little snack box for each seat.",
            "score": 5,
            "replies": []
        },
        {
            "author": "iSteve",
            "body": "what is a seat filler?",
            "score": 3,
            "replies": [
                {
                    "author": "Most_Victory1661",
                    "body": " Celebrity leaves their seat to go idk use the bathroom or hit up the bar \n\nThe seat filler sits in their seat till they return so all of the seats are always full for broadcast \n\nThere’s an episode of Seinfeld that used this a gag",
                    "score": 3,
                    "replies": [
                        {
                            "author": "MacduffFifesNo1Thane",
                            "body": "And Kramer certainly had a Scarsdale Surprise!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thatBLACKDREADtho",
                    "body": "I'm not absolutely positive, but I'm going to guess it's somebody who fills in empty seats at events like this.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Ok_Acanthocephala101",
                    "body": "You can only get up and sit down at certain times with live award shows. Sit fillers sit in the seats while the regular attendee is up for a number of reasons, so the audience never has an empty seat show in a panned shot",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "habb",
            "body": "i was dumb enough just for a few seconds to think he handwrote this letter",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sure_Quality5354",
            "body": "Conan seems like one of the verry few in show business who is actually a good and genuine person through and through.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hollowsong",
            "body": "Seat fillers get to randomly sit next to a whole bunch of stars for free and watch the oscars? That sounds like a dream job",
            "score": 3,
            "replies": [
                {
                    "author": "drastic2",
                    "body": "While the normal celebrity in their seat goes to take a leak. I think most of them get to see the show for 5 mins then back to the seat filler holding area I imagine.  I suppose there might be a few no-show stars but I’m guessing not many.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Hollowsong",
                            "body": "Yeah but you get to fart in some cute celebrity's seat and make them sit in it for the rest of the show",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EnvironmentalMix421",
            "body": "There’s seat filler in Oscar? How do you apply? I tried to apply for his late night show but didn’t get picked. Then covid came and he quit",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sad_Description1269",
            "body": "These are under every seat for anyone in that seat to take. That's why it says star /seat filler.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Emergency-Acadia3731",
            "body": "What does he mean by, '...a gummy'?\nIs this a reference to a condom or something?\n*asking for a friend.",
            "score": 3,
            "replies": [
                {
                    "author": "drastic2",
                    "body": "I’m assuming a snack pack of THC infused gummy bears.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "nvmenotfound",
            "body": "Conan legit is one of the best human beings. ",
            "score": 3,
            "replies": [
                {
                    "author": "MartiniAfternoon",
                    "body": "100%. I’ve never heard anyone say a bad thing about the guy.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Savings_Platypus_237",
            "body": "Ooh, what were the snacks?",
            "score": 3,
            "replies": []
        },
        {
            "author": "CementCemetery",
            "body": "Love it. Conan was a great host. Anyone know how to actually be a seat filler? I assume being insanely hot / well dressed is a requirement.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Smidgeofamidge",
            "body": "I was a seat filler at the Emmy's a couple of times and all we did was get yelled at and humiliated. If only Conan was hosting!",
            "score": 3,
            "replies": []
        },
        {
            "author": "MacduffFifesNo1Thane",
            "body": "This was certainly a Scarsdale Surprise!",
            "score": 3,
            "replies": []
        },
        {
            "author": "The_Sum",
            "body": "Conan is the Mr. Rogers of Late Night. Always has been, always will be.",
            "score": 3,
            "replies": []
        },
        {
            "author": "crackeddryice",
            "body": "Just like every other Disney event one attends, the party needs to start before you get there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "thekamakaji",
            "body": "Judging by all of these comments, Conan is the anti-James Corden. I already had that impression but it's really nice to see all of these first hand accounts reaffirming it",
            "score": 3,
            "replies": []
        },
        {
            "author": "noto0403",
            "body": "Anyone else read it in Conan’s voice",
            "score": 3,
            "replies": []
        },
        {
            "author": "artappraiser123",
            "body": "how do you become a seat filler? where do i sign up?",
            "score": 5,
            "replies": []
        },
        {
            "author": "SoundHyp",
            "body": "Dude’s been in showbiz forever but still acts like a guy who just wants everyone to have a good time.",
            "score": 6,
            "replies": []
        },
        {
            "author": "SomeoneOne0",
            "body": "In a world of dispair and chaos, god gave us Conan O'Brian for hope.",
            "score": 2,
            "replies": []
        },
        {
            "author": "The_Squarejerker",
            "body": "Do seat fillers get to go to the after party?",
            "score": 2,
            "replies": [
                {
                    "author": "idkbitchlol",
                    "body": "Usually no",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "galaxyveined",
            "body": "The little doodle has such 11th Doctor vibes, I just can't unsee it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OperationFinal3194",
            "body": "Disney is the real oligarch.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pcerritos",
            "body": "What a class act!",
            "score": 2,
            "replies": []
        },
        {
            "author": "subhavoc42",
            "body": "Is he talking about a toothless blowjobs or THC here?",
            "score": 2,
            "replies": []
        },
        {
            "author": "seriousFelix",
            "body": "Just watched a movie that Conan had an outdoor store- he was the best part",
            "score": 2,
            "replies": []
        },
        {
            "author": "wynnduffyisking",
            "body": "Conan really seems to be s genuinely kind dude.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hashtagbarkeep",
            "body": "Dude is just hard wired to be good. He’s cheesy as hell but a great dude",
            "score": 2,
            "replies": []
        },
        {
            "author": "engineered_academic",
            "body": "One time I was in Georgetown for Halloween and going through the masses of people. All of a sudden I hear someone yell out \"holy shit it's Conan O'Brien!\" He was just trying to get to a house party or something, pushing through the crowd with his head down. He's a lot taller in person.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jenjikromi",
            "body": "Everybody loves Conan.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Efficient-Drama-4864",
            "body": "Can’t believe no one has mentioned his amazing hot ones appearance. By far my favorite all time episode.",
            "score": 2,
            "replies": [
                {
                    "author": "1029394756abc",
                    "body": "Have you seen murderville?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kiraslaps",
            "body": "so sweet!",
            "score": 2,
            "replies": []
        },
        {
            "author": "ItsNguyenzdaiMyDudes",
            "body": "Whats a seat filler?",
            "score": 2,
            "replies": [
                {
                    "author": "Queefer_Sutherland-",
                    "body": "When a celeb leaves their seat to go to the washroom, the bar etc, a seat filler sits in their chair so there are no empty seats when the camera cuts to the audience.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ItsNguyenzdaiMyDudes",
                            "body": "That's cool! Thanks for the explaination",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Queefer_Sutherland-",
                                    "body": "No problem 🙂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "weaponxx5",
            "body": " Conan is the fucking best!",
            "score": 2,
            "replies": []
        },
        {
            "author": "sombertownDS",
            "body": "Hes so real for the gummy bit",
            "score": 2,
            "replies": []
        },
        {
            "author": "things_U_choose_2_b",
            "body": "I've only been a Conan fan for about 18 months. His podcast is such a nice slice of joy and silliness, whether he's interviewing a celeb or a rando across the planet.\n\nSeeing stuff like this is really heartwarming, he's just a good dude through and through.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AKAlicious",
            "body": "So what was in the box? We need details. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "seires88",
            "body": "How does someone get hold of these “seat fillers”? You know , asking for a friend",
            "score": 2,
            "replies": []
        },
        {
            "author": "MrSlippifist",
            "body": "That is one of the coolest things to do.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tlewallen",
            "body": "I can't believe he's a barbarian",
            "score": 2,
            "replies": []
        },
        {
            "author": "candycdfl",
            "body": "I can see Kramer chowing down.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FrogstompLlama",
            "body": "Sit perfectly still. Only he may dance.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thefunkybrowngirl",
            "body": "As a former seat filler, this man is an absolute angel!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gundam14",
            "body": "This is why he's **The GOAT**.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RootyPooster",
            "body": "His HBO travel show is so good, can't wait for next season.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Oneoftheotherpeople",
            "body": "CoCo is a Bro Bro",
            "score": 2,
            "replies": []
        },
        {
            "author": "Glittery-Unicorn-69",
            "body": "He’s the best and this just gives further proof. Thank you for sharing!",
            "score": 2,
            "replies": []
        },
        {
            "author": "pomegranate99",
            "body": "He’s a class act.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Holiday-Tennis5195",
            "body": "Im so jelly. 🥹",
            "score": 2,
            "replies": []
        },
        {
            "author": "spanishpeanut",
            "body": "He’s a good egg. That’s very kind of him to do.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FlopShanoobie",
            "body": "Never heard a negative thing about the man.",
            "score": 2,
            "replies": [
                {
                    "author": "MrBuckanovsky",
                    "body": "He conducted interviews in Quebec City during the winter carnival. Mocked people who barely speak English in the most French-speaking province in Canada. It was rude.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhatsUpSteve",
            "body": "Dude is awesome, unless you're Jordan Schlansky. He'll just shit all over you.",
            "score": 2,
            "replies": [
                {
                    "author": "gastroboi",
                    "body": "Lets be honest. Jordan deserves everything Conan serves him lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "New_Safe_2097",
            "body": "Conan is the best",
            "score": 2,
            "replies": []
        },
        {
            "author": "Istariel",
            "body": "conan seems like a genuienly nice and awesome guy. i know its thats just my public perspective of him but i dont think ive ever seen anything negative about him, compared to other late night tv hosts he is imo just on another level",
            "score": 2,
            "replies": []
        },
        {
            "author": "chang3la",
            "body": "What’s in the box?!",
            "score": 2,
            "replies": []
        },
        {
            "author": "6randcru",
            "body": "Every seat gets a box of snacks. Every seat. Every year. The box is decorated with one of the best picture nominees and placed under the seats.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Happy-Tiger7",
            "body": "What's a seat filler? How do I become one??",
            "score": 2,
            "replies": []
        },
        {
            "author": "Akitten84",
            "body": "Hahaha a gummy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Acceptable-Law-7598",
            "body": "Conan have big penis energy",
            "score": 3,
            "replies": [
                {
                    "author": "ThisEnormousWoman",
                    "body": "He's got ace energy",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "REV2939",
            "body": "What brand pretzels are those and what is that beverage?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Great-Bumblebee5143",
            "body": "Seat filler?",
            "score": 1,
            "replies": [
                {
                    "author": "dabe1971",
                    "body": "> Seat filler\n\nEssentially extras who sit in the seats of the \"stars\" when they are up on stage, receiving awards, involved in the production, unable to attend at the last minute or just answering a call of nature. The Academy doesn't want the world to see empty seats.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "lauryng210",
            "body": "I love him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Erick_L",
            "body": "Kramer got them all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rugbydoggo",
            "body": "Sit perfectly still, only I may dance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SheepherderQuick8338",
            "body": "Conan is the best. Have been a Day 1 fan. Happy that he keeps bringing joy to people",
            "score": 1,
            "replies": []
        },
        {
            "author": "ManicZombieMan",
            "body": "I just love Conan. He’s one of my favorite people. He’s funny and there’s no escaping he’s just a nice person.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BionicTriforce",
            "body": "Maybe the cameras just know never to show it but I've always noticed how I never see any of the people at the Oscars eating or drinking anything in the seats. I can't go a movie without wanting a drink or a snack and the ceremony pushes into normal dinner hours for most, so they HAVE to be getting hungry. There must be plenty of people sipping bottles of water or snacking on peanuts but it's all kept for commercial breaks.",
            "score": 1,
            "replies": [
                {
                    "author": "Rubberbandballgirl",
                    "body": "I remember one year the camera caught Danny Devito eating carrots or celery and not too long after Steven Martin (the host) had a bit where he brought some dressing to go with his food. ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Science_Matters_100",
            "body": "This is awesome!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElPulpoTX",
            "body": "\"Gummi\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "HammerSmashedHeretic",
            "body": "What is a seat filler",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mish-onimpossible",
            "body": "So was that a bit with Conan and Adam Sandler?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Boffleslop",
            "body": "Oliver Stoned",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shadow_Edgehog27",
            "body": "Conan is so cool man",
            "score": 1,
            "replies": []
        },
        {
            "author": "Such_Comfortable271",
            "body": "one box for all the seat fillers",
            "score": 1,
            "replies": []
        },
        {
            "author": "SweeterGrass",
            "body": "You just know that's gonna become a bit. imma try real hard to be a filler for next year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Omby07",
            "body": "This makes me happy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jakdracula",
            "body": "Seat fillers?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thomah1337",
            "body": "What are seat fillers",
            "score": 1,
            "replies": [
                {
                    "author": "FremulonPandaFace",
                    "body": "People who fill seats...\n\nSorry haha, but you can sign up to be a seat filler and generally they are chosen when people either had tickets and can't make it or sometimes when the place isn't sold out so that when they show the audience there aren't any gaps. Hope that helps. :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Thomah1337",
                            "body": "Yeah i figured but i didnt know randoms could go to these kind of shows as well. Til thanks",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ToothZealousideal297",
            "body": "I watched that “Conan O’Brien Can’t Stop” documentary thing several years ago, and they mentioned someone came up and told him he met their friend and was rude to the friend… his response was “that’s impossible.”  Based on everything I have ever heard about him, I’m inclined to believe him over some random person’s friend.  I can’t think of any other case where I would believe the celebrity claiming they’re nice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pixzal",
            "body": "i see he didn't get lawyered up for disney...",
            "score": 1,
            "replies": []
        },
        {
            "author": "gentledjinn",
            "body": "That’s classy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_Film1332",
            "body": "I can feel the love and care in a simple way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pmw1981",
            "body": "We finally found our fourth for the Mount Rushmore of Wholesomeness\n\nBob Ross, Fred Rogers, Conan O'Brien, Keanu Reeves",
            "score": 1,
            "replies": []
        },
        {
            "author": "Twar121",
            "body": "So happy to see Conan make a full come back!! He deserves it all",
            "score": 1,
            "replies": []
        },
        {
            "author": "shadiprang",
            "body": "Conan is the best. When I was in college working at a gas station right off the highway him and his wife came in at ~10pm. He was the nicest, most affable person ever. He took a picture with me and held up a jimmy neutron candy bar and said “Doesn’t this look just like me?!!” And held it side by side with his face, it was hilarious and I’ve loved him ever since.",
            "score": 1,
            "replies": []
        },
        {
            "author": "horrormetal",
            "body": "I love Conan sfm",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Customers",
            "body": "That little cartoon of him is so cute!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Formal_List_4921",
            "body": "My nephew attends Yale and both of his children do as well.  Very sweet family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OptimalDonkey7428",
            "body": "How did you become a filler???",
            "score": 1,
            "replies": []
        },
        {
            "author": "Funny-Record-5785",
            "body": "He is a solid dude",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mockturtle22",
            "body": "Conan O'Brien is the fucking best us Die Hard team coco fans have always known this",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Perspective1099",
            "body": "Class act!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medium-Host1072",
            "body": "thats class",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Crow",
            "body": "English isn't my first language.  I'm guessing \"hard pass\" means.... something else? 😄",
            "score": 1,
            "replies": [
                {
                    "author": "jennygotcake",
                    "body": "It’s like a solid no",
                    "score": 3,
                    "replies": [
                        {
                            "author": "The_Crow",
                            "body": "It being in quotes makes me think there's another humorous layer of \"hard pass\" that I'm missing...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zephenthegreat",
            "body": "Wait, people get paid to fill seats at the oscars?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mymousu",
            "body": "I love Conan so much 😭😭😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "redditsuckz99",
            "body": "Always loved conan since i was a kid",
            "score": 1,
            "replies": []
        },
        {
            "author": "Last_Acadia_9073",
            "body": "Where can I get a seat for the Oscars",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnortsSpice",
            "body": "I bet Conan gives great hugs",
            "score": 1,
            "replies": []
        },
        {
            "author": "woyuan4154",
            "body": "what a nice guy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ptran90",
            "body": "So cool!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "afraidofrs",
            "body": "I was literally rewatching my fav clips of his show on YouTube yesterday! The ones with Steven Yeun never fails to crack me up",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArmyofNugz",
            "body": "What’s in the box?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "NewtOk4840",
            "body": "I'm so curious what's in there lol I would save it all",
            "score": 1,
            "replies": []
        },
        {
            "author": "flargenhargen",
            "body": "how do they get them,  like if someone goes up for an award and a seat filler comes to fill their seat and eats their snacks,  they would be sad and maybe just keep talking even after the music comes up and they had nothing to say.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoBullet",
            "body": "its for everyone. seat fillers arent predetermined",
            "score": 1,
            "replies": []
        },
        {
            "author": "runonandonandonanon",
            "body": "That Disney exec was like dude you can't go around rubbing your finger around in every guest's mouth. It's unsanitary and it would take forever.",
            "score": -1,
            "replies": []
        },
        {
            "author": "fin343",
            "body": "Fuck the Oscar’s who cares",
            "score": 0,
            "replies": []
        },
        {
            "author": "Charming-Gene-7291",
            "body": "Why no gummies?  Candy or THC?  Why did Disney have to approve?",
            "score": -1,
            "replies": []
        },
        {
            "author": "Catweaving",
            "body": "They own ABC.  So they're the final say on everything at the Oscars.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Springtime912",
            "body": "Wait- I was at his show and had to give up my seat for a bit. An actor took my place as an audience member to ask a question - I got nothing (and their question was edited out.) 🙃",
            "score": 0,
            "replies": []
        },
        {
            "author": "MagicEhBall",
            "body": "What's a seat filler?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Interestingcathouse",
            "body": "Oh wow, cheap snacks.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Curleysound",
            "body": "Also, and not to take anything away from Conan, but at most he approved what the snacks were. This is a standard thing with branding attached.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SilverRoseBlade",
            "body": "That’s nice of him. Though as someone like myself who hates pretzels and raisins… not sure I’d eat any of the food.",
            "score": -5,
            "replies": []
        },
        {
            "author": "PretentiousMouthfeel",
            "body": "What. We have no idea what's in it...",
            "score": 1,
            "replies": []
        },
        {
            "author": "SilverRoseBlade",
            "body": "They showed a video on E! Social media. Its a water bottle, mustard, pretzel and a box of raisinettes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adorable-Bus-6860",
            "body": "That’s cool. How much has he given to California fire victims? North Carolina and Florida flood victims?  Hawaii fire victims? Ukraine? He’s very pro war… he should have sent this money directly to Ukraine. \n\nThe fact any of you all watch these hypocrites award each other is honestly sickening.",
            "score": -6,
            "replies": []
        }
    ]
}