{
    "title": "Back in 2020, Thomas Cook of Wisconsin split his Powerball jackpot winnings with his best friend, honoring a promise they made to each other in 1992 declaring if either of them ever won, they’d share the earnings with the other.",
    "author": "Recreant793",
    "subreddit": "MadeMeSmile",
    "rank": 34,
    "score": 5834,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 49,
    "url": "https://i.redd.it/9hic3f77vqme1.jpeg",
    "id": "1j3mphg",
    "selftext": "",
    "comments": [
        {
            "author": "Doodlebug510",
            "body": "24 July 2020\n\nAlmost 30 years ago, two Wisconsin friends made a handshake deal: If either won the lottery, they’d split the jackpot:\n\n>Last month, Tom Cook called Joe Feeney with the good news.\n\n>“Are you jerking my bobber?” Feeney demanded.\n\n>Cook was not. He had won — they had won — a $22 million Powerball prize in the June 10 drawing.\n\n>Later that month, Cook and Feeney showed up at the Wisconsin Lottery office to pose with the big check and talk about their plans.\n\n>Cook, of Elk Mound, and Joe, of Menomonie, have remained close over the decades, even taking road trips together with their wives.\n \n>For upcoming trips, they say, they will upgrade from the PT Cruiser convertible they’ve been riding in.\n\n>Upon learning of the win, Cook retired from his job. Feeney had already taken retirement from the fire department.\n\n>Choosing the cash option, about $16.7 million, the men each took home about $5.7 million after federal and state taxes.\n\n>The men have played Powerball since its introduction in 1992, and they made their pact that year.\n\n>Cook’s ticket, bought at a Menomonie gas station, was the first Powerball jackpot winner sold in Wisconsin since March 2019, when a 24-year-old man from suburban Milwaukee won $768.4 million, the third-largest jackpot in U.S. history. \n\n>Wisconsin does not allow players to claim their prizes anonymously.\n\n[Source](https://www.mercurynews.com/2020/07/24/longtime-friends-powerball-pledge-big-win-after-almost-30-years/)",
            "score": 325,
            "replies": [
                {
                    "author": "Hohh20",
                    "body": "22 million and they went home each with a quarter of that. The government wins the lottery without even having to do anything.",
                    "score": 268,
                    "replies": [
                        {
                            "author": "GuyWithoutAHat",
                            "body": "The 22 million is just if you take the annuity. The instant cash option is always much less, usually about half, 16.7 million is pretty lucky. So that's 5.3 million to the powerball and just about 40% tax.",
                            "score": 110,
                            "replies": [
                                {
                                    "author": "speedingpullet",
                                    "body": "Its still 5.3 million bucks each, I wouldn't sneeze at it personally 😁",
                                    "score": 91,
                                    "replies": [
                                        {
                                            "author": "Pormock",
                                            "body": "Except now they are constantly harassed by friend, family and strangers trying to get them to give them money",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "two4gone",
                                    "body": "If you choose the annuity, does the remaining balance go to your beneficiaries when you pass?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Washpedantic",
                                            "body": "Yes,  But they get a lump sum.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "willfish4fun",
                                            "body": "Usually not.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "snacktopotamus",
                            "body": "\"Oh no, I only got $5 million\"",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "Altruistic-Cat-7531",
                            "body": "You don’t win 22 million today. It’s a 22 million annuity paid out over 30 years.  Converting to the single pay option changes the time value of money.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "SirRabbott",
                            "body": "The house always wins",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "ITHETRUESTREPAIRMAN",
                            "body": "Well, they split it. Hahaha so, it’s half. And yeah, the government runs the lotto to make revenue.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "okram2k",
                            "body": "it's always been a tax on people that aren't very good at statistics.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "recursion0112358",
                    "body": "Narrator: \"Cook was not, in fact, jerking Feeney's bobber.\"",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Doodlebug510",
                            "body": "Lol I love it 😂",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "arcmart",
            "body": "“All I have in this world is my word and my balls and I don’t break ‘em for no one.”",
            "score": 709,
            "replies": [
                {
                    "author": "Ibangyoumomma",
                    "body": "I always tell the cashier that if I win, I’ll get them their dream car as long as it’s realistic and a good pay day for them….. if I won I would for sure do that  and like 25-50k",
                    "score": 137,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "Ibangyoumomma",
                                    "body": "For sure, but the extra 25-50k is for them on top of the car. Can’t drive a nice car if you can’t afford insurance and all that.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "SouthCompetitive3701",
                                            "body": "For someone who bangs other people’s moms - you’re very thoughtful",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cmcdevitt11",
                            "body": "I tell the cashier's the same thing. And God I think I would get more enjoyment out of giving them the money then me getting the money. I would love to see their face",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SoulStretch",
                    "body": "Word is bond",
                    "score": 8,
                    "replies": [
                        {
                            "author": "WolfghengisKhan",
                            "body": "I can't read this without thinking of a mystic with teurets living in LA and uses a mechanical voice box.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SoulStretch",
                                    "body": "I was more thinking Nas but that too 😂",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rara2591",
            "body": "My mind was waiting for the \"and then he killed him\" but then I saw what sub we were in and immediately felt better 😂",
            "score": 63,
            "replies": []
        },
        {
            "author": "Important-Bridge9416",
            "body": "are they still friends up to now ?",
            "score": 26,
            "replies": [
                {
                    "author": "LetsBeNaughtyPlz",
                    "body": "They got married",
                    "score": 15,
                    "replies": [
                        {
                            "author": "TheLittleGinge",
                            "body": "I too would marry my bro if he gave me $11 million.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Important-Bridge9416",
                                    "body": "same thoughts lol",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Important-Bridge9416",
                            "body": "HAHAHAHA",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "valdezlopez",
            "body": "I bet I can tell who's who.",
            "score": 20,
            "replies": [
                {
                    "author": "spyrenx",
                    "body": "You'd probably be correct.  The guy on the left, plaid shirt, won.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "WhichWitchyWit",
                            "body": "The other guy won twice - once with the lottery and once bc he had a friend who kept his word and split it!",
                            "score": 17,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "liluzimee",
            "body": "Now thats a real friend",
            "score": 14,
            "replies": []
        },
        {
            "author": "SnugglePetals",
            "body": "Now this is something else, keeping a promise like that and making it happen. This is brotherhood right here! Amazing friendship 💪",
            "score": 9,
            "replies": []
        },
        {
            "author": "Time-Lead6450",
            "body": "True Friendship right here...   don't be hating.....",
            "score": 8,
            "replies": []
        },
        {
            "author": "LunaRoseDream",
            "body": "True friend worth much more than any possession.",
            "score": 6,
            "replies": []
        },
        {
            "author": "RR_Davidson",
            "body": "Looks up the definition of “a real one”",
            "score": 5,
            "replies": []
        },
        {
            "author": "SilentPugz",
            "body": "I’m guessing the one in blue is the friend .",
            "score": 6,
            "replies": [
                {
                    "author": "Emily5099",
                    "body": "I thought the same. Bloke looks like he can’t believe his luck.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Czar_Cophagus",
            "body": "Am I the only one bothered by the ampersand depiction?\n\nHonestly, kudos to them honoring their agreement. That's a true friendship.",
            "score": 5,
            "replies": []
        },
        {
            "author": "PirateSanta_1",
            "body": "Best way to do it. Being the only rich guy in your friend group would suck. They either end up depending on you to finance all the cool shit (the Elon problem and one of the reasons he has no friends) or they all have to be at work while your at home.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Civil_Broccoli7675",
            "body": "Bro showed true Bromanship",
            "score": 2,
            "replies": []
        },
        {
            "author": "Actual_Insect_2147",
            "body": "That's such an incredible story of friendship and loyalty!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lucky-Pomegranate-13",
            "body": "Sending this to my friends",
            "score": 2,
            "replies": []
        },
        {
            "author": "odin_the_wiggler",
            "body": "That's a real bro",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "LobsterNo3435",
            "body": "Good to have a true friend. And y'all can kick it up a notch and have more fun!",
            "score": 1,
            "replies": []
        },
        {
            "author": "L0st_MySocks",
            "body": "after taxes they receive like close to 18 million dollars? so 9 million dollars each",
            "score": 1,
            "replies": []
        }
    ]
}