{
    "title": "White House Readout Of Trump-Putin Call",
    "author": "theboss2461",
    "subreddit": "Conservative",
    "rank": 10,
    "score": 735,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 386,
    "url": "https://i.redd.it/cl3a9yw0lhpe1.png",
    "id": "1jeb5na",
    "selftext": "",
    "comments": [
        {
            "author": "coldnorthwz",
            "body": "It's interesting that the initial ceasefire (energy and then maritime) are in areas that Ukraine has been having major successes over the course of the war, including very recently.\n\nUkraine agreed to a full, 30 day unconditional ceasefire as Trump wanted. If Putin doesn't, and tries to stop all the ways Ukraine pressures it, then it's past time to apply pressure to Putin. He clearly just wants the pressure off in the areas that humiliate his military, and a full ceasefire or peace aren't his intentions.",
            "score": 604,
            "replies": [
                {
                    "author": "OddlyShapedGinger",
                    "body": "Energy and infrastructure are also spaces that Russia actively doesn't want to target.  \n  \nIf Russia's goal is the annexation and absorption of Ukraine, any power plants that they destroy, roads they tear up, bridges they bomb, etc. are all things that will (eventually) need to be rebuilt if Putin wants people actually living in the spaces rather than just making a No Man's Land of destruction.\n\nGetting Putin to the table is still a victory, but Russia doesn't really sacrifice much of anything by coming to the table here.",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "OldWarrior",
                    "body": "We are already putting pressure on Putin through arming Ukraine and economic sanctions.  The point now is to get everyone to the table.  Once everyone is at the table, there will be momentum for a peace deal and more room to address tougher sticking points.\n\nEdit. The warmongers love to downvote anyone suggesting peace overtures because they have romanticized this conflict and are happy to see faceless Eastern Europeans die so long as they can keep up the delusion that Putin will be owned.",
                    "score": -16,
                    "replies": [
                        {
                            "author": "Outside_Ad_3888",
                            "body": "That does though need for all at the negotiating table, including Putin to aspire to negotiate. It's still a good plan, as long as we in the meantime strengthen and don't weaken Ukraines and therefore our negotiating position. \n\nAlso there is a lot more pressure that Europe and US could put, both through weapons shipments and expanded dual technology sanctions.  \nOne way could be to keep US aid level at the normal level but in exchange ask EU to contribute more then that, EU has been ramping both spending and production recently so it's quite possible they could achieve this. This way we would obtain more pressure without changing the pressure the US has already been exerting since the start of the war.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tim310rd",
                    "body": "I'm not sure how he's been humiliated considering the collapse of Kursk and the manpower shortage Ukraine is facing. Putin's interest is in a permanent ceasefire because he doesn't want to give Ukraine 30 days to potentially rearm while he has the advantage.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tiktaalik414",
            "body": "I don’t think Putin‘s definition of “need for peace” involves an actual agreeable peace resolution as much as it likely involves the effective surrender and demilitarization of Ukraine as well as reassurances against NATO.",
            "score": 546,
            "replies": [
                {
                    "author": "PFirefly",
                    "body": "Considering the history of the region, that would make sense from a Russian perspective. The middle east is always banging on about Israel being an illegitimate country, why wouldn't Ukraine be the same if we look at historic territory?",
                    "score": -91,
                    "replies": [
                        {
                            "author": "Outside_Ad_3888",
                            "body": "What..? Because Ukraine is a nation recognized by everyone including Russia and does not share a space with Russia or russian people? \n\nWhat's your reasoning? Maybe i am missing something?",
                            "score": 123,
                            "replies": [
                                {
                                    "author": "PFirefly",
                                    "body": "The areas that Russia have occupied, historically belonged to Russia. At least that was my understanding. Ukraine's current borders are a post ussr invention.",
                                    "score": -45,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "The_Asian_Viper",
                            "body": "Because both Israel and Ukraine are legitimate countries. The fact that land x was one part of country y doesn't mean country y has rights to it for eternity.",
                            "score": 53,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rancesj1988",
            "body": "That all sounds great but actions speak louder then words.",
            "score": 525,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Rancesj1988",
                            "body": "It is but I still don't trust Vladimir Putin.",
                            "score": 268,
                            "replies": [
                                {
                                    "author": "ObadiahtheSlim",
                                    "body": "He's violated every single agreement with Ukraine.  He can't be trusted to keep this one.",
                                    "score": 254,
                                    "replies": [
                                        {
                                            "author": "chillthrowaways",
                                            "body": "What else can we do.  Seriously, what would you like to see done here?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Outside_Ad_3888",
                                                    "body": "We could have/could follow the Estonian plan for military aid. Better even if don through seizing Russian assets. It was done by the Estonian Defense department as a plan for what would be needed for a complete Ukrainian victory in 2024. Safe to say the steps needed for that were never taken and now doing that plan would likely not bring Ukraine to Crimea, but it would definitely improve their situation to a point where they are negotiating not to lose everything. Too pricey? let's seize the Russian assets to pay it. \n\n[https://kaitseministeerium.ee/en/setting-transatlantic-defence-success-military-strategy-ukraines-victory-and-russias-defeat](https://kaitseministeerium.ee/en/setting-transatlantic-defence-success-military-strategy-ukraines-victory-and-russias-defeat)",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "chillthrowaways",
                                                            "body": "Let me ask you this- would it be prudent to at least try and get a cease fire and see where negotiations go before doing all that?",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "tim310rd",
                                            "body": "Which specific agreements plural? Best I understand Ukraine had agreements with the separatists and their leaders that were to be enforced by Russia, and Zelenskyy's own former chief of staff as said that Ukraine stabbed Russia in the back in the context of Minsk 2, which the Russians honored (in his words).",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ObadiahtheSlim",
                                                    "body": "And before that, there was the Budapest Memorandum where Russia recognized Ukraine's borders and sovereignty and Ukraine would give up it's soviet nukes. There was also the Russian–Ukrainian Friendship Treaty which had provisions to respect the territorial integrity of each other.  Both of those agreements were flagrantly violated by Russia when it annexed Crimea and sent irregulars into the Donbas.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "tim310rd",
                                                            "body": "That's a mischaracterization of the Budapest Memorandum. Ukraine, from its first moments of independence, was adamant about not being a nuclear state, and immediately ceded all control over any Soviet nuclear weapons in the country over to the CIS. The Budapest Memorandum included provisions for the removal of the nukes from Ukraine, but this was not done in exchange for \"security guarantees\". Let's not pretend Russia's annexation of Crimea was a random and unprovoked attack and not a reaction to the Maidan revolution and their attempt to break a prior agreement that granted Russia's military access to the Crimean peninsula and Crimea. The US still hasn't abandoned their base in Cuba, the Russians weren't going to leave Crimea.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "shocky32",
                                            "body": "So should we not try?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "sailedtoclosetodasun",
                                            "body": "Ah, so I guess we should just keep pushing Russia into the corner until the nukes fly?  Why tf do you all see so black and white on this issue.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "Outside_Ad_3888",
                                                    "body": "Nukes will only fly if Russia itself as a country is threatened. Not being able to invade your neighbours every decade is not being threatened is stopping a dangerous expansionist country who has done nothing but attempt to ruin the US.",
                                                    "score": 28,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "theboss2461",
                                            "body": "He isn't physically capable of violating a new agreement. Russia is currently on the brink of collapse.\n\nEdit: I'm not suggesting Putin is trustworthy, he isn't. If able, he absolutely would violate a new agreement. My point is that he isn't able.",
                                            "score": -53,
                                            "replies": [
                                                {
                                                    "author": "Bag_Lady75",
                                                    "body": "Agree..he went way over his head on this one. He’s had yes men around him for decades. I don’t think he had any idea the level of dysfunction in his own military. Between military leadership, issues with logistics, blatant corruption leading to faulty and unusable equipment etc. Putin needs an off ramp and Trump is giving him just that. He’s lost over 700,000 young men. Russia is in bad shape. I think Trump is playing this right. Anyone who thinks Putin holds the cards is laughable. Trump and Hegseth both know a failed Russian state would be catastrophic to the world. As bad as Putin is, there’s worse waiting in the wings. An unstable Russia with thousands of nukes would be a very scary world.",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "author": "theboss2461",
                                                            "body": "I think the best play would be to return all land seized by Russia to Ukraine, Putin and his yes men all step down, and we establish friendly relationships with the new leadership. Putin is in no position to gain anything, and if he doesn't want his entire country to collapse then this is his best opinion.",
                                                            "score": 23,
                                                            "replies": [
                                                                {
                                                                    "author": "Kaireis",
                                                                    "body": "That would be best, yes... but that is not at all a realistic goal for even the most successful negotiation.",
                                                                    "score": 28,
                                                                    "replies": [
                                                                        {
                                                                            "author": "theboss2461",
                                                                            "body": "With the current state Russia is in, it's not impossible.",
                                                                            "score": -8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Kaireis",
                                                                                    "body": "That's kind of like trying to plea bargain with a defendant to accept the death penalty.\n\nYeah the suspect might be 100% guilty and deserve the death penalty, but he's never going to agree to it in a plea. There's nothing for him to lose by going to trial.",
                                                                                    "score": 18,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "theboss2461",
                                                                                            "body": "I never said he wasn't gonna try to avoid it. He will still try other tactics, but none of them will hold up.",
                                                                                            "score": -1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Kaireis",
                                                                                                    "body": "Is it your honest, sober, genuine assessment of what a realistic ultra high stakes peace negotiation looks like, or is it your best hopes?",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Outside_Ad_3888",
                                                    "body": "Now? Yes. If sanctions are liftend in 4 years? That's a completly different story. It's true, Russian economy could deteriorate post war to a level that isn't a threat, but that's a pretty big assumption. Ukraine already gambled two times on that, they won't trust the life of their children on Russia being too weak or suddenly discovering reason. \n\nalso the downvotes are unwarranted, you stated your opinion, no reason to crucify someone for that.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "timurklc",
                                                    "body": "Kind of sad many forget good relationship with Russia.\n\nYou guys do realize that peace agreement in Ankara only requested one thing and thats no NATO in Ukraine.\nThat was when Russia surrounded Kyiv.\n\nWhat happened? \n\nBoris and Zelensky told Putin that it's not acceptable to hold peace discussions with a gun pointed at Ukraine. And he should remove his military from Ukraine to finalize peace.\n\nHe retreated to Russian border. Once he did, they refused peace agreement and pushed NATO in Ukraine.\n\nPutin is a huge fool for falling for this trap.\n\nMuch less blood would've spilt if he didn't.\n\nAlso no one can explain to me as of why Russian language is banned for many years now in Ukraine, so-called free and democratic country.\n\nNo one can explain the videos from Donbas from many years ago before war, where residents were killed for holding ceremonies and protesting.\n\nKids were killed. How can you not see that? Even if it's a Nazi children, which they were not, they were Ukrainian/Russian children, that were killed.\n\nYou guys say that Russia killed people in DPR. \n\nThen why, explain me why, did DPR still wanted to join Russia or have autonomy? \n\nI'm just saddened by the amount of hatred people have. \n\nNeither leader is an angel, trust me, not Putin and not Zelensky. But how you can be so blind?\n\nI went to Donbas, I did drive through the border during the war where I met all these people from Ukraine and from DPR, who told horrific stories to me.\n\nYou are saying that it's complete fault of Russia, somehow they're the evil in this world. Do you guys not realize that has zero benefit to be a villain in this current world? \n\nPutin is not a madman, he'd be long dead or gone if he was.\n\nRussia didnt ban Ukrainian language.\n\nThey didnt cut electricity and water to any region because they supported Ukraine. \n\nIt's basic knowledge that neither Crimea, or DPR had access to water or electricity, long before Russia intervened in these regions.\n\nYou can't just blame Russia without knowing why they did what they did. Well, you can and you do. But you shoudn't. \n\nBut whatever. Downvote. Tell me I'm heartless or villain, or Russian bot, Maga bot. Whatever.\n\nI'm still very sad for children in Russia and in Ukraine. They did NOT deserve to die, this war could've been prevented if NATO didnt decide to put missiles so close to Russian border.\n\nJust like Cuba missile crisis, it could been prevented if NATO backed down, like Russia backed down from Cuba.\n\nShow some decency instead of hate. As Turkish person that speaks Russian, I get all kinds of hate for saying I speak Russian. But I never hated or have hate towards any kind of civillian, language or culture.\n\nWhy do you? \n\nIs that how it was during Nazi regime? You hated Jews and their language like this? You banned it? I dont know, but it is not right.\n\nIt's not right to have this much hate, it's not right to hate any language, culture or population. You can hate Putin, he is the person that is supposed to bear the consequences of the hard decisions, you can hate him.",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "Outside_Ad_3888",
                                                            "body": "Ok there are several ahistoric claims in this comment. \n\n1 When Russia negotiated at Ankara they had long retreated from Kiev and they were in quite a weak position, that's when they tend to negotiate.   \nSecondly \"only\" asking Ukraine to not join NATO without any security guarantees is essentially a guarantee for a third Russian invasion. Ukraine tried that. IN 1991 with the memorandum Budapest, it gave away nukes in exchange for promises from Russia, US, France and UK to guarantee it's sovereignity, it failed miserably in 2014. \n\nIn 2014 Ukraine made the Minsk agreement that should have avoided continuation of Russian invasion. Russia invaded nontheless. \n\nThey can't put the lives of their children in the strategy that failed two times before. \n\nThird no where the hell did you think or see or believe that Russia retreated to it's borders? Not once did it make a single step in retreat that wasnìt forced by Ukrainian forces. \n\nFourth THe DPR didn't want to join Russia, or at least you don't usually send tanks and the military to convince people to join you. \n\nAlso all civilian deaths from crossfire in Donbass were 3400 (amnesty data) Russian invasion we are at least 15k plus and counting. \n\nUkraine also didn't ban Russian language, but it did force Ukrainian as the state language, which kind of happens when they invade you with the pathetic excuse that you are speaking their language. \n\nI don't blame Russia not knowing what they did, i know what they did, i saw proof, evidence and documents both Russian and non that detailed the armies crimes. And no i don' thate Russian language or culture, beautiful literature and decent music, but that's not the problem. The problem is their invasion now. Because with all their good literature they are attempting to destroy another culture and especially threaten the US rule based order.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "day25",
                                            "body": "[False](https://x.com/Glenn_Diesen/status/1901870229170364592)",
                                            "score": -11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Single-Stop6768",
                                    "body": "There is no trusts in geopolitics. It's always about creating an incentive structure that makes it more beneficial to keep to agreements than it is to break or undermine them.",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "cplusequals",
                                            "body": "Ukraine trusted Clinton and then Obama and Biden sat on their hands while they were invaded. This is why the minerals deal is so important in this round of talks. It puts US skin in the game so it actually hurts us to sit and do nothing.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Outside_Ad_3888",
                                                    "body": "It's a good deal, but US already has skin in the game right now. Less regarding economic ties as much as crucial global security ties, it won't be enough to be considered a security guarantee, for that either a written guarantee or the US sending troops with Europe in Ukraine after a ceasefire would be needed.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "cplusequals",
                                                            "body": "Apparently not enough skin or Biden would have stepped in. Written guarantees aren't enough, clearly.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Single-Stop6768",
                                                    "body": "A good lesson about thinking trust has any place in geopolitical negotiations.\n\n\nFrankly I trust Putin to act in what he thinks is in the best interest of the nation he runs regardless of any agreement and I would I can trust Trump and future American presidents to do the same. Which is why I agree the minerals deal would've been good for Ukraine but I think at this point what would be best for everyone is for the U.S and Russia to come to an agreement for positive future relations that has an incentive structure set up in a way where if 1 benefits the other does and if 1 crosses the other it is more harmful to the 1 in breach of the agreement. Particularly in regards to China. And it seems based on what's reported of the call we have common ground regarding the ME",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Sregor_Nevets",
                                                    "body": "Russia trusted Nato wouldn’t move further east.   Everybody has something to point to. \n\nPutin = bad man is entirely too simplistic to allow for any functional arrangement for peace.",
                                                    "score": -5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Outside_Ad_3888",
                                    "body": "You shouldn't. If you look at  the Russian page of the same press release the russian version will include conditions for a ceasefire that are simply absurd such as stopping aid to Ukraine, stopping intelligence to Ukraine and Ukraine stopping recruiting troops all this while Russia can do this and break the ceasefire when Ukraine is weaker. It could very well be posturing, but it's a bad sign.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Shadeylark",
                                    "body": "Ok, nobody said we have to trust him.\n\nEven if he isn't going into this in good faith, that doesn't give us an excuse to go into it in bad faith... Otherwise it's not just Putin making a mockery of the peace process, it's both Putin and us turning it into a charade.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "slippery_55jack",
            "body": "After reading this, all I can think about is the two spaces between the words peace and has in the last sentence. I wonder what the rough draft said.\n\nIn all seriousness, this deal is looking to be a loser for Ukraine. I wonder what concessions, if any, will be made by Russia in their demands.",
            "score": 329,
            "replies": [
                {
                    "author": "sanesociopath",
                    "body": "Once you pointed this out I was looking for them and it happens a few times, that is just the one that most looks like something could've been removed",
                    "score": 53,
                    "replies": []
                },
                {
                    "author": "slagathor_zimblebob",
                    "body": "You can’t expect the side that can draw out this war and finish it to make more concessions than the side that would fight to the death and lose their entire country. It sucks, it’s not right, but it is reality. \n\nThat being said, the US can do major damage to Russia by ratcheting up sanctions. The country is already in a lot of trouble. I don’t know why you expect Russia to get every one of their conditions met. \n\nUnfortunately the EU could also help draw concessions, but they have paid Russia so much for natural gas that they are totally worthless in negotiation.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "slippery_55jack",
                            "body": "I’m interested to understand what I said that indicates to you 1) I expect Russia to make more concessions than Ukraine, and 2) I expect Russia to have all of their conditions met? These are seemingly contradictory positions.\n\nTypically, in negotiations, both sides will make some concessions to get a deal done. My comment, which I believe to be relatively neutral, was simply questioning whether or not Russia is willing to make concessions.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "slagathor_zimblebob",
                                    "body": "Well, you said it was a loser for Ukraine.\n\nWe don’t know what negotiations will look like in their final form, but there will probably be more losses for Ukraine than Russia. I think stopping the killing will be the most important win. \n\nI just don’t get it when people mention Ukraine will lose land as if there’s anything President Trump could do about it other than send American troops to fight and die.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "slippery_55jack",
                                            "body": "Losing land would be a loss for Ukraine, no? I guess I’m unsure on where the disagreement lies between you and I",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "slagathor_zimblebob",
                                                    "body": "They’ve already lost the land. They don’t have the ability to get it back anymore either without heavy US intervention. \n\nSo yeah, it’s a loss, but stopping the killing could be a net win. There’s no situation where Ukraine “wins” this because they don’t have the manpower. It’s just the sad reality. They will need to accept a “losing” deal, wouldn’t you say? \n\nOtherwise what is the alternative?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "slippery_55jack",
                                                            "body": "Agreed",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "hey_ringworm",
                            "body": "The EU has spent more money on Russian gas since 2022 than they’ve given in aid to Ukraine.\n\nThey are hypocrites of the highest order and their opinions should have zero bearing on the outcome of this conflict.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "slagathor_zimblebob",
                                    "body": "Oh but don’t worry.. they met Zelenskyy and cheered him on. \n\nRemember when the Germans laughed at Trump in like 2019 when he said they will become totally reliant on Russian gas… LOL",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "slippery_55jack",
                                    "body": "Love your flair lmfao",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Character-Bed-641",
                    "body": "> In all seriousness, this deal is looking to be a loser for Ukraine. I wonder what concessions, if any, will be made by Russia in their demands.\n\nProbably very little, their hand is pretty strong at the moment. Which makes me wonder just how much of a stinker we're about to see, I suspect Trump brought carrots to this talk since if he's bringing sticks he usually posts it on twitter. No details feels like a cause for some concern. \n\nThere's still time for the deal to blow up, and given the track record this seems pretty likely too.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "evilfollowingmb",
                    "body": "Don’t see how it’s a loss for Ukraine. Or, perhaps a better take is that they both lost.\n\nRussia has utterly failed in its goal to take over Ukraine and is revealed to be an inept in fact almost hapless military power. I’d say pretty humiliating all around for them.\n\nUkraine will have to cede some territory, but will remain a sovereign country, and going forward can do so without sacrificing more lives.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "theboss2461",
                    "body": "This looks like a victory for Ukraine. Getting Putin to the table is a huge step. Russia will come out of the following negotiations weaker.",
                    "score": -124,
                    "replies": [
                        {
                            "author": "slippery_55jack",
                            "body": "I am unsure of the basis for your claim\n\nRussia is demanding control of the territory they have won in this war, for US to recognize Crimea as Russian territory, Ukraine to disavow the idea of joining nato, and a new government (approved by Russia presumably) in Kyiv \n\nIn other words, they have conceded nothing",
                            "score": 122,
                            "replies": [
                                {
                                    "author": "theboss2461",
                                    "body": "Where do you see this? My basis for the claim is in the phone call that occurred today. You are spewing nonsense here.",
                                    "score": -86,
                                    "replies": [
                                        {
                                            "author": "slippery_55jack",
                                            "body": "My friend, Russia has been to the negotiation table plenty of times over the past 3 years. They have conceded nothing and continue to pound Ukraine.",
                                            "score": 68,
                                            "replies": [
                                                {
                                                    "author": "theboss2461",
                                                    "body": "Ah yes, the past three years under a Democrat US president that thrives on war. Great argument. Ukraine isn't getting \"pounded.\" Ukraine successfully bombed Moscow twice.",
                                                    "score": -37,
                                                    "replies": [
                                                        {
                                                            "author": "slippery_55jack",
                                                            "body": "Ukraine has spent billions of dollars in foreign aid to lose only four regions along the Black Sea. \n\nDemocrat president is irrelevant. There are something like 100 countries involved in the war in some way or another.",
                                                            "score": 33,
                                                            "replies": [
                                                                {
                                                                    "author": "theboss2461",
                                                                    "body": "The party of war mongering is relevant. It wouldn't have started if trump won 2020. But that was then, and this is now. Reality is, Ukraine has the advantage currently, and Russia is in no position to demand concessions from Ukraine. Russia is on the brink of collapse and Putin is willing to give up anything in order to prevent it.",
                                                                    "score": -10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "slippery_55jack",
                                                                            "body": "How does Ukraine have an advantage?\n\nRussia has seized all territory bordering the Black Sea.\n\nNATO will not send troops to Ukraine and further escalate the conflict.\n\nThe western rhetoric is strong, but the policy is weak.",
                                                                            "score": 16,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "theboss2461",
                                                                                    "body": "Ukraine still has men and technology. Russia is importing foot soldiers from North Korea and other irrelevant countries. They have used up almost all of their weapons stockpiles. Their economy is about to collapse. Meanwhile, Ukraine landed two successful bombing episodes on Moscow last week. The land that Russia did seize, wasn't being guarded by Ukraine. Ukraine's forces were focused on more important regions that they were able to hold onto. It was a strategic loss, because they weren't able to defend both. In the places that Ukraine were able to fend off Russian troops, it was an overwhelming victory. Russia expended almost all of their troops and ammunition.",
                                                                                    "score": 5,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "specter491",
            "body": "Lol Putin wants a ceasefire to start in the areas that Ukraine is hitting them the hardest. Putin is playing Trump like a fiddle. There will be no peace until either Russia captures Kiev or Russia collapses. Neither one is good but the first one rewards aggressive dictators and lays a plan for future countries to do the same.",
            "score": 153,
            "replies": [
                {
                    "author": "Point-Connect",
                    "body": "Ukraine has been suffering severely from Russian attacks on their energy infrastructure. It's a significant target that any warring nations will go after immediately. Russia has been hammering Ukraine's and continues to do so. Russian strikes haven't just affected Ukraine's military, it affects millions of civilians too.\n\nYes, Ukraine has been very successful as of late and obviously that's one reason Russia is fine with this, but let's not cloud our perceptions of reality. The reality unfortunately sucks, but Putin isn't going to slink away easily. You're also confusing things, Russia has the upper hand, they have more power in negotiations, that's just what it is. That means they can make demands, again it's terrible it's like this, but anything short of American military intervention, isn't going to take away their bargaining power",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "YesItIsAnAltAcc",
            "body": "Sounds productive. Now if you can get him to make peace without Ukraine giving up any land, that'll be the best possible outcome.\n\nLoved hearing them agree that Iran should never be in a position where they can destroy Israel. To me that gives a go ahead for Trump to do what he needs on that end of things without worrying about Russia.",
            "score": 122,
            "replies": [
                {
                    "author": "Inquisitor_Machina",
                    "body": "Ukraine will lose land. \n\n\nNote: this is not me endorsing Russia or the war. It's pointing out realistically that there is no way Russia will just give up what they spent lives and money on.",
                    "score": 113,
                    "replies": [
                        {
                            "author": "hey_ringworm",
                            "body": "Putin *can’t* come away from this war without acquiring land. The Russian Politburo is full of radicals far worse than Putin- some of them openly advocate for nuking Ukraine. Putin keeps them in line through the appearance of strength and if Putin concedes all the land back to Ukraine that Russia occupies, he will be branded as weak and a colossal failure- he would be deposed by the radicals.\n\nPutin has to have something he can sell as a victory to his people and land concessions by Ukraine have to be a part of that.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "jimmyg899",
                                    "body": "I think that will be having Cremia recognized , Russian sanctions lifted and allowing them back into the Olympics, etc.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "YesItIsAnAltAcc",
                            "body": "Its probably the sad reality. I'm just trying to be optimistic that Trump can make something happen. Like I said, best possible outcome. I dont know if it will though unfortunately",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "War-Damn-America",
                                    "body": "At this point the best possible outcome like that would likely be Ukraine renounces claims on Crimea and the breakaway areas of the Donbas stay \"independent\" while the rest of the land transfers back to Ukrainian control. In reality I really don't see Russia giving up their land bridge between Russia and Crimea. \n\nSo, it will be interesting to see what comes out of all this, but I would be very surprised if Russia agrees to give significant land back to Ukraine.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "theboss2461",
                            "body": "Ukraine won't lose land. Putin is not in a position to keep what they've taken. Russia is too weak to have any say in the matter.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Delicious_Physics_74",
                                    "body": "You are all insanely ignorant and propagandized when it comes to the Ukraine war",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sanesociopath",
                    "body": "The 1 and only chance at that happening is if they signed a deal to completely demilitize, not join nato, not have foreign troops in Ukraine, and not join the EU trade block\n\nIdk if that's worth keeping the land in technicality only",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Torchwood777",
                    "body": "Ukraine will give up land, they had a chance without giving up land in the Istanbul agreements, but that was derailed by the west. Ukraine military is running out of men. Ukraine needs to make peace soon.  ",
                    "score": -16,
                    "replies": []
                },
                {
                    "author": "reddit_names",
                    "body": "When you lose a war, you to close land. It's how war works. Ukraine is in a position to just be thankful to the US they will keep any of their land.",
                    "score": -5,
                    "replies": []
                },
                {
                    "author": "theboss2461",
                    "body": "Nothing here suggests that Ukraine is giving up any land.",
                    "score": -44,
                    "replies": [
                        {
                            "author": "YesItIsAnAltAcc",
                            "body": "It appears that way, and it is promising. but going off this, it looks like negotiations are still ongoing and nothing has been made concrete yet.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mschramm06",
            "body": "Russia needs to off ramp now. Ukraine has punched up this entire fight and are one drone strike from sending Russia into complete collapse.",
            "score": 59,
            "replies": [
                {
                    "author": "pimanac",
                    "body": "> Ukraine has punched up this entire fight and are one drone strike from sending Russia into complete collapse.\n\nThe first part, yes.  They've definitely punched up.\n\nThe second part sounds a lot like the \"Russia will fall in just a couple more days/weeks\" we've been hearing for 2 years.",
                    "score": 75,
                    "replies": [
                        {
                            "author": "hey_ringworm",
                            "body": "Almost 3 years. We’ve been hearing the “Russia is on the verge of collapse” narratives since April 2022.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "pimanac",
                                    "body": "shit you're right it has been three years.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "NoVacancyHI",
                                    "body": "And they still buy it...",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "theboss2461",
                                    "body": "The people who started saying \"Russia was on the verge of collapse\" was exclusively Ukraine simps warmongering and making up things to keep the war going. They would have no reason to fight if they believed Russia was strong and able to wipe out Ukraine. It turns out, Russia was weaker than expected, but not on the verge of collapse. We haven't heard this rhetoric for a while since, until it came back up recently. Russia is TRULY on the verge of collapse. Their economy is hanging on by a thread, they have no more troops, and no more ammunition. Ukraine bombed Moscow twice last week. The ONLY thing Russia could possibly use as a negotiation chip, would be the resignation of Putin and his crew. That would be the only way for Russia to gain something.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sanesociopath",
                    "body": "Lol, yeah no... it's nowhere near going that well for Ukraine. You may want to look for some non pro Ukraine propaganda sources",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "UltraAirWolf",
                    "body": "That’s a nice thought. I wish I could believe it.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Special_Sun_4420",
                    "body": ">are one drone strike from sending Russia into complete collapse.\n\nPlease bro just two more ~~years~~ weeks. I swear, bro. We're so close. Russia is going to collapse any second now, bro. I swear. Just two more ~~years~~ weeks.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheModerateGenX",
            "body": "Not sure why the talks need to happen in the Middle East, of all places. I suppose it is intended to be viewed as a neutral location, though.",
            "score": 6,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 11,
            "replies": [
                {
                    "author": "slippery_55jack",
                    "body": "Agreed. OP seems naive in their commentary that Russia has agreed to peace.\n\nRussia has agreed to keep all territory won in this war, and to stop fighting, on the condition that Ukraine never join nato, nato armaments are removed from bordering nations, and a Russian government is installed in Kyiv.\n\nTL;DR: Russia says, “you can have your peace if we can have your country”",
                    "score": 63,
                    "replies": [
                        {
                            "author": "Unlucky-Prize",
                            "body": "Yeah. Russias goals and claims are the same here as yesterday last week and 2 years ago. To get peace both parties need to reduce their claims. Ukraine is willing to, Russia is not, their goal remains conquest of Ukraine.",
                            "score": 30,
                            "replies": []
                        },
                        {
                            "author": "MapleMonstera",
                            "body": "Has Russia recently said they would agree if they can keep all territory won in this war ?\n\nI keep seeing you reference that , and I don’t disagree that is the likely outcome here - but is that confirmed ?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "slippery_55jack",
                                    "body": "This has been the Russian position from 2022 through 2024\n\nNot sure how a phone call with Trump would lead anyone to believe they are backing off\n\nIf Russia was conceding terms, this would be all over the news cycle",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoVacancyHI",
            "body": "Where am I? These comments read like a brigade from r-politics... Bunch of war is peace vibes going on",
            "score": 4,
            "replies": []
        },
        {
            "author": "theboss2461",
            "body": "Link to X post: [here](https://x.com/JacquiHeinrich/status/1902050421541143020?t=mQ88asZWPBndpkNGi-P21Q&s=19)\n\nRussia has agreed to peace. And no, this does NOT mean that Trump and Putin are friends. It appears that Ukraine isn't conceding anything to Russia.",
            "score": 20,
            "replies": [
                {
                    "author": "zroxx2",
                    "body": " Zero chance Ukraine comes away with Crimea, but they de facto lost that in 2014 when Obama and the EU shrugged that invasion off. 2022 invasion comes along and Biden and the EU basically virtue signaled while Russia took another slice from Ukraine, they're probably not going to get a lot of that back either. \n\n Make no mistake, Ukraine is going to concede a lot, because no one in Europe cared enough about it to build up a localized deterrent post-2014 and no one wanted to put boots on the ground to kick Russia out in 2022. And personally, I sure as hell don't want Trump sending American troops in there to die for Ukraine in 2025. Best they can hope for is trying to get the world to not make the same damn mistakes all over again 8 years from now.",
                    "score": 83,
                    "replies": [
                        {
                            "author": "sfbruin",
                            "body": "The only way Russia can be trusted not to do anything is if there are Western boots on the ground. Which there will be if there's a mineral rights deal, which will operate as a de factor security guarantee for Ukraine.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Tiktaalik414",
                            "body": "Although I maintain that Crimea is rightfully Ukrainian land, there’s no way they’re coming away with it, it carries so much strategic importance. Part of the reason Russia probably wanted to invade in the first place was that Ukraine was denying Crimea resources by cutting off its water supply from the Ukrainian mainland. If borders are frozen at the current front lines that would no longer be an issue for Russia. \n\nBest case scenario for the world is that some kind of peace deal is made, and then maybe just maybe the peace can last long enough to where Putin dies or retires and someone more reasonable on the world stage takes his place.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "theboss2461",
                            "body": "I don't see Russia being able to keep what they took since 2022. Crimea is questionable, but maybe. Trump had put up deterrents in his first term, that Biden got rid of. At the end of the day, Russia will come out of these negotiations significantly weaker.",
                            "score": -30,
                            "replies": [
                                {
                                    "author": "zroxx2",
                                    "body": " Short of boots on the ground, what is the leverage against Russia that the West can bring to the negotiating table? Maybe Trump can crank up more sanctions. I don't see Europe going cold turkey off Russian oil in the short term, so we can't threaten that right now.\n\n I'm just being realistic, Trump actually doesn't have a magic negotiating wand. While I'm convinced he can facilitate a ceasefire and a peace that will at least last through his term, there's nothing he can pull out that I can see to leverage Putin into giving up whatever Russia has taken since 2022 and walk away with nothing.",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "Swiftbow1",
                                            "body": "I think we're offering carrots, not sticks. Reduced sanctions and trade opportunities with the West is a considerable incentive for Russia to back off.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "zroxx2",
                                                    "body": " Well the United States already ceased direct oil imports from Russia. I'm not sure there's a lot left on the sanction table... when the war started there was some bluster about disenfranchising Russia entirely from SWIFT, attempting to sever them from as much of the world economically as possible, but I see the reality now is that even Europe continues to keep trading and buying oil, let alone China, India.\n\n I think trade opportunities is more of a carrot at this point. \n\n I'm just trying to be realistic, I'm open to other ideas. Everyone wants to see Putin get beat. You can push him out with force (and a lot of American and European lives) or you can coax him out and try to make sure this can't happen again.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "theboss2461",
                                                    "body": "It's important to realize that Putin is coming to the negotiation table after Moscow got bombed twice. The Russian military is non existent, and their economy is in complete ruin. Putin has nothing left, and is willing to do anything to make sure his country is still standing.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "theboss2461",
                                            "body": "Russia's economy is crumbling. Russia's military is non existent. Putin is willing to do anything to prevent a complete collapse of his country.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tikiku",
            "body": "I cannot recall the words “peace talks” during the previous administration. I do recall politicians and moronic celebrities flying to Ukrainian regularly…to pick up their checks? 🤔",
            "score": 4,
            "replies": [
                {
                    "author": "theboss2461",
                    "body": "No, it was to drop off checks.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "sanesociopath",
                            "body": "Six of one, half a dozen the other",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FartingTacos",
            "body": "The downvote bots are iut in force in the comments today. Thos is nuts.\nI'm doing my best to combat it though.",
            "score": 4,
            "replies": [
                {
                    "author": "theboss2461",
                    "body": "The people who claim to hate Russia don't want to acknowledge that their big bad enemy is incredibly weakened right now. I'm genuinely confused, you'd think they'd be excited. But no, they need to keep up the facade of Russia being strong in order to keep this war going, because they are just gross warmongers.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Terrible-Actuary-762",
            "body": "Que the Left's outrage and the \"Trump is in Putin's pocket\" comments.",
            "score": 2,
            "replies": []
        },
        {
            "author": "_Diggus_Bickus_",
            "body": "Are lefties mad that he is out isn't gonna start ww3 these days",
            "score": 0,
            "replies": []
        },
        {
            "author": "FartingTacos",
            "body": "How is the left going to spin this as a bad thing? That's the real question.",
            "score": -6,
            "replies": [
                {
                    "author": "theboss2461",
                    "body": "Probably something along the lines of: \"Trump uses close friendship with Putin to start peace talks by giving up all of Ukraine\"",
                    "score": 45,
                    "replies": []
                },
                {
                    "author": "FartingTacos",
                    "body": "Wow... down to -4 votes as of this reply. I guess if you're taking flak, you're over the target.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "theboss2461",
                    "body": "Probably something along the lines of: \"Trump uses close friendship with Putin to start peace talks by giving up all of Ukraine\"",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "FartingTacos",
                    "body": "Wow... the downvote bots are iut in force today. That's insane.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "DoBronx89",
                    "body": "iTs OnLy A lImItEd CeASeFiRe AgAiNsT eNeRgY aNd IfAsTrUcRuRe!!!! OrangeHitler and Putin are going to divvy up the energy resources in Ukraine for themselves!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Flare4roach",
                    "body": "Don’t you worry. If there’s a remote chance that President Trump will eke out a win, the Left will go batshit. \n\nIt’s all they got.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}