{
    "title": "Now for The last, which videogame is about Man VS Author",
    "author": "BLACKGOOP12",
    "subreddit": "videogames",
    "rank": 19,
    "score": 540,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 191,
    "url": "https://i.redd.it/ez0jzpfzkcpe1.jpeg",
    "id": "1jdt59r",
    "selftext": "",
    "comments": [
        {
            "author": "KickStreaming",
            "body": "The Stanley Parable",
            "score": 1030,
            "replies": [
                {
                    "author": "Issac-Cox-Daley",
                    "body": "\"He answered confidently...\"",
                    "score": 143,
                    "replies": []
                },
                {
                    "author": "BiAndShy57",
                    "body": "“u/KickStreaming answered confidently. Surely *this* was the correct answer. When the blank line of a new comment appeared on u/KickStreaming’s screen and they had the ability to type out *any* combination of letters into that blank box, there was absolutely no other combination that could’ve been inputted. After all, the only two characters in that game where the narrator and the player. The entire game was all about obeying or defying the narrator’s carefully laid out story!\n\nAnd if I may toot my own horn for a moment, it was a truly magnificent story. All about the concept of free will in a video game. It was brilliant. But then Stanley had to go and muck it up.\n\n…Oh, but I can’t stay mad at Stanley. I do miss him sometimes. Stanley at least wasn’t as predictable as the 3 or 4 hundred of you that voted for this comment. The Stanley Parable is the perfect choice for this slot, sure, but look at your collective creativity in selecting ‘man vs man’. It’s TF2! Blu Mann vs Red Mann! Brilliant! \n\nSo why couldn’t you simpletons delve a little deeper for the post modern entries? Is it because video games haven’t explored post modernism? Are we really so primitive of a story telling medium? The Stanley Parable came out 12 years ago and we still haven’t topped it, is that what I’m supposed to get here?\n\nThough admittedly honored to see my game hold up as the work of art it is, I believe it is time we push video games *forward* as a story telling medium. Perhaps another game exploring the relationship between player and the game developer’s intended design… another Man vs Author meta-narrative…. Yes, I can see it now…. I think I’ll call this game… \n\n…The Stanley Parable 3!”",
                    "score": 88,
                    "replies": [
                        {
                            "author": "rammux74",
                            "body": "🔥✍️",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "Guybadman20",
                            "body": "\\[VOLITION\\] - \"Are you sure? that title makes no sense unless you beat the game- a game with how many endings?\"\n\n\\[ENCYCLOPEDIA\\] - \"The game stanley parable has 46 endings, but it has 47 if you include the serious ending.\"\n\n\\[HALF LIGHT\\] - \"Why the fuck would a fucking half-life 2 mod have 47 endings? cry of fear has like, 4\"",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cheesepuff1993",
                    "body": "Any other answers are objectively wrong",
                    "score": 43,
                    "replies": [
                        {
                            "author": "EmergencyTechnical49",
                            "body": "Yes, it's like Stanley Parable was meant as an exact answer to this question.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "ScaryTerry51",
                            "body": "I would consider an argument for Dude, Stop\n\nBut I do think The Stanley Parable wins it by far",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Eva_Pilot_",
                            "body": "What about slay the princess?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BacchusInvictus",
                    "body": "Came here to say this...",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Barraskewrya",
                    "body": "I came here to say this",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Infamous_Sessions",
                    "body": "Yep",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SquareFickle9179",
                    "body": "\"Oh, did you get the Broom Closet Ending? The Broom Closet ending is my favirite! >W<\"",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "One_page_nerd",
                    "body": "The only correct answer",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "hizzane",
                    "body": "Easily the correct choice",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "InterviewPuzzled7592",
                    "body": "Phew.\n\n\nCame here to say this but knew it wouldn't get attention in a sea of 138 comments",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Voodoo_Dummie",
                    "body": "Absolutely, the one and only",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lps4thewin",
                    "body": "came here just to say this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Majestic_Repair9138",
                    "body": "r/beatmetoit",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "realmoondragonIII",
                    "body": "THIS! it’s pretty much the only one i can think of",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MarcTaco",
                            "body": "Deltarune and Oneshot are the only other big examples I can think of.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "realmoondragonIII",
                                    "body": "i haven’t played those. i really need to get around to playing one shot",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MarcTaco",
                                            "body": "Deltarune is free",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UnderstatedTurtle",
                    "body": "Literally same here to make sure that got said",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Special_Tea_1836",
                    "body": "Man vs freewill",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "talonking22",
                    "body": "As much as i hate that game, its the absolute best answer for this.",
                    "score": -14,
                    "replies": [
                        {
                            "author": "Big-Molasses2862",
                            "body": "why do you hate it, its one of the greatest games of all time",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "talonking22",
                                    "body": "I don't enjoy getting played by the game, i'd rather play a game myself.\n\nPretty much all i was doing was walking and getting trolled by the author. Its not my idea of a good game.\n\nIts fine if you like it, but for me this game was one of the worst, just boring and annoying game with nothing else going for it, if you don't like the dark humor and getting trolled then it all falls apart, not that hard to see why someone might not like it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Big-Molasses2862",
                                            "body": "I think you should have played more, it develops past trolls",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Scary-Ad4471",
                            "body": "Bro why you hate the game it’s so good!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shot_Arm5501",
            "body": "The stanly parable",
            "score": 19,
            "replies": []
        },
        {
            "author": "SrJuanpixers",
            "body": "I'm with Stanley on this one, but i cannot help but to mention Getting Over It\n\nThroughout the game you constantly get ridiculized by the creator, constantly mocking and toying with your patience, tearing down your hopes and determination so you can't \"Get over\" the game\n\nHeck, the game itself it's a challenge made by the creator to mess with the people who plays it",
            "score": 140,
            "replies": [
                {
                    "author": "CloseOUT360",
                    "body": "I don’t how you came to that conclusion. Most of the dialogue in getting over it is just philosophical musings from the narrator. When you fall the narrator just states what happens, it’s not antagonizing it’s just commentating. The game was obviously created to give people the opportunity to overcome a challenge, the creator literally says “I give this game to you with all my heart”, how did you come to the conclusion he created the game to mess with people?",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Unslaadahsil",
                            "body": "Because they can't \"get over it\".\n\nWhen you're in a situation of difficulty, and someone makes a completely neutral statement, you can tell a lot about a person if you could know how they interpret that statement.\n\nFor example, a man falls while walking down a street. A passerby sees it happen and comments \"Uh, he fell\". 100% neutral statement delivered without any inflection.\n\nHow does the man on the ground respond? will he be defensive with a  \"thanks, captain obvious\"? Will he make excuses with something like \"There's a hole there!\"? Will he laugh it off and get back up? Will he scowl and get mad at himself for falling? Will he accuse the one commenting of tripping him? Will he lay on the ground with his face in the asphalt contemplating how his life led to that point?\n\nHonestly, it could be *fascinating* to put a thousands people under observation while playing \"Getting over it\" and see how they react not to the game but to the Narrator's comments.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "KmartCentral",
                            "body": "Because while he gives the opportunity to overcome the challenge, it's also intended to do so in a very infuriating way. You're supposed to get over it, but you're supposed to rage",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Lord_Nishgod",
                                    "body": "\"going down the road feelin' bad...\"",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "One_page_nerd",
            "body": "Staley parable should be here.  Come on guys that's the whole point of the game!!!",
            "score": 15,
            "replies": []
        },
        {
            "author": "Commercial_Check6931",
            "body": "Alan wake?",
            "score": 153,
            "replies": [
                {
                    "author": "Silkies4life",
                    "body": "I think that’s author vs. reality",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Excellent_Mud6222",
                            "body": "Author vs book?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Silkies4life",
                                    "body": "Book vs author? Who fuckin knows in the end",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Specialist-Text5236",
                    "body": "Alan wake is Man vs Self",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "KnightSpectral",
                    "body": "This is precisely the definition of this game. Stanley Parable is more Man vs Narrator, not Author. This must go to Alan Wake.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "byrgenwerthdropout",
                    "body": "His profession is being an author, so his man vs self is one against his darker self coming through his inner author. In short it's a story of an author's inner conflict as opposed to sth like The Stanley Parable which is truly one of you vs the separate author actively telling you your script.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "turkeysatemyfather",
                    "body": "This is the correct answer.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "1CryptographerFree",
                            "body": "Alan Wake is Mr. Scratch, how did so many people miss this?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Hot-Cobalt",
                    "body": "We already have Control on the board, it has Alan Wake in it.",
                    "score": -22,
                    "replies": []
                }
            ]
        },
        {
            "author": "CookiesAndNoCreme",
            "body": "Stanley parable",
            "score": 39,
            "replies": []
        },
        {
            "author": "SnooLobsters7490",
            "body": "I mean... come on its literaly Stanley",
            "score": 6,
            "replies": []
        },
        {
            "author": "Drikaukal",
            "body": "Stanley parable.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Interesting_Pass3392",
            "body": "Comix zone",
            "score": 4,
            "replies": [
                {
                    "author": "_Weyland_",
                    "body": "YES! I'm not alone on this one!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AsherTheDasher",
            "body": "stanley parable guy, this is your moment!!!",
            "score": 7,
            "replies": []
        },
        {
            "author": "infinitsai",
            "body": "I think Stanley Parable fits the premise more, while Alan wake is a really meta take on the man vs himself premise",
            "score": 3,
            "replies": []
        },
        {
            "author": "Alarmed-Contract5306",
            "body": "Alan fuckin Wake",
            "score": 3,
            "replies": []
        },
        {
            "author": "Unslaadahsil",
            "body": "Bioshock\n\nThe entire game is this big parable on how your character doesn't have any real choice in his actions despite the player being able to stop playing (and therefore ending the character's actions) at any time, and the game basically goes on this spiel about the whole \"a man chooses, a slave obeys\" and it has this double meaning because it means the main character of the game was a slave for having no choice, but it also means the player is a slave because you didn't make any choice and just followed the orders of the NPCs (ai: the game) telling you what you have to do.\n\nAnd unlike every other game I played or checked out with this same message, Bioshock didn't make me think of a preachy loser teen during their first week at Philosophy 101 while saying this.",
            "score": 7,
            "replies": []
        },
        {
            "author": "tollboothjimmy",
            "body": "Cmon. Alan Wake",
            "score": 38,
            "replies": [
                {
                    "author": "tcrpgfan",
                    "body": "No. Considering the story, Alan Wake is definitely man vs. self. He IS the author of his own manuscript, but he's also the cause of a lot of his own issues. As proof, Mr. Scratch is Alan's jungian shadow-self made manifest.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "jackal5lay3r",
                            "body": "well theirs also alan wake 2 which has saga anderson so at least alan wake 2 fits",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "tcrpgfan",
                                    "body": "That's a case of working with the author, not against them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "maguirre165",
            "body": "Alan Wake",
            "score": 25,
            "replies": []
        },
        {
            "author": "CyanLight9",
            "body": "Alan Wake 2.",
            "score": 17,
            "replies": []
        },
        {
            "author": "timeaisis",
            "body": "I mean it’s obviously Alan Wake",
            "score": 18,
            "replies": []
        },
        {
            "author": "Bender_conteston",
            "body": "Alan wake",
            "score": 11,
            "replies": []
        },
        {
            "author": "Background_Clue_3756",
            "body": "Star Ocean 3 perhaps.\n\nEternal Sonata",
            "score": 2,
            "replies": []
        },
        {
            "author": "tw1x3d",
            "body": "Half-Life 3",
            "score": 2,
            "replies": []
        },
        {
            "author": "GenesisAsriel",
            "body": "Animation VS Animator (the flash game)",
            "score": 2,
            "replies": [
                {
                    "author": "Commercial_Ad97",
                    "body": "Oh, I like this one, and that game.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "HilariousLion",
            "body": "YES! Control made the list!",
            "score": 2,
            "replies": []
        },
        {
            "author": "dragonspirit77",
            "body": "The Stanley Parable",
            "score": 2,
            "replies": []
        },
        {
            "author": "hmmmmwillthiswork",
            "body": "stanley parable is man vs narrator\n\nalan wake is man vs author\n\nplz don't listen to top comment lol",
            "score": 19,
            "replies": [
                {
                    "author": "Lol-775",
                    "body": "The narrator's script is written by the author.\n\nI feel like he is more an embodiment of the author rather than a character.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "KarlUnderguard",
                            "body": "Yeah, the narrator didn't just appear out of thin air. \n\nWait, maybe he did.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "uneducated_guess_69",
                    "body": "The narrator is literally telling his own story",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BitterCaterpillar116",
            "body": "Bioshock? Far-fetched, but it’s him against the author of him, kind of",
            "score": 3,
            "replies": []
        },
        {
            "author": "Disastrous-Pick-3357",
            "body": "stanley parable or Alan wake",
            "score": 3,
            "replies": []
        },
        {
            "author": "Direct_Broccoli6422",
            "body": "Myst",
            "score": 3,
            "replies": []
        },
        {
            "author": "n9seed",
            "body": "The stanley parable",
            "score": 4,
            "replies": []
        },
        {
            "author": "CrashOutBoy",
            "body": "Felt like Man vs Reality should’ve been Spec Ops The Line and Man vs Tech should’ve been Cyberpunk",
            "score": 5,
            "replies": [
                {
                    "author": "Electrical_Trifle_76",
                    "body": "I feel Control does more with the concept of “fighting against the confines of reality” more than The Line. It’s been long while since I last played Spec Ops, but if I remember correctly the whole twist is a bit one note, versus Control where its theme of “ripping down the poster on the wall” and “touching the very foundation of the world” runs more true throughout every aspect of the game. Not saying one is better than the other, both Control and The Line are good examples of Man vs Reality, but Control has a larger focus on it I’d say",
                    "score": 4,
                    "replies": [
                        {
                            "author": "CrashOutBoy",
                            "body": "Then you definitely need to revisit Spec Ops The Line , it makes not only the main character question reality but even the player , especially since it’s a very real possibility that the whole 3rd act of the game didn’t even really happened and was all in head of the protagonist who’s in the process of possibly dying and is stuck in purgatory going through the same loop of the entire game",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Radiant_Raspberry_93",
            "body": "Slay the Princess",
            "score": 4,
            "replies": [
                {
                    "author": "MrMurpleqwerty",
                    "body": "but unlike The Narrator in Stanley Parable, The Narrator in Slay the Princess is>!, like the other Voices in the game, merely a reflection of yourself; therefore StP is more a Man vs. Self game rather than a Man vs. Author game.!<",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Smaldark",
            "body": "I think The Hex, literally all they talk about is author milking games to their characters expenses",
            "score": 4,
            "replies": []
        },
        {
            "author": "Electrical_Trifle_76",
            "body": "Alan Wake is 100% the right choice here",
            "score": 5,
            "replies": [
                {
                    "author": "Individual99991",
                    "body": "That's more Man Vs Himself.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Electrical_Trifle_76",
                            "body": "Is he not the author of his story? Is he not trapped by his own narrative? Is he not trying to defy the story laid out before him? It can be both, but Man vs Author takes more precedent than Man vs Self here",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Individual99991",
                                    "body": "I don't think so. Author implies the real-world creator of the work, not the protagonist themselves. If Alan were trying to kill Sam Lake maybe it would be different (maybe that happens in the DLC, I  haven't played it yet).\n\nStanley Parable probably comes closest of the games I've played, but even that doesn't quite work. You are at least pushing back against the scripted story (even if it means playing into different scripts) rather than following a single narrative though.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Electrical_Trifle_76",
                                            "body": "I don’t think author necessarily implies real-world, I think it simply means the narrative the characters find themselves in, and that they are aware, at least on some level, that they are part of this narrative. Even then, by your own criteria, Alan and the other characters are still fighting against the narrative, yes it’s a linear game, but the characters are actively doing things to fight against the story that is setting in. If you want to go further even, the whole purpose of the final draft mode is to do exactly that, watch the characters be fully aware that they are in a story and see them work towards the proper “correct” ending.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "EmergencyTechnical49",
                                                    "body": "You are wrong.\n\nAuthor here literally means the actual author of the story, and the conflict with the author / breaking the 4th wall is like one of the bedrocks of post modernism.\n\nIf you really think \"author\" can also mean author that is just one of the characters in the story you are objectively wrong, and very much so.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "dope_like",
                                                            "body": "That's your interpretation. There can be other interpretations",
                                                            "score": -7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Impriel2",
                            "body": "I believe the dark presence and IRL Sam lake canonically wrote parts of the story wake is stuck in as well",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "demoniprinsessa",
                            "body": "It's definitely both",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "killerspawn97",
            "body": "Feel like it’s gotta be Alan Wake man wrote the whole story and is literally the author, he just forgot and lost his marbles while writing with an eldritch editor fucking with him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "azlionheart312",
            "body": "The Bard's Tale?",
            "score": 2,
            "replies": []
        },
        {
            "author": "EvilTaffyapple",
            "body": "Alan Wake / Alan Wake 2",
            "score": 2,
            "replies": []
        },
        {
            "author": "shadowscorrupt",
            "body": "Alan wake",
            "score": 2,
            "replies": []
        },
        {
            "author": "POTK_Reddit",
            "body": "Man vs Author has to be Alan Wake, obviously",
            "score": 2,
            "replies": []
        },
        {
            "author": "bjornironthumbs",
            "body": "Alan Wake series",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gryphonos",
            "body": "Alan Wake",
            "score": 2,
            "replies": []
        },
        {
            "author": "slendersleeper",
            "body": "alan wake",
            "score": 2,
            "replies": []
        },
        {
            "author": "DaemonsMercy",
            "body": "Maybe a little bit slay the princess?",
            "score": 1,
            "replies": []
        },
        {
            "author": "rubythebee",
            "body": "Slay the Princess is also an option",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarcTaco",
            "body": "Deltarune",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bryrida",
            "body": "Scribblenauts",
            "score": 1,
            "replies": []
        },
        {
            "author": "Immediate_Sun_8436",
            "body": "There is no game?\n\nEdit:this is the name of the actual game",
            "score": 1,
            "replies": []
        },
        {
            "author": "vendettaclause",
            "body": "You could do something meta and choose one of the games that the hive mind hates because it has \"bad writing\". You know like starfield, avowed, or dragon age",
            "score": 1,
            "replies": []
        },
        {
            "author": "abermea",
            "body": "The entire gaming community vs Game Publishers",
            "score": 1,
            "replies": []
        },
        {
            "author": "Walkthrough101",
            "body": "There is No Game",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aun_El_Zen",
            "body": "I have no mouth and I must scream.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TyAD552",
            "body": "Anyone play the Teen Titans game based on the animated 2000’s show? That one they call out you the player lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "HoboSuperstar",
            "body": "Dark souls",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hyper669",
            "body": "Stanley Parable, >!Slay The Princess!<",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pancullo",
            "body": "I'm sure I'm too late for this to get any traction but my answer is Super Mario 64\n\n\n\nSure, Stanley's Parable was the first game that came to mind when thinking about this.\n\nBut I don't believe that it is the right answer. It's a trap.\n\nStanley's Parable is men vs narrator, and narrator and author are two different things. It's a game that puts you into the man vs author conflict, but it's crafted, the man talking to you isn't actually the author, it's just a narrator that plays the role of an author.\n\nSuper Mario 64, on the other hand, is the most speedrun game in history. And there's nothing that screams \"man vs author\" more than speedrunning. So yeah, Super Mario 64.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fearless-Sea996",
            "body": "There is no game wrong dimension",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amazing-Oomoo",
            "body": "Pneuma Breath Of Life, it's gotta be",
            "score": 1,
            "replies": []
        },
        {
            "author": "YesNoMaybe2552",
            "body": "Humanity and god are old enemies just like humanity and nature or humanity and technology or humanity and other humanity, damn humans they ruined humanity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist-Text5236",
            "body": "The Hex \n\nVideo game characters trying to kill their  creator",
            "score": 1,
            "replies": [
                {
                    "author": "haikusbot",
                    "body": "*The Hex Video*\n\n*Game characters trying to*\n\n*Kill their creator*\n\n\\- Specialist-Text5236\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Specialist-Text5236",
                            "body": "Bruh",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Appropriate-Bar-7250",
            "body": "The Bards Tale",
            "score": 1,
            "replies": []
        },
        {
            "author": "VcSv",
            "body": "Flappy Bird",
            "score": 1,
            "replies": []
        },
        {
            "author": "Swirrvithan",
            "body": "DUNGEONS AND DRAGONS",
            "score": 1,
            "replies": [
                {
                    "author": "Swirrvithan",
                    "body": "Wait that’s not a video game lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Commercial_Ad97",
                            "body": "Baldur's Gate begs to differ.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Taluca_me",
            "body": "I could go for Split Fiction. Technically speaking, the two women may be authors but they became part of their stories after some mishaps with the futuristic machine they volunteered in to get their stories famous. Problem is, the guy who made the machine wants to be famous with it while every author is uncredited",
            "score": 1,
            "replies": []
        },
        {
            "author": "NvrGonnaFindMe",
            "body": "If I may, I would like an honorable mention for:\n\nThere Is No Game",
            "score": 1,
            "replies": []
        },
        {
            "author": "Queasy_Suspect6126",
            "body": "Helldivers 2?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HG21Reaper",
            "body": "Bioshock 1 because you find out at the end that you never had free will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Weyland_",
            "body": "Any Comix Zone enjoyers here? \n\nAnyone? Come on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TruamaTeam",
            "body": "Mass Effect 3 with that shit writing",
            "score": 1,
            "replies": []
        },
        {
            "author": "ANS__2009",
            "body": "Getting over it with bennet foddy",
            "score": 1,
            "replies": []
        },
        {
            "author": "y33tyd3l3ty",
            "body": "Yakuza, just let Kiryu be happy damn it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Banana_Slugcat",
            "body": "Slay the Princess kinda",
            "score": 1,
            "replies": []
        },
        {
            "author": "Natural_Concern4542",
            "body": "Tunic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rammipallero",
            "body": "Alan Wake?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlueScream",
            "body": "I know people have already decided, but I think The Beginner's Guide fits much better than The Stanley Parable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "W34kness",
            "body": "Alan Wake maybe, hmmm but you’re the author…",
            "score": 1,
            "replies": []
        },
        {
            "author": "SweetReply1556",
            "body": "Honestly sad LiS didn't fit in any of that",
            "score": 1,
            "replies": []
        },
        {
            "author": "margerko",
            "body": "Actually it’s comics zone",
            "score": 1,
            "replies": []
        },
        {
            "author": "UncommittedBow",
            "body": "I'm sorry but TF2 needs to be re-labeled to Mann vs Mann, it's just too perfect to not do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "METALMILITIA625",
            "body": "Alan Wake",
            "score": 1,
            "replies": []
        },
        {
            "author": "Basic-Masterpiece375",
            "body": "Stanley Parable é a única escolha aceitável",
            "score": 1,
            "replies": []
        },
        {
            "author": "Revegelance",
            "body": "The Plucky Squire",
            "score": 1,
            "replies": []
        },
        {
            "author": "infiniteartifacts",
            "body": "The only other one I can think of is Layers of Fear but Stanley Parable is a better example",
            "score": 1,
            "replies": []
        },
        {
            "author": "SkoomaBear",
            "body": "It can only be Stanley parable",
            "score": 0,
            "replies": []
        },
        {
            "author": "JustTh4tOneGuy",
            "body": "It can only be Stanley Parable",
            "score": 1,
            "replies": []
        },
        {
            "author": "HydroSnail",
            "body": "Alan Wake and it's not even close.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrispyPerogi",
            "body": "The Stanley Parable\n\nAlso really think Hellblade: Senua’s Saga is a better pick for vs Reality",
            "score": 1,
            "replies": []
        },
        {
            "author": "dope_like",
            "body": "Alan wake 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "psychosiszero",
            "body": "There was an older Xbox live arcade game that played with perspective puzzles. The character became more self aware until it was actively fighting against the controllers inputs near the end. So uhhhh whatever that game was",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_miss_disco",
            "body": "Bioshock? Would you kindly? After all the player has been created by the antagonist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jackal5lay3r",
            "body": "alan wake 2 fits snugly i'd say since one of the two main characters is saga",
            "score": 1,
            "replies": []
        },
        {
            "author": "Common-Ad-5411",
            "body": "Alan Wake?",
            "score": 1,
            "replies": []
        },
        {
            "author": "rathosalpha",
            "body": "Stanley parable already won several days ago",
            "score": 0,
            "replies": []
        },
        {
            "author": "No-Definition-7215",
            "body": "The Stanley Parable is the only right choice",
            "score": -1,
            "replies": []
        },
        {
            "author": "Jonskuz15",
            "body": "Alan Wake",
            "score": 0,
            "replies": []
        },
        {
            "author": "InkDemon_Omega",
            "body": "Alan wake makes more sense than Stanley Parable tbh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ultramare2009",
            "body": "I love how everyone chose the Stanley parable cause it’s the only popular game that everyone knows that has that premise.",
            "score": -6,
            "replies": [
                {
                    "author": "raxdoh",
                    "body": "what do you have in mind then?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "AltGunAccount",
                    "body": "Why don’t you list some others then?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Aethrin1",
                    "body": "C'mon, you know that's not true. It's just objectively the best.\n\nPeople have mentioned Alan Wake, Getting Over It, I personally thought of Deadpool, but we all know that The Stanley Parable wins by a longshot.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Binary_Gamer64",
            "body": "Stanley Parable.  \n\nAny other answer is wrong!",
            "score": -6,
            "replies": [
                {
                    "author": "Meat_Popsicle_Man",
                    "body": "That’s a narrator. \n\nJudging by your comment history, you are almost always wrong.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YesWomansLand1",
            "body": "Yeah, it's the Stanley Parable. Only other one that I can think of Superliminal",
            "score": -1,
            "replies": []
        },
        {
            "author": "Open_Detective_6998",
            "body": "Everyone’s mentioning the Stanley parable or Alan wake\n\nBut what about OneShot?",
            "score": 0,
            "replies": [
                {
                    "author": "Specialist-Text5236",
                    "body": "I think its more of a man vs god ?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Slyme-wizard",
            "body": "Super mario maker I swear to GOD",
            "score": 0,
            "replies": []
        },
        {
            "author": "goodcoon",
            "body": "Comix Zone",
            "score": 0,
            "replies": []
        },
        {
            "author": "TheLateMrBones",
            "body": "Part of me wants to say TellTale Walking dead lmao",
            "score": -1,
            "replies": []
        },
        {
            "author": "louisianapelican",
            "body": "Team Fortress 2 is classical?",
            "score": -1,
            "replies": []
        },
        {
            "author": "Ragequittter",
            "body": "12 seconds?",
            "score": -1,
            "replies": []
        },
        {
            "author": "circ-u-la-ted",
            "body": "No Man's Sky, or any other game with annoying anti-QoL issues.  NMS probably isn't the worst of these, but I don't play enough games to know which is a more fitting option.",
            "score": -10,
            "replies": [
                {
                    "author": "Lol-775",
                    "body": "As a NMS fan what do you consider about it to be Anti-QOL?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "circ-u-la-ted",
                            "body": "A couple of things come to mind right away: the fact that you have to go into space just to see the galaxy map, and the weird limits on things like supply cable length (apparently this can usually(?) be worked around by chaining supply depots, though this hasn't worked for me so far).  Like why do I have to chain-connect teleporters if they're just going within my base?  Annoying and awkward, especially since the game seems designed to encourage you to travel around quickly within base limits.\n\nAlso the fact that you unlock, like, 80% of the tech in the game all at once when you find the Anomaly feels like bad design, though I don't know if it qualifies as anti-QoL.\n\nAnd then there are a lot of anti-QoL features that are added just so you can unlock solutions for them later, like having to farm supplies to make launcher fuel.  Some of the Man-vs.-Author-ness of the game is by design.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}