{
    "title": "‘It was messy’: Federal workers ordered to return to offices without desks, Wi-Fi and lights",
    "author": "CupidStunt13",
    "subreddit": "news",
    "rank": 27,
    "score": 8216,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 256,
    "url": "https://www.cnn.com/2025/03/04/politics/federal-employees-return-to-office-problems/index.html",
    "id": "1j3h0o4",
    "selftext": "",
    "comments": [
        {
            "author": "reddittorbrigade",
            "body": "This is the craziest government ever. \n\nTrump has broken his previous records.",
            "score": 3511,
            "replies": [
                {
                    "author": "youngmindoldbody",
                    "body": "43 days since inauguration, only 1,417 to go.",
                    "score": 933,
                    "replies": [
                        {
                            "author": "Pando5280",
                            "body": "If we make it that far. ",
                            "score": 337,
                            "replies": [
                                {
                                    "author": "Specialist_Brain841",
                                    "body": "There might not be free air to breathe by then.",
                                    "score": 191,
                                    "replies": [
                                        {
                                            "author": "Spinnweben",
                                            "body": "Brb, stockpiling Perri air cans.",
                                            "score": 109,
                                            "replies": [
                                                {
                                                    "author": "Real_Nugget_of_DOOM",
                                                    "body": "Snotty beamed me twice last night... it was wonderful!",
                                                    "score": 31,
                                                    "replies": [
                                                        {
                                                            "author": "clovisx",
                                                            "body": "Why didn’t anyone tell me my ass was so big?",
                                                            "score": 19,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TheSchlaf",
                                                            "body": "Thanks for calling and not reversing the charges...shithead.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TrailJunky",
                                            "body": "Nah, the people will solve the problem if it gets bad enough. Unfortunately, that bar is extremely high.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "TimTom8921",
                                            "body": "Fresh air is $9.99 a month",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "BoosterRead78",
                                    "body": "The biggest question will he make it that far?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "zedarzy",
                                            "body": "Probably not, but that's why they propped up Vance",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MaybeNotABear",
                                    "body": "And assuming he leaves office",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "Acrobatic_Age6937",
                                    "body": "Or he'll go even further beyond!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LindonLilBlueBalls",
                            "body": "I'm dreaming of Dems taking control of the house in 2026 and impeaching POTUS and VPOTUS.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "Equivalent-Resort-63",
                                    "body": "If dem get the majority in both chambers then you can pass laws/override the veto and stop this madness. But that’s a tall bar. Speaking of bar, i need to get ready for the lie-fest coming in the next hour…",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "Piotr-Rasputin",
                                            "body": "How about a couple thousand warnings and a stern finger wagging??",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TuckerCarlsonsOhface",
                                    "body": "You mean like last time, or the impeachment before that one?",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Cosmic_Seth",
                                    "body": "Maybe. \n\n\nhttps://projects.fivethirtyeight.com/polls/approval/donald-trump/\n\n\nMajority of Americans still approve Trump...just barely though. ",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "LindonLilBlueBalls",
                                            "body": "Same polls show a majority have an unfavorable opinion of him.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "Cosmic_Seth",
                                                    "body": "It's an aggregate poll, but it's still sad that as of yesterday, Trump still has a favorable rating by 0.1.\n\n\nFor the dems to have any chance in 26 that number needs to come way down.",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "techieman33",
                                            "body": "Overall majority doesn’t matter much. It’s going to come down to how much they can gerrymander the districts to get the results they want. And that’s assuming the elections are even legit to begin with.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "random_noise",
                                            "body": "I wonder about polling reliability these days with all the changes in our world and how most people I know Gen X and younger deal with these calls. I feel there may be a fair amount of generational and regional bias to polls and who answers those calls or responds to them.\n\nPerhaps I am biased in the people and strangers I know an interact with, and this is likely part of the observation, but...\n\nThe type of people who answer unknown phone numbers don't tend to be the most intelligent folks. I don't even let those numbers ring to my phone nor have I for decades. If you are not in my contact list, and I am not expecting an unknown call at a specific time, I do not answer my phone. \n\nEven when it comes to online or email methods. I don't respond to them for many reasons from due to cyber and privacy concerns.  \n\nEven most young lacking in critical thinking skills people I know, follow similar rules to stay sane in life. \n\nI just can't shake wondering about poll reliability. I wish I could.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "XSinTrick6666",
                                            "body": "Give it a year.  They have about 750,000 more terminations to go...",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "rrickitickitavi",
                                            "body": "At best he sometimes has a plurality. 538 now showing a plurality disapprove. Can’t believe it’s this close.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FreeUsePolyDaddy",
                                    "body": "Unfortunately they'll probably think Merrick Garland can help with that.\n\nHe's actually pretty lucky in how recent events have played out. Saved him from going into the books as the most damage-inflicting federal department head in US history.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Anvanaar",
                                    "body": "I honestly doubt that Trump would be able to make the full four years... ***IF*** America had a true and direct democratic system. But it doesn't.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "HeartyBeast",
                                    "body": "Unfortunately the failed insurrection will have led to a temporary state of emergency meaning an unfortunate delay to mid-terms",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Bookofdrewsus",
                            "body": "Only 10 days away from the Nazi’s record of conversion in Germany.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "rabidstoat",
                            "body": "We're almost 3% done!",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Interesting-Type-908",
                            "body": "LOL, oh you sweet summer child. You think there'll be another presidential election?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "TrailJunky",
                                    "body": "If there isn't, he will get the mussolini treatment",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "zedarzy",
                                            "body": "Russia holds elections.\n\n\nThere will be sham election so they can say it was fair.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "thejimbo56",
                            "body": "I’m rooting for the cheeseburger.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "yanocupominomb",
                            "body": "Makes you wish we could fast forward to the re-enactment of the french revolution.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Overbaron",
                            "body": "Love your optimism that there’ll be another (fair) election.\n\nTrump will completely dismantle federal oversight on elections.\n\nMost of this muddying up of federal functions is a smokescreen for ensuring the structures protecting democracy are subverted or destroyed.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Hfdredd",
                            "body": "973 days until midterms Nov 2 2027",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MeoowDude",
                            "body": "1417? That’s quite optimistic of you",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "guzhogi",
                            "body": "That assumes Trump will go voluntarily. Who’s to say he won’t try to get a third term, or do away with elections and stay in office indefinitely?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "rsmith72976",
                            "body": "Till what? You think we still have “free elections” in this country? About the time the 2028 election is suppose to happen is when people will realize, far too late, what was happening.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Frexxia",
                    "body": "I think you actually have to govern in order to call it a government",
                    "score": 74,
                    "replies": [
                        {
                            "author": "dustymoon1",
                            "body": "Trump doesn't govern. He rules. Project 2025 wants an autocratic government.",
                            "score": 43,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FuggyGlasses",
                    "body": "Department of Education employees at an office in Dallas returned to ethernet cords in piles around the floor, random wires sticking out of walls, and motion-sensor lights that weren’t working correctly, leading to dark workspaces. One employee tripped over a pile of cords on her first day back, resulting in a large gash on her foot. She’s submitted a workers’ compensation complaint.\n\n\nLmao first week back in office  and this happens. \nI am not sure if they'll give her hee comps award ",
                    "score": 41,
                    "replies": [
                        {
                            "author": "maallyn",
                            "body": "Wires sticking out of walls? Please, Please, DO NOT TOUCH any wire coming out of a wall without an appropriate wall plate or connector!!!!\n\nThis is a darn good way to get electrocuted.\n\nThis \\*nearly\\* happened to me!\n\nThank you\n\nLove\n\nMark",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sunshine___riptide",
                    "body": "I would have been SO THRILLED to be proven wrong about Trump. Like I really wanted nothing more than for all of our hate to be misplaced and he actually turned out to be a good president that put America first. \n\nI was proven wrong in a way.... He's even more of a fuck up than I thought he would be.",
                    "score": 81,
                    "replies": [
                        {
                            "author": "Good-Expression-4433",
                            "body": "The same president that had to be repeatedly stopped from invading Mexico, stopped from ordering the military to shoot protestors, and had federal authorities robbing states of their own medical supplies so his donors could auction them back off. The same president that did all of that, January 6, then openly said his next term would be a revenge tour?\n\nWe were fucked.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "techieman33",
                            "body": "Yeah, I held a sliver of hope in 2016 that he might actually do a little bit of good while in office. But he didn’t even get into office officially before I gave up on that.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Disce-Pati",
                            "body": "I feel you, I wanted Project 2025 to be bullshit and Trump to be an okay president. Couldn't have imagined things would go to hell this quickly.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "-Akos-",
                    "body": "Trump doesn’t have the mental capacity to do anything, this was Heritage Foundation with Project 2025 and letting that arm swinging South African run wild. Trump is just the frontman actor doing his showbiz stuff.",
                    "score": 236,
                    "replies": [
                        {
                            "author": "Coomb",
                            "body": "Do not absolve Trump of responsibility for the executive orders that bear his signature.",
                            "score": 210,
                            "replies": [
                                {
                                    "author": "hamoc10",
                                    "body": "Multiple people can all be responsible.",
                                    "score": 60,
                                    "replies": [
                                        {
                                            "author": "ZylonBane",
                                            "body": "\"The buck pauses here.\"",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "Coomb",
                                            "body": "Absolutely. But people without the mental capacity to understand what they're doing can't be.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "hamoc10",
                                                    "body": "I inferred a different definition of “responsible.” I didn’t take it to mean “at fault,” I took it to mean a “cause of.”",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "McGuirk808",
                                                    "body": "They absolutely can.  If you hold public office, you're responsible for the things you sign whether you understand them or not. \n\nYou have a responsibility to understand them and if you implement them anyway, you are being negligent at best.\n\nIf he's being dragged around and manipulated, that's still on him because he's letting it happen.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "-Akos-",
                                    "body": "Oh for sure he’s responsible and certainly loves taking credit for his actions, but he did not come up with this.",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "B19F00T",
                            "body": "Everything has been for project 2025, don't let anyone forget it. You can look at the p2025 tracker it's at almost 40% as of this morning. In a little over one month. This list of objectives for dismantling the government that we found out about and warned people about that everyone else said wasn't real or wouldn't happen or \"trump said (lied) he doesn't know the heritage foundation people\" blah blah, is fucking real and is exactly what we warned was going to happen. And yet people voted trump or didn't vote bc Kamala wasn't perfect or some \"both sides\" bullshit. Don't let anyone forget this was preventable.",
                            "score": 67,
                            "replies": [
                                {
                                    "author": "JimBeam823",
                                    "body": "Project 2025 has gotten a lot of what they want with dismantling the Administrative state, some of what they want with social issues, and very little of what they want with foreign policy.\n\nTrump himself doesn't read and doesn't care about policy. He just so happens to agree with Project 2025 on dismantling the Administrative state, and so does Elon Musk. \n\nTrump and Musk, however, aren't patient enough and don't have the legal background to wait on all the appeals to go through, which puts the entire strategy at risk.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "rabidstoat",
                                    "body": "Tracker: https://www.project2025.observer/",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Squirll",
                            "body": "Trump was the keystone enabler of all this. None of this would have been possible without him being the frontman for the mobs in his cult.\n\n\nYes hes not dumb enough to mastermind this but he was absolutely the crucial component that made it possible.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "bigalcapone22",
                                    "body": "Trump and Vance will be the only two that can not be held criminally accountable when this all goes south as they both get immunity protection.\nMusk and the others will not be so lucky if this, so far, a bloodless coup fails.\nBut severe damage will be done and take decades to come back from, if ever at all.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GeronimoJak",
                    "body": "He breaks it every hour of every day. This is 'normal'.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "logcabincook",
                    "body": "I hesitate to call it a \"government\"",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "oakfan52",
                    "body": "CA did same thing to state employees. Total\nShit show.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ShadowStarX",
                    "body": "Andrew Jackson and Herbert Hoover were worse.\n\nBut that's a low bar.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HackeySadSack",
            "body": "The US is being systematically destroyed.",
            "score": 548,
            "replies": [
                {
                    "author": "IAMA_Plumber-AMA",
                    "body": "And 2/3rds of people either voted for this, or didn't vote against it. Hope they're happy.",
                    "score": 214,
                    "replies": [
                        {
                            "author": "Voodoocookie",
                            "body": "Seeing how large his support base is still, I have no doubt they are.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "Soxel",
                                    "body": "I don’t think they’re necessarily happy with the changes, because they’re definitely being effected like everyone else, I just think they’re happy *the other side is so mad*. They’re fine to put up with anything bad that happens and just blame everyone but the person causing the issues. ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SnooChocolates2068",
                    "body": "Soon we’re going to have the Free States and NUSA",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hrekires",
            "body": "Because it was never about getting them back into the office, they hoped that people would quit instead.\n\nAnd of course, some unlucky few relocated to comply with the RTO order and then got fired anyways after spending all that money to move.",
            "score": 490,
            "replies": []
        },
        {
            "author": "Elorme",
            "body": "The only reason I can think of why the cheeto and the nazi wanna be are doing this is they hate the country and are trying to fuck it all up or outright destroy it. Make a stupid uninformed decision, wait for chaos, then go just kidding -see I'm not such a bad guy while only undoing a part of what they fucked around with.",
            "score": 741,
            "replies": [
                {
                    "author": "JimBeam823",
                    "body": "Elon and the tech bros want to loot the country. Contrary to right wing myth, federal workers are usually pretty good workers, and the private sector wants them.\n\nI expect that many of them will be hired to do the exact same jobs as federal contractors, but at a much higher cost to the taxpayers.\n\nElon also wants to take the opportunity to dismantle agencies that are either investigating his companies or he just doesn't like.\n\nProject 2025 has a long standing policy beef with \"independent agencies\", which are executive branch agencies that are not under control of the President. They have been chipping away at cases like *Humphrey's Executor* for years and believe that now is the time to challenge them based on the current makeup of the court. To challenge these laws, the President must deliberately break the law to get a test case.\n\nTrump likes this approach because it means he has more power.\n\nTrump voters don't really understand any of this, but are mostly voting on Culture War issues. Many are voting for a mythical Trump that exists only in their mind. 77 million people voted for 77 million different versions of Donald Trump to be President.",
                    "score": 451,
                    "replies": [
                        {
                            "author": "TzarKazm",
                            "body": "I work for the federal government. A bunch of people who took the buyout went straight to work for contractors doing the same job for more money. AND they continue to get paid their old salary until October. \n\nDOGE should put that on their wall of receipts.",
                            "score": 184,
                            "replies": [
                                {
                                    "author": "ERedfieldh",
                                    "body": "\"Yea but I'm not paying for it!\"\n\nYes, yes you are....you just don't realize it.",
                                    "score": 33,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CaptainKoconut",
                            "body": "Yes, all my in-laws have read that they \"ended DEI\" and are \"reducing government waste\" and they're happy as hell with what's happening.",
                            "score": 78,
                            "replies": [
                                {
                                    "author": "JimBeam823",
                                    "body": "It's a hell of a PR campaign. \n\nActually auditing the government and making it efficient is slow and boring. Clinton did it and he did it well. But Elon and Trump want the show, not the results.",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "author": "CaptainKoconut",
                                            "body": "They live in the Fox News bubble and just repeat the \"we were paying for condoms in Gaza\" line instead of reading anything about how gutting the EPA and FDA is bad for everyone who breathes, drinks, and eats, how gutting the IRS will allow the wealthy to cheat more taxes, and how shutting down the CFPB will allow companies to screw over consumers more.",
                                            "score": 18,
                                            "replies": []
                                        },
                                        {
                                            "author": "gmishaolem",
                                            "body": "> Clinton did it and he did it well. \n\nAnd he was the first Third Way Democrat to reach high office and we've had an endless stream of them ever since. American politics continues to ratchet to the right without stopping, and every time you praise something Democrats have managed to do, it's just whatever they accomplish before the next ratchet click.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JimBeam823",
                                                    "body": "Remember that the three Democrats before Clinton lost in landslides.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "PizzaSounder",
                                    "body": "Ask them how much they expect to get back in taxes as a result of all this \"reduced waste\"? As they answer, stop them with an ol' \"Not so fast my friend!\" *\n\n* Does not apply to the Top 1%",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "CaptainKoconut",
                                            "body": "No they actually believe they're going to get thousands of dollars back in a rebate check or some shit.",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Just_a_follower",
                            "body": "They didn’t take the routers because they wanted the routers. They took the routers to clean their tracks.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "B19F00T",
                    "body": "It's all spelled out in project 2025. This was the plan the whole time",
                    "score": 142,
                    "replies": [
                        {
                            "author": "Elorme",
                            "body": "I never read it.",
                            "score": -73,
                            "replies": [
                                {
                                    "author": "B19F00T",
                                    "body": "Well, now you know about it and can look it up. There's a website that tracks their progress with it",
                                    "score": 78,
                                    "replies": []
                                },
                                {
                                    "author": "drmanhattanmar",
                                    "body": "www.project2025.observer",
                                    "score": 37,
                                    "replies": []
                                },
                                {
                                    "author": "lordsofcreation",
                                    "body": "Don't worry, you'll get to live it instead",
                                    "score": 38,
                                    "replies": []
                                },
                                {
                                    "author": "Vegaprime",
                                    "body": "Everyone fired is to replaced by the faithful.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "WhatLikeAPuma751",
                                    "body": "That’s because the annoying orange can’t read",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "start_select",
                    "body": "They are trying to create an emergency that “only they can fix”.  They will break everything then assume permanent power.\n\nLearn about Curtis Yarvin, and how much JD Vance and Musk worship him, and you will realize how much danger we are actually in.\n\nThe chaos is the plan.  The plan is to break democracy.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Particular-County277",
                            "body": "One question you must always ask when anything whatsoever happens: Does Putin benefit from this?",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Popular_Prescription",
                    "body": "Trump is just pissed he lost the last election so he’s burning it down",
                    "score": 33,
                    "replies": [
                        {
                            "author": "Freshandcleanclean",
                            "body": "And republicans are more than happy to help him",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tofubeanz420",
                    "body": "The are destroying the govt so corporations can come in a privatize everything. US budget $5T and corpos want a bigger piece of the pie.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "pds6502",
                            "body": "Those corpos will then be able to claim tax deduction or exemption for doing government work.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "niney-niney-kitten",
                    "body": "They know they can't fire 100% of the workforce just yet.  So they fire a bunch, make the life of those who remain miserable.  They find a new job and the government never fills the position.  Then they can just close that department.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "ScienceLion",
                    "body": "like top comment, looting the country. Imagine a grocery story that restocks weekly and maintaining 50% stock minimum. But what Trump is doing is selling all the inventory, down to 0, and not ordering more supplies. Wow, look at all the money we made. Who cares what happens when we have no infrastructure, no allies, no goodwill, that's the next guys problem. I made the line go up, and gave myself a bonus. Whoopdiedoo.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "StarWars_and_SNL",
                    "body": "The more he makes people suffer, the more they’ll protest, and the closer he gets to his ultimate dream of martial law.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Megalo85",
                    "body": "Fuck up the economy buy everything at a discount.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Skippypal",
                    "body": "No, what they’ve realized in a real big picture is that countries are like stock investments themselves. Their price can be manipulated for profit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tatoon83",
                    "body": "They work for Russia. As soon as you realize that, their actions become quite consistent and rational.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "upfromashes",
            "body": "That was the plan. Planned, chaotic failure.",
            "score": 135,
            "replies": [
                {
                    "author": "Hiraeth1968",
                    "body": "Yep. Then privatize everything, reap unimaginable profits, and leave the country in ruins.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "upfromashes",
                            "body": "And then do that in the rest of the world as economies slide into the smoking, American crater.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "ChiefBroady",
                            "body": "Just wait for it, musk is gonna rent out fully furnished office spaces for federal workers…",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pds6502",
                    "body": "Then privatize everything, all the while those private companies get business tax deductions for doing government (i.e., public service) work.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "upfromashes",
                            "body": "Yes, indeed. \"No money shall change hands, without that my rich cronies get a cut... NO PUBLIC GOODS!\"\n\nPrivatization is theft.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NetZeroSun",
            "body": "Sorry not sorry for firing you, can you return to work? Someone told us your essential.\n\nBy the way, you don't have a desk, wifi or any lighting. Just sit down and get to work.\n\nAlso can you send an email on what you did this week? Department of Government Efficiency.",
            "score": 53,
            "replies": []
        },
        {
            "author": "TzarKazm",
            "body": "I'm a federal employee and we had no internet for three days. Everyone basically sat around talking. On the third day they did authorize telework at like 930 or so.",
            "score": 53,
            "replies": []
        },
        {
            "author": "Clovis42",
            "body": "\"Millions of federal workers were ordered to return to offices across the country in recent weeks, marking an end to Covid-era rules allowing more flexibility to work from home.\"\n\nThis keeps getting repeated by media and it drives me crazy. Telework and remote work existed several years *before* COVID.\n\nWhat changed was that workers were told that huge swathes of work were impossible to do from home. Magically, after COVID shut  everything down, they figured out a way to do it for many more jobs.\n\nThe idea that this was a special rule for COVID is just a Republican talking point. So, no real shock for CNN, but infuriating how often it is repeated.",
            "score": 45,
            "replies": [
                {
                    "author": "Wulfkat",
                    "body": "The banks are using the exact same line - “you have to RTO but we’re hybrid so you only have to come in 3 days a week. Aren’t we awesome? No one’s ever done this before.”\n\nFunnily enough, they were 3/2 hybrid back in 2016…and they smugly lie to your face while the C Suites WFH every single day.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "laurajodonnell",
                    "body": "Yup. My first job out of college was working for an agency and it was 100% remote work. That was back in 2015. COVID did not invent remote work.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Heliocentrist",
            "body": "it's like Musk and Trump don't know what the fuck they're doing, who could have guessed?",
            "score": 77,
            "replies": [
                {
                    "author": "Rhewin",
                    "body": "Nah, this is what Musk did at Twitter. He’s making it exhausting for people to hang on so they’ll quit. If you fire them, you have to lay severance. Not if they quit.",
                    "score": 61,
                    "replies": [
                        {
                            "author": "pds6502",
                            "body": "What a typo, getting lay'd for severance, wow.",
                            "score": -6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "daugherd",
            "body": "Lol. I have a former customer that required return to office but they didn’t have enough space for everyone so they instructed everyone to commute in, beep their badge then go home to work if there wasn’t desk space. They did this so they could report up that people are following the RTO policy. So fucking stupid.",
            "score": 34,
            "replies": [
                {
                    "author": "pds6502",
                    "body": "And that is called efficient.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "ScienceLion",
                    "body": "Lmao, sounds like an episode from Chernobyl. Sure, let's use this radiation detector that only goes up to 1/100 of what needs to be checked because that's the only thing we have on hand.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "expectantmermaid",
            "body": "https://archive.ph/ap6jK\n\nHere's the archived article that bypasses CNN's subscription prompt.  It seems to be the only way I can read their articles anymore.  \n\nEarlier there was a headline about a deadly storm affecting the East Coast, but you aren't allowed to read it without subscription.  Cool.",
            "score": 59,
            "replies": []
        },
        {
            "author": "ivedrownedppl4less",
            "body": "Waiting for my seating assignment for my office.  I've been told we have 56 assigned to the building and 16 desks. Should be an interesting week next week.",
            "score": 19,
            "replies": [
                {
                    "author": "AlexRox",
                    "body": "Bring a camping folding chair and chill",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "LoserxBaby",
            "body": "They’re really hammering home the whole “the cruelty is the point” mantra when they force workers back to an office where the workers can’t be the slightest bit productive in",
            "score": 18,
            "replies": []
        },
        {
            "author": "s9oons",
            "body": "trump parroting musk: 😤 why didn’t you scum get anything done this week! Fired!",
            "score": 41,
            "replies": [
                {
                    "author": "PeelThePaint",
                    "body": "Parroting musk? \"You're fired!\" was literally Donnie's catchphrase.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stu_Pididiot",
            "body": "A couple months ago they took all our phones because we were teleworking. Now we're back in the office so they have to buy us new phones and headsets. Efficiency!!!",
            "score": 29,
            "replies": []
        },
        {
            "author": "ABeaverhousen314",
            "body": "I wonder if it would have saved money to let people WFH, renegotiate leases for less space, or dispose of the asset. I am going to think, better than what's happening.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Bogdans-Eyebrows",
            "body": "Toddlers make stupid impulsive decisions. They just do.",
            "score": 13,
            "replies": []
        },
        {
            "author": "josh-ig",
            "body": "Just wait, they’ll claim they’re getting nothing done as a reason to fire them.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Alantsu",
            "body": "Culture politics has no forethought.",
            "score": 16,
            "replies": []
        },
        {
            "author": "metalsnake27",
            "body": "Wow, what a surprise. \n\nAlmost like we didn't have the capacity to suddenly do this IN THE SPAN OF 2 WEEKS.\n\nBut y'know, All is fine.",
            "score": 9,
            "replies": []
        },
        {
            "author": "madlabdog",
            "body": "US directly jumping to 4th world country",
            "score": 9,
            "replies": []
        },
        {
            "author": "news_feed_me",
            "body": "It was incompetence. They care about being able to say they did something, they don't care how it gets done.",
            "score": 8,
            "replies": []
        },
        {
            "author": "bokodasu",
            "body": "The contract where the union agreed to move to the building we got moved to had a clause that our parking had to be paid for, since everyone was moving from buildings with free parking. Well, that building was built out to house 20% of the workforce on any given day because everyone had 3-4 days of telework precovid, so it should be fine, right? \n\nSo because everyone has to be in all at once, suddenly there's not enough free parking. Solution? Take away ALL the parking. No parking at all. Breach of contract met with shrugs. Serious shitshow.",
            "score": 8,
            "replies": []
        },
        {
            "author": "PommesMayo",
            "body": "Doesn’t scream efficiency if you ask me but then again I’m not a billionaire on ketamine",
            "score": 8,
            "replies": []
        },
        {
            "author": "BloombergSmells",
            "body": "Wouldn't it have been smarter to just embrace remote and sell the buildings?",
            "score": 9,
            "replies": []
        },
        {
            "author": "scionvriver",
            "body": "Reading this article feels like they\n1) Weren't actually ready for people to come back to work in office space, because they themselves don't actually work they just point and say make it happen \n2) Want people to quit and make their lives as miserable as possible. \n\nThey've totally FUCKED the job market making it a shit load harder to find a job when it was already difficult because so many resumes are being filtered the same way health insurance companies filter patient care, with shitty Ai that basically dump the shit in a trashcan. They either have know idea what they're doing or they know exactly what they're doing and literally ruining people's lives because they're rich and don't care about anything but stroking their egos...and pockets",
            "score": 6,
            "replies": []
        },
        {
            "author": "I_love_Hobbes",
            "body": "Thousands of feds will be doing nothing and getting paid with no infrastructure.  But God forbid they actually work from home.",
            "score": 6,
            "replies": []
        },
        {
            "author": "johnsolomon",
            "body": "This is such a shitshow",
            "score": 6,
            "replies": []
        },
        {
            "author": "shapeofthings",
            "body": "How to destroy efficient government.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Old_Management_1997",
            "body": "Not surprising, these are the same people that held a press conferences in front of the four seasons landscaping company.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Wishilikedhugs",
            "body": "My brother works at a satellite location of NASA Goddard in Maryland. They had just gotten rid of some property since so many work remotely. Now they don't have the room and they don't have the budget to get the room. And the traffic outside DC is even worse now because of everyone having to go in. It's stupid AF",
            "score": 5,
            "replies": []
        },
        {
            "author": "Spsurgeon",
            "body": "Could Russia be destroying the USA.... From the inside??",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kopman",
            "body": "We're essentially operating just like the maoist communist government that Republicans hate so much.\n\nCentral planning failures all around. Trump tells the reservoir in California to empty water, why? I have no idea. So they do it and then risk not having enough next growing season. \n\nFire employees then realizes maybe we need them, tries to rehire them, got rid of their stuff in the meantime? \n\nThis is why communism didn't work guys. Let's not repeat it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ihazmaumeow",
            "body": "Sounds a lot like my current workplace after forcing RTO with less than a week's notice",
            "score": 3,
            "replies": []
        },
        {
            "author": "ajn63",
            "body": "Basically what we have is a prime example of a dysfunctional government where one side has no idea what the other side is doing. One is demanding everyone return to office, while the other is terminating office leases. Pathetic!",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheDwarvenGuy",
            "body": "What do you do at that point? Play duck duck goose?",
            "score": 3,
            "replies": []
        },
        {
            "author": "jlaine",
            "body": "I'm sure the responsible facilities management team went through spinning a bunch of the spaces down, and/or repurposed them for other things. That's what you do when you are looking to conserve money.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Val32601",
            "body": "Nothing driving in to the office only to stand around and accomplish nothing all day when you could have gotten work done easily at home.",
            "score": 5,
            "replies": []
        },
        {
            "author": "The_Starving_Autist",
            "body": "that'll make it easier to fire everyone for poor performance",
            "score": 2,
            "replies": []
        },
        {
            "author": "Trajan_pt",
            "body": "Apartheid Elon strikes again",
            "score": 2,
            "replies": []
        },
        {
            "author": "Minty-licious",
            "body": "Must be the result of 105 lawsuites filed against these idiots in the 35 days so far",
            "score": 2,
            "replies": []
        },
        {
            "author": "MovieGuyMike",
            "body": "That doesn’t seem very efficient.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Eye_foran_Eye",
            "body": "If they sell all the buildings, where will they return to?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Due_Night414",
            "body": "And when they can’t send out the weekly “what did you do this week?” email to Elmo, they’ll lose their jobs again?",
            "score": 2,
            "replies": []
        },
        {
            "author": "octahexxer",
            "body": "Might wanna look for another job",
            "score": 2,
            "replies": []
        },
        {
            "author": "fre-ddo",
            "body": "Cut costs by spending more on power and rent on the offices.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ASayWhat36",
            "body": "No clean water. No heat.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fenikz13",
            "body": "Met a girl at a concert and she said they don’t even have enough computers for everyone now, people showing up to the office for no reason",
            "score": 2,
            "replies": []
        },
        {
            "author": "External_Screen8164",
            "body": "Doesn't sound very efficient \n\nMaybe a government department should step in and stream line everything",
            "score": 2,
            "replies": []
        },
        {
            "author": "gmikoner",
            "body": "Idk if I were a foreign power with interest in attacking the United States... Somewhere around Now would be the time. When Everything is in shambles and everyone is confused.",
            "score": 2,
            "replies": [
                {
                    "author": "CapnDunsel",
                    "body": "Almost as if that were the plan…putin’s cock holster setting up the country for disaster",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ptcounterpt",
            "body": "Clusterfuck. Just like the last Trump admin. People have such short memories these days!",
            "score": 1,
            "replies": []
        },
        {
            "author": "dan1101",
            "body": "Journalists, follow the money.  Who removed the desks, wifi, and lights and who hired them?  Where did the items go, landfill or were they sold?  Who got the money?",
            "score": 3,
            "replies": [
                {
                    "author": "nerfedname",
                    "body": "There is nothing nefarious about this situation.  The telework act was signed in 2010 and since then the federal government has been trying to spin down physical presence, increase WFH, reduce facility costs, etc., etc.  \n\nThe chairs and desks are excessed and either moved to where they’re needed or sold at auction, etc.  the GSA sells the lease to the buildings, etc. \n\nThe problem is that 15 years of work to increase WFH and downsize the physical footprint of the federal government was undone in a matter of weeks by royal decree.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "dan1101",
                            "body": "Ah I'm mixing stories up.  I thought this was something where they fired the workers, sold the equipment, then hired them back again without equipment.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "notyomamasusername",
                    "body": "That sounds like work... Let's just publish some more of Trump's tweets and air a talking head to explain what he really meant.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VenoBot",
            "body": "Minimizing governmental waste people. Get that down on the books!\n\nYeah alright make me King cause I can lead better than these muppets",
            "score": 2,
            "replies": []
        },
        {
            "author": "WeirdSysAdmin",
            "body": "It would be funny to me if workers comp cases outpaced the benefits of WFH.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious-Leave3756",
            "body": "Comeback comeback!  Put up the carpet and sit on the floor while we wait.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blofish1",
            "body": "Sounds super-effecient",
            "score": 1,
            "replies": []
        },
        {
            "author": "robutt992",
            "body": "Sells off government building. Says ok get back to work..",
            "score": 1,
            "replies": []
        },
        {
            "author": "ishmel43",
            "body": "All in the name of efficiency...",
            "score": 1,
            "replies": []
        },
        {
            "author": "bugged16",
            "body": "What? The fucking morons didn’t have a plan, they didn’t know what the fuck they were doing? Why the fuck do so many people defend this bullshit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "crailface",
            "body": "wow just chalking up wins",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThinNeighborhood2276",
            "body": "That's incredibly disruptive. How are they expected to work effectively under those conditions?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elephanogram",
            "body": "Governments forcing people back to the office without anything actually beneficial or there in the office is nothing new. Seems like this is the one thing the Canadian and American government can agree on. At itrstoly force workers back into the office so they can be on cloud based apps all day",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beginning_Victory_48",
            "body": "In less than a month they had already dismantled the offices? What a huge waste of money. Clearly the issue is not about government waste. Smoke screens while they rob everything.",
            "score": 0,
            "replies": []
        },
        {
            "author": "awolaac",
            "body": "Question is where did the supplies go? Who sold them off and pocketed the cash? Seems like a red flag probably part of musks grift.",
            "score": -2,
            "replies": []
        },
        {
            "author": "TheRoofer412",
            "body": "Wow.... imagine crying about having a government job..... 😳",
            "score": -1,
            "replies": []
        },
        {
            "author": "brickiex2",
            "body": "Where did the desks go?...and the lights?...and all the wifi gear?....surely they didn't strip fluorescent lights out of office spaces. I can't imagine getting wifi up and running isn't much more than 3 days work...I mean if the routers and other gear is there, power it all up, check some connections and settings..update some software and passwords...(I have zero knowledge of how wifi works in a large office but it is not like you have you have to run miles of cable etc)",
            "score": -15,
            "replies": [
                {
                    "author": "edgarapplepoe",
                    "body": "I don't understand...what do you mean where did they go? They weren't there because they weren't being used. The government didn't send people home for the last 15 years and keep their offices and equipment for everyone. They likely sold off what they didn't use, stopped leasing as much space, didn't install replacement or new equipment since there wasn't a need to, didn't maintain stuff no linger used, don't have a full IT team on-site, etc. \n\nAlso, setting up a network in this setting much harder than you are describing. You would need to analysis the node placement, run cables to each one, set up the backend infrastructure (switches, panels, backups, servers ,etc). This isn't a home where you just have a single router and a few laptops doing light work.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "JcbAzPx",
                    "body": "I would imagine some buildings had been at least partially shut down if all the workers were remote.  No need for lights or wifi if everyone is remoting into a server at another location.  Also, if they shut off the internet, I can tell you from experience it can take weeks to get it turned back on.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "brickiex2",
                            "body": "gotcha on the wifi, but lights and desks?",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "NotUniqueOrSpecial",
                                    "body": "They have been ordered back to offices that don't have enough space, because the offices have been downsized as people are working remotely.\n\nIt's not complicated and it's literally in the article.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "crispyexcal",
            "body": "Good they were getting complacent.",
            "score": -7,
            "replies": []
        },
        {
            "author": "Adventurous-Depth984",
            "body": "Where did the desks go?",
            "score": -9,
            "replies": []
        },
        {
            "author": "WideElderberry5262",
            "body": "It shows how incompetent the government employees are. Do you expect DOGE to arrange that or the office manager of that division to arrange that? I heard enough stories that some government employees doing side job while fully remote working from home. They never need to worry being fired due to the performance issue. Down vote as you wish and I don’t give a damn.",
            "score": -67,
            "replies": [
                {
                    "author": "EldariWarmonger",
                    "body": "Fuck you're a whole different kind of dumb aren't you?",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "Spaceman2901",
                    "body": "If I’m ordered to report to a worksite with immediate effect, I most certainly expect that the office issuing that directive ensure that conditions are such that I can work. Which means telling the agency I’m reporting to to have stuff ready before I get there. It’s not on me to make sure the power’s on or that the Internet is working.\n\nThat’s what was missing. RTO with immediate effect should have been preceded by a month or two notice to the agencies to prep.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "gluttonfortorment",
                    "body": "So DOGE cuts randomly, without thought or planning, and frequently fucks up so bad they have to try and rehire the people they fired, but it's everyone else's fault when the service they cut off aren't working correctly.\n\nGod, it must be so fucking nice to be dumb enough to always believe yourself to be right no matter how much your chosen gods fuck up. Imagine crying about downvotes for being a stupid motherfucker in public.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "ChiefBroady",
                            "body": "Sometimes I wish I was as dumb as those fuckers and just live my life in blissful ignorance.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Stu_Pididiot",
                    "body": "Have you ever worked somewhere? Were you required to furnish your own equipment? I'm not sure what your point is other than parroting long debunked maga talking points.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "gwizonedam",
                    "body": "Yep. Every office job I’ve ever had has made me go to Office Depot, buy a computer, buy a desk, chair, cubicle walls, and sign up for my own internet and sometimes wire my own lighting system! \n\nDamn incompetent employees enjoying all the sweet, sweet, waste!",
                    "score": 9,
                    "replies": []
                }
            ]
        }
    ]
}