{
    "title": "Anyone else do this?",
    "author": "puddinshoe",
    "subreddit": "stopdrinking",
    "rank": 306,
    "score": 116,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 59,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2kewg/anyone_else_do_this/",
    "id": "1j2kewg",
    "selftext": "I cooked some steaks last night and drank an Athletic Hazy IPA while I was grilling.  Ended up drinking another one with dinner and that was it.  I had 2 NA beers last night with zero desire to have any more.  I wish I could've done that with regular beers!  I would be basically a \"normal\" drinker if I could just enjoy 2 beers and call it a day.  But I know I can't do that for some reason.\n\nAnyone else out there able to drink a couple of NAs and that's it, or am I just weird?  \n\nIWNDWYT!",
    "comments": [
        {
            "author": "Soberdot",
            "body": "I’ve gotten better with NA beer recently. When I first dabbled in them I 100% drank them with my alcoholic filter on— a 6 pack would last a night. Recently I’ve been able to have 1 or 2 and then call it at that.\n\nI even went to a bar for the first time since recovery and had a few Guinness Zeros and then just went home. During active addiction I would’ve stopped at a bottle shop and grappled a 12pk to keep the party going at home.\n\nIt was really nice.",
            "score": 47,
            "replies": [
                {
                    "author": "brandon0297",
                    "body": "How are those Guinness? I hear they're pretty damn good but haven't snagged a pack yet",
                    "score": 11,
                    "replies": [
                        {
                            "author": "The_Other_Alexa",
                            "body": "There’s surprisingly good. Sometimes I think I might have forgotten what real beer actually tasted like, but to me, they taste just like Guinness did in my brain. The Heineken zeros are like that too, but tasting like a Heineken would never be a selling point for me lol",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "puddinshoe",
                                    "body": "I agree about the Guinness, it's very good.  It would be difficult for me to tell the difference between a genuine one and the NA version.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "SauerkrautHedonists",
                                    "body": "🤣 heard!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SyrupUnlikely4032",
                            "body": "I love the Guinness! It's voodoo to me that it tastes so good. If I had to be picky its slightly \"thinner\" than the original but the flavour is bang on. I always opt for that at the pub if it's available.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Octothorpe17",
                            "body": "they’re one of the best NA beers, I work at a liquor store and I’ve tried pretty much all of the NA stuff, the guiness, corona, athletic, and heineken are great at mirroring their alcoholic counterparts, brew dog is alright too. if you’re interested in branching out to other stuff töst is a great sparkling wine alternative and odd bird makes by far the best NA wines. It’s cool to see how the shift is happening towards NA stuff and how much higher the quality has gotten. thc beverages and hop water also scratch the itch for many people",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Historical-Tap-8506",
                                    "body": "Thanks for the tip about odd bird",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Octothorpe17",
                                            "body": "they use a really cool different process for dealcoholizing the wine, it’s expensive but it is totally worth it",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Soberdot",
                            "body": "Fantastic! My bar buddy was drinking regular Guinness and did a side-by-side, he said the NA was slightly sweeter but pretty damn close.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "supersonicdutch",
                    "body": "First time with n/a’s was the beach. They went down great due to the heat and I put them away, but not like regular beer at all. Didn’t miss the alcohol part.\n\nBack home, it felt off. I’d pull one out and get 1/2 a can down and I didn’t want it. Not bc of the zero alcohol, I just would have preferred my homemade iced tea (that my wife says I drink too much of. Guilty). I’d finish a six pack of athletic hazy ipa in two weeks. Not because I wanted them. I wanted them gone. I had to ask my wife to stop getting them if she went to the store without me. She was getting them bc she was worried I’d start back drinking if I didn’t have the n/an option.I guess the time at the beach really left an impression on her.\n\nI’m not sure if I’ll get the n/a’s at the beach this year. I definitely like the flavors on a hot day but it’s so nice not being attached to the cooler or constantly having a can in my hand or going back to the store for more. \n\nNow I have to tackle this ice cream problem. It’s always something, I guess.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "SauerkrautHedonists",
                            "body": "SAME on the ice cream problem.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "andiblakey",
                    "body": "When I was 100 days sober I was asked to be a witness at a wedding in Perth at the registry, just the four of us, followed by a little reception at Dirty Nelly's, a nice Irish pub. I ordered a na Guiness and it was so good. It got me through my first real hurdle. 165 days today! I still enjoy na beers sometimes even though I was a 2 litres of wine a night girl.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Soberdot",
                            "body": "Heck yeah! That’s amazing. Congrats on the 165– proud of you!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "andiblakey",
                                    "body": "Thank you so much!! That means a lot. \nI'm proud of you too🫶",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professional_Oil_520",
            "body": "I mean when you think about it, it’s weird that we sit and drink 6 of anything. Imagine drinking 6 pints of Pepsi or even 6 pints of water at a time?",
            "score": 20,
            "replies": [
                {
                    "author": "Sundayjo",
                    "body": "Yes! I always think this. I used to drink a bottle of wine a night. I can’t imagine drinking an entire bottle of grape juice.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "lilsimmer17",
            "body": "I also only have 1 or 2 NA beers and I'm good! I literally had those same thoughts as you just last night. I was like wow if I would've been satisfied with just two regular beers, I could've been normal LOL. But I find myself being satisfied with NA beers! It crushes my craving and I have yet to feel like I'm missing out because I can't have a \"beer.\" You're amazing! Keep it up.\n\nIWNDWYT!",
            "score": 11,
            "replies": []
        },
        {
            "author": "beetlegeuse87",
            "body": "I’m a month sober now but my not quite there yet. On my days off I would usually start drinking as soon as I had finished whatever errands I had to run and was gonna be at the house for the rest of the day. Sometimes Id start at 9-10am. Yesterday I picked up a six pack of Stella 0.0 on my way home and ended up drinking the whole thing while puttering around the house and yard. Didn’t get drunk obviously (thank God) and it kept me from going up to the bar but not exactly proud of myself for pounding down a six pack of NA a month into getting sober. Anything to stay away from the bar I guess 🤷‍♂️",
            "score": 9,
            "replies": [
                {
                    "author": "invisiblefigleaf",
                    "body": "Why do you feel bad about drinking a six pack of NA? Sounds like a healthy alternative to me! ",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_Other_Alexa",
            "body": "I love that they have such good NA options now, when I first stopped drinking it felt like it was all odouls and malt stuff, blech. I love the taste of hops, and enjoy NA beers same way. When athletic came out it was so exciting.\n\nMakes me happy that I can still make a michelada and have the ritual of a beverage without the booze. It was a nice way to not feel left out at parties when I still needed something in my hand. \n\nIt’s definitely does crack me up to watch myself have just one beer or just one glass of an NA wine (aka fancy ass grape juice), when for so long “just one” was not an option for me. Definitely a data point to show what part of the beer wasn’t working for me…the booze!",
            "score": 6,
            "replies": []
        },
        {
            "author": "pinsandsuch",
            "body": "It’s funny, with the Athletic beer I’m always cost conscious, so I limit myself to 1-2 a day. I never was concerned about cost when I was drinking regular IPAs.",
            "score": 6,
            "replies": []
        },
        {
            "author": "cjs0216",
            "body": "I’m staying away from NA stuff this time around. I’m too worried it’ll lead me to justifying the real stuff. There are 1000 other drinks I could have that won’t do that. I wish you all the luck with it.",
            "score": 11,
            "replies": [
                {
                    "author": "chirpchirp13",
                    "body": "I’m in the same boat. Tried it a few times and same result. Cant say it was THE factor but it didn’t help me personally. Soda water and lime gives me the placebo of holding a drink and a bit of throat burn. But hey! Whatever works for folks",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "i__hate__stairs",
                    "body": "Yeah, I would be blackout drunk within the hour.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sloth-TheSlothful",
            "body": "When i crack open a NA, it lasts 2+ hours and sometimes I don't even finish it. Now I know how most people drink alcohol",
            "score": 4,
            "replies": []
        },
        {
            "author": "b3ta_blocker",
            "body": "I've had a 4 pack of NA beers unopened for 6 months. Funny that!",
            "score": 5,
            "replies": []
        },
        {
            "author": "kylew1985",
            "body": "I love my fake beers. I drink NA's the way I thought I drank real ones. I can say \"a couple\" and genuinely mean two.",
            "score": 6,
            "replies": []
        },
        {
            "author": "AbiesFeisty5115",
            "body": "Totally normal. You’re full. It’s adding the alcohol  that makes it hard for me to just drink 1 or 2. Different beast entirely. 🤷‍♂️\n\nIWNDWYT…",
            "score": 5,
            "replies": []
        },
        {
            "author": "Lucky_Best_Wash",
            "body": "I have been doing the same.  I get full after 2 NA beers - and the \"some reason\" you and I can do it with NA beers but not real beer is because there is no addiction monkey inside the NA beer banging on your brain to drink 5 more even though you're full after 2.",
            "score": 4,
            "replies": [
                {
                    "author": "puddinshoe",
                    "body": "Absolutely!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Equivalent-Weight688",
            "body": "I’m the same, I might have 4 if I’m at a football game party or something that lasts a while. 1-2 on a normal night is plenty though.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Shilooooooooooooooo",
            "body": "Oh yeah. 1 or 2 in a night and I switch back to my sparkling water after that",
            "score": 5,
            "replies": []
        },
        {
            "author": "jetlaged",
            "body": "Same boat. I drink 1 or 2 Athletics and I'm good. Sometimes 1 is all I need. Wish I could have done the same with real beer.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SyrupUnlikely4032",
            "body": "Yep, it's the alcohol that makes you want more alcohol I suppose.\n\nI have 1 or 2 NA and I'm happy with that, even if I neck the first one I'm good! I actually had 4 corona 0.0 in the beer garden the other day, purely because someone bought me two more in the round and honestly, I just felt bloated after lol.\n\nI'm on the pink grapefruit juice tonight though 😎",
            "score": 4,
            "replies": []
        },
        {
            "author": "dljohnsonld",
            "body": "I noticed the same thing recently. It took me like 30 minutes or more to drink an NA beer and my wife got up to go to the kitchen for something and asked if I wanted another. I replied 'No, thanks! I'm good with just one'. Then I was like wooooah I could have never done that with regular beers.",
            "score": 5,
            "replies": []
        },
        {
            "author": "chowderTV",
            "body": "Yeah, I basically drink 2 or 3 and call it good.\nI was able to do that with regular beer too, but I also had the tendency to drink more.\n\nMe and my brother would always say, “2 beers and you’re good, 3 beers? Might as well be a 12 pack.” \n\nAnd boy does that ring true to this day.",
            "score": 5,
            "replies": []
        },
        {
            "author": "electricmayhem5000",
            "body": "I am with you. There are certain situations where I enjoyed the act of having a beer or two. Grilling, watching a game, out with friends. With real alcohol, I could rarely pull that off. But I get what I'm looking for with NA beer. So I call that a win.",
            "score": 7,
            "replies": []
        },
        {
            "author": "marittza_",
            "body": "I love NAs for the sole reason I’m able to just have one or two. It scratches that itch but I’m never tempted to have more than a couple.",
            "score": 3,
            "replies": []
        },
        {
            "author": "cheesy-biscuit",
            "body": "I love NA beer! A case in my house without going to any social outings easily lasts 2 weeks. I went to hang out with friends Saturday night (usually I would’ve already had a few beers and wouldn’t even have been able to drive there) and brought 4-5 NA beers so that I could have a drink with everyone else and it was great. Left at 9pm and drove home sober! My favorite is Heineken 0.0.",
            "score": 3,
            "replies": [
                {
                    "author": "puddinshoe",
                    "body": "I really like the Heineken 0.0 too, which is odd because I've never cared for regular Heineken!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SauerkrautHedonists",
            "body": "Yum yum yum! I was completely confused about the point of NA beverages, until I started my sober journey in October, and damn if that NA beer doesn’t just scratch that itch?! I just recently tried NA Budweiser and now I have something to drink while I crack my peanuts in a shell. 💗",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wolf_E_13",
            "body": "Yeah...an NA beer isn't giving you the rush of dopamine that alcohol gives you. When we drink alcohol, we not only get the buzz of inebriation, but a dopamine rush as well and you have to keep drinking to maintain that same level or more of the dopamine rush. With an NA beer you're getting about the same dopamine hit that you would get with a soda...probably less actually if you're comparing it to a full sugar soda.\n\nI drink NA beers on occasion, but I was always more of a cocktail guy and I enjoy some nice mocktails with Ritual NA booze substitutes and it works the same way...I might have a few while I'm grilling and hanging out by the pool with my friends and family but I'm not drinking a dozen of them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "learning2codeallday",
            "body": "For those of us who drank cheap gas station beer, Busch NA is pretty close. Scratches the itch. If I'm having a bad day I will impulsively slam one at night. Kinda weird. It's my \"in case of emergency break glass\" thing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "phynx333",
            "body": "No you are not weird. I'm the same. \nIWNDWYT!",
            "score": 2,
            "replies": []
        },
        {
            "author": "MsDirtDigger",
            "body": "I have opened so many NA's only to leave them unfinished on the table. I laugh, knowing how utterly impossible and unheard of that was for me with alcohol. It's a silly feeling but it's a thing!",
            "score": 2,
            "replies": []
        },
        {
            "author": "rockyroad55",
            "body": "I drink them now and when I’m done my meal or feel a little too stuffed, I just pour the rest down the drain.  I don’t even have an urge to finish it. It’s just another beverage. \n\nI thought about this the other day and was amazed at your post.",
            "score": 2,
            "replies": []
        },
        {
            "author": "wildnessandfreedom",
            "body": "Nope. For me it's sweet tea or water. NA beers are the devil for me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "theotheroneistrouble",
            "body": "I recently quit drinking after 25 years. I have a couple now and alcoholic beers about every 2 or 3 nights. I just missed the taste of beer and it does the trick. The athletic goldens are my favorite. I could easily get into drinking a couple every night but that's not the route I want to go. I want to have a six pack of non-alcoholic beers when I go on a camping trip once a year and that's about it. For now it's definitely helping me tape her off.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Spiritual_Today_6640",
            "body": "I opened an NA beer this weekend and didn’t finish it before I left to go to an event so I put the rest in the hotel mini fridge. When I got back from the event I poured it down the sink because I didn’t want to drink it anymore, then I kind of chuckled to myself for even putting the half remaining in the fridge. But I used to do that all the time with actual beers that I would open RIGHT before I would go out somewhere so I could chug a few sips for an additional buzz and save the rest for when I got back so I wouldn’t waste any alcohol and be able to still drink it when I got back. Don’t miss those days!",
            "score": 2,
            "replies": []
        },
        {
            "author": "PartiZAn18",
            "body": "I have no desire to drink NA beers. The taste and/or trace amounts of alcohol (whether my body is receptive to it on a molecular level, or whether it's a placebo - I don't know/care) is enough to give me a buzz, and I don't want that to trigger cravings.\n\nIt also has so many unnecessary calories. Ha! :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Liquid-Banjo",
            "body": "Nah, I've got no interest in tempting fate. If you tell me it's got 0.5% alcohol in it, I'm going to calculate how many it will take to get fucked up. Absolutely not worth the risk. \n\n\nI never drank beer much anyway, didn't work quick enough.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NJsober1",
            "body": "I don’t drink pretend beer. Taste can be a huge trigger for many. Not pretending to drink something that nearly killed me.",
            "score": 3,
            "replies": [
                {
                    "author": "Penandsword2021",
                    "body": "I don’t see alcohol free beer as “pretend beer” at all. I see them as far superior to the “real thing” because I can enjoy the tastes I like WITHOUT the alcohol messing with my mind and body. It’s a bloody miracle, is what it is.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "SauerkrautHedonists",
                            "body": "Agreed",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ghost_victim",
            "body": "Wait.. why would that be weird?",
            "score": 1,
            "replies": []
        }
    ]
}