{
    "title": "Coming up on day 7. I want to drink.",
    "author": "South_Stress_1644",
    "subreddit": "stopdrinking",
    "rank": 370,
    "score": 13,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2q4ba/coming_up_on_day_7_i_want_to_drink/",
    "id": "1j2q4ba",
    "selftext": "It’s been almost a week again. I’m committed this time. I didn’t drink at the last family gathering (bowling). I’m sleeping better. Eating better. I have more energy, more focus. I’m more calm and less anxious/depressed. I’m reading books again. I’m performing well at work again. I have this underlying hope/positivity.\n\nBut It’s my weekend (I have Mondays and Tuesdays off). All I’d have to do is hop in my car and swing around the corner, pick up two 6-packs of Busch for $10 and call it a day. But what would that result in? Well…\n\nSitting on my couch, staring ahead not able to focus, listening to music and crying, drunk texting,  possibly drunk driving to get more beer, dehydrating myself via mega pissing, starving myself until I’m satisfied with how much I’ve imbibed, eating a giant unhealthy meal, not brushing my teeth, collapsing in bed with clothes on, waking up drenched in sweat, massive headache, no rest at all, next day completely ruined, next 3-4 days tired with brain fog, anxiety, anger, and emotional issues.\n\nPlay that tape forward guys. IWNDWYT.",
    "comments": [
        {
            "author": "Low_Peanut2644",
            "body": "Sounds like you have figured out pretty accurately what drinking will do to you. Nothing good. 7 days is great (on day 9) Never want to drink again. We got this. Have a great and sober weekend. IWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "Old_Discipline_1179",
            "body": "Impressed by your resolve",
            "score": 1,
            "replies": []
        },
        {
            "author": "MopingAppraiser",
            "body": "IWNDWYT",
            "score": 1,
            "replies": []
        }
    ]
}