{
    "title": "1 year 3 months",
    "author": "MagikPatrik",
    "subreddit": "stopdrinking",
    "rank": 242,
    "score": 13,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j39yoz/1_year_3_months/",
    "id": "1j39yoz",
    "selftext": "I don't count days but I do count months. \n\nI Struggled harder than usual last week and had to stay strong, I did it! I know you guys can understand the feeling, I was about to brag to some friends but remembered they don't give a f hahaha\n\nMy mum barely said yeah it's good... People just don't understand but you guys do IWNDWYT much love",
    "comments": [
        {
            "author": "Eye-deliver",
            "body": "Congratulations on 15 months! And yes I do understand. I’m 60 days today. I was so excited to see my counter this morning. Was about to tell my wife but I came here to tell you folks instead because I know you will understand what that means to me. Maybe I’ll tell her later but she will just nonchalantly say oh that’s great and then change the subject or just go back to what she was doing. And that’s ok. IWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "MagikPatrik",
                    "body": "Congrats on 60 days!\n\nthe first and last time I lasted 60 days is my currents streak of 450 days! The hardest for me was the fist 60 days so I can't tell for you but i think you got past the worst part my friend!\n\nMy 3 months mark really made a change in my habits and mecanism to get rd of the cravings, to almost no craving majority of time. you got this!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Eye-deliver",
                            "body": "Thank you! And yes I’m well past the worst of it. But I know now the real work begins on changing the person that brought me here. Small steps for now bigger ones to come!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}