{
    "title": "Realizing I don’t really have any good reason for being sober from alcohol",
    "author": "Matilda_Mother_67",
    "subreddit": "stopdrinking",
    "rank": 338,
    "score": 0,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 38,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j398hp/realizing_i_dont_really_have_any_good_reason_for/",
    "id": "1j398hp",
    "selftext": "I’m on day 5 and going to be day 6 later this afternoon of no alcohol. But as I sit here, I realize I don’t really have any specific reason why I stopped in the first place. I mean, yes, alcohol is a depressant and could exacerbate my already existing depression and loneliness and all that. But it’s not like anything about my life will slowly change like it has for so many people who quit. \n\nI’m California sober as it were: not consuming alcohol but also taking drugs like CBD or THC. And the reason is because being stone cold sober would be too fucking hard. My brain literally cannot produce dopamine if I were 100% sober. It just cannot. The only time I ever get close is when I vape or ingest CBD. And the only time I actually achieve any semblance of happiness and uplifting is when I take THC. But outside of those, I literally just exist being unhappy, unsatisfied, etc. And no amount of talk therapy can fix that. Believe me, I’ve tried. \n\nAgain, I don’t really have any good reason for quitting alcohol. Not like I’ll suddenly gain friends and my life will be transformed, even if I give the 12 Steps a shot. I don’t believe in their God or Higher Power and feel emasculated when it says I can’t control my drinking and that I need to surrender myself to some other force. \n\nIdk. I’m just ranting. This whole post is probably pointless. Not like I’ll have jack shit to leave anyone if I off myself anyway. Few thousand bucks, and no one would show up to my funeral besides my immediate family. I’d end this life feeling wasted and unfulfilled just like I imagined it. ",
    "comments": [
        {
            "author": "Speedy666gonzalez",
            "body": "Do you have all your limbs? All your fingers and toes? Can you walk? Can you swim? Can you cycle? \n\nThe fact is brother…you’re ALIVE! \nEven if the above isn’t perfect- you ought to experience what life has to offer. \n\nI’ve been sober for almost 18 months now- taken up hobbies/sports that wouldn’t have been on the menu if I was still drinking. \n\nSaw a lady with no feet skiing!\n\nAnything is possible!",
            "score": 16,
            "replies": [
                {
                    "author": "dandychuggins",
                    "body": "I sometimes see a lad at my gym with (what I presume to be) cerebral palsy. He arrives on his mobility scooter and once he's up and about, he's always beaming and saying hello to people. Inspirational isn't the word, what a guy.\n\nOP it sounds like you're having a pity party (I've thrown countless pity parties for myself over the years so I'm not judging, just stating).\n\n>I mean, yes, alcohol is a depressant and could exacerbate my already existing depression and loneliness and all that.\n\nThere's no 'could' about it - it absolutely, unequivocally *is* making those things worse.\n\nYou do not need to believe in god to be able to quit, I don't and I'm doing ok. Have you tried SMART recovery? You're running from something by using substances, take some of that cash and find a therapist",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "itsthedogsforme",
            "body": "I think you're posting here hoping for someone to say something that may click for you. I am so glad you posted, and hope that something will. None of us can want this for you - you have to want it for yourself - but we *can* all tell you how the path goes a few steps in front of where you are, because we've walked it. So here it is: \n\nYou deeply believe things can't get better because you haven't gotten there yet. You are still in a fog through which you simply can't see reality at this point, but you will only see it if you stop clouding yourself *long enough* to get clear.\n\nThings don't suddenly get better right away after quitting substances, that's true. It takes some time. But I can *promise* you they won't get better at all if you continue to numb out. Alcohol is unequivocally exacerbating your depression.\n\nLike another poster says, your body will never learn to make its own dopamine again as long as you are flooding it with it artificially. I highly recommend reading This Naked Mind - it truly changed my mind about giving up alcohol when I was depressed and thinking like you are now. \n\nYou know very well what life feels like right now, right? So if you keep going, you can expect that and worse. Alcoholism is progressive. What you don't know is what's on the other side though, after creating more distance from alcohol and drugs. Days will pass anyhow: why not keep going without drinking and discover what you haven't felt yet? \"Don't quit before the miracle\". \n\nThe more day by day that you go, more will be revealed and things will feel and get better, I am willing to promise that to you. I felt like you felt, didn't want suggestions and wanted to drink at everyone out of spite... but day by day, one day at a time away from drinking, the fog and lies started to lift until I realized I didn't feel so crappy. And one day you'll feel a spark of joy and energy. And then eventually you can't fathom how you used to feel like this. \n\nThat's available for you and you deserve to find out - I hope you keep going 💕 IWNDWYT",
            "score": 11,
            "replies": []
        },
        {
            "author": "MopingAppraiser",
            "body": "Please don’t off yourself.  If you’re feeling that close to doing it call 988 or go to the ER.  You’ve come to a great place in this subreddit where all kinds of people, although online, will give you all sorts of love and approval.  The biggest piece of advice I can give you, besides not offing yourself, is to see a doctor.  It certainly sounds like you’re suffering from depression and could perhaps use some medication.  IWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "Matilda_Mother_67",
                    "body": "Tried seeing a doctor and antidepressants. Both were short term solutions. And I don’t have the money for a psychiatrist. So oh well",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Better-Man",
            "body": "Find some purpose in life, it’s not just about feeling good or feeling sorry for yourself. Whatever you feel is lacking in your life, give it, to someone else, or to yourself. If you want friends, be a friend to someone in need.",
            "score": 4,
            "replies": [
                {
                    "author": "Matilda_Mother_67",
                    "body": "Tried that. I’ve tried picking up a philosophy of life that isn’t an Abrahamic religion and have gone as far as considering Buddhism. But again, nothing clicked for me sadly. I hate it",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Better-Man",
                            "body": "Keep trying, don’t say you tried and give up. Don’t give up, you have a valuable contribution to make, you just gotta find out what it is.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Loose_Fee_4856",
            "body": "Matilda, no one here is going to tell you it's a good idea to keep drinking. AA is not for everyone and there are alternatives available. Depending on where you live, the alternatives could be more accessible on-line. \n\n\nPlease seek medical attention if you are depressed at this point. Even fleeting suicidal ideas are concerning. \n\n\nKeep us posted. This sub can be an amazing source of support. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "hkgrl123",
            "body": "What about not wanting to get cancer? It's really just cancer juice. That's my reason.",
            "score": 3,
            "replies": [
                {
                    "author": "Matilda_Mother_67",
                    "body": "Been there, done that. I mean that seriously. Had ALL (acute lymphoblastic leukemia) as a kid. If anything, getting it again would expedite my end",
                    "score": 0,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MopingAppraiser",
                                    "body": "Good point",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ColdMembership3106",
            "body": "Like you said, drinking could make your depression worse. Why make a choice that you know could worsen the situation? The twelve steps aren’t for everyone, but there are tons of resources out there not only for sobriety, but also for mental health. I know saying “things will get better!”is not always reassuring to hear, but everything is temporary, and things actually can get better. I’m so so sorry you are existing like this, but know there are people who truly care. Sending a virtual hug to you.",
            "score": 2,
            "replies": [
                {
                    "author": "Matilda_Mother_67",
                    "body": "You and everyone else and their mother has been telling me for years and years that things will get better if I do X, Y and Z. Well I’ve done A-W in addition to X, Y and Z and don’t feel a mite of difference sadly. Just how I am",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kevinmbo",
            "body": "your body will never learn to make its own dopamine if it can be depend on you consuming artificial excessive amounts of it.\n\nsobriety is the first of several steps in changing your life. you have to keep taking action.\n\nIWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "Matilda_Mother_67",
                    "body": "Like I said though, my brain can’t produce it on its own. I can’t “teach myself to be happy” as you mean. Literally, I cannot. I need outside chemical substances to do so.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "MopingAppraiser",
                            "body": "Do you know that for a fact?  Like have you had tests done that state you can’t produce dopamine?  What about seratonin?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "kevinmbo",
                            "body": "unless there is an unmentioned medical condition, you can. but you have to detox first and reprogram your brain. right now your brain is not going to create any naturally because you’ve trained it that it doesnt need to. our brains/bodies adapt to our behaviors and your behavior is “i am depressed until i consume alcohol/drugs” repeat.\n\ni would recommend reading “alcohol explained”.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Standard8634",
            "body": "Only YOU can decide to do the work. This sub is an amazing place for individuals seeking support and advice. You have to want it.",
            "score": 2,
            "replies": [
                {
                    "author": "Matilda_Mother_67",
                    "body": "Guess I just don’t want it then, or can’t have it like you can",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SamMarduk",
            "body": "For me, i had “reasons” but people who have struggled know those reasons are weak at your worst. For me it was “i don’t know what this is for yet.”  2 years, and a lot of positive life change, later it still helps.  Excited for the day I can look back and know “why”",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beautiful-Middle-193",
            "body": "This to me sounds like the voice of alcohol talking, now that you have almost 6 days without it, trying to reason its way back in.\n\nYou’ve received some good advice here but none of us can make your decisions for you.\n\nI wish you the best of luck and I hope you keep at sobriety.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rob___Boss",
            "body": "For a long time in my life I thought my body couldn't make enough dopamine. I understand what you're saying. But then I was reminded that before I ever did drugs I was fine. The alcohol  or any  drug,  causes that void or emptiness. It's the addiction saying feed me! Starve it my friend.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Admiral_Apathy",
            "body": "Here’s a website with tons of meetings that are secular, some are Buddhist, and you’ll see some that are Traditional AA(avoid these if you don’t want to hear about people praising god). My point is, there’s a group for everyone and they can definitely help. Wishing you the best. \nworldwidesecularmeetings.com.",
            "score": 2,
            "replies": []
        },
        {
            "author": "trevvvit",
            "body": "Idk fella, for me the good reason was that drinking wasn’t adding anything positive and only negative for me. I’ve never had an alcohol addiction, and don’t have truly dangerous drinking behavior (no blackouts mistakes duis violence etc) but waking up feeling sick and looking terrible most of the time and only truly having fun drinking 1/5 of the sessions showed me I wasn’t getting my moneys worth. \n\nSince I don’t have an addiction I was considering just limiting to 1-2 drinks but I have been reading “Alcohol Explained” and from a vanity standpoint I’m excited to loose my eye bags, have a better looking face and to see my abs again in the mirror. From my understanding ill get these results by completely obtaining (34m)",
            "score": 2,
            "replies": []
        },
        {
            "author": "spitebarf",
            "body": "I spent years circling the drain because of my crippling, worsening anxiety and depression — I had just accepted that alcohol was the “medication” that worked for me, and like anything it had its downsides and side effects\n\nQuitting drinking was a huge bitch and the first month or two were terrible and I constantly questioned if it was worth it, and you’re right in thinking that quitting isn’t an instant fix for your mental health issues\n\nWhat quitting did for me was give me the energy and space to seek out things to better my situation (better sleep, eating food that wasn’t take out — hell, eating food AT ALL! — pursuing hobbies, digging myself out of debt, etc)\n\nI didn’t do the steps, I didn’t deal with religion, I didn’t prostrate myself to anything — but if I felt too far out on a limb by myself, I popped into an online meeting (you can find plenty that are secular AA, or not AA at all), even just to listen. If you had cancer, it wouldn’t be reasonable to take care of it all on your own — it’s healthy and reasonable to seek out help and support when you’re sick",
            "score": 2,
            "replies": []
        },
        {
            "author": "lifesAmess3",
            "body": "like you said the only reason why you cant stop is because it numbs you and brings you joy. So if you find something else (its waaay easier to say than to actual find something) that brings you joy, you would drink less and less alcohol. I also get that you dont have the energy or dopamine level to try out something new, this is a devil circle (where I come from), means its a repeating situation that you think you cant escape, but here is the funny think, you can brake the circle",
            "score": 2,
            "replies": []
        },
        {
            "author": "edwardetr",
            "body": "Try not thinking of yourself and thinking of what you can do for others.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChaoticOdyssey",
            "body": "Here's a reason. Take an hour and read through posts. \n\nr/cirrhosis",
            "score": 1,
            "replies": []
        },
        {
            "author": "TLOCseth88",
            "body": "Where are you located? I know exactly what you’re talking about when you say sober like is literally so slow. I find myself waking up and just ready for the end of the day so I can take my sleeping meds and then go to sleep so it can be the next day already and it’s just a cycle if that.. I do so much fentanyl everyday and I don’t even get high anymore I’m literally smoking a lot if it everyday all day and I don’t get High so using to not get really sick is pointless but if I’m not using “even tho I don’t get high” I’m miserable. I know I just have to wait for my brain to heal itself so I can get my natural dopamine back it sucks bad at first but it gets easier every day that goes by!",
            "score": 1,
            "replies": []
        },
        {
            "author": "imthegreenmeeple",
            "body": "For me, I definitely had things that improved when I stopped but I was more satisfied that I had finally outsmarted an industry that was cleverly trying to trick me into giving them my hard earned money in exchange for literal poison.  So there’s that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "sfgirlmary",
                    "body": "This comment is deliberately offensive and has been removed. Please do not speak to people on this sub this way.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KeepDiggingJohnny",
                            "body": "Wasn’t meant as offensive. Every piece of advice the person was given, their response was pretty much ”meh”. My suggestion for them was that if outside help is not working, that they try the approach of owning their own faults and taking responsibility of their own actions. No one else can if a person doesn’t want to change themselves and if their whole point is that they don’t want to change their ways then maybe a sub for recovering addicts is not the right place for them.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "sfgirlmary",
                                    "body": ">Wasn’t meant as offensive. \n\nThis is a ridiculous thing to say. *Obviously,* telling someone to stop whining is meant to be offensive. What did you think it was, a compliment?\n\n>  My suggestion for them was...\n\nThe rule to speak from the \"I\" means you are not supposed to be offering suggestions or advice.\n\n> if their whole point is that they don’t want to change their ways then maybe a sub for recovering addicts is not the right place for them.\n\nIt is absolutely not your place to make this kind of judgment about what other people are doing or not doing.\n\nPlease read our rules in the sidebar and then start following them without argument going forward, or you will be removed from this community.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "KeepDiggingJohnny",
                                            "body": "Ok. I will do better moving forward. I realize I was wrong and apologize.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "sfgirlmary",
                                                    "body": "Thank you for your gracious apology. We're glad you're here.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}