{
    "title": "Any absolute 0% beers in UK?",
    "author": "ComplaintScary8730",
    "subreddit": "stopdrinking",
    "rank": 326,
    "score": 0,
    "upvote_ratio": 0.4,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3b3i8/any_absolute_0_beers_in_uk/",
    "id": "1j3b3i8",
    "selftext": "Appreciate some help here. Have found a lot of brands will put 0% on the packaging when it contains alcohol from 0.05% to 0.5% which is misleading to say the least! \nIWNDWYT",
    "comments": [
        {
            "author": "Soberdot",
            "body": "A slice of white bread, or a ripe banana contain more than .5% alcohol. It’s perfectly safe to have a .5 NA in recovery, as long as the act of drinking a beer is t triggering.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Gary_BBGames",
            "body": "A glass of orange juice will have this amount of alcohol too. They let “alcohol free” have a very small amount of alcohol otherwise you’d need ID to buy the basic groceries :)",
            "score": 6,
            "replies": []
        },
        {
            "author": "MrBeer9999",
            "body": ".5% is safe for children to drink.\n\nEDIT\n\n“Alcohol is poison!” is a popular narrative on this sub, which is fine, but “dose makes the poison”. Humans are quite ethanol tolerant, it’s not like cyanide to us, it’s just bad in larger doses and unfortunately it’s addictive. Hence all our problems with it.",
            "score": 5,
            "replies": []
        },
        {
            "author": "losethebooze",
            "body": "Just be true to yourself. Are you drinking 0.05% or 0.5% to get drunk? No, you’re not (because it’s realistically impossible.)\n\nIf it bothers you, avoid it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Cimbetau",
            "body": "I hope you don't drink Kombucha. You're in for a rude shock. But seriously, if you do the math, to get drunk on NA's you'd have to consume like 50 in 10 minutes (I am not a mathstician).",
            "score": 2,
            "replies": []
        },
        {
            "author": "ComplaintScary8730",
            "body": "OMG I had no idea, thanks folks! 👍",
            "score": 1,
            "replies": []
        }
    ]
}