{
    "title": "I want to have a drink",
    "author": "ksmm1824",
    "subreddit": "stopdrinking",
    "rank": 149,
    "score": 33,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 43,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3nus8/i_want_to_have_a_drink/",
    "id": "1j3nus8",
    "selftext": "About 40 days sober. dealing with bad anxiety and insomnia and I’m like might as well. I want to escape from this. :( ",
    "comments": [
        {
            "author": "Capital_Listen_5863",
            "body": "If it helps, play the tape forward. What happens after you take that drink?",
            "score": 31,
            "replies": [
                {
                    "author": "frosh91",
                    "body": "This. \n\nMake it 30 minutes more right now without drinking. You may change your mind after you sit with this.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "DearEvidence6282",
                    "body": "This is great advice.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Indaflow",
                    "body": "Anxiousness with a headache and lack of sleep? ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StopDropNRoll9",
            "body": "Please don’t ruin that 40 day streak! You’re doing so well - think how amaxing you will feel waking up on day 41.",
            "score": 13,
            "replies": []
        },
        {
            "author": "yuribotcake",
            "body": "When my mind was still trying to come up with ways to get me to drink, it would make me not sleep, get very stressed, massive anxiety. And then when I caved, my mind would quickly tell me \"see, that was the right way of dealing with it.\" And then in no time, I am again drinking myself into stupor, trying to understand each morning how I got to the same shitty spot where I was. And then not drinking felt even more difficult, since my mind knew how it could get me agitated enough to get me to succumb. Now I can be having the shittiest days, ready to run away into the mountains. And all I have to do is step back, take a very deep breath, exhale very slowly, and notice how my mind is just in overdrive for no real reason. If I ask it, yea it'll have a billions of reasons, and billions of reasons why a drink is a viable option. But that small moment allows me to see that I am not in pain, my legs are not on fire, I'm not bleeding, and whatever is bothering me isn't going to go away if I get black out drunk. In reality the mind will overamplify everything to get what it wants.\n\n40 days! Amazing. All the walls we climb over in our process will feel like small stepping blocks once we know how to climb over. Yet our minds will make those blocks feel like impassible obstacles. \n\nIWNDWYT",
            "score": 13,
            "replies": []
        },
        {
            "author": "FebruaryDiva",
            "body": "My doctor recommended magnesium glycinate 4 caps, 350 mg before bed. It really helped. Good luck.",
            "score": 10,
            "replies": [
                {
                    "author": "NUrmomsbum",
                    "body": "I take 300mg every night and sleep like a baby.  This helps remind me of what sleepless nice drunk felt like.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Super-College2794",
            "body": "Yeah this is common- good on you for coming here. I can assure you not one person EVER on this sub who gave in was happy about it and ALWAYS regretted it. On the other hand not one person EVER regretted staying sober. This is a tough time, I struggled real bad around days 50-70. You’re at a point where you haven’t drank for over a month and that’s huge, but it fucks with you bc you start to say i don’t have a problem, I was able to go this long, and then it really fucks with you by saying you can just have 2 and maybe you do but if not tonight, you will go overboard and hate yourself.\nI promise you the urge passes, get through the night, go to sleep and you will be super happy and proud of yourself in the morning. Trust me on this! IWNDWYT!!!",
            "score": 7,
            "replies": [
                {
                    "author": "Tinselcat33",
                    "body": "I’m day 60 something and yes, struggle\nIs a good word. I’m not even wanting a drink, I’m\nJust angry that I can’t numb myself. This is hard.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gyattboy",
            "body": "That one, maybe two good hours will not be worth the morning of regret",
            "score": 6,
            "replies": []
        },
        {
            "author": "Capital_Listen_5863",
            "body": "IWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "_ilikecmyk_",
                    "body": "IWNDWYT",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spare_Ad_4484",
            "body": "You wont escape. Once the hangover kicks in you'll feel more trapped.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ProdigalRob",
            "body": "Not drinking with you today. \n\nThe real question is, why do you want to make it worse?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Techincallyoverit",
            "body": "Think of the hanxiety. \n\nIwndwyt",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fuzzy_Protection_921",
            "body": "You got this!  Go for a walk.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DoqHolliday",
            "body": "I’m feeling a little bummed too, could fall into the same lane.\n\nBut I know it’s gonna be fine tomorrow, I know there are better things that I can do to actually help with the anxiety and depression, and I know that drinking and/or getting stoned will not only NOT help, but will 100% make it worse.\n\nI need to sit with these feelings, rather than try to escape them. I need to go work out.\n\nDon’t do it man (or woman). It’s 100% not worth it.\n\nLean into the part of your mind and being that led you to post here instead.\n\n💙🫂",
            "score": 3,
            "replies": [
                {
                    "author": "x36_",
                    "body": "honestly same",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "meltingpot-324",
            "body": "IWNDWYT. Alcohol will only make anxiety and insomnia worse.  You've made it 40 days. Why not go for 41?",
            "score": 4,
            "replies": []
        },
        {
            "author": "I_need_more_dogs",
            "body": "I drank on Saturday. Just two canned Mai tai drinks. I was only 15 days sober. I had a headache till this morning. Don’t do it. It’s just no fun anymore.",
            "score": 2,
            "replies": []
        },
        {
            "author": "coIlean2016",
            "body": "It will only make the anxiety worse. \n\nI heard recently that the cure for anxiety was creativity. \n\nI do find it calms me. \n\nYou don’t want to drink. You stopped for a reason. \n\nIt makes everything worse.",
            "score": 2,
            "replies": []
        },
        {
            "author": "2bz4uqt99",
            "body": "You are doing great 👍..  40 days and keep going. The anxiety will resolve eventually.  Maybe talk to your doctor about some temporary treatment to ease your mind. Stay strong. Day 10 here",
            "score": 1,
            "replies": []
        },
        {
            "author": "devon2576",
            "body": "Don’t run away from something, Run to something. Anything but drinking. Go for a walk, read a book, wash your vehicle, clean your house, do some laundry, call someone for a chat, etc. I like to drink herbal tea when I feel stressed at night after a hot shower and I am always ready to sleep after that. Or honestly try a guided sleep meditation, I can never finish the full thing consciously before waking up realizing I’ve fell asleep halfway through it. Those work well! IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "maddedge",
            "body": "The anxiety and insomnia will still be there tomorrow even if you choose to drink tonight. Alcohol won’t help anything. I hope you can stay strong to see day 41💛",
            "score": 1,
            "replies": []
        },
        {
            "author": "untimelyrain",
            "body": "I really hope you don't, my friend! I promise you, it will not serve as the relief you believe it will. Maybe, *maaaaybe* for a moment it will.. but then the guilt, the anxiety, the shame will all creep in. You will be reminded why you stopped in the first place. You won't feel good about the decision later. You're mind is tricking you right nowm alcohol has nothing to offer you!!\n\nYou're at a really challenging spot on early sobriety, so it's totally normal and expected to be feeling this way. I know that probably doesn't help much. But maybe knowing that we have all been through this exact feeling can serve as some reminder of the community you have here who *get it* and are here to support you!\n\nAlcohol is not your friend. But we are!! 🫶 \n\nThink about how you will feel tomorrow if you drink tonight. Be kind and loving to Tomorrow You. You will never regret taking care of yourself 🤍",
            "score": 1,
            "replies": []
        },
        {
            "author": "Regular_Yellow710",
            "body": "Please see a doctor. They can help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheonsPrideinaBox",
            "body": "I hope you make it to tomorrow sober.  It’s hard sometimes but please dig in.  I was a serial relapser and it’s not a good way to go.  Contentment will come if you dig in and give it a chance to take hold.  I will be sober with you tonight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "error404wth",
            "body": "I'm so glad you posted this because I'm feeling the same way. Nights are soooo hard. I hate nights. 😩 There's only so much tea and coffee I can drink.\n\nBut.... IWNDWYT.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radiant-Reaction4675",
            "body": "I would be looking for a distraction. Got any favorite childhood movies you haven’t seen in awhile? It takes me back to simpler times and makes me a bit happier",
            "score": 1,
            "replies": []
        },
        {
            "author": "sexymodernjesus",
            "body": "I am the same, about 34 days though. I just know Ill have more anxiety in the morning if I do and probably find a beer to ease it. Not worth it. Hang tough.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Canibereal",
            "body": "Me too 😵‍💫☺️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kathleen9787",
            "body": "Don’t do it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kind-Humor-5420",
            "body": "Same. Took a lot of beatings at work this week and it’s only Tuesday but IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "pinsandsuch",
            "body": "See your doctor about the anxiety. Mine was willing to prescribe Ativan when I told him I’d been sober for 3 months and was struggling with it. I have no desire to drink right now, since I know that will make my anxiety worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "electric_teardrop",
            "body": "The anxiety and insomnia is what's telling you you're close to a breakthrough. Don't hide and distract from the discomfort. The discomfort is the path forward.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Andeepac79",
            "body": "you’ll feel so much better in the morning if u don’t i think. i had 57 days back at start of december and i am now back to day 4. just thinking of all the money i would have saved and fitness progress i would have by now. and less shame and regret. it’s not worth it each day 1 i am realizing gets harder and harder. just relating my experience. and it will be so fun to get to day 69 and get a nice lol.",
            "score": 1,
            "replies": [
                {
                    "author": "ConfidentGood5811",
                    "body": "Can you explain the nice to me please? I'm so confused lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Andeepac79",
                            "body": "lol i don’t really even know it that much but in this sub if you get to day 69 they give you a “nice!” to celebrate. something like that. sorry. i don’t really know if i explained that good or correctly. i just see other people get to 69 days and post that and wished i had made it to 69 days when i see it.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Manuntdfan",
            "body": "Drinking will make it worse. Try some CBD",
            "score": 1,
            "replies": [
                {
                    "author": "error404wth",
                    "body": "I need to get this.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}