{
    "title": "Something changed in last 3 years",
    "author": "Historical-Debate227",
    "subreddit": "india",
    "rank": 19,
    "score": 274,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 71,
    "url": "https://www.reddit.com/r/india/comments/1jdvuzz/something_changed_in_last_3_years/",
    "id": "1jdvuzz",
    "selftext": "Recently i have realised that my perception regarding this country and its people have changed drastically in the last 3 years. I don’t know whether it is due the growing hate towards the country on social media or the fact that every day there is a new case in light which starts making you question the humanity of our people.\nThe change in my perception had led me to be a changed person of society.\n\n1. Previously whenever i was travelling on my scooty to somewhere and i saw a person asking for lift pr something i will stop to help him out but now i have started thinking twice and mostly don’t help the person out thinking that may be that person might cause me harm.\n2. Previously while travelling to any new city in india i will not think about what time will\nI reach how will i manage i used to think i will ask the people there they will help me out but now i have to think twice about the timing and see what are the ongoing issues of that city language, hate against a certain community pr what and make sure I don’t make any mistake.\n\nThere are many more such small things that have changed.\nThe reason i am posting here is to know that is it just me and my social media algorithm that are causing this or have the things really have gone down hill.\nI want to believe that there are still good people left in our country who don’t cheat, have basic civic sense and at least care about the fellow humn",
    "comments": [
        {
            "author": "rahulsingh_nba",
            "body": "I've noticed it myself, I've become cynical in a lot of ways, I don't _feel_ the same I did a few years back. I think it's because we're seeing so much injustice happening around us, so much crime, and so much propaganda and hate spewn everywhere, that it has triggered our flight and fight. I don't feel like I belong to this country anymore. \n\nAlthough I'd say it's healthier to just remove yourself from the world and just spend time with your loved ones. That helps. People are still nice, _some people._",
            "score": 179,
            "replies": [
                {
                    "author": "Historical-Debate227",
                    "body": "That’s so correct i feel",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "firewirexxx",
                    "body": "I can add a lot but won't.\nI agree with you and OP and everyone else here.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "rahulsingh_nba",
                            "body": "Sometimes it's good to put things out there, you never know when it might be useful for someone. I, for one, will be interested to know what you want to add.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "firewirexxx",
                                    "body": "Total decay of common sense in adults  including older people like boomers and people being led astray through propaganda. \n\nTotal anti creativity environment. Creativity is systematically being stamped out. over policing on petty issues, hefty fines on poor people doing labor work. The root of creativity lies in deviancy not homeliness or \"goodness\". \n\nPublic parks have become surveillance zones with strict diktats on do's and don't do.\n\nCritical thinking is now slowly been taken as a threat. \n\nToo much layering in legal issues and excess bureaucracy on simple things once done and executed.\n\nNo legal recourse on fall out, harm, destruction or fatality.\n\nFood is highly toxic, simple biscuits are made of chalk like powder not even maida. Many people have been brought up on parle g which was made of pure wheat, now it's just some white powder.\n\nDegrees are becoming worthless month over month..\n\n.........",
                                    "score": 26,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "basar_auqat",
                    "body": ">\"...all at once, and you see that everything, everything, has changed and changed completely under your nose. The world you live in—your nation, your people—is not the world you were born in at all. The forms are all there, all untouched, all reassuring, the houses, the shops, the jobs, the mealtimes, the visits, the concerts, the cinema, the holidays. But the spirit, which you never noticed because you made the lifelong mistake of identifying it with the forms, is changed. Now you live in a world of hate and fear, and the people who hate and fear do not even know it themselves; when everyone is transformed, no one is transformed.\"\n\n-- Milton  Mayer, \"They Thought They Were Free\".\n\nA 100 years later, the same bullshit repeats itself on a different continent.  It's not that Germans woke up one day and started killing Jews and invading countries. It was a prolonged process to get mentally to that level .",
                    "score": 13,
                    "replies": [
                        {
                            "author": "dajoni12",
                            "body": "Nice quote, wrong comparison",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pestario",
            "body": "You have just described a low trust society. One of the hallmarks of a third world country.",
            "score": 207,
            "replies": [
                {
                    "author": "Historical-Debate227",
                    "body": "Do you feel there is even a solution for this or we are just doomed now",
                    "score": 23,
                    "replies": [
                        {
                            "author": "pestario",
                            "body": "Until the state of law and order changes, there is no hope. People should feel confident that if they are wronged, they will get justice no matter the crime or status of the victim. \n\nStart asking for strong law and order. Shine light on corruption wherever you see it. Don't let it slide and don't participate. Expect higher standards.",
                            "score": 70,
                            "replies": []
                        },
                        {
                            "author": "caprismart1978",
                            "body": "We are lawless. At every level. Until that’s fixed. We are doomed.",
                            "score": 28,
                            "replies": []
                        },
                        {
                            "author": "AdOpposite7412",
                            "body": "yup there are few solution to it, like according to me if there will be unions for protest in our country just like there in france, the things might get better, the problem is in other democratic countries there are unions to protest for any misconvinence but in our country firstly people don't protest even if they do there is lack of leadership, in other countries people protest till the problem gets solved but in our country people would only protest for 2-3 three days. So, according to me if there would be a demand for unions which will protest on behalf of the people things might get better",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AdOpposite7412",
                                    "body": "just like during the fight for independence we had strong leaders which leads the crowd to protest in a way but nowadays the lack of leadership causes the protest to last only for 2-3 days , if there would be public funded unions or if we demand and aware people about this idea through social media things might get better.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Unlucky_Buy217",
                    "body": "But OP describes a higher trust society in the beginning. A third world country doesn't need to be a low trust society,  lot of times low trust can just be a hallmark of perceptions due to media. In the US, a lot of stores have started putting merchandise behind glass shelves and it's been an eternity since I found a restaurant that doesn't have bathrooms guarded by key codes. A lot of times these are based on isolated incidents of crime but leads to decline in trust almost immediately.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "BodybuilderTop8751",
                            "body": "USA has always been a low Trust society as scene by how litigious they are. Trust in society is very very different and often not necessarily in exact proportion to the crime rates. Trust comes through lots of positive experiences and through a reassurance that every person has got the others back. \n\nScandinavia (where I currently live) is a high trust society. Take driving for example: I have driven in 6-8 countries but nowhere is it as stress free as in Scandinavia even in peak traffic or rush hours in the city. I am virtually assured that every person is trying their level best to follow every traffic rule to the letter. \n\nI know that at 10 pm there will be pin drop silence in residential areas and I do not have to worry about noise. \n\nI know that if there is an issue with my bus/tram/train there is someone somewhere doing their best to give us a replacement bus or other solutions. \n\nI know that I do not have to worry about the quality of water I drink or food I eat because someone has made sure that it's safe before it reaches my hand.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Certain_Mouse_6230",
            "body": "Few days back,I was with my daughter only at home and someone knocked at my door and asked for some water. My default instinct was to open to channel and then it stuck to me I could get my daughter in some difficult situation,so I told him in fear “bhaiya pani nahi hai” and later I realised how stupid I was sounding that there is no water at home. I do feel bad that he might be actually thirsty but till I am alive,I won’t put my daughter in anything which can prove fatal to her.",
            "score": 57,
            "replies": [
                {
                    "author": "Noob_in_making",
                    "body": "You did the right thing.\n\n\nFemale safety in India is a joke.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Certain_Mouse_6230",
                            "body": "That’s true.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "d1andonly",
            "body": "I lived in India a while back. I visited in Jan 2023. During republic day, I saw more orange flags for the Ram mandir than Indian flags. \n\nThat’s when I realized the country has changed.",
            "score": 131,
            "replies": [
                {
                    "author": "zsrt13",
                    "body": "Very good point. Toxic Hinduism is on the rise.",
                    "score": 52,
                    "replies": []
                }
            ]
        },
        {
            "author": "MercurialMilitant",
            "body": "The country used to be so much better and there used to be so much optimism. I remember during the last financial crisis, when India was the one of the few countries that held strong, when the Nano got introduced and we were in the news all over the world, I was so optimistic about us back then. There used to be a lot of talk about how our strength was our diversity and hate speeches were condemned in general. Now there is fighting happening everywhere, Hindus vs Muslims, North vs South, Vegetarians vs Non Vegetarians and no one seems to make an attempt to reign it in. Additionally, we've come to realise how much worse off we are, we do not get healthcare, our government education is horrible, our railways suck, there is poverty, pollution and pesticides. Plus, our courts have become weak and our police ineffective. And no attempt has been made to resolve the problems of the caste system, our single greatest malaise. Corruption is rampant. The government insults our intelligence by claiming we're the doyen of the world, that we're going to be an \"x\" trillion dollar economy while comedians, space missions etc are used to cover up glaring incompetencies. There is no value on human life. The country seems to be regressing and many, like me, are trying very very hard to leave.",
            "score": 37,
            "replies": [
                {
                    "author": "ElectronicHoneydew86",
                    "body": "i am sorry but it was all illusion,\n\n>during the last financial crisis, when India was the one of the few countries that held strong\n\nIndia was in fragile 5 for god's sake. also being the worst economy even in fragile 5 list. Most of this country didn't have access to basic things such as toilets, bathrooms, lots of districts of country was under red corridor. Kashmir was also seeing the worst times, north east had multiple militant outfit active.\n\nCorruption, pollution, weak judiciary, broken railways had existed back then too. govt education also sucked, and communal riots were also happening at huge scale. also add lots of terror attacks and bombings to it.\n\nYou guys are just feeling nostalgic, that's it.\n\nI said it in other comment, its all social media and its algorithm that is depressing people into thinking they live in Niger.\n\nThere is no factual proof that we are doing much worse than 15 years ago. all of the problems that we have today were much worse back then. you dont remember either because you are gen z or you are just feeling nostalgic.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "MercurialMilitant",
                            "body": "The term \"fragile 5\" was coined in 2013. The economic crash I was referring to was in 2008. I completely agree about the probability that we were misguided by the media, which was still somewhat independent back then, and the situation was not as great as it was painted, but you can through multiple articles stating India's resistance when the whole world economy was in shambles. And if it is indeed white washing done by the media, why isn't the current government, who is much better at controlling the media than the previous one able to do the same and convince us that all is well.\nPlus, there was so much optimism when BJP came to power with a majority because the malaise of policy stagnation in UPA 2 was primarily attributed to the workings of a coalition government. Even if it were true that we aren't worse off than previously, a strong and stable government at the centre hasn't been able to do much. For example, we have Vande Bharats that aren't much faster than the Shatabdis, but are priced significantly higher as an example of India's progress when millions travel in cramped compartments in trains that are in poor condition and face constant delays. Has the government invested in railway tracks? There are just two major players in airlines, small businesses have been allowed to fight for their existence because  bigger players have been allowed to operate without any social protection for the masses who form the backbone of these organisations. A major corporation like the Tatas seems content in competing with small retailers instead of actually investing in R&D to produce goods that can compete internationally.\nAnd it's not just the BJP government I am talking about.Terrible regimes like the one in Bengal, for example, are ruining a once great industrialized region to the ground because there is no accountability. A significant region like Andhra doesn't have a proper capital even though the state was divided a decade back. Manipur is destroyed. The government in UP seems happy to reflect on the achievements of a few pockets like Noida when the situation of the people in the rest of the state is dire. \nThere just doesn't seem to be a lot of hope.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "ElectronicHoneydew86",
                                    "body": "because i dont even understand you at this point other than the fact that i am sure you're feeling nostalgic about that era.\n\nI didn't say that some kind of whitewash is happening and there is some kind of conspiracy to display UPA as a better era than the current NDA. All i think is some of you either don't remember that era properly or you are just feeling nostalgic.\n\nSure we stood well in 2008 crash. Dr. MMS was a gifted technocrat. \n\nYes its terrible that this government didn't do much as we expected it too even after having a majority. because Modi is actually a weak leader, we saw a teaser when he started fumbling on resistance that he got for land acquisition bill of 2015. and a trailer when he took a complete U-Turn in front of farm unions in 2020. \n\nThe thing is reforms are hard to carry out in India, govt has to resort to backdoor reforms of which we see results like this [https://indianexpress.com/article/explained/explained-economics/french-fries-export-contract-farming-win-win-9787669/](https://indianexpress.com/article/explained/explained-economics/french-fries-export-contract-farming-win-win-9787669/)\n\nBut i dont understand how does this makes things bad than they were 15 years ago? I am not going to counter your point on railways and airlines, andhra and corporations not spending into R&D.\n\nLook man, I am son of a serving CRPF personnel. i have personally witnessed things when i used to live in CRPF campus of Dantewada, when those bodies of jawans used to come in convoys of blue crpf trucks. i didn't feel what it was that time but when i look back, it scares the hell out of me. and today our red corridor is at its lowest point. Our understanding of what is better or what was better seems to be entirely different. \n\nIndia has a long long way to cover into becoming a serious power, because we have a habit of talking big and doing less. but what we have done till now should not be underestimated or brushed aside with pessimism.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bla5tBurn",
            "body": "While on call I got mad at my girlfriend yesterday for simply waiting and talking to a man who was walking around at night asking for donations with a woman and a child. They could have genuinely been in need but to find out if they’re genuine or not is at what cost? I am not heartless and it pained me to tell that pure girl to just ignore someone possibly in need but if they weren’t, best case they would just be scammers, but the worst case has no LIMIT as is evident around us. It is impossible to not be cynical in such times. It’s shitty for almost everyone involved.",
            "score": 16,
            "replies": [
                {
                    "author": "Lattice-shadow",
                    "body": "I remember stopping to help people in need, giving lifts to strangers even in college. Not anymore. Not even in broad daylight.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Easy_Road_3806",
            "body": "These things were always happening.  The thing is we never had phones or social media.  No incidents were recorded and posted. News paper was the only source of news/ information.  Today everything is being recorded and posted in social media.",
            "score": 14,
            "replies": [
                {
                    "author": "Historical-Debate227",
                    "body": "This seems to be a right thing",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nithin_palwai",
            "body": "Yup, observed the same thing in myself.\n\nAfter seeing/facing/hearing certain number of scams, you become less and less sensitive.\n\n\nFrom the person saying \"hindi aata bhayya?\" on the road side to a false promise of next time\" I'll make sure you get hike\" from your manager. You lose trust in people's words.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Dhruvi-60",
            "body": "Believe me, youth of India is skeptical about India's real growth due to hatred and nonsense stuff happening in our country. Therefore, they want to leave India.",
            "score": 12,
            "replies": [
                {
                    "author": "1stGuyGamez",
                    "body": "Real growth is happening but the money is just going into the BJP hands and their cronies. Its plunder. It’s not being ‘faked’ but rather being siphoned from us like crazy.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "TwinCylinder7",
            "body": "We don’t need an outside entity to cause problems. We have enough entities inside the country making people hate each other. Quest for short term gains by these people is hurting the country in long term.",
            "score": 6,
            "replies": []
        },
        {
            "author": "JiskiLathiUskiBhains",
            "body": "You are growing up. \n\nModi's rise has allowed people to be nastier than usual and things have been slightly worse than normal since 2012-2013. \n\nBut India has always been like this. Modi has only made it slightly worse.",
            "score": 7,
            "replies": [
                {
                    "author": "Historical-Debate227",
                    "body": "Growing up is hard and sad",
                    "score": 2,
                    "replies": [
                        {
                            "author": "JiskiLathiUskiBhains",
                            "body": "I know man. I know.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Physical-Character75",
            "body": "Proven fact : Over population is directly linked to mental health of a country . Just see all the unhappy places in happiness index ..\n All of them have one thing in common thar is shit load of people fighting to survive .in such places people won't trust each other will hate each other ..\nIndia will be worst in few years when it reaches its breaking point of overpopulation .dumbfucks will say : \"\"No look ,by 2100 india population will lower we need population to make india and Ambani rich blah blah \".idiot doesn't realise they have short life span in india they wouldnt be alive by then",
            "score": 9,
            "replies": []
        },
        {
            "author": "ElectronicHoneydew86",
            "body": "its the social media algorithm probably. that algorithm wants you to rage, or think aggressively about something. that's the aim of insta, reddit, or X/twitter.\n\nI too used to be depressed few months ago as if i am not in India but in niger or Mali. But all i did is go outside and it helped. Went to few trips with my brother, and occasional with my friends, i felt i am just overthinking. You are also probably overthinking.\n\nNow this country has its own flaws, no denying in that. but how is your worry or overthinking going to help? fix yourself first, think about country later.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Garchompbzt",
            "body": "This was bound to happen because many people lost their livelihood during pandemic and turned towards crime.\n\n\n\n\n\n\nI remember in an industrial area, people came and beat up 2 truckers to death and stole the truck with goods worth 65L+ near Mumbai outskirts",
            "score": 2,
            "replies": []
        },
        {
            "author": "1800skylab",
            "body": "This is exactly what fascism is about.  \n\nFascism, as a political ideology, promotes authoritarianism, nationalism, and suppression of dissent. If a country is experiencing rising authoritarianism, suppression of minority rights, or state-sponsored propaganda fostering division and fear, it will contribute to your sense of insecurity.\n\nMudi Khush hua!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "VersionFar1794",
            "body": "True , Just try to avoid the interaction with extremist ( To their Religion or Culture ) .\n\nYou should know English",
            "score": 3,
            "replies": []
        },
        {
            "author": "the_sane_philosopher",
            "body": "I once read somewhere \"world wasn’t a better place when we were kids—we were simply unaware of its flaws.\"\n\nHumanity hasn’t changed in the last three years; what has changed is your awareness and how you perceive things.\n\nFor thousands of years, human nature has remained the same. At its core, there is little difference between people today and those who lived a thousand years ago. Only sophistication has made things more complex. Sophistication hasn’t removed human flaws—it has just made them harder to recognize. Vices have always been part of human nature, and societies have always been flawed. Exploitation, deception, and corruption were never absent.\n\nOne thing, however, remains true—great individuals have always existed, and truly good people have always been rare. They always will be. But they are the exception, not the rule.\n\nThey are not proof of humanity’s goodness but rather of its potential—rare exceptions in an unchanging world.",
            "score": 2,
            "replies": []
        },
        {
            "author": "11Okboomer11",
            "body": "I also realized it. My take is Modi Ji effect final got over. Meaning from 2015 until covid, there was lots of hope and clarity that India will be a superpower and everything would get solved. Post covid, we realized this will never happen in the short term… so reality kicks in… reality was always there, we just got someone selling us some nice empty promises….",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cool-Armadillo3852",
            "body": "My perception totally changed in 2024 after seeing the growing hate and realising this country has many faults . Before 2024 , i didn't think of my country that way or in any way , I was living in my own bubble and tbh I was happy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nickboi26",
            "body": "The thing is I believe the majority of people in the world are nice as are we but we don't make noise we don't advertise your goodness in India nor in the world \n\nEver wondered how good Japan Korea seems  so good \n\n it's due to recent anime , kdrama and their media \n\nwhere they maily show good behaviour in indian media and entertainment there it's opposite we have seen many movies where the people in power use it for wrongfully and make them the main villian or recent making of hero from people who are against law and use violence as a medium of communication \n\nThis in large affect the people behaviour and perspective \n\n\nWe need good media good behaviour teaching not just complaints and  rants but action",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remarkable_Check2390",
            "body": "In India today in region people are silent while half-baked heads are shouting.  You are tagged as an anti Indian if you speak the truth while you are appreciated if you speak in favour of government. \n\nWomen are raped every second while the majority care about religion temple community and caste. \nWe all are moving towards bad times. And not only you everyone of us are feeling the same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "demhalalib_",
            "body": "This is so true bro… I usually get the same feeling whenever I’m traveling intercity…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mojolojo420",
            "body": "Namo 2029 last hope left for india. Misrule by Congress till 2014 major reason",
            "score": 1,
            "replies": []
        },
        {
            "author": "darwinevo",
            "body": "You're getting older, big revelation that is. Not everything is that deep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "desi_swag",
            "body": "Just a few days ago I had a similar thought. I am bullish on India and feel that we can turn this around as the next generation. \n\nBut with recent controversies like IGL and the quality of air by Bryan Johnson made me think. Is it even worth the hassle, as I have the option to go study abroad and get a decent chance of settling there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooApples7985",
            "body": "I used to be so against brain drain , people moving abroad saying it’s worse here but I have fully become one of them . I wish I could leave to a better country and take as many people with me as possible",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmallNGirthy",
            "body": "This is because of the recent decline in the moral compass. Scams are labelled as hustle and hate as dank.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mee-thee",
            "body": "Politicians play their usual tactics and citizens follow their lead. All the hate wrt religion, region, language, more often than not is incited by these so called leaders for their vote banks. They aggravate tensions and then come forward with solutions to make themselves seem like saviours. \n\nIt’s all like that PowerPuff Girls’ episode where that MajorMan comes in to save people after creating the trouble.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chanakya2",
            "body": "I checked and you joined Reddit 3 years ago. So it appears what’s changed is your perception of society based on what you read on Reddit.",
            "score": 0,
            "replies": [
                {
                    "author": "Historical-Debate227",
                    "body": "I have never been too much active on reddit",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "Saul_goodmannnnn",
                    "body": "no. The US culture did not make indians toxic dummy",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "TwoApprehensive3666",
            "body": "It’s the social media. If hyper focuses on the bad making everything worse. People start acting like they think should be acting. People get riled up for no reason",
            "score": -1,
            "replies": []
        },
        {
            "author": "HurryNew201",
            "body": "It might also just be you aging, I’ve seen these same shifts in attitudes across at two different groups of people in the last 10 years.",
            "score": -11,
            "replies": []
        },
        {
            "author": "zeer0dotcom",
            "body": "When I question myself and this country the way you are questioning yourself OP, I like to start at the top and start drilling down.\n\n1. Yes, India isn't some economic and social paradise like other countries which become free at around the same time but we haven't had insane dictator rule, martial law, civil war, and mass death - unlike South Korea (martial law), the Golden Triangle countries and Myanmar, and so on.\n2. Texas, which a couple of years ago basically closed off avenues for legal abortion, reported 26000 rapes which resulted in forced childbirth in one year since that change. Texas has a population of 30 million and is in a first world. If we extrapolate based on population, India should have 50x the number of rapes and childbirths. I'm not saying women are safe in India but I'm also not seeing evidence of 50x the number of rapes as Texas. ([Source](https://np.reddit.com/r/texas/comments/1fxj195/ama_26000_raped_women_in_tx_forced_to_give_birth/))\n3. There used to be a time when Indian banks were unusable because people used to spit everywhere until some smart guy had the idea of putting pictures of gods in stairwell corners. Banks are much nicer now. The takeaway is that Indians are hard to convince to do the right thing but you can always find creative ways to block their worst instincts.\n4. India has such a young and dynamic population that instead of a low trust society, I like to think of us as having an [Eternal September](https://en.wikipedia.org/wiki/Eternal_September) problem where we can't seem to make any progress because newer and newer people keep entering spaces where we are trying to institute change.\n5. We are the only country I know of where the oppressors (the upper castes) voluntarily ceded some power to the oppressed (the lower castes) with basically zero resistance and definitely no civil war unlike say, America. Is it perfect? No. Is it working as intended? Well, our best leg spinner is a Yadav and even the BJP which stood against caste reservations at first has embraced caste politics. We should be proud of ourselves. The nearest equivalent would be the British giving up the Atlantic slave trade and taking centuries to compensate the losses of the slave traders . \n6. After seeing the US fall apart in two months and turn its back on Europe, even Nehru's Non-Alignment seems visionary.\n\nI firmly believe that there is something in Indian society which sets us waaaaayyyyy apart from other societies. I'm still trying to figure out what it is but when I do, I'm going to talk about it from the rooftops. We Indians need to be a lot more proud of ourselves as a nation than we are.",
            "score": -18,
            "replies": []
        },
        {
            "author": "Ashish0_0",
            "body": "There is no change bro , it was always like this , only your perception has changed , there is also the nostalgia factor , social media is a big factor in this , now you can recieve propoganda based content , there could be push to more negative content , positive content can be shadow banned . If you still don't believe me just think of all the riots , *apes , murders , attacks , lootings , gangs , accidents , scams has happened in the 2000s , the conditions the same now , condition of the govt is also same corrupted nature.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Healthy_Employer6832",
            "body": "You are experiencing a low-level anxiety. See a therapist if you can.",
            "score": -14,
            "replies": [
                {
                    "author": "ajeebladki",
                    "body": "Most of the country is. Systemic injustices and poverty are the reason.",
                    "score": 9,
                    "replies": []
                }
            ]
        }
    ]
}