{
    "title": "India's third home-built 700 MW nuclear reactor starts operations",
    "author": "sherlock31",
    "subreddit": "india",
    "rank": 7,
    "score": 839,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 66,
    "url": "https://www.moneycontrol.com/news/business/economy/india-s-third-home-built-700-mw-nuclear-reactor-starts-operations-12966864.html",
    "id": "1jdzm4z",
    "selftext": "",
    "comments": [
        {
            "author": "devgrv",
            "body": "India has planned to add 18 more nuclear reactors by 2032 and bring the total nuclear power capacity to 22.4 GW",
            "score": 207,
            "replies": [
                {
                    "author": "natureroots",
                    "body": "I hope they have a plan to safely dispose nuclear waste. Some of the larger countries with millions of hectors of unexplored land still find it challenging due to protests from localities.",
                    "score": -24,
                    "replies": [
                        {
                            "author": "Significant_Hat1509",
                            "body": "Management of radioactive waste in Indian context includes all types of radioactive wastes generated from the entire nuclear fuel cycle and also from installations using radionuclides in medicine, industry and research. In the choice of processes and technologies adopted utmost emphasis is given to waste minimisation and volume reduction. The comprehensive radioactive waste management operations are carried out fulfilling all prescribed regulatory requirements.\n\nSafe management of nuclear waste has been accorded a high priority right from the inception of our nuclear energy programme. Nuclear waste in gaseous, liquid and solid forms is generated during operation & maintenance activities of nuclear facilities. The processing technologies adopted for management of nuclear waste are summarized below:\n\n(1) Gaseous waste is treated at the source of generation. The techniques used are adsorption on activated charcoal and filtration by high efficiency particulate air filter. The treated gases are then diluted with exhaust air and discharged through tall stack with monitoring.\n\n(2) Liquid waste streams are treated by various techniques, such as filtration, adsorption, chemical treatment, evaporation, ion exchange; reverse osmosis etc., depending upon the nature, volume & radioactivity content. The emphasis is on volume reduction and the concentrate generated therefore is immobilized in inert materials like cement, etc.\n\n(3) The radioactive solid waste generated during operation and maintenance of nuclear facilities are segregated and volume is reduced using various technologies like compaction and incineration. The solid/solidified waste is packaged in suitable containers to facilitate handling, transport and disposal. Disposal of waste is carried out in specially constructed structures such as stone lined trenches, reinforced concrete trenches and tile holes.\n\n(4) India has adopted closed fuel cycle option, which involves reprocessing and recycling of the spent fuel. During reprocessing, only about two to three percent of the spent fuel becomes waste and the rest is recycled. This waste, called high level waste (HLW), is converted into glass through a process, called vitrification. The vitrified waste is stored in a Solid Storage Surveillance Facility for 30-40 years with natural cooling prior to its disposal in a final disposal facility. The need for a final disposal facility will arise only after three to four decades. This will also provide sufficient time for the reduction in the radioactivity of some of the short-lived radioactive species in the vitrified waste.\n\nPrivate Agencies are involved in this process\n\nThe Minister of State for Personnel, Public Grievances & Pensions and Prim Minister’s Office Shri V.Narayansamy gave this information in reply to a written question in the Rajya Sabha today\n\nSource: https://pib.gov.in/newsite/PrintRelease.aspx?relid=98900",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "RaiseEuphoric",
                            "body": "Not sure why so many downvotes! This is an absolutely valid concern!  \nNIMBY-ism is a real thing in the US & many other countries.\n\nSafely disposing Nuclear Waste is a real problem all over the world.  \nI also hope that there's a proper plan in-place for safely disposing the nuclear waste.\n\nThose concerns notwithstanding, I think this is a great new development for India.  \nDespite safety concerns, Nuclear Power is going to be critical in the medium to long term.",
                            "score": 55,
                            "replies": []
                        },
                        {
                            "author": "jackass93269",
                            "body": "SpaceX should design shuttles to to blast this off to space.\n\nAlong with Elon Musk",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Ok_Can2549",
                                    "body": "I was thinking this before but what if the rocket explodes in the air?\n\nWe can then play Fallout irl",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "noobkill",
                                            "body": "That's the main reason it hasn't been done yet.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Agoras_song",
                                            "body": "Agreed. Don't really want to take chances with Elon",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Quirky_Machine_5024",
                                    "body": "Reminds me of futurama episode",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WorkOk4177",
                            "body": "Nuclear power plants produce way less waste compared to coal fired plants , we also reuse the nuclear waste",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Arj_toast",
                            "body": "India reprocesses it's waste so disposal is much easier",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MonsterBeast123alt",
            "body": "Letss fucking gooo!!!!",
            "score": 33,
            "replies": []
        },
        {
            "author": "Mayank_j",
            "body": "The best news I read today!\n\nWe do need to bring down the production times by under 6 years and maybe gun for modular plants outside of cities. Collaboration with nuclear front-runners like France, South Korea,  China, Japan etc should also be something to look into.\n\n*** \n\nEdit: To the people asking about nuclear wastes and other issues I did write a small comment about it:\n\n[I mean nuclear is there but people scaredy-scaredy.](https://np.reddit.com/r/india/comments/y0xeqa/comment/irukikx/)\n\nThese were the vids I linked there, sad to see same questions still arise:\n\n* [Thriving on Thorium](https://youtu.be/M2X0klAjT7Q)\n* [Thorium Lifters could power the Earth for Billions of years! ](https://youtu.be/74iiaXIVtZI)\n* [Small Modular Reactor Explained ](https://youtu.be/cbrT3m89Y3M)\n* [Reactors built in Shipping Dockyards](https://youtu.be/uljEr4En6iY)\n* [We solved Nuclear Waste decades ago](https://youtu.be/4aUODXeAM-k)",
            "score": 15,
            "replies": []
        },
        {
            "author": "basil_elton",
            "body": "When you realize that you have 91 GW more to add before your (recycled) slated goal of 100 GW by 2047, which translates to installing roughly 6 of these 700 MW reactors per year over the next 22 years, maybe then people will understand that the targets set for nuclear power in India were always a pipe dream.",
            "score": 138,
            "replies": [
                {
                    "author": "HugeStreet6464",
                    "body": "Baby steps, can’t expect to run without walking first. But glad that we are still focused on diversifying our energy production. We need to speed up the building and commissioning of rector, but not at safety compromising speed. Don’t want another Chernobyl.",
                    "score": 196,
                    "replies": [
                        {
                            "author": "basil_elton",
                            "body": "Each reactor of this size typically takes 8-10 years on average to commission. A significant portion of the costs when building a nuclear reactor relates to the stringent quality standards that stuff like the concrete and steel used in construction is subjected to. The same is applicable for components related to the equipment used when running the plant.\n\nThere is simply no way that the construction of nuclear reactors of this size can be sped up without compromising on safety standards.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "HugeStreet6464",
                                    "body": "there is a reduction of manufacturing cost and time when you further standardise process and sub components. Manufacturers are incentivised to setup production lines and invest in further inspection manpower and facilities. Similar to how a country like China has sped up its scaling of manufacturing. \n\nWe need to focus on reactors which we can build with our limit, allowing for the support base to be strengthened. This will reduce the overall cycle time and allow us to run parallel projects.",
                                    "score": 42,
                                    "replies": []
                                },
                                {
                                    "author": "shubhankar9370",
                                    "body": "When the electrification of Indian railways were commencing back in 2014-15, many people said electrification of this scale will take decades but still a very optimistic target of completion at 2030 was set. It's 2025 and we have already achieved 97%+ of electrification.\n\nSimilarly, Once we have the tech and R&D established, Indian govt will push for multiple Nuclear projects everywhere cuz it's simply cheaper and better for the environment.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "basil_elton",
                                            "body": "Electrification of railways is a much less complicated engineering challenge than installing nuclear power at a rate 30% faster than what China could manage.",
                                            "score": -9,
                                            "replies": []
                                        },
                                        {
                                            "author": "kingclubs",
                                            "body": "Electrification of Indian railways started way before 2014\n\nCORE was founded in 1979",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Gray_Jedi_1",
                                    "body": ">There is simply no way that the construction of nuclear reactors of this size can be sped up without compromising on safety standards.\n\nNot necessarily. The RAPP Unit 7 was constructed in record breaking time because of decades of experience and standardization of a lot of manufacturing processes and equipment. If we continue with more PHWR reactors, combined with BSMR, captive reactors and fast breeder (this will take more time), we can reach our target without compromising. \n\nMoreover, all the new reactors will come under IAEA, so the strict standards will be maintained.\n\nThe only problem is securing the required uranium. Even for that, we are looking at thorium based fuels.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "firewirexxx",
                                    "body": "Period.",
                                    "score": -12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hackinet",
                    "body": "We might not fully reach our nuclear goals, but it’s still a step in the right direction. Progress has to start somewhere, one step at a time.\n\nBut let’s be real, even if we didn’t start, you’d still be whining.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "binarydaaku",
                    "body": "Ha! Karo toh issue, na karo toh issue!  \n\nYou do understand that it takes first step before you finish a marathon? \n\nAlso, your calculation above is based on 700MW per reactor, Why would you assume it might not ramp up to 7 GW per reactor? (like Koreans)",
                    "score": 65,
                    "replies": [
                        {
                            "author": "basil_elton",
                            "body": "Please explain how India can achieve 91 GW in 22 years when the current record holder is China who only managed 34 GW in 10 years.\n\n7 GW reactors? Do you know that costs increase exponentially with reactor output?",
                            "score": -27,
                            "replies": [
                                {
                                    "author": "Hackinet",
                                    "body": "Nuclear has the best cost per MWh. What are you even talking about?",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "basil_elton",
                                            "body": "The opposite in fact. Both in terms of the cost to set up a plant of a given capacity and the cost of electricity paid by the consumer per kWh. \n\nAnd if you think that the cost of a 7 GW reactor scales up linearly from the cost of a 700 MW reactor, I have a bridge to sell you.",
                                            "score": -10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Gray_Jedi_1",
                    "body": "With the amendments in atomic energy act this year allowing private players and BSMR, it is definitely possible. It just needs a constant strong push from the government.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "basil_elton",
                            "body": "Inviting private players is literally what Manmohan Singh was trying to do without adequate liability clauses 15 years ago.\n\nNo private players are going to come. One of the three companies who were supposed to come to India back then under the Indo-US nuclear deal has become bankrupt, and the other one doesn't have skilled welders to employ for the upkeep of their own plants.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Gray_Jedi_1",
                                    "body": "It took every ounce of strength manmohan singh had to even pass the 123 agreement and CLND Acf. But he did it. There was no traction for private players back then.\n\nBut now there is, with amendments in both atomic energy act and the CLND act, private players are definitely more willing than before. Ambani, Adani, Vedanta, all major PSUs and a few more firms are ready to invest as soon as the amendments are done. NPCIL is also more than willing to collaborate with private firms now to raise the required funds.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "basil_elton",
                                            "body": "Adani, Ambani, Vedanta? Really?\n\nJust taking this one at a time - what's the latest update on Vedanta's JV with Foxconn for a silicon fab?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "RedandWhiteFan",
                                                    "body": "Bondho hoye geche Vedanta Foxconn JV. Tui khushi? (It’s shut down. You happy?) Assumed you speak Bangla from your handle. Would be hilarious if you don’t and have a handle unironically sucking off a colonizer.\n\nBut fear not Vedanta is looking for another JV to take its place. Also, if you read that piece of news, you must also know that in December of last year Foxconn asked GOI to set up another semiconductor manufacturing plant in India. Which is now being considered. It was a disagreement between two private parties, it happens often in JVs, partnerships, acquisitions. Sometimes the deal doesn’t make sense because of your own risk tolerances and it’s best to walk away.\n\nHopefully negative nancys like you will be heartbroken when India begins manufacturing chips onshore, hopefully you’ll be more disappointed when they move up to higher nodes, and even more when the value chain integrates vertically.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RedandWhiteFan",
                    "body": "Toh band karde - we should close it then?\n\nThat’ll surely bring us closer to the 91GW target? With logic like that, god help my nation. Say we don’t get to the target, but we get 2/3rd the way and Renewables scales up to make up the balance. If nuclear wasn’t there, the balance would be made up of fossil fuels. Is that a win or a loss in your book?\n\nA fully renewable powered grid is impossible with current technology. There are parts of the utility demand - the base load - that is mostly supplied by high energy density fuel. Currently the majority of those are coal fired. Nuclear is the only clean substitute that we have. The targets are likely based on projections with some padding across the sectors, in case any sector doesn’t make it. That sector could very well be Nuclear, but that was likely accounted for the strategy.\n\nWhen parts of the west are going through a downturn in the nuclear sector is precisely when a developing economy should declare lofty goals and try to gain that technology and knowledge. It’s strategically sound. That it could be executed faster may be argued but flatly dismissing the targets as foolish is in itself foolish.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "basil_elton",
                            "body": "The sole reason why I don't support nuclear power with the technology we currently have is the costs. I don't think you, and most of the other respondents to my comments have any idea about the actual economics of the full life-cycle of a nuclear power plant.\n\nDo you know why the West is going through a nuclear downturn? It is because they severely underestimated the costs of nuclear. Most of the nuclear power plants in the US, UK and Europe were commissioned in the 1970s and 1980s and are nearing the end of their planned operational duration for which they were designed.\n\nAnd the economics of decommissioning nuclear power plants has been severely underestimated. In the UK alone, they have been underestimated by a factor of 5 to 10, bringing up the revised estimates for decommissioning to 100-200 billion GBP. In France, decommissioning of a puny 70 MW reactor has incurred a cost overrun of 20x, and still hasn't been completed even after 15 years. \n\nAnd this doesn't even consider the fact that the cost per kWh that customers pay for nuclear power - when you account for the entire life cycle of a reactor - is 30-50% higher than a coal plant - by even the most generous estimates. Some authors who analyzed these numbers estimate that even with a carbon tax like the EU has proposed, customers would have to pay less per unit of electricity for coal than nuclear.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "RedandWhiteFan",
                                    "body": "Yes I am aware of the drivers behind the costs of nuclear energy. Much of it including the decommissioning costs you cite are regulatory driven which is fueled by mass hysteria against nuclear power by citizen groups funded subversively by coal companies. Nuclear is plagued by bad policy making not availability of technology. You might temporarily be able to make coal look cleaner on paper, but its social and health costs are real costs to the economy.\n\nYou are leaning hard on no one having any idea what the economics are, aren’t you? Ex-MBB strategy consultant here, 5 years in consulting with hydrocarbons, worked with the largest utilities and producers in the US on capital excellence, now run my own renewable energy dev co. Please go peddle your half baked theories somewhere else.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Rhaegar15",
                                    "body": "People like you would have said no to solar because it was too expensive 30 years ago.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "784512784512",
                                    "body": "Same was said w.r.t solar decades back. Costs initially increase and then come down once enough research has been done to develop better efficient tech and systems. Instead of shying away from it, we should throw as much money as possible at it and become a front runner in this, especially given how energy insecure we are. China, similar population, so similar peak demands, and similarly energy insecure - knows this and thus has gone all crazy over renewables. In the upcoming volatile world where everyone is becoming selfish, you cannot put any price on energy reliance. Think of it as defense spending if that helps you come to terms with the cost of the nuclear tech setup.\n\nWest went through a downturn because US shale boom, cozy Russia, and stable Norway gas made them over dependent on fossil. The oil lobby will not let US go all gung ho on nuclear but smart western nations like France know the importance of renewables + energy security and look how well poised they are due to their forward thinking.\n\nSame is true of decommissioning plants. Throw more money at it, we will soon get the right mix of tech and efficiency. These things take time, like space tech and research, but once achieved - they will make us set forever.\n\nEven if after including the decommissioning costs, the LCOE of nuclear reaches 1.5-1.6x of coal - it is still worth it. In fact we are at a sweet spot I think. Coal has centuries of tech improvement and design efficiency in its shadow. If we can give another 3-5 decades to nuclear, it will easily go the solar route and have a way lower LCOE than coal. Many research reports and think tanks predict the same.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "RedandWhiteFan",
                                            "body": "Exactly! We are so close to having Small Modular Reactors. I wish I was in that sector. It’s one of the most exciting tech spaces to work in rn. Once the elevated AI compute demands hit the grid, I wonder where these anti-nuclear fanbois will supply that demand from?\n\nAlso, nuclear waste disposal isn’t quite the challenge that it is made out to be. The amount of waste generated is minuscule compared to other energy sources and much of it could be recycled in FBRs if we decide to. It’s again a question of policy and investments to scale. All of the fuel rods consumed in all of the reactors since the first nuclear power plant went online would likely fit in all the stadiums named after Pandit Nehru in India. Probably won’t even go past the first few. Ha!\n\nCompared to toxic leachate, heavy metal, and even radioactive waste generated from Coal fired plants, it’s nothing. Notwithstanding the particulate and greenhouse gas emissions, and the impacts of mining coal. \n\nCoal has had a couple more centuries of investments into it than nuclear and yet if you add up the actual cost of nuclear power to the economy and compare it to coal, it does better. But there are still apologists for it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BaseballAny5716",
                    "body": "You want Chernobyl season 2 ?.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrpumpkin007",
            "body": "Now we talkin!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Obvious_Quantity_521",
            "body": "I am so weak reading all the filthy, obviously non Indian commenting about nuclear waste management, only if they didn’t have a walnut size of a brain to know about India’s history with nuclear waste",
            "score": 2,
            "replies": []
        },
        {
            "author": "vadakkus",
            "body": "Does anyone know what India does to manage nuclear waste? What do we do to store or dispose of it?",
            "score": -13,
            "replies": [
                {
                    "author": "MuttonMonger",
                    "body": "Problem after like a 1000 years lol. It's still much more manageable than curbing climate change now.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RecognitionSquare543",
            "body": "I hope it is properly managed by people with brains and knowledge. \nThe last thing we need is nuclear waste being spread on farms or put in planters around the city like they do with landfill waste. \nThe next thing you know they will be claiming that fermented fruit peels aka 'bacteria' can also magically make nuclear waste inert too.",
            "score": -51,
            "replies": [
                {
                    "author": "LiteratureNearby",
                    "body": ">The last thing we need is nuclear waste being spread on farms or put in planters around the city like they do with landfill waste. The next thing you know they will be claiming that fermented fruit peels aka 'bacteria' can also magically make nuclear waste inert too.\n\n\nWhat an absolute conspiracy brained lunatic statement. India has been a nuclear armed country since the 70s and have been running nuclear power since before that. We know what to do with that waste",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "confuseconfuse",
                    "body": "Nuclear waste isn't goo.",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "supamonkey77",
                    "body": "Fermented peels? \n\nBeta our go to response/remedy is always [Gau mutra and/or Gober](https://www.indiatoday.in/india/story/cow-dung-chip-against-radiation-kamdhenu-aayog-1731007-2020-10-13).",
                    "score": -15,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -70,
            "replies": [
                {
                    "author": "tamasoma",
                    "body": "Nuclear is controllable. You can increase and decrease production on demand. Similar to coal and hydrothermal power plants. The idea is to have renewable energy sources but since they fluctuate based on natural conditions, have a base of controllable energy source. Nuclear and hydro are much less polluting compared to coal.\n\nThe boiled water can be recycled. It doesn't need to evaporate into the air. Usually pure distilled water is used which is better for reducing corrosion. The cooling water used on outer parts can be non-pure and let to evaporate, but it is miniscule compared to the natural evaporation that happens everyday due to the sun from water bodies. Water cycle usually brings it back down again as rain.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "Express-World-8473",
                            "body": ">The boiled water can be recycled. It doesn't need to evaporate into the air\n\nYup closed cycles have higher efficiency than open cycles. Especially the new engines with closed cycles have over 60% efficiency.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Thamiz_selvan",
                            "body": "> Nuclear and hydro are much less polluting compared to coal.\n\nThis is highly controversial. Hydro submerges a huge swathe of land and causes irreparable damage to the ecological system around the dam.\n\nNuclear is one idiot away from having a wasteland of tens of thousands of hectares. \n\nOn top of that, both hydro and Nuclear are capital intensive and have high LCOE (levelized cost of electricity). \n\nWe are burnt by sun everyday, why not install solar, while we collaborate with someone (ahem) for sodium batteries or flow batteries? \n\nhttps://www.lazard.com/media/xemfey0k/lazards-lcoeplus-june-2024-_vf.pdf",
                            "score": -4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WideYorker",
                    "body": "Bruh the steam is recycled. The plant is not boiling water into the air.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "jarvis123451254",
                    "body": "i do not understand why not we push nuclear energy more, its stable, creates way less pollution, has huge safety with current gen reactors",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "devgrv",
                    "body": "Hydro is very bad for the environment and ecosystem especially downstream.\n\nWind and Solar energy are inconsistent and require very large scale battery installations to make the energy grid stable. It is also more susceptible to natural disasters.It also requires a lot of land\n\nNuclear energy is very consistent and required to have a stable grid. Water is currently also used in coal power plants so it will just replace those minus the pollution.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "Hackinet",
                    "body": "Solar panels need a lot of space to produce a good amount of electricity. They only work during the day and require a lot of materials to make, which means more mining. \n\nTo put into perspective, to power a city like Mumbai, which has a peak electricity demand of around 3,500 megawatts (MW), you would need about 100-130 km² of solar panels, roughly the size of Chandigarh.\n\nWind power only works well in windy areas. If there’s no wind, there’s no power. It can also be harmful to birds.\n\nHydropower is reliable and can run 24/7, but it requires large rivers or dams, which aren’t possible everywhere. Building dams can flood land, harm wildlife, and change ecosystems. It can also be affected by droughts.\n\nNuclear energy is more reliable than solar and wind and isn’t limited by location like hydro. It also produces electricity more efficiently for the cost.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Express-World-8473",
                            "body": ">Solar panels need a lot of space to produce a good amount of electricity. They only work during the day and require a lot of materials to make, which means more mining. \n\nAlso they need to get replaced every 25 years. \n\n>uclear energy is more reliable than solar and wind and isn’t limited by location like hydro\n\nThey actually have a limitation. Nuclear energy uses water as a heat sink (just like thermal), so you need a body of water nearby and also, they need more water than a thermal plant for the same amount of electricity production.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UniStudent69420",
                    "body": "Bruh powerplants have closed loops for the steam used to power the generators. The water vapour you see comes from the cooling towers and the water loss is neglegible when you compare it to the water consumption of the people and businesses using power from the powerplant. \n\nNuclear is also the easiest form of non-polluting power generation to scale. Hydro, wind, solar etc. all require specific geographic conditions to be viable, and these conditions may not be true all the time. Nuclear doesn't have to face such weaknesses and can be online 24/7.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "flatulant_corpse",
            "body": "Using Indian cement for layering the walls being regarded as “home-built”….what a complete farce! \n\nIndia doesn’t have even a single native fission reactor design. It has always borrowed tech from either Canada or Russia before and from France these days.\n\nAnd its nuclear ambitions are too overrated for what its current technology can manage.",
            "score": -24,
            "replies": [
                {
                    "author": "upandup_09",
                    "body": "You're partially correct here. Though we got the initial help from Canada, Russia, etc.But through years of operational experience, we have acquired a lot of expertise in this domain. Remember no foreign country will provide you with an overall in-depth x-ray of a reactor, even to reverse engineer this stuff is quite a complex task , but here we are almost very comfortable in running PHWRs. And that's why the future projects not just seem very optimistic but very much practically achievable.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}