{
    "title": "‘BJP wants to make Maharashtra next Manipur’: Aaditya Thackeray attacks state govt over Nagpur violence",
    "author": "Sea_Meal_1750",
    "subreddit": "india",
    "rank": 6,
    "score": 407,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 37,
    "url": "https://www.thehindu.com/news/national/maharashtra/bjp-wants-to-make-maharashtra-next-manipur-aaditya-thackeray-attacks-state-govt-over-nagpur-violence/article69343878.ece",
    "id": "1je4fdl",
    "selftext": "",
    "comments": [
        {
            "author": "Sea_Meal_1750",
            "body": ">“If you take a look at Manipur, the state has been experiencing violence since 2023. There are conflicts across the state. Will there be investments there or growth in tourism? No. They want to put Maharashtra in the same situation. I was reading today that Vietnam is a smaller country than India, and the population is also less, but their electronic industry is 3 times more. Our country considers itself strong, but the BJP is trying to divide the country into districts, religions, and castes,” said Mr. Thackeray",
            "score": 78,
            "replies": [
                {
                    "author": "sachin_root",
                    "body": "ha majority Hindu use karenge jitne ke liye, Under Hindu umbrella diff cast ko use nahi karenge Main branch use karenge and them aek enemy created karenge jisase main branch hindu (including all sub casts) aek ko vote denge, I want to ask are these parties Hindu Muslim parties or they are public parties made to make progress in the country. U can't make progress if the parties are winning using hate of people towards other people. Bunch of leaches.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Recognition-Radiant",
            "body": "I don't want the state the fall into riots because of Communal Violence. \n\nThere were no such major Communal tensions in Nagpur \nbut those buffoons made this mess.\n\nI am just scared that this will turn into a frequent occurrence in Nagpur .",
            "score": 76,
            "replies": [
                {
                    "author": "noir_dx",
                    "body": ">I am just scared that this will turn into a frequent occurrence in Nagpur .\n\nIt happened on Mira Road, Mumbai last year. I wouldn't be surprised if something major happens. I hope for the best, but I expect the worst.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Recognition-Radiant",
                            "body": "On the 30th, Gudi Padwa is celebrated, and on the 31st, Eid is there. I'm really worried that these dates might spark major riots or tensions.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sea_Meal_1750",
            "body": ">\"The BJP is shameless about it when it happened in the hometown of the CM. Sadly, when the BJP cannot govern, they resort to violence, riots, this is their set formula in every state, if you look at Manipur, that is what they want to convert Maharastra to, today no investment, tourists go to Manipur, this is what they want for Maharashtra. They are trying to dig up history of a person who lived 300-400 years ago, but they cannot speak about the present, future. The irony is that the grave is protected by Centre, if CM Fadnavis has the courage, then he should visit PM Modi, and ask for removal of grave. It's simple,\" said Sena (UBT) leader Aaditya Thackeray.\n\n\n\n\nhttps://www.deccanherald.com/india/india-latest-updates-live-news-politics-nagpur-violence-devendra-fadnavis-shiv-sena-congress-bjp-tmc-rahul-gandhi-narendra-modi-aap-aurangzeb-row-3450818?utm_source=whatsapp&utm_medium=referral&utm_campaign=socialshare",
            "score": 31,
            "replies": [
                {
                    "author": "sachin_root",
                    "body": "unfortunately people are so short sided that I got reply in /Maharashtra  sub that why u don't watch news lazy, Instead of here asking stupid questions. the people are so blinded that they don't even want to here what others are saying.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Paree264",
            "body": "There was a time when Maharastrians used to make fun of  the cow belt , alas now they are the cow belt . How the turntables 🤷‍♂️",
            "score": 53,
            "replies": [
                {
                    "author": "mylifeonearth_",
                    "body": "They're not new to religious riot. Maharashtra is the epicenter of 'RSS' and shiv sena. Only they could hide it behind limelight of  celebrities and movies.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "SpicyPotato_15",
                    "body": "Hindu Muslim riots and violence aren't new in Maharashtra.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Top_Intern_867",
            "body": "Fadnavis is oneof the worst Home Ministers Maharashtra has ever seen",
            "score": 37,
            "replies": [
                {
                    "author": "invincible_obito",
                    "body": "He is chief minister, first learn who is who.\n\nBade aaye hai revolution lane... saste revolutionary.",
                    "score": -40,
                    "replies": [
                        {
                            "author": "Top_Intern_867",
                            "body": "He also holds home portfolio, dumb!",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "invincible_obito",
                                    "body": "Why blame him? Can you tell me?",
                                    "score": -31,
                                    "replies": [
                                        {
                                            "author": "Purple_Feature_6538",
                                            "body": "Coz his people were the one's fanning the flame and he called for peace only when under the convenience of the \"others\" rioting. Not when his followers were the one's protesting. \n\nThey were protesting in Nagpur. Home of RSS. When your own political leadership is calling for the same thing. Why are you protesting? \n\nTo sow communal hatred and you called out for peace after everything happened.",
                                            "score": 17,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sabar-karo",
                            "body": "Is bachde ko kon khula choda?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "sachin_root",
                                    "body": "Punit Punia dekte ho ?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aakarsh_K",
            "body": "Oh the irony. Listening this from Shiv Sena is like a bar owner saying alcohol is sinful.\n\nRiots and communal violence were flagship of Shiv Sena & Thackeray family.",
            "score": 15,
            "replies": [
                {
                    "author": "Sea_Meal_1750",
                    "body": "Rationalist Prabhodankar Thackeray aka Keshav Sitaram Thackeray the father of Bal Thackeray was a great person. His son turned out to be a extremist. Bal Thackeray was brought to knees by indira gandhi during emergency. And being only pro marathi didn't work for them so he thought about shifting to communism but ultimately hijacked hindutva. \n\n\nUbt and his son seem to be influenced by Prabhodankar. Although I won't trust them but they are still less worse than Shinde,F20,Sharad Pawar, now Congress can't win shit in MH ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "mylifeonearth_",
                    "body": "Like, ban the alcohol, only we'll sell it to you.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chintiktan",
            "body": "Shiv Sena original slogan - \"Bajao Pungi, Hatao Lungi\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "Own-Awareness1597",
            "body": "This is karma - Sangh bypassed Khadse, the most prominent leader just because he was OBC, in favor of Fasnavis dynast. \n\nNow all of Maharashtra has to pay the price.",
            "score": 6,
            "replies": [
                {
                    "author": "future1904",
                    "body": "Modi is a obc",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thegodfather0504",
            "body": "we want separate vidarbh ",
            "score": 2,
            "replies": [
                {
                    "author": "Sea_Meal_1750",
                    "body": "Iirc Fadnavis said that he won't marry until vidarbha seperates",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "apurbak9",
            "body": "What Manipur ? Manipur qa hai bhai qa hua hai Manipur mei ?\nIndian state hi hai na ???\nKoi batayega qa hua waha ...??\n/s",
            "score": 2,
            "replies": []
        },
        {
            "author": "sayzitlikeitis",
            "body": "Destruction of Maharashtra by the fascists who control it would be a beautiful sight for the rest of the economy. Hopefully the public who keeps giving them power will learn something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ig1M",
            "body": "sometimes progress begins after burning down to the ashes. Let's welcome our fate",
            "score": -2,
            "replies": []
        },
        {
            "author": "invincible_obito",
            "body": "What was the reason for riot?",
            "score": -3,
            "replies": []
        }
    ]
}