{
    "title": "Ajmer Sharif(khwaja Garib Nawaz Dargah)",
    "author": "sidelower_berth",
    "subreddit": "india",
    "rank": 3,
    "score": 269,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 106,
    "url": "https://www.reddit.com/gallery/1jebh6n",
    "id": "1jebh6n",
    "selftext": "",
    "comments": [
        {
            "author": "rahulthewall",
            "body": "If you believe that your religion encourages abusing other religions, then you don't belong in r/India. If you believe that you should not visit dargahs because temples exist or because dargahs are shirk, you don't belong in r/india. \n\nThere are other Indian aubreddits that encourage fundamentalism. We do not, we still believe in an India that gives equal rights to each faith to practise, profess and propagate their religion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 24,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 18,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BuraqRiderMomo",
            "body": "Are there many Hindu/Christian vendors outside the Dargah? Asking I have heard its a place of religious harmony.",
            "score": 10,
            "replies": [
                {
                    "author": "razarahil",
                    "body": "Christian No, Hindu yes. Most of them are Sindhi.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "sup_suckas",
            "body": "I also went there 2 years back but had no clue about the place then I looked up on Wikipedia about its history, and found out so so many huge name of people have went there and how historic the place is.\n\nAur Jo comments me hate faila rahe unko bata du apke priye modiji bhi kayi baar Gaye hai aur chadar chadhai hai.ab Jo mirchi lagi hogi uspe Pani daal lo.",
            "score": 14,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 4,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PrisonBreakQ",
            "body": "Why is there so much hate in the comments? Just respect others religion",
            "score": 8,
            "replies": [
                {
                    "author": "Dr_6PacMan",
                    "body": "And this wasn't even a political post. There's nothing in this post to criticize. It's just a person, who went to a place and shared some pictures they took. Hatered is easy, that's why they do it, for in order to be peaceful one has to reason, and rationalize, something Indians don't like.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "PrisonBreakQ",
                            "body": "Exactly these Hindu saviors don’t know anything about Hinduism. True Hindus would never insult someone else’s religion",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Hermit_Humorist",
                                    "body": "Exactly. Hinduism, at its core, has always embraced pluralism and respect for all faiths. The concept of ‘Vasudhaiva Kutumbakam’ the world is one family is deeply ingrained in it. If someone truly understands Hinduism, they wouldn’t feel the need to degrade others. It’s sad how people misrepresent religions without even knowing their essence",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "PrisonBreakQ",
                                            "body": "This is due to instagram knowledge. They have never read any religious texts or even tried to understand the lessons from Hinduism. All they care about is playing Holi and Diwali firecrackers.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Hermit_Humorist",
                                                    "body": "Right? The real essence of Hinduism isn’t just in celebrations but in its wisdom and way of life!",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Legitimate-Range-627",
                                            "body": "Hindus who believed in pluralism went extinct in Pakistan and Bangladesh.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Hermit_Humorist",
                                                    "body": "Pluralism isn’t what led to their extinction, intolerance did. Blaming the victims for believing in peace instead of confronting the forces that destroyed it is a lazy way to frame history.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Dr_6PacMan",
                                    "body": "That's what this country has come down to. It's our constant state now, HATE. I bet none of these people have ever even visited the dargah or read actual history from reliable sources. Guess what, rulers are bad.. all of them. No one person rules over an entire land without bloodshed.. it's the way the world was back then. They think kings just happen to have all the gold, the jewels and the land, did the people elect one person to have all the wealth! Of course not. That's what happens when your entire world view is based on reels and movies.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "PrisonBreakQ",
                                            "body": "I don’t understand how people don’t get that no ruler was 100% good. They have always used rape as a war weapon no matter what religion or country",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Dr_6PacMan",
                                                    "body": "Good luck trying to have a rational debate with these people. When one's mind is so narrow that they cannot perceive reality with an open mind, one cannot be reasoned with. They'll take offense to your facts, they'll shame you for being humble, they'll call you anti-national for questioning their actions.\n\nI myself am an atheist, so I see things for how they are, not what I want them to be. The world is a fucked up place with or without religion, evil has no borders, no gender, no face and no cast, but it's a truth only few are able to accept.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Legitimate-Range-627",
                                            "body": "I read about the history of this place from 1992 and it was quite disturbing.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "Dr_6PacMan",
                                                    "body": "It was and I agree. What does that have anything to do with the place or the religion? A dargah is just a place, a religion is just a faith! Neither of these have any real value but what we perceive them for! It's the people who are evil, it's the people who do the crime, it's the people who spread the hate (like you. I saw your comments), not religion. Is rape exclusive to muslims? Have Hindu's never committed this crime? I can debate you for days but I want you to understand just one things.. It's the people who do the crime, blame them, not their faith or their country. There are bad apples on every tree brother, blame the apple not the tree.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Legitimate-Range-627",
                                                            "body": "If you saw my comment then you won't be lecturing me. I had the worst experience of my life there. My gf still pukes thinking about her experience. I went home and advised everybody against this place. Maybe mecca madina would be more sane and civilized  but sorry but I am not buying it.",
                                                            "score": -7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Legitimate-Range-627",
                    "body": "probably people hate this place because of its history of mass rape in 1992",
                    "score": -3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Elegant_Judgment6367",
            "body": "The crowd is so bad here",
            "score": 4,
            "replies": []
        },
        {
            "author": "Curious-Wonder3828",
            "body": "What's with the weird downvotes in the comments? (except for the communalistic ones)",
            "score": 6,
            "replies": [
                {
                    "author": "CremeValuable02",
                    "body": "Wo log aagye hain",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Dr_6PacMan",
                            "body": "If you want upvotes. Say something shitty about the dargah.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "CremeValuable02",
                                    "body": "Nahi bhai mujhe na chahiye upvotes. \nMain ek baar aise dargah jake experience karna chahta hun. Kun faya kun vibes feel krna chahta hun. Sufi nights ya jo bhi hoti hongi udhar. Mandiron ka to main achhe se janta hun .",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "brownredditt",
                                            "body": "HazratNizamuddin in Delhi",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Dr_6PacMan",
                                            "body": "It's calming. People from all religions go there.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "without_star",
            "body": "Pretty 🫶",
            "score": 1,
            "replies": [
                {
                    "author": "Lightakatorque",
                    "body": "Visited this year only itna jada dirty hai na like itni bheed and gandagi hai uss place par 😔",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "noir_dx",
            "body": "There are so many bigots here. Complain about bad roads, lack of education, clean water, air quality, and other things that matter??? Nope! But attack their own fellow countrymen who happen to follow other religion? Fuck yeah!!! \n\nLong dead British colonizers are enjoying seeing what you do in this country from their graves.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CriticismTiny1584",
            "body": "Every sub is filled with cowdung. You know why, cowdung hits the fan, thats the situation of india now..\n\nShits hits the fan, real bad..",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok-Zone5602",
            "body": "This place is magical",
            "score": 0,
            "replies": []
        },
        {
            "author": "sayzitlikeitis",
            "body": "If you wanted to visit but never got around it, probably should do so now before they turn it into a temple.",
            "score": -1,
            "replies": []
        },
        {
            "author": "zikr-e-nilofer-7233",
            "body": "A place where you have chance to dive into your past life, what you did, good or bad, feel repentance,  give charity which is duty  but only to needy ones, and then qawwali that will take you into river of memories feeling of pain happiness , mistakes, everything , sit on ground think and think of yourself, your family your friends and your life path  , feel the actual mean of life",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrisonBreakQ",
            "body": "So pretty. Is this the same place that was shown in Jodha Akbar",
            "score": 6,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -8,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Low-You-2983",
            "body": "Best place for to wish anything that you ever wanted in life. Though crowded but you will find peace and stillness in your heart.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BackgroundAd3878",
            "body": "does muslims also use saffron colour cloth on dargah?",
            "score": -14,
            "replies": [
                {
                    "author": "live7230",
                    "body": "Actually yes, saffron (bhagwa for hindus and Chishti for muslims) is a very commonly used color at Dargahs. You should pay a visit.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Amazing-Good1445",
                            "body": "You are wrong , dargahs use saffron because our converted ancestors changed religion but kept some hints that they were converted forcefully.\nHence saffron is a symbol of fight against islamic invasion",
                            "score": -11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "choomba96",
                    "body": "My god.... Why do people behave like Muslims who are indian are not descended from the same people who lived here 1000 years earlier.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Ornery_Rate5967",
                            "body": "we're definitely indian by origin, but use of saffron has nothing to do with that. I assume saffron color in sufi/barelvi culture is somehow related to persian culture.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "choomba96",
                                    "body": "Again the color saffron is not just an Indian thing and it's not something born out of the subcontinent but brought forth through ages of Indo Aryan migration.l(Iran is the saffron Capital of the world)\n\nYou conflate being of Indian origin with being of Hindu origin here. That's incorrect. You're fundamentally subcontinental, your culture and senses are subcontinental. Religion is just one part of who you are despite the concept of Ummah.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Ornery_Rate5967",
                                            "body": "please, culture doesn't necessarily have to be same as race. sufism didn't originate in india. we are by born indians and accepted a new culture. there's nothing wrong in it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "justanavguser",
                    "body": "Yes we do.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "kandamrgam",
                    "body": "Why is this downvoted for a genuine question?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "blood-reaper07",
                    "body": "Yes.. They called saffron chishti rang too",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}