{
    "title": "Announcing Reddit's second virtual Hackathon with over $36,000 in prizes",
    "author": "Togapr33",
    "subreddit": "webdev",
    "rank": 1,
    "score": 152,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/webdev/comments/1j0bkcf/announcing_reddits_second_virtual_hackathon_with/",
    "id": "1j0bkcf",
    "selftext": "Hi r/webdev ,\n\nReddit is hosting a virtual hackathon from Feb 27 to March 27 with $36,000 in prizes for new games and apps --> you can read more about it [here](https://hackreddit.devpost.com/) and [here](https://hackreddit.devpost.com/).\n\nhttps://preview.redd.it/gy5fyow9owle1.png?width=1200&format=png&auto=webp&s=5049bd80b0a6a164911b2781ce0b814fdfc04a76\n\nThe TL:DR: create a new game or experience for the Reddit community using Reddit’s [Developer Platform](https://developers.reddit.com/).\n\nThe challenge\n\nBuild a new game, social experiment, or experience on Devvit (Reddit’s [Developer Platform](https://developers.reddit.com/)) using our [Interactive Posts](https://developers.reddit.com/docs/interactive_posts) feature. We’re looking for multiplayer games and experiences. Our favorite apps create [genuine conversation](https://www.reddit.com/r/Pixelary/comments/1hgau8p/what_is_this/) and speak to the creativity of redditors.\n\nPrizes\n\n* Best App\n   * First Prize $20,000 USD\n   * Runner up: $7,000 USD\n   * Honorable (10x): $500 USD\n* Feedback Award (x5)\n   * $200 USD\n* Helper Award (x3)\n   * For the most helpful and encouraging participants, nominated by fellow developers.\n* Participation Awards\n   * The Devvit Contest Trophy\n\nFor full contest rules, submission guidelines, resources, and judging criteria, please view the hackathon on [DevPost](https://hackreddit.devpost.com/).\n\nBe sure to join our [Discord for live support](https://discord.com/invite/R7yu2wh9Qz). We will be hosting multiple office hours a week for drop-in questions in our Discord. Hit us up in the Discord with any questions and good luck!",
    "comments": [
        {
            "author": "Darwinmate",
            "body": "By entering the competition will reddit own your work?",
            "score": 59,
            "replies": [
                {
                    "author": "R10t--",
                    "body": "I read their terms and conditions. Surprisingly, no!\n\nhttps://hackreddit.devpost.com/rules\n\nRead “7. Intellectual Propery Rights”",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "union4breakfast",
                    "body": "Why hasn't this been answered yet?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "The_Homeless_Coder",
                    "body": "Yeah I want to know.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "wongaboing",
            "body": "Why is Brazil not allowed?",
            "score": 37,
            "replies": [
                {
                    "author": "TNThacker2015",
                    "body": "Brazil has competition laws that make it difficult for global hackathons to operate there.",
                    "score": 56,
                    "replies": []
                },
                {
                    "author": "diegolc",
                    "body": "It must be registered & authorized by SECAP\n\nhttps://manddigital.com.br/blog/o-que-e-secap\n\nEdit: I saw wrongly that it was Caixa Economica Federal, but it was replaced by the SECAP",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Salamok",
            "body": "Are the winners voted on by the community?  Can I precast my vote for the app that makes old.reddit behave like the reddit of 10 years ago without broken image galleries and endless bait and switch nag screens trying to get me to install the reddit mobile app?",
            "score": 27,
            "replies": []
        },
        {
            "author": "j-mar",
            "body": "Wait, aren't we still mad at reddit for how they treated devs over API pricing?",
            "score": 32,
            "replies": [
                {
                    "author": "egmono",
                    "body": "Or, just \"aren't we mad at reddit\" would have been an acceptable answer lol",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ConduciveMammal",
                            "body": "IIRC the issue wasn’t Reddit’s decision to charge for the feed, the issue was their exorbitant fees and very short timeframe.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "j-mar",
                            "body": "As a principle, I'm anti-hackathon, so that's part of my feeling.\n\nThe API change felt like a step towards squashing out small devs and stepping further from the open-source roots of Reddit.  And to now attempt to tap back into those places via \"hackathon\" just feels really shitty.  If Reddit wants to say, \"hey we're a big tech company, we don't want small devs using our apis or working on our shit\", then they shouldn't _also_ say, \"do dev work for free please!\"*\n\n\n\n*-yes, I know there are prizes, but _many_ people will not win those prizes.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dotnet_ninja",
            "body": "I love how \"here and here\" each link to the exact same webpage",
            "score": 6,
            "replies": []
        },
        {
            "author": "trophicmist0",
            "body": "When I click the ‘developer platform’ link it’s taking me to the home page?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Coolfoolsalot",
            "body": "Feb 27 to Mar 27, no?",
            "score": 10,
            "replies": [
                {
                    "author": "Togapr33",
                    "body": "whoops -- yes! fixing now",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "p1xlized",
            "body": "What did Québec do?",
            "score": 3,
            "replies": []
        },
        {
            "author": "AbstractMelons",
            "body": "Cool!",
            "score": 6,
            "replies": []
        },
        {
            "author": "Diligent_Post_7276",
            "body": "Hey everyone! 🎉\n\n\nIf you're looking for great teammates for upcoming hackathons and projects, I’ve created a dedicated Discord server to help you connect with like-minded individuals in India.\n\n\nIt’s a new server, so I’d really appreciate your support! Please share the link with your college friends and help us build a strong community.\n\n\n\"You are the average of the five people you spend the most time with.\" — Jim Rohn\n\n\nLet’s build, learn, and grow together! 🚀\n\n\nLink🔗:- https://discord.gg/vt4GcWYFT8",
            "score": 2,
            "replies": []
        },
        {
            "author": "witceojonn",
            "body": "I’m ready for this!!! This is gonna be fun!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Next_Pop3517",
            "body": "👌",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beneficial-Eagle-566",
            "body": "We went from \"don't worry guys, our jobs won't be affected by AI, it's really not that good\" to literally call it cheating and downvote anyone who asks for clarification.\n\nUnless the organizers add an explicit rule against it, and commit to check and call out AI code, I'm using it. It is what it is.",
            "score": -3,
            "replies": []
        },
        {
            "author": "Beneficial-Eagle-566",
            "body": "Dumb question: It doesn't matter if we use AI tools like Claude and Cursor for some of the stuff, right?\n\nEdit: I was downvoted for asking an honest question, and the first person who attempted to actually answer  instead of taking their emotional frustration with whatever issue they have was also got downvoted...",
            "score": -15,
            "replies": [
                {
                    "author": "Sufficient_Floor8798",
                    "body": "Ai is 100% cheating since this is a compitition about your skills and using ai takes no skills.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Rata-tat-tat",
                            "body": "This is just naive tbh. Reddit isn't hosting this because they care about your skills. They want their community to give them ideas and make things that will bring value to the platform. They couldn't care less how leet you are.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "egmono",
                            "body": "Disagree here. Using AI is like trying to explain to your boss why his way is wrong and explaining it well enough to try it your way.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Amster2",
            "body": "Doenvoted because my country is barred from joining for no reason???? Wtf reddit.",
            "score": -29,
            "replies": [
                {
                    "author": "ClassicPart",
                    "body": "> for no reason \n\n\nReddit isn't going to break international law for you. Sorry.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Amster2",
                            "body": "? This is disrespectful. Both the ban and your comment. You dont know my experience and work I do. This is not how a community is supposed to work. /u/Togapr33 this is sad.",
                            "score": -11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -5,
            "replies": [
                {
                    "author": "Sufficient_Floor8798",
                    "body": "Ai is 100% cheating since this is a compitition about your skills and using ai takes no skills.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "unrealz19",
                            "body": "Sounds like somebody doesn’t know how to use AI 😭",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "Sufficient_Floor8798",
                                    "body": "Asking ai to give you all of the code is 100% cheating",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "techdaddykraken",
                                            "body": "How exactly is it cheating when every other person can do the same?\n\nYou were the type of person in school to not use your textbook during an open-book test, weren’t you…lol",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "Sufficient_Floor8798",
                                                    "body": "Ai takes no skill, this is suppostes to test your skill, and no need for insults.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Beneficial-Eagle-566",
                                                            "body": "We went from \"don't worry guys, our jobs won't be affected by AI, it's really not that good\" to literally call it cheating.",
                                                            "score": -4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "techdaddykraken",
                                                            "body": "AI takes no skill?\n\nIf you use the AI to build what’s in your head, then that’s all coming from your ‘skill’. \n\nWould you say a woodworker using power tools in a woodworking competition is silly? After all, it takes no skill to push a board through a table saw. Does that mean they’re building the project for them?\n\nDon’t be silly. A.I. may one day be architect, designer, and engineer in one. Today, it is just a tool. Using tools isn’t cheating lol.",
                                                            "score": -12,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Physical-East-162",
                                                    "body": "Everyone on a minecraft server can download a cheat client such a Nodus or Huzuni or another one. \n\nIt's still cheating.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "techdaddykraken",
                                                            "body": "That’s a very big difference. Using a cheat bot which is strictly banned in Minecraft competitions vs. an AI tool that is widely available and not strictly banned in this competition\n\nJust admit you can’t afford Claude 3.7 and Cursor Pro and that’s why you’re butthurt",
                                                            "score": -5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}