{
    "title": "How are sites like Scrapehero permitted to monetize scraped data?",
    "author": "maldini1975",
    "subreddit": "webdev",
    "rank": 16,
    "score": 3,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/webdev/comments/1je416k/how_are_sites_like_scrapehero_permitted_to/",
    "id": "1je416k",
    "selftext": "**I am genuinely curious how do websites such as Brightdata or Scrapehero allowed to sell scraped data from sites such as Zillow, Trulia, Google reviews, Glassdoor, etc...?**\n\nSpecifically, I always wonder why don't such sites sell the data themselves to firms/consumers?  \nDon't get me wrong, I really appreciate how clean/neat the data are from Scrapehero, but I am confused about why websites like Zillow allow this, both from a legal and business perspective?\n\nFor instance, I would think that the whole business model of BrightData/Scrapehero would collapse if Glassdoor or Trulia start selling their own data directly to users.",
    "comments": [
        {
            "author": "c-digs",
            "body": "Some first party sites might actually have specific policies with regards to data privacy and whom they can/can't sell users' data to.  Would you use these sites if it was clear that they were turning around and selling your data to 3rd parties via APIs?  \n\n(Of couse, they are still selling your data in a multitude of ways e.g. via targeting for advertising, for example, but typically have to uphold some levels of privacy/anonymization/de-identification/aggregate cohorts/etc.)\n\nThe users entered into those agreements with the first party sites, but not with the scrapers.  Sites can change their terms, but then they might see an exodus of users.  See the recent press when LinkedIn started defaulting to allowing UGC to be included in their model training data.",
            "score": 7,
            "replies": [
                {
                    "author": "maldini1975",
                    "body": "Interesting, but elaborating more on linkedin? I have heard they extremely strict with developers scraping their data.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImportantDoubt6434",
            "body": "It’s against ToS.\n\nTechnically they could get sued and would probably lose, they’re basically playing with fire and betting the company won’t follow up to burn them.\n\nRealistically scraping is inevitable and even with a lawsuit another will pop up and do it anyway because the money is there.",
            "score": 3,
            "replies": [
                {
                    "author": "indicava",
                    "body": "It’s not really against the ToS, and companies like Bright Data are huge multi-million organizations. They are investor funded and no experienced investor would be putting money into a company with that much legal exposure.\n\nIncidentally, Bright Data actually did get sued by Meta. And won. \n\nhttps://techcrunch.com/2024/02/26/meta-drops-lawsuit-against-web-scraping-firm-bright-data-that-sold-millions-of-instagram-records/",
                    "score": 2,
                    "replies": [
                        {
                            "author": "maldini1975",
                            "body": "Super insightful comment, do you think the same applies to Scrapehero? I can't find any information confirming this, but they have been in business for several years and are continuously expanding!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AffectionateDev4353",
            "body": "Ai shit",
            "score": 1,
            "replies": []
        }
    ]
}