{
    "title": "Am I Overambitious Trying to Be Full-Stack with Mobile and Robotics?",
    "author": "udbasil",
    "subreddit": "webdev",
    "rank": 7,
    "score": 8,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/webdev/comments/1je9wni/am_i_overambitious_trying_to_be_fullstack_with/",
    "id": "1je9wni",
    "selftext": "I was self-taught for a while, mainly learning the MERN stack, before going to college, where I picked up ASPNET (C#), Spring Boot (Java), Angular, SQL (MSSQL & MySQL), and potentially Android development (or sticking with React Native). I won't be looking for official work with mobile as it would just be mostly for freelance work. I also have a mechanical engineering degree and will finish college this year.\n\nFor robotics, my go-to language is Python. I’ve structured my learning with a monthly revision plan and have a solid grasp of all the languages I use. Given my background and goals, am I being overambitious trying to balance full-stack, mobile, and robotics? Would love to hear from others who have tried a similar path!",
    "comments": [
        {
            "author": "Solrak97",
            "body": "If you want to excel on all of them its kind of ambitious, but not impossible \n\nI would argue that the best approach would be to focus on a single thing and master it, but always being open to work on other fields",
            "score": 5,
            "replies": []
        },
        {
            "author": "theReasonablePotato",
            "body": "Start with just one and focus on it for a while (year or more). \n\nIf you are looking to be employable I'd go robotics, as there is far less competition. Plus it will force you to program more complex things.\n\nWebsites are quite simple to make, hard to make top 1%.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DirtyBirdNJ",
            "body": "You should let your passions run wild, and explore all the things that keep your passion in coding alive.\n\nIf you want to combine them all into one job, you're gonna have a bad time.\n\nThis is coming from someone who started in web dev, became a backend API guy, learned 3d printing, gained basic electronics knowledge, now trying to build a \"robot that draws you\" (aka pen plotter + camera) and I also do filming and editing as a discipline as well.\n\nJust be realistic about how much you can jam together. Really good food is often just a few ingredients executed REALLY well.\n\n> am I being overambitious trying to balance full-stack, mobile, and robotics? \n\nYou are naieve in thinking you have to balance them at all. You need to find opportunities that allow you to practice all these disciplines. Follow the stuff your good at.",
            "score": 2,
            "replies": [
                {
                    "author": "bloomsday289",
                    "body": "I think this guy is giving good advice.\n\n\nI think it's great to let your passions run whenever they lead you. At the same time, professionally, I think you get the most benefit from going deep, and I mean truly deep.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}