{
    "title": "Relapsed",
    "author": "mysticaldragonlady",
    "subreddit": "stopdrinking",
    "rank": 394,
    "score": 22,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2hsdb/relapsed/",
    "id": "1j2hsdb",
    "selftext": "So I made it to five days. Then drank a couple beers. Nothinf crazy. But unacceptable for me. \n\nI’m not going to beat myself up over it. Now I have to at least make it past five days. That’s all I can handle thinking in my head. ",
    "comments": [
        {
            "author": "Eye-deliver",
            "body": "Welcome back! I find it’s easier for me to just do this one day at a time. But that’s just me. IWNDWYT",
            "score": 7,
            "replies": []
        },
        {
            "author": "canadianxcobra",
            "body": "It isn’t about how we falter, but rather how we respond. You got this! IWNDWYT!",
            "score": 2,
            "replies": []
        },
        {
            "author": "randomuser8479373",
            "body": "Yup just keep it moving forward! IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beulah621",
            "body": "I love to read the slip-up stories where people have a slip, and get right back with day 1. That’s strength, when so many relapses devolve into another 5 or 10 years of drinking.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MopingAppraiser",
            "body": "Welcome back!  IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beautiful-Middle-193",
            "body": "IWNDWYT 🐉",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spare_Answer_601",
            "body": "Begin Again. IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "godahi9660",
            "body": "Glad you're sticking with it. I've had many restarts myself and never gave up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wagglyfawn",
            "body": "You drank 2 beers and that's a bonafide L. But the win is that you didn't let 2 beers turn into 20 (or worse). Instead, you stopped and circled back to your conviction of sobriety. So from my perspective you turned 2 beers into zero. Keep yourself going and eventually zero drinks will keep leading to zero drinks.",
            "score": 1,
            "replies": []
        }
    ]
}