{
    "title": "Went  close to 60 days then had a drink and all the little physical stuff appears",
    "author": "SocalWaxDabs",
    "subreddit": "stopdrinking",
    "rank": 213,
    "score": 572,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 46,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2twii/went_close_to_60_days_then_had_a_drink_and_all/",
    "id": "1j2twii",
    "selftext": "So I’m 54 I struggled with alcohol. Most of my life…I went to treatment twice once when I was 19 once when I was 38 both times I was using cocaine with alcohol. Finally stopped doing cocaine 10 years ago. Was sober for 3 years then got “bored” in my sobriety and started drinking again. I was successful for the first time in my life with my career and only would drink beer.. then in 2022 I got sick over Christmas and beer tasted like shit so I tasted some whiskey. Of course I loved it and got into “good”whiskey. I’ve been going through a lot since the first of the year but I had quit drinking on December 24, 2024 and stuck with it for close to 60 days then I decided one day I would just have one glass of whiskey well that one glass of whiskey has turned into 8-10 straight days of one glass of whiskey and in the last three days it’s turned into two glasses of whiskey. Of course over the last days i wasn’t drinking I got into incredible shape was going to the gym every day, working with Buddism and members, feeling very connected to life! I went to the gym this morning. Last night at the Laker game I had a whiskey on the rocks. But I had had some earlier in the afternoon too. I haven’t gotten drunk so to speak…but my attitude has, of course shifted more thinking about me more thinking about whiskey and how I can drink, where I can drink it, what kind of whiskey I’m gonna drink…blah blah..it just starts to completely take over my mind again on top of that. I went to work out this morning and every part of my body was sore. Things were now starting to hurt that had finally gone away.. I mean the shits just poison so I’m on day one again. I will not drink with you today . It’s so much easier to just say no to the first drink. This stuff is so sneaky. It’s unbelievable. Just wanted to share this. I honestly hate alcohol and all the pressures to drink it and everybody thinks it’s so fucking great. I’m so over it. The problem is I still have to go to parties with my wife I still have to go to bars sometimes with my wife to meet other couples and the bottles look all shiny. The lights are on them. Everybody’s sitting there drinking their drinks smiling And I just feel so left out sometimes.. I’m determined to stop this goddamn cycle of beating myself up, haven’t had a hangover forever, but all the little shit it brings, the little aches and pains, and all the thoughts that I have, I just get so self involved. Alcohol shuts me off from so much shit It’s just insidious anyway thanks for reading it’s really not worth it.",
    "comments": [
        {
            "author": "RealisticInspector69",
            "body": "It really is sneaky isn't it - as you say, \"all those shiny bottles\". And 🥃 whisky - totally seductive and totally evil. \n\nI like this from Alice Miller who really understood trauma: \"What is addiction, really? It is a sign, a signal, a symptom of distress. It is a language that tells us about a plight that must be understood.”\n\n– Alice Miller, Swiss psychologist and philosopher\n\nIWNDWYT 🌹 🌹 🌹 🌹",
            "score": 191,
            "replies": [
                {
                    "author": "Quiet-Section203",
                    "body": "I look at cool, dark bars, lit up with those tiny little candles that brings those seductive af green and amber bottles out of the darkness like  a 9 year old boy looks at a playboy.",
                    "score": 59,
                    "replies": [
                        {
                            "author": "steadfastun1corn",
                            "body": "The irony is it could be piss in the glass and it’d still appear just as seductive but a bit less tempting ..you’d hope",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "God_Dammit_Dave",
                            "body": "Keep your hands to yourself in the strip club. Rules to live by. \n\nP.S. that is a beautiful use of words.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Quiet-Section203",
                                    "body": "God dammit Dave!",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "calliache24",
                            "body": "Ughhh this is so true for me as well.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CauliflowerMurky1614",
            "body": "I hear you. The negativity and self destruct that alcohol promises and yet I still crave the drink, for what? Misery loves company? Ugh.\n\nI have found my day ones are starting to be further and further apart. \n\nTo many more days, one day at a time. ",
            "score": 65,
            "replies": [
                {
                    "author": "SocalWaxDabs",
                    "body": "Yes I intend to keep getting distance further apart until it sticks",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "JuniorWriter9447",
                    "body": "Same!!  I made it to 17 days when I never thought in my life that I could ever make a week!   Good things happen when you try.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "FebruaryDiva",
            "body": "I'm 9 days sober today and it's amazing how much everyone drinks.  I have been sober before and I lasted a  month.   I started off as a social drinker until it became a problem. The thing is my social life is going to take a huge hit. I was invited to a wine tasting dinner this weekend. I declined.  The next invite was a boozy brunch. Nope.  So, I hear you. It's hard. I'm tired of feeling sick.  I want to be sober and healthy.",
            "score": 65,
            "replies": [
                {
                    "author": "Saman03",
                    "body": "Yeah, that is probably the hardest part. My friends even told me they thought I should stop drinking (which has gone remarkably well), but they always go out to bars or frats (which I don’t attend) or have hangouts at our house with heavy drinking. Realizing time together doesn’t happen much without alcohol, even while living together, and it has drastically separated me. Hoping I’ll find other friends at some point, considering they don’t want me drinking around them (not that I mind, I’m enjoying being healthy!) but I never realized until getting sober that really, all they do is drink.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FebruaryDiva",
                            "body": "\n\n We're going to have to find new sober friends. I know it's possible.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RelationshipFirm9756",
            "body": "I totally get you when you talk about the fomo part at parties. My wife and I have a pretty robust social life and lots of parties we attend for work and believe it or not our son’s catholic school has galas and events. The booze is flowing everywhere. It’s an integral part of our family functions as well. I’ve been a very heavy drinker for the last 15 years (41M) and I’ve just recently decided I’m done. It’s not easy. I started going to AA and have a sponsor. I’m 67 days sober today which is a record for me. The magnetic pull of the booze is for the most part gone. I’m a little worried about when summer rolls around and the sun is shining and the food is on the barbecue. That’s a big trigger for me. Anyways, I just pop zyns throughout the day and especially at parties and I’m finding the nicotine is helping. Not a great substitute but better than drinking myself to death. Which several of my older family members have died from alcoholism. In fact my 42 year old sister just died in 2023. It’s indeed a very insidious substance and nearly impossible for me to stop once I start. I agree with you regarding the amount of time planning and building my life around booze. Making sure I have enough left when the party is over to keep drinking. Or planning recovery days around it. It’s fucking stupid and life is a million times better without it for me.",
            "score": 33,
            "replies": [
                {
                    "author": "SocalWaxDabs",
                    "body": "Yeah I have a kid in a catholic school and it’s a free for all with booze  be at parents events…hilarious to me",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "PaulaPurple",
            "body": "Gosh this is a worthwhile read here on Day 6.  You’re right to notice and point out the *littler* things - aches and pains that were gone, creeping self-absorption and attention turned to “thinking about drinking”    Thank you for noticing and pointing it out.  Is this mild poisoning worth it to fit in?",
            "score": 14,
            "replies": []
        },
        {
            "author": "iflyer",
            "body": "Appreciated this very much. Good perspective",
            "score": 10,
            "replies": []
        },
        {
            "author": "HufflepuffStuff",
            "body": "Ugh those pretty shiny bottles. I found a lot of help reading This Naked Mind. The author explains the marketing, neuroscience, and psychology behind why we find the shiny bottles so irresistible (hint: it’s by design). Understanding the “why” took some of the allure away for me. IWNDWYT.",
            "score": 9,
            "replies": [
                {
                    "author": "SocalWaxDabs",
                    "body": "I have read that book and seriously I conveniently forget all tricks…I have to read it weekly I guess",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chance-Leadership649",
            "body": "You should stay away from places that serve alcohol for a little while. It will help you until you feel ready and prepared to say, “no.”, if necessary. I find it tempting when I drive by liquor stores, or I see people walking out of liquor stores with black bags. I try not to look or take another route. \n\nI live close to Los Angeles and everyone seems to drink. I don’t go out to bars, or at all really! So, for the most part, I don’t feel tempted. Try to set some boundaries for yourself, for now. Your wife loves you so, she’ll be right beside you.\n\nYou’ve got this, man!\nIWNDWYT ✨✨✨✨",
            "score": 10,
            "replies": []
        },
        {
            "author": "krakmunky",
            "body": "Yep. So much bullshit surrounding a known carcinogen and poison to make you feel like you’re crazy to not want to take  it anymore. So much noise.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Spare_Answer_601",
            "body": "Begin Again. IWNDWYT",
            "score": 8,
            "replies": []
        },
        {
            "author": "Cattiebrie2016",
            "body": "I love that word “sneaky” to describe it.  It’s a little sneaky bastard.",
            "score": 9,
            "replies": []
        },
        {
            "author": "pbsc51",
            "body": "Thanks for sharing",
            "score": 4,
            "replies": []
        },
        {
            "author": "The_Existentialist",
            "body": "Broke in to paragraphs to help folks read your story better especially since it’s an important one to share! \n\nSo I’m 54. I struggled with alcohol most of my life. I went to treatment twice—once when I was 19, once when I was 38. Both times, I was using cocaine with alcohol. Finally, I stopped doing cocaine 10 years ago. I was sober for three years, then got “bored” in my sobriety and started drinking again.\n\nI was successful for the first time in my life with my career and only drank beer. Then, in 2022, I got sick over Christmas, and beer tasted like shit, so I tried some whiskey. Of course, I loved it and got into “good” whiskey.\n\nI’ve been going through a lot since the first of the year, but I had quit drinking on December 24, 2024, and stuck with it for close to 60 days. Then, one day, I decided I would just have one glass of whiskey. Well, that one glass turned into 8-10 straight days of one glass of whiskey, and in the last three days, it’s turned into two glasses of whiskey.\n\nOf course, over the days I wasn’t drinking, I got into incredible shape, was going to the gym every day, working with Buddhism and members, and feeling very connected to life. I went to the gym this morning. Last night, at the Lakers game, I had a whiskey on the rocks. But I had already had some earlier in the afternoon, too.\n\nI haven’t gotten drunk, so to speak, but my attitude has shifted. I’m thinking more about myself, more about whiskey—how I can drink, where I can drink, what kind of whiskey I’m going to drink… blah blah. It just starts to completely take over my mind again.\n\nOn top of that, I went to work out this morning, and every part of my body was sore. Things were starting to hurt again that had finally gone away. I mean, the shit is just poison. So, I’m on day one again.\n\nI will not drink with you today. It’s so much easier to just say no to the first drink. This stuff is so sneaky. It’s unbelievable. Just wanted to share this. I honestly hate alcohol and all the pressures to drink it. Everybody thinks it’s so fucking great. I’m so over it.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Vesper-Martinis",
            "body": "That constant dialogue, I was a whiskey drinker too, I still think about the flavour. It got to the point where I was measuring out my daily allowance in empty bottles of whiskey in some completely delusional attempt to moderate. Did. Not. Work.",
            "score": 4,
            "replies": []
        },
        {
            "author": "coIlean2016",
            "body": "I like to rely on fancy mock tails at events so I don’t feel left out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "therealjenshady",
            "body": "Thanks for posting. I needed to read this. Today is day 47 but on day 44 I felt really accomplished and nearly convinced myself that I deserved a ‘reward’. I ended up ordering pizza instead bc I’ll never quit that. IWNDWYT.",
            "score": 5,
            "replies": []
        },
        {
            "author": "holeinonetiger",
            "body": "You said it: poison. \n\nIWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "lust-4-life",
            "body": "I had to skip the bar scene for a few months. Now 4.5 years in, they still look shiny when like I am bored at the airport. But now I want to remember vacation more than fuck up my life. IWNDWYT 💪🤘👊",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Mirror_3867",
            "body": "I lasted 6 and a half weeks and just really felt like wine 2 weeks ago. I drank a bottle over a few hours on the Sunday and went to bed fine. Repeated it this week. Fell asleep at 8.30, woke up wide awake at 10.30 and then didn’t get back to sleep until 2.30am. I actually got up at 12.30 and did a workout I was so wide awake. I had to be at work by 8am. Plus get my kids up, to school etc. That was it for me. The proof that I had ‘forgotten’. Alcohol fucks my sleep, which fucks my fitness and health. Day two today.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ghostee1233",
            "body": "i will not drink with you today!!! stay strong brother. it is poison like you said. mentally it will keep you down. physically it will keep you down.\n\njust blurt out your favorite soda when it’s your turn to order. once a drink is in front of you, that’s not whisky, you’ll have to drink it. don’t give in to the pressure. it helped me to be honest with people, especially in the beginning when they’re expecting you to drink. tell them you feel physically better without it, tell them anything except that you want a drink. you got this. it’s amazing that you keep coming back to sobriety. and it’s so true, the whole culture around drinking is so stupid and escapist. no need.",
            "score": 2,
            "replies": [
                {
                    "author": "SocalWaxDabs",
                    "body": "Iwdwyt!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ghostee1233",
                            "body": "proud of u!!!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kateb40",
            "body": "IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "kwridlen",
            "body": "IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jealous-Produce-175",
            "body": "I also fell off the wagon recently loll it’s just time to get back on !",
            "score": 1,
            "replies": [
                {
                    "author": "FebruaryDiva",
                    "body": "You can do it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cfcpa",
            "body": "This is a familiar progression to me. Getting into “good whiskey” or “good wine” resonates. \n\nHang in there. \n\nIWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "cheesesmysavior",
            "body": "Whiskey, wine, it’s all so interesting to me. “Let me make the BEST tasting poison!” So silly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kcidobor",
            "body": "[The way bourbon beacons my belligerence](https://m.youtube.com/watch?v=n39897a9hNk)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Classic_Shake_6566",
            "body": "Different but similar story here brother.  My record is maybe 6 months because I was training for a full Ironman.  Now I'm on 60 something days as a choice for me.  \n\nI will not have a drink with you today",
            "score": 1,
            "replies": []
        },
        {
            "author": "ekulwil",
            "body": "IWNDWYT!",
            "score": 1,
            "replies": []
        },
        {
            "author": "NightHawksTrombone",
            "body": "I feel you. It Never Gets Easy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ta2019xxxxx",
            "body": "IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fearless-Truth-4348",
            "body": "I backed out of a surprise party because it was at the pub where I had logged a lot of hours sitting at the bar. I was conflicted because I wanted to go however I did not want to be scouting the room seeing what everyone is drinking and thinking about just one drink. It reminded me of when I used to smoke and solely smoke while drinking. I’m not sure how many conversations I missed while I was scanning the pub looking for someone who smoked my brand and I could bum a smoke. \n\nSometimes not going for a while is easier than trying not to do something detrimental to your mind body and spirit. \n\nIWNDWYT",
            "score": 1,
            "replies": []
        }
    ]
}