{
    "title": "I miss it",
    "author": "Whocann",
    "subreddit": "stopdrinking",
    "rank": 269,
    "score": 44,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j312h0/i_miss_it/",
    "id": "1j312h0",
    "selftext": "I miss wine tasting events, fancy paired wine meals (alcohol-free wine is just not the same), a glass of really good scotch at the bar.  I really do miss it.  I enjoy the flavor and the conversations and the sophistication of it all.  I REALLY miss the social lubricant aspect of it because I just can’t hold a conversation sober and it really makes work, work-adjacent, and charity events insufferable. \n\nBut I don’t miss what it seems to inevitably lead to.  The wine tasting leads to the meh bottle of wine with dinner at home a couple of times a week.  The great whisky leads to Irish coffees with shit Costco brand 1.75s lasting only a week or two.  It all leads to drinking to excess when traveling in particular, including for work.  I’m slipped pretty badly on my diet and have gained a lot of weight since last December but drinking will just put me back to being straight up fat and will probably kill the fact that I am at least still lifting 2-3x a week.  \n\nSo man do I miss it.  I wish I could trust myself to leave it just to the special things and special occasions.  Maybe it would even work out this time.  But is it really worth the field work to find myself back where I was 15 months ago?  Rationally, it is not. ",
    "comments": [
        {
            "author": "cheesesmysavior",
            "body": "It’s like missing the great sex with a crazy ex.",
            "score": 79,
            "replies": [
                {
                    "author": "Lazy-Thanks8244",
                    "body": "Nailed it. So to speak.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "SauerkrautHedonists",
                            "body": "lol",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "punkmetalbastard",
                    "body": "Goddamn it. This is the truth",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "error404wth",
                    "body": "Omg spot on.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Whocann",
                    "body": "lol yes!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Low_Soft8649",
            "body": "I totally get it. I’m a sober bartender and for the most part I’m fine, but sometimes I feel how you feel. Just have to remind myself - we’re only remembering the most romantic aspects of drinking (as if that was the norm). Miss it when you miss it and then let it pass and know it won’t do what you think it’ll do. Great job on 15 months!!",
            "score": 19,
            "replies": [
                {
                    "author": "No_Dragonfruit5633",
                    "body": "Also a sober bartender! Good for us 💪🏻😎",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Low_Soft8649",
                            "body": "hell yeah! :)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Eye-deliver",
            "body": "Same. I loved to drink.  But it stopped loving me long ago. Like an old flame I kept trying to rekindle only to get burned over and over again. And I’ve got the scars to remind me. But somehow I still miss trying to make it work even though I know it never will and it will only cause me pain. \nBut missing it is not enough for me to try again. It’s just not worth the price anymore. IWNDWYT",
            "score": 18,
            "replies": []
        },
        {
            "author": "waitingforpopcorn",
            "body": "I watched a TedTalk about divorce that related to quitting drinking. About how we romanticize the good memories, but block out the bad. How to write down a list of the bad memories and refer to them when we start thinking 1 drink will be ok. IWNDWYT",
            "score": 13,
            "replies": []
        },
        {
            "author": "lightfoot90",
            "body": "I miss the first hour of drinking. I don’t miss the days of anxiety, guilt and regret that would follow.",
            "score": 13,
            "replies": []
        },
        {
            "author": "punkmetalbastard",
            "body": "I tell people all the time “It sucks”. I miss a lot about drinking but unfortunately it has side effects that I don’t miss one bit and which I don’t have to suffer if I simply don’t drink. If you’re like me, it takes serious work to re-learn how to have fun after you quit drinking but after a couple years now I think I’m there. I’d also be lying to myself if I said I just want something like a glass of wine with dinner. I wanna party and get wasted lol",
            "score": 11,
            "replies": [
                {
                    "author": "SauerkrautHedonists",
                    "body": "Same",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Capital_Listen_5863",
            "body": "I am with you here. I used to really love wine tasting events and paired wine meals. But I can’t do them anymore because of what they lead to. I can’t moderated and it’s not worth it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "yeahitsx",
            "body": "Right there with you mate! God do I want a nice cab with a succulent, juicy steak (a match made in heaven). I miss ordering top shelf scotch, one cube of ice, while I relax at the lounge, explaining to an interested ear the intricacies of the flavor profile. I miss how the social anxiety lifted upon the initial buzz…\n\nBut I know this is but the song of the siren for me. \n\nI have no control…and though those moments carry a rose tinted hue…I do not miss feeling like an absolute failure when I buy 5-6 bottles a week…\n\nI do not miss looking at that half empty bottle merely 5 hours after I purchased it. I don’t miss drinking alone…I don’t miss the pain in the sole of my foot that would come…I don’t miss waking up in my car in a random neighborhood. \n\nI don’t miss wondering how the hell i managed to DRIVE home. I don’t miss wondering how that dent got there 🤔 \n\nI don’t miss feeling like I can’t control myself, and how weak that made me feel. \n\nAnd for those reasons, IWNDWYT my friend.",
            "score": 4,
            "replies": [
                {
                    "author": "error404wth",
                    "body": "Wow \"I do not miss looking at that half empty bottle merely 5 hours after I purchased it.\" So spot on.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "1ofakindJack",
            "body": "There are a lot of good comments here already, but I'd just like to add that conversation is a skill. We can all learn to be better conversationalists with practice. Negative self-belief is potent and needs to be challenged in sobriety. There's no way \"i can't hold a conversation\" is a fixed and unchanging reality of anyone's life, unless they believe it to be. We can do (almost) anything now we are not drinking. IWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "on_my_way_back",
            "body": "I don't miss drinking rotten decaying plant matter.  I don't miss waking up on the couch at 3am with the lights on and TV blasting.  I don't miss hiding booze and sneaking around to drink it.  I don't miss people telling me all of the embarrassing things I did the night before.  I don't miss the disgust in my family's faces when I ruin an evening.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AmysInLove",
            "body": "I call this missing the “romance” of it. It is so real. Separating the romance from the reality takes a lot of work. I feel you.",
            "score": 1,
            "replies": [
                {
                    "author": "RenaissanceScientist",
                    "body": "I think since it’s been some time now from when you last drank you’re looking at it with rose colored glasses. I’m guilty of the same. You ignore all the bad things and only remember the good times. For me, every good time I had with alcohol had at least double the amount of bad times.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Indotex",
            "body": "I know how you feel! I miss going to a brewery or the store, looking for a beer that I’ve never tried before and taking that first sip!\n\nAnd I tried some NA beer a couple of months into my sobriety and while it tasted okay, I wound up getting a buzz (it was .5%) after a few and I didn’t like the feeling!",
            "score": 1,
            "replies": []
        },
        {
            "author": "full_bl33d",
            "body": "I do too! I miss the chaos and totally blowing shit off to do live in the moment. It wasn’t all bad and I can be grateful for the good times I had when alcohol was at the helm. But it wasn’t serving me any more and I’m done hurting myself and anyone close to me. Nowadays, I’d rather reminisce about the good times as a non-drinker than be reminded of how good it felt to be sober when I’m piss drunk.",
            "score": 1,
            "replies": []
        }
    ]
}