{
    "title": "Disappointing drink",
    "author": "RelevantJesse",
    "subreddit": "stopdrinking",
    "rank": 203,
    "score": 36,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3c9d4/disappointing_drink/",
    "id": "1j3c9d4",
    "selftext": "So I had a drink last night for the first time in over 2 weeks. I'm not too upset about the number, my intent wasn't to never drink again. \n\nWhat I was surprised about is how unenjoyable it was. I was thinking I'd get some feeling of \"I've missed this!\", but I didn't at all. It didn't even taste good anymore.\n\nI'm a long time scotch drinker, and have always enjoyed the taste and the burn of it. But this time, all I could taste was the alcohol. It was overwhelming. It made me think \"how the hell was I drinking this everyday?\" I mean I'm sure I got used to it and didn't taste the alcohol as much, but that's not a good thing.\n\nI didn't drink very much, barely even felt anything, but I ended up sleeping terribly. Woke up in the middle of the night and couldn't get back to sleep. Woke up with a minor headache (not sure if it was due to the alcohol or the lack of sleep, but either way, something I hadn't had in the prior 2 weeks) and my head just overall not feeling as clear as I've gotten used to. I hear a lot around here about \"brain fog\" and never thought I experienced that, but this morning I did notice a difference.\n\nSo anyways, on one side I feel like I ruined my streak for nothing, it wasn't even worth it. On the other hand, maybe it was a small price to pay to tell my brain that I don't even enjoy drinking, so why even think about it?",
    "comments": [
        {
            "author": "u5ibSo",
            "body": "I remember a black label that tasted like gasoline to me but that I still drank because it was a gift and that's where I was. I knew it couldn't actually be gasoline, right? Glad not to be worrying about entire classes of chemicals that I'd be putting in my body were I drinking.\n\nAs for the streak I wouldn't worry about it. I would reset it because I know I get particularly vulnerable after having any kind of a night but it wouldn't change my behavior anyway. I still come here each day, keep no alcohol around, and be kind to myself. Congrats on the two weeks. A great experience to build on. IWNDWYT",
            "score": 4,
            "replies": [
                {
                    "author": "RelevantJesse",
                    "body": "Funny enough, it was Black Label haha",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "kevinmbo",
            "body": "interesting. ive wondered if i drank again if id even enjoy it or not - not due to taste but mostly from the knowledge ive gained in sobriety. seems like “ignorance is bliss” when it comes to alcohol.",
            "score": 3,
            "replies": []
        }
    ]
}