{
    "title": "It's amazing how many non-drinkers there are out there.",
    "author": "s0bering",
    "subreddit": "stopdrinking",
    "rank": 68,
    "score": 477,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 37,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3i3wb/its_amazing_how_many_nondrinkers_there_are_out/",
    "id": "1j3i3wb",
    "selftext": "Despite being almost 2 years AF I was worried that there would be pressure to drink when everyone wanted to go out after an evening of pickleball. How wrong I was! It turns out that more than half the people in the group didn't drink either. The drinkers were the minority. Alcohol is the new tobacco. There's more and more of us out there now. IWNDWYT",
    "comments": [
        {
            "author": "dropped800",
            "body": "It's funny, when I was drinking, I used to think everyone was drinking all the time. Now that I'm not, I find it surprising how many people actually do drink",
            "score": 131,
            "replies": [
                {
                    "author": "mister-fancypants-",
                    "body": "Same and it’s scary because my wife and her parents drink maybe 3 times a year.. and I thought they were casual drinkers the whole time. It sounds silly even to type it out but it’s really apparent how clouded my brain was",
                    "score": 48,
                    "replies": []
                }
            ]
        },
        {
            "author": "willingzenith",
            "body": "There really is, and I’ve experienced the same in my almost 1 year of sobriety. My most recent example is an off-site work meeting. After the meeting, they traditionally serve light food and lots of beer. I was a little concerned about sticking around for all of that but glad I did. Within minutes, I found a group of non-drinkers that all had various stories and lengths of sobriety. I ended up having some good conversations with someone that had just made the decision to quit drinking.",
            "score": 84,
            "replies": [
                {
                    "author": "Hares_ear1947",
                    "body": "I’ve been having similar interactions. I really like the sober crowd. It’s funny to see them relieved when they realize you’re one of them. It’s like oh yes we got another one.",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ruforscuba2",
            "body": "I’m amazed too. When I was a party girl I thought everyone drank. No one stayed sober on Saturday night. Sober on a boat? ha! Now, I work on a boat and we offer alcohol… 90% of our guests decline free alcohol and the crew doesn’t party when the charters over when I’m not bringing a 12 pack or two of our favorite brews. I was instigating the party and didnt even realize it.  It’s like a whole different world of people not acting like idiots. I love the movement.",
            "score": 76,
            "replies": []
        },
        {
            "author": "spareshirt",
            "body": "I went out to a pub with a friend the other day. We’d made plans so we could go play a board game together. When I told him I wasn’t drinking, he looked so relieved. We were both on the NA beers for a couple of hours, had a great time, and didn’t feel like crap the next day (at 40+, even a couple of pints would have consequences).",
            "score": 53,
            "replies": [
                {
                    "author": "PaydayMayo",
                    "body": "Ain't that the truth!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Delicious_Peace_2526",
            "body": "Some of them may also be on a sobriety journey.  I’ve never tell anybody (I’m try to quit) (or I haven’t had a drink in so many days.) I just don’t drink and if anyone persists I just say “I don’t want one right now” and they normally drop it unless they’re extremely juvenile.",
            "score": 38,
            "replies": [
                {
                    "author": "invisiblefigleaf",
                    "body": "There are so many reasons people don't drink - pregnancy, religion, interacts with medication, have to wake up early, etc, etc. It's incredibly rude to press it unless someone voluntarily shares. It's also dumb to assume that drinking is the default and you need a \"good reason\" not to drink. \n\n\nIn college, my friend would occasionally get shit from frat bros for not drinking. Their faces when she'd reply \"I can't drink because of the chemotherapy\" were priceless. I hope some of them learned better manners after that.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vesper-Martinis",
            "body": "I saw a post on the ask an Australian sub the other day with someone from America asking what they should do when going out for work drinks as a non drinker. Everyone said just don’t drink, no one cares, lots of people don’t drink anymore. Really refreshing to see all those responses.",
            "score": 32,
            "replies": []
        },
        {
            "author": "ze_big_bird",
            "body": "I think a lot of society is starting to wake up to the negative effects of alcohol, even when the person drinking doesn’t have a problem. For a long time we’ve really pushed and normalized drinking in excess and once I got sober I really started to see the consequences of that.\n\nThe biggest one I recognized was it just making peoples priorities shit. They focus on short term pleasure over long term reward. They know what they should be doing to get where they want to be but drinking and “going out” takes priority over it. YOLO right? Except the constant decision to do that holds people back and they end up drinking more to distract themselves from their dissatisfaction from where they’re at.",
            "score": 23,
            "replies": []
        },
        {
            "author": "ConcordJake",
            "body": "I’ve been able to go with a couple of different groups of friends and had dinner with other couples and have been equally surprised. \n\nThe first time we were out to dinner since I stopped drinking I assumed my wife and the other couples were not drinking because of me. Turns out they just didn’t choose to have alcoholic beverages. No big deal. \n\nI’ve also noticed how most of the people who do order an alcoholic drink just have one, and it can last them a whole meal.",
            "score": 18,
            "replies": [
                {
                    "author": "invisiblefigleaf",
                    "body": "Congrats on 100 days!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "s0bering",
                    "body": "> I’ve also noticed how most of the people who do order an alcoholic drink just have one, and it can last them a whole meal.\n\nTHIS! I so wish I could drink like this but I've seen this movie and didn't like the ending.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Federal_Bonus_2099",
            "body": "Day 1 for me today. Stepping into the unknown",
            "score": 33,
            "replies": [
                {
                    "author": "ottawaoperadiva",
                    "body": "Congratulations! You can do it!",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "majbob01",
                    "body": "Congrats!  That's a HUGE step!!  IWNDWYT!",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "VechtableLasanya",
            "body": "We’re like the X Men! You’ve never seen one before  and then suddenly they’re everywhere as soon as you know how to look!!",
            "score": 17,
            "replies": []
        },
        {
            "author": "solar_garlic_phreak",
            "body": "Its a paradigm... people are either shocked that people dont drink or its completely normal.",
            "score": 7,
            "replies": []
        },
        {
            "author": "FpsFrank",
            "body": " It’s also pretty great how much non-alcoholic beer there is now. I went through a whole Christmas party where everyone drank all night. I had my non alcoholic whiskey and my non alcoholic Heineken. I didn’t have to worry about getting drunk, getting home, feeling hung over, worrying about my health in the morning, not remembering what happened that night.",
            "score": 6,
            "replies": []
        },
        {
            "author": "solace_seeker1964",
            "body": "\"Alcohol is the new tobacco. \"\n\nI love that, and I hope so, and raise a glass of water to toast you!\n\nBut I still wish I could drink like a normal person, then I could drink as much as I want!\n\nps, I stole that last line from someone on the Daily Check in from yesterday. ;)  \n\n\"Normal drinking\" might just be a conspiracy theory. ;)",
            "score": 6,
            "replies": [
                {
                    "author": "PaydayMayo",
                    "body": "I dunno. I'm starting to wonder which is worse for your health. On one hand, \"successful  moderation\" is just killing yourself a little bit at a time with just a couple every day, but for years and years, because it really doesn't seem like a problem until you get those test results, and it's socially acceptable. Binge drinking is hard on the body, but hopefully for shorter duration. Either way, no matter which type of drinker you are, IWNDWYT 🫶",
                    "score": 2,
                    "replies": [
                        {
                            "author": "solace_seeker1964",
                            "body": "Well, my post was meant to be good humored, but if you are serious, what I understand to be true is, a glass of red wine with dinner, according to science is actually good for your health.  That's for non-alcoholics.  My alcoholic body would raise a 5-station fire alarm, if I even took one sip.\n\nI could never, and will never be able to have just one glass of any alcohol, anytime.  I'd drink the whole bottle, then go to the liquor store, then go back to the liquor store first thing in the morning!\n\nBut for non-alcoholics, I'm non judgmental about it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PaydayMayo",
                                    "body": "https://www.who.int/europe/news/item/04-01-2023-no-level-of-alcohol-consumption-is-safe-for-our-health\n\nThe red wine myth has been debunked. No doubt everyone reacts to it differently, but none of it is safe. It's all poison.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "solace_seeker1964",
                                            "body": "Thanks for the info.  I may stand corrected.  It makes sense what you, and the WHO article, say.  Hell, I used to drink liquors straight that were flammable.  Gasoline anyone?\n\nIWNDWYToday",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Valuable_Divide_6525",
            "body": "I feel like most people would rather just sit down to a good meal rather than sit at a bar and drink.",
            "score": 5,
            "replies": [
                {
                    "author": "Universeintheflesh",
                    "body": "And that has an acceptable end to go home at a reasonable hour if you want too, and those that want to keep going can hit up a bar afterwards. At a bar people often seem to want you to stay all night.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Textiles_on_Main_St",
            "body": "The trick is, go somewhere where they serve more than alcohol! I WISH the people at work I go to drinks with would pick more than a bar, but there are more of them than there are of me and honestly, it's not THAT bad to drink sparkling water (I'd prefer a hot tea, but whatever) but in some of these places they don't even have coffee, lol. \n\nI had one woman say she doesn't even want to drink when we go out, but she feels like there's nothing else on offer (and there really isn't.) My point is, I think there would be more of us if bars made even a tiny effort to cater to people who might want something SUPER rare and fancy like goddamn coffee or tea (and it's not like you can't mix drinks with those things). \n\nSorry for the rant. Kinda jealous of you. lol. I'm building up my resentment to friday drinks. \n\n(the conversation is good and I need to develop work relationships or I wouldn't go.)",
            "score": 7,
            "replies": []
        },
        {
            "author": "reedzkee",
            "body": "i work in film and tv and there are sooooo many of us",
            "score": 3,
            "replies": []
        },
        {
            "author": "hydra1970",
            "body": "When your social life centers around alcohol then it is easy to get the perception that everyone is drinking.  \nPlus if you compare your drinking to a group of drinkers it becomes easy to rationalize that you are drinking \"less\"  \nBeen traveling the last six months and I have made so many connections without alcohol.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ConfidentGood5811",
            "body": "I'm still trying to find these people!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "2K12LX",
            "body": "Another amazing statistic related to your post:\n\nThe top 10 percent of American drinkers - 24 million adults over age 18 - consume, on average, 74 alcoholic drinks per week. That works out to be nearly 60% of all alcohol sales.\n\nSo without the heaviest drinkers, alcohol companies would go out of business. Seems like their whole business model is designed to see us drink ourselves to death, whereas non-drinkers and light drinkers are likely oblivious.\n\nLink to article: [Smithsonian Article](https://www.smithsonianmag.com/smart-news/ten-percent-americans-drink-half-booze-180952857/)",
            "score": 3,
            "replies": []
        },
        {
            "author": "SerGallahad",
            "body": "I have continously seen studies that show Gen Z are the ones that are transforming alcohol culture as whole, citing financial freedom and healthy alternatives as the big push to not drink.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RealMcGonzo",
            "body": "I moved to a small town in East Tennessee and was floored when I would go out to dinner on a weekend.  Most tables had NO alcohol!  This isn't a dry county, but people do not drink a lot here compared to the big city.  There's also a private college in my town, but not many bars and certainly no dance club.  \n\nIt is interesting to compare to TV.  We're currently watching Suits and everybody not only drinks but drinks scotch or bourbon or whiskey straight - not even any ice!  Somebody will walk into somebody else's office and hey, let's have a drink!  Never worked at a law firm, but I have worked at advertising agencies and banks, never saw stuff like that in real life.  Thank goodness.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pegasuspaladin",
            "body": "I am a sobertender with +15 years experience.  Struggling for 4 to become sober.  At this point going on 3 months successfully and actively not wanting it finally.  Since the pandemic every year I have had a noticeable uptick in mocktail or \"fine with water\" orders.\n\nEven seeing modern shows not having characters drinking every other scene has been refreshing.  Watching just about any show from 2019 or earlier there is pretty much a guaranteed main character or reoccurring guest character who has drinking as a main character trait.",
            "score": 2,
            "replies": []
        },
        {
            "author": "awesome6666",
            "body": "I've been sober for almost 3 yrs now and I've never ever had anyone pressure me to drink. The few times a drink is OFFERED to me I just tell them I don't drink and they just say \"cool man\" and then move on. \n\nA lot of the \"peer pressure\" was just self induced and the vast majority of people don't care or are barely drinkers once you step outside of the bars.",
            "score": 1,
            "replies": []
        }
    ]
}