{
    "title": "Slight moment of panic",
    "author": "bigcdabomb3",
    "subreddit": "stopdrinking",
    "rank": 73,
    "score": 28,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3zw5v/slight_moment_of_panic/",
    "id": "1j3zw5v",
    "selftext": "I got up to use the bathroom in the middle of the night and I freaked out! I couldn’t remember what I did the night before. Then I took a deep breather and felt relieved. I didn’t do anything. I knocked out early, watching tv and drinking my peach Bellini sparking water. What a difference. It’s reallllly realllly nice not having to stress over what I could have possibly done or said. I’m going to keep on trying",
    "comments": [
        {
            "author": "coryrbk",
            "body": "Yeah that is definitely a win not having to\nConnect the fuzzy details wondering if I did something dumb",
            "score": 3,
            "replies": []
        },
        {
            "author": "olewobblyknee",
            "body": "I wake up in the middle of the night sometimes and panic that I did, what I used to always do, and hide a bottle of whiskey. I usually remember pretty quickly that I didn't, but sometimes I'm panicked enough to check the hiding spot. Always a huge relief to realize I didn't drink, and just slept really well.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tough_Got_Going",
            "body": "I hear you! I had what I think is my first drinking dream. Had champagne and went to take another drink of it and realized it was booze and thought about how I'd have to set back my ticker! 😂 It's funny now but I woke up in a panic. Feels great not to wake up with regrets\n\nIWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "lovedbydogs1981",
            "body": "When these things happen, in my experience, it’s best to do what you did here and focus on the positives. If you scroll you’ll find similar posts, but where people really focus on being back in a bad headspace—that’s been me too on a few of these occasions, especially after dreams with alcohol in them. But it’s really just a dream, just a moment, it passes and here we are sober. Which… really is nice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spare_Answer_601",
            "body": "It’s the alcohol leaving your body. Takes time. Gets Better every day IWNDWYT",
            "score": 1,
            "replies": []
        }
    ]
}