{
    "title": "From a rooftop bar in Bangkok",
    "author": "JayShocker",
    "subreddit": "stopdrinking",
    "rank": 3,
    "score": 798,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 112,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j41jxy/from_a_rooftop_bar_in_bangkok/",
    "id": "1j41jxy",
    "selftext": "I just spent the last month working in rural Thailand. It was hot, long hours. I took my first hot shower in weeks about an hour ago. Now I'm on the rooftop of my hotel because I'm hungry and this is where the bar/restaurant is. It's beautiful up here. I saw a delicious looking pineapple mojito on their menu just now. I'm by myself, and nobody I know would know if I had a drink here. Nobody here knows I'm a little over three years sober. I haven't had a craving like this in a long time... but I remembered it isn't about the one drink for me. It's about all the drinks that would follow the first. With that thought, I ordered a Pepsi and food instead. I Will Not Drink With You Today, regardless of where I am and who is around me.",
    "comments": [
        {
            "author": "Seekingthe111",
            "body": "Sounds amazing! I bet they have some fabulous fruit juice or ices tea that would be just as delicious and no regrets. Only pleasure. Enjoy! IWNDWYT",
            "score": 110,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "They definitely had those options, thanks for the great idea!",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "receiveakindness",
            "body": "I just spent 4 days in Bohol, Philippines searching for NA beer and drinking more frozen fruit drinks than I prefer. I finally found a bar with them today and it was perfect. ",
            "score": 52,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I'm glad you found them, a good NA really hits the spot sometimes!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "DrP3n0r",
            "body": "The sneaky drinks where no one would know or suspect a thing are the hardest to leave behind. I'm proud of you for your strength and commitment. It's really inspirational to me, as I have been feeling sad that I can't just \"enjoy one\" while traveling in new and beautiful places. But I suppose those places are even more beautiful when I am not experiencing them through a haze.",
            "score": 41,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "They really are some of the hardest to leave behind. Thank you for the encouragement! Over the last month, I saw around 20 beautiful sunrises that I wouldn't have seen if I was still drinking. I'm excited for you to experience more beautiful places without the haze, too!  IWNDWYT ",
                    "score": 9,
                    "replies": [
                        {
                            "author": "DrP3n0r",
                            "body": "What a sweet comment, thank you very much for responding and for the well wishes. I'm going to Costa Rica for my honeymoon in a few months, and I am honestly so excited that I will be present and sober for all of the awesome wildlife we will see.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "JayShocker",
                                    "body": "I'm excited for you, I bet it'll be beautiful! Congratulations on your wedding!",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "arcademachin3",
            "body": "90 minutes after that drink the sugar will start to crash and you’ll have a “what’s next?” Feeling that will disturb the peace and satisfaction you have now.  Protect that peace! You earned some amazing, undisturbed sleep tonight.",
            "score": 32,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you! I protected it with some help from my friends! IWNDWYT ",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnargyFBG",
            "body": "It’s such a beautiful country. Can’t wait to visit it sober this time.",
            "score": 17,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Definitely a fantastic sober experience!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "AnargyFBG",
                            "body": "Did you stay up north?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "windintheaspengrove",
            "body": "Hey - I’m in a similar boat. Working in a remote area of the Amazon rainforest. I’m pretty worried about getting back into society and how it might be harder to not drink… how are you going to manage?",
            "score": 14,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I'm pretty big on finding other things to focus on. I'm excited to get back into a weight lifting routine in the evenings and diving into some of my hobbies when I get home. I find that if I have something positive that I enjoy doing on my calendar each day, it's a lot easier for me to not drink. I hope your transition out of the rainforest goes well, I'm rooting for you!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ostensiblyzero",
                    "body": "I know this isn’t the right forum but can I ask what you do? That sounds like a really cool experience.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "windintheaspengrove",
                            "body": "I’m volunteering through Workaway! I actually quit my job with enough savings to cover rent until I’m employed again (hopefully, this US economy is scaring me), buy some flights, and go to South America. I’ve been teaching English in the Amazon for 3 weeks now and haven’t spent a dime.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "ostensiblyzero",
                                    "body": "I am envious, that must be a challenging but ultimately nourishing experience. I’m in nursing school at the moment but it is my goal to take that abroad for an extended period after I get a few years experience under my belt.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "windintheaspengrove",
                                            "body": "That sounds like a great goal!! For things like this, if you do decide to do something sooner, you don’t need any experience. But wow, travel nursing abroad sounds great.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Florida_Sunshine_23",
            "body": "Proud of you. WE are here with you. Maybe not sitting on that rooftop; but right here.",
            "score": 14,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you,  it means a lot!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PageNo4866",
            "body": "we must always prepare for the demon to re-appear. \nthanks for the reminder..",
            "score": 8,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "It surprised me today, but I'm glad that I thought it through and didn't drink. We could all use a reminder sometimes!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BahBahSMT",
            "body": "Alcohol will not enhance the experience. It will tell you it will but ultimately it will dull the brain. Enjoy the soda and the food and the rooftop. \nAnd that shower was probably better than any drink ever!!!",
            "score": 10,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Oh, the shower was amazing! Definitely better than any drink!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MindPerastalsis",
            "body": "that is something I need to truly start believing, it’s never just the one, good for you 🙌🏽 safe travels ❤️",
            "score": 20,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I believe in you!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spare_Answer_601",
            "body": "Enjoy the scenery with a clear head. IWNDWYT",
            "score": 8,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "That's one of the many blessings of not drinking. Thank you for the encouragement!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Spare_Answer_601",
                            "body": "Totally! I am so grateful I quit :) enjoy",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GRF999999999",
            "body": "I've been tempted recently, after 5+ years, and you're absolutely right - it's not the first, it's the following. I can almost picture the entirely regrettable texts and phone calls I'd start making around drink 4. \n\nIWNDWYT",
            "score": 9,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Congratulations on the 5+! Yeah, I tend to break out in bad decisions after a few too. IWNDWYT ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Small-Ask-1664",
            "body": "In the end, it’s only YOUrself that cares if you drink or not. Keep punching",
            "score": 6,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you for the reminder,  I appreciate it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rensfriend",
            "body": "hey congratulations on your choice! you're right, the only person who would've known would've been YOU and ultimately, b/c it's YOUR journey, your self-knowledge is the only thing that matters.  Love how you took care of yourself in a super permissive space and did one more day.  CONGRATS - iwndwyt",
            "score": 6,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you for this encouragement, I appreciate it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FebruaryDiva",
            "body": "Stay strong. You can do it. Enjoy the beautiful view and food.",
            "score": 7,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "That's exactly what I did. Thank you for the encouragement!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Expert-Gur-1270",
            "body": "Good job! Alcohol is so sneaky!",
            "score": 6,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "It really is. Thanks for the encouragement!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "b3ta_blocker",
            "body": "Someone on here mentioned an alcoholic drink being like a 'dark veil' or something and it is. I guarantee that if you had an alcoholic drink it wouldn't enhance that rooftop bar it would introduce hectic thoughts, confusion, inability to meet people around you in the eye - what it would do is make you have more drinks and tomorrow you'd be on here saying 'I can't believe my streak ended'.",
            "score": 6,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Definitely. I'm glad to say that my streak is still in tact. IWNDWYT!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "themaincop",
            "body": "I find more and more when I have a craving it's really just a craving for a tasty beverage. NA beer basically satisfies any craving I have, but last time I was in the tropics I had some NA cocktails too that really hit the spot. I really don't feel like I'm missing out on anything anymore.",
            "score": 6,
            "replies": [
                {
                    "author": "cutecreep_92",
                    "body": "I just left a long comment basically expressing the same thing, so this made me happy to see. I grew up in Florida but live in the Midwest now. Whenever I go back home to visit family, I find that when I'm at the beach or at a theme park, ordering a mocktail or virgin version of whatever alcoholic beverage I think I want actually scratches the itch quite a bit. I get to enjoy the taste, and still be present to the things around me to enjoy them in full, and not through a haze.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "themaincop",
                            "body": "at the end of the day everyone loves having a little treat",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JayShocker",
                    "body": "Yeah, my craving was definitely for a tasty beverage mixed with hunger. Once I was done riding that wave the craving disappeared pretty fast!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Glad_Day_3007",
            "body": "Good for you! IWNDWYT",
            "score": 5,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pleasant-Stable9644",
            "body": "Enjoy your view and Pepsi! IWNDWYT",
            "score": 6,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LankyPurple",
            "body": "Great job on ordering the Pepsi, keep it up! IWNDWYT",
            "score": 5,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IdahoDuncan",
            "body": "You can do this and you’ll be happy you did!",
            "score": 3,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I made it through the night, and I'm very happy that I didn't drink! Thank you!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IdahoDuncan",
                            "body": "I’m about the same amount of time in as you and that situation would be tough for me as well. Nice job",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "solace_seeker1964",
            "body": "Sounds paradisial!  Way to resist that craving, and remember why you quit in the first place.   IWNDWYT!  Thanks.",
            "score": 7,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "It really was a beautiful contrast to end the month. Thanks for the encouragement. IWNDWYT ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BoogalooTimeBoys",
            "body": "IWNDWYT!",
            "score": 5,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I like not doing things together like this!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sporesatemygoldfish",
            "body": "You would know you did. That's what matters. IWNDWYT.",
            "score": 4,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Exactly. IWNDWYT ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hotdogindeed",
            "body": "In the morning you can walk up Wat Saket Ratchawora Mahawihan",
            "score": 3,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I like that idea!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BiomedBabe1",
            "body": "Well done!!",
            "score": 3,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ostensiblyzero",
            "body": "Drinks in a foreign country are the hardest to turn down by far.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Necessary_Year_5178",
            "body": "\\- 447 days -\n\ngood for you, and I can relate. for me, the toughest \"trigger\" times are ones like you're describing -- it's been a tough day/week, and now it's miller time lol. good on you for hanging in.\n\nIWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you, it's good to know we aren't alone with these triggers! IWNDWYT ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bumdhar",
            "body": "Not a big pop drinker, but a Pepsi sure sounds good on a rooftop bar in Bangkok!",
            "score": 3,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "It really hit the spot for me!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cornfl8kgrl",
            "body": "that sounds beautiful... I'm glad you had the Pepsi!! IWNDWYT 😊",
            "score": 3,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Me too! IWNDWYT ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Local-Fig9188",
            "body": "I needed to hear this. It’s my Friday and thought a beer after work would be nice. But then I saw this so thank you. IWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "We're all in this together. IWNDWYT ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nuffced",
            "body": "Are they hiring?",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "All the time, but it's a military gig, so it's a whole other thing. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Extreme-Method59",
            "body": "Sounds fun what jobs are available there",
            "score": 2,
            "replies": []
        },
        {
            "author": "Apart_Technology_841",
            "body": "Excellent job! Why destroy a perfectly normal and happy life?",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Great point, thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "alert_armidiglet",
            "body": "Well done! I love Thailand, and haven't been for almost 30 years. Enjoy it.\n\nIWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "It's a beautiful place. Thank you!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "summitcreature",
            "body": "I've had a bender in Bangkok and it makes you incredibly vulnerable.",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I've been pretty lucky to avoid that. Thanks for pointing out the safety aspects, I appreciate it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Equivalent-Cress-822",
            "body": "Sounds like a great opening to a movie.",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I hope not, I'm looking for an uneventful week after this! lol",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ghost_victim",
            "body": "Watching the new season of White Lotus - I just want to eat the fresh fruit and drink coconut water from the coconut! They drink quite a bit in that show but luckily the booze isn't making me crave.. just the fruit",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Some fresh coconut water straight off of the tree is pretty special!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tyophious",
            "body": "Well done 👏",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AREM101",
            "body": "IWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "IWNDWYT ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "QueenDymphna",
            "body": "Except for the hard work and Thailand part, I feel you. IWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "I'm glad I'm not really alone in it. IWNDWYT ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "idcs1414",
            "body": "IWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "IWNDWYT ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Clinton_Dix",
            "body": "All I wanted was a Pepsi. Just one Pepsi.\n\nAwesome job, OP!",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cutecreep_92",
            "body": "Vacation drinks are always such a battle. I felt this so hard.\n\nI could be home where I live in the Midwest for a year and get the most minimal, minor cravings and triggers.\n\nI grew up in Florida and most of my family still resides there, so I take a vacation and fly back down once a year to see them. My mom lives in a beautiful beach community. My dad works in tourism, so I can go to Disney and Universal for free. Beach cocktails while at an outdoor pier restaurant, and fancy theme park drinks (especially in Disney's Epcot, or the Harry Potter park in Universal) are always calling my name. I have to regularly check myself and take it minute by minute sometimes because the cravings just permeate my brain and that little demon is whispering and scratching to get out. As soon as I fly back to the Midwest, I'm fine. It's so strange to me. A margarita while overlooking the ocean is 15x harder to fight than ordering that same drink at a restaurant in South Dakota.\n\nMost of the time, I hold steadfast and don't give in, but I'd be lying if I said I had a 100% success rate.\n\nWhat I do have success with is just, on occasion, ordering those drinks but without alcohol. I know not everyone in recovery is comfortable with this, but in my journey, I have found that it takes away the urge for me, or at least quiets it down to where I can be present in the moment around me. A virgin cocktail/mocktail is pretty much the same as an NA beer for me, which I do see talked about on this sub. I can have the aesthetic and a delicious drink, without poisoning myself and spiraling and falling off the wagon.\n\nI'm so proud of you for not giving in. You're doing great, OP. IWNDWYT!",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you!  As far as the mocktail/NA thing is concerned, I'm a fan of them. The way I see it, our journey is each our own. I'm just glad to hear you found a way of navigating it that works well for you. Even if you stumble sometimes, I'm proud of you for working through it while on your vacations! ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "galwegian",
            "body": "Pepsi? You sure you don’t want a Coke? With crushed ice and a slice of lemon. Mmm. Stay strong. Well done on three years.",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you! There was a slice of lime in the glass!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "galwegian",
                            "body": "Lime even better😊",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BroThornton19",
            "body": "My parents just flew into Bangkok and my dad is 30 years sober! Congrats on your almost 3 years, IWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "30 years is amazing! Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "strangedeepwell_",
            "body": "Amazing. The mojito wouldn’t be worth it at all",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "No it wouldn't. I'm glad I dodged it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RPGDesignatedPaladin",
            "body": "Good job! Proud of you!",
            "score": 2,
            "replies": [
                {
                    "author": "JayShocker",
                    "body": "Thank you!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "freeride35",
            "body": "Strong work!! IWNDWYT!",
            "score": 1,
            "replies": []
        },
        {
            "author": "jifus_revenge",
            "body": "congratulations on making that decision Jay!",
            "score": 1,
            "replies": []
        }
    ]
}