{
    "title": "I have to stop drinking",
    "author": "sunflower_butterflyw",
    "subreddit": "stopdrinking",
    "rank": 116,
    "score": 4,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j43k94/i_have_to_stop_drinking/",
    "id": "1j43k94",
    "selftext": "Yall, I’ve never been a drinker like that…mixed drinks on a weekend night out with my friends… wine after a long week of work (and both occasions were rare).. my drinking started to pick up about 3 years ago.. I switched to vodka/ white claws at every outing I had or trip I took.. it still wasn’t anything too crazy though…. Just a good time.. after I had weight loss surgery… vsg.. in Feb of 2024 my drinking became shot for shot with no cut off… the only cut off was me getting into arguments and fights with a specific person..(at that point i knew I was beyond my limit because I am not a violent or argumentative person)… fast forward to June of 2024..now I’m taking more and more shots and not only still going off on a specific person.. but apparently saying things that rub others the wrong way as well…I held it in the road for a while and was ok for a little bit… but THEN… in September of 2024 I started day drinking and even drinking alone.. to the point I fell asleep on my garage floor because I was trying to get out of the car and that’s as far as I made it…. Later whenever I drank I would become violent with only one person… even in a room full of people… say awful things to them and etc… of course it would end up with me being bruised up.. but when u start it u gotta expect the other person to defend themselves too right…. I slowed down in December of 2024.. did well in January 2025 and had another slip in Feb 2025 that led me to just stay in a hotel a few days by myself alone just staring at the ceiling…. BUT NOW I REALLY BELIEVE THE FINAL STRAW FOR ME (BECAUSE IM JUST TIRED OF MY OWN SHENANIGANS ATP) WAS THIS PAST WEEKEND WHEN I WENT OUT WITH FRIENDS… WE WERE DAY DRINKING AND TOOK A BREAK FOR A WHILE… THEN WE WENT OUT TO A LOUNGE AND WERE DRINKING… I BARELY EVEN REMEMBER THE SECOND HALF OF BEING IN THE LOUNGE BUT THE VIDEOS SHOWED ME WE HAD A GREAT TIME… THE PROBLEM CAME IN WHEN WE WERE LEAVING… I WALKED OUT THE LOUNGED PERFECTLY FINE… THEN BOOM! AS SOON AS WE GOT INTO THE PARKING LOT… I FELL FACE FIRST IN THE MIDDLE OF THE ROAD…. I TRIED SO HARD NOT TO BE THAT PERSON… I TRIED BY BEST TO GET UP… because I didn’t wanna be that person ..JUST TO FALL AGAIN…it was a group of us yet once again I STARTED GOING OFF AND TRYING TO FIGHT THE SAME SPECIFIC PERSON AGAIN.. THAT NIGHT ENDED WITH ME CRYING IN MY CLOSET WITH ANOTHER FRIEND THAT WAS THERE…. I think it is time I understand… I CANT DRINK IN MODERATION…. Most people know their limit… but I can never feel mine until I hit it :( …. I haven’t had a drink since that night… so it’s been 2 days going on 3…. OAN: why is alcoholism going so unnoticed in this generation.. all we do is laugh it off the next day and prepare for the next drinking session THAT IS NOT NORMALLLL.. well it doesn’t feel normal to me.. I’ve sent a cry for help to people close to me and they think it’s a joke. I AM SCARED ",
    "comments": [
        {
            "author": "SallyCook",
            "body": "> I’ve sent a cry for help to people close to me and they think it’s a joke. I AM SCARED \n\nThe wonderful thing about getting into a program (and there are lots) is the fellowship of meetings. We \"get\" each other. \n\nThe [Community Guidelines and Resources] (https://old.reddit.com/r/stopdrinking/wiki/index) page is a good place to start. There is a list of recovery resources, and you can find something near you.\n\nTaking that first step is scary, but it is so very worth it. I love my life now. Sobriety is liberating.",
            "score": 3,
            "replies": [
                {
                    "author": "sunflower_butterflyw",
                    "body": "Thank you for supplying me with that info… yes it is scary… but enough is enough…. I’m tired of my own mess atp… it’s not even worth the awful feeling afterwards..",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eye-deliver",
            "body": "Glad you’re here! There were several times that I just plain passed out while I was still standing landing on my face a couple of those times. Got a big scar under my eyebrow and another under my chin to remind me. I’m guessing you have some of those too. Stopping is hard. But drinking is pretty damn hard too right?  My body and mind are thanking me everyday now that I’ve stopped. Yours will too. \nIWNDWYT",
            "score": 1,
            "replies": [
                {
                    "author": "sunflower_butterflyw",
                    "body": "Thank you for sharing your experience with me today. “Stoping is hard but drinking is damn hard too right?” That’s going to stick with me through my journey <3",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}