{
    "title": "How Many Campaigns are You Currently Playing?",
    "author": "KarlMarkyMarx",
    "subreddit": "DnD",
    "rank": 10,
    "score": 177,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 426,
    "url": "https://www.reddit.com/r/DnD/comments/1je43li/how_many_campaigns_are_you_currently_playing/",
    "id": "1je43li",
    "selftext": "I'm playing at 4 different tables, and that's after my wife convinced me to back out of the fifth one I signed up for.\n\nThis subreddit probably isn't a good gauge for the *average* number of games a typical player is active in, but I'm curious how addicted ya'll are to this hobby.\n\nEDIT: I also play a Call of Cthulu and a Pathfinder game. ",
    "comments": [
        {
            "author": "Signatory_Sea",
            "body": "I currently hold a spot at 5 tables. One of which I am the DM, the rest of which I play in. The big thing to note is of these tables, only one of them meets weekly. My game, and 2 of the others meet once a month, and the 5th game is on a temporary hiatus as the DM and his wife are having a baby soon.\n\nThe big thing is though I'm in 5 games, I only play twice a week.",
            "score": 80,
            "replies": [
                {
                    "author": "TellTallTail",
                    "body": "ONLY twice a week hmmm",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Signatory_Sea",
                            "body": "There was a point in time in my years where I was playing DND 5 out of the 7 nights in a week. 2 is a massive downgrade lol",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "gibletsandgravy",
                                    "body": "In adulthood? Because that's a lot of role-playing!!! Or do you mean as a kid? Because then those are rookie numbers!",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Signatory_Sea",
                                            "body": "In adulthood!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LodgedSpade",
            "body": "Player in 2 campaigns.",
            "score": 28,
            "replies": [
                {
                    "author": "yankthedoodledandy",
                    "body": "Same. Both 2x a month. You?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "LodgedSpade",
                            "body": "Weekly more often than not. Usually we play the first campaign 3x a month, and the second campaign 1x a month.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "yankthedoodledandy",
                                    "body": "That sounds like a good solid group. Awesome!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "LodgedSpade",
                                            "body": "Yeah it's mostly the same folks, and they're great. We've been at it for a year and a half so far! And I'm hoping for many more",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "iamreeterskeeter",
                            "body": "Same. They alternate weeks so I play weekly.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JellyAllDay",
            "body": "3.\nPlaying in one, and running two different homebrew games.",
            "score": 35,
            "replies": [
                {
                    "author": "Mindless-Zucchini",
                    "body": "Same, but I still only play twice a week at most, sometimes it's a couple of weeks until I sit down at one of the tables, so it consumes less time than other hobbies",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "oathy",
                    "body": "Identical to me",
                    "score": 5,
                    "replies": [
                        {
                            "author": "it-burns-us-precious",
                            "body": "I am a player in 2 campaigns with the same DM but with diggerent players. One is homebrew and the other is curse of strahd",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JTremert",
                    "body": "Same!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "strugglefightfan",
                    "body": "And me",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Impzor",
                    "body": "The other way around for me. Playing in two and DMing in one.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sindralis",
            "body": "Zero. Our game paused and then fell apart after some personal drama between a few of the participants.\n\nIt’s been about a year. We never picked it up again.  I miss it.",
            "score": 32,
            "replies": [
                {
                    "author": "action_lawyer_comics",
                    "body": "That sucks. But you can always start a new one with the players you have good terms with",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "kingkongshlong",
                    "body": "Zero. We got the final level of ToA, DM started school with a full time job, one player had a kid, I moved.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Sindralis",
                            "body": "Similar here. We got to maybe the final three sessions of Descent into Avernus. Say what you will about that module but we had a fantastic time with it. Campaign lasted three years. Twists and turns, laughs and even tears. RP like I’ve never experienced before. The DM and players were in their element to the fullest.\n\nIt kills me that their differences were irreconcilable. Maybe I’m the problem here. I got too attached.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NapolenV",
            "body": "About to be 2, one as a player, one as a DM\nBut I don't think I could manage a lot more, despite both only playing about 1-2 times a month\nI think a third would be ok, if it more like straight up dungeon crawlers or just one shots.\nI'd rather be invested a lot in those two than to play more but not be as invested in any of those.",
            "score": 12,
            "replies": [
                {
                    "author": "Deathflash5",
                    "body": "I run a campaign weekly, PC one monthly, and it’s a lot. So much of my spare time is spent running through campaign ideas I don’t think I’d have time to even PC another game on a regular basis, let alone DM another one! I totally agree with you, much better to have a story you’re passionate about than overextending just to play more.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Belive_In_the_Net",
            "body": "Dming Curse of Strahd and Strixhaven, playing as a player in Escape from the Abyss and Odyssey of Dragonlords",
            "score": 10,
            "replies": [
                {
                    "author": "LordSmokedPony",
                    "body": "How are you experiencing oddyssey? \nGonna run in in a few months for my group, just waiting for the book to be reprinted.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Belive_In_the_Net",
                            "body": "Online, my bruh payed an absurd ammount of money to get it and he is drawing the maps by hand, honestly I'm having a blast",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hexagon-Man",
            "body": "Never enough.",
            "score": 9,
            "replies": [
                {
                    "author": "KarlMarkyMarx",
                    "body": "Correct answer.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rabgo",
            "body": "None *sad d&d player noises*",
            "score": 7,
            "replies": []
        },
        {
            "author": "gibletsandgravy",
            "body": "I was in 2 for years, but one campaign concluded, so I'm down to one. That said, our DM will take weeks off and let players run one-shots or other systems completely. Hell, we were stuck a couple of times and just ended up playing Red Dragon Inn those weeks. Still fun as hell. But even with the variety, and even with a million real life things screaming for my attention, I still really miss that second night.",
            "score": 6,
            "replies": []
        },
        {
            "author": "DjDrowsy",
            "body": "I'm in a 5e game every week, and a Morkborg game every other week. I want to start up a Vampire the Masquerade 5e game soon but the scheduling is not lining up.",
            "score": 8,
            "replies": [
                {
                    "author": "ZootOfCastleAnthrax",
                    "body": "Yeah! I'm ready to try something new. I'll look into vampire.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "DjDrowsy",
                            "body": "What kind of game do you like to play/run? I can give a couple more suggestions of you would like.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ZootOfCastleAnthrax",
                                    "body": "Nothing modern, futuristic or apocalyptic. Nothing based in real US history. I prefer the complexity of Pathfinder over DnD. I like lots of structure, cuz I'm not that imaginative. :)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DjDrowsy",
                                            "body": "VtM is modern, and based on real history, so might not work for you.\n\n\nI think give Burning wheel a look if you havnt already. It was a crowd favorite 5-10 years ago and it is still worth reading just for its insights.\n\n\nI also love 13th age as well. Plays similar to what you know, but the classes are actually mechanically different. Not everyone's cup of tea but worth looking into.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ZootOfCastleAnthrax",
                                                    "body": "Thanks so mich!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Much_Bed6652",
            "body": "The answer is easy. You play what you can reasonably manage with your schedule. I play in one long term. I have two others that aren’t available to meet often because of the obligations of myself and others. I can’t say I wouldn’t like to do more but the potential to sacrifice home life stuff is a deterrent for me.",
            "score": 8,
            "replies": []
        },
        {
            "author": "SpiraledChaos",
            "body": "I am DM in 3 games (Rime of the Frostmaiden, and two homebrew games)\nI am a player in 4 games (VtM, homebrew Dnd, Fabula Ultima, and Dune)\nOn top of that I am in the final stages of completing a Pirate game and a Monster Mobster game based on Blades in the Dark.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Whole-Opening9732",
            "body": "I play in a weekly game and DM for the same group in a different campaign that's played only a couple times a year.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Yojo0o",
            "body": "A lot.\n\nLet's see... I'm actively a player in three biweekly DnD campaigns and one weekly remote campaign, I run a biweekly Call of Cthulhu campaign, and I run a Spire: The City Must Fall campaign on a pickup basis. So, six campaigns, two of which I run, though those are the non-DnD games.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mrsnowplow",
            "body": "i dm 3 games \n\nbeen playing a long standing pathfinder game\n\nstarted up a 5e game recently \n\nand just as i started a new game the game i was a player in has  collapsed and i was asked to DM it to save it",
            "score": 2,
            "replies": []
        },
        {
            "author": "LordSHAXXsGrenades",
            "body": "Im DMing for 4 tables and im a player on 1 (forever DM gets to play as a player again after 15years,buhyeah!)\n\nOne 5e game. 4 of them are a completly homebrew system that we are playtesting rn.",
            "score": 2,
            "replies": []
        },
        {
            "author": "purestevil",
            "body": "Just one.",
            "score": 2,
            "replies": []
        },
        {
            "author": "_ironweasel_",
            "body": "Week in week out? Just the one rn.\n\nSemi-regular, whenever we can get together? Two of those.\n\nOccasional campaigns that happen a couple times a year? Another one of those.\n\nGames in the holidays with the kids? I have two lil gangs that play, one way more often than the other.\n\nThen a bunch of one-shots, spin-offs, etc that come and go, mainly do my players can get DM experience.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CMormont",
            "body": "3\n\nJust lost my 4th\n\nBut my Lil bro wants to try dm so I'll hop in his game every now and again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ZootOfCastleAnthrax",
            "body": "Three. One DnD game with my kids, one Pathfindee game, and one DnD game the PF group started when our GM was out for a while d/t health issues.\n\nI wish I could quit my job and play Pathfinder every day.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Foreveranonymous7",
            "body": "I'm playing in 2 right now. A one on one with my wife , the DM, and a group game that she also dms with some of our friends. The group game is every other week, so we alternate with our solo game and I get to play (almost) every weekend. XD",
            "score": 2,
            "replies": []
        },
        {
            "author": "Equivalent_Option583",
            "body": "How are you guys finding games? I struggle to keep even one active",
            "score": 2,
            "replies": [
                {
                    "author": "FranckIncensed",
                    "body": "I wouldn’t be surprised if a bunch of folks are in big cities with a lot of options or do it online. \n\nIn my case, I live in NYC and there are a bunch of options here. I’m in a weekly campaign that’s been going strong for almost a year now in person and two others with work friends that meet like once a month/once every two months in person.\n\nEdit: If I could, I’d play like thrice a week consistently 😭",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pitiful_Relative_310",
            "body": "I dm 2 campaigns for separate groups. I'm a a player in 1 dnd group and a player in 1 pf2e group. And I just got baldurs gate(it counts). I also sporadically dm one shots online on startplaying.games",
            "score": 2,
            "replies": []
        },
        {
            "author": "physicalphysics314",
            "body": "For a while just 2 (one as a DM, one as a player) but I got added as a temp PC to a campaign and all of a sudden my free time evaporated\n\nFinally finished up the 5 year campaign I DM’d and will retire my temp PC next session. Feels good. \n\nNow I will focus on designing my new homebrew campaign",
            "score": 1,
            "replies": []
        },
        {
            "author": "draynay",
            "body": "Three, 2 d&d and 1 Call of Cthulhu, but there are two other suspended games that might resume some day but I'm guessing not.  I'm running two of them and a player in the other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scrounger_HT",
            "body": "i run 2 online for friends and play one in person. also if were going with how many campaigns im in its like 8 depending on the composition of who shows up to which table each night",
            "score": 1,
            "replies": []
        },
        {
            "author": "Daetur_Mosrael",
            "body": "4. Running one, player in 3 others. The one I run is 2 saturdays on, one saturday off. The other games are all weekly.\n\nSometimes it DOES feel like.... maybe one game too many, haha.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sakkdaddy",
            "body": "3. I DM one and play in 2 others. I want to play once or twice a week and the 2 I play in only meet every 3 weeks or so. :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "KarlZone87",
            "body": "Running 5 across 2 weeks, playing 0",
            "score": 1,
            "replies": []
        },
        {
            "author": "cloudysuit",
            "body": "DMing one, playing in 3 others.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oconitnitsua",
            "body": "Running 2, soon to be 3. Playing in 2!",
            "score": 1,
            "replies": []
        },
        {
            "author": "_hobnail_",
            "body": "Three. I’m currently in two 5e games (Curse of Vecna and one set in Ravenloft), same group, different DM’s that alternate every Tuesday online. I’m also in a monthly in person Cyberpunk Red. \n\nHad you asked this two weeks ago I’d have also included the 5e Frost Maiden campaign that’s been going on and off for almost five years now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arch0n84",
            "body": "One weekly campaign. The most I've played simultaneously was three weekly campaigns and that was one too many.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KillerBeaArthur",
            "body": "Three. I run one every other week. Friend runs one on the alternate week. We have one other one that happens every month or two on a Saturday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xAn_Asianx",
            "body": "Was in 3, now I'm down to one that meets every other blue moon. I should start looking for another group 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Good_Guy_Vader",
            "body": "DM 1 and play 1, both are weekly games. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhraseAlternative117",
            "body": "I’m playing in 3. A Theros campaign on start playing.com, curse of Strahd with some coworkers on roll20, and one in person game where we started dragons of stormwreck isle and have moved onto only god knows where we are going to now.\n\nI also recently ordered some DnD solo books as well as the solo toolboxes off of DMsguild.com they are very helpful and have lots of guides over there",
            "score": 1,
            "replies": []
        },
        {
            "author": "sbwesq",
            "body": "I'm in two campaigns. They are bi-weekly on Saturdays and occasionally sync up on the same day, one in the afternoon and one at night. One is pay-for-play, and a long-time friend DMs the other free one.  The free one has a more flexible schedule. I think two campaigns are the maximum number of games without impinging on life, family, and work commitments.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wathever-20",
            "body": "DMing for one, playing in another, the one I'm DMing happens roughly once every two weeks and the one I play (being online with less people. so much easier to schedule) is once a week most of the time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ifsamfloatsam",
            "body": "8, four run once a month, I DM one of these. 2 are west march style, one is every other week, I DM that one and 1 is weekly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MartyFreeze",
            "body": "I play on a Westmarch discord server so I'm not sure how to answer this.. is it one or several?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Call_me_Telle",
            "body": "Dming a beginner campaign (LMoP) and playing in two more campaigns",
            "score": 1,
            "replies": []
        },
        {
            "author": "mildost",
            "body": "Like, almost ½ ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ender_Nobody",
            "body": "Between one and two, mostly because I only play through my phone and the second DM didn't make up his mind on a time on which we can play.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GabrielMP_19",
            "body": "Player in one. DM in another.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZealousidealClaim678",
            "body": "3. Player in 2, and game mastering warhammer fantasy 4e",
            "score": 1,
            "replies": []
        },
        {
            "author": "klaxor",
            "body": "Running 3ish, playing two",
            "score": 1,
            "replies": []
        },
        {
            "author": "InPurpleIDescended",
            "body": "One. I've only ever been in two at once if one is a short one, usually someone in the group wants to try DMing with a 3-5 session kind of game. But usually one. Being in more sounds overwhelming lol and where do you find the time!",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSmogmonsterZX",
            "body": "Playing? 2, alternating weeks\n\nGMing? 3. 2 alternating weeks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gib_entertainment",
            "body": "4 active ones and 1 that is sort of on a hiatus (one player went to another country for half a year so we put that one on hold)",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedDragonLS007",
            "body": "Playing in 2, a heavily modified Strahd game and an Eve of Vecna game. And I’m running a third homebrew game for my wife.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeightlifterCat",
            "body": "Currently in 2 games that run weekly - back to back on Tuesday night (but different groups). I run the later session.\n\nThe later session we used to have another game running on a biweekly rotation with a different DM to my game but had to drop it due to their busy work schedule taking over in the last few months, so at the moment I am running weekly.\n\nPersonally, I’d like to be in more games, but I try to consolidate it as much as possible because I don’t want to take away time from my wife, kids, or dog.",
            "score": 1,
            "replies": []
        },
        {
            "author": "D5r0x",
            "body": "Way too many currently since a few weeks. I'm playing Pathfinder1 rise of the Runelord every second week tuesday, every other tuesday I'm DMing PF2 Sky Kings Tomb, our regular day Wednesday we play one week The Slithering and the other Agents of Edgewatch and on Fridays I'm playing DnD5e in a homebrew world with another group.\nThe crazy thing outside of Friday we only play from 8pm-10pm because of family, work etc but for now almost 5 years we were able to play 95% of all Wednesdays which is crazy, thank you guys for being great Players and DMs",
            "score": 1,
            "replies": []
        },
        {
            "author": "FelMaloney",
            "body": "Playing in 3 and DMing 2. I at one point was playing 5 and I don't know why I feel I'm better now I guess because frequency is all over the place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dr34m3r_UK",
            "body": "Three, DM for two homebrew adventures , about to start playing in a 3rd. Also looking at DMing another for my brother in laws as they’ve expressed an interest in playing",
            "score": 1,
            "replies": []
        },
        {
            "author": "PossiblePoint7055",
            "body": "Playing a Grim Hollow campaign, running a DOIP campaign, and hopefully joining a Cyberpunk Red campaign soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HalvdanTheHero",
            "body": "7. Playing in three, running four. All but one are weekly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zigazoid",
            "body": "Only one in which I play and help out our DM with certain things but he runs the narrative etc.  I was running a campaign myself for my son and his friends but we had to tie that off as there schedules got too full.  Hoping to find another group to join but haven't had much luck so far.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Giles_Dent",
            "body": "Well, we have 4 story in parallel \nBut all with more or less the same people",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silverhedgehog1307",
            "body": "I play in:  \n1 byweekly homebrew  \n1 weekyl homebrew   \n1 monthly homebrew  \n1 monthly written module (which I am the DM for)  \n1 oneshots-server that has no schedule besides the one posted for the next week where you opt in to games run by the 3\\~ish dungeon masters that feel like running a game that week. The player groups vary but we have a pool of about 20 people so you get to know everyone after a while. \n\nSo if the dates kinda align weirdly I have 4 games in one week which is a lot. Thankfully it does not happen often.",
            "score": 1,
            "replies": []
        },
        {
            "author": "icedcoffeeeee",
            "body": "2.5. I'm in two games that run weekly, and one that meets whenever we can, which is closer to monthly or every other month.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Huge_Comfort2099",
            "body": "I’m in one ever active campaign that’s been going for 7-8 years but I’ve been in numerous others off and on. I’ve actively never been in more than 3 at any given point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RKO-Cutter",
            "body": "2.5ish\n\nOne is just a standard 5 levels into Waterdeep Dragon Heist\n\nOne is we completed a one-shot that the DM already has a sequel/followup planned so it's kind of ongoing\n\nTechnically one is a Masks campaign, but still,",
            "score": 1,
            "replies": []
        },
        {
            "author": "FiftyShadesOfPikmin",
            "body": "2 campaigns for the same group. We play once a week, shorter sessions than is probably standard. Every 2-3 weeks we switch back and forth between campaigns. My friend is the DM of one, and I'm DM of the other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Repulsive-Note-112",
            "body": "6 for me, 4 as GM. I run a club.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WritingNerdy",
            "body": "3 but all with the same group, we mix it up depending on who can show up for the sessions",
            "score": 1,
            "replies": []
        },
        {
            "author": "RyoHakuron",
            "body": "Seven currently, but will be starting another up next month for a total of eight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Row199",
            "body": "All virtual (two with IRL friends, two with people I met on the internet):\n\nSunday - every other week, 2hrs\n\nMonday - every other week, 2hrs\n\nWednesday - every other week, 3hrs\n\nThursday - weekly, 3hrs\n\nI dropped out of my weekly Tuesday game (2hrs) and every other week Friday game (2hrs) when my wife and I had a baby four months ago. It was a tough decision but caring for an infant is a lot! I usually end up holding him while doing D&D to give the missus a break. It’s worked out well so far :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "doubtinggull",
            "body": "0, sadly",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gariona-Atrinon",
            "body": "4? And you are not divorced yet? 😏",
            "score": 1,
            "replies": []
        },
        {
            "author": "jmthetank",
            "body": "I was in 2, but nether both collapsed, so now none.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PeteRawk",
            "body": "1",
            "score": 1,
            "replies": []
        },
        {
            "author": "im_AmTheOne",
            "body": "Two, but one is not started.\nSo I have a new campaign with 3 people and 2 DM (or a DM and D-DJ if you will) and I also plan a 1-1 campaign but I've been planing it for 3 months now and it is still not ready haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "mmmmmmdrugs",
            "body": "Playing in 2 and working on home brewing a world",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chance_Rutabaga5704",
            "body": "I’m currently the Dm my own homebrew game and we play for an entire weekend once every few months. I took the deep dive over a year ago having never played DnD before and decided to build out my own world from scratch I have 5 committed players but have had a few other players circulate through my table. \nmy parents jump in to help play as npcs in combat or during important sections and it’s a ton of fun. Even built a custom table topper to play on\n\nOne of my players is just about to start a new homebrew game for me and 2 others to play in following the same weekend format as mine. \n\nI also play in a second homebrew game that my dad runs for me my brother with some of our friends",
            "score": 1,
            "replies": []
        },
        {
            "author": "BisexualTeleriGirl",
            "body": "3. I'm DMing one and I'm a player in the other two",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cmacbudboss",
            "body": "I play in one and DM another!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ritual_Lobotomy93",
            "body": "Playing in 2 and running one. Considering DM-ing another but as a one-shot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiraclezMatter",
            "body": "I DM for two campaigns and play in a third. I’m also in a paid campaign of Lancer. So four total.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kbbaus",
            "body": "I'm a player in 2 weekly campaigns.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Qurety",
            "body": "Im Dming 3 campaigns and its right the sweet spot for me.\n\nIts hard to manage, write and remember every detail for all those 3 but I enjoy it so its great.\n\nIve considered opening a 4th one but I want soms nights for myself (dont tell my S.O xP)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dialkis",
            "body": "I currently run two games and play in three.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jilibini",
            "body": "Run one (it’s CoC) and play in D&D campaign based on dragon age setting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jaybird2k11",
            "body": "I would give my left fucking testicle for even one consistent game",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlvinDraper23",
            "body": "2, about to be 3. Playing in two games and about to start a homebrew campaign. \n\nI’m also about to start teaching kids how to play at the local library, so idk if that’s 4? 3.5?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheRandomOnion",
            "body": "Currently 2. My husband is running a dnd5e campaign and a separate gaming group usually runs pathfinder",
            "score": 1,
            "replies": []
        },
        {
            "author": "hogereslucas",
            "body": "2, one is weekly and the other is every other week, and I consider myself very addicted, but I go to college and soon will be working as well, but being in \"just\" 2 is a conscient choice that I would make even if I had nothing else to do, because of the amount of love and dedication I want to put into a character and into a story, I feel I can't do that if I'm going to several tables, so two is my maximum",
            "score": 1,
            "replies": []
        },
        {
            "author": "BuddhaMike1006",
            "body": "I am DMing one game and playing in two others.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tasty-Engine9075",
            "body": "I am running two. One is about to go onto hiatus and I'm jumping into a short game as a player for a month whilst I write some content and resolve personal quests. We will then pick up the second game probably 6 to 8 weeks.\n\nBoth games run weekly for 3-4 hours. The game as a player is also weekly and will likely be 3 hours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quirky-Ad2982",
            "body": "My husband and I were in 3 until recently. His campaign just ended and one of the others the DM is about to give birth so we’ll probably be on a hiatus for a while there. We’re waiting for one of the other 2 to end before starting anything new. 3 was to much for us, we have kids so life is already busy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Doctorbigpeepee",
            "body": "2",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheeOneWhoKnocks",
            "body": "About to join my second in which both will run weekly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordPat95",
            "body": "I am a month into DMing Dungeon of the Mad Mage. Also been a player in a Homebrew PF2e game for over a year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VeterinarianFit1309",
            "body": "I’m currently a pc in one character, but I’m doing a bit of world building for another one that I am going to dm at some point in the coming months",
            "score": 1,
            "replies": []
        },
        {
            "author": "blitzbom",
            "body": "I was playing in 1 and running 2. Now I'm just running 2. My DM for the other one is moving soon, and we haven't played since September of last year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "700fps",
            "body": "I'm running 6 and playing in one ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Morbuss15",
            "body": "I DM once a week for an online game, play a bladesinger in another weekly game, a paladin/sorcerer in a fortnightly game, and a Cleric in another fortnightly game.\n\nThat is probably my limit, six games a fortnight, 3 a week. More than that and you start to get campaign blend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "A_Gray_Old_Man",
            "body": "2\n\nOne at my FCBS and the one I host.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Synger91",
            "body": "Five, scheduled every other week, but not all DND.   \n  \nRunning one DnD Humblewood and one Everyday Heroes game.    \n  \nPlaying in Strahd and one other DND game.  Playing in one Fabula Ultima game",
            "score": 1,
            "replies": []
        },
        {
            "author": "SSL2004",
            "body": "We've been playing for about 3 years. I only really play with one group. We have a few campaigns in which different people are dming (mostly in the same connected universe, but they're generally run in cyclical \"seasons.\"  There was one period of time when we were able to run 2 a week in parallel, but schedules have gotten too chaotic to do anymore (and even when we were one of them had to be canceled in the week like half the time, so we were basically running one per week anyway) \n\nThat said we are now running two concurrently again, but one of them is once a month because two of the people in it have extra frictitious schedules.\n\nAs it stands:\n\nActive:\n\n\nDescent into Avernus Season 4 (Our \"Main\" Campaign)\n\nLost Mines of Phandelver Season 1\n\n\nDormant:\n\n\nWrath of the Kaiju (Loot Tavern) (Major Campaign)\n\nCandlekeep Mysteries\n\nVecna: Eve of Ruin\n\n\nComplete:\n\n\nDragon of Inspire Peak\n\nFrozen Sick (We intend to come back eventually)",
            "score": 1,
            "replies": []
        },
        {
            "author": "LadySilvie",
            "body": "I DM 2 weekly games, am a player in one weekly, one bi-weekly, and one monthly/sporadically.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jerseydevil51",
            "body": "Just 1. Full time work, married, kids, just does not leave a ton of free time for more than one game on the weekend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoatedGoat32",
            "body": "2, one 5e and one 5.5 with the former being a group of 4 and the latter a group of 6. Playing more would be great, but time 😞",
            "score": 1,
            "replies": []
        },
        {
            "author": "trinitywindu",
            "body": "playing 2\n\nDMing 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capnris",
            "body": "Two 5e games, both run by the same DM. Would have had three, but a work schedule change had me drop out of my Wednesday games just before one of the other two began.\n\nConsidering running a game of Lancer; need some heavy metal to balance out the fantasy magic lately.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jabax25",
            "body": "Some men out here drowning while others dying of thirst",
            "score": 1,
            "replies": []
        },
        {
            "author": "CraftandEdit",
            "body": "Playing in one, Running one and prepping to start running a second one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "everdawnlibrary",
            "body": "I DM a biweekly DnD game, I play in a biweekly DnD game, I play in a when-we-can-swing-it DnD game (4-6 times a year), I play in a monthly Pathfinder campaign, and I play/GM in a group of GMs who rotate doing occasional one-shots in various systems for each other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BentheBruiser",
            "body": "Jesus, OP. I can't not imagine being a functioning adult and having that much free time. \n\nI am lucky if I get a game or two at my one table a month",
            "score": 1,
            "replies": []
        },
        {
            "author": "YearObvious7214",
            "body": "I'm a player in one (my first one ever) and I do a spot of light DMing for family campaign.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scythe95",
            "body": "How many? I'm glad my group has time for atleast one",
            "score": 1,
            "replies": []
        },
        {
            "author": "VaATC",
            "body": "Three games here. Two that alternate weeks; one game every other Friday night for my GM's kid and mt daughter, one game on the opposing Saturdays, for the adults in the circle, and the final is a once a month game leaning towards adults but the GM was more than happy to let my daughter jump when she asked if she could play and he agreed as she tends to be able to adult fairly well when necessary for the age of 13.",
            "score": 1,
            "replies": []
        },
        {
            "author": "emmanuel-lewis",
            "body": "Im playing 3 d&d campaigns and one pathfinder, im running the three d&d campaign 2 homebrew and 1 curse of strahd. Then i play in abomination vaults for pathfinder",
            "score": 1,
            "replies": []
        },
        {
            "author": "nullturn",
            "body": "Currently 1 weekly, but next month another begins another weekly, and my own will be starting within two months (star wars 5e)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ti_Fatality",
            "body": "0 at the moment. I’m the forever DM, working on my next campaign.\n\nWould be nice to play a character more though",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brish879",
            "body": "I'm in 5 active campaigns, two of which I currently DM. One of the games I DM is played once every few months, but the four others are every two weeks. That gives me two games every week plus one extra once in a while.\n\nTwo of those are online, the rest are in person. One of the online games is also livestreamed on Twitch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rhineglade",
            "body": "2.  Both online.  One just meets on an irregular basis do to the DMs busy work schedule but I've been playing it for over 4 years.  The other one has been weekly and going on for about 2 years.  Currently playing through Dungeon of the Mad Mage on my Wednesday group and just started the Age of Worms Adventure Path converted for 5e on my Sat group.  Good times!  (During COVID, I was up to almost 4 games a week but to me that was too much)",
            "score": 1,
            "replies": []
        },
        {
            "author": "actorsAllusion",
            "body": "3 Tables\n\n1.  My weekly Eve of Ruin campaign I'm running on weekly Wednesday nights with a group of friends I've been playing with for like 6 years now.  \n2.  Weekly homebrew campaign run by my ex-boyfriend on Friday nights.  We usually take a week off each month for his sanity.  \n3.  One Every Three Weeks on Thursday Campaign run by some other friends.  \n\nThere was a brief period of time last year where it was four, with all of these (though the Wednesday night game was being run by someone else), plus a biweekly Monday night short campaign I was running.  THAT SUCKED.  NEVER DOING THAT AGAIN.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vitcavage",
            "body": "Tuesdays I alternate between a player and as a DM in two different campaigns (table likes this structure). My campaign I’m DMing is coming to an end so I’ll be a player twice \n\nThursdays I’m currently DMing but used to be a player. \n\nSo… 3 in 2 nights of gaming. In 2024 I did 4 nights of gaming to try to learn more systems. My wife was happy that I bumped it down to 2 — lol!",
            "score": 1,
            "replies": []
        },
        {
            "author": "angryjohn",
            "body": "I DM a regular weekly game and I have games I’m running for my kids and my friends that take place sporadically. I think I’ve got something like 5 of those games?  But those ones only happen about once a month. Some we might only play once or twice a year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "motionsickgayboy",
            "body": "I'm a DM in one and a player in 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "avarneyhf",
            "body": "I’m *technically* only apart of 2 tables, one of which I run that is freestyle homebrew with some utterly insane and intense self-made maps and rules. The one I play in though is actually home to 3 groups in the same campaign with the same DM and I play a different character in all 3 groups",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnofficialMipha",
            "body": "Everyone in my main 4 group dms 2 games or more but one of mine is basically cancelled. One of them dms 3 games and another person outside of the 4 also has a game but that one is quietly cancelled too. \n\nSo 8\n\nWe run 1-2 a week. Things are very slow campaigns take 3+ years",
            "score": 1,
            "replies": []
        },
        {
            "author": "Justincrediballs",
            "body": "Same DM, 2 campaigns. \n\nWe just finished Dungeon of the Mad Mage and are starting a new homebrew campaign for DnD.  \n\nOne of us has to cancel (with plenty of notice) for stuff with his kids.  On those days we play a (5 years running) 40k Wrath and Glory campaign.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smimic7",
            "body": "2. One weekly and one every other week. But the weekly took a month hiatus, and the every other week ended a month ago and is starting again this week on a new campaign.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SphericalCrawfish",
            "body": "1.5, that is a weekly and a biweekly. Neither are actually D&D but who's counting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eleonore_959",
            "body": "Only one cuz I'm too afraid to go look for strangers",
            "score": 1,
            "replies": []
        },
        {
            "author": "caustictoast",
            "body": "5. I DM Wednesday and Sunday and play Monday, Friday, and every other Thursday. But I just got a new girlfriend and frankly 5 is a lot of games so that’s probably going to drop to about 3 soon. \n\nSunday is set to wrap up in a month or two and Friday is being forced to move. Monday and Wednesday will likely stay. Thursday is my least favorite game but it’s so infrequent I just stay in it anyway",
            "score": 1,
            "replies": []
        },
        {
            "author": "BacktraF",
            "body": "I dm 2 and play in 2 so 4 total. May be starting a 5th soon as a player.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Legal-e-tea",
            "body": "2, with a third on (permanent) hiatus. DM in one, player in one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Serious_Day315",
            "body": "Now I’m currently on 3. As a DM I’m doing Candlekeep, as a player spelljammer and Avernus. And in some days I’ll start a pokemon home-brew game, so I can say that I’m on 4 haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "axlerose123",
            "body": "Not enough I play in one and we play maybe once a week sometimes not for months tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "GaiusMarcus",
            "body": "Four. Two each by two different GMs. One runs two weeknights a month for each campaign, the other runs every week but alternates games",
            "score": 1,
            "replies": []
        },
        {
            "author": "Overlord_Crabz",
            "body": "I play in a DnD campaign weekly running through shadow of the dragon queen. Still using 2014 rules.\n\nI play in 2 Pf2e campaigns, one I DM running quest for the frozen flame and the other as a player which is a complete homebrew setting. One weekly and the other bi-weekly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "starksandshields",
            "body": "I think technically it's 5 tables?\n\nI DM 1. I am an active player in 3. Then there's another campaign I am a player in but we haven't played in months.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iamnotyetdead",
            "body": "DM two games\n\nPlaying in one game\n\nHoping to add to both of them via community related things (LGS, gaming groups, etc)",
            "score": 1,
            "replies": []
        },
        {
            "author": "systemos",
            "body": "I DM 2, play in 2. Good balance I find.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Inactivism",
            "body": "One DnD, three other systems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "toxiczebra",
            "body": "Just one, weekly. But I’m 42, with kids, so I couldn’t afford the time for a second table. Even the one I have is a massive commitment.\n\nFWIW I’m the only one at my table with just one game. The folks at my table range between 2 and 5 (including ours) but one (a player at my table) DMs as a paid gig, and one is retired and basically lives at the LGS near him, so maybe not representative.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cats_Cameras",
            "body": "Two currently. Supposedly adding a third this week and another in April.\n\n\n3 in person 1 online.",
            "score": 1,
            "replies": []
        },
        {
            "author": "distilledwill",
            "body": "Just one. It's our first game since basically everyone in the group became parents, so I'm running it more sandbox style. It's actually a challenge to write because my inclination is to put story events right in the eyeline of the players, but i have to be more restrained and let them pursue their own goals.\n\nI've learned that important events can't be stumbled upon in a sandbox game, if the players go to save the blacksmiths daughter from the goblins, they succeed, and then on the way home they also encounter the cultists in the forest doing a ritual then I've put them in a bit of a bind because as far as they are aware the only way to follow the cultist quest is to do it right now. \n\nInstead, any event that the players encounter should logically arise from the adventure they are on. And any totally new adventures need to be accessed from a position where the players have the choice to follow it or not. We're only on session 4, so we haven't really had a chance to explore what the characters want to achieve yet, but I'm excited.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Number1Crate",
            "body": "3, 2 playing 1 DMing",
            "score": 1,
            "replies": []
        },
        {
            "author": "RageQuitler",
            "body": "Currently 4 looking for a 5th. 1 5e, 2 PF2E as player and 1 PF2E as GM.",
            "score": 1,
            "replies": []
        },
        {
            "author": "calyma",
            "body": "2 active, 3 on hiatus. The 3 on hiatus are with the same table as one of the active ones. I play twice a week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NuunMoon",
            "body": "Only one, but that is happening almost every friday from 6PM until midnight or sometimes more. (We are in our early 20's, most are in college hence the time) of course the time is not 100% spent playing ttrpg but still. Also we used to play dnd, now we play pf2e.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Dark_9554",
            "body": "Currently one as a dm with plans appearing to start a second also as dm",
            "score": 1,
            "replies": []
        },
        {
            "author": "thechet",
            "body": "7\n\n1: Every other Sunday Ravnica game : I play Ogre, the chaotic wholesome halfling. Barb(1), Lore Bard(3), hexblade(4). Trash build but fit the narrative and got him all the mechanics his flavor needs\n\n2: every other Tuesday Vecna(2024 rules) : Angelo Slashwell, the Aasimar himbo. Champion fighter(13)\n\n3: every other Friday HB campaign : Valiant Goodfellow, the naive overly positive half Deva Aasimar on his first actual \"calling\" hes gone on his own, since his mom just died of old age. Redemption Paladin(10) that things no one is above redemption, though for some the only path to redemption begins with a trip to the hells.\n\n4: Every other Saturday Storm Kings Thunder(2024 rules) : Blaze Brightborn, light cleric(5) obsessed with getting to do as many heroic and good deeds but has the WORST temperament(8 charisma). Inspired heavily by Bakugo from My Hero Academia and Schmidt from new girl.\n\n5: Monthly HB : Prince(the Prince of Dragons) dragonborn dragon monk(13). Offspring of tiamat that rejects her and is going around rebeling and doing as much good as possible entirely out of spite. Also has a SHITTY abrasive personality as he is constantly fighting against every dragon instinct to kill pillage and horde. He hoards good deeds instead of gold now.\n\n6: Monthly HB: Hugh Normelman \"Inventor at Large\", custom lineage but definitely a total normal human so dont question him. Armorer artificer(6) tank with dual wielder to taunt more enemies a turn. He gets to a death save most fights because the build didn't turn out as tanky as I hoped lol\n\n7: Weekly Phandelver: Manny Slashwell, the human fighter(1). This one just had session 0 yesterday. Haven't played a Slashwell cousin from lvl 1 in a long ass time lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clearly_Disabled",
            "body": "I run 3 tables, all homebrew. Two are with kids I mentor with a big org, lots of fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Carbon839",
            "body": "DM in 1, Player in 1. Alternating weeks. Sometimes I want to do weekly for my campaign but I think the week off helps me plot and strategize.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AwkwardianAdventurer",
            "body": "1. In person DSA campaign like once every few month on a weekend. DM changed, players left and scheduling problems, last session january, next TBD.\n2. Online DSA westmarch campaign. Well organized, a bit ambitious, I don't participate that often. I enjoy it when I do, but I prioritize the other tables.\n3. Online Homebrew DND campaign. Haunted. Players exchanged, insanely unfortunate scheduling problems. Therefore also last session january despite our new plan on sessions every other week.\n4. My happy table 💜 Pretty regular sessions since october in almost the same constellation even though there were in part work shifts to consider. Finished a multi shot / short campaign in DND, now player 1 took over with a DND fewshot, I have a follow up adventure planned and player 2 is considering running a oneshot for a new system.\n\nSo to summarize maybe 1 and a half?^^\n\nHonorary mention: unfinished DND \"could have been a oneshot, but I'll stop even pretending I can run these in a single session\" adventures I ran for tables 1 / parts of 3.\n\nSo while I love all the tables, I definitely think I could fit in another one. And I might have tried, were I not usually too shy and awkward to dare applying to completely new tables.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StolenVelvet",
            "body": "I'm currently running 7. I do this for a living so 6 of them are paid, the 7th is a family game that's been running since the pandemic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neonshadow30",
            "body": "DM for three ongoing in person games (1 weekly and 2 monthly) and a player in two others (both monthly-ish).\n\nMight start running a fourth game here soon. I’m not quite eating, sleeping, and breathing DND yet",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elisterre",
            "body": "I DM two small games but have none to play in, none of my friends DM, so my wizard will never be played 😔",
            "score": 1,
            "replies": []
        },
        {
            "author": "Local_Post_7944",
            "body": "Playing in two, 5 and 3.5e, preparing to do a 5e starting in a few weeks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rodrigo_i",
            "body": "D&D?  Zero.\n\nOther RPGs? Two.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhoenixFisher",
            "body": "Playing one, Dming another, both every other week on alternating weeks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoName_BroGame",
            "body": "2.  One as a player and one as a DM.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElodePilarre",
            "body": "I play 3 games every other week, and 2 games weekly. And honestly, I'd like to get one more weekly game in there somewhere if I could.",
            "score": 1,
            "replies": []
        },
        {
            "author": "knightw0lf55",
            "body": "I play at 3 DM 1 (non paid) and DM 3 paid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cheeky-apple",
            "body": "4 as a player\n1 im dming\nIf we include the other groups i play in thats not dnd (currently 2, one for pathfinder and one rotating system group where im running wilderfeast right now)\n\n\nSo 7 tables right give and take a extra minicampaign or two when summer rolls around.",
            "score": 1,
            "replies": []
        },
        {
            "author": "valisvacor",
            "body": "Including an email campaign, I'm either GMing or playing in 6 different campaigns, with 5 different ttrpg systems. All except the email campaign are in person.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kiohazardleather",
            "body": "Well I'm running 1 in person game that meets once a week and I currently have 6 consistent players, 4 of which are female. \n\nAlso in talks with a brick and mortar retail establishment that wants me to run a campaign for their staff after hours, also an in person game with a minimum of 8 players all female. Perhaps one of them will bring a husband and he can be the token guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MathemagicalMastery",
            "body": "4 is the most I have been in at the same time. I ran one in 3.5, I played in a firefly setting, a zombies setting, and a 3.5. I think all of them were every other week during university.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AggressiveMennonite",
            "body": "Four tables, potentially 5. I am the DM of one of them. There is a joke where we are a DND polycule -> most players are the same with a couple of exceptions, with a rotating DM. Only one table is not related and TBH, it's ironically where I stole their DND polycule joke from.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aes2806",
            "body": "Player in 3 campaigns. DM'd one but that one kinda fell apart sadly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zecranewiff",
            "body": "2 games, I’m DMing both",
            "score": 1,
            "replies": []
        },
        {
            "author": "FuzzyWuzzyCub",
            "body": "Ok, I guess I am an exception. However, I am retired without any time-taking hobbies so my days are open. To answer the OP's question: 9, all of them D&D 5e, all of them as a player\n\nTwice/month Sunday afternoon, homebrew in Exandria, Legacy rules\n\nWeekly Sunday evening, Wild beyond the Witchlight, Legacy rules\n\nWeekly Monday afternoon, Heresy of Steel (off of Steinhardt Guide to Eldritch Hunt), 2024 rules\n\nWeekly Monday evening, homebrew campaign/world, Legacy rules\n\nWeekly Tuesday evening, Out of the Abyss, 2024 rules\n\nWeekly Wednesday evening in-person, homebrew in Forgotten Realms, 2024 rules\n\nBi-Weekly Tuesday evening, homebrew campaign/world, Legacy rules\n\nMonthly Friday afternoon, homebrew one/two-shots at this point, Legacy rules\n\nWeekly Friday evening, Dungeon of the Mad Mage, 2024 rules\n\nI did have two more on Saturdays for a while, but no longer and am looking to fill that gap.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EquivalentResolve597",
            "body": "1 online as a player, 1 online as a DM, 1 in person as a DM. \nIt’s getting quite complex already to fit all of this into a rational life schedule :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Moose_Dante",
            "body": "DM 3 (one in hiatus as we switch campaigns) and play in 2.\n4 are (generally) weekly, one is biweekly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArgyleGhoul",
            "body": "I run a 5e campaign on Saturday, an open table DCC Lankhmar game on most Sundays, and we alternate Wednesday games between me running Fallout2d20, and my friend running Strahd",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrincessBloodpuke",
            "body": "1. Running my first serious campaign as a DM with 2 players. It's going pretty well despite the irregular schedule and impromptu filler I've had to make up on the spot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mistervimes65",
            "body": "Playing one and running two. One game is Savage Worlds. The other two are D&D.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Former-Programmer426",
            "body": "2 campaigns. I play weekly",
            "score": 1,
            "replies": []
        },
        {
            "author": "agentmozi",
            "body": "I play in a long-running campaign over discord, we've been going now for 3+ years. Last year I started an in-person group and I DM that. Both meet roughly every two weeks, sometimes the same week, sometimes not. \n\nI'm plotting with my bestie back in my hometown (so it'd be a VTT game of some sort) to start a third group where we might take turns DMing, but that's not really off the ground yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Colton-H",
            "body": "6 total, currently playing in 5 and DMing 1. All within the same group. Running DiA and CoS in alternating sessions, two homebrew campaigns are on pause after we players backed the DMs into corners, one campaign only exists for when the group is down a player, and my game is on hiatus for the school semester.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cmprsdchse",
            "body": "2 dnd games and one tales from the floating vagabond game. One game alternates, so it’s 3 games every two weeks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperCat76",
            "body": "Just one weekly game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valuable-Way-5464",
            "body": "F... FOUR?!???!\nPure legend",
            "score": 1,
            "replies": []
        },
        {
            "author": "G0DL1K3D3V1L",
            "body": "1 game for 2014 5E with a lot of Laser Llama Homebrew thrown in wherein I play as an Order of Shades Magus. \n\nI also run as the Gamemaster/Storyteller for a Werewolf: the Apocalypse 5th Edition game, but that’s not D&D at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot_Atmosphere6081",
            "body": "I am Dming 3 and a player in 2 and going to play on another one starting soon that is waiting on players",
            "score": 1,
            "replies": []
        },
        {
            "author": "HighNoonImDad",
            "body": "I am at one table currently, and its my own. Husband is considered starting a campaign though so possibly soon Ill be at 2 tables.\n\nMy table is playing Call of the Netherdeep",
            "score": 1,
            "replies": []
        },
        {
            "author": "dizzi800",
            "body": "I'm currently playying in 2 games \n\nOne everyy sunday, and one everyy other tuesday\n\nAt one point I was in 6? \n\nsunday, monday, every other tuesday, every other tuesday, wednesday, and Friday\n\nIt was #TooMuchMan",
            "score": 1,
            "replies": []
        },
        {
            "author": "CardboardWiz",
            "body": "Zero, sadly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tight-Atmosphere9111",
            "body": "1 active and two not active as I’m about to drop them as they keep cancellations on games the day of or last min. I don’t even remember the plot let alone my character now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BotThatReddits",
            "body": "I'm technically in 7...\n\nThe first is a supposed-to-be-weekly game that meets maybe monthly. \n\nThe second is fairly regularly weekly\n\nThe third is one I run, meeting weekly\n\nFourth is a brief Saturday game, meets every two weeks or so\n\nFifth is a game that I'm a frequent guest in, meeting every twoish weeks? \n\nSixth is a play-by-post campaign, so a paragraph every few days? \n\nSeventh is on near permanent hiatus.\n\nSometimes the stars align and I'll play all of them in a given week, but more often it's two or three per week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Psicrow",
            "body": "Zero right now.  Was in two with old college friends but our friend group (including myself) nearly all moved at the same time.  Kept one campaign going remotely but after it ended we called it, as people got busier with new families and jobs. \n\nI moved back to my hometown about two years ago,  tried online groups but never found the right fit.  The two I tried,  everyone was there to play dnd and would log off immediately after the end of the session, it was too different than playing with friends. Not sure if I really want to roll the dice on a local home or league game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "justmeallalong",
            "body": "Run one, play one. The one I play in doesn’t meet often enough 😔",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deathflash5",
            "body": "I have a weekly game that I’m currently DMing.\n\nAnother monthly game I’m a PC in. \n\nThird game I occasionally pop in to that’s a group of friends that invite me to join when they run one shots.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Morudith",
            "body": "Playing a homebrewed one that’s been going for over a year now.\n\nAbout to jump in to a new Strahd game.\n\nJust started GMing Lancer ttrpg for the first time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "historyboeuf",
            "body": "2 - one is a longer running multi year homebrew campaign that is likely coming to the end of the story. The second is a newer game that is kind of like a monster of the week style, less commitment and newer players.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RecoveringH2OAddict1",
            "body": "3. Two of which are hosted at my place, I run one, play in the other, we play weekly and switch each week. The other is monthly at one of my fellow players houses, but mostly friends and fam on his side. They're still cool though",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stubbrnboy",
            "body": "Playing one dming 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fierce-Mushroom",
            "body": "Two. DM one, play in another.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ofrro12",
            "body": "Earlier this year I was playing four tables: two weekly, one bi-weekly, one monthly. Absolute hot mess when they all happened to land on the same week lol. Two of those tables have recently finished up their years-long campaigns, but we’ll probably be back at it again soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "giantflyingspider",
            "body": "i had a dream last night i was playing dnd with ll cool j, so i think that brings the total to 3",
            "score": 1,
            "replies": []
        },
        {
            "author": "canadarugby",
            "body": "Four.\n\n1. Regular group\n2. Stoner group\n3. Rugby team\n4. Women's rugby team",
            "score": 1,
            "replies": []
        },
        {
            "author": "FalloutAndChill",
            "body": "DMing a weekly Wildemount game, player in a Rime of the Frost Maiden game that’s in-person and meets every other week",
            "score": 1,
            "replies": []
        },
        {
            "author": "Natirix",
            "body": "2 online campaigns (same DM), 1 in person one, and about to start DM'ing my first long campaign.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Well_of_Good_Fortune",
            "body": "2. Player in both, but one slot rotates DM fairly regularly and focuses on shorter campaigns",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuxuriantOak",
            "body": "I guess technically I'm only playing in one game. \nThe rest are on a break.\n\nI have a hard rule of no more than 2 games at the time, out of respect for my better half, and my brain.\n\nBut if you were to count all the games including the ones in \"the queue\": \n\nI'm currently a player in a Farsight game.\nI'm the GM for a DND game for the last 6 years.\nI'm the GM for a IWD campaign (that we usually only play in winter months).\nI'm the GM for a season of oddity high (an anime game).\n\nSo ... Four, but only 2 at the time, and I try to be a player in one of them.\n\nWith the same group I've finished about 2 or 3 campaigns (one of them isn't finished, but we're pretty sure it won't be,) and a handful of one-shots.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaviorRoic",
            "body": "Zero however I do want to have one haven’t figured out how yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FTaku8888",
            "body": "I'm running one set of games for some friends, but most of the time, i'm playing adventure league, which you can have around eight games a month",
            "score": 1,
            "replies": []
        },
        {
            "author": "BetterCallStrahd",
            "body": "I'm a player in only one DnD campaign. But I am also a player in a Lancer mini campaign, Monster of the Week mini campaign, City of Mist mini campaign and a Fabula Ultima long term campaign. I am also GMing a MotW mini campaign every other week.\n\nIt's not always this packed, just happens to be that way right now. Btw these are all online games, which is what makes it possible for me to do all this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrEngineer404",
            "body": "Currently,\n\n* Playing in 2 In-Person Monthly Campaigns\n* Playing in 2 Online Bi-Weekly Campaigns\n* DM-ing in 1 Online Bi-Weekly Campaign\n* Playing in 1 In-Person Weekly Community Guild Campaign\n* Guest DM-ing in that same Community Guild Campaign (roughly 1-2 times a month)\n\nAdditionally, I have an in-person family group that is looking to start up a campaign soon, and wish for me to run it, and a couple other friends that are always trying to talk me into hopping into some new idea they have spun up, as a player.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KingPiscesFish",
            "body": "I’m technically in one table- consisting of 5-6 people (counting DM’s) total, but we play multiple campaigns together. Each of us DM’s only for one campaign at a time, that way other DM’s get a chance to be a player. \n\nCurrently I’m in two campaigns, one that’s every Saturday and another that’s every other Sunday. The most campaigns we’ve done at once though was four campaigns- one of which I was DMing. We just rotated on the Sat&Sun’s.",
            "score": 1,
            "replies": []
        },
        {
            "author": "D-Parsec",
            "body": "One. We meet up every Wednesday at my place for some role playing - just having a great time for a few hours. Great to have something in the middle of the week to break up the 8-17 job. 🙂",
            "score": 1,
            "replies": []
        },
        {
            "author": "cursearealsword02",
            "body": "current player in 2, about to join a 3rd as a player, and gearing up to dm a fourth as well",
            "score": 1,
            "replies": []
        },
        {
            "author": "Geigerleinchen",
            "body": "My fiancé and I (DM) play one together, I would love to play another one, but we‘re quite too busy. Our group meets up once a week",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotKerisVeturia",
            "body": "I’m playing two campaigns with the same group (we switch off), and I just joined a text-based one with a different group. So, three.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redhaiku_",
            "body": "Running one once a week game. We just finished our 3-15 campaign and are starting the new one in our homebrew world (but 15 years later).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sanp2p",
            "body": "Two. One as a DM, the other as player, they are each every other week, meaning I play every week if all goes well. \n\nThe one I DM is near completion, but I should start CoS shortly after.\n\nFor me this is a very good setup.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Graylily",
            "body": "3 - play in 2 (once a month). DM one with friend with a standing game/hang night each week. love em all all an very different",
            "score": 1,
            "replies": []
        },
        {
            "author": "wolf143",
            "body": "3 over here. 2 as GM, one as a player. Honestly I should have not started the 3rd game, it's hard to find time to prep for 2 different campaigns.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiaThePotat",
            "body": "One table, 2 campaigns.\n\nI run one of the campaigns and another guy runs another, and we switch out whenever we have DM burnout",
            "score": 1,
            "replies": []
        },
        {
            "author": "eucalyptus_clue",
            "body": "Man! I am so jealous of all of you guys. I play in 2 campaigns, one is my own where I DM weekly (but online), and the other is an IRL campaign where i am a player, but we meet once in two weeks",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheChefEgg",
            "body": "2, which I am dming both",
            "score": 1,
            "replies": []
        },
        {
            "author": "PostOfficeBuddy",
            "body": "6 currently:\n-5e (pirates)  \n-3.5e (rebels overthrowing rulers)  \n-5e (detective agency)  \n-5e (completely by chance *also* a detective/case-solving based campaign - the scooby doo campaign)  \n-pathfinder 2 (undead apocalypse)   \n-a time of war (mercenaries traveling from planet to planet)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Steak-Desperate",
            "body": "In theory? 4.\n\nIn practice? I haven't played since I stopped DMing...",
            "score": 1,
            "replies": []
        },
        {
            "author": "miss_mel181",
            "body": "6",
            "score": 1,
            "replies": []
        },
        {
            "author": "TitaniumWatermelon",
            "body": "Currently running one and a player in one. Also have a friend working on one, so currently 2 but possibly 3 in a while.",
            "score": 1,
            "replies": []
        },
        {
            "author": "action_lawyer_comics",
            "body": "One, with the occasional one-shot here and there. I really don’t have time or bandwidth for more than that. I do have an idea for a bigger campaign but it might just be something to daydream about at this point.\n\nEdit: we play every other week. It’s supposed to be weekly but realistically someone either cancels or we’re burned out enough to only want to play board games so it averages to bi-weekly. And we’re playing Monster of the Week right now, if that makes a difference. Only three players and the GM (me), so it doesn’t make sense to play if someone is absent. So we play board games instead",
            "score": 1,
            "replies": []
        },
        {
            "author": "skronk61",
            "body": "As a GM I don’t like accepting players that are already playing on other tables. They make scheduling even harder and there are so many people who would love to try the game out and never get to play.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WindriderMel",
            "body": "3, one is a home game with my partner, she is the DM, in one I'm a player, and the last one I'm the DM.\\\nI used to play a 4th one but it fizzled out, and I'm starting right now a mini adventure (4 sessions) where I DM.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HankScorpioNY",
            "body": "3 atm. I'm a player in a Curse of Strahd campaign, DM for Icespire Peak and just started Dm'ing a Phandelver and Below campaign. I also periodically play in Adventurers League when my schedule allows it",
            "score": 1,
            "replies": []
        },
        {
            "author": "somenerdyguy420",
            "body": "Yall actually get to play?..",
            "score": 1,
            "replies": []
        },
        {
            "author": "DangerDane57",
            "body": "Two games. One weekly and one biweekly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shadow_Of_Silver",
            "body": "I run one game in person, and sporadically play in a westmarches server.\n\nI don't have the free time for anything extra.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anonymouslyyours2",
            "body": "Running a weekly 5e,  playing in a bi weekly online AD&D game,  playing in a bi weekly family 5e game,  a bi weekly online 5e game,  and 2 once a month pathfinder games.   The family game and the online 5e game are inconsistent because of scheduling conflicts and probably average 1.5x a month rather than 2x.",
            "score": 1,
            "replies": []
        },
        {
            "author": "elliotsilvestri",
            "body": "One. And my wife says it takes up too much time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fae-tality",
            "body": "Two.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Daliamonra",
            "body": "4 at the moment. Running all 4 of them. Thinking of adding a fifth or trying to find a fifth to play in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PurebloodChicken",
            "body": "I'm currently playing in 3 campaigns. One is in the feywild and I'm a halfling rogue and the other two are in homebrew worlds where I play a human bard and a humanoid frog woman that is a hexblade paladin (the last one is set in a world like ancient Greece and my character is inspired by don quixote so you can guess what sort of campaign that is)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Button1891",
            "body": "1 but I’ve been trying to set one up, right now I have neither the time, extra friends or money",
            "score": 1,
            "replies": []
        },
        {
            "author": "ghostdy_",
            "body": "I dm one and play in another.\nMy game meets once weekly, the other is twice weekly. So 2 campaigns but I play 3 times a week",
            "score": 1,
            "replies": []
        },
        {
            "author": "waffle299",
            "body": "One. DM for Wild Beyond the Witchlight. The player just burned Loomlurch to the ground.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Inside-Beyond-4672",
            "body": "Player in One (2E weekly) ended last week, and one (5E biweekly) ended a couple of months ago so I'm down to one (weekly Basic/Expert). I played wizards in those. Someone is talking about starting an open table near me but it isn't weekly or a good venue and may not happen. \n\nI probably need to get back to 5E, so I can play a Stars Druid. :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "monster_kid4",
            "body": "3 \nDming one with alot of Homebrew\n\nPlaying in one with other players whom are new\n\nAnd playing a small table with a few experienced",
            "score": 1,
            "replies": []
        },
        {
            "author": "MikeyeSGI",
            "body": "I play once every 2 weeks",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrbadxampl",
            "body": "zero, unfortunately...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aetherial_Blaze",
            "body": "I'm a dungeon master for two campaigns and a player in another, quite stressful group.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkStrength5245",
            "body": "5.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AstralSpireGM",
            "body": "What platform do you pay these on and which do you like the best.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InsertNameHere9",
            "body": "0. Haven't played in one in over a decade. Lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rainbowjo",
            "body": "Right now I’m running 3 games. One is a monthly, one a every other week, and one is a as often as we can. The latter is solo with just me and my husband. I’ve got two other games in the zero session phase right now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "oatbergen",
            "body": "4. 2 Eberron games. Two homebrew settings. Plus 2 World of Darkness games",
            "score": 1,
            "replies": []
        },
        {
            "author": "awf1201",
            "body": "I have one group that plays in person on Mondays weekly, and one group that is my online friends game on Tuesdays.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThiqqMuffin",
            "body": "Currently running two and playing in two. Four total currently.",
            "score": 1,
            "replies": []
        },
        {
            "author": "grrrbruno",
            "body": "I'm a player in two homebrew campaigns, one meets twice a month, the other once a month.\n\nI'm waiting for some rules books and I might start DMing one when they arrive",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rutobia",
            "body": "I am in 3 games and about to be in a 4th. Though one of the 3 barely runs (which it's a shame because it's the one with my favorite character)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheOneEyedWolf",
            "body": "Running one and playing one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ramseas119",
            "body": "One homebrew DnD5e, one homebrew Star Wars 5e (I DM that one), and one game of Lancer. \n\nI also want to start DMing a fourth one for a different group of friends, but Im struggling to convince them to set aside a night every week for it. Plus, running one homebrew campaign is already a lot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zmurds40",
            "body": "Running one, currently a player in one but it’s about to be two.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SerzaCZ",
            "body": "Two.\n\nRanger in a Shattered Obelisk  \nDruid in a custom campaign  \nMy Paladin from a House of Lament has survived, which is an achievement. That DM has an exceptional talent for balancing his boss fights super-close. We basically only lost one character because I critsmited, and our Monk also crit the boss. Otherwise it would have been nastier.",
            "score": 1,
            "replies": []
        },
        {
            "author": "B1G70NY",
            "body": "One table alternating between 2 games.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JeiFaeKlubs",
            "body": "I dm one that tries ro meet once a month, play in another one where I can only attend about once a month, and theoretically have a player spot in a third but since I had a baby it's been impossible to join. Oh and theoretically there's a fifth family dnd round I've been dm'ing about 1-2 times a year but it's also been on hold since the baby haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dark_Maniac_",
            "body": "Running two, playing in three, many one shots occur",
            "score": 1,
            "replies": []
        },
        {
            "author": "YokoAhava",
            "body": "Player in two, hosting two.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bacon_L0RD",
            "body": "I’m about to be in 3\n\nPlaying in one irl, I have friends online starting a new one next week, and I’m about to start dming a game for some other friends irl who’ve never played (and I’ve never DM’d). \n\nWish me luck!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Schapka1508",
            "body": "I play in 3 games: two homebrew games and one Tomb of Annihilation campaign, last one will end in the next few sessions. The other two are homebrew games which happen once every one to two months. I also DM a curse of Strahd game which is on hiatus as one player is sick.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Discount_4U",
            "body": "Technically 4. \n\nOne is one \"hiatus\" but I don't think it's every restarting.\n\nOne is family, but everyone is busy. One is with a friend, but they're also busy, so both of those are also very infrequent. \n\nOne is online with strangers, and that's the only one that's meeting regularly. \n\nSo 4, but in reality, only 1.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaHerv",
            "body": "DM in a D&D homebrew Campaign.\n\n\nPlayer as a Witch Hunter in a Warhammer Fantasy Campaign.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EMArogue",
            "body": "0 :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "CampadLovesSpace",
            "body": " One, I’m running a biweekly with my roommates. Send help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rainator",
            "body": "Player in two, DM in one. Although one of the ones I’m a player in we all sort of take shifts being DM. Play twice a week, once in person once online (I DM every other week online).",
            "score": 1,
            "replies": []
        },
        {
            "author": "spicyflies",
            "body": "3/4 - two campaigns are with the same group, just DMed by different people so they each get a chance to play as well. So... I guess four campaigns, three tables? It used to be 4/5 but one dropped yesterday due to unfortunate circumstances.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MadHatterine",
            "body": "I run two games. One of them is maybe once a month, the other is at least once a week. (We often spontaneously do another session.)\n\nI also play in one weekly game and will probably have another one soon. I don't think I'll get into more, because I also need time to prepare for what I run, obviously. :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheFacetiousDeist",
            "body": "Currently waiting to get into one/ one to end so I can get into one. The one I’m waiting on is apparently 2/3 down, so I’d understand if I don’t get in.\n\nI just got a teaching job. So I’m out by 3 and have weekends off. Plus the vacations. But I’ve mostly worked in retail so I’ve never had the schedule for a consistent dnd game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Partially0bscuredEgg",
            "body": "I’m running one, playing in two.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bloopereell",
            "body": "Just did session 3 with my 2nd simultaneous group. Going strong with my 2 till I have to leave both of them in May",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maleficent_Insect_19",
            "body": "1 as MJ with 1 session every 2 weeks or months....\nI would love to have one as a player, but I can't find people to :/",
            "score": 1,
            "replies": []
        },
        {
            "author": "OfficialCrossParker",
            "body": "Two: one I play in (virtual, twice a month) and one I run (in person, whenever we can all get to the table, lol). \n\nI was a late-comer to the virtual game, I popped in every once and a while when the party was lvl 10 and I joined to party permanently when my schedule opened up when the party was at 14. We're now level 17 and in the end game. It's great fun and the DM is creative with his encounters and puzzles. But virtual is virtual, if you know what I mean. \n\nThe in-person group is with three of those virtual players (the DM included) and my wife. We've had 7 sessions over the last year and change. But boy is it fun to have everyone physically at the table. The party is only level 3, but we play when we can, and everyone is having fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vacskamati52",
            "body": "HOW ARE THERE PEOPLE ON HERE IN 5 GAMES AT ONCE????\n\n\nI run one game, and even that's difficult and I find that I'm having less and less time to plan and play as time passes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "c-squared89",
            "body": "I am playing in 2.5 D&D campaigns and a Pathfinder game.\n\nI say 2.5 because one game is just \"whenever everybody can make it.\" It's been once every couple months mostly, and is more of a series of one-shots. The others are every week or every other week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pilgrimzero",
            "body": "I work 40 hours,  Have a wife a kid.\n\n  \nSo once a week on Sundays.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBloodKlotz",
            "body": "Running 3 weekly games, and only holding there because that's the maximum I have time for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Badger8472",
            "body": "Running a Phandelver campaign as a first time DM and a player in Call from the Deep 5e and another homebrew 5e. I used to be in 2 pathfinder campaigns but it got to be too much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PatientEmpath",
            "body": "I run three twice-monthly campaigns set in the same world (different timelines), play in one campaign, and plan a one-shot this month for a few newbies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheFishSauce",
            "body": "Four, all with the same group. Four of us take turns being DM. We play a different one every week (by which I mean we have a three week rotation, except for the game I DM, which is a bunch of linked not-quite-one-shot modules we play in the summer).",
            "score": 1,
            "replies": []
        },
        {
            "author": "aurumatom20",
            "body": "2, a Strahd campaign that hasn't met in months (we will get back to it though we're all close friends otherwise, just one is in law school), and a homebrew campaign I DM. That one's really just for fun, we try to meet once a week but it's more like 1-2 times a month since we committed to doing irl sessions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jegerhellig",
            "body": "I run a game as DM every Friday at work. On Tuesdays, I alternate between playing as a player on even weeks and DMing on odd weeks. Additionally, I participate in a \"whenever we can\" game about once a month.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gold-Mistake1480",
            "body": "Right now three but my DM for the third one hasn't done a session since the like second one💔",
            "score": 1,
            "replies": []
        },
        {
            "author": "WolfJobInMySpantzz",
            "body": "0 :(\n\nBut I'm setting up to run one eventually.\n\nBeen listening to a Pokemon dnd podcast. I might look into a game of that as well, sounds pretty fun!",
            "score": 1,
            "replies": []
        },
        {
            "author": "jasonrahl",
            "body": "I wish I could get one that fits my schedule",
            "score": 1,
            "replies": []
        },
        {
            "author": "V4RG0N",
            "body": "Im Dm for a game once a week im 11 weeks in to the campaign basicly just started Dming. Im not a player in any game yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TimePressure9251",
            "body": "player in two campaigns, but they’re both biweekly (as in, once every two weeks) so i’m looking for another to join that’ll meet weekly and that i might end up dm-ing 😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jediguy",
            "body": "Two games that play weekly. Player in one and DMing for the first time running LMoP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Displacer613",
            "body": "Four. One is my personal home game that I run for my friends once a week, the second is a professional game that I run once a week, the third is a backup professional game that I run in case scheduling issues arise, and the fourth is a campaign that I finally get to be a player in every other week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "inkyandthepen",
            "body": "None, I moved away from where the campaign was being played years ago and didn't find a local Dnd group looking for new members since",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrogTheGodless",
            "body": "I was recently scoring 8 campaigns at 5 different tables (half of which I was DMing), but these days I'm sadly down to only 5 campaigns.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CurveWorldly4542",
            "body": "Sadly, right now, only 1. I had to drop a bunch due to health concerns and other personal circumstances.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tarudizer",
            "body": "Barely a half, seeing as its every other week and often gets cancelled. TECHICALLY in another one but we had one sessions a couple months ago and then nada. So... three quarters of a campaign?\n\nHopefully that might get boosted to two and three quarters soon, we'll see",
            "score": 1,
            "replies": []
        },
        {
            "author": "king_of_the_ranch",
            "body": "I run one and play in another. The one I play in is weekly. The one I DM is every other week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Master-Zebra1005",
            "body": "4 tables, 1 I DM. Sometimes it's not DnD but it's the same group of people",
            "score": 1,
            "replies": []
        },
        {
            "author": "maddycakes_stl",
            "body": "3 and about to start a 4th. \n\n1 meets weekly, entirely online on Tuesday evenings. \n1 meets biweekly, in person on Saturdays. (Formerly also weekly, the next two were made to fill those gaps.)\n1 meets 1 time per month, in person, on a Saturday the other game isn't playing.\n1 will be meeting 1 time per month, with me as a DM. I'm a player in the other games. And we'll be playing 1 Sunday each month, on a weekend the bi-weekly game isn't playing. \n\nI can't do whole-weekend D&D. I would love to but I have to do things like laundry and seeing my family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Game_Slinger77",
            "body": "The average player is usually in 1 table because they just play with their friends from outside the dnd world. There’s a decent population that does 2 or 1+ oneshots but the vast majority of players only participate in 1",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blyzto",
            "body": "Currently DMing 2 bi-weekly campaigns. I would love to play more thought😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "DiegoTheGoat",
            "body": "Playing in one 9th level D&D campaign, one first level Weird Frontiers campaign, and running two DCC campaigns and one Blades in the Dark",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rodal888",
            "body": "2 games, both dm. I love both tables. One is more chaotic the other table RP’s a lot. Both are fun and I do enjoy dming. I actually love it tbh, but it does get exhausting sometimes. The amount of prep I do, the constant doubting if what I’m doing is a actually good, the plotpoints, plotholes I need to fix, finding maps, making encounters, making dungeon crawls. It’s so fun and the reason I love being a dm. Doing all that for two games sometimes is a bit much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soul_King_10",
            "body": "Playing one game of Descent into Avernus and one Daggerheart game but if players are absent we play Strixhaven. I also DM a game of LMoP for my girlfriend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PapiTheHoodNinja",
            "body": "2 I dm one and play in another. We switch out running games once one finishes. We play almost every sat swapping who runs their game",
            "score": 1,
            "replies": []
        },
        {
            "author": "crockpotmacncheese",
            "body": "One, and I’m the DM. Would like to be a player eventually, but I’m not sure about finding a table that I would fit in with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious-Car-6020",
            "body": "I do one weekly\nAnother one fortnightly \nAnd DM a small group online one irregularly \nAlso try to do random one shots fortnightly as well 😆\n\nFeel like more than 3 long games would be too much for me to juggle time wise",
            "score": 1,
            "replies": []
        },
        {
            "author": "emeraldraf",
            "body": "Running an in person\n\nRunning an over the phone\n\nPlaying in a discord campaign\n\nRunning two discord campaigns\n\nPlaying an in person campaign of Delta Green.\n\nProbably in a month I'll be running another either bi monthly or monthly campaign in person",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeyItsArtsy",
            "body": "Sunday: fallout campaign, almost a year old\n\nMonday: second fallout campaign starting soon\n\nTuesday: DMing a pathfinder2e campaign, 6 months old\n\nThursday: one piece campaign, almost 4 years old\n\nFriday: regular dnd campaign, 6 months old\n\nSaturday: mini-campaign where everyone is going to die, a month and a half old\n\nEvery single campaign is currently biweekly.\n\nMinor edit: all of these are online since playing in person is very difficult for me for various reasons",
            "score": 1,
            "replies": []
        },
        {
            "author": "YourAromanticAlly",
            "body": "Technically running 3 and playing in 3.",
            "score": 1,
            "replies": []
        },
        {
            "author": "morbidzanna",
            "body": "I DM two separate cyberpunk games and I’m a player in two DnD games, all but one running weekly",
            "score": 1,
            "replies": []
        },
        {
            "author": "literal_cyanide",
            "body": "4 campaigns in total, two of which are DnD, one is Lancer, the other is Vampire the Masquerade. It gets stressful with scheduling but it’s worth it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "crackyy069",
            "body": "1",
            "score": 1,
            "replies": []
        },
        {
            "author": "adriecp",
            "body": "3\n\nCo dm in a dnd campaign, I didn't enjoy it as a player, so I'm helping the dm\n\nI will start (tonight) curse of strahd\n\nI'm a player in a vampire the requiem campaign (chronicles of darkness)",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirLienad",
            "body": "3 ish. I run a pf2 game, play in a 5e game, and play in a Tales of the Valiant game, all once a week. The ish is I'm a member of two West Marches discord servers, and I try to play pickup games between them about once a week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConfusedLadyKira",
            "body": "I’m in two weekly and one biweekly game, I also run a biweekly game…  \n\nAlso there’s a second biweekly game on hiatus.\n\nSo 4 total tables of activate play, only one of which is D&D.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JLKinney93",
            "body": "I’m in one that meets every week on Saturday and one that meets once or twice a month on Sunday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDarkHarvester",
            "body": "I didn’t realize people were in so many groups. I haven’t been able to play in years due to my work schedule constantly changing. Can’t wait to get back into a group!",
            "score": 1,
            "replies": []
        },
        {
            "author": "nekmatu",
            "body": "4 and with that I average 1-2 a week that actually play.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mage-of-the-Small",
            "body": "I'm in 3, would be 4 if I didn't join a community chorus. Only one is actually dnd though: the second is Vampire the Masquerade and the third is alpha testing a game my friend is creating. The hypothetical fourth would be Blades in the Dark.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TomPalmer1979",
            "body": "Two, but really one and a half.  I have one main campaign with my friends every other week, and then I'm running a game for my girlfriend and her kids (10, 12, and 14 yrs old).  The friends' campaign is a legit serious campaign that's planned out for a full run.  I have lore planned out, I have loose story blocks for at least a year's worth of gaming if not more.  We're fairly early on; been playing maybe three months, they started at Lv3 and just hit Lv5, and the plot really just closed on the first \"chapter\", since we have to take a month off due to someone having surgery.  But I'm really excited about it.\n\nThe kids' campaign I honestly just make up as I go, throwing random monsters at them, simplistic dungeons, an overkill of magical items.  But with their attention span, we might play a few weekends in a row, we might skip weekends for a month, and we usually only play for like 2 hours at a time.  The 12 yr old is the one who's REALLY excited about playing, but mostly because he watches D&D videos and memes and just wants to cast Fireball at everything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheAlphaMedic",
            "body": "Player in 1. About to start my third DM one",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeniorCitizenLeaving",
            "body": "DM in 3 campaigns, player in 3 campaigns. Most of these are every 2 weeks, so on average I have 2.5 games every week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Headstone67",
            "body": "DMing two separate D&D 5e campaigns bi-weekly and just started refereeing a Hyperborea 3e campaign that runs every three weeks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LegitimateProject334",
            "body": "i play, 3 tables with the same group, one every wednesday and the others taking turns on thursday, we also do a lot of oneshots so everyone DMs at some point",
            "score": 1,
            "replies": []
        },
        {
            "author": "TurbulentButton948",
            "body": "One right now - my very first actually! But I just created a character for my second. This one is gonna be pathfinder rather than 5e and with a lotta people I don’t know so a lil nervous but it sounds fun! Also will be my first time playing a character w spell slots (went safe with a standard rogue for my first so the game would be easier to pick up)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Laithoron",
            "body": "Running two 2x per month 5E games (one is on pause until summer), then playing in both a weekly Pathfinder 2E game, and a weekly 5E game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "capt_amy",
            "body": "Not in any games ATM (anyone in Dallas area wanna meet up, message me. Got a bf who also wants to play) but I'm currently creating a Pathfinder campaign",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-Butterscotch4254",
            "body": "I'm currently in 3 campaigns 2 weekly and 1 bi weekly and I mainly join to play these random characters I built🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patty_Rick747",
            "body": "3!\n\n2 are long form campaigns that meet on alternating Wednesdays, (6 people and 5 people). The other is just my wife and I, and she is learning how to DM in it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dellis3",
            "body": "2",
            "score": 1,
            "replies": []
        },
        {
            "author": "Konaro_",
            "body": "I'm in 2 campaigns\nOnce every Wednesday\nAnd the other Friday and Sunday",
            "score": 1,
            "replies": []
        },
        {
            "author": "SwordnBoard291",
            "body": "I'm running two. I'd kill to actually play in one. I've been a forever DM for years at this point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SwordnBoard291",
            "body": "I'm running two. I'd kill to actually play in one. I've been a forever DM for years at this point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AddictedtoLife181",
            "body": "I play in 5, one of them I DM, but they’re very inconsistent and there’s not set schedule except one where we play once every two weeks. The one I play most often is whenever we can get together asap. Sometimes it’s once a week or once a month. The other 3 only happen a handful of times a year. And the consistent scheduled one has been paused since November, but we kick back up again this Saturday. So yea, I technically play in 5, but really it’s more like 2. I’d like to try playing in a 2024 5e game soon though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AddictedtoLife181",
            "body": "I play in 5, one of them I DM, but they’re very inconsistent and there’s not set schedule except one where we play once every two weeks. The one I play most often is whenever we can get together asap. Sometimes it’s once a week or once a month. The other 3 only happen a handful of times a year. And the consistent scheduled one has been paused since November, but we kick back up again this Saturday. So yea, I technically play in 5, but really it’s more like 2. I’d like to try playing in a 2024 5e game soon though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SwArKn",
            "body": "DMing: 8 campaigns\n\n-4 in person 1x monthly\n\n-1 in person weekly\n\n-1 via zoom 1x monthly\n\n-2 PBP via Discord\n\n\n\nPlaying: 3 campaigns\n\n-1 in person 1x monthly\n\n-2 PBP via Discord\n\n\nBased on everyone's schedules, I still have weeks my only D&D is PBP. And then I will have a weekend with 4 sessions across 3 days 😄\n\n[Edit mobile formatting]",
            "score": 1,
            "replies": []
        },
        {
            "author": "wannabyte",
            "body": "We have two campaigns going - each one is once a week in person.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deimos676",
            "body": "Not enough lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "afdtx",
            "body": "Ím player in 2 campaigns. Our DM plays 1 and run 2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TwistedDragon33",
            "body": "I DM one campaign on sundays online. The group has a few people who have been in it for 9+ years as well as a few newer people who joined in the last year as people left after the last few campaigns.\n\nI am in the process of planning an in-person game at my house i will also DM. But i am hoping to set up alternating campaigns where i play at least every other or every 3rd campaign.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vivid_Plantain_6050",
            "body": "Four.\n\n1. Every Wednesday (online using Discord + Foundry)\n2. Every other Thursday (online, Discord + Foundry)\n3. Every* Sunday afternoon (in person) (this one is inconsistent with scheduling)\n4. Every Sunday evening (online, Discord + Foundry)\n\nEvery week I have at least two games guaranteed barring extenuating circumstances; some week I have 4",
            "score": 1,
            "replies": []
        },
        {
            "author": "StormtrooperRock",
            "body": "Only one, which I am the DM, i don't have time or focus to DM or play more than one campaign, it's unfortunate. And we only play once each 15 days.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RageKage2250",
            "body": "4 total\n\n2 are online with mostly overlap of players between the two groups, but different DMs. One is homebrew, the other an official module\n\n1 in person doing an official module \n\n1 in person with former colleagues, mostly doing 1 or 2 shots, but hoping to transition to a campaign someday\n\n4 is a lot, but most groups launch a game every 4 - 6 weeks based on group availability, and sessions are 3 hours on average.... so I probably play a similar amount to someone in a  single campaign that plays weekly",
            "score": 1,
            "replies": []
        },
        {
            "author": "TimurShlagur",
            "body": "Currently DMing two campaigns, one with friends and girlfriend that goes on each week. The other one is/was with my coworkers, once each two weeks, but sceduling issues occured... So I did a Star Wars themed short game with the two most free players",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bert-Barbaar",
            "body": "2 of which one is done in two sessions",
            "score": 1,
            "replies": []
        },
        {
            "author": "MadmanPoet",
            "body": "I am the Forever DM at one, I play in another, and I am going to DM a one shot for some brand spanking new players as soon as I finish writing it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low_Alternative_6056",
            "body": "2 as a player, 1 as DM / week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HighlandCoyote",
            "body": "I play in 1 d&d game and run 1 cyberpunk game, we alternate weeks so we all get a chance to play. It's good fun",
            "score": 1,
            "replies": []
        },
        {
            "author": "Citomnia",
            "body": "Currently only in 1 campaign as a player, but about to start a new group for some new players as DM. \n\nMy PC campaign meets weekly, but I think the one I'll be DMing will probably only be a once-a-month meet up for the time being.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpookyBjorn",
            "body": "I play in 3 and DM 1 currently lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "RevSlippery",
            "body": "Group of 9 friends, we play twice a week and have 6 campaigns currently on going and I think 3 that we completed over the last 4 years. Some nights we have all 9 and some nights we go down to 4 if DM is able to scale back for the night. We rotate through DMs so they have time to prep before each session and get to play often as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yournameisbrady",
            "body": "I’m playing in 3 different games right now. All meet weekly but 2 sometimes run into issues that have us delay for a week or more",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bulky-Salamander-120",
            "body": "3-4 times a week? I DM for two of those sessions, I play in a curse of strahd campaign and we just started a campaign of Champions",
            "score": 1,
            "replies": []
        },
        {
            "author": "KosutoGaming",
            "body": "2 games. One that I DM, another that my friend DM’s so pretty normal",
            "score": 1,
            "replies": []
        },
        {
            "author": "EtherKitty",
            "body": "I currently hold a spot at 0 tables, physical and digital. TwT",
            "score": 1,
            "replies": []
        },
        {
            "author": "SageOfTheSixOofs",
            "body": "Two as of right now. Just finished being the DM for the first time in Stormwreck Isle, now letting my younger brother take a stab at being a DM. But I’ve been a player in my other campaign for going on two years",
            "score": 1,
            "replies": []
        },
        {
            "author": "whysotired24",
            "body": "Currently 3",
            "score": 1,
            "replies": []
        },
        {
            "author": "NaugrimStyle",
            "body": "One table, 6 friends, 4 campaigns (4 people run stuff). However, 1 of those only occasionally does his campaign and another is finally doing Dungeons of Drakkenheim after waiting for it to be on Roll20 - he hadn't run anything since covid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darthmullet",
            "body": "2. Don't see myself having time for more tbh. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Burly369",
            "body": "Playing 1 weekly, DMing 2 (alternating weeks). So I'm locked in twice a week. Though my wife did just say she wants to try the game out...darn. might have to spend some quality time with her and add a third night.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xarchiangku",
            "body": "I GM a monthly Deadlands game, a monthly Savage Worlds one-shot game and play in a weekly Savage Rifts game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RelativeRent2946",
            "body": "Zero, I live in a small town in Northern Canada and those i know who do play have their groups and that's it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Claydough91",
            "body": "None. I can’t hardly find a game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VenusdellArcano",
            "body": "DM 1, play in 2. Looking to add 2 more to replace 2 campaigns that ended 2 months ago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thedragonsdice",
            "body": "I currently DM two campaigns and play in 1 long term one and one short one that is gonna be 10 sessions max. So I personally find it a good amount at the moment",
            "score": 1,
            "replies": []
        },
        {
            "author": "otterlytrans",
            "body": "0. i was in one a year ago but i would like to play in one once i’m settled into my new place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TorkoalSoup",
            "body": "Honestly, too many. I play Icon once a week, run a Friday game that oscillates between 5E 14/24, play in a PF2E game once a week and a 5E 14 game a couple times a month (kind of). And I might start running a Blades group once or twice a month.",
            "score": 1,
            "replies": []
        },
        {
            "author": "righnach",
            "body": "I DM in two that meet every two weeks, but they both ended up on the same weekend so I do Friday night and Sunday afternoon every other week. It's a lot to handle 🙃",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrSnidely",
            "body": "Running one non-DND, and was playing in a DND that met sporadically but appears to have died for good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Illustrious_Start480",
            "body": "I'm a player at a table, and I'm trying to get a group together to DM.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SawdustAndDiapers",
            "body": "DM for **2** campaigns, each meeting twice a month, usually offset, so I play once a week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nightowl_ryuku",
            "body": "3 As a Player and one as a DM.\nSet dates for 2 campaigns and the others are pretty much \"whenever we all have time\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "alienXtown",
            "body": "Running two weekly 5e campaigns, one much longer (2+ years at almost 100 sessions), one that’s approaching and should end by session 20.\n\nI am a player in a weekly curse of strahd game, and in a weekly pathfinder 1e game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Googlingfish",
            "body": "As someone who enjoys DMing more then playing, I run 2 games currently, and have a character in one campaign that a player of mine is DMing. On top of that am I planning on running Tomb of Annihilation very soon for a new group.\n\nSo I'm guessing I'm kind of above average in that regard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mysaldate",
            "body": "DMing 3, playing at 2. Used to do more but health crashed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Half-timeHero",
            "body": "None :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "oodja",
            "body": "I am running:\n\n* A 2nd edition D&D campaign which started in 1989 (!), runs monthly\n* A Call of Cthulhu Modern campaign which started in 2020, runs monthly\n* A 5E D&D campaign which started in 2023, runs every 1-2 months\n* Two teen library D&D programs (5E)- one started in 2022, one started in 2023, both run every 1-2 months\n\nI am also playing in a 2nd edition D&D campaign, which is weirdly enough set 3000 years in the past of my own 2nd edition campaign. That game meets every other week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rhyza99",
            "body": "I play in one game weekly. I run one every 2-ish months with some long- time friends, and one every 4-ish months with my family... It's hard to nail down time with my adult kids anymore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Federal-Cut-3449",
            "body": "3 actively. Thursday, and two on Saturday. But I’m in another campaign, the dm just never mentioned it again after session one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ooaloly",
            "body": "I’m curious how ya’ll find that many games. It’s hard enough to get one game going consistently",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ubiquitous_Mr_H",
            "body": "My wife and I are playing in two weekly campaigns currently. I also have another one I run for her, but it’s been on hiatus for some time, it doesn’t count. But it’s there…\n\nIn any case, I can’t imagine being in more than that on a weekly basis. Monthly? Maybe. But not weekly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Captain_Stable",
            "body": "I am DM on 4 campaigns. Different players, different characters, different groups, but all playing within the same world in the same time frame, so what one group does affects the other groups. All 4 groups are in person (1 is hosted at my house, 2 are in the backroom of a local pub, and the 4th is at a new place in town called The Activity Warehouse. 2 of the groups run a session every 3 weeks (Mondays for the home group, Fridays for the AW). The 2 pub groups are always held on a Sunday afternoon, usually once a month depending on room availability. \n\nI'm also a player at 2 other tables, one of which is online, the other is in person, but both of those have very loose schedules.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CuppaJoe11",
            "body": "The DM in only 1 campaign.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeroApollo",
            "body": "No dnd, but...\n\nI gm 1 pathfinder 1e game every other week.\nI gm a paid pathfinder 1e game weekly.\nI play in 1 pathfinder 1e game a week, so 2.5, lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExecutiveElf",
            "body": "Seven\n\nI am currently in seven campaigns\n\nOn Mondays I am in a Zendikar campaign where I play Livia Vulflamme the Aasimar Phoenix Sorcerer.\n\nOn Wednesdays I am in two campaigns that alternate each week. In one of them it's a continuation after finishing Curse of Strahd leading into Planescape stuff. In that I play Dorte Skek, the Kobold Strength Domain Cleric.\n\nMy other Wednesday capaign is in Pathfinder 1e where I play Moth Schnee, the Ratfolk Investigator.\n\nOn Thursdays I'm in a horror themed campaign that serves as some prequel content to my Saturday campaign. Here I play as Gloria Mapleshade, the Human Arcane Trickster.\n\nOn Saturday I play in a (initially) low fantasy campaign where we are trying to restore magic to the world. Here I play as Leanne Squall, a Dvati Celestial Warlock.\n\nOn Sunday I have two alternating campaigns. One of them takes place in an interfimentional Labyrinth that sprawls through the cracks between the plains. In this I play Myrhh Curae, the Human Tactician Kannagi (homebrew class, basically Abjuration Wizard but divine).\n\nThe other Sunday campaign is set in the far past in a setting the DM ran us in previously, with us taking on the roll of the \"100 Heroes of Old\" spoken of in the lore of that prior campaign. Westmarch style so that we can cycle characters freely. In this campaign I am Atlia Kinderdwell, an Antfolk Elderich Knight.\n\nAll this has me playing 5 days a week and honestly I'm starting to think it's too much. Might drop from the Monday one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mobilnik32",
            "body": "Dm 3 campaigns",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mrmoosestuff",
            "body": "Dming one & actively playing another.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PangolinElegant898",
            "body": "0 unfortunately",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Unluckiest-One",
            "body": "One, plus like 2 other ttrpgs at my table, my DM decided to dip dnd for CoC which we don't have a problem with :/",
            "score": 1,
            "replies": []
        },
        {
            "author": "Count_Kingpen",
            "body": "  I GM one game, play in another, and am a member of a living world server that’s technically constantly active. I’m also currently on the planning stages for gaming another game, though this one would be biweekly instead of weekly like the other two regular games.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheeStJimmy",
            "body": "I’m currently playing at 3 tables. One is a homebrew campaign with me as the DM that meets every other Friday morning. One is Eve Of Ruin where I am a player, meeting every other Thursday night. The third is Rime of the Frostmaiden, which has been a lot more sporadic of meeting due to scheduling conflicts",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThaVolt",
            "body": "1, but it might as well be 0. (Fucking 40s right?)",
            "score": 1,
            "replies": []
        },
        {
            "author": "testthetemp",
            "body": "Zero, the last one collapsed after the majority didn't want to go on if one of our friends stayed, he had a drinking  problem that disrupted the game often. I paused the game to discuss it with the problem player and sort out things to go forward, the rest of the group got into playing Baldur's Gate 3 in the meantime, and just lost interest in coming back. Feels bad man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrenchFigaro",
            "body": "I play in one, and DM another.",
            "score": 1,
            "replies": []
        },
        {
            "author": "simeonthesimian",
            "body": "I'm currently in 3 games:\n\n* 5e group I play in at my LGS. We finished Phandelver and Below, then the DM has a new homebrew adventure that we took our same characters into. We're now level 11; 2 levels into the new arc.\n* I'm the principal/director of an afterschool program. 5.5 group I DM for the kids at work. Standard haunted house stuff\n* PF1E game I play online with some friends I've known and played with for 20 years since high school, and we're spread across the country now. We just started Strange Aeons AP\n\nI might be joining/running another 5.5 game, soon. And my 5e DM just asked me if I'd be down to join his 3.5 throwback game, which was so funny to hear the offer on. I'm strongly considering it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sniply5",
            "body": "2, a monthly family game and a weekly in town game",
            "score": 1,
            "replies": []
        },
        {
            "author": "King-of-Gerudos",
            "body": "None. Never even played a campaign. I love watching dnd streams/podcats and making characters and would love to play, but my work schedule makes it difficult to commit to anything. That and  it's hard to jump into something you have no experience with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "M3TALxSLUG",
            "body": "Play weekly in 2 campaigns. One as a player and the other as a dm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSmileyFace_",
            "body": "DM in a online weekly session, player in a online weekly session, and soon to be be player in a in person (weekly?) session. Might have a spot in a pathfinder game as well. Oh, also have a podcast game that's taking a break at the moment :P\n\nDefinitely finding myself to be an active partaker in the hobby.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Content_Knowledge_81",
            "body": "I DM Tues, Wed and Sat. I play Sun, Mon, Thurs and Fri. So I am in seven games.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlackOrderInitiate",
            "body": "3 games a week and any more than that is a problem, I DM 1.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VitaIncerta666",
            "body": "1, but I'd like to do more. My job and home life make scheduling hard.",
            "score": 1,
            "replies": []
        }
    ]
}