{
    "title": "First Time DM, I Landed a Scene I'm Proud Of.",
    "author": "Cute_Spide",
    "subreddit": "DnD",
    "rank": 13,
    "score": 35,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/DnD/comments/1jeadqo/first_time_dm_i_landed_a_scene_im_proud_of/",
    "id": "1jeadqo",
    "selftext": "I just feel really good about this one and I wanted to share. I'm new to DnD as a whole and I'm with a group of people who are also pretty newish. Somehow, I've ended up being the DM, which is fine because I love telling stories. But in our most recent session, I was really excited for a scene I had planned and I wanted to share with others. \n\nSo, my players found a poacher camp and protected some owlbears. An NPC showed up and helped them mid-fight, and they were immediately suspicious of him. One character does know him because he robbed her and she's a super kind yet naive tiefling who thinks he isn't a threat while the others are like, umm, excuse me? He **robbed** you? One character in particular is very protective of the tiefling, and was SO on edge by this NPC's appearance. \n\nThe owlbears let them all take ONE thing from their collection of shiny things (I reason the bird part of them draws them into shiny things) in an abandoned temple they live in. But the NPC had been dodgy about why he was there the entire time. Said he was looking for something but didn't go for any of the loot. Said it might be dangerous but maybe not. Ever increasing the unease that this character was up to no good. \n\nSo in the shiny object collection, there was a large box that was super hard to open. It took all their strength to open and then the below was read to them when it finally opened: \n\n*Inside is a body, humanoid in shape and size, but that's about where the recognizable features end. What was once skin is pulled tightly across its body, its hue a sickly gray-green. Bones poke up in areas you might expect from somebody with extreme emaciation, and in other parts, they actually do poke through the skin, twisting in sickening angles. The face appears frozen in agony, and on the walls of the chest are deep claw marks.* \n\n*You notice that on the body's chest is some sort of scar. It looks much like a burn scar, smooth and shiny, but the shine of this scar is distinctly silver as if some thin layer of metal was left behind in its making. This is a branded burn and you can clearly see that it's made to look like an eye surrounded by flames. Inside its pupil is a Netherese (Roman) numeral 2.*\n\n*Further, as your eyes rest on the brand, something else catching the light grabs your attention. You know not how you missed it before, but the body's eyes are still intact and it is looking up at you. No, they're specifically locked onto \\[my NPC\\].* \n\nHe then whispers a name and gets clearly emotional and the WHOLE perception of this character flipped exactly as I had hoped it would. He's important to my story, and I was worried they would just hate him after the first session he appeared in. But having my players come to a new realization and having this scene land *exactly* as I had hoped just felt so good. I'm SO glad I'm the DM now and it's just really gotten me excited to write and play more. \n\nTLDR; I'm proud of the homebrew campaign I'm making and this scene in particular elicited the exact reactions I was hoping for. I wanted to share this because I now feel the draw of being a DM. ",
    "comments": [
        {
            "author": "PeachasaurusWrex",
            "body": "Man, that sounds COOL!\n\n\nNGL tho, if I were a PC, this might make me MORE suspicious of him (wtf is this guy doing with a CLEARLY CURSED MUMMY THING?!?@??! HELLO??!??!?).\n\n\nAs a player, however, I'm INTRIGUED. Sir? Excuse moi? WHO ARE YOU AND WHAT IS YOUR DAMAGE?\n\n\nI am the \"detective/lore goblin\" type of player tho. I love poking around, asking questions, and figuring shit out.\n\n\nGlad your dastardly DM plans are going smoothly though! ",
            "score": 8,
            "replies": [
                {
                    "author": "Cute_Spide",
                    "body": "Thank you!\n\nOh, I was totally ready for it to go in that direction! I had a whole branching scenario ready for if they decided enough was enough of this guy, lol. But they gave him space and time? Like he's an actual person? I'm so proud of them lol. I have no doubt they are curious and want to ask all of the things and squeeze him like the lore sponge he is, but they were very... real about it? It was actually adorable and I was grinning so much it was hard to play the stoic character that he is :p",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "splashmayo",
            "body": "Sounds like good times.",
            "score": 7,
            "replies": [
                {
                    "author": "Cute_Spide",
                    "body": "It so is and I'm so excited to do more of it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "splashmayo",
            "body": "Sounds like good times.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HeartBreaker_TV",
            "body": "FeelsGoodMan. Keep it up!",
            "score": 1,
            "replies": []
        }
    ]
}