{
    "title": "I don’t want to relocate to India with my husband",
    "author": "Missdoctorphil",
    "subreddit": "relationships",
    "rank": 13,
    "score": 1625,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 133,
    "url": "https://www.reddit.com/r/relationships/comments/1jd8tal/i_dont_want_to_relocate_to_india_with_my_husband/",
    "id": "1jd8tal",
    "selftext": "Tldr: I, European 26, f doesn’t want ro relocate to India with my husband Punjabi 29, m due to cultural differences and lifestyle changes being too much for me to handle. \n\nMy husband is a Punjabi and I am a European NZ. We have been married for three years and he has been living in New Zealand for 10 years. I have been to India many times for three months at a time each go. \n\nMy husband has decided he wants to relocate us to India permanently, I really don’t want to. I would never force him to distance himself from his roots but I honestly don’t think I could cope with India for atleast 6 - 8 months a year, he said we could visit NZ yearly apparently. I made a compromise with him that I visit India for three months  a year and he can stay 6-8 months a year. He says life in India would be better for us because we would have more money and he has more connections in business there etc. My husband didn’t agree to this and said where ever and whatever the husband says the wife should follow. He said he Weill buy me a car in India and I can get a job teaching English to pre schoolers. I can only speak the basics on Punjabi and no one in Punjab but his parents and a few of his relatives who don’t speak English anyway. \n\nI am really conflicted and cry about this often because I feel like I’m going to be giving up my freedom and individuality. \n\nThe times I have stayed in India have been hard at some points as my husbands house is rural and I can’t leave or go anywhere without him. I don’t get to wear what I like and to be honest if I say I don’t want to eat or drink something that is culturally Punjabi I found his family judged me so much. His parents also told me to stop watching English tv shows in the house. I followed their instructions and turned it off but felt super sad after wards. \n\nI think that maybe I am being selfish for not wanting to live in India but I don’t want to be trapped with no where to go. I think I will go mad. Any insight on my situation would be appreciated. Sorry my paragraphs and words are all over the place, my thoughts in my head and just a mess at the moment. ",
    "comments": [
        {
            "author": "Blu3Stocking",
            "body": "I’m Indian and if my husband forced me to move back to India I’d leave. And if I couldn’t even speak the language? No way in hell am I going there. No support system, a dominating husband, inlaws who judge you and don’t let you watch TV? This is terrible even by Indian standards. Don’t go. No man is worth the mental and who even knows, physical torture. If you leave him you’ll be sad for a while then move on. If you go with him that whole thing is going to include a lot of extra years of suffering. \n\nPlease don’t go. I’m very worried for your safety and mental health if you follow this man to a place where you have no support whatsoever.",
            "score": 2144,
            "replies": []
        },
        {
            "author": "Big_Miss_Steak_",
            "body": "I’m British Punjabi- do not go. \n\nIt’s easy to say- but if it means that it’s the end of your marriage then so be it. Even if you end up staying in NZ, I’d reevaluate your relationship. \n\nI’d also be leery of even going to visit now that you know his intentions. Sorry I don’t want to seem dramatic but I really would not put it past them to try and keep you there once you visit. The filial duty is strong and he will listen to his parents before you. \n\nWishing you the strength to make the decisions you need.",
            "score": 2149,
            "replies": [
                {
                    "author": "baxbaum",
                    "body": "If it were me I would not even visit India at this point. \n\nI’ve read too many stories of women being trapped etc\nIt would be so easy to take her passport and prevent her from going to the NZ embassy etc",
                    "score": 802,
                    "replies": []
                },
                {
                    "author": "coolbeenz68",
                    "body": "good point about visiting there. he could trick you and trap you.\n\nthis is red flags screaming at op! he wants to have complete control and say.\n\nand another point someone made, youd end up being the servant. the cook, cleaner, and pushed to have babies.\n\nlet him go because your life depends on you staying where you are. im scared for you if you go!",
                    "score": 416,
                    "replies": [
                        {
                            "author": "humdrummer94",
                            "body": "It’s a zero sum game and you can never win by being reasonable",
                            "score": 78,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gdubh",
            "body": "“Whatever the husband says, the wife should do.” He’s telling you who he is. Just wait until you are isolated and surrounded by this belief/culture.",
            "score": 4575,
            "replies": [
                {
                    "author": "Katerade88",
                    "body": "He wants to move her somewhere where he can enforce this kind of cultural norm. In India she will have very little recourse to oppose him",
                    "score": 1516,
                    "replies": []
                },
                {
                    "author": "whoooodatt",
                    "body": "I married an Indian man who turned out to think this way. We divorced after two years when his parents turned a \"visit\" into living with us without my consent, and I was expected to just go along because it's what he and they wanted. I'm so glad that I wasn't in India. It would have been impossible to leave. It was already hard enough in America.",
                    "score": 1226,
                    "replies": [
                        {
                            "author": "aoife-saol",
                            "body": "Yeah there is a reason I tell everyone to be wary of Indian men that were born there or are first gen born somewhere else. I've worked with a ton of them who will seem totally nice and normal and then 3 years into knowing them they'll drop literally the most insanely sexist opinion you've heard this century (usually when butting heads). Not to mention I notice the most changes in their behavior going from blonde to brunette and back - there is some truly wild fetishizing that goes on. I had someone I thought was a friend say my hair was \"too dark now\" and completely revealed he thought he was angling to date me at some point and was mad I \"ruined\" my hair. Of course he was over ten years older than me and also insanely ugly with terrible hair himself, no wonder he was trying to go the \"trick women into thinking he's safe\" route.\n\nOn the flip side Indian women who have tried to distance themselves from that have been my smartest and most badass coworkers and friends. But it's just not worth it to me to even risk friendship with Indian men anymore. Especially when I make the mistake of being blonde in public and wanting to be open minded and friendly 🙄",
                            "score": 527,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mermaidsgrave86",
                    "body": "Exactly, he won’t let her work or buy her a car once she’s there.",
                    "score": 200,
                    "replies": []
                }
            ]
        },
        {
            "author": "mangoserpent",
            "body": "This marriage is not going to work. Sorry.\n\nDo not go to Punjab you will be alone and isolated.",
            "score": 2528,
            "replies": [
                {
                    "author": "Glitter_berries",
                    "body": "I think she is already alone and isolated. I hate her husband ugh",
                    "score": 580,
                    "replies": []
                }
            ]
        },
        {
            "author": "whoknowswhywhat",
            "body": "Don't make the mistake of relocating to India. Your punjabi husband is showing you his hidden patriarchal side. Your concerns are very valid. Heed your instincts or you will suffer.",
            "score": 1977,
            "replies": [
                {
                    "author": "loreleiabbot",
                    "body": "from her post, his patriarchal side is not exactly hidden. but I agree: OP, don't go to India. you clearly don't want to and that should be reason enough",
                    "score": 352,
                    "replies": []
                }
            ]
        },
        {
            "author": "OLIVEmutt",
            "body": "Relocating to another country is a 2 yes decision. You don’t want to go. You don’t have to go.",
            "score": 693,
            "replies": [
                {
                    "author": "ThoughtsonYaoi",
                    "body": "This is the most important point. On decisions this important for your entire life, you get a veto. It could be that your life goals turn out to be incompatible.\n\nBut in this case, it is even more than that. You have very, very good reasons for not going. Not speaking the language means very few job opportunities and complete dependence on your husband and his family. Not being able to go out alone will only make this worse. \n\nThat is, imo, a very very risky position, for anyone. Even if you trust the other person completely, giving up a safe place to step into a situation in which you lose most of your freedom (including, importantly, the opportunity to change your own situation!) would be very unwise.",
                    "score": 145,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 615,
            "replies": [
                {
                    "author": "BreqsCousin",
                    "body": "I'd want to break up with a man who said things like this even if he did agree to stay in the country.",
                    "score": 175,
                    "replies": []
                }
            ]
        },
        {
            "author": "AllTimeGreatGod",
            "body": "I’m Indian. Close family friends of mine moved to Auckland back in 2005. Auntie’s family was punjabi. I’ve met her family, they’re very chill and open minded. One of their relatives married a black man in the states and entire family wholeheartedly supported it. Tho there are liberal and open minded families and individuals in India, most Indians still live in rural conservative societies. \n\nComing to your situation, your husband’s family belongs to a very conservative family. Even though I’ve never lived outside the country, even I’m judging him for telling you an age old phrase “good wife’s listen to their husbands”. Even my father doesn’t speak like that to my mother. \n\nConservative families will never change and worst part is, it sounds like your husband will only perpetuate their forceful values on you. \n\nI would suggest you to not come to India. It can be a hellhole for someone from a liberal country to assimilate into traditional conservative society of rural India.",
            "score": 200,
            "replies": []
        },
        {
            "author": "woolencadaver",
            "body": "Not a chance in hell I would relocate to India as a woman. Never move anywhere you will have a worse life. How will you make friends you will be a complete outsider, no language, no family. Don't do it. He can't move somewhere you won't be safe. If he wants to start a business there, he can fly in and out and do it remotely. If he is good at what he does that can work. You are not going to sacrifice your happiness, freedom, your life for him. Don't set yourself on fire to keep other people warm. No. Big fat no.",
            "score": 419,
            "replies": []
        },
        {
            "author": "TurtleDive1234",
            "body": "This is your life. He does not get to decide for you unilaterally.  Right now you have freedoms and rights you will lose if you relocate, no matter what he says he will do or allow. Do not voluntarily give up your rights. \n\nI think this a fundamental incompatibility.",
            "score": 136,
            "replies": []
        },
        {
            "author": "TheDrewscriver",
            "body": "I am an Indian...Born and raised. Don't even consider moving. It would be borderline insane, and if you are seriously considering this please DM me cause you need a reality check. \n\n\nI come from Bangalore - very urban, English is spoken by a large percentage of the population, and it's still a tough place to live.  My wife and I might move back from the US for personal reasons, but if she was born in the USA, neither of us would. Even with both of us being locals, being comfortable living there, speak the local languages, being highly educated and would find good jobs - it's still a challenge. For you, it would be a veritable nightmare, and that's just scratching the surface. Rural Punjab, without the ability to drive around, wear clothing of your choice, or even communicate? It's madness\n\n\nYour husband seems to have married you for the citizenship and is now moving back to isolate and control you, cause his entire plan centers only around him with no desire to understand where you are coming from. ",
            "score": 719,
            "replies": [
                {
                    "author": "eriometer",
                    "body": "I can easily imagine her passport going “missing” after arrival and no way to make contact with any embassy or consulate to help either.",
                    "score": 295,
                    "replies": []
                },
                {
                    "author": "a_Moa",
                    "body": "I doubt he married her for a visa, since you don't even need to get married here for a spousal visa and there were likely easier pathways... Especially if he moved here 10+ years ago.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "TheDrewscriver",
                            "body": "Possibly, either way this is a terrible idea for her, and I can see many many ways this could end horribly for her.",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "a_Moa",
                                    "body": "No disagreement on moving to rural India with minimal language skills being a terrible idea, and especially for a young woman.",
                                    "score": 38,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LunarNight",
            "body": "Do not go. It's likely you will be expected to be a caretaker for his parents as they get older, and if they don't like you, this is not going to go well.",
            "score": 112,
            "replies": []
        },
        {
            "author": "ITsPersonalIRL",
            "body": ">My husband didn’t agree to this and said where ever and whatever the husband says the wife should follow.\n\nYou aren't in a partnership - you are a pet.\n\nHe's asking you to give up everything you know and isolate yourself and then you can stick to doing everything he wants at the expense of everything you want.\n\nWould you like to waste the one life you get being a servant?  Don't let this be the mistake you wallow in for years until it's over, let it be the best decision of your life when you put your foot down.",
            "score": 109,
            "replies": []
        },
        {
            "author": "Zorgas",
            "body": "There's a huge reason why people leave India for countries like New Zealand. There's a huge reason why New Zealand is one of the most successful countries in the planet. A sane person does not leave New Zealand for India, ever.",
            "score": 246,
            "replies": []
        },
        {
            "author": "EnvironmentalLuck515",
            "body": "Zero reason for you to follow him, especially if you don't have children. Do NOT move to India. Your life will become unrecognizable and your ability to get out again will likely be slim based on what you have shared here about him.",
            "score": 64,
            "replies": []
        },
        {
            "author": "nononanana",
            "body": "Sounds like you’ll be a prisoner there. Don’t do it.",
            "score": 64,
            "replies": []
        },
        {
            "author": "m1sch13v0us",
            "body": "My girlfriend is Indian. Her former husband was also Indian. She emigrated to the US 20 years ago to escape the very patriarchal society, and shared stories about how poorly she was treated by men there. She and her husband divorced because he brought that mindset with him, and even expected her to return to India to raise their children. \n\nShe grew up in a city but her grandmother lived in the rural village. She says it was far worse in rural villages. \n\nFollow your instincts. ",
            "score": 52,
            "replies": []
        },
        {
            "author": "gftz124nso",
            "body": "Based on what you have written here, I strongly advise you not to go. I do sympathise with your husband - it must be hard living away from your family and connections - but he knew that when he married a woman not from his country and with no plans to live there. The feelings described here make me feel panicked and trapped, and his attitude (that his feelings on this matter more than yours) does not help. \n\nI'm so sorry, I know how much it must feel like this is threatening your relationship, but you only get one life. Where and how you spend your days is so important. I would not budge on this and I would be cautious about feeling pressured to stay if/when you visit India next.",
            "score": 268,
            "replies": []
        },
        {
            "author": "fuscia_unicorn",
            "body": "As someone who is married to an Indian and am European, this was a red line I made clear I would never cross and if he ever wanted that, he was free to move but he would also be signing a divorce before he left. Believe me, unless you are used to the Indian way of life, it would be impossible to live there if you were not 100% into their ways, especially in rural India. I love his family and we get on great, but I think a large part is the physical distance. You are young and you have no kids (at least I didn't see you mention any), now is the time to make a clean break. Oh, and the obligatory, make sure your contraception is solid with no room for mistakes. You don't need any added complications to an already confusing situation. Wipe your eyes, adult decisions need to be made and the time is now.",
            "score": 50,
            "replies": []
        },
        {
            "author": "Motionless_Attitude",
            "body": "Honey, do not move to India. It sounds fishy and like a set up for you to be a servant to people you can't understand for the rest of your life. This is a big bill worthy of dying on. Do not go. There are horror stories abound.",
            "score": 156,
            "replies": []
        },
        {
            "author": "Normal-Fall2821",
            "body": "No way. You got married with him living in New Zealand. He knew you wanted to live there, you never agreed to marrying and moving to India. As a woman I would never want to move there no way",
            "score": 43,
            "replies": []
        },
        {
            "author": "Trigeminal_verve",
            "body": "As an Indian Punjabi girl, please do not follow this guy to India. It will be the worst mistake ever. \nIf he loves his country so much, let him go. Hold ur ground literally!",
            "score": 45,
            "replies": []
        },
        {
            "author": "Samira827",
            "body": "Do not go. \n\nYour husband is only thinking about himself. More money? I seriously doubt that, I know a lot of Indian people who left India to countries like Denmark, UK etc. to make (for India) a shitton of money and financially support their families this way. More influence and connections? Probably. \n\nBut what about you? You'll move into a country where the culture is very misogynistic, rape is rampant and the quality of life is much lower. You don't know the language and will struggle. Your in-laws don't seem to like you or try to help you. \n\nWhatever advantage your husband will gain by moving to India, you'll lose 100x that by moving with him. \n\nAnd screw the \"oh but poor him, so far from his family, must be hard\" - you said you went many times, for 3 months at a time - that's more than enough, saying this as someone who moved abroad and only sees their family once a year. The fact you've stayed there for 3 months multiple times is already crazy and I would never do that in your place.",
            "score": 79,
            "replies": []
        },
        {
            "author": "Jedi_I_am_not",
            "body": "Moving and relocating to a different country is not easy and is not to be taken lightly. Given what you said, your experiences and feelings are very valid. Your husband should know that, when he came to NZ and married you, the expectation is that you both stay in NZ. Else he should have mentioned this before marriage. \nHe can’t expect you to be ok with uprooting your roots and your community in NZ. If you don’t want to go, don’t go. Your gut and instincts are warning you already. \n\nHe is already showing his nonsense side with the “wife has to do whatever the husband says”, so please be warned on that.",
            "score": 37,
            "replies": []
        },
        {
            "author": "desigrlbkny",
            "body": "Oh man. I’m aware that this is a super unhelpful comment but this is exactly why educated urban Indian girls would think 20 times before agreeing to marry a guy from tier 2/tier 3 India. Eventually he will say “I wanna go home to mummy daddy”. \n\nAnyway as an Indian woman my harsh 2 cents is that this is only going to get much much worse. Do not move to India.",
            "score": 37,
            "replies": []
        },
        {
            "author": "booo2u",
            "body": "You're not selfish for wanting to keep your rights and freedoms as a women. \n\nYour husband, his family and the experiences you have had while visiting India have proven to you that that is exactly what will happen. \n\n**Do not** relocate to India with your husband. This would be divorce worthy for me.",
            "score": 32,
            "replies": []
        },
        {
            "author": "PB-n-AJ",
            "body": "Go watch Not Without My Daughter. Different country, same red flags.",
            "score": 29,
            "replies": [
                {
                    "author": "MidMontague",
                    "body": "I was just about to say this- pleaseeee please go watch that film.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Andress1",
            "body": "I'm male but if I was in your position I would not have even considered it.\n\n\nYou would be putting yourself in a super vulnerable position.",
            "score": 28,
            "replies": []
        },
        {
            "author": "One-Pomelo-7728",
            "body": "Sorry to hear about this. I would suggest you to NOT relocate to India.\nI am an Indian, born and raised in India.\nWhatever issues you faced for the 3 months each year, this will be like life-long problems. And then you won't be happy anymore after a few months or years.\nIn India, specially rural areas, females, or rather wives, are supposed to adjust or compromise, ALWAYS. And you will live with your in-laws, i am assuming, so things might get difficult for you.\nAnd your thoughts are valid.\nWhatever your husband promised, to get you a car, a good job, these are all valid and achievable. But, as you already know in your gut, you will not be happy.",
            "score": 28,
            "replies": []
        },
        {
            "author": "davidstiehl",
            "body": "Everything I wanted to say has been said! Please give us an update on your decision and his reaction, once you've had the conversation",
            "score": 47,
            "replies": []
        },
        {
            "author": "Morgil2",
            "body": "The fact that he dismissed your very valid concerns is a HUGE RED FLAG!!!\nDon't move, you're instincts are right!",
            "score": 49,
            "replies": []
        },
        {
            "author": "Maud_Dweeb18",
            "body": "Be very careful. Do you have kids? Gather your important papers and see a lawyer. He just said you have to follow him because he’s the husband. If you have kids see if you can put a stop on their passports so they can’t leave the country with him. Don’t go to India with him again.",
            "score": 24,
            "replies": []
        },
        {
            "author": "MidMontague",
            "body": "Please have you done any research on how women are treated in India? Of what your life will be like? It’s clear that for your husband it’s his way or the highway way. Please do your research and watch the movie not without my daughter for a reality check.",
            "score": 24,
            "replies": []
        },
        {
            "author": "smallf4iry",
            "body": "I think it should be clear for you already that this is a dangerous situation and maybe it’s time to cut your losses and move on because your husband doesn’t really care about your wants in life.\n\nI want to put more emphasis on this: be very careful when visiting and actually if possible better not visit with him at all. He lives in a rural area and that makes it easier for him to just keep u there or hide your passport and you won’t be able to leave because “wife has to do what husband says” like he openly said.",
            "score": 19,
            "replies": []
        },
        {
            "author": "buds510",
            "body": "I did this, although didn't move to India but to a non English speaking country (his country) and we are now divorced. If you feel that way now, it's not going to end well. I wish you all the best. You can message me if you want.",
            "score": 18,
            "replies": []
        },
        {
            "author": "fugelwoman",
            "body": "Do not go. I hate to say this but women are not safe in India.",
            "score": 42,
            "replies": [
                {
                    "author": "SuluSpeaks",
                    "body": "Rape is a huge problem there!",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "AITA476510719",
            "body": "In my opinion: \n\nI would not, under any circumstances relocate to another country under the circumstances given in the post. DO NOT GO.  \n\nYou will be alone\n\nYou will be isolated from any support system.\n\nI highly doubt you will be traveling back. \n\nHe is looking for a slave that goes along with anything he says. That’s clearly not you. You will resent it, you will be unhappy, and it will likely be extremely difficult for you to leave.",
            "score": 19,
            "replies": []
        },
        {
            "author": "deathknight-007",
            "body": "Punjabi here from India,\nIs your husband crazy? Why would he do that? You are from a different culture and will have different expectations from what and how things should be.\n\nThe air toxicity is rising.\nFresh water is going to be a problem in the near future.\nIf kids are considered, No university is highly ranked compared to NZ and other commonwealth nations.\nSomewhat backwards and religion/ false customs are the reasons for the people’s deluded mindset.\nPublic services, social services, public transportation is an abysmal shit. Also, the corruption.\n\nYour country is progressive and honestly i don’t even see India becoming one in this century for at-least.\n\nMy advice, talk to him and make your stand, let him know show him the statistics that you’ll be downgrading your own life. Redditors will say to break it off right away as he’s toxic and this or that, these people don’t realise that they can too exhibit some other form of toxic behaviours in their relationships without realising which can be sorted through therapy or talking.\n\nIf he doesn’t listen after all the attempts, well lets say there are some hard choices that you’ll have to make",
            "score": 34,
            "replies": []
        },
        {
            "author": "Verbenaplant",
            "body": "Dont go.\n\nreasons:\n\nhusband says wife should do what husband wants (you will have less rights and protection in India)\n\ncultural and lifestyle changes\n\nyou can’t speak the language so will be isolated. (very depressing and not really living a good life)\n\nhusbands house is rural so isolated again. (Stuck with only his family)\n\nyou can go anywhere without him (so no doing anything if he says no that’s it)\n\ncant wear what you want.\n\nthey don’t want you to watch English tv which is insane (I guess your allowed to be bored forever)\n\njudges for not wanting to eat or drink foods.\n\nyou have given a great list of reasons to stay in nz. Nz is a great safe country where women are treated fairly well.\n\nthis isn’t an equal marriage.\n\nlet him go and you stay in nz. I would suggest divorce.\n\nyou have enjoyed being a women who can wear, say, eat and do what you want. Do not give up that freedom. India’s laws are worse than nz in protecting women.\n\nyou would be giving up everything to be trapped in a house with people you don’t get on with who nitpick at you for not being basically Indian. You will be stuck rural only allows to drive to work.\n\n  \nnext it will be he takes away the car and just wants you at home looking after the family.\n\nnz is an amazing place. Stay there. Seriously.",
            "score": 48,
            "replies": []
        },
        {
            "author": "coolbeenz68",
            "body": "op,  beg you to please find and hide your documents! i see him getting to the point of forcing you to move because he wants that control over you. he always did but he hid it until he thought youd happily just follow him.\n\nplease dont go!",
            "score": 14,
            "replies": []
        },
        {
            "author": "pfroo40",
            "body": "If he suddenly \"sees the light\" and decides to take your compromise, be very suspicious of it, and protect your money and passport so you can theoretically still leave India if you needed. With that kind of talk, I wouldn't be surprised if he tried to keep you from leaving, by cutting you off financially, and hiding/destroying your passport.",
            "score": 14,
            "replies": []
        },
        {
            "author": "ingachan",
            "body": "Don’t go, the cultural differences will be so hard to deal with and you wouldn’t be able to support yourself independently. This is especially important if you’re thinking of having children: You can’t take the children back to NZ with you without his consent. If you divorce and want to move back, the children would need his consent to move abroad, otherwise it would count as you kidnapping them and you could literally go to prison.",
            "score": 30,
            "replies": []
        },
        {
            "author": "gigigalaxy",
            "body": "this is already a matter of your freedom and survival, don't go",
            "score": 14,
            "replies": []
        },
        {
            "author": "EarlyNote9541",
            "body": "Girl wtf? Please, look at how the women live and what their daily lives are like. If marriage requires me to compromise & my husband to not it already doesn’t sound equitable. It certainly won’t be in a country where the abuse of women is normalized.",
            "score": 12,
            "replies": []
        },
        {
            "author": "kn0tkn0wn",
            "body": "Don’t go. \n\nIndia is one of the ground zero rape countries against women, at least in private/domestic life.  \n\nAnd women’s safety is horribly at risk in India \n\nJust say no, and don’t go \n\nIf your husband cared about you at all, he wouldn’t ask or hope or expect you to go in fact she would want to protect you from his native country\n\nEven that your husband proposes this means that he doesn’t care about you and he also doesn’t care about any children you might have",
            "score": 35,
            "replies": []
        },
        {
            "author": "toaster661",
            "body": "Well as an Indian, I will tell you that we are a lot more conservative than we like to seem. We’re good at assimilation which means we assimilate anywhere. That means becoming more conservative when we visit home. Ofc there are outliers to this idea but he is already showing signs of requiring you to accept his wishes as he is the husband. Every time you accept his demands, you set precedent that you won’t fight for your things.",
            "score": 11,
            "replies": []
        },
        {
            "author": "FigaroNeptune",
            "body": "Why do people post concerning stuff and never respond to people? Anyways do NOT move to India. It’s not safe for women and you’ll never be able to leave .",
            "score": 28,
            "replies": [
                {
                    "author": "MsCynical",
                    "body": "It's half past two in NZ, she is likely asleep.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "NexStarMedia",
            "body": "I've always been a big fan of faking your Death and disappearing. 😉",
            "score": 18,
            "replies": []
        },
        {
            "author": "Kingarvan",
            "body": "As you already have had bad experiences living in India with your inlaws and have experienced life in the remote villages with the many restrictions, it would be foolhardy to extend those experiences on a permanent basis. \n\nYour Punjabi husband turned out to be just like those conservative Punjabi males and their orthodox families. He and they want to control every inch of your life. Conservative Indian families and local peoples can really make your life miserable. Perhaps you knew all of this even before or during your marriage.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Otherwise_Amount319",
            "body": "Please don’t move to India because you will lose your freedom as a woman.",
            "score": 10,
            "replies": []
        },
        {
            "author": "soyeah_87",
            "body": "\"Where ever and whatever the husband says, the wife should follow\"????? Girl run. If he's saying that NOW, the fuck you think is gonna happen when you're out in the sticks, in a country you don't speak the language of, with no support system.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Silvannnn",
            "body": "Don’t go, your husband is already showing some red flags. It’ll only get worse when you’re over in India and cut off from your own support network.",
            "score": 7,
            "replies": []
        },
        {
            "author": "gdognoseit",
            "body": "You will be a slave that he has complete control over. Please don’t move there. You will regret it.",
            "score": 7,
            "replies": []
        },
        {
            "author": "sweadle",
            "body": "Yeah, living in India is a great deal for men. They rule, and women serve them. You would be so dependent on him, and could easily get trapped.",
            "score": 8,
            "replies": []
        },
        {
            "author": "MyFeetLookLikeHands",
            "body": "India has some wonderful places and wonderful people… but there’s a reason you hear a lot more about people leaving it than going there.",
            "score": 9,
            "replies": []
        },
        {
            "author": "PuzzleheadedBar7235",
            "body": "I have pride in being from there but do not go! Don’t even visit it with him right now. Especially with his other values he’s made vocal. If he were behaving like this about taking you to the rural area of any other country I would give you the same advice too. Whatever love of his you may lose is not equivalent to the freedom you most certainly will.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Snoo_59080",
            "body": "Lol the man tells you to obey him because he is a man, and he wants to take you to india, where you will not be seen as equal citizen, and customs and culture will keep you that way.  This is a very big danger sign, you have no business with this type of man at all. ",
            "score": 8,
            "replies": []
        },
        {
            "author": "Regen89",
            "body": "Hell no buddy, you will be trapped and hate your life, don't do it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mypettyface",
            "body": "It sounds like he wants to control you. I wouldn’t go live in India for a million dollars. Maybe life is showing you that this isn’t the man for you. You have the right to say no. Do you really want to be judged by his family forever?\n\nDo not leave a wonderful country like NZ to go live in a third world country. Say no and stick to it.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Keepuptheworkforyou",
            "body": "Once you get there you will be isolated and alone. Please don't go.",
            "score": 6,
            "replies": []
        },
        {
            "author": "RockKnock11",
            "body": "What are you thinking, please do not make this huge mistake. It feels wrong for a reason.",
            "score": 4,
            "replies": []
        },
        {
            "author": "baxbaum",
            "body": "Girl, run. \n\nIt’s only going to get worse. \n\nYou didn’t sign up for this when you married. You are young, you have so much life to live. And you already know in your heart it’s not in India.",
            "score": 5,
            "replies": []
        },
        {
            "author": "brokenhousewife_",
            "body": "\" where ever and whatever the husband says the wife should follow.\"... have you ever watched the movie, 'not without my daughter'. This reminds me of that movie. I literally wouldn't even go to visit at this point, because you'll never leave.",
            "score": 6,
            "replies": []
        },
        {
            "author": "IloveLegs02",
            "body": "DO NOT GO TO INDIA, IT WILL BE THE WORST MISTAKE OF YOUR LIFE\n\nwriting this in caps so you can see it",
            "score": 5,
            "replies": []
        },
        {
            "author": "thatrandomanus",
            "body": "As someone from this part of the world, DON'T MAKE THIS MISTAKE. You won't be able to cope with the culture here. You'll forever feel like an alien. You'll resent yourself for putting yourself through it. You'd probably be rich in India but money isn't everything. \n\nRight now he's asking you to listen to him because he's your husband. Next you'll be expected to listen to his family. Save yourself.",
            "score": 5,
            "replies": []
        },
        {
            "author": "dannysmackdown",
            "body": "You will lose all individuality and freedom, and your husband clearly wants that. Doesn't sound like much of a man to me.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Trippygirl13",
            "body": "What is your perspective on this while \"whatever husband says, wife should do\"? Do you share this sentiment, is this the dynamic you both enjoy and consent to? You are not being selfish, he is the one being very selfish. He felt entitled to make a decision that would greatly impact both of your lives and didn't even think to consult you on it. That is selfish, and disrespectful, and inconsiderate and it really shows just how much he cares about you and what think/want. It may be time to re-evaluate what you are getting from a dude who behaves like this and if you don't want to move, don't move. Why are you even trying to make compromises with someone who doesn't give a fuck about what you think?!",
            "score": 5,
            "replies": []
        },
        {
            "author": "druidmind",
            "body": "He sounds very traditional, and honestly, you should've seen this coming before marrying this guy. How did yall get married without having an explicit conversation about this. You are still young enough to cut your losses and move on since you don't have kids.",
            "score": 40,
            "replies": [
                {
                    "author": "Glitter_berries",
                    "body": "Why do people think that older women should have to put up with this shit? What if she were 40? Would you tell her ‘sorry honey, it’s too late to find a new man, go and live a horrible life in India, it will suck but at least you won’t be the worst thing a woman can be, which is single!!!’ Honestly offensive.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "BreqsCousin",
                    "body": "Even if she were twice that age she'd be \"young enough\" to prioritise her happiness and safety",
                    "score": 38,
                    "replies": [
                        {
                            "author": "druidmind",
                            "body": "Exactly, I'm South Asian as well but I would never dream of doing this to my wife.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AggravatingWealth69",
            "body": "lol imagine leaving a place like NZ for shit hole India",
            "score": 13,
            "replies": []
        },
        {
            "author": "Anon198791",
            "body": "DON'T DO IT.... you'll be miserable!",
            "score": 4,
            "replies": []
        },
        {
            "author": "MeshuggahMe",
            "body": "Before you go, please watch the movie (or read the book) called Not Without My Daughter. I don't know if you have children, but it seems a lot of the same circumstances exist here. Please watch it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "jamie1983",
            "body": "Don't go! I moved to a Europe county after being raised in Canada, and one of the things that keeps me sane is watching English speaking shows on Netflix. It's a small piece of comfort that makes me feel somewhat connected to my roots. Would you ever tell your husband not to watch an Indian show? They don't respect you and it's going to get 100x worse when you move there. \n\nMy husband is Albanian, and though we visit often, before we got married I told him one of my deal breakers would be moving to Albania. It sounds like moving to India is a deal breaker for you too. You're young and still have time to find someone better suited for you in New Zealand. Just because you fell in love doesnt mean you have to ruin your life and follow your husband wherever he goes.",
            "score": 6,
            "replies": []
        },
        {
            "author": "MrsSEM84",
            "body": "Tell him no. It’s 2025 and husbands no longer get to dictate everything. \n\nYou don’t want to live in India so you are not going to. He can do what he likes but he can’t force you to. \n\nTell him you are staying firmly put in NZ, he can either stay with you or get divorced and move back by himself. \n\nDon’t even agree to the 3 month visits anymore if you are not comfortable with that. Two weeks once or twice a year is more than enough. He can visit for longer if he wants to. \n\nHe chose to move to NZ & get married there. If his goal was always to return to India he should have made that clear to you long BEFORE you got married.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LilithWasAGinger",
            "body": "Don't do it. It will be a nightmare.",
            "score": 4,
            "replies": []
        },
        {
            "author": "schecter_",
            "body": "This is your life, you are not obligated to move if you don't want to. As much as you love your husband, if He can't understand you will be miserable in India, then you need to go separate ways.",
            "score": 3,
            "replies": []
        },
        {
            "author": "phoenix-corn",
            "body": "Hey there OP. I love foreign travel. I live in the US currently and would looooove to get to move somewhere else. Even I would have serious concerns and probably ultimately say no to India and I love the food and nobody would control my media habits. You didn’t ask, but you aren’t the asshole if you say no and end up divorcing. You deserve to live someplace where you can have a full life without fear due to your gender.",
            "score": 4,
            "replies": []
        },
        {
            "author": "1568314",
            "body": "Girl, it's not selfish to give up your entire life, your freedom, your ability to communicate, decided what to eat and wear and watch, where you can go... just for your husband. \n\nHe doesn't care because he's not going to be experiencing any of those restrictions. He thinks you *should* be willing to suffer for no one's benefit but his own. He thinks you should just agree with him and exist to make his life easier. \n\nYou won't be happy and it will be hard to leave. \n\nHe doesn't have your best interests in mind. He is lying to you when he says it will be good for both of you.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MercuryAI",
            "body": "It's not going to work - be prepared to divorce. It may be sad, but you're young - you have your whole life ahead of you.\n\nUnless you move there and get trapped, then you don't.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Mariner-and-Marinate",
            "body": "Be grateful that you are incredibly more fortunate than other women being told by their husbands to follow them, as you already have living experience on how that would be for you. Plan your future accordingly.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Burgerkrieg",
            "body": "Absolutely do not do this. Your husband does not get to decide where you live, and especially not a place you hate being in, surrounded by people who dislike you. His behaviour here is a huge red flag. If you go there I do not believe you will be able to come back even if you desperately want to.",
            "score": 7,
            "replies": []
        },
        {
            "author": "SeaworthinessCool747",
            "body": "that's crazy. absolutely not. the wife is an individual and should not follow her husband if she doesn't want to. he's prioritizing his own happiness and diminishing your. if he truly wanted to make this marriage work he would be the one visiting 3 months a year and living the rest in NZ with you. he knows english and it is not hard for him to live in NZ, you don't know punjabi and will be alone and isolated and probably will feel racism from the locals for the rest of your time there. this is NOT a fair plan and he knows it.",
            "score": 9,
            "replies": []
        },
        {
            "author": "EnvironmentalPop1371",
            "body": "I am married to a Thai man and had similar feelings early in our relationship. First six years we lived in Thailand in a different city from his family, but still his country. His family is also rural. Even then, I had a lot of resentment when we were living in Thailand and he got to have all of his home comforts while I was (especially back then) struggling to comprehend basic things. \n\nThe solution for us was living in a country foreign to both of us. We have done China and now we are in Malaysia. China was terrible— but in its terrible-ness brought us together. Our daughters were born in China. Malaysia is a VERY welcome relief from China, we can road trip to his family in Thailand… win win all around. Now, ten years later, I will happily move to Thailand when we save a bit more money. This is because I now feel really comfortable around his family and friends and they feel like my family and friends too. This was not possible in the beginning, probably actually not until very recently now that we have two kids did I feel truly accepted and comfortable. \n\nI’m from the states. There’s simply no way to make your marriage work if you can’t get on the same page about this. I have seen endless intercultural marriages end over this situation. Do yourself a favor and get VERY clear about what you want, and then align that with your actions moving forward. The truth is— it’s not fair to either of you to be in either person’s home country at this stage. He’s going to resent you being in NZ, and you’ll regret India. Lose-lose unless you guys are both equally uncomfortable and build your marriage elsewhere with cheap flights/drives home for both.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Blonde_arrbuckle",
            "body": "He's violating the agreement you had when you married. He was already in NZ 10 Years so it would have been reasonable for you to trust your life would be in NZ ( unless explicitly discussed otherwise)\n\nDo not go. This feeling is your body's reaction to tell you don't go.",
            "score": 3,
            "replies": []
        },
        {
            "author": "lisalovesbutter",
            "body": "It's apparent that such a move wouldn't work for you in many regards. It would mean a lifestyle you would have a hard time adjusting to. \n\nSo. If you came here looking for us to say yes, you have excellent grounds for divorce since your hubby seems intent on the move and has a certain viewpoint on it...you have it. And I don't take divorce lightly. This just isn't a long-term fit.\n\nYour backgrounds are sooo different. His culture is not an easy one to adapt to if it doesn't resonate. In addition, his family dynamics are extreme for someone from Europe/the West to find acceptable.\n\nI'm so sorry! Best wishes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Putt-putt_Coffee_Cup",
            "body": "You’re in a controlling relationship where your husband has all the control and wants more. A move to India would mean you are isolated from any and all support networks. Once that happens everything he says goes.\n\nI’ve seen this play out so many times and have had to help multiple friends extricate themselves from abusive controlling relationships. \n\nEverytime I see a friend try to separate from their husbands, the husband then threatens self-harm/suicide. This is usually accompanied with a large serving of gas lighting.\n\nI hope I'm wrong and things work out for both of you, but if your husband is the sort of man I think he is, he has you completely blinded to his true nature and your situation is textbook.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Knittingfairy09113",
            "body": "Do NOT go to India. He and his parents have shown from their past behavior that you will be miserable. You will be at the mercy of all 3 of them, with no one to care about your happiness.\n\nStay in NZ and tell the controlling AH to kick rocks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "a_Moa",
            "body": "There is nothing wrong with staying home if that's what you want to do and, more importantly, your husband can't make you leave, he is not the boss of you. \n\n  Please reach out to some friends or Shine services if you can't talk to your friends about this. You deserve to feel happy and safe.",
            "score": 3,
            "replies": []
        },
        {
            "author": "brianmcg321",
            "body": "Well, time to get divorced.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GZB2000",
            "body": "That's tough to just be expected to follow and start new especially in a new country. I would have to have a more serious discussion about if this was brought up before or why a serious change like this needs to happen if both are fine financially where you're at right now (he said he would make more there, is he not making enough here?). At the end of the day it's probably for family reasons more, and I feel like your compensation is more than enough considering the circumstance and how much it would impact your life. If he keeps pushing he might push you away and cause resent. If that was me I would consider divorce on the table if the wife is required to follow whatever the man does regardless of how it affects her life",
            "score": 7,
            "replies": []
        },
        {
            "author": "SuluSpeaks",
            "body": "Info please tell us you're not going!",
            "score": 5,
            "replies": []
        },
        {
            "author": "TheMusicArchivist",
            "body": "Unfortunately mixed-nationality marriage always has this elephant in the room. The two of you together have to decide which country you want to live in, acknowledging the sacrifices that the foreigner has to give. Sometimes one route is to live in each country for a few years and then commit afterwards. \n\nDo you think he copes well being far away from his family and the place he calls home? Do you think he understands how you would cope being far away from your family and the place you call home? You need a complete discussion about this where both of you validate the other's feelings. If you have any red lines, draw them; but don't put moving out of the question completely.\n\nAre there any compromises you can make? Could you live in an intermediate country? Could you split the living arrangements to spend half a year in both? Can you live apart and raise a family successfully? Can your husband put effort and time into making your uncertainties feel better - for example finding a neighbourhood that has a better fit for your lifestyle (a more urban area with more European influence plus having a community of English-speaking immigrants sounds like a good first step)?\n\nIf you can't make the practical elements of marriage work (ie finding a living arrangement where you are both happy) then despite the love and support it might not be meant to be.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Gonebabythoughts",
            "body": "You really didn't see this coming?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Nico2435",
            "body": "Hey fellow European here with an Indian partner. I can understand the difficulty and being in a relationship/marriage with a person from another country can be difficult in these instances when one wants to move back to home country.\n\nThough I enjoy living in India, I can understand why you would feel restricted in terms of language, clothing, freedom etc. If you know you will not be happy there it will also be unhappy for your spouse and he should understand your perspective too. \n\nI agree with other comments here - this is something your husband signed up for by marrying you, knowing presumably from the get go that you never see yourself living in India. The best you both can do is come to a middle ground such as spending maybe half the year in each place or few months. \n\nWas this discussed with you before marrying or he is just changing his mind recently? For example I want to live in India and prefer it there so we know in the coming 5 years that’s where we will be - but I’ve made it clear that that could change and it may be possible I would want to move back to Ireland in the future. \n\nWishing you the best navigating it, it’s tough! ❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "Miliean",
            "body": "> said where ever and whatever the husband says the wife should follow\n\nI assume that this is not something that you believe?  How is it that you ended up married without discussing something as fundamental as that before hand?\n\nTHAT is your real problem, not to move to India or not.  Who decides, what is each of your roles in marriage.  Those are big issues that you should have discussed before marriage (along with where will we live).  And it's kind of insane that you didn't.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kink89_",
            "body": "No way! I wouldn't go. India equals venomous snakes, crowds, noise, dirty and the culture is completely different. I would not go, it's kind of like a prison and you know you'd be staying at his parents.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Silly-Swan-8642",
            "body": "What is your source of income currently?",
            "score": 2,
            "replies": []
        },
        {
            "author": "42tatltuae",
            "body": "You don’t want to relocate? Than you don’t go. \nIt’s not that hard.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Swatizen",
            "body": "Why wasn’t this discussed before marriage? \n\nYou can compromise by moving to a multicultural country like Singapore or South Africa.\n\nBut I fear that he has made up his mind. \n\nIf you don’t have a child, this is where your journey with him can end.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Recording-7486",
            "body": "He can live in India and you stay where you are ……. You can do this and stay married or get divorced ……… also if you are not willingly to move don’t date someone from a different country than you",
            "score": -8,
            "replies": [
                {
                    "author": "coolbeenz68",
                    "body": "i think he tricked op. it happens a lot.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shas1931",
            "body": "Here is a man here with a similar situation, but reversed, I hope it helps and show you how a man usually thinks:\n\nI lived my whole lives a as refugee, all my relatives succeed in immigrating to other countries and became very rich and very successful. I got my Residence permit a year ago to get out of the country I am living in currently, but… my wife does not want to immigrate for her reasons.\n\nYes she’s trying to compromise and make me fulfill my dream of getting a strong passport. But as a husband, I will not be happy if she’s not completely in with my idea.\n\nYour husband would not have had met you if he did not believe that your country (New Zeland) is better than his country (India) and decided to stay in his country (India). But, I am sorry to say, that some immigrants still view their people to be better than the country he immigrated to (and I am telling you this as an immigrant - and this is what’s corrupting western society, its a one way valve of cultural movement.\n\nExample: If I ever go to NZ, and someone there tried to tell me how should I act or what should I watch, I will be pissed off (and thats me as an immigrant). So you going back to his home country and being judged is not acceptable.\n\nBut to continue: I know its better for my wife to immigrate with me (she’s currently jobless) and she can get a better job and a better education in the westren country where we got our resident permits. But she does not see that. My luck to marry the only refugee on earth who does not want to immigrate. I am not manipulative: I married her here, she values her family and the country she was born in (although she’s never given citizenship) so I decided to find a middle ground <- and this what a life partner does.\n\nWe sat and discussed that our families are at an old age (they wont stay there forever). So why would we stay where we are… and the decision was: to live in a country that is best for our children.\n\nWe made a list of countries where we could live in (me having the ability to get up in my career path by job hopping) and she being near her family and the children being raised in countries of our same faith and moral principles. \n\nSo we found a middle ground for all of us to grow (I know I will regret not moving to Europe) but I will not drag my wife and cause her unhappiness even though I know many other ladies would wish to be in her shoes, and even though I know she could fullfill her potential - she rejecting that is her decision, not mine, and is never mine to decide what’s best for her.\n\nHope it was useful",
            "score": -3,
            "replies": []
        }
    ]
}