{
    "title": "(F28) moved in with boyfriend (M29). He insists all house changes be approved by him. I don't feel like it's our home. What can I do?",
    "author": "NamuhNoserp",
    "subreddit": "relationships",
    "rank": 3,
    "score": 55,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 77,
    "url": "https://www.reddit.com/r/relationships/comments/1jecnfo/f28_moved_in_with_boyfriend_m29_he_insists_all/",
    "id": "1jecnfo",
    "selftext": "\nMy partner and I recently started living together in his newly bought home, a 4-bed. He requested that I not pay rent, which I suspect is because he wants to avoid any potential claims on the property if we get married and later divorce. However, I contribute to other expenses like groceries, internet, energy, and water bills.\n\nThe issue is that I like a cozy, decorated home with rugs, pictures, plants, and general home decor. My partner, on the other hand, doesn’t see the need for these things. Since he wasn’t interested in getting them himself, I volunteered to buy rugs for the bedroom and living room, throw cushions, plants, a center table, and other small decor items.\n\nWhen I mentioned this to him, he insisted that he needed to see and approve everything before I bought it. While I understand wanting a say in what goes into the home, his wording made me uncomfortable. He said, \"You cannot just bring anything into my house. If I don’t want or like it, then it can’t be here.\"\n\nThis level of control extends to other things too, like not being able to buy something for the kitchen without him questioning why I got it when I bought it and why I didn’t ask first. Because of this, I’ve started to feel like I’m just a guest in his home rather than a partner building a life with him.\n\nHe has also mentioned that he wants a prenup, stating that what he had before marriage remains his. But if that’s the case, why does it matter if I decorate? No matter what I add to the space, the house is still his legally, right? I am also not doing too much, just bits and pieces there to make the house less naked.\n\nPart of me wants to just leave things as they are and stop trying. If he doesn’t see this as our home and isn’t open to us making it one together, then maybe I shouldn’t bother. At the same time, I wonder if I should try to work within his boundaries and get his approval first, and maybe he’ll come around once he sees the changes.\n\nBut then I ask myself: why should I try so hard to contribute when he doesn’t seem to want me to?\n\nHe gave me a room that also doubles as the house storage and my studio, which, despite sharing it with \"things,\" I am grateful for. He has told me I can make some changes to it, but how many changes can I make with the equipment I share the room with? Also, I have always wanted my home to look a certain way, and now being denied of that just feels very sad.\n\nIt's quite tough because when we were assembling the bed, he didn't let me help out. I sensed that it was because he didn't trust me to do well. The only thing he allowed me to assemble was the bathroom cabinet and when I was done he was like, \"did you do it well, are you sure you screwed it well\".\n\nRight now, I feel like I’m living in a borrowed space, with nothing truly mine beyond my clothes. It all feels temporary, and that unsettles me. At the same time, I feel guilty for even feeling this way. Some people have partners who don’t care at all about the home, and here I am, upset that mine is involved and wielding so much control over it.\n\nI don’t know if anyone here has experienced this before and will be willing to share some insights into how to deal with this. \n\nThank you.\n\nTL;DR: Moved in with my boyfriend (M29) into his newly bought house. I don’t pay rent but contribute to groceries and bills. I like a cozy, decorated home, but he sees no point in decor. When I offered to buy rugs, plants, and a center table, he insisted on approving everything first and said, \"You can’t just bring anything into my house.\" I can’t even buy small kitchen items without being questioned. This makes me feel like a guest rather than a partner. How can I deal with this?",
    "comments": [
        {
            "author": "BlackJeepW1",
            "body": "He’s telling you this is *his* home, not yours, not yours together. I don’t think he’s ever going to change that mindset and if I were you I would start looking for my own place. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "babypterodactyl",
            "body": "When you told him how it makes you feel, what did he say?",
            "score": 1,
            "replies": [
                {
                    "author": "NamuhNoserp",
                    "body": "I haven't shared this with him yet. I'm thinking there's a way I could compromise and deal with it async",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bickets",
                            "body": "If you can’t have an actual conversation with him about this, you have bigger problems. This is a great time to find out if you can talk about hard things as a couple. Try approaching it from the perspective of “I understand that it is your house. But it is OUR home.” The physical structure is one thing. But if you aren’t “allowed” to make your home a place that is comfortable for you, this relationship will never survive.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "babypterodactyl",
                            "body": "You need to talk to him. \n\nHe could have some understandable reasons for his approach, or he could be a controlling jerk. Tell him how it makes you feel, and if he’s a halfway decent guy, you guys will be able to start compromising *together*.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "McBigglesworth",
                                    "body": "When my wife moved in while we were dating, after a few months she complained that nowhere felt like \"her place\" as she moved into a house that was already setup. So we cleaned out an entire room just for her stuff and we cleaned out all my stuff from the main rooms and decorated it back together. It seemingly Made a world of difference",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "smothered_reality",
                                            "body": "This is what I mentioned before I moved in. That I was used to having an entire apartment to myself and I needed to feel like I had a space for myself. He cleared out a room for me as an office/guest room and told me that I have creative control of most of the house. Made a huge difference in calming my fears. Still trying to figure out how to write up an agreement for us where we define what I pay for etc.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "richardhod",
                                    "body": "agreed. A good relationship is where your partner and you make decisions together that work for you both, and work around the compromises!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Flower-of-Telperion",
                            "body": "You're gonna compromise yourself into oblivion with this dude.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FindingHerStrength",
                                    "body": "100%. There isn’t any communication with a person like this. I’d say cut the losses and go. I’ve been there and it doesn’t get easier with them. There are no conversations just one way demands, rules, which won’t be compromised on their half.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SneepleSnurch",
                            "body": "Async???? Like, asynchronously, like, not having a live conversation with him? Girl bffr ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "chopperThehopper",
                            "body": "You need to lay it out to him. You are building a LIFE together. If you want the relationship to continue you need to make sure your calues for the relationship align with his.\n\nWhen you build a life with someone you get a say in the home, if he wants control over something a small as a throw pillow, leave. Right now, he doesn't want you to be comfortable, he doesn't want you to feel welcome, he doesn't actually want to build a life WITH you.\n\nTalk to him, be honest, be open to listen, but in the end you need to ask yourself if you see this relationship benefitting you both equally in the future. Free rent isn't worth being in a stunted relationship",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Ordinaryflyaway",
                            "body": "There is no compromise.  He's already telling you exactly how it's going to be.  This is not a partnership,  its all his way. Leave because you're already getting bitter.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "CuriousPenguinSocks",
                            "body": "A compromise is meeting in the middle, you doing what he says is you caving. \n\nBoth parties should be compromising but right now he is dictating like a parent, not sexy at all. \n\nTalk with him, tell him how it makes you feel and ask if there is a compromise to be had. \n\nIf there isn't, then there really isn't a good future with him. If there is and he takes it, that's something you can work with. His answer will tell you all you need though.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ValkyrieSword",
                            "body": "He’s not compromising at all, why should you?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "castrodelavaga79",
                            "body": "But he's not interested in compromising in any way it seems like. \n\nHonestly if he doesn't change his attitude after you talk, maybe you guys just aren't compatible. It's almost like he just expects you to deal with his house how it is because he's showing you that even after you move in it's not your space, it's his.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Verbenaplant",
                            "body": "its Him that needs to compromise and you should pay towards the house. It’s not fair that he would get it all if you say broke up in 30 years.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "dawn8554",
                            "body": "No, you need to sit and have a serious conversation. If he actually loves you he’ll be upset that you feel like this and reassure and help. If not you know he doesn’t care",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AriesRedWriter",
                            "body": "How long have you two been together?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jintana",
            "body": "The most self-caring way to deal with this is to move out and decorate your new home as you wish.\n\n\nHe is telling you who he is: someone who has you along for his ride and cares nothing about your experience or your future.",
            "score": 1,
            "replies": []
        },
        {
            "author": "booo2u",
            "body": "I mean, he's made it pretty clear that that is *his* house. Not yours. Heck, even the spot that has been designated as yours is literally just a storage unit. \n\nHow long have you two been dating?",
            "score": 1,
            "replies": []
        },
        {
            "author": "annakarenina66",
            "body": "have you sat down and had a heart to heart? explain what you feel here - that protecting his assets from you is clearly important, and having a style he likes is important - but he is putting the weight of those things far far above any semblance of feelings at home for you. \n\nwhy did he want you to move in? to get cheaper bills, sex on tap? do you do the cleaning? he wants to live alone but he wants whatever you provide too. \n\nthis situation will only change if he wants it to. hopefully when you say how sad you feel and unwelcome he'll change. if he doesn't then you have to leave because you have the right to feel joy in your home .\n\nhe should want you to feel joy in your home.\n\nit's not superficial - do not feel bad. and do not let him crush your spirit and the sense of who you are",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stepinfection",
            "body": "You aren’t upset that he’s involved in caring about his home. You’re upset that he doesn’t trust you and doesn’t want you to feel comfortable in it. It’s normal to say “hey I want to look at and like any potential rugs we have”. It’s NOT normal to say “you can’t buy anything for the house without my approval”. You can’t buy a can opener? Chip clips?\n\nIf I were you I would think long and hard about this relationship. Are you anticipating that these issues would “go away” if/when you get married? Because that seems unlikely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AttemptOverall7128",
            "body": "Stop wasting your time with someone that’s not invested in the relationship. \n\nIt’s never going to change.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FindingHerStrength",
            "body": "Controlling behaviour like this is telling you who he fundamentally is. He’s showing you who he is right now. Things won’t get easier or better for you because this person thrives on control. \n\nI’ve dealt with it in my marriage. I was there for almost 15 years and I couldn’t even put up family photos. It was a bachelor pad from the day I moved in till I left. These people don’t change. \n\nYou’re never going to get a say when you cannot be met half way and right now nor never will it be your ‘home’. It may be where you live but you’re never going to have a mark on that place.\n\nIt doesn’t matter if you don’t pay rent. The court will always take into consideration how long you cohabited and contributed to the home in other ways. Just to let you know…(England). \n\nIf I were you I would give serious consideration to how your future is looking with someone who isn’t willing to share anything. And if he wants a prenup whilst you’re contributing so much to this home which would mean you get nothing then wow ~ you need to walk away now and save yourself. \n\nHonestly I just want to say, he knows he’s upsetting you and he’s not bothered… so what does that tell you about how he sees you and is willing to treat you?",
            "score": 1,
            "replies": []
        },
        {
            "author": "N0b0dy-Imp0rtant",
            "body": "His words matter “my house”, he doesn’t see it as a home and he doesn’t see it as “our home” which throws some serious alarm bells.\n\nAdd in the “he didn’t allow me” and other very controlling behaviors I would plan an exit strategy and view living there similar to a hotel experience and nothing more than a place to sleep until you can dump him and find a place to live.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Forsaken-Jury2466",
            "body": "\" I feel like I’m living in a borrowed space\" - because you are. There's nothing you can do to deal with it, because from what you've described, this feeling is valid. You don't pay rent, he's clear that it's only his house, not the house you both own, you're not an equal owner.",
            "score": 1,
            "replies": [
                {
                    "author": "boudicas_shield",
                    "body": "Then they should break up, and OP should move out. There's absolutely no point in being in a relationship and living with someone who cares so little for your comfort, opinions, and tastes that they won't even let you buy a kitchen spatula without giving you the third degree about it. What a miserable way to live. OP should get out now.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Forsaken-Jury2466",
                            "body": "I personally would also not agree to live like that, and that boyfriend seems to be quite obsessed with protecting his assets (nothing bad with protecting them in general, but he gives vibes of doing it too much). But we don't know if that's acceptable for the OP or not, people have different ways to live.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NamuhNoserp",
            "body": "I just want to say a big thank you to everyone. I am reading all the comments and making notes and asking myself questions about how I got here. I will ponder on all your suggestions and make a move(s) soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gingerlorax",
            "body": "This isn't a partnership, he doesn't see you as his life partner, he sees you as someone who he is allowing to live in his home. Also, being asked to defend why you made a purchase is controlling and gross if it's your money",
            "score": 1,
            "replies": []
        },
        {
            "author": "garbageTVaddict",
            "body": "It’s not your home, it’s his home and he never wants you to forget it or get too comfortable. This is a big red flag and maybe it’s time to take a step back",
            "score": 1,
            "replies": []
        },
        {
            "author": "HuaAnNi",
            "body": "Run. Break up with him and run. Things like this never get better, only worse. He’s controlling and dismissive toward you. He isn’t treating you like an equal he is building a life with. Listen to those alarm bells in your head.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ultraprismic",
            "body": "Looking at this from a financial perspective: If my partner wanted to protect his interests, I'd want to protect mine, too. I'd set aside what you were paying in rent before into a high-yield savings account or investment account so that you're building wealth at the same time as him. Figure out what you can contribute to groceries and other bills based on what's left over after that. If you do a prenup, hire your own separate lawyer to review it. \n\nFrom the perspective of decor and kitchen things... something big, like a rug or new appliance, I'd expect to at least text my husband about before buying it. But plants and picture frames and spices or whatever... I wouldn't want to live that way. Right now, you have fewer \"rights\" in the house than you would if you were renting a room from a stranger. You get half of one bedroom in a four-bedroom house. What are the other three rooms for? Let me guess: Bedroom, his office, his gaming space?\n\nHe views it as his house, not your shared space, and you are taking up his space and encroaching on it. Are you ok living like that? I wouldn't be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded_Gear622",
            "body": "I'd tell him to f*ck right off and go find an apartment for yourself where you can actually live the way you want.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sixdigitage",
            "body": "Are you his partner or something else? \n\nI recall a woman that I met once who was a daughter of a friend and she was married to this man they had three kids he would never allow her to buy anything unless he approved it. Plus, she was never ever allowed to buy feminine products. \nYou know, the monthly things that women generally need such as pads. \n\nShe was married to him, in her religion divorce was frowned upon. \n\nIf you decide to stay with this man, plan to get away from him. You need to build up your savings whatever is you need to do and then go through with it. Otherwise leave him and set yourself free now.\n\nHe will leave you financially destitute, he is leaving you emotionally and mentally destitute. \n\nWhat you describe as adding your personal touch spending your money to make some decorations, you are already questioning yourself about these things and doubting yourself. \n\nYou are more valuable than what this man is.\n\nYou have more rights in a trailer park than this man would give you in his house",
            "score": 1,
            "replies": []
        },
        {
            "author": "Parttimelooker",
            "body": "To me that sounds like he does want you to settle in or doesn't even want to settle in himself. Why did you move in? I don't think a relationship will last through this sort of thing personally. Might be better to move out and if he is ready to commit to a life together then you can move back in...or break up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "feelslikespaceagain",
            "body": "Why would you want to stay in a relationship with someone like this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConfusedAt63",
            "body": "So, you have to do all the compromising?  How is that going to work long term?  Perhaps you need to present him with a roommate agreement outlining what you are each responsible for down to who puts  the toilet paper on the holder.  If it is his house, what is your purpose in living there?  To be his bang maid?  What kind of security is he offering you?  What are you getting besides a cheaper place to dwell?  He is not treating you like you are a partner but a business associate.  Personally, I would dump someone that had this kind of mind set, wanting total control over anything beyond their own body.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glittering-Grape6028",
            "body": "He is treating you more like a child or a renter than a partner.  Eww",
            "score": 1,
            "replies": []
        },
        {
            "author": "Diograce",
            "body": "What can you do?  You can move back out. Seriously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AluminumOctopus",
            "body": "This doesn't feel like a partnership. You need to sit down and talk to him about what you want your future to look like, and what roles you see each of you filling in the future. Then decide if that's the life you want.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Writers_Write102",
            "body": "#Move the fuck out ASAP. \n\nHe's showing you exactly who he is. Believe him. Love doesn't look like this. If you stay and try and build a future with this guy, you will regret it. I'm sorry. I know that sucks, but it's the truth. Don't waste anymore of your life on him. He's not the one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WheresMyCrown",
            "body": ">\"You cannot just bring anything into my house.\"\n\nYou may live there, but he doesnt see it as your home. This is going to be how he will always be. Why would you want to live somewhere you have no input into?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Science4946",
            "body": "why do you want to marry a guy when it sounds like y’all are already planning divorce? not even referring to the prenup, but the way you talk about no rent…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kathrynlena",
            "body": "Well it IS his house and he’s made it pretty clear that you ARE just a guest in it. He’s not acting like he sees you as a partner or that he’s interested in building a life with you. If those are things you want, you need to talk to him about what he wants, and you need to be prepared to leave if/when ie doesn’t want the same things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SugarGlitterkiss",
            "body": "Why are you still with this clown?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jabby27",
            "body": "Why on your list of options is there not one suggestion by you to dump this selfish transactional jerk. Why would you want to build a life with someone who does not view you as an equal. Why would you want to live in a home you will never be allowed to make your own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "neosituation_unknown",
            "body": "You deal with this by sitting your partner down and having a heart to heart - explain that you **need** your home to feel homey. Explain that this situation is unacceptable to you and that a compromise is necessary.\n\nIf he refuses - then you know it is time to cut and run.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zuzian",
            "body": "My boyfriend owns his house and I don't contribute rent (I pay all animal expenses but considering 7 of our 9 animals are mine that's not covering a ton) He's never made me feel like a guest in his home or told me outright I can't do something. He appreciates me running things by him and would prefer to be involved/handle things to do with the house on his own, but so far he hasn't outright told me I can't do something. It's important for me to feel like the place I'm living is my home, too, and I'd definitely have to sit down and have a discussion with him if that wasn't the case. Even if you have to write down what you're feeling and read it to him, or have him read it, this is a discussion you MUST have and his reaction will tell you a lot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "brokenhousewife_",
            "body": "Considering he bought this home pre marriage, any likely claim on it by you would be difficult regardless (depending on where you're located). If you contributed to major renovations, you may be able to recoup some of that, not for cushions. \n\nHe is telling you this is HIS house, and it will always be HIS house.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elfich47",
            "body": "So he owns the house, and you’re squatting in it? Do you see thempower imbalance inherent in this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dangerous_Cherry_774",
            "body": "Honey, run before you are far too involved. How long have you two been together? Have you had any other discussions on marriage other than a prenup? Any man who wants to build a life WITH you, wouldn't be acting this way. He's clearly showing you how he will be, believe me it will only get worse from here if he's this controling about a space he SHARES with his partner. Honestly, the way he words things and acts towards you, he doesnt want to build a life with you. And for the love of god, do not have children with this man. Get out while you can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Verbenaplant",
            "body": "It’s a bit sus that ur not paying any rent. I’d say no it should be 50/50. for it all.  so he gets to pay for his house and not worry about bills. You end up with Jack crap but have paid everything else.\n\nhes being way to controlling for a propertie your meant to be sharing\n\nhe’s pissing over it all saying it’s his. This will never feel like a shared home.\n\nits got 4 bedrooms and he’s so lovely and has given you the clutter room full of his crap. That’s not a studio. That’s a storage cub. What’s wrong with the two other rooms. \n\nfeels like he’s enjoying using all his money he’s got to further his progress on buying the house while enjoying free bills, food and internet. Win win for him. \n\nyou can’t even buy or build or change anything without his iron clad control.\n\n  \nrun",
            "score": 1,
            "replies": []
        },
        {
            "author": "twinkiesnketchup",
            "body": "This is a huge red flag. You see it and we see it. You only have control over yourself. Is sharing a home, and feeling comfortable and safe in your home important enough for you to leave him? Only you can answer this. \n\nI can tell you my experience. My ex didn’t allow me to make any changes to the house. I wasn’t even allowed to put pictures on the walls (which were flat white paint.) I wasn’t allow to change where the utensils were in the kitchen, even though I did all the cooking and cleaning. Basically I felt like a guest in the house for 11 years. Kind of pathetic but I rolled with it, had 3 kids and he eventually divorced me because he wanted to spend more time with his mother. That’s probably unique but I do think the divorce rate is higher for couples who don’t share their home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PM_ME_YOUR_KALE",
            "body": "That sucks op, he’s telling you who he is. \n\nLegally it’s his house, you know this, he knows it, yet he’s still acting like he has to be on guard, lest you make a claim in the future that you’re entitled to part of it. All of this behavior is controlling and does not lend itself to confidence in the relationship. \n\nYou should tell him how this makes you feel. If he won’t change then you should understand that this only likely to get worse, not better, with marriage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dawn8554",
            "body": "Oof, how long were you together before you moved in? Very clear to me he doesn’t want to build a life with you but have you fit in to his life.\n\nFor reference, I moved in to my boyfriend’s house 2 years ago and the first thing he says is “move whatever you want change stuff, if you want to paint paint” etc I left for work one day right after moving in and he sends pictures of my art I painted put on the walls and I come home to my photos of me and my son on the walls. He WANTED me to know it was my home too and wanted me comfortable and he still pushes it anytime I seem iffy about taking initiative with stuff.\nAn actual partner will care that you feel at home in your home. It may be HIS house, but it is both of your home now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spaghettifiasco",
            "body": "He's already making plans for what he seems to view as an inevitable divorce, and he refuses to allow you to make any imprint of your presence on HIS precious house. \n\nWhy is he even in a relationship? Seriously, does he like you? Unless your decor taste is the peak of garishness, you furnish homes with things you've dumpster-dived for, or you're a literal actual hoarder, I can't imagine imposing such ironclad restrictions on someone I'm supposed to be sharing my life with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QNaima",
            "body": "You are a guest in a guest relationship.  The question is can you live with that?",
            "score": 1,
            "replies": []
        },
        {
            "author": "b3mark",
            "body": "You move out and move on. He can be in his place. Alone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Missingsocks77",
            "body": "I think you need to seriously consider how controlling he is being. I would never want to live somewhere that I could not make my own for a long period of time. Is it not your home too? It doesn't sound like it. It sounds like he just sees you as a piece of the furniture.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tallmattuk",
            "body": "move out; he's not ready to develop the relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blue-eagle-23",
            "body": "I would talk to him about how it makes you feel unsettled, unwanted, temporary, borrowed. I imagine this was a big investment for him and he’s proud that he has been able to purchase a home but a future together means BOTH (not just you, not just him) need to feel at home there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "caddy_heron2",
            "body": "My partner moved into my house that I own, and I have done a lot to make sure he feels like it is his home too. At some point we thought about buying a house together, just so it could feel like it was both of ours, but then we remembered how bad interest rates are now and decided just to stay at my place. But he's rearranged various rooms in the house and the garage, changed out some of my furniture for his, and taken other steps so that the home feels like it belongs to both of us. We are long term partners, and we both need to feel comfortable in our shared home. We make decisions together, but we also feel free to make our own decisions on smaller things.\n\n  \n We are invested in each other's happiness, and that plays out in how we manage our home. What you are describing makes me think your partner is only concerned about his own happiness, and doesn't care if you feel welcome or settled. He doesn't seem like a very good partner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Preebos",
            "body": "i (29f) own a home and my bf (29m) will be moving in with me this year.\n\nhe told me that if he's going to be living there and contributing financially, that he also wants to share in the equity of the house. so obviously i said of course and i will add his name to the title and mortgage! he's my partner, not my child or my tenant.\n\nand then when he does move in, i want him to make changes and decorate (with my input) so that he feels like it's *our* home, not mine. i want my partner to feel comfortable!\n\ni can't imagine telling my *partner* that they aren't allowed to make changes in the home we share. it honestly sounds like he sees you as something lesser than 😔\n\ni think you should tell him what you need in order to feel comfortable in your shared home. if he's not willing to make reasonable changes, then i would unfortunately consider ending the relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "procrastinating_b",
            "body": "I couldn't read it all but I get planning in case of a divorce but this dude is planning to divorce you (if you get that far)",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Missingsocks77",
                    "body": "She didn't say she wouldn't pay rent. She said he wouldn't let her because he needs to make sure she has no monetary claim to his house. He is a control freak. It is outrageous to think that a person cannot help decorate the home they live in with their partner.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}