{
    "title": "Toxic friendship that I can’t get out of",
    "author": "Odd-Investigator7476",
    "subreddit": "relationships",
    "rank": 10,
    "score": 3,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/relationships/comments/1jefr01/toxic_friendship_that_i_cant_get_out_of/",
    "id": "1jefr01",
    "selftext": "I’m in a friendship that I think might be toxic for the past year and a half. I’m single 42F, he’s a single 37M. \n\nI am attracted to him, and he’s admitted attraction to me at times, but he also struggles with his sexuality so I don’t feel comfortable trying to move past friendship when I think he’s still trying to figure that out. He’s also admitted being attracted to other people but no relationships with anyone in about 4 years.\n\nHe’s also admitted being a functional alcoholic. This is a big issue for me partially because I worry about him, but also because I have alcoholism in my family and I don’t want that in my relationship. Sometimes this makes it hard to even be friends because all he wants to do is go drink, or he doesn’t have “deep conversations” unless he’s been drinking.\n\nHe’s very up and down as well. I don’t always know what to expect and sometimes that makes it hard to count on him as a friend and he’s hurt me a good bit because of this. Everything tends to have to be convenient for or about him.\n\nI truly believe he’s a good person and I care about him. However, I feel like he completely deregulates my nervous system when I spend much time with him. I feel physically safe but for some reason, not psychologically safe. He would never purposely hurt me but he stresses me out so much sometimes because I don’t know what’s coming next. \n\nThe kicker… due to recent changes at work, we have to work together now. So I can’t just go no contact but I don’t know how to back away from him without hurting him. But if I don’t, he will continue to hurt me. What do I do?\n\nTL;DR A toxic friendship has developed and I don’t know how to handle it, especially now that we work together. \n",
    "comments": [
        {
            "author": "GoingPriceForHome",
            "body": "What unexpected things does he do that make you feel unsafe?",
            "score": 1,
            "replies": [
                {
                    "author": "Odd-Investigator7476",
                    "body": "He goes from being very sweet and loving to hot head and angry over the tiniest thing. I don’t even know what’s going to set it off. It’s really very unpredictable. It’s not always directed at me it’s just his reaction to things.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GoingPriceForHome",
                            "body": "Does he shout? Yell? Break things or throw things? Go off on long rants? \n\nYou seem like you're kinda trying to hold back talking about the details.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Odd-Investigator7476",
                                    "body": "I don’t really know what’s “details” to share. But yes he can get loud and has long rants. I haven’t seen him be violent or anything like that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GoingPriceForHome",
                                            "body": "Mmm, got it. \n\nI've got very little patience for drunk people these days. Tipsy or buzzed people, I can deal with, but someone who's gonna be a messy drunk and get mad like that, I'd sooner leave.\n\nAnd leaving that situation isn't bad, Hun. He can be a good person deep down like you said but just no be on a speed setting you can deal with at the moment. I had a neighbor who was quite nice. She was also addicted to crack.\n\nI'm not a bad person for not wanting to be around that. I just am not going to put myself in that situation.\n\nI think, at 42, it's time to tell him you can't hang out as much as you used to. You're a grown woman, and you can say hey I don't wanna be around alcohol or people who are drinking right now, it's just not for me. Hell, make yourself less available to be around him. Go out with some friends more often, get into a class, pick up a hobby to spend your time on. \n\nBe polite at work, but just stop hanging out with him outside of work.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}