{
    "title": "I'm 20M and my girlfriend is 19F",
    "author": "Global-Ad-4682",
    "subreddit": "relationships",
    "rank": 9,
    "score": 2,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/relationships/comments/1jekd5a/im_20m_and_my_girlfriend_is_19f/",
    "id": "1jekd5a",
    "selftext": "Throwaway as my girlfriend knows my main. \nLong read ahead, so I appreciate you taking out the time to give this a read, kindly don't be judgemental, if you want to say something along the lines of, it's just teenage drama, you're being insecure, just end it, you're karma farming, you're looking for attention kindly refrain from commenting. I genuinely want real advice and perspective. Thank you in advance!\n\nMe and girlfriend have been dating for 8 months,\nshe's the most perfect, loving, caring, empathetic understanding girl ever, we're each other's first serious relationship. I had one girlfriend before her and she had one boyfriend before me. I had never sexted, been intimate, kissed, hugged or even held hands with anyone. Me and my ex just used to say I love you to each other and never did anything more but it ended in in a grand total of 8 days, I've told my current girlfriend each and everything in the beginning only, I've left no detail out.\n\nShe has also been transparent with me for the most part, she'd told me that she had this 'friend' that she liked but he was only that a friend, a couple of months later we were talking about not being over exes and stuff (I wasn't over my ex and I clearly told her that) but she told me that she missed him and cried for him whilst we were together and she loved him (he left her only 2 months before me started dating, I didn't know about the timeline), things got kinda bad she told me she clicked a one on one picture with a guy that likes her and I found it very disrespectful, I ended the relationship but she pleaded and we got back together. This was 2 months ago. \n\nToday she tells me she used to sext her ex (she used to tell me that they barely even talked and e never called). Me being the naive fool I am had thought that she hadn't done anything with him. So It was a shocker for me and now I'm contemplating what should I do? Both my previous and her previous relationships were long distance, our current relationship is long distance too but we've met and kissed and done almost everything except sex, I feel betrayed and at a loss of agency as if I knew that she used to sext her ex I would'nt have dated her, it's not about why she did it it's about being honest and transparent with your partner. I just want a partner who has a similar experience as me in these things. \n\nShe's broken my trust a few times before (no infidelity just breaking the boundaries that we'd set), the relationship is amazing for the most part but these breaches of trust are worrying. \nI'm obviously not a perfect person in fact I'm far from perfect but throughout the entirety of our relationship she has never had to worry about any other girls as I don't even have any female friends (that's my personal choice and she has nothing to do with it). But there have been instances when she has defended her friend's actions, one friend gave her a massage and she said he didn't mean any harm despite her being uncomfortable during the massage, other friend said he'd 'smash' her and she was like he's like that with every girl, another friend asked her to show him around the city (it is a date in my books, you can't tell me otherwise) but later stood her up twice and her reaction was he was there for her before me and she couldn't stop talking to her and it wasn't a crime to have guy friends (after the massage and smash incidents I'd told her that I could only stay with her if she cut off all her guy friend and she promised she would) but she was occasionally taking to this \"he was there for me before you\" guy. This was 4 months ago. \n\nShe has been genuinely remorseful throughout and cut off all guy friends after the 4 months ago incident. \n\nWe've started over twice, as in forgotten and forgiven all the past mistakes, conflicts etc. \nShe's a very emotionally dependent person and I think it has to do with her being abandoned and cheated on by her ex and being abandoned by the \"friend\", so I don't want to hurt her but I've already looked past her mistakes a few times, so I don't know if I should/ could do it again. \n\nTldr: Conflicted about what to do, my girlfriend has broken my trust a few times and she's told me something about her past that was unbeknownst to me earlier.",
    "comments": [
        {
            "author": "lily_aurora03",
            "body": "Your writing is quite difficult to read because it's really messy, but if you are an inexperienced virgin and you want a virgin too, that's fine. You're allowed to have your own preferences/standards. But your obsession with her past and your desire to limit her contact as much as possible with the opposite gender is quite concerning. If you feel like you can't trust her, then you should reconsider this relationship and end it, because it seems like you are both suffering and participating in an unhealthy dynamic.\n\nAs a side note: unless you explicitly asked her about her past and she lied, there is nothing wrong with not wanting to disclose intimate information about your past \\*down to the last detail\\* and from the very start of the relationship. It was your choice to disclose your past experience to her from the start and she shouldn't have to feel pressured to do the same.",
            "score": 1,
            "replies": [
                {
                    "author": "SolarFlareSK",
                    "body": "Yes. I had to give up reading because of its messiness.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wikiist",
                            "body": "Yeah I'm almost 40 and this is way too trivial",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Global-Ad-4682",
                    "body": "ChatGpt Summary:\n\nThe post begins with the author using a throwaway account (since his girlfriend knows his main) and asking readers not to dismiss his concerns as mere teenage drama or attention-seeking; he sincerely seeks real advice and perspective.\n\nHe explains that he and his girlfriend have been together for eight months. Both are in their first serious relationship—even though each had one previous, very limited relationship (his being an 8‑day affair where they only expressed love verbally and she having a boyfriend before). The author, who had never engaged in any form of physical intimacy (sexting, kissing, hugging, or holding hands) before, was completely honest about his past from the very beginning.\n\nThe girlfriend, for the most part, has also been transparent. Initially, she mentioned having a “friend” she liked, insisting it was only platonic. Later, during a discussion about still being affected by past relationships (the author admitted he wasn’t over his ex), she revealed that she missed and even cried for her ex—whom she still loved—even though he had ended their relationship just two months before she started dating her current partner. Matters worsened when she admitted to having taken a one-on-one picture with a guy who likes her, an action she later apologized for and which had briefly caused the author to end the relationship before they reconciled two months ago.\n\nMore recently, she disclosed that she had sexted her ex—a revelation that shocked the author since she had previously claimed they barely communicated. Although their current long‑distance relationship has progressed to meeting, kissing, and nearly every form of intimacy except sex, the revelation left him feeling betrayed and questioning the value of honesty and transparency, as he desired a partner with similar experiences and boundaries as his own.\n\nHe also recounts that she has broken his trust on several occasions by overstepping previously agreed boundaries (though not through infidelity). While he acknowledges that the relationship is largely amazing, these repeated breaches are deeply worrisome.\n\nThe author notes that he is far from perfect, but throughout their relationship he has ensured she never had to worry about other girls by not maintaining any female friendships—this being a personal choice unrelated to her. However, he highlights instances where she defended inappropriate behavior by her male friends: one friend gave her a massage that made her uncomfortable yet she downplayed it; another friend boasted about “smashing” her as if it were normal; and yet another friend, who asked her to show him around the city (which he considers a date), later stood her up twice—after which she justified his actions by claiming he had been in her life before him and that having guy friends wasn’t inherently wrong. Following the massage and “smash” incidents, the author demanded she cut off all male friends, and although she promised to do so, she continued occasional communication with the friend from “before you.” This incident dates back four months.\n\nShe has since shown genuine remorse by cutting off all guy friends after that incident. Despite the challenges, the couple has attempted to “start over” twice—choosing to forget and forgive past mistakes and conflicts.\n\nIn conclusion, while the girlfriend’s emotional dependency may stem from previous abandonment and betrayal by both an ex and a friend, the author remains conflicted. He is torn between not wanting to hurt her and his inability to continually overlook the repeated breaches of trust, leaving him uncertain about the future of their relationship.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "danger_punk",
            "body": "You’re quite young so I’ll say this. No one was born and waited in a room for you to appear and scoop them up and press their Start button. She shared it with you because she’s comfortable being honest with you. You as a virgin wanna throw away a virgin of the same age because you’re insecure. You may be in for a surprise as to what people (girls in your case) have been doing since much younger and will never ever tell you. Break up instead of putting a young girl with no issues through yours.",
            "score": 1,
            "replies": [
                {
                    "author": "Global-Ad-4682",
                    "body": ">No one was born and waited in a room for you to appear and scoop them up and press their Start button.\n\nI completely agree but my opinion is that your future partner deserves to know everything about your past, it may just be me but that's how I think.\n\n>Break up instead of putting a young girl with no issues through yours.\n\nI don't appreciate you being impudent, I don't have any issues. And I'm not putting her through anything, she chooses to be with me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "wikiist",
            "body": "Too young to stress over these things.  Highly suggest breaking it off amicable and maybe try again another time.  It's amazing how much you're both going to learn in the next five years.",
            "score": 1,
            "replies": [
                {
                    "author": "Global-Ad-4682",
                    "body": "Thank you so much for your invaluable advice!\nI agree that we both have so much in life yet to uncover and unravel.\nThe problem with breaking up amicably is that it isn't possible, she's pretty dependant on me and a break up would hit her hard.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wikiist",
                            "body": "It absolutely doesn't get easier.   I've even broken up with partners that lived with me for a time until they can figure it out.  I know rent is expensive and sometimes living with family isn't a quick option.  But you need to be honest with yourself and if you can you should find a way to separate because it's only going to get worse",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KapnKookie",
            "body": "So if we use the same logic let's say you two end things after atleast kissing.  If you started to date someone that hadn't kissed before and then found out you've already been kissed should they hold that against you?  Probably not right?  People's past experiences dont matter.  Keep yourself grounded in the present so you can enjoy your shared future",
            "score": 1,
            "replies": [
                {
                    "author": "Global-Ad-4682",
                    "body": "My future partner could hold it against me if I don't tell her, which won't be the case. I have always been and will continue to be honest and transparent about my past.\n\n\n> People's past experiences dont matter. \n\nI beg to differ, past experiences are what make us who we are.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}