{
    "title": "My husband's daddy issues are cock blocking us!",
    "author": "Substantial-Bath-835",
    "subreddit": "relationships",
    "rank": 6,
    "score": 6,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/relationships/comments/1jekq6i/my_husbands_daddy_issues_are_cock_blocking_us/",
    "id": "1jekq6i",
    "selftext": "\n\nMy husband 31 M and  myself 29 F have been married for almost 5 years. As long as I've known him he's had a stressful relationship with his father. His dad is ex-military and wasn't around much when he was a kid. The times he was around he was constantly teaching him \"lessons\" about the \"real world\" these lessons included waking him in the middle of the night to clean a cup left in the sink or to properly get all the crumbs off the granite cabinet top by getting to eye level with the counter. These days their convos feature his dad often calling him incompetent or unintelligent. This is one of my husband's main insecurity when we met. He's now an awesome dad to 2 girls and provider making enough to support us on single income. Still his dad calls him incompetent. He wants his approval so bad I get it. \n\n\nHowever MY ISSUE IS, whenever I ask him to do something differently like put away clothes after folding laundry or clear sink from gross wet food after dishes he gets defensive, starts complaining about how he's never enough and avoids me the same way he would his dad.\n\n\nSolutions I've tried include:\nPutting him in therapy, he tends to avoid deeper issues say they're not relevant and talk about day-to-day stressors instead of the root of his issues. \n\nCouples counseling, usually ends up me bringing up the issues and have constantly feeling off guard causing him to constantly avoid the sessions or not prioritize them. \n\nSpeaking directly to his father about the way he talks to his son AKA my husband. He (his dad) told me I need to learn my place and stay in it lol. He also basically called me a gold digger to my face saying I ruined his son's chances at success by having kids \"early\" I was 26. My husband did not defend me of course, is it sad that I didn't even expect him to? \n\nCreating \"neutral\" PowerPoints on how to properly clean a sink. As well as doing these tasks with him to show him how to do them effectively. Both fell on deaf ears. He states that he does enough so he should have to do these things that I ask of him because of all he already does. \n\nFor the record he is an amazing father, and typically an amazing husband minus the infrequent intimacy (like monthly if that). \n\n\nOverall I think I just trigger his insecurities and daddy issues and I don't know what else to do I'm to the point where I'm just accepting this is the new normal but I don't want our daughters to grow up thinking this is normal. Is this normal?? Am I just a nag? I just feel so unheard having to continuously ask for things to be done completely or having to finish all these unfinished tasks all the time.\n\nAny advice would be helpful and please ask me any questions for added context!\n\nTL:DR:\nMy husband of 5 years hasn't gotten over his daddy issues and reacts to our relationship with the energy he should be giving his dad, that he refuses to confront even today. How do I stop triggering his insecurities and improve our intimacy when anytime I ask him to do a task differently he says \"I'm never good enough for you.\" Like I just want u to put the laundry away after folding 😤😮‍💨\n\nStill TLDR:\nHow can I get my husband to want to hit when I remind him of his daddy.",
    "comments": [
        {
            "author": "infinitysnake",
            "body": "I don't think your husband's dad is ghr source of the issues, here.  It sounds like you're in a relationship with a narcissist and you're looking for a 'root cause' to nlame his shit behavior on.\n\n\nHe knows how to clean a sink.  He's deliberately making it too much work for you so you'll leave him be and do it yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sophia_jpeg",
            "body": "Get the deck of cards called Fair Play, where you divide up chores/responsibilities and mutually decide on a standard for each of them. Tell them this has nothing to do with his father, and everything to do with his wife and kids. His father doesn’t live there, you four do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "meeps1142",
            "body": "\"Typically an amazing husband except for the infrequent intimacy\"...and not defending you against his shitty dad, not cleaning up after himself, not valuing you enough to put in the work to unlearn his unhealthy coping mechanisms, manipulating you instead of just doing the fucking dishes, saying that he does enough so he shouldn't have to clean, weaponized incompetence, etc.\n\n\nIf he actually felt bad about not being enough for you, he'd do the dishes or teach himself how to clean the sink. He doesn't do it because he doesn't value you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brotega87",
            "body": "Where is the cock block lol",
            "score": 1,
            "replies": [
                {
                    "author": "Substantial-Bath-835",
                    "body": "When I ask him to complete a chore he starts he says hes never good enough and is turned off by me since I remind him of his over bearing father who would also tell him to complete chores the difference is with his dad is he had unrealistic perfectionist standards.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EverettBromwich",
            "body": "Coming from a child of a 25 year drill Sargent… who got white glove room cleaning every Saturday, woken up to do dishes in the middle of the night, and had to be awake for 6am reveille every day… I know how growing up like this can effect you. I know all about the lessons about life, etc. \n\nIf he’s not willing to do the work on his own… The only solution IS therapy. And he’s gotta let that wall down with the therapist to allow them to help. Allow them to make him think about the past and how its effected his future. It’s the ONLY way.\n\nYou’re a sweet person for trying to hard on this subject but some methods of your approach (like the power point), would NOT work well with someone like this. You may have made him more resentful by doing that. Doing something like that makes people like us upset because obviously we are too incompetent to do something up to your standards. We have been told that our whole lives! Don’t do ANYTHING that makes him feel this way. He will build up resentment towards you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Due_Entertainment425",
            "body": "Is he successful at work? It sounds like you’re dead set about “fixing” him. He’s an amazing dad. Probably does well enough at work so why does everything else have to be your way? I can’t imagine anyone doing a PowerPoint about cleaning a sink.",
            "score": 1,
            "replies": [
                {
                    "author": "AdamG15",
                    "body": "Yeah a PowerPoint seems excessive and likely results in him feeling even further talked down to. \n\nHe needs some therapy, but she could be less overbearing in a lot of this too. I would also get annoyed if shown a Powerpoint of how to clean a sink. Its demeaning.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}