{
    "title": "Supernormal stimuli and the Oligarchs",
    "author": "IanTrader",
    "subreddit": "socialism",
    "rank": 397,
    "score": 18,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/socialism/comments/1ima41x/supernormal_stimuli_and_the_oligarchs/",
    "id": "1ima41x",
    "selftext": "[https://www.stuartmcmillen.com/comic/supernormal-stimuli/](https://www.stuartmcmillen.com/comic/supernormal-stimuli/)\n\nThis little comic explain a LOT regarding the Oligarchs today, not to mention the plague of rampant Obesity and diseases spread upon the proletariat by said billionaire class.\n\nFirst off there is no \"meritocracy\" in America as now they don't even hide the fact the system is 100% rigged and upward mobility has stalled and the top 3 oligarchs now control more wealth than the bottom half of the country.\n\nThere is of course a myth enforced by brought and controlled media and now social media of everyone wining that lottery ticket someday if you just work hard. But I believe Supernomal stimuli, a thing that wasn't discovered when Marx and Engels made their observations about perverse inequality, is responsible for the neverending cycle of unlimited greed of the few and unlimited misery unleashed on everyone else as a cost.\n\nWe need to recognize the psychology of Oligarchs as similar to functioning intra species predators WITH AN UNLIMITED THIRST FOR PREY, and even more similar to a cancer upon society.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}