{
    "title": "On the Shunning of Liberals",
    "author": "SupremeSoviet1917",
    "subreddit": "socialism",
    "rank": 285,
    "score": 386,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 57,
    "url": "https://www.reddit.com/r/socialism/comments/1iqnwfs/on_the_shunning_of_liberals/",
    "id": "1iqnwfs",
    "selftext": "I have noticed a lot of influencers, namely BadEmpaneda and Darknovia, calling for the Left to shun Liberals in the same way that we shun Fascists. That they are inherently part of the same issue. While I definitely see their point, I fear that this tendency may prove to be self-destructive.\n\nLiberalism, at its core, **is** a system that upholds and maintains capitalism, imperialism, and class oppression. Historically, liberals have been more than happy to betray socialists and revolutionaries—whether it was the German Social Democrats crushing the Spartacists, Roosevelt cozying up to corporate America after flirting with the New Deal, or the way Western liberals today enable war crimes in Palestine, Yemen, and beyond.\n\nBut outright **shunning** liberals, in the same way that we reject fascists, might be shortsighted. Unlike the far-right, many liberals are **not** fully conscious defenders of the ruling class. Instead, they’re victims of ideological conditioning. They **believe** in \"democracy,\" \"human rights,\" and \"progress,\" but they fail to see how those ideals are weaponized to serve imperialism. That means some liberals **can** be radicalized.\n\nSo instead of treating them as sworn enemies, it might be better to:\n\n1. **Expose their contradictions** – Push them to see how their values clash with their policies (e.g., \"You support human rights? Then why do you back Biden when he arms genocidal regimes?\")\n2. **Provide a real alternative** – Show them that socialism isn’t just about \"being angry\" but actually building a world that **genuinely** upholds equality, justice, and peace.\n3. **Distinguish between naive liberals and ruling-class liberals** – The **working-class** liberal can be reasoned with. The corporate, NGO-backed, or political elite liberals **are** enemies.\n\nThe far-right **wants** us to shun liberals completely because it helps drive them into reaction. If we refuse to engage with them, they’ll either stay in their bubble or drift toward the right. But if we meet them where they are and push them leftward, we weaken liberalism **and** build socialist consciousness at the same time.",
    "comments": [
        {
            "author": "ThatFireDude",
            "body": "This entire discourse is a result of how atomized the so-called left is in much of the Western world in the first place.\n\nThe way you personally interact with liberals is basically irrelevant. You won't convince anyone outside of your personal circle unless you have a massive platform that functions as mass media. I assume you don't have that, nor 99% of the people on here. \n\nThe way to capture liberals is by organizing working-class people, and it really doesn't matter what the specific flavor of bourgeois politics they prefer is, because you should organize them around their concrete material interests (for example in a union, in limited strike action, in political action with a tie to their concrete interests). \n\nOf course, you won't do that on your own. Nobody does that. That is what the vanguard party is for and its long-term transition toward a mass party.\n\nPeople need to stop conceiving of politics as a battle of ideas. We are Marxists, and as Marxists, we know that the base supercedes the superstructure. Progressive politics often associated with liberalism aren't born of superior ideas people have somehow acquired, they are a result of their relation to their social environment. To assume (mostly condescending) conversations will make a meaningful difference in that conception, especially for organizing political movements in the real world, is absurd. In fact, that is the sort of idealism liberals are driven by.\n\nLearn what people in your community want, analyze why they can't get it and how it relates to their position in the relations of production, and then organize a party around the struggle for those goals, as part of a larger struggle to organize them into the mass party.",
            "score": 282,
            "replies": [
                {
                    "author": "Marionberry_Bellini",
                    "body": "Jesus I was gonna write a whole post but you basically paragraph by paragraph said all I had to add.\n\nThis individualistic approach of “I’m doing revolutionary politics by not talking to my uncle at Thanksgiving because he supports Genocide Joe” shows how impotent the socialist left really is.  No amount of shunning your working class neighbor for not having read Marx is going to help build socialism and the thought that *this* is the important battlefield reflects an incredibly anti-materialist understanding of the world.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "ThatFireDude",
                            "body": "Absolutely, but to be clear: The same thing goes the other way around.\n\nNo amount of really empathetic conversations with your liberal uncle or your republican neighbor is gonna do anything for building a working-class party. There is a destructive tendency in the Western left in particular to frame personal empathy as some political praxis when in reality it's just... being social.\n\nYou do not organize your community by being extra nice to them. You organize the working-class in your community around the struggle for their concrete interests, which you learn by engaging with them in the first place. Maoists can call that the mass line if they want to, but it is the core principle of any revolutionary communist organisation.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "SupremeSoviet1917",
                            "body": "Honestly, you summed up my thoughts perfectly.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Minitrewdat",
                    "body": "Great answer. Organization is the only way forward!",
                    "score": 45,
                    "replies": []
                },
                {
                    "author": "Abyssal_Aplomb",
                    "body": "> To assume (mostly condescending) conversations will make a meaningful difference in that conception, especially for organizing political movements in the real world, is absurd. In fact, that is the sort of idealism liberals are driven by.\n\nBingo. Idealism is a trap that will burn you out.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "WishNo8466",
                    "body": "Saving this. Good stuff, dude (or I suppose good stuff, ThatFireDude).",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Short_Explanation_97",
                    "body": "wow, well said, comrade.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Very well said. I keep thinking that individual interactions don't matter much at this stage. What happens now is up to a sort of fluid dynamics of 330 million people.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "anticomet",
            "body": "My main issue with liberals is that as long as they're not personally affected then most of them are perfectly happy to support fascist governments. I don't have the energy to interact with people who are fine with fascism as long as there's no public seig heils being thrown around.",
            "score": 76,
            "replies": [
                {
                    "author": "TwoLaoTou",
                    "body": "Your time will be better spent joining an org and building something real to point them to. Unless that is accomplished, you are selling them a dream. I recommend PSL. Been seeing them do good stuff lately.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "the_G8",
                    "body": "In the USA at least, we’re at a point in history when many more people will be personally affected by the open and clear actions of oligarchs.  This should be a great time to make the point that if you’re not in the 1% then you don’t matter.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "oldRoyalsleepy",
                    "body": "Saying that liberals support fascism as long as they are not personally affected is a stretch. Liberals support the corporatist stays quo - yes. Always.  Because most liberals are educated and have wealth and they benefit from the corporatist capitalist system. \n\nThat doesn't mean they *support* fascism. They ignore its signs all around until the fascists do something that affects them. Liberals are in the head in the sand phase right now. Some will come out of it with help, others will double down on the status quo and even accept the fascist changes to the system, until they can't anymore, or they join the fascists. Most are in the head in the sand phase right now. \n\nHow to get reachable liberals to pull their f'ing heads out of the sand? That is the question.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "ryuch1",
            "body": "We should 100% shame radlibs\nRegular libs should be radicalised though",
            "score": 10,
            "replies": [
                {
                    "author": "Dazzling-Screen-2479",
                    "body": "You shouldn't have to shame them. You organize in ways that make them get in line. Example. In occupy oakland, marxists and anarchists organized outside of the general assembly to push the general assembly in a radical direction. They did so in the shadows away from the eyes of liberals. They pushed to vote to ban police, and pro police groups from the movement, campaigned underneath the liberals noses and got more votes than them. This left radlibs in a position where the anarchists and marxists held more power than their ngos in the movement. Not going to lie, it transfered into physical clashes.. the liberals didn't simply fall in line they tried to expel anarchists from the movement, unsuccessfully. \n\nThe anarchists and marxists getting the assembly to vote yes on diversity of tactics, and renaming occupy oakland to oakland commune was the final blow that sent liberalism to the backseat. When this occured the local mainstream media began releasing articles such as \"are anarchists hijacking occupy?\" (Despite the fact that the og movement in nyc was organized by anarchists and marxists in a popular front looking to have mass appeal). Understand radical liberal NGOs are a form of bourgeois control used to co-opt, and suppress potential struggle.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ryuch1",
                            "body": "Well once the liberals have taken a backseat we should shame them out of being liberals",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Dazzling-Screen-2479",
                                    "body": "True. The biggest task in America is shaming the white supremacy and allegiences to white supremacy people hold. This Is in my opinion the KEY failure of liberalism. Shame them for this and the rest falls into line. White supremacy isn't always something as open as a bald head and a sieg heil. It's often a network of power and privilege that exists within the DNC, or peoples support for global markets built on colonial theft and wealth extraction of the black n brown. Shame liberals from this position with this intent. Let them know that anti racism is beyond emotional reaction to hate, it's a struggle against colonial structures and the power and privilege even white workers hold.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SupremeSoviet1917",
                    "body": "Yeah, that's fair honestly.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "digitalhawkeye",
            "body": "Radicalize them.  Should be getting easier as shit gets worse.  But also be careful because until we're sure they're in solidarity with us, they are walking security liabilities.",
            "score": 7,
            "replies": []
        },
        {
            "author": "edeangel84",
            "body": "Progressives can be converted. Liberals are definitely more of a problem. Having said that, there are enough fascists and enough inept fools blindly going along with them to oppose that taking on liberals along with them is a massive mistake. The approach is everyone vs fascism.",
            "score": 10,
            "replies": [
                {
                    "author": "SupremeSoviet1917",
                    "body": "That's basically my stance on the matter",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dazzling-Screen-2479",
            "body": "People are individuals. There's plenty of self described marxists or anarchists who hold liberal opinions and perspectives, but have a surface level appeal to an idea like anarchism or Marxism. Meet people based on their needs, abilities, and limitations. Theres plenty of people who hold no political affilations but would agree with praxis that is based around their needs. Organize around class interest not idealogy",
            "score": 4,
            "replies": [
                {
                    "author": "SupremeSoviet1917",
                    "body": "\"Befriend reactionaries and lead them forward\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThePurpleKnightmare",
            "body": "Some liberals are worse than others. I'm not well informed on youtube/twitch internet drama or anything, but I'm a little familiar with 2 content creators atm. I used to watch H3H3 when he was making fun of Youtube Pranksters like \"Ethan Bradbury\" but I stopped watching him pretty quick because he's fairly misogynistic. I have more recently been watching Hasan stuff.\n\nThese 2 have \"beef\" Hasan is a leftist that opposes Israels horrid actions in Gaza, but he's being attacked by H3H3 over stuff this guy only just recently learned about. Hasan had spoken to H3H3 not long ago at a time when H3H3 basically had no knowledge of politics, especially on the scale of global conflicts. Yet here he is, this uninformed baby, got a taste of the situation and now has his opinions all fully formed about how Hasan is an anti-Semite and supports terrorism because of his stance on the war in Gaza.\n\nThe issue here, is that H3H3's arguments against Hasan, are really just poisoning his (presumably liberal) viewers views about left wing politics. If he's allowed to keep going as he is, a lot of his remaining fanbase, as well as possibly himself, might end up going down a right wing rabbit-hole that tricks them into a set of beliefs they probably wouldn't have otherwise had.\n\nIt's harder to remain a centrist, than it is to be far left or far right. Most liberals probably become leftists long term, but with people like H3H3 doing what they are doing, trying to de-platform a leftist content creator, they are being pushed right wing, and they're not immune to this brainwashing.\n\nSo should we shun H3H3? I kind of think so. It's a terrible idea to fight amongst ourselves, but also gotta be willing to cut off infected parts before they infect more parts of the whole.\n\nIdeally we educate H3H3 and we're all good again. However if we can't do that we have to do what is best for our goals and some think that is cutting off infected bits.\n\nI use this isolated situation, but I think it's a good example of how we might be approaching the topic as a whole. \n\nThings also get muddied further if you're Canadian, we have this idea that a liberal is a left of center centrist. However the Canadian Liberal Party is a right of center centrist party, that has \"left wing social values\". They are still for the billionaires/corporations though. They muddy our political system, and divide the vote, taking people who should be voting NDP, and instead redirecting those votes into a second  right wing party. Yet they still get labeled as \"The left coalition\" by the uninformed.",
            "score": 5,
            "replies": [
                {
                    "author": "SupremeSoviet1917",
                    "body": "Yeah, this is pretty spot on. Some Liberals are more hawkish than others.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "thePracix",
            "body": "The key problem is liberals material relations is closer to the fascists so they will align with fascists before anything actual leftist.\n\nLiberals are fascists enablers, and American granted privileges are more important to them than understanding class and material dynamics. They are protectors of capital, and it comes from reactionary minded base of thought.\n\nLiberals aren't \"confused college kids.\" They are benefactors of capitalism and side with fascists because its in their material relations to do so. Liberals aren't going to awake in their beds one day and start reading marxist theory because their paycheck is too small. Its an inheritantly right-wing ideology, and they will sooner ally against you than become class concious.\n\nLiberals are against you, not confused allies. Just because it's no skin off their back to virtue signal against culturally right-wing narratives doesn't mean they need a little education to finally ally with socialists. History has always taught us liberals are against us.",
            "score": 23,
            "replies": [
                {
                    "author": "SupremeSoviet1917",
                    "body": "I'm not sure it's that simple. I (sadly) know full-blown Libertarians who watch Piers Morgan who live in Council Flats. Some of the most exploited people in Scotland have been manipulated by the media into thinking that maybe they could be billionaires too, even though they can't.\n\nI think what you're saying applies to Liberals in the Middle Class, rather than Working Class Liberals, which are quite commonplace in most of the world.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "OnoALT",
            "body": "Does Bad still only make videos about that loser from H3?  I had to unsubscribe him after a few weeks, but I hope he’s back in shape.",
            "score": 7,
            "replies": [
                {
                    "author": "Mt_Incorporated",
                    "body": "H3 is primarily targeting Hasan and his Hasans mother rn. So bad empanadas has the chance to make other videos rn. Anyhow I hate H3 so much.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "R0botWoof",
            "body": "Well stated. I agree strongly though I have found liberals to be very stubborn in their support of capital and imperialism.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Inside_Ship_1390",
            "body": "There's really just one idea I want to impress upon liberals and everyone else: we have a choice between economic democracy or economic domination. Economic democracy, aka socialism, means limits and prohibitions on wealth and property, and hence power. It's also necessary in order to make a reality out of political democracy. That's our choice. Either people share the planet or the rich will own it and charge us rent to exist.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bittersweetslug",
            "body": "Shunning liberals is pointless, the left needs to look inwards, organize and appeal to the workers through direct action. Shunning anyone won't convince anyone to support a socialist movement like fighting for workers rights will",
            "score": 2,
            "replies": []
        },
        {
            "author": "Solarpunk28",
            "body": "Honestly this is how I feel, up to a certain point. Today I went to one of the President's Day rallies in my state and it was ran by the most insufferable liberals imaginable. It was about a judge taking away votes at the behest of the Republicans and while you should always oppose right-wing authoritarian shenanigans the liberals there (ACLU and others) \\*STILL\\* blathered on about compromise. Hell they even brought a former member of ICE on the stage to talk about her vote being taken away. Once they said \"we should find common ground\" with the GOP I just left the protest (if you could call it that). I get that the Democrats are a bourgeois party who ultimately serve the ruling class but holy hell are you even going to \\*attempt\\* to oppose the actual far-right dictator and his movement? Rank and file liberals I could \\*maybe\\* work with them if they're willing to listen, but convincing those like the Democratic Party leadership? At this point they're not much better than MAGA and are blind bad-faith institutionalists ignoring the working class & the disenfranchised as a whole and are actively feeding reactionary narratives.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PiscesAnemoia",
            "body": "I disagree in part. I believe, and I think this kind of what you were getting at, that it depends on the liberal.\n\n1. Are they working class?\n\n2. Are they brainwashed?\n\n3. Do they want to learn?\n\nIf those three criteria are met, I am willing to talk to them. However, all other liberals SHOULD rightfully be shunned.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Any working class liberals at this moment in time, during a recession in the US, are bootlickers. I’m sorry. I hope they come to the realization that liberalism isn’t serving them sooner than later. \n\nAlso, liberals are generally aligned with fascism more than they would ever admit. I think they should be shunned for their abhorrent vote shaming on the Palestinian people. Stuff like that is unforgivable.",
            "score": 4,
            "replies": []
        },
        {
            "author": "BoomBoomPow789",
            "body": "We have been too tolerant of liberals and fascists for the last 30 years.",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "Liberals and fascists? At this point they’re mutually exclusive.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "BoomBoomPow789",
                            "body": "The rhetoric is very different but the material outcomes are the same.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "The rhetoric isn’t really that different, it’s just that liberal rhetoric is euphemistic whereas conservative rhetoric is belligerently blatant.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "BoomBoomPow789",
                                            "body": "Yeah... \"Euphemistic rhetoric\" is very different from \"belligerently blatant rhetoric\"... I don't know what you are getting at",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "1. Thanks for the downvote\n\n2. “What I’m getting at” is that euphemisms are simply more *acceptable* ways of saying something awful. How is that any better than conservative rhetoric if the base is the same except for the fact that they just made it *appear* acceptable? Sugar coating their words doesn’t change the meaning.\n \n\nEdit: holy shit lol. Blocked. Cannot converse with someone like this. You don’t like the fact that I challenged you, so you’re asking me if I understand what “rhetoric means”, is that a joke?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "BoomBoomPow789",
                                                            "body": "We are talking about rhetoric not meaning. What do think the word rhetoric means?\n\n\nI said that their rhetoric is very different but the material outcomes are the same.\n\nDo you actually understand what this means or are you just being pretentious and reactionary?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "blodo_",
                    "body": "> but I’ll admit the idea of being told where I can live, in what kind of housing, what kind of job I can have, being told what I can think and knowing what I am being told is filtered, etc. is a frightening thought and I don’t think many are willing to trade loss of control for satisfying their basic needs.\n\nWorth saying that that is not what a planned economy is, this description is closer to what capitalist propaganda wants you to believe a planned economy is. There is a difference between \"private property\" (e.g. the land/capital you \"own\") and \"personal property\" (e.g. your house, clothes, tv, computer), and this difference is very much considered within both theory and actually existing socialism. Some quick points to fire off in the service of education:\n\n1. Walmart practices a planned economy internally. Planned economies exist the world over right now in the form of many private enterprises, but the capital owners resist them being adopted by governments because of the obvious consequences it will have for them having exclusive access to what they consider \"their\" capital. The reasoning for this resistance is simple: a state planned economy democratises the economy, as a modern state (yes, even a non democratic one) has to be more accountable to its people than a private company. The fight is about control of resources and capital, and the capital owners stand on the side of their own dictatorial control over the economy. Read \"The People's Republic of Walmart\", it is a great read that discusses this point in detail.\n2. The best antidote to the propaganda of \"the state controls your life\" is to look at the rates of home ownership in post USSR countries (e.g. countries in which the majority of homes were built under a planned economy), and compare them to the rates of home ownership in the USA. I'll leave that one to you to look up, but it's an enlightening point about the so called \"lack of choice\" and \"lack of personal control\" argument. Similarly: in China in 2022 the home ownership rate was 96%, vs. the USA's 66% in 2024. Feel free to look it up.\n3. Similarly, no actually existing socialist state has ever \"ordered\" anyone who was not already a convicted criminal in the eyes of the law to go to work at some particular place of work. Rather, much like in modern capitalist economies, the overwhelming majority all applied for workplaces as you'd expect. When the state planned to expand some type of industry, it incentivised people to switch professions through retraining opportunities, better wages, and other such perks. The difference was that the state was ideologically committed to full employment, so if a certain industry was not expanding \"fast enough\" it just meant the perks needed to be improved.\n\nThe difference between socialism and capitalism is not \"in socialism the state tells you what to do\", but rather \"in socialism you are a co-owner of your workplace\". A good way to describe it for newbies: if a planned economy is the whole government organising itself like Walmart already does, then socialism is reorganising that economy into a democratically controlled cooperative. A planned economy can be planned dictatorially, but socialists insist on it being planned democratically, and this last point is what is most often missing from bad faith arguments against economic planning.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "_lvlsd",
                            "body": "no point responding, any opinions expressed by that user are banned in this subreddit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lumine2669",
                    "body": "I would advise you to follow a basic reading list (there’s a list by hakim on yt) because a lot of these issues were actually faced by the bolsheviks and Marx & Engels. I started with “principles of communism” by Engels and it helped me with the ground work.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Onianimeman17",
            "body": "We already shun liberals as the center right grouping they are",
            "score": 1,
            "replies": []
        },
        {
            "author": "Playful-Goat3779",
            "body": "This community is wasting time dividing the left instead of organizing against fascism. \n\nHave fun with your 6 upvotes or whatever.",
            "score": -20,
            "replies": [
                {
                    "author": "SupremeSoviet1917",
                    "body": "That's...kind of the point I was making?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "OnoALT",
                            "body": "He didn’t read it, for sure",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "maghau",
                    "body": "Liberals are right-wingers.",
                    "score": 16,
                    "replies": []
                }
            ]
        }
    ]
}