{
    "title": "Anyone else tired of the West blaming Trump’s behaviour solely on Russia?",
    "author": "FutureEyeDoctor",
    "subreddit": "socialism",
    "rank": 74,
    "score": 400,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 111,
    "url": "https://www.reddit.com/r/socialism/comments/1j0hgkr/anyone_else_tired_of_the_west_blaming_trumps/",
    "id": "1j0hgkr",
    "selftext": "Every single Reddit/Twitter/Bluesky post I read about the recent developments between Zelensky and Trump are saying that Trump is behaving this way ONLY because of Russian interference. They are shifting the blame fully on Russia, as if the US government is incapable of acting irrationally. I am not trying to minimise Russian aggression or its imperialistic motives and the plight on the Ukrainian working class. What I am saying is that I feel like libs are incapable of accepting accountability for their country and essentially blame Russia alone. Maybe, just maybe, the US and its govt have never been the good guys? ",
    "comments": [
        {
            "author": "AmitabhaStyle",
            "body": "As maybe the greatest leader of all time, Barack Obama, once eloquently put it, \"We don't look backwards, we look forward.\" Why would the shining city on the hill and the indispensable nation have a need for reflection and analysis of past actions or policies? We may make mistakes, but that doesn't define who we are as a people or a nation. What defines us is our commitment to life, liberty, and the pursuit of happiness. Trump is committed to Russian supremacy and is a meanie, but once he is out of office and Mayor Pete or Gavin Newsom takes over, we will begin to heal and achieve unity by embracing our sacred principles once more. Simply put, you're being silly...keep calm and carry on in trusting Team Blue no matter what /s",
            "score": 104,
            "replies": [
                {
                    "author": "FutureEyeDoctor",
                    "body": "I almost had a heart attack before I got to the end.",
                    "score": 75,
                    "replies": [
                        {
                            "author": "AmitabhaStyle",
                            "body": "Hahaha sorry...the terrifying thing, though, is that there are millions of American liberals who basically believe this utter BS",
                            "score": 40,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Big-Teach-5594",
                    "body": "You do know this is a socialism sub, right???",
                    "score": 0,
                    "replies": [
                        {
                            "author": "-hardselius-",
                            "body": "That /s at the end means sarcasm.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "Big-Teach-5594",
                                    "body": "oh yeah i dindt notice that sorry mate! Illl add this to the tremdous list of fuck ups form me this week.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "tatersdabomb",
                                            "body": "Hey you’re not a fuck up even if you fuck up",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "hdholme",
                                                    "body": "Does... does this count as literally shutting the fuck up?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Infamous-Associate65",
            "body": "Wait, when has the USA government been the good guys? Maybe WW II, but the Soviet Union did more to defeat the Nazis",
            "score": 135,
            "replies": [
                {
                    "author": "someonestopholden",
                    "body": "They were the good guy by geopolitical happenstance. In no way, shape or form was the US fighting an ideological war against fascism in WWII.",
                    "score": 56,
                    "replies": [
                        {
                            "author": "FutureEyeDoctor",
                            "body": "Especially considering how they employed literal nazis in the NATO and NASA after the war ended.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "someonestopholden",
                                    "body": "\"But muh rocket scientists!!!\"\n\nDon't tell the libs the entire space race was an exercise in ICBM development. Why do you think it ended when both parties were deploying missiles capable of hitting every major population center in the opposing nation?",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "Velocity-5348",
                                    "body": "And the nice fellows from Unit 731.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "letsgeditmedia",
                            "body": "They only got involved because they didn’t want to lose territory in Northern Africa, and most of their manufacturing  plants like Michellin, ford, etc , were either taken over by the soviets or destroyed, thus threatening us imperial capacity post ww2. Ultimately they fought to protect their ability to expand and maintain control over whatever was left of Europe at the time. Hence the development of nato, hence the hiring of former Nazis into nato , hence the entire existence of nato to “defend against the threat of communist expansion in Europe”",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Infamous-Associate65",
                            "body": "More worried about the USSR than Third Reich",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Tascalde",
                            "body": "Nope, they never were, they saw which side would have won then entered the war. They just started to help into the war effort after the battle of Stalingrad had ended and it was starting to get clear that the USSR would end up winning the war.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FutureEyeDoctor",
                    "body": "Trust me, I never thought of the US as the good guys. Unfortunately this does not apply to the Global North.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "Infamous-Associate65",
                            "body": "💯 comrade",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "Engelswings",
                            "body": "The reticence here to acknowledge that historic achievements against despotism jave been achieved by western governments (on the back of worling folks blood obviously) is silly.\n\nDefeating fascism, whether you're a lib, Conservative or a centrist is an objective good.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "BoredLegionnaire",
                                    "body": "But what about my Western supremacy and conqueror identity!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Outrageous_Can_6581",
                    "body": "Oh shit. You really don’t know your WWII history. We made so much 💸 on that shit by ignoring the death toll.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Infamous-Associate65",
                            "body": "I did use the word \"maybe\", I know that the 🇺🇸 knew about the Holocaust early on",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PFCWilliamLHudson",
                    "body": "As a former history teacher I can assure you we never have been",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "robbberrrtttt",
                    "body": "The US did a great deal to defeat imperialist Japan, I would say they carried that. It would be hard to argue the people’s liberation army did more",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jarvjamz",
            "body": "10000% Liberals are so desperate to make excuses for the American ruling class.",
            "score": 82,
            "replies": [
                {
                    "author": "Signal_Career_7751",
                    "body": "genuine question, i’m not well versed in geopolitical stuff - why would ukraine going to russia be in the interest of the u.s. ruling class?\n\nbut i agree, they are equally to blame for trump and this garbage fire we find ourselves in",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jarvjamz",
                            "body": "I'm not terribly well versed either but the major thing is that Ukraine has a ton of farm land that is now 70% in the hands of oligarchs and Western European/American companies. \n\nAlso, Trump demanding the money back from Ukrainians is shitty but it's also just saying the quiet part loudly in terms of what the Democrats had planned for the country was all along. The cost of the war was always going to be used as leverage against them. These loans are the engine of western colonization.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Signal_Career_7751",
                                    "body": "so it was always a choice between either ukraine ‘belongs’ to russia or the u.s.\n\nit’s just that russia would do it militarily and the u.s. would do it economically.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "jarvjamz",
                                            "body": "Yes, I think it's fair to say there are imperial aspirations on both sides. But I also think Russia has a right to be defensive about the US/NATO putting bases on their border. I think a lotta folks here would point out that it's fairly hypocrisy of the West to talk about invasion while they're surrounding them with military bases.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "StumpsOfTree",
                                                    "body": "I think that the US should pull essentiall all their military bases, from Europe, the Middle East, Asia, etc. And Russia has as much right as any other country to critcize the US for their military bases.\n\nBut Russia invading Ukraine is not being \"defensive\" about that, it's just wanting to take America's place",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "jarvjamz",
                                                            "body": "Well wait - it is definitively defensive.  They invaded Ukraine after NATO expanded into Ukraine.  If they hadn't expanded NATO and Russia had invaded anyway you could say that.  But given what's transpired any other conclusion is speculative.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "StumpsOfTree",
                                                                    "body": "First of all Ukraine isn't a part of NATO so it has not expanded into Ukraine in any literal sense. But also that would mean Russia would have been justified in invading Turkey or Norway this whole time, as they both have been part of NATO since early on and border russia, on sea in the case of Turkey. No Soviet or Russian head of state has invaded them in all that time despite being far more egrigious then Ukraine (Turkey even held US nukes during the Cold War). Unfortuntely, since the Russian invasion, Finland and Sweden now have joined NATO, meaning Putin only helped NATO imperialists w/ his imperialist war. What's being lost is a bloc that is for peace, diplomacy, non-alignment, global collaberation etc. All the things needed to survive this century\n\nIt's true that Ukraine wants to join NATO, but they have not been accepted into it. Also even there the Russian government is partialy to blame for moving public opinion towards NATO. In Ukraine there was strong opposition to joining NATO befor the war, 35% of Ukrainians opposed joining NATO in August 2021. 2 years later and that number goes down to 5%. So if anti-NATO was Putin's goal (when I watched his interview with Tucker Carlson it seemed less about NATO and more crude right wing nationalism but for the sake of argument I'll take your word for it), he has enormously failed at achieving that goal.\n\nSecond, if Mexico formed a military alliance with Russia, and Russia built military bases in Mexico, would the US then be justified in invading Mexico? I would consider it a blatent act of imperial agression, just like the Bay of Pigs & US occupaiton of Guatanimo Bay or the brief US invasion of Mexico during the Mexican Revolution were. If we accept your logic, then these are all just the US excercizing its defensive rights in its sphere of influence.\n\nThird, even if it was defensive, that still means that we should oppose the war. I'm Canadian, if the US tomorrow invaded Canada, Canada would still be an imperialist country and Trudeau would still be a the head of a capitalist state. We should look up to and show solidarity with people like Russian Marxist Boris Kagarlitsky who is currently serving 5 years in prison for opposing the war. As well as people like Ukranian Socialist Volodymyr Ishchenko who has spoken out against both the war/invasion, and against Ukranian nationalism, and exposed both Russian and Ukranoian nationalism and the ruling classes that benefit from it.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jarvjamz",
                                                                            "body": "Ton of useful info here. Appreciate the thorough breakdown. I don't mean to argue that Russia's completely justified but more that after several rounds of expansion East by NATO there would be an accumulative effect and it would be more understandable that Putin/Russia would respond regardless of whether it is politically advantageous.\n\nSimilarly - I'm not saying the US would be justified in invading Mexico in my theoretical example but we do have an historic example and when Russia put missiles in Cuba the US response was very nearly apocalyptic. \n\nI understand that trying to provide context for Russia's invasion does nothing for the socialist movement - it's just that Western destabilization of foreign regions in the name of capital is so destructive and subsequently under reported - it's hard not to.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "StumpsOfTree",
                                                                                    "body": "Yeah I mean I think some sort of security agreement for peace between Russia and the rest of Europe, involving US exit, and security gurentees for Ukraine, maybe UN ran referrendums in disputed tarritories, should've been made, and could've perhaps prevented this awful war. \n\n  \nAnd yeah the US response to Russian missiles in Cuba (in response to the US doing the same thing in Turkey essentially) was probably the closest we've come to extinction. Interesting part there too is kennedy and Khrushchev totally went over Cuba's head in their negotiations about the missiles afterwards, which really pissed off Fidel. \n\n  \nI do think we should be skeptical about mainstream media's coverage of all this, we should all be hoping for peace, and ofc many governments/people are using all this as pretext to expand the military industrial complex. Sadly seems like we're gonna be seeing a lot less spocial spending and more military spending the next several years.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "jarvjamz",
                                            "body": "Update - this has a good breakdown of how Russia doesn't really have the need or resources for imperial aspirations: [https://youtu.be/fhajzlhcgSk?si=uxyqHQuCi3O4t8TZ](https://youtu.be/fhajzlhcgSk?si=uxyqHQuCi3O4t8TZ)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "exactly",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "FernandoMachado",
            "body": "the world is shifting from a **superimperialist order** (where the USA determined the scope and format of other country's subimperialist practices through organisms like OTAN, European Union, IMF, World Bank) to a **interimperialist order** (where the imperialist nations of the world will eventually collide with one other another's imperialist and expansionist interests - what the capital needs in times of crises)\n\nthis is a very big shift from the state of imperalist hegemony the USA conquered in 1945 and further deepened in 1990.\n\nin 2025, it's starting to feel like it's going to be each to their own and the \"the west\" (Europe) is in panic because they didn't see this coming and are lagging way behind to start standing on their own.",
            "score": 52,
            "replies": [
                {
                    "author": "FutureEyeDoctor",
                    "body": "reading this feels like a breath of fresh air, like my sanity is restored. I have been feeling like I am slowly losing my mind, like noone else understands my point of view.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "FernandoMachado",
                            "body": "\"camarada\" 🫂 \n\nthere's a lot of information going on and sometimes it can be tough to piece it together and see the whole picture, especially when there's so many other things happening on our personal lives.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wicked_pinko",
                    "body": "I don't think the US is that panicked. The Trump administration clearly has ideas on how to handle the new reality, which are honestly probably not that bad if the goal is to preserve the global power of the US. Europe, on the other hand, is really struggling, now that the US is starting to shut us out of their military and economic power. The rapid militarization of Europe is certainly a symptom of European imperialist powers attempting to prove their capabilities as important forces on the world stage without the US.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "FernandoMachado",
                            "body": "we don’t disagree at all. \n\n“the west” in my comment above refers to Europe. I’ll edit to make it clearer.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Furiosa27",
                    "body": "I disagree with this kinda slightly. Russia’s actions in Ukraine are a direct result of the USA’s imperialist actions with NATO. There is not a host of imperialist nations that could compete with the US, just Russia which isn’t going to attack the US or it would have expanded into NATO territories already. \n\nUS hegemony is not collapsing, it is panicking for sure, somewhat, but it maintains its stranglehold. \nThe west and the US always had an expiration date for its aid to Ukraine. Hell 100b was missing of aid way before Trump got in. The Ukraine-Russia war has been, to the US, a blank check printing meat grinder with no strings attached. \n\nIf they lose, that’s ok money was made and NATO isn’t threatened. If they win? Great NATO expands, key resources are secured. The US can’t lose, it’s deemed Ukraine no longer politically profitable and so it’s been cut loose. This is a big reason many pushed for peace early but a lot of people needed to see a sufficient amount of killing first.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "FernandoMachado",
                            "body": "NATO is not what it used to be and has failed publicly. \n\nTrump is letting of this failed form of superimperialism (that’s costly to the USA) to retroced to a pre-first world war model where every country is up to their own. (even if occasional alliances do happen, it’s not a organized military/political/economic block anymore)",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "anxious_cat_grandpa",
                                    "body": "Look, he's not a good guy and everyone is irrational to some degree, but I don't think it's accurate at all to say he's an irrational actor on the world stage. His actions have always been geared towards securing his own power and restoring Russia's former power and influence, but without all the commie shit this time. More of a fascist vibe really these days",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "socialism-ModTeam",
                                    "body": "Hello u/FrostyJesus!\n\nThank you for posting in r/socialism, but unfortunately your comment was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.\n\n\n\n- r/socialism's mod team.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "poostoo",
                                    "body": "what has Putin done that's irrational?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "FrostyJesus",
                                            "body": "Literally invade Ukraine. There’s no logical reason for it. It’s a large country with a capable military backed by the west. In what universe is Russia going to take the entire country?",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "ostensiblyzero",
                                                    "body": "Because a NATOized Ukraine means the West can just steamroll straight into Russia. It's a massive plain. That's why all the massive tank battles between the USSR and Germany were fought in that region.",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "poostoo",
                                                    "body": "Putin had no intention of taking the entire country.  just because you don't understand what's going on doesn't make it irrational.",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "wicked_pinko",
                                                    "body": "I don't think the invasion of Ukraine was irrational at all, that's why the war has been going on for three years now. Putin thought he could take Ukraine in a couple of days before NATO could do much about it and then dictate his peace terms. He was wrong, and probably also underestimated how willing NATO was to support Ukraine. However, once the invasion had started, it needed to come to a successful conclusion or he'd be screwed because his people would feel that he had humiliated Russia on the global stage. So he keeps the war going, both to assert Russia's remaining power and to preserve a feeling of national unity within Russia.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "socialism-ModTeam",
                                                    "body": "Hello u/FrostyJesus!\n\nThank you for posting in r/socialism, but unfortunately your comment was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.\n\n\n\n- r/socialism's mod team.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "davidbenyusef",
                    "body": "A fellow Brazilian telling how it is. 🙏",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Gekkamaru_Nightshade",
                    "body": "thank you so much for this, what a well written out and thought out response.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "FernandoMachado",
                            "body": "I’m honestly glad to help. I was learning about Lenin and Rosa’s views on imperialism and putting words together is really helps me consolidate those ideas. \n\nLenin and Rosa were both right, they just theorized at different moments of the development of imperialism. ",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gorgo100",
            "body": "The US liberal is among the most ignorant group on earth. They prefer this kind of diplomacy to take place behind a mask so they can sooth themselves with the idea that they are shining, unimpeachable beacons of moral authority constantly acting in the interests of democracy and freedom. It allows them to pretend it doesn't happen.\n\nTrump is just too unrefined and ill-disciplined to play the game in a way that supports the comforting illusion. In a way, it's good that people see this.  \nThere have been much worse and more grievous injuries to foreign powers hidden behind smiles, politeness and handshakes. The sooner the scales fall from their eyes the better.",
            "score": 62,
            "replies": [
                {
                    "author": "FutureEyeDoctor",
                    "body": "Well said!",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "KotoElessar",
            "body": "It's a deeper issue that traces back to Stephen Harper and his dream to unite the right worldwide. After leaving the Canadian PM office, he became the head of the IDU,  International Democrat Union, a German-based right-wing organization dedicated to spreading conservatism across the globe. \n\nHe has had his hand in every conservative victory over the past decade. \n\nSome of us know but it is easy for some to be overly simplistic or even misinformed.\n\nWe have to be kind and gentle with everyone, especially when our rhetoric against fascism is as unyielding and inevitable as entropy.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Broad_Direction7112",
            "body": "Libs just kinda need to pretend we're not our own worst enemy.",
            "score": 35,
            "replies": []
        },
        {
            "author": "oak_and_clover",
            "body": "Those who aren’t blaming Russia are treating Trump like he’s some sort of aberration from what America really is and what it stands for. America was always the bad guy, Trump just displays it out in the open.",
            "score": 27,
            "replies": []
        },
        {
            "author": "hmmwhatsoverhere",
            "body": "To be fair, liberals aren't known for coherent political analysis.",
            "score": 20,
            "replies": [
                {
                    "author": "CanStreet7610",
                    "body": "But what do you mean they are always on the correct side of history even if it means the deaths of millions, ethnic erasure and working class having nothing but pennies to rub together after everything is said and done.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AmarantaRWS",
            "body": "I mean it fits in with their whole \"this isn't what America represents\" rhetoric. Liberals still thing the USA has historically been the good guy. Their view of history is missing about half of real history.",
            "score": 13,
            "replies": []
        },
        {
            "author": "letsgobernie",
            "body": "US coup in 2014, Victoria Nuland's famous \"fuck the EU\" leaked phone call, US NATO expansion depsite intelligence warnings that it will trigger a wholly predictable war. US funding of far right reactionaries in Ukraine refusing any peace settlements, thirsting for war. \"Fight till the last Ukrainian\", \"fight over there so we don't have to fight over here\" words uttered in US congress and now this. The US has been torturing Ukraine for a long , long time. But Americans are incapable of understanding their own country in any terms other than a moral state ordained by history for good.",
            "score": 17,
            "replies": []
        },
        {
            "author": "TheVaneja",
            "body": "Russia has become the boogieman once more, McCarthyism has returned. Everything wrong in the world is Russia's fault! They eat babies, they killed insert-random-celebrity-or-politician, they have spies watching you surf porn, they want to make everyone eat potatos!",
            "score": 3,
            "replies": [
                {
                    "author": "StumpsOfTree",
                    "body": "Different then McCarthyism, which was a way to kill the domestic Left more then anything. And the Soviet Union for all its flaws did still have a planned economy and cwas associated with Socialism. Modern Russia is a conservative, nationalist, bonapartist capitalist government. \n\n  \nThis is more similar to anti-German rhetoric during World War One (which included for example renaming Frankfurters hot dogs, as well as stigmatiziing the German language, American Midnight is a good book which covers this)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HermanEbber",
            "body": "Being in the Baltics, I think I haven't seen this phenomenon you are describing. Maybe It's the US lib copium space that doesn't run across my feed, though I have seen nods to the theory that Trump is a Russian plant, but haven't seen anyone who actually believes it enough to dump the responsibility on Russia for what is currently taking place(Do they have a thumb in the pie? Absolutely. Did they orchestrate this whole thing? I don't think so). Basically everyone aside from blind conservatives and spineless centrists have admitted that Trump is a monkey with a shotgun and they are not shifting blame. And in the climate that is currently in the eastern bloc and EU in general, we have little energy to be dismayed over what is taking place overseas aside from the peace talks with Ukraine, which have recently took a turn for the worse. But I have still kept an eye on what Trump and his admin are doing in the US and screaming into my pillow most of the time.\n\nThe general situation is that the EU(in light of US VP's remarks and Trump greedily trying to get Ukraines natural resources without guaranteeing any defense support) in my opinion, is having a massive existential crisis on the subject of military defense policy. If Ukraine should fall, then nothing would stop Russia from invading the Baltics, specifically Estonia, where I live. Our foreign and defense ministers are deeply concerned over Trumps antics and are basically telling us to be prepared for the worst, though they are not creating any mass panic and the situation is currently eerily quiet while everyone is biting their nails to see what all this new power dynamics will bring. And the rise of right-wing politics in germany and other proximal countries is not making this any better. \n\nIf there are libs that still can't see that Trump is a manifestetion of how rotten the US government is and not the result of some 4D chess from Russia, then I have little hope that anything will wake them up to the cold and disgusting reality that lies in the black heart of US imperialism.\n\nI personally hope that there is enough leaders with enough common sense in europe that are willing to fight straight out fascism and show some spine, though I'm not holding my breath on that subject either. We are living in a limbo and in terrifingly uncertain times and the next year is crucial to try and avoid disaster. The working class has suffered enough under neo-liberalism and I hope we are able to diplomatically resolve this situation somehow, even though, in my eyes, a cold war at the very least, is inevitable.\n\nThank you for listening to my rant",
            "score": 7,
            "replies": []
        },
        {
            "author": "cdnhistorystudent",
            "body": "America... bad...? Nah, that can't be true. Russia has a global monopoly on bots, trolls, disinformation, political interference, and corruption",
            "score": 10,
            "replies": []
        },
        {
            "author": "JeanJauresJr",
            "body": "Ukraine marks the point where I part ways with the traditional Democratic Party, and for good reason. NATO and the West's continued expansion into Russia's sphere of influence is not only reckless, but it also plays a dangerous game with global stability. At best, it’s an expansionist, colonialist maneuver. Meanwhile, the Democrats are content to funnel billions into prolonging conflicts in Ukraine and Israel while barely addressing domestic issues like healthcare, homelessness, and education.\n\nThe \"threat\" posed by Putin is far more exaggerated than it's often portrayed. Amplifying this fear only serves to line the pockets of weapons manufacturers and neo-colonial powers, not the American people or the citizens of Europe, Ukraine, or Russia—let’s not forget, they are human too.\n\nSo, here’s some constructive criticism for the Democrats: Stop funding endless wars. Stop letting Republicans exploit your mistakes. Engage in dialogue with world leaders, even those you disagree with, for the sake of peace. And most importantly, break the military-industrial complex's stranglehold on your policymaking. Perhaps then you'll start winning elections.",
            "score": 8,
            "replies": []
        },
        {
            "author": "yo_soy_soja",
            "body": "They really just want a villain or two to blame — which we can *somehow* depose to bring harmony. It's cartoon, videogame logic.",
            "score": 9,
            "replies": []
        },
        {
            "author": "InspectorRound8920",
            "body": "My book of the month :the forever war: capitalism since 1914",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vicky_Roses",
            "body": "It’s because liberals, like any politically aware American in this country (meaning anyone with half the brain cell needed to just read or listen to the news every once in a while to form some kind of opinion), are obsessed with the fucking idea of doing the entire team sports bullshit where they are incapable of separating their own personal morals from the morals of the people they voted in.\n\nLiberals tie their entire goddamn identity toward being the good guys of American politics where they feel insulted at the idea that the people they voted for might not even be such good people after all. If you even try to present them with the idea that it’s okay to not be onboard with the country that represents you considering all it is is just some arbitrary group of people who rule over some slice of land that you are most likely in due to the happenstance of being born there (I’m looking past immigrants for the sake of this argument here, because they’re a minority when looking at the overall liberal establishment), they get pissy that you’re shitting over the values of being an American Patriot or some shit.\n\nSo when you try and explain to them that what Trump is actually doing here isn’t anything new for American history standards, and that, actually, whatever Trump is demanding from Ukraine is probably the exact same thing Biden was demanding from them as well, except Trump doesn’t have the filter to give a shit about looking like a decent person globally, they get mad that you’re implying that Biden wasn’t some fucking freedom fighter who just had Ukraine’s best interests at heart who definitely wasn’t just using potential NATO membership as a carrot on a stick.\n\nI want to believe that they’ll see Trump being a massive piece of shit and eventually connect the goddamn dots that this is just every American president in general, but I the pessimist inside of me has no hope that they’ll ever think about American policy critically enough that, say, they accidentally piss themselves into developing class consciousness or something.",
            "score": 5,
            "replies": []
        },
        {
            "author": "UTB_63",
            "body": "It’s down to one thing, as it always is…Money!😔",
            "score": 2,
            "replies": []
        },
        {
            "author": "B_A_Skeptic",
            "body": "The Democrats accuse Trump of being a Russian agent because they want a way to criticize him without offending white supremacists.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MithranArkanere",
            "body": "US's history is riddled with problems. Every time things seem to be getting better, there will always be a group that will rise up to ruin it. Like with Tulsa. \n\nAnd things have not been getting much better ever since McCarthy and his ilk got away with the Red Scare and turned things worse again.  \nProgress only slowed down.   \nBeing the only wealthy country that does not offer public services like healthcare to anyone within the country regardless of citizenship is absolutely unnaceptable.\n\nTheir reality now is having a \"left\" that would be considered \"center-right\" anywhere outside of the US. Just two corporate parties. One that cozies up to industries that do not care about the people and ways to control the people like dogmatic organized religions, and one that cozies up to industries that benefit from people having a bit of wealth to exploit, like entertainment. \nOne is slightly better than the other, but \"the good of the people\" isn't the main reason to exist for either.\n\nEven if all those rumors about Trump being a russian asset were real, the problem is much worse than that. \nHe was allowed to get into that position in the first place. All the check and balances do some damage control, but once it's over, if it's ever over, there will be little push back in the other direction. \n\nTrump is a problem that will pass like all the others.  \nThe real problem is their ratcheting effect.  \nThere's a pawl keeping things from going back in the direction of progress, and it isn't Trump.  \nTrump is just another cog in the wheel, like Reagan was. A particularly nasty one, but still just a cog.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AnonymousChicken",
            "body": "I'm not sure what any part of this has to do with socialism, but I'll bite since it's been up here for a while.\n\nI agree with you, the libs have never been the good guys, as Patrick Stewart playing Lenin once said (I don't think Lenin ever directly said it himself): \"Don't trust the liberals! They will betray you!\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "liberals have no other excuse to use but russia",
            "score": 3,
            "replies": []
        },
        {
            "author": "blasthememes",
            "body": "Except for your last sentence, this is a sus take.",
            "score": 3,
            "replies": [
                {
                    "author": "FutureEyeDoctor",
                    "body": "Why exactly is it sus?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hehateme123",
            "body": "Yes I agree. The situation in Ukraine is 100% the fault of the United States.\n\nIt goes back to 2014 when the Obama/Biden CIA fomented the Maidan revolution in the Ukraine. Since then, the Ukraine is nothing more than a puppet in a proxy war being waged by neoliberal war mongers within the US government.\n\nAll the posts about Putin being Hit!er and how he’s going to invade Poland is completely laughable. It’s basically CNN/deep state propaganda to stoke the military industrial complex.\n\nLike everyone here, I hate Trump but at least he’s moving to end this debacle.\n\nNo socialist can be in favor of war",
            "score": 4,
            "replies": [
                {
                    "author": "LordofNarwhals",
                    "body": "It's 100% the fault of Russia, they're the ones who invaded their neighboring country.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "zdiddy987",
            "body": "Russia have him the platform ",
            "score": 2,
            "replies": []
        },
        {
            "author": "HotTacoNinja",
            "body": "There have been many signs that Trump was recruited as a Russian asset in the 80s/90s. His lifestyle, being funded by Putin and oligarchs. That they may have blackmail or some other control over him. He is seemingly behaving like someone who I beholden to them. His defense of Putin and his verbal aggression toward Zelensky seemed all too telling.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "socialism-ModTeam",
                    "body": "Thank you for posting in r/socialism, but unfortunately your submission was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "socialism-ModTeam",
                    "body": "Thank you for posting in r/socialism, but unfortunately your submission was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "davidbenyusef",
            "body": "Most Western leftists are all like \"Are we the baddies?\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "socialism-ModTeam",
                    "body": "Thank you for posting in r/socialism, but unfortunately your submission was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mysterious-Nature522",
                    "body": "If he was a foreign agent he would try to hide it. What he does is not helping Russia's strategy at all. I believe they prefer friendly Europe and insulated America not other way around.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "socialism-ModTeam",
                                    "body": "Thank you for posting in r/socialism, but unfortunately your submission was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sirlost33",
            "body": "Not really. Remember during the Obama admin when Greg Abbott got misled by Russian disinformation and had the national guard follow around the army on training exercises? This isn’t new, it’s only getting worse.",
            "score": -2,
            "replies": []
        },
        {
            "author": "cypercatt",
            "body": "Uggggggh, downvote me all you want, but you can be a socialist and understand that there is Russian inference in our government. The US government can be bad *and* Russia can be interfering with the US government. Trump can represent billionaire interests *and* be a pawn for Russia. The US can have a history of fascist institutions *and* Russia—well Putin—can benefit from the downfall of the “oldest Democracy.” All of these things can be true at once.\n\nI’m a socialist because I value liberation. I’m sick of online leftist communities minimizing the global impact of authoritarian regimes because they can’t take a second to examine their US-centric worldview.\n\nI’m very done with the pseudo-intellectualism of this subreddit. Block me or delete this post or whatever, I don’t care. I also won’t be engaging in any comments, so don’t bother.",
            "score": 0,
            "replies": []
        }
    ]
}