{
    "title": "Massive crowds in Greece as Greek workers go on strike",
    "author": "LiberateTheSouth",
    "subreddit": "socialism",
    "rank": 68,
    "score": 3742,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 49,
    "url": "https://v.redd.it/lx0ajvtvfyle1",
    "id": "1j0jxww",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fantastic-Daikon4577",
            "body": "1 million in Athens, hundreds of thousands in the rest of Greece. It was amazing to see all these people from different ages, occupations and ideologies unite against the neolib government.",
            "score": 256,
            "replies": [
                {
                    "author": "Dr_Happykat_MD",
                    "body": "Σαν ατσάλινο τείχος ✊🏼",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "StudyJuche",
                    "body": "It was incredible energy to be in <3 Η αλλαγή θα έρθει στην Ελλάδα. Το νιώθω στον αέρα.",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "T1misk",
                    "body": "For a country with 10 millions there are amaizing numbers",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Fantastic-Daikon4577",
                            "body": "Largest protest in the last 200 years in Greece",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Swimming-Purchase-88",
                    "body": "Time for the revolution comrade, and spread it to Turkey if possible afterwards",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "LetMeBe_Frank_",
            "body": "Uppa Workers! ✊❤️",
            "score": 165,
            "replies": []
        },
        {
            "author": "ProbablyNotYourSon",
            "body": "God why can’t we the US to this level of give a shit?",
            "score": 229,
            "replies": [
                {
                    "author": "raicopk",
                    "body": ">Between a quarter and a fifth of employees in Greece are union members.\n\nhttps://www.worker-participation.eu/national-industrial-relations/countries/greece\n\n>U.S. union membership levels declined to record lows last year [...] Just over 14 million U.S. workers were members of unions in a total work force of 145 million\n\nhttps://www.reuters.com/world/us/us-labor-union-membership-little-changed-2024-government-says-2025-01-28/\n\nDisregard idealism and join a political organisation. It is through this that change will occur.",
                    "score": 118,
                    "replies": [
                        {
                            "author": "Hysteric_Subjects",
                            "body": "Sadly tech sector loves their corporate slavery",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dazzling-Screen-2479",
                    "body": "Greece has been so advanced in the struggle at times that they basically still maintain a max security prisoner for leftists, where they've been housing a lot of anarchists over the years. There's been reports of torture in some cases. There was one Greek anarchist who went on a helicopter tour then allegedly attempted to hijack the helicopter to free the prisoners, but she failed and a massive anti terror campaign was unleashed looking to find her and others. When they arrested some of them police claim they had multiple fake passports, and all kinds of ammo. This was occuring when people within the prisons were on Bobby sands style hunger strikes backed by mass demonstrations, and threats in the air outside the prison walls.",
                    "score": 88,
                    "replies": [
                        {
                            "author": "StudyJuche",
                            "body": "It is because we have suffered a lot in this country - we are tired of it, and have been for decades; but finally, the urge to change is crossing generational lines. I feel change coming. It is in the air.",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "Dudewhocares3",
                                    "body": "I hope you get that change",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "Electrical-Strike132",
                                    "body": "How sovereign is Greece within the EU?  The EU crushed the Syriza movement by threatening to shut down the financial system.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "AromanianSepartist",
                                            "body": "Syriza was neoliberal and doomed to failure from the start that's why the communist party refused to join the coalition \nSyriza formed a goverment with a far-right party that nobody took seriously \nThey took some of the harshest austerity measures full of lies.... and as an opposition vote 80% same with the neoliberal conservatives...... \n.maybe the eu played a small roll in this but it was Trojan horse feeding from the peoples demand for economic justice",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Maleficent_Dust_6640",
                    "body": "Because most unions in the US are not allowed to up and wildcat strike",
                    "score": 12,
                    "replies": [
                        {
                            "author": "ProbablyNotYourSon",
                            "body": "I was a union steward for a place that was the first union at said place. And when I joined I read the contact and there was a no strike clause in it. I couldn’t fucking believe it. What’s the point of a union if you can just shut it down when you need too?",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Expert-Joke9528",
                    "body": "It's coming",
                    "score": 18,
                    "replies": [
                        {
                            "author": "ProbablyNotYourSon",
                            "body": "I’m getting ready",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LatterClassic467",
                    "body": "Mostly its healthcare and access too food. Our government dont have these systems so that we rely on corporations to make us bankrupt ourselves for basic services. Gov gets pocket money and the wheels keep spinning till they the revolution they deserve. Unrelated note, guillotines are pretty easy too build",
                    "score": 6,
                    "replies": [
                        {
                            "author": "ProbablyNotYourSon",
                            "body": "Exactly. I can’t take off work too much to protest because I lose my job and would lose my healthcare. Me and the gf were talking about building a mock guillotine for protests. I’ll see you in the revolution brother. I’m getting prepared hope you are too",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "LatterClassic467",
                                    "body": "Doing what i can. Best of luck brother🫡",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "socialism-ModTeam",
                            "body": "Thank you for posting in r/socialism, but unfortunately your submission was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "alons33",
            "body": "Fuck yeah greece!\n\nGamoto nai!",
            "score": 29,
            "replies": []
        },
        {
            "author": "StudyJuche",
            "body": "I was here today! <3",
            "score": 21,
            "replies": []
        },
        {
            "author": "Future_Minimum6454",
            "body": "Workers of the world, unite!",
            "score": 14,
            "replies": []
        },
        {
            "author": "Alive_Razzmatazz7",
            "body": "This is what people need to do in America instead a mass not buy anything on Amazon day.",
            "score": 7,
            "replies": []
        },
        {
            "author": "starcrossedflake",
            "body": "Yeah yeah go Greece 🙌",
            "score": 5,
            "replies": []
        },
        {
            "author": "peachesandferns",
            "body": "POWER TO THE PEOPLE!",
            "score": 6,
            "replies": []
        },
        {
            "author": "MithranArkanere",
            "body": "I like to show this kind of footage next to what the legacy media news show.\n\nYou see a bunch of videos from social media from random citizens, and most of them are crowds and crowds of peaceful protest.\n\nYou go to the news, and it's either scattered people from the edges of the demonstration or rare altercations, most of which were actually started by the police.",
            "score": 4,
            "replies": []
        },
        {
            "author": "pattydickens",
            "body": "Americans need to learn something from this.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Kolkata-Frued-3001",
            "body": "More power to workers, farmers of Greece🇬🇷. Massive respect from India 🇮🇳 ✊🏽❤️",
            "score": 5,
            "replies": []
        },
        {
            "author": "wiskinator",
            "body": "This is what the USA needs to do",
            "score": 2,
            "replies": []
        },
        {
            "author": "thingswhatnot",
            "body": "#theworlddin'tnoticebecausegrecceisn'tproductive.",
            "score": 2,
            "replies": []
        },
        {
            "author": "83C0M3_Newman",
            "body": "I've only recently heard of this, is there a left wing sentiment behind these protests? Is Greece having a socialist revolution rn or nah",
            "score": 1,
            "replies": [
                {
                    "author": "Red_Boina",
                    "body": "The KKE and its various mass, union, and youth orgs played a core role in the mobilizations so yes, these protests are openly left wing in orientation.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "83C0M3_Newman",
                            "body": "Holy shit that's awesome. So does this mean Greece could potentially end up being the first country in the 21st century to become a socialist state?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DemosBar",
                                    "body": "No the guy just is probably a member of KKE and in a social bubble around it.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DemosBar",
                    "body": "I would say these protests are mostly about complete institutional ineptitude and mafia state politics. It was pushed by virtually every party (from far right actual nazis to the marxist leninist kke). Most of the people though are of no party affiliation. The organising was done by the tempi relative organisation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Perfect-Werewolf-102",
            "body": "Yet the recently elected president is of the New Democrats",
            "score": -9,
            "replies": [
                {
                    "author": "AromanianSepartist",
                    "body": "That's not the point of the protest... also he has been in power since 2019 not new \nThe point is the government hides information to protect big corporations that led to the train explosion killing 56 people \n\nAll parties that rulled greece the last year's are responsible \nNew democracy (neoliberal conservatives)\nSyriza (Populist socdems that are actually also neoliberals)\nPASOK (old socdems that are also neoliberal)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Perfect-Werewolf-102",
                            "body": "Yeah I'm sorry, just frustrating to see the presidency continue",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -8,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}