{
    "title": "Former US Secretary of Education Betsy DeVos: \"Shut Down the Department of Education\"",
    "author": "qp0n",
    "subreddit": "Libertarian",
    "rank": 451,
    "score": 373,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 94,
    "url": "https://www.thefp.com/p/betsy-devos-shut-down-the-department-of-education-trump-elon",
    "id": "1ijb72s",
    "selftext": "",
    "comments": [
        {
            "author": "liberty_is_all",
            "body": "Does anyone have good resources on what the ED does and how the budget is allocated?\n\nThere are certain things that I get called a leftist on, and maybe that is true, but I want to live in a society where all children are given the opportunity for a publicly funded education because I think and educated society is better for those people overall.  And I think all should have equal opportunity to it.  There are already issues with the systems with quality of education already varying significantly by the tax system that supports it.\n\nI think there is justified concern with the wise use of funds.  And maybe the ED really is a complete tax sink with absolutely no good.  What I am fearful of without the ED the curriculum going back to the states and getting perverted with religion.  I am fearful of reverting to special needs being disregarded.  I'm fearful of the vouchers being an excuse to close public schools in favor of for profit schools. I am fearful of areas that are not doing well to get way worse when you start reducing the funding even further.\n\nI think better understanding what the ED does and doesn't do is a good place to start to I can educate myself on the rest.\n\nOnce again, I understand I am in the minority here but I truly want to be better understand why this is the libertarian position.  I am probably also biased because I've always had teachers in my family and have been successful coming from public education, both in primary and higher education.\n\nSo why should the ED be vanished?  And also, why should the public school system be replaced with a for profit model?",
            "score": 211,
            "replies": [
                {
                    "author": "yoshinator13",
                    "body": "A huge part the department does is funding for children with disabilities. Even if you are in a rural country with only 10 kids, if one kid has a disability, the federal government will pay for the support services for that child.",
                    "score": 119,
                    "replies": [
                        {
                            "author": "TellThemISaidHi",
                            "body": "And everybody agrees that that is a 'good' thing.\n\nBut, should it be a 'federal' thing?",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "gadela08",
                                    "body": "It's not locally funded because the low taxpayer density of rural America can't afford it.  If it's 'good' and worth funding the intervention, the correct level to fund through wealth transfer is the jurisdiction that would be impacted the least. That is federal.",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "iotaoftruth",
                                            "body": "It’s the liberal blue states funding the federal government that then gives welfare to the red states",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "gadela08",
                                                    "body": "In the interest of precision, it's more accurate to say Federal taxation enables transfer of wealth from wealthy States to less wealthy States. \n\nThe labels of liberal, blue, red, etc May reflect the correlations that you see in the real world , but don't contribute any explanatory value to the simple economic concept of wealth transfer.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "If only there was something in between the federal and local governments. And these intermediate entities can unite together or something. Like a providence, but no, we need a better name....like State.\n\n  \nIn all seriousness, we've inverted the power structure in this country. Local governments should be the ones in control, and for something too big for a local government to handle, like this they band together as a State, and for anything too big for a State like national defense, we have the Federal Government.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "perfec7paradox",
                                                    "body": "Some states. Mostly below the Mason Dixon line, suck. And don't give a shit about their people. So the state solution wouldn't work. They wouldn't be able to afford it. Seeing as how they're welfare states and need federal funding to survive.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "Asking for the federal government to be your daddy and solve all your problems seems like a bad solution. Either move or elect better leaders in your state.\n\nIf you don;t think your state leaders care when they are within a few hundred miles, how do you expect some bureaucrat in DC to give a damn about anything but how they can use their power to enact their will on you and your children.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "HeavyComforterer",
                                                                    "body": "This is such a sophomoric view it’s insane lol",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "Seeing how you post on fednews....yours is the insane take, and you're in the wrong sub.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Ihatemylife153",
                                                    "body": "I am in no way a libertarian, I tried if that counts for anything, but this is a take I love and have had for a long time. The military, Congress, and foreign affairs,  should be the purview of the federal government. I don't believe in less taxes at all. When you look at the OECD and G7 and so on, we're actually taxed relatively  less when it comes to income taxes. I think the tax structure just needs flipped. The municipality in which you live in should get what you pay into federal instead and provide the amenities that keep citizens and business wanting to stay. Pretty simple. Can I provide a country that's implemented such a structure lol nope, but it's at least refreshing to see someone has a similar take if nothing else.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "_JustAnna_1992",
                                    "body": "It's already not a 'federal' thing. It's a school board thing which if anything is more of a state thing. The only involvement the federal government has is the requirement that accessibility be put on the states in the first place.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "GooeyCR",
                                    "body": "I reckon it’s because if the government doesn’t, it won’t happen. \n\nI believe that we as humans are mostly separated from the rest of the animal kingdom in our care for the lives of our weakest. The average community just doesn’t have the funds to have special needs programs or the associated costs with teaching students with disability; So, if they’re going to take my money anyways, I’d like to have it funneled towards helping the vulnerable.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "em_washington",
                                            "body": "If the federal government doesn’t fund it, you think no one would? I think a lot of states would do it on their own if there were no federal funding.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "GooeyCR",
                                                    "body": "So your opinion is that the federal government shouldn’t pay for such and instead states should? How is that effectively different aside from the fact that poorer states just wouldn’t have these programs anymore? \n\nComing from someone whose state would in fact fund these programs without a second thought, I would be fine in this hypothetical. \n\nI just wonder then what the difference is between the US as a nation and the EU in that instance, if we should each be sovereign and independent from one another. I don’t mind some kid somewhere half way across the country getting some extra help with a fraction of my taxes, not something I’m worried about.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "em_washington",
                                                            "body": "The difference with states managing education instead of the federal government is it’s much smaller and there is less bureaucracy. And they can tailor it more to their specifics. States may have different schedules based on their own climate or traditions. They might elect to do something different on vocational training to support careers in local industries. \n\nThe main difference between the US and EU is a shared military. If the EU gets a shared military, they basically become one nation.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HeavyComforterer",
                                                                    "body": "The states handled education the DOE disburses funds that are allocated through Congress.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "GooeyCR",
                                                                    "body": "I don’t believe that leaving such a task up to states to be the most equitable choice. As I said, I live in a state with ample social safety nets, so I’m not too invested into whether we do change the way such funding is granted so long as our federal taxes are reduced accordingly. \n\nI just don’t think abolishing the DOE is at the top of my to do list. But I understand your opinion.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "_JustAnna_1992",
                                                    "body": ">you think no one would?\n\nNo, hardly anyone actually would. Not in the general human nature to willingly help people that are outside of our immediate sphere.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "em_washington",
                                                            "body": "The federal department of education did not open until 1980. So how was education in this country funded for the 2 centuries before that? And how much has education improved since 1980?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "gpmohr",
                                    "body": "And it’s not Huge, unless it’s your child. This most be a state program.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kimber_EDC",
                    "body": "The states already set the curriculum for their students. That has nothing to do with the DoE.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "fanostra",
                    "body": "These two Mises pages are pretty good to that end.\n\nhttps://mises.org/mises-daily/end-doe\n\nhttps://mises.org/mises-wire/why-its-time-abolish-department-education",
                    "score": 26,
                    "replies": [
                        {
                            "author": "liberty_is_all",
                            "body": "Thanks again for sharing this. At least with Mises stuff I'm not concerned with any ulterior motive or influence, generally speaking very consistent with their approach of limited government and free market solutions.\n\nI think it was interesting and showed a hole in my news that I was not aware of the recent \"scandals\" involving the ED, especially with FAFSA.\n\nI think in general I assumed that the ED was more involved in providing services and funding than they actually are.  It really does appear the exponential growth of the budget in the last 2 decades has been due to the student loan program that has had the opposite effect than intended, by trying to provide affordable higher education they have in fact made it ever more outrageously expensive.  For this reason I think I would support the ED being shuttered, at least that portion. One  thing I wonder though, are the current prices the new baseline or could the free market provide reduce in costs for this product/service that we see in the technology realm through competition?\n\nSo regarding Title I funding, that wasny really addressed fully.  Is this the type of funding that gets held up with the Federal restrictions and are those cumbersome?  I actually am on board supplementing the really poor areas with tax funds from other areas to try and improve outcomes and ensure access to education. But the results don't show improvement from the investment.\n\nI didn't see much written on special needs funding.  When I look at the federal budget for FY 2025 there is a decent chunk for that.  I think there is a large concern that without this funding those services would not be provided. I'm not ok with the libertarian take that they should be paying way more for those services or that we should fully rely on philanthropy to fill that void.  I've heard way too many individualist views that are basically fuck you, give me mine and leave me alone.  This is the type of stuff I'm not ok with that.\n\nSo overall, once again,n thank you for sharing.  Ilafyer reading I think there is solid reasoning for the argument to end the ED.  I would likely be on board if there was a way to guarantee that states still provided the special needs services without an unnecessary burden.  And there has been too much politics involved in the real or perceived ransom of funding for states.  The initiatives should be straight forward enough that an entire state would not ball at them.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "liberty_is_all",
                            "body": "Thank you, started reading this now.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "marsmedia",
                    "body": "Agreed. Letting districts, towns, counties, and states fail to teach children hurts all of us (now and in the future). Does the Dept. of Ed help prevent that yype of sociaetal failure? I've lways thought so...",
                    "score": 53,
                    "replies": [
                        {
                            "author": "liberty_is_all",
                            "body": "That's what I've thought too, but now I'm trying to step out of that bias and ironically uneducated view to see data that can either back that up or cast doubt.  I think we have legitimate concerns, but I may be overstating the ED's intent or ability to improve them.\n\nI have to get out of my tendency to just go education is important, why would we do that?  Because I think most people agree education is important.  It is also important for tax funds to be used well.  And if they are not being used well and could be better used or not used at all as in not taxed then maybe that is best.",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "forever4never69420",
                            "body": "You've always thought so? Or are you just getting plugged into the issue? \n\n\nLook up where the USA was in terms of global education standing before and after the DE and tell me they \"help prevent that yype of sociaetal failure?\"\n\n\nThey're the reason college is so expensive.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "marsmedia",
                                    "body": "I mean, we're all institutionalized to believe that each existing federal department is performing some important function. I think the general idea of federal oversight for education is to ensure that each state adhered to a standard *(stick)* and federal appropriations for facilities, material, and traning *(carrot).* The department has existed for my entire life with rarely a complaint except by Libertarians. This is the first time I've seen the POTUS float such an idea. And I'm open to it, if no one can justify their existence.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "forever4never69420",
                                            "body": "> rarely a complaint\n\n\nStudent debt? Heeelllooooo",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lo_Gro",
                    "body": "If the implementation of school vouchers causes public schools to close in favor of private schools, what would that say about the quality of education these two models provide?\n\nIf the freedom of choice is an existential threat to the current system, maybe it's time to rethink it.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "liberty_is_all",
                            "body": "I think this is an excellent point, but I question if it will be the taxi vs Uber situation.  Besr with me, but I think this is analogous.  But Uber comes in and provides better paying jobs for drivers, and reduced fees for customers. They gain market share.  They price the competition out. With the monopoly they've gained, they then cut wages and increase costs.  This is a gross simplification , there is also still some competition with Lyft and taxis, but I envision this being the same. They started with a non optimal system, found ways to improve it, and then found ways to exploit it.  I struggle providing that opportunity for exploitation for basic necessary services for things like education.  Right now there is the freedom of choice for the wealthy, with little to no choice for the less fortunate.  But would vouchers just lead to an illusion of choice feom the private sector? Would we also not see the issue with college tuition inflation then with elementary tuition?  Where regardless of operating cost the minimum tuition will at least be the voucher value?\n\nI also see a big risk for cutting out special needs.  Many private schools don't offer this and they are referred back to the public school system. Why? Because it is expensive.  But as a society I think it is prudent to share that burden so all have access to education without it being too steep of a burden for one family.\n\nThat being said, if there are good resources to show or studies I would love to read those.  I've listed my concerns, but maybe those are addressed already in the voucher system and I'm unaware.\n\nEdit to add, your last statement rings true, it is at least worth reevaluating and rethinking the approach.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "owhatakiwi",
                            "body": "As someone with two kids in private school, they’re Christian. I’m not even religious. Almost all private schools are Christian and I think That’s a huge factor. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Neither-Following-32",
                    "body": "Betsy Devos is cancer. She wants to shut down the DoE because she sees the existence of public schools as a barrier to Christian education specifically.\n\nShe worked to erode it as Secretary and in private life in her home state as well. That's why she went so hard on school vouchers, it's a roundabout way of funneling money to Christian schools.\n\nIf you're worried about them sneaking Jesus into schools, first comes the erosion of public schooling. Second phase is replacing it with private schools that explicitly do teach religion, with how bad the public schools are as a pretext for providing the vouchers.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "_beef_supreme",
                    "body": "Dave Smith does a great job explaining it in his latest podcast:\n\nhttps://open.spotify.com/episode/3WP4I15VUp5pOmFnWH2qrb?si=3i8ffocgSP-8GiN4VImG_A",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "JustaddReddit",
                    "body": "I do !  They take tax payer money, put it in a bowl, mix it with a whisk, and then send the States the leftover money after it’s been propagandized and laundered is what my opinion is.",
                    "score": -19,
                    "replies": []
                },
                {
                    "author": "MJ50inMD",
                    "body": "The DOE’s most important function was creating and training a nationwide Campus Sex Police organization.",
                    "score": -15,
                    "replies": []
                }
            ]
        },
        {
            "author": "JackIsColors",
            "body": "If Betsy DeVos says it, chances are the right thing to do is the opposite \n\nThe DeVos family is the type of crime family that people pretend the Bidens and Clintons are. They're the worst type of Crony Capitalist. They are not at all compatible with libertarian values, they would enslave you if they could\n\nEDIT: I was banned for this comment",
            "score": 274,
            "replies": [
                {
                    "author": "Mecaneecall_Enjunear",
                    "body": "Michigan transplant here.  The DeVoses own a giant chunk of Grand Rapids thanks to getting rich off of a pyramid scheme. They’re pieces of shit, and I’m not happy that I agree with Betsy on something.",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "ReactorTractor",
                    "body": "Broken clock is right twice a day. There is not a single libertarian argument that justifies that department existing",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Gotta_Gett",
                            "body": "This is not a clock which can be verified for correctness. It is an opinion.",
                            "score": 49,
                            "replies": []
                        },
                        {
                            "author": "Additional_Vast_5216",
                            "body": "she just wants to monopolise the vacuum, imho it ends up being the same only in possesion of somebody else",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gewehr44",
                    "body": "It's a shitty comment in a supposedly libertarian sub. You made a person attack on a person instead of showing where they were wrong.\n\nWhat critical function does the dept perform? Test scores are down since they were created while expenditures in education have doubled inflation.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "qp0n",
            "body": ">The Department of Education does not run a single school. It does not employ any teachers in a single classroom. It doesn’t set academic standards or curriculum. It isn’t even the primary funder of education—quite the opposite. In most states, the federal government represents less than 10 percent of K–12 public education funding.\n\n>So what does it do? It shuffles money around; adds unnecessary requirements and political agendas via its grants; and then passes the buck when it comes time to assess if any of that adds value.\n\nBoiled down, the DOE is a taxpayer funded ransom organization; 'do what we say or you wont get your money back'.",
            "score": 61,
            "replies": [
                {
                    "author": "jml011",
                    "body": "Sounds like she gave a like a totally fair and unbiased answer after collecting her own paycheck from the job.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Brilliantly put. Thank you. I was worried all public schools would close a couple years ago when Desantis said if he won hed close the doe. Then looked into it and found exactly what you commented here: they dont do shit. Just soak up money. \n\nLike seriously, if it gets shut down most Americans who dont see the news literally wont even know because it will have zero effect on them. ",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Vintagepoolside",
                            "body": "I mean, what about students who are special needs and their parents don’t have to pay for their accommodations because it’s been covered? They’re already having a hard enough time, without having free IEP, BIP, or whatever else, they will be doomed. And that’s not even taking into account schools where lots of the children are already living in poverty/ the only thing keeping their school open is government funding.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Bro you are on the libertarian sub arguing FOR three letter gov agencies? \n\nAll that stuff can be handled at state or local level. \n\nAlso since the doe was created test scores and such have gone down. So have they really been helping anyone? Have they been bringing kids up? ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Vintagepoolside",
                                            "body": "Well considering a place like WV that is hugely funded by the federal government, the place is poor. The state itself does not have money. So who exactly is paying for it?",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Are you a libertarian? Or just here trolling? Or here to learn? Or what? Because you sure do not sound like a libertarian.\n\nMost libertarians don't even think there should be such a thing as government funded schools. Heck, many libertarians think taxation is theft. Without taxes there would be no such thing as government schools. No one is paying for shit people can't afford on their own. That's how it works in libertarianism.\n\nA better question might be: When free men and women choose to reproduce and can't afford education costs for their kids, is it moral to take other people's money under threat of law to pay for it?\n\nPeople who can't afford to take care of their kids shouldn't have kids, and those who choose to any way have made their choice, and it's not anyone else's responsibility.",
                                                    "score": -9,
                                                    "replies": [
                                                        {
                                                            "author": "Vintagepoolside",
                                                            "body": "I am here because I follow and engage with all political subs really. Subs for conservatives, republicans, democrats, liberals, libertarians, etc. it’s not trolling for someone to engage with a sub if they don’t adhere 100% to the ideology behind it. \n\nAnd I hear you, but that only sounds feasible in a perfect world. The idea that children should be punished because of their parents, is ridiculous in my opinion. No, I do not think the government should have hands in everything we do, however, I think creating a financial barrier to money with absolutely destroy areas that are already struggling. Not only that, but not everyone who is in a financially troubling situation got there because they did something to deserve it. \n\nAnd don’t get me wrong, I was just looking at private schools near me for my kids, but it was crazy to see a range of $12,000-$25,000 for *one child*. Who on earth can afford that even with making good decisions? What jobs pay enough to dish that out?",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "author": "SunnySpot69",
                                                                    "body": "Honestly, this is one thing that is difficult for me to agree with as a libertarian.  \n \nI don't think children should be screwed because of their parents. Basically, you could have money, and then have a child that has a disability upon delivery. Or what if they have an unfortunate accident and need help afterwards. No one should have kids if they can't potentially thousands of dollars. I don't even have children so I really have no skin in this game. It's just unfortunate you can be born and screwed because your parents didn't have thousands. No one should have kids they can't afford. This goes beyond that.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "None",
                                                                    "body": "idk. I'm a bitter poor person who is tired of blaming the rich and expecting the government to take care of me.\n\nSo, who is to blame? Or what, rather?\n\nHuman nature.\n\nIs it really the guys with guns job to point their guns at people and tell them they have to take care of the poor? Is it really the rich's problem that there are poor people?\n\nI don't think so. Look at human history. Heck, look at apes. ALL inequality, all the way. Apes have social hierarchies, and all humans have and always have and always will. People always pretend apes are super nice, and a good example of how we should be or something, but watch documentaries and read up on them. Assholes, just like us. Some king ape abuses those lower than him and takes more than them, and banishes other apes who he doesn't like or kills them.\n\nSo, since it's human nature to be unfair, how is giving more power to armed people legally allowed to order us around under threat of the law going to fix this? Their human nature is the same as everyone's: Power hungry assholes.\n\nThere are RARE exceptions, but look at almost every group ever and you will see power dynamics that are unsavory. Every communist country, every socialist country. So even when people try to specifically stop inequality by empowering armed people to force equality, it just creates another ruling class again which is unequal to the people they oppress. \n\nGiving tons of power to people with guns is not the answer.\n\nHeck, even small communes without guns and such usually have some creep running them who oppresses people and fucks everyone's wives. People are naturally hierarchal assholes.\n\nPersonally, I say we deregulate the economy and just offer free, voluntary vasectomies to all people who are poor and unhappy. The wealthy would change their tune VERY fast when they start running out of workers. Then they would pay better and take care of their employees. Making their employees happy would be priority number one. Done. And not a single guy with a gun involved. No new regulations or taxes. It would be a self fixing issue if we could just use a nonviolent means to get around the issue of the poor reproducing despite suffering poverty and oppression and perpetually serving the rich.",
                                                                    "score": -2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "slatz1970",
                                                            "body": "I getcha, but what happens when those millions of children grow into adults? I guess our country will be one of the 'haves' and 'have nots,' educationally speaking.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "SunnySpot69",
                                                                    "body": "Have you heard the saying. Goes something like, \"you can determine a gifted kid by the zip code.\"",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "alc1982",
                                            "body": "Do you REALLY trust states in a certain region to take care of disabled students when they can't even prevent their teenagers from getting pregnant? 😂😂😂😂",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Exactly. \n\nThis is the fallacy Im always pointing out to the big government crowd: if people are so hopeless how the fuck can you trust giving them huge amounts of power over each other??\n\nHumans are scary, we should calmly spread out, give each other space, and enforce minimal laws to keep us safe and that’s about it. Otherwise it’s just a growing power blob. ",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "mcnello",
                                    "body": "We need a Department of Shoes!!!! How will poor people ever afford shoes without a Department of Shoes!?!?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Vintagepoolside",
                                            "body": "Well, the poor people already can’t afford things like healthcare and we see what happens. So yes, having something to cover these expenses matters. I think a comparison of shoes is a bit obtuse",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "mcnello",
                                                    "body": ">Well, the poor people already can’t afford things like healthcare\n\nGlad you mentioned that! Healthcare is the most heavily regulated industry in the U.S.\n\nFurthermore, the government keeps the supply of healthcare workers artificially low by gatekeeping entry to medical schools. This isn't even a \"minimal standards issue\" or an issue where standards are too strict. \n\nThis government intervention is better defined as: *\"the American Medical Association lobbied Congress to limit the number of medical school students to only xx,xxx this year.\"*\n\nDoctors/nurses in the U.S. get paid WAAAAY more than their European counterparts. If you really want to bring down the cost of healthcare, we can stop treating the medical industry as a jobs program for the upper middle class. \n\nOf course... Reducing the salaries of doctors and nurses isn't politically expedient now is it...\n\nIf you want to bring down the cost of medicine, we can start by removing all of the government regulations which make it extremely expensive to begin with.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "fitnesswill",
                                                            "body": "You could eliminate 90% of the healthcare admin without ever having to touch the amount of money a nurse makes.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "None",
                                                            "body": "PREACH!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "fitnesswill",
                                            "body": "Bahaha, I love this",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Schlagustagigaboo",
                    "body": "Not to mention the fact that since the DOE was formed in the 70s every single statistical educational metric has gotten worse year over year; whereas prior to that things like test scores and economic outcomes resulting from equivalent education were improving. It’s almost like adding a large bureaucracy with no accountability or clear mandates to a taxpayer-funded enterprise just redirects the tax dollars towards the bureaucracy and away from their intended purpose. \n\nKind of like if we eliminated the VA but kept their annual budget the same and just divided it among the people leaving the military each year: they’d each receive $2.6 million if divided equally. I wonder what the veterans would say if you asked them if they’d prefer to deal with the VA for the rest of their lives or receive a single 7-figure lump sum? \n\nBureaucracy doesn’t solve problems, it causes them. I don’t think there was a single year the DOE was in operation that a single educational metric ACCIDENTALLY or RANDOMLY improved.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "fanostra",
                            "body": "Exactly. People tend to forget that the US Department of Education as it exists today did not exist prior to Jimmy Carter, and the Department of Health, Education, and Welfare didn't exist before 1953. Somehow we had an education system before this.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "soggyGreyDuck",
                    "body": "Well put, wish I could save this in a way I can just copy reply it all over the place.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "cgo255",
            "body": "It needs a serious overhaul and I'm sure there is rampant wasteful spending...but \"shut it down\" with no plan on record for what to do after is just insanity.",
            "score": 7,
            "replies": [
                {
                    "author": "DEL-J",
                    "body": "I completely disagree with you. Shut it down. No need to do anything directly related at all. How many people have the same sense as you? How many students go to private schools for a fee?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cgo255",
                            "body": "About 16% of kids went to private school as of 2022 after a quick Google search. Why does that matter?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DEL-J",
                                    "body": "That’s the point. Many people are paying for the public school AND paying more to attend a private school. Without being forced to pay for a public school, more people will be free to attend private schools.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "cgo255",
                                            "body": "\"Without everybody's taxes helping pay for public education, more people would be free to pay their hard earned money to send their kids to private school.\"\n\nI guess next we should eliminate the DPW and rip up all the roads.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "DEL-J",
                                                    "body": "That is literally the point that I am making and have been making the entire time. If you don’t understand its relevance, then that is a major problem.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "cgo255",
                                                            "body": "I completely understand. I just think it's a ridiculous and dangerous way of thinking.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "DEL-J",
                                                                    "body": "You’re right, it’s ridiculous and dangerous to think that having mass money extorted for no benefit is excessive and unnecessary. Definitely dangerous and ridiculous to think that humans, who have survived on their own with NO education before society developed that, could possibly exist without being forced to pay for things invented after the species made progress.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cgo255",
                                                                            "body": "Progress is a good thing...you want to go backwards.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "gwhh",
            "body": "Her brother is Eric Prince.   The founder of black water mercenary firm!",
            "score": 15,
            "replies": []
        },
        {
            "author": "Uberquik",
            "body": "Just let me go teach math.  Don't make me get some boxed curriculum, don't give me a script.  Just let me keep doing what I do and I won't care, give me what was promised, and we're good.",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "Shut them down. Same with USAID. Dept of Energy and EPA can probably also go too.",
            "score": -7,
            "replies": [
                {
                    "author": "BeardedMan32",
                    "body": "DEA as well, they do more harm than good",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "anonymousscroller9",
                    "body": "Epa is kinda important sometimes but I agree it needs to be shrunk",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Chill out on the EPA lol",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "Yugofgoblin",
                    "body": "I'll add the CIA, ATF, and most other three letter government organizations.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "None",
                            "body": "I don't mind the CIA, assuming they stick to only operating outside the US. But the NSA can F off with their surveiling of US citizens.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Yugofgoblin",
                                    "body": "The CIA has done so many horrible things to people all over the world and here. I don't see how they can justify their existence.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "swimming_cold",
                                    "body": "Lol you don’t know much about the CIA then",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "I mean they are literally precluded from operating domestically in their charter. Does that mean they follow it, no. But I would be on favor with fixing that instead of scrapping them entirely, because not having a foreign intelligence service would disadvantage us significantly compared to countries that do.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PM_ME_DNA",
                                    "body": "NAP violations are not good even outside US border.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mrchu13",
                                    "body": "The CIA is an agency that seems to do whatever they want in the world without zero accountability. Screw them.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}