{
    "title": "Accenture recently joined the list of companies that have scrapped DEI policies. What changes did Trump make for them to do this?",
    "author": "sunherisadke",
    "subreddit": "Libertarian",
    "rank": 425,
    "score": 2,
    "upvote_ratio": 0.54,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Libertarian/comments/1ilp358/accenture_recently_joined_the_list_of_companies/",
    "id": "1ilp358",
    "selftext": "If companies are so quick to scrap their DEI policies now that Trump is in power, what exactly made them have those policies in the first place as private companies? And what exactly has Trump changed that these companies feel that the environment is right to scrap these policies? Also if they are scrapping it, it must mean its a total failure so any studies on that I can find? Why were they waiting for Trump to win and sticking with them for so long is what I don’t understand and why did they even adopt them in the first place?",
    "comments": [
        {
            "author": "Son_of_Sophroniscus",
            "body": "It was a bunch of virtue signalling man. Just like the \"end racism\" that used to be in the end zone of football games.",
            "score": 18,
            "replies": []
        },
        {
            "author": "patbagger",
            "body": "They felt pressured by the government to push DEI, now they no longer feel that pressure or feel the pressure to remove it.\n\nIt happened really quickly for most companies, so I think it's the removal of government pressure.",
            "score": 21,
            "replies": [
                {
                    "author": "FakeRedditName2",
                    "body": "Add to this, a lot of those DEI policies included overhead (specialized employees, special training courses, etc) that were costing the company money and not really giving all that much back in return profits. So one the government pressure to continue DEI was gone they dropped the unneeded cost.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "dilbadil",
            "body": "> What exactly made them have those policies in the first place as private companies?\n\nIt's a public company but whatever.\n\n> And what exactly has Trump changed that these companies feel that the environment is right to scrap these policies?\n\nAccenture Federal Services does a lot of business with, you guessed it, the federal government. Why shoot yourself in the foot with DEI policies with Trump in the White House?\n\n> Also if they are scrapping it, it must mean its a total failure so any studies on that I can find?\n\nScrapping something doesn't = total failure. Even if ACN reaped massive benefits in previous years, the current admin might still cause ACN leadership to cancel policies in the hopes of improving their odds of winning government business. Anyways, some stuff will still be around like the employee resource groups as well.\n\n> Why were they waiting for Trump to win and sticking with them for so long is what I don’t understand and why did they even adopt them in the first place?\n\nThere's no \"waiting for Trump to win\", you just go where the money is. Dollars to donuts they wouldn't be so publicly cancelled if Harris won instead.",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "ESG scoring meant they would only be allowed to make money if they played the woke game. Esg scoring over profit was ruled as misleading investors in a court case a few months ago. \n\nThis case (among many other examples) demonstrated that DEI does not increase profit, and is actually a legal liability. \n\nMajor studies that ostensibly showed DEI was profitable turned out to be bogus. Which makes perfect sense. How would race trump merit??? If race actually did trump merit, as those who claim DEI is profitable swear, THAT would be racist af. It would prove some kind of race essentialism, which itself is a theory of the most racist people in history. \n\nNow Trump has pointed out, correctly, that per civil rights law DEI hiring and programs are actually illegal and directed his agencies to look out for private companies breaking the laws. Again, the CIVIL RIGHTS LAWS that have existed for half a century.  These laws demand meritocratic judgment and fairness in hiring and such, WITHOUT regard to race. They demand colorblindness. So DEI was always illegal, as it is 100% based on racism, whether you see that as good or bad, it is NOT colorblind. They were only allowed because the previous administration in the White House was racist woke asshats. And they were only carried out because money was held hostage by esg bullshit. \n\n So companies are no longer forced to play this dumb fucking game. Surely the vast majority never wanted to anyway. Anyone with a brain can see merit hiring makes money, not mindless diversity goals. Now they are free to drop the act and hire based on merit alone, as the laws require. \n\nhttps://notthebee.com/article/american-airlines-just-lost-a-case-over-their-commitment-to-esg-practices-and-how-it-affected-401ks-heres-why-thats-a-big-deal\n\nhttps://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/\n\nhttps://notthebee.com/article/mckinsey-studies-used-to-justify-and-promote-dei-in-the-workplace-as-a-positive-for-business-were-just-shown-to-be-unreliable-yeah-the-results-show-dei-is-bad-for-businesses",
            "score": 23,
            "replies": []
        },
        {
            "author": "mack_dd",
            "body": "I am guessing they had DEI policies previously because they were hoping to snag a government contract, and DEI was a \"soft requirement\" to be considered.\n\nThe requirement has been removed, so why bother with it.",
            "score": 3,
            "replies": [
                {
                    "author": "SpamFriedMice",
                    "body": "What they were hoping for was investors money. \"Woke\" companies got a ESG scoring used by investors (or more accurately by the company that makes the programs investors use). The higher your score the more your company would be recommended to the guy in charge of investing the company's retirement plan.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpamFriedMice",
            "body": "Investors don't throw darts at a wall or consult a mystic to choose what companies to invest someone's retirement account in anymore. They use computer programs. \n\n\nBlackrock, besides being the largest financial management company on the planet, also make the computer programs everyone uses to figure out what stocks to choose. \n\n\nLong story, but Blackrock decided to give companies a score based on their stance on environmental and social issues. This scoring is very important to any company, as having a large city or company invest their employees 401k in you will greatly effect your stock price. \n\n\nThis is also why you started seeing companies putting mixed race or LBGT couples in their advertising. \n\n\nThese same companies also implemented DEI hiring practices. \n\n\nAfter the BudLight debacle Blackrock slowly backed away from this rating scheme and these hiring policies companies had been using have out lived their usefulness. \n\n\nSounds like companies have decided that hiring someone based on qualifications instead of race works better. ",
            "score": 2,
            "replies": [
                {
                    "author": "sunherisadke",
                    "body": "But what does blackrock get out of it? Whats the collusion dynamics b/w big business, politicians and activists? Why are they scraping it back now?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "txeagle24",
            "body": "A large number of companies that do business with the federal government are pausing DEI/DEIA in their marketing, training, and hiring efforts.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ledoscreen",
            "body": "It's the result of just taking the pressure off. It's like removing the requirement to use a fifth wheel when driving.",
            "score": 0,
            "replies": []
        }
    ]
}