{
    "title": "What Does It Mean to Be Libertarian in 2025?",
    "author": "DIDO2SPAC",
    "subreddit": "Libertarian",
    "rank": 395,
    "score": 9,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 36,
    "url": "https://www.reddit.com/r/Libertarian/comments/1imjdjd/what_does_it_mean_to_be_libertarian_in_2025/",
    "id": "1imjdjd",
    "selftext": "I understand the textbook definition of libertarianism—emphasis on individual liberty, limited government, and free markets—but I’m curious about how people define it in today’s world.\n\nWith shifting political landscapes, increased government intervention (in some areas), and growing debates around corporate power, what does being a libertarian mean to you in 2025? Is it the same as it was 10, 20 years ago? Have your views evolved?\n\nWould love to hear different perspectives, especially from those who’ve been involved in libertarian movements or have seen changes in how the philosophy is applied.\n\nHonest question, and asking outside, of the current political climate. Hopefully it would be ok asking questions more involved with the climate further in discussion but that's not the agenda of the question.\n\nIf it matters, I'm from Massachusetts, and I am rather center of the current red and blue system. I do support social democratic policies specifically in Massachusetts because I see how they effect my family, myself and my friends who are ultimately the most important thing to me.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Perfect-CountryX",
            "body": "Libertarians often overemphasize that all of your views are textbook and will criticize each other with purity test to see who is the most consistent with “True” libertarian values. \n\nI think a better way is to articulate that you have libertarian views on specific issues. It should not be a sin to have some conservative views, or some liberal views or some libertarian views (on various issues: immigration, abortion, taxes, foreign policy etc)\n\nI’ll add that if a government policy is moved toward a more libertarian policy that can be celebrated.\n\nFor example: a libertarian may argue for 0% income tax. But it’s ok to celebrate income taxes going from 39.8% down to 37% or whatever.\n\nAnyway - that’s my two cents!",
            "score": 14,
            "replies": [
                {
                    "author": "OpinionStunning6236",
                    "body": "I agree. Any step in the right direction is nice. And it would suck to ostracize people who share our goal of decreasing the involvement of government in our lives just because they happen to have some views that aren’t fully libertarian",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "kojitsuke",
                    "body": "This is me. All my adult life I thought I was a pure “conservative” but noticed I had some different views like arguing to legalize marijuana back in 2010, supporting gay marriage, being skeptical of police and government overreach, hating a lot of dumb stuff Trump does but still finding him a much better candidate than Harris. Then I stumbled upon Libertarianism and found that my DNA is really more aligned here.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Scared_Sample_3134",
                    "body": "This feels like me. Even though I’m personally more conservative, I just want everybody to have the ability to choose. I can appreciate some liberal policies too. Would love to see less money being sent abroad but maybe using that to fund 6 months of paid maternity leave for moms (a girl can dream!). But at work I feel like a square peg in a round hole. They’re all liberal and only seem to see things one way 🤷‍♀️",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "guhman123",
            "body": "Im all for the actual definition of libertarian, but i feel quite a few people here are mistaking libertarian for conservative, when it is independent from the left-right spectrum.",
            "score": 21,
            "replies": [
                {
                    "author": "DIDO2SPAC",
                    "body": "That's not me, sorry if it felt that way",
                    "score": 2,
                    "replies": [
                        {
                            "author": "guhman123",
                            "body": "No, i didn’t suggest anything about you. Just pointed out a seemingly common misconception that can get people thinking that libertarianism is a solely conservative quality. The values of a true libertarian doesn’t change over time, as the definition is its inherent existence, but popular exterior views of it changes with the times.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "WaltKerman",
                                    "body": "To be fair it's the line is vaguer than it used to be.\n\nTen years ago there was no party who would create a department of government efficiency, or allow Ron Paul to advise.\n\nToday there is only one party who would never allow that. Libertarians are getting a lot of once in a lifetime gifts from the current administration.\n\nTwenty years ago I would have bet the democrats would have been the ones to do it if I were to guess. Weird times.\n\nhttps://x.com/ronpaul/status/1889048160942924235?s=46&t=yclSTXQ5KTK6aHBDnE5GLg",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "guhman123",
                            "body": "what in the hell are you on about? i said literally nothing about the economy.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "guhman123",
                                            "body": "your logic is sound, but your premises are incorrect. the right is not inherently in support of free markets. the left is not inherently in support of state-controlled markets. \n\nthere are numerous examples of countries ran by right-wing nationalists who were anti-free market, such as Nazi Germany, fascist Italy, and currently China (yes, I know they call themselves communist, but in practice they have embraced traditional values, strongly opposed labor unions, and has pushed back against a number of civil rights movements under Xi Jinping). \n\nThere are also a number of countries ran by left-wingers who support the free market, such as Sweden, the UK under Blair, and Brazil under Lula.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "guhman123",
                                                            "body": "I am more than happy to define left and right so our discussion has the same basis. According to Dr. Andrew Heywood, a well-known political scientist and professor, the Left is characterized by \"ideas such as freedom, equality, fraternity, rights, progress, reform and internationalism\" while the Right is characterized by \"notions such as authority, hierarchy, order, duty, tradition, reaction and nationalism.\" By this definition, the examples I gave do decisively fall under the respective sides of each political spectrum.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "guhman123",
                                                                            "body": ">the right in the US would fall under the left\n\nI think you forgot the part of a decent argument where you back your claim with reasoning. At a first glance it appears to me that the American right seems to support authority, duty, tradition, and nationalism, which would make it align with the original definition of the Right. Mind to convince me otherwise?\n\n>Libertarianism would also fall more to the left\n\nYou proceed to prove this claim wrong with your subsequent claim about the political spectrum, as I will explain:\n\n>The political compass model is a far more useful definition\n\nThe political compass has 2 dimensions for a reason. left/right (left/right) is independent from auth/lib (up/down), you can place a dot anywhere on the compass, top left *or* top right, and this contradicts *your* original claim that libertarianism is tied to any one side.\n\n>the one your using is the original meaning\n\nWhat generally accepted definition do you suggest we use as reference instead of its original meaning? If you consider the political compass as a \"definition\" of left and right, you disprove your original claim as I explained above. In my opinion, the original meaning seems to be the most generally accepted meaning and more modern meanings can be more politically subjective and unproductive to discussions.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "guhman123",
                                                                                            "body": ">The right in the US focuses on rights, freedoms and equality as well\n\nThis is kinda true and kinda not true. The Right in the US does not inherently support, for example, gun rights. \n\n>Not really as libertarianism is incompatible with command economies, it's antithetical to freedom.\n\nYou forgot to include the first half of the quote where I explained my reasoning. You can't just ignore my reasoning and not provide a rebuttal, that's called conceding an argument. Please read my *entire* argument and rebut my reasoning? \"The political compass has 2 dimensions for a reason. left/right (left/right) is independent from auth/lib (up/down), you can place a dot anywhere on the compass, top left *or* top right, and this contradicts *your* original claim that libertarianism is tied to any one side.\"\n\nAs to your obsession with command economies, you have failed to prove thus far that command economies have any tie to either the left or right, and as a matter of fact you contradicted yourself on this by bringing up the political compass. According to the political compass, it is, indeed, antithetical to libertarianism, but just as with libertarianism, you can place a dot anywhere on the political compass on the bottom (authoritarian) half and it can be on either side- left or right. The whole point of the political compass is that there are 2 dimensions that are independent from each other - left/right and auth/lib. You would know this if you addressed me saying this exact same thing in my previous reply. \n\n>The modern definition of left and right being economic ideas. Leaving it to the old definition is entirely too vague, essentially if you aren't a monarchist you're on the left.\n\nI'm down to use this definition instead of the original definition, and I assume you are referring to it in the sense of the political compass being economic on the x-axis and freedom along the y-axis. Both of your points, that libertarianism is tied to the left or right, and that a command economy is an inherent practice of the left or right, are disproven by the fact that the political compass denotes economy and freedom as independent factors from each other. \n\n>It's not, as it's far more subjective than the political compass model. Again, the original definition is regarding monarchy vs republicanism.  Anyone opposed to a monarchy is on the left. That's a wide range of opposing political ideologies.\n\nAlright, let's use the political compass definition from now on. Please read my reasoning through and either rebut them or concede this time. \n\nBy the way, thanks for the civilized discussion. It's a breath of fresh air to not have an argument degrade to personal attacks on a platform such as this.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "[removed]",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "guhman123",
                                                                                                            "body": "I see you are now defining libertarianism as solely \"the opposite of authoritarian\", but we were originally discussing whether or not libertarianism has any ties to the right or to the left. Since you present the definition of libertarianism as explicitly the opposite of authoritarian, does that mean you now agree that it, by definition, has no ties to either the right or the left? \n\nThank you for keeping this discussion civilized and are responding to my points.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "[removed]",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "guhman123",
                                                                                                                            "body": ">No, I'm saying libertarian on the political compass is being used that way and doesn't relate to libertarian philosophy.\n\nIf ‘libertarian’ on the political compass isn’t the same as libertarian philosophy, then why did you introduce the political compass as a way to define or analyze libertarianism at all? My original claim was about libertarianism as it exists in real-world beliefs, so if the political compass doesn’t reflect that, then it’s irrelevant to this discussion.\n\nJust to be clear, my claim is that someone can be a libertarian while holding either left-wing or right-wing political beliefs. That’s a statement about actual libertarians in the real world, not the abstract ‘libertarian’ label you’re pulling from the political compass. If you disagree, then I’d appreciate a direct response to that claim instead of shifting the focus to an unrelated definition.\"",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "None",
                                                                                                                                    "body": "[removed]",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "guhman123",
                                                                                                                                            "body": ">Because it can used to define and describe all political ideologies...\n\nSo now you are saying that the libertarian term in the political compass CAN be used to refer to libertarian ideology? I have had enough of your moving the goalposts whenever I raise a perfectly fair point against your claims. \n\n>Libertarian on the political compass isn't describing libertarian philosophy, it's being used to describe a stance on social issues.\n\nLibertarian philosophy is used to describe a stance on real-life social issues. Your disparaging of libertarian philosophy as nothing of worth is evidence that your claims have been made in bad faith, and that you refuse to accept any outside information than that which is already so deeply ingrained in your mind. \n\n>You've yet to defend this claim under either definition of the left/right terms.\n\nI have already defended this claim by pointing out that the political compass is 2-dimensional in nature, where the two axes are independent from each other. You proceeded to try to refute that by claiming the \"libertarian\" in the political compass is somehow irrelevant to my original claim, despite you being the one calling upon it to back your rebuttals, further proving your refusal to argue in good faith. \n\n>You are continuing to demonstrate that you aren't grasping what I'm saying. The term libertarian as used in the political compass has nothing to do with libertarian philosophy or \"actual libertarians in the real world\"\n\nYou were the one who originally called upon the political compass model to attempt to disprove my claims. You are failing to grasp what you yourself are saying, and refuse to decide whether the political compass is of any meaning to this discussion, or if the libertarian term in the political compass has no relation to do with libertarian philosophy, which is ridiculous. You can't just throw away the entire field of study that explores the meaning of libertarianism just so that you can assert your own meaning in bad faith. \n\nDespite my best efforts to use sound logic and attempt to find a common premise between ourselves to build off of, you have time and time again moved the goalposts, from refusing to acknowledge the value of the original definition of libertarianism to claiming that your made-up definition of libertarianism somehow has more value than the entire field of libertarian philosophy, manned by countless experts with several magnitudes of more experience than either of us. \n\nI have attempted to steer this discussion back on track, only for you to make arguments in bad faith and clench onto the idea that your completely arbitrary and abstract definition of libertarianism is of any more relevance to the discussion than libertarian philosophy, which explores the actual, real life characteristics of libertarianism in action. I will no longer be the hind end of a bad-faith argument. Have a good day, and consider enrolling in a logic class next semester.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "gfunk5299",
            "body": "Here is my take.  Communism in a vacuum is probably the best for of government.  That doesn’t work in reality.  Pure capitalism would be a great way to live, but that doesn’t exist in reality either.  The same goes for libertarian.  Any of these forms of government in their purest form would be great.  But humanity has to fuck them all up.  Greed, jealousy the pursuit of women.  All reasons why any government breaks.\n\nThe real question, similar to op, which government can best exist slightly modified to get the most out of humanity while minimizing our weaknesses?\n\nI think you need a blend of capitalism, libertarianism and some socialism to best govern a society.  You need a government with individual liberty and freedom where the vast majority of what you work for is yours and protected by government.  You also need a society with enough social support to keep the most despondent from becoming desperate.  Plus it’s just the right moral thing to do.\n\nI believe most of those core values live in libertarian views within a mostly capitalistic state.",
            "score": 5,
            "replies": []
        },
        {
            "author": "byond6",
            "body": "Libertarian principles haven't changed.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ImIntroverted",
            "body": "I’ve been a member of the party for ~20 years now? I would argue that not much has changed if anything. The thing that drew me to the party was individual liberty, which also includes intraparty. We all have the right to our own freedoms as long as it doesn’t interfere with others freedoms (NAP). Most of us agree to some extent on the limited government, some more limited than others, and that’s OK! Political landscapes have really only shifted with the big 2, I feel like our party leaders have been pretty solid on their policy, within discretion, and we’ve consistently gained percentage points over the last couple of elections. I don’t feel like we as a party need to do anything other than be ourselves and share our thoughts and ideas with others and let them know that there are still choices. Some will say I’m a little too deliberate with this approach and want to make some big push, but big pushes come with big falls, just keep plugging away and we will get there. I’m just happy more people are looking into Libertarian principles.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jcbm52",
            "body": "I believe that being a libertarian now is the same as it was not 10 or 20 but 100 years ago, maybe 50 if you are Anarcho capitalist and any libertarian that has read at least half a book knows that the same values from there still apply to libertarian ideology today, despite advancements that may have happened.\n\nIt is true that in the new political landscape, libertarianism is associated with the new so-called \"far-right\" movement (Trump, Macron, Meloni, for example). Two things that don't help are some of these leaders trying to pretend to be libertarians (like when Trump claimed he was a libertarian, there's also some people in this sub who are actually just conservative) and Milei, a libertarian leader, positioning himself more closely with this group.\n\nIt is true that libertarianism, if it really had to be placed in one of these current political blocks (current left and right wing) would arguably be better placed in the right, but it doesn't have to and it is really its own thing.",
            "score": 5,
            "replies": []
        },
        {
            "author": "uknolickface",
            "body": "You believe in the NAP",
            "score": 2,
            "replies": []
        },
        {
            "author": "BoringGuy0108",
            "body": "For me, I've gradually moved from a deep distrust of the government to also include a deep distrust of mega corporations. I've grown uncomfortable with how much big business and the government influence and feed off each other and the amount of power they have over everyday life.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Western_Blot_Enjoyer",
            "body": "Because a classical liberals all the way to anarcho-capitalists are both considered libertarian by today's standards, \"libertarian\" casts a pretty wide net. I think being a libertarian means that you value negative freedoms, natural rights, a free market, and have low time preference. \n\nIn practice, I think being a libertarian in 2025 means doing what you can to get society closer to representing these values.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fuck_The_Rocketss",
            "body": "Rally around Dave Smith and the Mises Caucus. Push for tangible wins that push the nation in the right direction rather than dying on a hill of principled purity.",
            "score": 2,
            "replies": []
        },
        {
            "author": "natermer",
            "body": "\"Corporate power\" and \"government power\" are two sides of the same coin. \n\nThe biggest mistake in modern thinking is that we need government to offset the power of these massive corporations.  The problem with that line of thinking is that the government not only depends on these massive corporations for how it is structured, but those massive corporations depend on the government structuring the marketplace in order to exist in the first place.\n\nThat is they are dependent on one another. \n\nThese gigantic public corporations are not the creation of free market forces or happenstance. They were created on purpose by the people in power through market regulation and central banking. \n\nSo the rise of corporate power is a reflection of the rise in government power. And visa versa.\n\nWhich means that logically you can't hate/fear one without hating/fearing the other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JonnyDoeDoe",
            "body": "For the last 40 some years I've oscillated between calling myself a constitutionalist, libertarian, and Classical Liberal... \n\nMany of my libertarian views would be encapsulated with a return to the constitution in the form of its original intent.... When I consider government purposes, I'm definitely in the camp of the government which functions best is that which is closest to you, with any concentric governing bodies having less influence over me the further that it is from me... \n\nI basically use the title of classical liberal to provide a definitive base from where I derive my foundational beliefs towards government, and to clear up any nonsensical anarchy confusion when the Rothbardians crashed the party...",
            "score": 1,
            "replies": []
        }
    ]
}