{
    "title": "Such taxes, much waste",
    "author": "Illustrious-Mud-7996",
    "subreddit": "Libertarian",
    "rank": 383,
    "score": 36,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/Libertarian/comments/1imprt9/such_taxes_much_waste/",
    "id": "1imprt9",
    "selftext": "In spirit of DOGE and libertarianism, I created a website to help more people understand the effect of wasteful government spending on their personal bottom line.\n\nI’d appreciate if you checked it out and told a friend!\n\nhttps://suchtaxesmuchwaste.com",
    "comments": [
        {
            "author": "Mojeaux18",
            "body": "Can you total the waste known so far? When it’s split like that it looks minuscule.  \n\nGreat job though.  Smooth.",
            "score": 9,
            "replies": [
                {
                    "author": "Illustrious-Mud-7996",
                    "body": "Thank you! I’ll add more waste categories as I can find the data:) I like the total idea too",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Illustrious-Mud-7996",
                    "body": "Added the total spend on each item!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Mojeaux18",
                            "body": "Not what I meant, yet still pretty good.  \nWhat I meant was a roll up like:  \n  \nUSAID: $12\n+ Puppy training in Haiti $1\n+ underwater basket weaving in Mongolia $1\n+ cement tshirt lauchers in Gaza $10\nEtc",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Illustrious-Mud-7996",
                                    "body": "Makes sense! Will look to add this, need better data too:)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Illustrious-Mud-7996",
                                            "body": "Added this! See other updates in earlier comment",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JamminBabyLu",
            "body": "Love it. Thanks for reminding me why I avoid taxes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FoxyPhil88",
            "body": "Fine work, I look forward to sharing with others\n\n*at the opportune moment*",
            "score": 2,
            "replies": []
        },
        {
            "author": "cloudywithanopinion",
            "body": "Interesting, Im Canadian so not my lane, but it seems like defence is a major cost. It’d be interesting to see real waste removed like Israel, auditing the defence budget, and space exploration. Everything else is cutting low hanging fruit that helps individuals. Who really cares about going to space? People that do should pay for it themselves.",
            "score": 3,
            "replies": [
                {
                    "author": "Hack874",
                    "body": "I think there’s benefits of military space spending. That’s going to happen sooner or later and we’ll need a force to defend our future interests/projects in space.\n\nBut yeah, audit the shit out of the Pentagon and stop all foreign aid.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "cloudywithanopinion",
                            "body": "I mean the same can be said for using aid abroad for soft power and as leverage to those countries in the future for political power and resources. I personally think its all a waste if you cut one cut it all.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Hack874",
                                    "body": "I mean we’re gonna need a space budget either way, and I’d much rather it go to the military who will defend our interests once international space cooperation inevitably breaks down than NASA dicking around with their rovers and taking pictures for instagram",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "cloudywithanopinion",
                                            "body": "I never suggested eliminating space defence specifically, but you agree that some of the space budgets are probably wasteful, (NASA) just not all of it. I don’t support any country cutting all military spending. However, if you believe there is waste in other areas, I don’t think we should argue against the idea that the DOD likely also has waste. I'm not sure where the main argument stands here.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Opening-Wasabi-9018",
                    "body": "The point is. All government spending is wrong.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ravinggenius",
            "body": "This website is great! I'd love to see a full breakdown of everything, as what is considered waste differs from person to person.",
            "score": 1,
            "replies": [
                {
                    "author": "Illustrious-Mud-7996",
                    "body": "Thank you! Thinking about ways to include more categories of spending:)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "rakedbdrop",
            "body": "Nice work! I didnt know there were so many SWEs that were libertarian.",
            "score": 1,
            "replies": [
                {
                    "author": "Illustrious-Mud-7996",
                    "body": "Thanks @rakedbdrop!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "I'd bet money that it's probably the most prominent profession among libertarians",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rakedbdrop",
                            "body": "Sadly I only see / interact liberals -- but maybe thats because im in the NY area. \n\nNot that I think all liberals are bad. I think the oppisite. But the super duper liberals. Those ones I just try to avoid. \n\nSame with super far bible thumping right people.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Illustrious-Mud-7996",
            "body": "New updates:\n- lots more waste tiles\n- roll-ups by top wasting agencies\n- total waste display\n- tiles are clickable to individual sources\n\nKeep feedback rolling - thanks!",
            "score": 1,
            "replies": [
                {
                    "author": "Illustrious-Mud-7996",
                    "body": "Added filters for defense, dei amd interest expense",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}