{
    "title": "The hysteria is hilarious 😂",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 340,
    "score": 411,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 29,
    "url": "https://i.redd.it/r5x3tu2xepie1.jpeg",
    "id": "1inxow3",
    "selftext": "",
    "comments": [
        {
            "author": "Pancakesex",
            "body": "bud, I’m not meaning this confrontationally, you need to touch grass. every post on this sub is you",
            "score": 124,
            "replies": [
                {
                    "author": "Immediate_Total_7294",
                    "body": "He has 150000+ karma over two years.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Inevitable-Waltz-889",
                    "body": "Bro likes liberty.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "sophistibaited",
                    "body": "Welp, that wouldn't need to be the case if reddit hadn't pruned most of the more vocal members over the years. Good on him for keeping the sub's visibility high. \n\nr/libertarian may be out numbered on this platform, but reminding them that some of us are still quietly lurking and still have an active community here isn't necessarily a bad thing.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Cubicleism",
                            "body": "The libertarian subs are doing it to themselves. I got banned from libertarian memes for providing stats on how Twitter is actually in the shitter as a profitable and effective business",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "sophistibaited",
                                    "body": "I mean to be fair, Elon's acquisition of twitter wasn't solely about profitability. His was a more principled buy. Second, all you have is leaks. Since X's financials are now private, all you have is speculation based on leaks. Third, the old censorship apparatchik of Twitter is an odd thing to indirectly come to the defense of in any Libertarian setting.\n\nI feel like you immediately call into question your bonafides once you go too far down the path of \"Twitter was better back in my day\".",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Cubicleism",
                                            "body": "I work in social media so I have other stats besides just public profits. User stats are available publicly and Twitter is the only platform seeing a decline in users and advertisers, who have all been very vocal about decreasing their spend. \n\nI also have all of my stats from the professional profiles I managed. Twitter saw sharp decreases (over 50%) in engagement and reach when Elon started fucking with the algorithm and it's never recovered. My company stopped using it because we got nothing out of it anymore. It wasn't worth the man hours or ad spend.\n\nHe did win an election and an elite position in government by purchasing it which is worth noting. But as a social media platform that is effective for advertisers and businesses it hasn't succeeded or improved\n\nETA: polite discourse like this still doesn't deserve a ban",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "LoneHelldiver",
                                                    "body": "I think it's cute that you think \"social media\" is work.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Cubicleism",
                                                            "body": "It's just a part of my job. I also do photography, web design/upkeep, videography, graphic design, presentations, and a few other things. Anything people will pay you to do is work 😉",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "sophistibaited",
                                                    "body": "That's interesting because reddit's own AI admits that it is losing subscribers and users as well. Additionally, because of the nature of how you're pulling your data, it's incredibly speculative to derive profitability from user count alone. \n\n\nI think you're discounting the bot pruning that has happened in the space over the years. There's a splintering that's happening as well with user bases. Regardless of how you cut it x is still the dominant social media platform in the space. \n\n\nInnovations in Grok and other features as well as the Free speech model as a first principle, will only contribute to its future success.\n\n\nI feel like the advertising industry in the space contributes to the crony capitalism we see plaguing our society. When big companies get in line with the government and it informs their messaging policies and PR departments, that's literally a tenant of fascism.\n\n\nI don't understand how you square this with a libertarian bent. \n\n\nAnd I definitely agree. There's no reason to censor this type of discussion. So long is it remains civil.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Cubicleism",
                                                            "body": ">That's interesting because reddit's own AI admits that it is losing subscribers and users as well.\n\nThat's interesting because reports from Q4 last year show an almost 40% increase in unique daily users YOY.\n\nFair enough that user count is speculative for profitability, but advertiser count isn't. I'd be curious to see Twitters profit reports if Elon ever decides to share them.\n\nI do firmly disagree that Elon is promoting a free speech model though. He is pretty blatant about banning accounts he doesn't agree with. \"Free speech for me but not for thee.\" \n\nRegardless I respect your opinions and this has been a lovely chat. This sub is one of few places I feel like civil discussions still occur.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SlasherHockey08",
            "body": "Or you know… won’t someone think of the constitution or rule of law",
            "score": 12,
            "replies": []
        },
        {
            "author": "dirtgrub28",
            "body": "How do you convince someone the \"deep state\" is an issue....?  Create your own deep state to fuck with theirs",
            "score": 22,
            "replies": [
                {
                    "author": "None",
                    "body": "An elected president promising to be publicly and transparently auditing the gov and cutting out waste, and then doing it, is not a deep state though. ",
                    "score": -6,
                    "replies": [
                        {
                            "author": "shabamsauce",
                            "body": "We have been asking for this for years and now that it’s happening it’s “not quite how we envisioned it” so it’s bad. Typical no true Scotsman shit from this sub.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ACdirtybird",
            "body": "I don’t get the sympathy for government workers. They finally get scrutinized at work just like we all do every day of our existence and it’s the worst thing ever. These people spend our tax dollars recklessly with zero accountability…. Just makes no sense",
            "score": 1,
            "replies": []
        },
        {
            "author": "gwhh",
            "body": "Good one.",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "Would someone please poster size this meme and present it on full display at every 5051 protest?  Thanks in advance!",
            "score": 1,
            "replies": []
        },
        {
            "author": "StuntsMonkey",
            "body": "![gif](giphy|ZgNNWfxnigw3RZytfa)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_Listen495",
            "body": "Reminds me of the scene in the movie The Last Emperor, when the all the eunuchs get kicked out of the Forbidden City",
            "score": 0,
            "replies": []
        },
        {
            "author": "IntrinSicks",
            "body": "Right, like what the hell is everyone freaking out about every president campaigns on fixing the fraud in government, a politician that does what he promised what the hell is that! It's just more Trump derangement syndrome and I'm so fucking tired of it I heard a morning broadcaster on the radio this morning say Trump could cure cancer tomorrow and thise same people would rather die than take the cure, and I believe it",
            "score": -28,
            "replies": [
                {
                    "author": "dawgfan24348",
                    "body": "So you just believe anything Trump says? And yeah it’s a tad concerning that a billionaire can just waltz right in with zero verifications other than donating lots of money and wield the power he does. I know libertarians like to think of business people as somehow benevolent but Elon is not that. It should come as no surprise that Trump has made out all asylum seekers as evil or lazy moochers while saying he’ll grant white people from SA asylum",
                    "score": 8,
                    "replies": [
                        {
                            "author": "YoureMyTacoUwU",
                            "body": "there are two general problem groups from the open border policies of biden and mass migration. one includes human traffickers, drug smugglers, cartel members, and terrorists (these are who the trump admin have been prioritizing). the other arent asylum seekers, they are economic migrants defrauding our asylum system. you dont get to walk through 15 countries where you can claim asylum in and expect the US to take you in. disincentivizing mass migration and asylum fraud also prevents those who are innocent migrants from dying in the elements and being abused, raped, recruited, or sex trafficked by the cartels",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "sophistibaited",
                            "body": "I mean, in the same vein, do you just disbelieve everything Trump says?\n\nSeems to me, an audit of our spending, especially given the transparency that's coming along with it over at [DOGE.gov](http://DOGE.gov) , is *exactly* what we needed, at this *exact* moment in time.\n\nI'm curious, as a Libertarian, in what form did you think any REAL oversight would have come?\n\nDo you think the bureaucrats were going to audit *themselves?*\n\nDid you truly believe someone without money and influence was going to simply stumble into a position to perform such tasks?\n\nThis is literally the best case scenario, unfolding before your very eyes- and all you can do is pick at it and find fault? Come on man. Get it together.\n\n>Trump has made out all asylum seekers as evil or lazy moochers while saying he’ll grant white people from SA asylum\n\nThis simply isn't true. What you're sharing is an unfortunate inference. And if I'm candid: the inference of someone who clearly harbors a bias to have inferred exactly that, regardless of any clarifications made to the contrary.\n\nEdit: Don't just downvote. Be better. Let's chat.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "dawgfan24348",
                                    "body": "Oh please if Elon and Trump actually cared about government spending they wouldn’t be spending billions on Israel which they continue to do. Your belief in Trump despite his history of lying is sadly pretty common with a lot of his supporters. Also the president does not have the legal authority to control how spending works that lies with Congress. Also the idea of just any random citizen being suddenly given the power that Elon is given should be extremely alarming especially to libertarians. Once again there are rules and checks and balances that Trump and Elon have stepped around entirely",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "sophistibaited",
                                            "body": "I get what you’re saying, but there are a few things here that don’t really hold up. First off, yeah- the U.S. spends too much money on foreign aid, but acting like this is some unique Trump/Musk betrayal is kinda weird. Every president, Republican and Democrat, has sent money to Israel. If anything, Trump actually cut more foreign aid than most of his predecessors. So if we’re gonna be mad about wasteful spending (which we should be), we should at least spread the blame around fairly instead of acting like this is some personal passion project of his.\n\nAnd on the idea that “Trump has no control over spending”, yeah, Congress controls the purse, but let’s not pretend presidents don’t have influence. If they didn’t, then why would we argue about their economic records? Every president from Reagan to Biden gets judged on spending, so we can’t suddenly say it’s all Congress' fault when it’s inconvenient. Trump’s policies: like them or not - did cut regulatory costs in her first term, shift federal spending priorities, and push for budget reforms. You can argue about how effective he was, but saying he has zero control is just not true. What he's doing now is much in the same vein, only bolder- and quite literally what MANY of us have been pleading for, for years.\n\nAs far as Elon: saying he was just “randomly given power” is like saying Michael Jordan was randomly given NBA championships. Musk became influential because he outcompeted everyone else, not solely because the government \"gave\" him control. We should always be wary of crony capitalism, but Musk’s whole deal has been disrupting bloated industries (like government-controlled space travel and overregulated auto manufacturing). If anything, that’s a net win for free markets.\n\n>there are rules and checks and balances that Trump and Elon have stepped around entirely\n\nCome on man. If that were true, Trump wouldn’t be fighting off 47 lawsuits and half of Washington trying to stop him.\n\nThe system is definitely still working; it’s just that a lot of people don’t like that MAGA is playing the game better than they expected. The reality of this predicament however, is that the checks and balances have been corrupted to provide a shield for the bureaucracy. The corruption has essentially built an immune system in order to self perpetuate. There's no way you don't see that. I refuse to believe you're that naive.\n\nAt the end of the day, you don’t have to like Trump or Musk, but let’s at least be precise with our criticisms. There’s a difference between calling out legitimate issues and just regurgitating the same tired “orange man bad” talking points. If we’re going to be skeptical of power (which we absolutely should be), let’s make sure we’re aiming at the right targets.\n\nBTW: I don't care about downvotes. We can swap downvotes all day if you like. I have plenty to spend. It's the ideas that matter. You want to truly \"downvote\" me, make a cogent counterpoint.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SCB024",
                    "body": "I wish Trump would endorse Reddit. \n\nIt might become a decent site again.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "sophistibaited",
                            "body": "Holy fuck, can you imagine the absolute meltdown? \n\nGlorious.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}