{
    "title": "Just the tip of the iceberg",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 315,
    "score": 1324,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 156,
    "url": "https://i.redd.it/c5qu9hpvpzie1.jpeg",
    "id": "1iowonr",
    "selftext": "",
    "comments": [
        {
            "author": "Spiteblight",
            "body": "The State Dept line iteming $400 MILLION for armored Teslas under food sounds like something we need to stop. Or is Elon waste acceptable?",
            "score": 536,
            "replies": [
                {
                    "author": "ballhardergetmoney",
                    "body": "For what it’s worth, it was the Biden admin that made that order. ",
                    "score": 111,
                    "replies": [
                        {
                            "author": "nimbusnacho",
                            "body": "No one made any order, even the official response is it was a prospective purchase and that nothing about armored teslas or what model was mentioned.\n\nPeople have to learn to take a few minutes to read past headlines.",
                            "score": 145,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "notathrowaway2937",
                                            "body": "https://apnews.com/article/elon-musk-tesla-biden-federal-contract-electric-vehicles-donald-trump-f8f5b07d03f6e0c9d072abd69feedec4",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Spiteblight",
                            "body": "And Biden is a piece of crap, too. I'm just pointing out a corrupt govt under Musk is probably worse",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "jankdangus",
                                    "body": "Yeah, well we see what happens. It will be a huge positive if he starve the hogs in the Pentagon even if his own company SpaceX doesn’t get touched. It’s stills a win if defense spending overall goes down.",
                                    "score": -25,
                                    "replies": [
                                        {
                                            "author": "Spiteblight",
                                            "body": "Nah. He's going to fold NASA into SpaceX and NASA's billions will go straight to him. That's not a win. I don't want to pay for some ahole to colonize a planet.",
                                            "score": 50,
                                            "replies": [
                                                {
                                                    "author": "jankdangus",
                                                    "body": "I actually disagree with you on whether we should colonize Mars or not. It’s of American interest to acquire more territory if that opportunity arise. If we colonize Mars we would be entitled to any valuable natural resources on there. That means more goods and jobs for Americans here at home and thus economic growth. \n\nI said it’s only a win if defense spending OVERALL goes down. It can still go down even without his own defense company funding being cut.",
                                                    "score": -32,
                                                    "replies": [
                                                        {
                                                            "author": "RaptorRex787",
                                                            "body": "If we have the money to colonize other planets, then we have the money to fix ours",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "jankdangus",
                                                                    "body": "Fair enough",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "nuthins_goodman",
                                                            "body": "There are treaties that prohibit politicisation of space",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "jankdangus",
                                                                    "body": "We don’t have to honor it.",
                                                                    "score": -9,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LoafRVA",
                                            "body": "Your perspective is as bad as your username",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "jankdangus",
                                                    "body": "😂",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Helpful-Formal9214",
                                    "body": "No libertarian thinks Trump corruption is going to be worse. The Biden administration was the most partisan, corrupt and ineffective administration we've seen.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Puppygorl6969",
                                            "body": "Really even compared to Nixon? I think you just have it out for Biden lol. ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Poortio",
                            "body": "Stop giving presidents so much power.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Better question: why would the **Biden Administration** do this in the first place?\n\nhttps://preview.redd.it/ghdeh4rx20je1.jpeg?width=1290&format=pjpg&auto=webp&s=15715e2b619677b05b88eface3c8eb1fe390c6c5",
                    "score": 41,
                    "replies": [
                        {
                            "author": "mightybangbang",
                            "body": "You can apply that thinking to every cent the government spends … someone else approved it, not Trump’s problem. Obama didn’t close Gitmo, not Trump’s fault. He was elected to fix this stuff. If the person he hired to do it is doing so selectively to benefit himself it’s right for people to question whether they are actually lessening the choke of government or steering us towards an even more ramped up version of crony capitalism than we already have.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "ddIbb",
                                    "body": "If you actually read the article, you would find that Trump halted the contract.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ItzDrSeuss",
                            "body": "Dude is a Elon fanboy pretending to be an AnCap.",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "Because being a **Military Industrial Complex fanboy** is so much better /s\n\nhttps://preview.redd.it/nt6han8b04je1.jpeg?width=1290&format=pjpg&auto=webp&s=bf8dc16baf5eae20a973592de6582f88bd4ee4ad\n\nConservatives lied us into multiple wars over the last 35 years.  You’re in no position to be criticizing AnCaps.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "ItzDrSeuss",
                                            "body": "Your reading comprehension needs some work. I wasn’t criticizing AnCaps, I said you weren’t one.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "ENVYisEVIL",
                                                    "body": "My flair says AnCap and your flair says boot-licking conservative.\n\nYou initiated a bad-faith rebuttal and I responded accordingly.\n\nIf you don’t want to be ridiculed then debate in good faith.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "ItzDrSeuss",
                                                            "body": "lol brb going change my flair.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "notathrowaway2937",
                            "body": "Biden was trying to push to have an entirely electric fleet. I assume some of them needed to be armored. Seems strange though.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Notsmartnotdumb2025",
                    "body": "Obama wasted 500M on Solyndra.   Where is their CEO today?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "jankdangus",
                    "body": "That was ordered during Biden and I think the Trump administration paused it. I would agree that would be wasteful.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Spiteblight",
                            "body": "They didn't pause it. They just scrubbed the word Tesla from it.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "fitnesswill",
                                    "body": "https://www.npr.org/2025/02/13/g-s1-48571/trump-administration-order-400-million-worth-of-armored-teslas\n\n#Wow, Spiteblight (the Fed) lied again.\n\nStop wasting our tax dollars by posting on Reddit. Get back to work or better yet take the severance package.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "For Reference to Elon's trimming efforts pre-DOGE - see Twitter.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheSmoothBrain",
                    "body": "Get rid of it too. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pskaife",
            "body": "Weren't most of these items bipartisan approved?",
            "score": 53,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Very observant 👌",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 99,
            "replies": []
        },
        {
            "author": "TK-369",
            "body": "Don't fall for propaganda, Republicans are part of every spending bill. The deficit skyrocketed under Trump and Bush.\n\nThe parties aren't the same, but they are symbiotic and the Republicans and Democrats were there with spending every step of the way.",
            "score": 127,
            "replies": [
                {
                    "author": "Puzzleheaded-Task780",
                    "body": "Yes everyone sucks here",
                    "score": 24,
                    "replies": [
                        {
                            "author": "LarryFalwell",
                            "body": "The only true libertarian answer",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "luckysparkie",
                    "body": "True story.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "TK-369",
                            "body": "The parties are like an old married couple! They each just despise the other, yet every day they wake up in same bed.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Based, brother 👌",
                    "score": -9,
                    "replies": []
                }
            ]
        },
        {
            "author": "bongobutt",
            "body": "Democratic? Seriously? Do none of y'all remember Bush? This is not a left/right or political party thing. This is a power thing. D.C. launders money, and they'll use whatever political party they want to do it. Dick Cheney was a Republican up until 5 seconds ago.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Scootch360",
            "body": "If Elon said it, it must be true.  Someone with that level of wealth can't lie",
            "score": 196,
            "replies": [
                {
                    "author": "ToolsOfIgnorance27",
                    "body": "I don't trust anyone in government.\n\nBut I'd be less trusting of someone that can be tempted by the financial opportunity for life-changing nefarious opportunity than the literal richest man in the world. \n\nThey've proven to us over decades what unchecked power does. They do not deserve benefit of the doubt.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "TheoRaan",
                            "body": ">But I'd be less trusting of someone that can be tempted by the financial opportunity for life-changing nefarious opportunity than the literal richest man in the world. \n\nKinda like saying a heroin addict has no need for more heroin so you'd trust him with drugs over someone who's sober.",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "ToolsOfIgnorance27",
                                    "body": "Not even close to being analogous, but whatever makes you feel morally superior, I suppose.\n\nYou assume that the wealthy only achieve their wealth due to nefarious means. This is silly and telling.\n\nMore analogous would be the choice between a starving man and a fat, well-fed man with more food than he can ever eat.\n\nWho's more likely to steal our bread?",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "TheoRaan",
                                            "body": ">You assume that the wealthy only achieve their wealth due to nefarious means. This is silly and telling.\n\nNot what I said. But if you shift the goalposts enough, you'll be right no matter what.\n\n>More analogous would be the choice between a starving man and a fat, well-fed man with more food than he can ever eat.\n\nRight. Who's more likely to steal bread. So someone who's starving because they don't eat bread  (making someone working for the US government being the starving party starving is moronic as hell but I digress) vs someone who's fat because they love or is addicted to bread. \n\nHummmm really isn't the the win you think it is lmaooooo.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GrandmaesterHinkie",
                            "body": "If you think Elon is doing this for altruistic purposes and not for his own personal benefit, then I have some land on the moon to sell you too.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "lumpiaandredbull",
                                    "body": "Lol this guy believes in the moon",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Get_Wrecked01",
                                            "body": "It's where the lizard people live",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Helpful-Formal9214",
                                    "body": "Nobody does anything in politics for altruistic reasons. I like that Trump and Elon have grudges against the government that went after their families. \n\n\n Elon is giving us insight into how wasteful and partisan the /r/fednews offices are. He can be as far from altruistic as possible. Doesn't matter ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ToolsOfIgnorance27",
                                    "body": "Perhaps he's not. But one would be far, far less likely to be tempted at the nefarious opportunity of millions of dollars (which he finds in his couch cushions) than by the average citizen.\n\nAnd, tbf, the man knowingly overpaid for a company (the price conspicuously included \"420\", to show how serious of an economic decision it was) because he wanted to curb censorship. I'm not a conservative, but the progressive influence throughout the tech sphere at the time was obvious). And you know what? He did it.\n\nAnd midwits still called him a dictator (despite, ironically, doing the *opposite* of what dictators do and freeing speech rather than limit it). Can't help stupid people.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GrandmaesterHinkie",
                                            "body": "Out of curiosity, what was the proof that he was limiting censorship? I heard his rhetoric, but I only heard examples of him locking people out of their accounts (ie the flight track guy).",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SlasherHockey08",
                            "body": "Respectfully, anyone who’s against unchecked power should not be OK with an overreach of the executive branch. \n\nEspecially when proper mechanisms to address these things are ignored in favor of not respecting the constitution, the rule of law, or checks and balances.",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "Which-Supermarket-69",
                                    "body": "It’s the dreaded lesser of two evils argument.  It FEELS like the only options are A.  Allow this bullshit to continue or B. Slash it all to the ground, expose EVERYTHING and start over.  Sure technically there’s is a middle ground that potentially exists, but it just doesn’t feel realistic.  It’s all about the vibes man",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "GrandmaesterHinkie",
                                            "body": "I don’t disagree w the lesser of two evils argument… I just hope we don’t lose some of the checks and balances in the process to prevent one party or group of people from controlling everything. \n\nSometimes I wonder if it’ll be two cycles of change before we get to a better spot.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Which-Supermarket-69",
                                                    "body": "Yup I have the same concern.  Somebody worse will inevitably get into power and take advantage of the precedents being set.  I only hope that the system is reborn with extreme transparency before that time comes",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SlasherHockey08",
                                                    "body": "How unique do we feel concepts like  the bill of rights, the constitution, separation of powers, freedom of religion, and others are? What are the chances in the “crack it open and burn it down” phase we end up losing any of these (or others)?  When they remake it, what are chances they capture that uniqueness and frameworks to go after life, liberty, and a better tomorrow?\n\nWe would fair far better to keep those concepts enshrined and stand with the Constitution now.\n\nWhile there have been expansions in the executive branch, it arguably has never been at the velocity, overreach, or with the responses to checks and balances that we’ve seen in this short time. If you are against the rapid effort to centralize that power, you should be for the constitution. If you were against these expansions previously based on principle, the only consistent place is to be against them now.\n\nIf you’re ok justifying actions with going against the constitution and founding documents, maybe you didn’t value those like you thought you did.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "GrandmaesterHinkie",
                                                            "body": "I think you’re missing something or I likely didn’t articulate myself… \n\nConceptually, I think it’s okay to go with a lesser of two evils in an A or B choice. \n\nIn this specific case, what’s the third option? Because I’m not sure what you’re arguing outside of Trump/Elon = bad. I believe the government is has both financially and theoretically overextended its powers/use and there is a ton of corruption (that’s likely existed since its inception). I also believe the last x number of election cycles have been more about maintaining the status quo more than anything. Do I agree with how the change is happening? No. Do I agree that there needs to be a change? Absolutely. But what’s the third option presented to me as both a citizen and voter? I’m genuinely curious bc all I see is two groups of people just yelling at the other.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "SlasherHockey08",
                                                                    "body": "Its very possible I didn’t articulate myself well too haha\n\nI started trying to add on to your comment about losing checks and balances in the process. It feels like the reality is going down that path we will lose more than just checks and balances. \n\nI’m not just anti-trump/elon (although I am not in support of their actions). It probably feels like I’m particularly critical of trump. I am.\nWhen you have legal avenues and you ignore them, against law and the constitution, sign clearly unconstitutional EOs, and then demonize the branch of government who needs to check your power, we should all be against that. Elon and Trump are doing that so, in this case, I do think they are bad.\n\nI’ll point out I’m not even attacking flaws in their actual policy I disagree with but are completely within his executive scope (tariffs being one example). We could probably have an interesting discussion around policy and find things we like/don’t like he’s doing however, those aren’t in active defiance of the constitution or court orders. The clear centralization of power and demonization from any disagreement or effort to check to their power grab feels like it has to be a non-starter\n\nThe third option is no be apathetic to founding documents or an administration that is trying to solve government overreach with historic overreach.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Fuck_The_Rocketss",
                                    "body": "The rule of law has existed to protect the corruption. If an entity comes through and breaks the rules to break the corruption, while not ideal, I’m down to give it a pass. It is silly me to bemoan the lack of adherence to procedure when so many good outcomes are happening as a result.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "buchenrad",
                                            "body": "So many people, for the first time in their life, are suddenly concerned about gross executive overreach.\n\nBut they don't actually care about the executive overreach. They only care about the person who is doing the reaching and they are grasping at reasons that don't make them sound like a partisan cultist. When their hero comes to save the day next term they will be begging them to use the same tactics to reverse everything.\n\nActual libertarians have been going on about this for years like we still are now, but we all know the majority of commenters in this sub aren't libertarians but Rs and Ds just here to cause trouble or \"enlighten\" us.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "SlasherHockey08",
                                                    "body": "I agree there are some people who clearly don’t believe in our founding documents or libertarian concepts in this sub. I’m not even against open dialogue, I’m in other subs that I go to for perspective. Personally, if someone who was for the Patriot Act or FISA courts now sees the danger of going against the constitution I’ll welcome them with open arms.\n\nWhile there have been expansions in the executive branch, it arguably has never been at the velocity, overreach, or with the responses to checks and balances that we’ve seen in this short time. If you are against the rapid effort to centralize that power, you should be for the constitution. If you were against these expansions previously based on principle, the only consistent place is to be against them now.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Fuck_The_Rocketss",
                                                    "body": "It sure feels that way. A while back this sub was a pretty good place for libertarian discussions. The lefties have been coming out of the woodwork lately.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "SlasherHockey08",
                                                            "body": "As a true libertarian, I imagine you agree with some of those lefty’s more than you thought right now. If they are against centralization of power now or defending the constitution it seems like that isn’t a threat to our ideals but a triumph. Ones that we’ve championed as central to a peaceful and prosperous society of freedom",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mrvladimir",
                            "body": "You don't end up being the richest man in the world without greed along the way. Elon could donate a few hundred billion dollars and it wouldn't put a dent in what he's worth.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "HotFoxedbuns",
                                    "body": "Is this sarcasm? Read what you wrote again",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "mrvladimir",
                                            "body": "....It isn't a libertarian ideal nessecarily that it's morally okay to accumulate an insane amount of wealth. I would argue that after a certain point, say $10 mil in personal/family wealth, continuing to accumulate more is not morally good, at the least, and after a certain point, nothing more than a show of a lack of humanity and greed in its most basic form.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "HotFoxedbuns",
                                                    "body": "You said Elon could donate a few hundred billion dollars - was that a typo? You mean million right? Not to talk of the fact that most of Elon's wealth is in shares and I'm not sure most working people would be happy to receive a few shares as a donation.\n\nHe isn't accumulating the wealth- the market PUBLICALLY VALUES his businesses at several hundred billion dollars because of how profitable they believe the businesses are/ will be. \n\nIn other words- he made business that make great products (that other people benefit from) profitably and the market is valuing those businesses higher and higher over time",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "CCWaterBug",
                                                    "body": "So, Lebron James had a lack if Humanity and greed in it's basic form?  Dam, I used to like him.\n\n\nSteph Curry too?  I can only cheer for 2nd round draft picks now.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheWestWolf78",
                            "body": "My brother in Christ, where the fuck do think he got the money? Where do you think he's getting it now? What checks do you think he currently has on his power? Has someone disconnected your oxygen tank?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "brutalservant",
                            "body": "Who would you rather have auditing the government?   I think Elon is doing a pretty good job at quickly and efficiently auditing so far.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ToolsOfIgnorance27",
                                    "body": "Ron Paul.\n\nBut that's about it. I think Musk is doing a fine job.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rightoftexas",
                    "body": "Where are the fucking receipts DOGE?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "If Bernie said it, it must be true.  Someone with that many houses can’t lie. /s",
                    "score": -58,
                    "replies": [
                        {
                            "author": "Scootch360",
                            "body": "What does that have to do with anything I said (btw don't trust Bernie either)?",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "grendev",
                                    "body": "The MAGA crowd has decided that everything is ok if the dems did it. And yes, I think this sub is more MAGA than libertarian.",
                                    "score": 55,
                                    "replies": [
                                        {
                                            "author": "Scootch360",
                                            "body": "I think they live in a world in which if Elon is a liar then Bernie Sanders must be telling the truth and if Bernie is truthful, then Musk is a liar.  But that just isn't the way the world works.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "huckster235",
                                                    "body": "It's more like if you disagree with their guy, they don't really actually know how to defend them, they instead throw out someone they dislike and say \"so I guess it's ok when they do XYZ\" as if you can't disagree with multiple people.\n\nMy parents do it all the time. I've never liked Musk so my parents would say stuff like \"oh but Hunter Biden is so great isn't he?\" 🙄",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "grendev",
                                                            "body": "All Hunter did was followed his passion. For hookers and blow. \n\nAnd yes right now it's it's where were you when people got fired for not taking the jab.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "_shredder_",
                                    "body": "It doesn’t. It’s the only rebuttal people have for people with different opinions in todays political atmosphere. \n\n“mY siDe gOoD cAuSe oTheR siDe bAd” \n\n“my viEws aRe bEttEr cAusE thEyrE not yours”",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Puzzleheaded-Task780",
            "body": "Both sides are getting cut. It’s the only way that Mitch has a net work of 90M when his yearly salary was only 200K",
            "score": 6,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 59,
            "replies": [
                {
                    "author": "xxpillowxxjp",
                    "body": "Brother if you think anyone here is against tax breaks for anyone in America, you are way off",
                    "score": 36,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "xxpillowxxjp",
                                    "body": "Someone else can correct me if I’m wrong but we would commend the tax breaks and condemn the tax increases, irregardless of the administration",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "FourOhTwo",
                                    "body": "This administration has hinted at completely removing income tax.\n\nI haven't heard anything about tax increases, where did you hear that?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Probably referring to the regressive impact of tariffs would be my guess",
                                            "score": 13,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "FourOhTwo",
                                                    "body": "Making a lot of assumptions on tariffs.\n\nTrump seems to be using it as a negotiation tactic and I'm pretty sure the figures used in the article are already wrong.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "FourOhTwo",
                                                                    "body": "Trump is using tariffs as a negotiation tactic, taking them at face value is making assumptions on the actual impact.\n\nYour article referenced 20% tariffs and 60% on China, which isn't accurate.\n\nhttps://www.skadden.com/insights/publications/2025/02/trumps-tariffs-on-canada-mexico-and-china",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[deleted]",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FourOhTwo",
                                                                                    "body": "I guess if it *seems* like that then it's still an assumption until it happens.\n\nDOGE started with the IRS yesterday, and what I've heard is that the IRS and income tax could be abolished.\n\nI prefer a consumption tax over income tax, which is kind of what a tariff is even though I don't like tariffs either.\n\nI also don't care as much about billionaires as I do about corrupt politicians becoming millions through fraud. In my opinion, government has become so corrupt that this heavy slashing is essential to fixing it. If something that actually serves Americans accidentally gets cut it can be added back in an appropriate way rather than omnibus bills.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SaturdaysAFTBs",
                                    "body": "Just so you know, the top 20% of taxpayers bear like 95% of the tax burden so this idea that they “aren’t paying their fair share” is sort of absurd.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SaturdaysAFTBs",
                                                    "body": "Here you go: https://taxfoundation.org/data/all/federal/latest-federal-income-tax-data-2024/\n\nI was slightly off cause going from memory but too 1% pay 45% of all the taxes in the US. Top 25% pay 90% and the bottom 50% pay 2% of the taxes.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SaturdaysAFTBs",
                                                                    "body": "As of right now no tax plan has been passed by Trump so this still holds true. Given the magnitude of the tax burden in the higher brackets, even a large tax cut wouldn’t directionally change this too much. The bottom 50% still are going to pay 2-3% of the tax burden.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TheLimpUnicorn98",
                                    "body": "The masses don’t carry the tax burden, do you not remember Mitt Romney’s 47% gaffe? Income tax breaks for the top 20% are for your engineers, doctors, lawyers. They’re your highly skilled professionals, not billionaires. The top 25% already contribute to 87.2% of all income tax revenue, this income tax regime is incredibly top heavy already.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rocknthenumbers8",
                    "body": "They are slashing because our government is careening towards insolvency. We spend more on interest expense from our debt than we do on the military. We add a trillion in debt every 100 days. For comparison the combined wealth of the 400 richest Americans is 4.5 trillion, so if we confiscated every last penny from the 400 richest people we could only fund the US gov for a little over a year.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "jharr11",
                                    "body": "You’re not going to find anyone here in favor of spending more on anything, including defense.",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "SaturdaysAFTBs",
                                    "body": "Military isn’t the top expense. Medicare and Social Security are each ~2x bigger than military spending.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "OpinionStunning6236",
                                    "body": "Defense is the top expense under discretionary spending but we spend more than that on Social Security, Medicare, Medicaid and interest on the debt. The interest on the debt is a massive problem it has been growing so fast every year",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "theonly764hero",
                                    "body": "If you don’t think they’re going after waste and fraud in the military and defense budgets then you don’t understand the outline of DOGE. They simply haven’t gotten there yet. We are only a few weeks in. The pentagon specifically is on their radar as they have failed their last 6 audits.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "rocknthenumbers8",
                                    "body": "It absolutely concerns me, that’s why I support Elon Musk and the DOGE programs efforts to slash excess spending, though it will likely be too little, too late. Trump has also recently expressed a desire to revisit arms treaties to help curtail defense spending https://apnews.com/article/trump-china-russia-nuclear-bbc1c75920297f1e5ba5556d084da4de .",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Fuck_The_Rocketss",
                                                    "body": "It’s not ideal that Elon has and probably will continue to take government incentives and subsidies. But that doesn’t negate the good that is being done by exposing USAID, auditing the fed and the pentagon and the IRS. Sure it’s hypocritical if he’s also taking bloated government contracts but I’m not going to refuse to accept or complain when he guts other instances of waste and corruption.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "theonly764hero",
                                                            "body": "Exactly. Even if, worse case scenario, Elon used this authority and oversight to give himself subsidies (which, I don’t think it works like that anyways, but for the sake of argument); for one, someone would blow the whistle almost immediately because he’s working with a team of folks who are actually pouring over all of the data themselves and reporting to Elon, and second of all, they are uncovering exponentially more than Elon would personally ever be able to take in unnoticed. This whole project is online and out in the open. It’s extremely transparent. That’s the entire point. Up until now there has been zero transparency or accountability with how taxpayer money is being spent by many of these department heads.",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "finishyourbeer",
                    "body": "A tax break just means they will collect less taxes. They will take less money away from the billionaire class. They’re not going to literally pay them money. \nPeople always misconstrue tax breaks as literally giving money away. It’s just TAKING less money.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Fuck_The_Rocketss",
                    "body": "Genuine question and seeking understanding. Are you familiar at all with libertarianism? We abhor public programs. We abhor taxes. Taxation is theft even if you’re taxing billionaires.\n\n\nAnd from what I’ve heard him say, Trump plans to cut taxes for everyone.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "theonly764hero",
                    "body": "Unlikely. That’s what has been happening for years and what they’re literally calling attention to now. I don’t care if it’s Elon calling it out or Oscar the grouch, I’m all for it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DILGE",
            "body": "Does anybody really think slashing federal spending is gonna result in a lower tax bill for us regular folk?  Or balancing the budget?  I mean, they just submitted a bill to raise the debt ceiling by $4 trillion...",
            "score": 12,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Yes. Inflation is the hidden tax caused by big government spending that reduces the standard of living for the poor and middle class:\n\nhttps://preview.redd.it/ahxkdr2v72je1.jpeg?width=535&format=pjpg&auto=webp&s=342cab7bbfef0060f7169a90a757988c26dc7252",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "luckysparkie",
            "body": "They’re all the same.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TRichard3814",
            "body": "Things are never as simple as they appear, I bet the mail center will be not working in a few months",
            "score": 9,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 16,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "https://preview.redd.it/4mz8j7vg60je1.jpeg?width=1290&format=pjpg&auto=webp&s=dd1a70fc8901add1c9ff574cc0efa5ba65b8f7db",
                    "score": -14,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "You’re not a libertarian if you envy other people‘s wealth.\n\nSomeone working harder and smarter than you to mass a fortune doesn’t make you **automatically good** and them **automatically evil**.\n\nThat also doesn’t mean that Libertarians fully embrace everything that Elon does or says. \n\nA rational mind would give any Democrat or Republican credit if and when they actually advocate Libertarian ideas and policies.\n\nElon Musk has quoted Milton Friedman and F.A. Hayak.\n\nHe is also supportive of having Ron Paul audit the Fed. \n\nIf you can convince Bernie Sanders to read some economics books instead then he, too, might actually have something intelligent to say for once.\n\nAt that point, he might even earn some compliments from Libertarians. \n\nUntil then....don’t hold your breath.",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "author": "theonly764hero",
                                                    "body": "The guy literally works like 80 hours and week though, whether you like him or not, whether he had opportunities you and I had or not, he literally works around the clock.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DEPMAG",
            "body": "It's funny just how much bullshit you \"people\" believe.",
            "score": 23,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "It was a very thought-provoking rebuttal.  Level 3 Bot quality right there 👌",
                    "score": -11,
                    "replies": [
                        {
                            "author": "mrbig99",
                            "body": "Do you get paid to post?\n\nThis guy banned me.",
                            "score": 18,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 5,
            "replies": [
                {
                    "author": "None",
                    "body": "The mod there loves this sub so they might see this and be upset.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "libertarianinus",
            "body": "My favorite old school liberal Bill Maher even said that since it was established in 1977, students have been getting dumber. Why even waste the $$? It's just another buerocracy. Can't anybody get the data from each school district and place it in a report for free? My friends in r/dataisbeutifull can do that fast!",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChasinFinancialAgony",
            "body": "A claim made without evidence can be dismissed without evidence.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Phantasmidine",
            "body": "AFUERA!\n\nAFUERA!\n\nAFUERA!\n\nAFUERA!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Crithu",
            "body": "Who cares who started it, just end it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Secure-Apple-5793",
            "body": "Hey so do the taxpayers get all this money back?",
            "score": 2,
            "replies": []
        },
        {
            "author": "winkman",
            "body": "It ain't Milei...but it ain't nothin!",
            "score": 3,
            "replies": []
        },
        {
            "author": "buchenrad",
            "body": "Maybe if congress wants to ensure that the programs they implement aren't deliberately sabotaged, they should be a little more specific about the terms by which the executive branch must operate.\n\nUntil we have clearly defined legislation governing the executive branch, I'm fine with them capitalizing on it to tear it all down. Maybe someone in Congress will learn a lesson and write better laws.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MasonKiller",
            "body": "That's a lot of millimeters",
            "score": 3,
            "replies": []
        },
        {
            "author": "ZombieSquirell",
            "body": "Are these the \"private entities would do it better contractors\" (less bloat; more efficient; economical) or are these the \"government offered it and we'd be silly not to take it contractors\" ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "fredsherbert",
            "body": "interesting that this gets so many upvotes when you can see in the comment section that this BS actually isn't flying here",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sir_John_Galt",
            "body": "Sounds like a good start….👍🏻",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlakJak_Johnson",
            "body": "More ppl just wholesale believing tweets from someone who said he would definitely lie to you. What is wrong with this sub?",
            "score": 2,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "This sub doesn’t blindly worship the DMV.  We aren’t government boot-lickers.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "BlakJak_Johnson",
                            "body": "Yes, you blindly worship random tweets that may or may not be truthful. lol. Way better.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "Do you actually have an intelligent rebuttal  to provide?\n\nWhat is not truthful about the [$881 million in cancelled government contracts](https://www.yahoo.com/news/doge-slashes-millions-more-nonsense-182741786.html)?\n\nBeing offended by the meme doesn’t count. Try again.\n\nhttps://preview.redd.it/y3qbyjrb14je1.jpeg?width=1290&format=pjpg&auto=webp&s=c29fbd828e5e97e250ca6dc541c3ec759aacb3dc",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "BlakJak_Johnson",
                                            "body": "Oh is that why your still typing at me? Waiting for to provide you with a rebuttal you don’t care about? If you really wanted a debate I do not believe you would seriously be doing it over social media with some random asshole you don’t know. Chances are you really just want a target to tell your boot licker nonsense at. \nYou see, ppl who want an honest debate don’t randomly call ppl bootlickers. lol. \n\nSo, No, keyboard warrior. Go back and troll for upvotes on some other redditor. (Boot licker. lol. What are you like 70yrs old? lol)",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "P-funk88",
            "body": "Where's the hells all this money we're saving going?",
            "score": 1,
            "replies": []
        },
        {
            "author": "RailSAndAles",
            "body": "He forgot to mention the $440 million contract that was just signed with Tesla.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theonly764hero",
            "body": "I’m all for it. Tbh it’s really weird that even some libertarians are protesting DOGE. Elon derangement syndrome is real.",
            "score": 0,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Average Reddit Tankies aren’t libertarians.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "BigMacPro2000",
                            "body": "Or maybe people are just sceptical of random statements from walking conflicts of interest.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "If you have an actual argument then say it instead of being passive aggressive.  Teenagers do that.  What is your problem?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "swarmofpenguins",
            "body": "Why do Americans care so much about millimeters?",
            "score": -1,
            "replies": []
        }
    ]
}