{
    "title": "What do Libertarians think off pump and dump?",
    "author": "William-_-Buttlicker",
    "subreddit": "Libertarian",
    "rank": 275,
    "score": 0,
    "upvote_ratio": 0.49,
    "num_comments (reported by reddit)": 53,
    "url": "https://www.reddit.com/r/Libertarian/comments/1irwfe7/what_do_libertarians_think_off_pump_and_dump/",
    "id": "1irwfe7",
    "selftext": "In my opinion, it shouldn’t be illegal. At the end of the day, no one is forcing anyone to buy a stock—it’s a personal choice. If you’re unhappy with the outcome, take it up with your broker in civil court instead of relying on government intervention. \n\nI don’t get why this isn’t discussed more. These types of laws are stifling more innovations of financial products. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "texdroid",
            "body": "Business transactions must be consensual and INFORMED to be ethical and not fraud.\n\nOne of the minimal purposes of the government is to protect people's property. That includes them not being defrauded out of it.  Otherwise the biggest liar wins. I don't think that's a Libertarian ideal at all.",
            "score": 26,
            "replies": [
                {
                    "author": "William-_-Buttlicker",
                    "body": "Is it more anti-libertarian than taxpayers being forced to pay for prosecutors and investigators to protect these investors and make sure them making a profit from their investment? I doubt it. \n\nIf people are going to invest, they should conduct due diligence and research, or keep their money in their pockets.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "HotFoxedbuns",
                            "body": "No, fraud is a form of stealing. Libertarians are anti theft",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "William-_-Buttlicker",
                                    "body": "You own the stock/investment you bought and signed on. It's not like you're being robbed at gun point.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HotFoxedbuns",
                                            "body": "If I sold you an apple that's actually a piece of cardboard, would you say well I still own the cardboard? I still robbed you of the price difference between the cardboard and the apple assuming it's a positive difference lol\n\nPoint is that the stock the person bought is worthless or at least it's worth a lot less than the person who defrauded them led them to believing it was worth.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "William-_-Buttlicker",
                                                    "body": "If I sold you an apple and that's actually a piece of cardboard, did you get to have the  police to have me arrested?\n\nRead the post. You can sue me for breach of contract all you want, but taxpayers shouldn't be forced to pay for making sure of your private investment returning a profit.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GGM8EZ",
                    "body": "It is not the businesses responsibility to inform you. you must be informed yourself. fraud doesn't exist. stupid people who feel they've been wronged do.",
                    "score": -19,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kin-ethra",
            "body": "Eeehhh. Pump and dump is specifically meant maliciously though. Like when Elon said tesla would be using bitcoin, waited for the big buy ins and then changing his mind and dumping his shares, causing it to plummet. He knew what he was doing, he did it intentionally to enrich himself by using false claims. I think its a slippery slope",
            "score": 47,
            "replies": [
                {
                    "author": "urbansasquatchNC",
                    "body": "Arguably that could fall into insider trading. Elon knew that the tesla plan was not in line with public knowledge and used that insider knowledge to dump and make a profit. \n\nTo be clear, I'm only saying this for the sake of argument. Pump and dump schemes are essentially fraud. \"Buyer beware\" is one thing but malicious misinformation to profit off of those you dupe is another.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "William-_-Buttlicker",
                    "body": "How is your example different than Trump saying he's going to impose tariff on Canada then decided to pause it? If I were betting against the Canadian dollars can I ask the DOJ to sue the Trump administration for my loss?\n\nIt is exactly a slippery slope because it's not enforceable. Therefore, pump and dump should not be illegal.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kin-ethra",
                            "body": "I disagree that these two things can be compared in the same way. 1 was done with intent to enrich themselves further, and possibly to see their reach/sway.\n\n The other is a government action that wasn't made on the basis of personal enrichment.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mountain_Air1544",
            "body": "I'm going to be real honest with you it took me a while to figure out what you were talking about lol. Im a mom and a \"pump and dump\" is what we call it when you pump breast milk and then dump it because if meds or drinking",
            "score": 10,
            "replies": [
                {
                    "author": "William-_-Buttlicker",
                    "body": "Both should be legal lol",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "JohnLu44",
            "body": "A stock market is a way of socializing profits without using government force. What happens to stock prices isn't really that federal concern.",
            "score": 7,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "Agreed, I don’t think it should be illegal either. As libertarian we value personal responsibility. Sure, we can spread awareness of these crypto scam, but you can only blame yourself if you get scammed. \n\nIt’s like gambling some people do make it out early and profit off the crypto scam, but you should intuitively recognize that you are investing in a volatile risky digital good and thereby you should absolutely bear the consequences if you get the short end of the stick. You can’t depend on anyone or the government to bail you out.",
            "score": 18,
            "replies": []
        },
        {
            "author": "LawlessCrayon",
            "body": "I look at it this way, if you want to have the privilege of listing on a public market you need to follow the rules of that public market.  If that public market creates safeguards to protect investors they make that market more acceptable to potential investors and therefore have a market with more capital.  A market with easier access to capital is more attractive to someone trying to raise capital and the is a reason why companies who list on the Dow are more valuable than wherever pink slip penny stocks are listed.\n\nOf course I think these market makers should make the rules and be 100% transparent about it not any government.\n\nAlso anyone who participates in a pump and dump is skum just like any other scammer.  Buying something you think will be pumped and hoping to get out in time is not participating, it's the people involved are who go into the project with the intent to pump and dump.",
            "score": 6,
            "replies": []
        },
        {
            "author": "arkitect",
            "body": "Agree completely. You can’t have it both ways. No rules when it suits you, but run to big daddy government begging for rules and regulations when you get hurt.\n\nIn case you’re wondering, this is also why libertarianism will never be taken seriously as a viable political-economic option, at scale. It fails to acknowledge even the most obvious real-world market inefficiencies (like asymmetric information) which always exist and need some form of governmental regulatory intervention no matter what your Econ 101 textbooks say about “widget factories” or whatever nonsense is supposed to be the basis of these ideas.",
            "score": 3,
            "replies": []
        },
        {
            "author": "gonzoll",
            "body": "“Pump and dump “ kind of assumes that you’re intentionally misleading your customers about the value of a product you’re selling. That’s fraud",
            "score": 3,
            "replies": []
        },
        {
            "author": "Practical_Advice2376",
            "body": "What does that refer to?",
            "score": 2,
            "replies": [
                {
                    "author": "William-_-Buttlicker",
                    "body": "[https://www.fxstreet.com/cryptocurrencies/news/argentinas-president-milei-under-investigation-for-libra-crypto-scandal-202502170739](https://www.fxstreet.com/cryptocurrencies/news/argentinas-president-milei-under-investigation-for-libra-crypto-scandal-202502170739)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "M-y-P",
                            "body": "I agree with you that it shouldn't be illegal, but in the same way that I don't want being a racist illegal, I don't want a president to be a racist or participate in pump and dumps.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "William-_-Buttlicker",
                                    "body": "What I was saying is the concept of pump and dumb being illegal should not exist at all.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MM800",
            "body": "What adults do in private is no business of the government! 😀",
            "score": 3,
            "replies": []
        },
        {
            "author": "GangstaVillian420",
            "body": "The problem for Milei is they don't have a First Amendment protections. P&Ds happen all the time in the US equities and commodities markets, and many times it's people getting together to join each other in pumping a stock (free speech to tell everyone how much you like the stock). Then those with large positions cash out, leaving everyone else to bag hold. Immortal? Sure. Illegal? Not in the US. Maybe in Argentina, they have a law that does make engaging in a P&D Illegal. \nPersonally, as long as there isn't specific fraud or direct misrepresentations (speech that actually is illegal in the US), using your platform to promote something seemingly worthless, shouldn't be illegal, even if you are doing it specifically to drive the price up only to be able to dump your holdings as soon as you can.",
            "score": 1,
            "replies": [
                {
                    "author": "William-_-Buttlicker",
                    "body": "Two points:\n\n 1) the concept of pump and dump being illegal should not exist at all regardless of jurisdictions.\n\n2) the idea that taxpayers are forced to shoulder the cost of keeping white collar crime prosecutors to protect private investors is inherently anti-libertarian. If people are really concerned about frauds or misleading claims, they could just, you know, keep their money in their saving accounts.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "crandeezy13",
            "body": "I am generally in support of some limited financial regulations but If we are going to make it illegal we better enforce it equally across the board.... No selective prosecutions based on what party is for in office.",
            "score": 1,
            "replies": []
        },
        {
            "author": "International_Fig262",
            "body": "Ehhh. Most of these cases are transparent schemes so it's hard to muster a lot of empathy for adults who were actively gambling. It's also nebulous to prove; to the point I have a hard time believing someone with an excellent legal team is in much danger of prosecution.  Still, a scumbag move.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RigobertaMenchu",
            "body": "Pump and dump schemes take away from the true utility of crypto and blockchain. Crypto won’t be stopped, it’s taking over the world, but most people think it’s a ponze scheme.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Carlose175",
            "body": "It shouldn't be up to the government to be illegal, rather there should be a contractual obligation of sorts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JonnyDoeDoe",
            "body": "If you're trading or buying on anything other than value or your beliefs in a particular stock or coin, then maybe you shouldn't be trading or buying... \n\nAlso don't buy with money you can't afford to lose... \n\nOver the years each recession has been good for me as I purchased stocks of companies I believed were good companies... But I also understand that not everyone of them recovers... You can't always win... \n\nAs for specific items you recognize, I've jumped on a few... Remember once I jumped in one after talking with a younger friend, so I threw $10k in and next day was up 125% so I sold and told him he should too, he stayed while it went to almost 200% riding me about being a pussy... he went to sleep and woke up to down 75% from his buy in...  Lesson is pigs get fat, hogs get slaughtered... I thank Jonathan Hoenig for repeating that often...",
            "score": 1,
            "replies": []
        },
        {
            "author": "xfactorx99",
            "body": "I agree with your take",
            "score": 1,
            "replies": []
        },
        {
            "author": "natermer",
            "body": "If somebody commits fraud then it is illegal no matter what. It is a form of theft. Some 'pump and dump' schemes are fraud, some are not. It is a case by case thing.\n\nBut other then that it is important for people to be aware of what they are investing in and understand the risks before investing. \n\nIf some rando on the internet is able to talk you into dumping your life savings into some shady crypto racket out of Thailand... It could be your purpose in life is to serve as a warning for others.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GGM8EZ",
            "body": "If you pump and don't dump it's on you.",
            "score": 1,
            "replies": [
                {
                    "author": "TheBigNoiseFromXenia",
                    "body": "I believe it depends on the specifics of who is pumping. If you are listing to rando Redditers talking up a penny stock then bailing, then legal. If it is your broker or your lawyer, whom you are paying for advice and they are intentionally lying that should be illegal. If it is officers of the company making official filings and announcements, it should be illegal to lie to investors. If the company officers are just baselessly enthusiastic about the stock (but not making official filings/announcements) despite knowing there are problems, then legal.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GGM8EZ",
                            "body": "I think it depends on the contents of the consentual contract\n\nIf you agree to a shitty contract and you get scammed it's on you",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deep_Cut9511",
            "body": "It's shady business.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rationis",
            "body": "Though I hold around 50k in various crypto, I find it hard to feel bad for people who throw money at such obvious pump and dump meme coins. I also hold zero empathy for people who throw life savings or money they can't afford to lose at these coins and then complain when the dump occurs. They were probably planning to do the same. They just dumped before the buyer could.\n\nSo I think it should be legal. Making it illegal isn't going to stop stupid people from making dumb financial decisions. They'll just opt to do other stupid things like options trading or yolo'ing nana's inheritance into a failing company. \n\n\"A fool and his money are easily parted\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "doktorjake",
            "body": "How could you take someone to court for doing this if it wasn’t illegal..?\n\nDid you mean to say that it should be illegal, but the SEC should go away? That seems a more logical libertarian conclusion, though I don’t wholly agree with that, either.",
            "score": 1,
            "replies": [
                {
                    "author": "William-_-Buttlicker",
                    "body": "You can sue your brokers or sellers for breach of contract but it shouldn't be criminal.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nocommentacct",
            "body": "Totally agree it shouldn’t be illegal. It’s a self solving problem. The legality of something shouldn’t be perceived as legitimacy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kedulus",
            "body": "As long as there's no fraud, I don't care. In the case of Milei, I haven't seen any evidence of fraud, though I haven't looked too hard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stiks-n-Bones",
            "body": "Pump and dump are schemes deliberately designed to conceal and manipulate. It causes harm to others with intent. True it is individual right to buy what you want however the transaction is based on the theory that everyone participating has equal access to all available information. \n\nNo. It can't be legal.",
            "score": 1,
            "replies": [
                {
                    "author": "William-_-Buttlicker",
                    "body": "Again, if you think you got cheated out, go sue the the dealers/brokers for breach of contract. But taxpayers can't be asked to pay for all these government lawyers to make sure you make a profit off your investment.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Stiks-n-Bones",
                            "body": "Pump and dump is securities Fraud. Fraud is illegal. And going after the perpetrators is untenable for most folks who've been defrauded.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "wtfcowisown",
            "body": "The value of private equity (stocks) and private gambling (futures/options/etc) are left to the private market.  Let them manipulate it however they see fit.\n\nI have no problem with Trump coin, Milei's rugpull, the other shit out there.\n\nA majority lost money, but some also made money.  It's a free market and I doubt anybody buying that had it in their minds was here to stay.  It's a gamble through and through.  No different than a casino in my eyes.\n\nI draw the line when govt gets involved.  As an example, imagine if Trump got in office he decides to make Trump coin official us govt currency and everybody gets 1 sent to their bank account automatically. (Very unrealistic). Under this scenario you have govt intervention and this is obviously bad.\n\nLeave private gambling to private investors.  Let people fight with their dollars.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ochen-khorosho",
            "body": "This kind of take is why libertarians aren’t taken seriously nor given the reins of power, ever. “It’s not the government’s job to protect the people” is a take you that wont carry much water outside of reddit threads. Majority of people want some level of protection against bad actors- people who do pump and dump schemes aren’t looking to participate in the market in a productive matter. They are intentionally trying to break the system to enrich themselves. \n\nThere’s a reason why you seek validation for your take on Reddit. The real world will never agree with you",
            "score": 1,
            "replies": []
        },
        {
            "author": "timbernforge",
            "body": "I agree with your logic.  It’s wrong, and unethical but might not rise to the level of federal enforcement.  Could be handled in civil court.\n\nThat said, I also have no problem with local laws against.",
            "score": 1,
            "replies": [
                {
                    "author": "William-_-Buttlicker",
                    "body": "It's neither a federal or local issue, nor a US or Argentinian one. It should be legal anywhere. If you invest, you take responsibility of it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sirwizzard",
            "body": "There might be a case for it to be illegal when some actors lie about a financial asset and proceed to pump and dump it.\n\nHowever, when people say they are creating \"meme-coins\", do not claim they have any intrinsic value or novel technology, and proceed to rug pull buyers, I have no sympathy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TrickyStatement0",
            "body": "Pump and dump is clearly fraud. It involves false statements to pump the price. I think it's pretty clear cut illegal in a libertarian society. \n\nThe much harder question is insider trading. Unlike pump and dump, insider trading doesn't really have a victim, and it's based on omissions of correct information, not intentional false statements. The more informed person just buys or sells based on information not available to the public. \n\nI haven't fully formed my mind on insider trading, but I lean that it should be legal. Regardless, it's basically impossible to enforce anyways - insiders are going to use their inside information. The only evidence is normally outsized buys or sells in suspicious time periods.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LinuxForever4934",
            "body": "I believe pump and dumps should be legal. I don't get how pumping the value of crypto currency and selling at a high point is any different than pumping the value of beanie babies and selling them at a high point (or any other brand name product). It's all creative marketing. As long as no one is lying or making fraudulent statements, you, as the buyer, should be paying what YOU think the asset is worth. It's not anyone else's fault if you're wrong.",
            "score": 0,
            "replies": []
        }
    ]
}