{
    "title": "Germans are now being arrested for calling their politicians by unsavory names. Freedom of speech in Deutchland is going down the drain fast. Insulting politicians can leave you with a 3-year prison sentence.",
    "author": "Effective_Reach_9289",
    "subreddit": "Libertarian",
    "rank": 204,
    "score": 598,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 106,
    "url": "https://i.redd.it/s6xx2si2qbke1.png",
    "id": "1iu31wr",
    "selftext": "",
    "comments": [
        {
            "author": "Effective_Reach_9289",
            "body": "SS: According to German law, any politician from the chancellor down to the municipal level can press charges against individuals who have insulted them. Those found guilty can face three years in prison, sharing cells with murders and terrorists. This is a clear violation of free speech and free press.\n\nEdit: Source on penalties for insulting politicians. Archived article from DW, a German news website. [https://archive.is/S100k](https://archive.is/S100k)",
            "score": 108,
            "replies": [
                {
                    "author": "bkedsmkr",
                    "body": "There can only be a violation if free speech was enshrined ahead of time. We all know Germany silences dissidents and doesn't bother to hide it.",
                    "score": 59,
                    "replies": []
                },
                {
                    "author": "Life_Owl2217",
                    "body": "you are missing the source, here’s one I found: https://www.ft.com/content/27626fa8-3379-4b69-891d-379401675942",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "NurEineSockenpuppe",
                    "body": "That is misleading however. \n\nWhile technically true it is not limited to politicians. Insulting or defaming anybody is illegal here.   \nI think it's a stupid law but it's not just some tool to silence critics of politicians.   \nI have a hard time not insulting people in public and I had the pleasure of being charged with insulting people twice already. Once it was my neighbor and then some gardener in traffic that I told to get off the road if he was too \"redacted\" to drive. \n\nSo yeah. Shit law but you can freely criticize any politician publicly. The only limitation is pretty much that you cannot use insulting language.   \n  \nOkay: \"Robert Habeck is an incompetent leader and he should stick to writing  books for children\"  \nNot okay: Calling him an imbecile.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Maltoron",
                            "body": "Complete nanny state garbage.  Having to pussyfoot around calling someone a moron because they're acting like one is ridiculous.  It might not be \"just some tool to silence critics\" but it is very easy to become a tool to silence critics.  Even your example is you voicing your displeasure in a crass manner, and since the recipient is merely offended, they are able to retaliate 100-fold with the arm of the law.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "NurEineSockenpuppe",
                                    "body": "I do think it‘s a garbage law. I only say this because american media is talking about it like this is basically china or north korea which it is not. \nMany countries including america are limiting free speech. Ignoring the fact that there is different levels of quality to repression is just stupid. \n\nPersonal honor is valued here. This law doesn‘t exist to protect the ones on power but every member of society.\n\nThere are much more problematic limits to free speech here than that. Like for example blasphemy is illegal under certain circumstances. And that is actually a law that is only there to protect the ones in power (the church) and is now also being abused by radical muslims trying to silence everyone that is critical of their death cult.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Where are all the Germans that's said this was untrue and they have free speech? Lol ghost now",
            "score": 56,
            "replies": [
                {
                    "author": "thekeldog",
                    "body": "They’ll just say that “Free Speech” means something other than Free Speech.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "TheFortnutter",
                            "body": "uhh \"free speech exists but there must be limits! muh hate speech!\"",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "thekeldog",
                                    "body": "“Hate speech isn’t free speech, and hate speech is whatever we say it is!”",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "not_today_thank",
                    "body": "It's kind of bizarre, they will still insist they have free speech in the same sentence that they defend jailing somebody for calling a politician an idiot.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Living-Fill-8819",
                    "body": "Right? at first the reports were slightly overblown, sure, but now there's 0 fucking excuse.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "John2H",
            "body": "Germany using fascism to silence critique? \n\nSince when?",
            "score": 15,
            "replies": []
        },
        {
            "author": "RobertEHotep",
            "body": "Reminder that \"hate speech\" is fake news.",
            "score": 81,
            "replies": [
                {
                    "author": "bill_bull",
                    "body": "Hate speech is the most protected speech. No one needs free speech protections to say polite shit or kiss the crowns ass.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "RobertEHotep",
                            "body": "Preach, brother.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeavesOfOneTree",
                    "body": "💯. There is no hate speech. Only speech or suppressed speech.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "RobertEHotep",
                            "body": "Hate speech is speech that someone hates. And that \"someone\" is usually a powerful entity who doesn't want to be criticized. That's all it is.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "LeavesOfOneTree",
                                    "body": "You’re giving credence to it. Hate speech doesn’t exist. \n\nIf someone calls you an imbecile, it’s on you to defend against that position.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "RobertEHotep",
                                            "body": "Totally agree. I've tweeted on more than one occasion -- just to get it off my chest! -- that hate speech doesn't exist. The concept/frame should be categorically rejected.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "LeavesOfOneTree",
                                                    "body": "🎯 and what happens when Afd gets elected in Germany? I wonder what they will do with speech when they have the power? \n\nThese people really need to read a book.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "jt7855",
                                                            "body": "We all read books. Try some books by Rothbard or even Friedman. Anything is better than Marx",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nein_nubb77",
                    "body": "Hate speech is deemed to be subjective to a person which opens the door for suppressed speech or opinions.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "RobertEHotep",
                            "body": "Every downvote I get is hate speech!",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "nein_nubb77",
                                    "body": "That’s right lol",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lavinadnnie",
            "body": "Holy shit. I'm from Zimbabwe originally. This is exactly the kind of authoritarian shit I'd expect from Mugabe's Zanu-PF one party state, not a highly advanced Western European country! Crazy shit. Not even all African countries do this.",
            "score": 46,
            "replies": [
                {
                    "author": "not_today_thank",
                    "body": "Remember it was western Europe that introduced the world to Socialism and Fascism.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "KochamPolsceRazDwa",
                    "body": "For how advanced Europe is, they did stupid shit too. Ahem Socialism.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hack874",
            "body": "I have a lot of family over there and honestly the Germans have never been much about free speech. The amount of times they’ve told me “You can’t say that!!” for something we wouldn’t think twice about saying in the U.S. is crazy.\n\nReally hope some fundamental change happens.",
            "score": 27,
            "replies": []
        },
        {
            "author": "TravisKOP",
            "body": "Germany and extremist ideology, name a more iconic duo",
            "score": 45,
            "replies": [
                {
                    "author": "SEMZen_Agentur",
                    "body": "USA – and quietly occupying countries like a modern colonialist. Your turn.",
                    "score": -21,
                    "replies": [
                        {
                            "author": "jt7855",
                            "body": "Actually the globalist high jacked the US government via organizations like the UN and USAID to create a world order under one umbrella. Biden exemplified globalism and was rejected.  For the most part Americans dislike globalists/socialists and hate our own bureaucrats that constantly meddle in our lives.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "ballhardergetmoney",
                                    "body": "Well said. ",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TravisKOP",
                            "body": "Gotta protect those American business interests",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheOakOtter",
            "body": "This will be America soon! Already been harassed for telling the local state representative he is a couple choice negative objects, and he sent a social service rep to inform me of a “forensic cyber investigator” investigating me. \n\nI did advise to please do arrest me for doing nothing wrong, no record, never been arrested, and see what happens to his political aspirations once the community found out. \n\nHis family might still vote for him, and probably some Trump followers.",
            "score": 8,
            "replies": [
                {
                    "author": "TXRhody",
                    "body": "Rep. Robert Garcia got a threatening letter from the DOJ because he criticized Elon Musk and said, \"bring actual weapons to this bar fight.\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReverendSerenity",
            "body": "germany returning to form with this one, mustache man will be proud.",
            "score": 20,
            "replies": []
        },
        {
            "author": "JBCTech7",
            "body": "i might be wrong, but i feel like this sort of thing happened in the past in Germany...and it didn't end well for them or millions of others.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Verum14",
            "body": "Germany has never had freedom of speech 🤷‍♂️",
            "score": 13,
            "replies": []
        },
        {
            "author": "Gobiego",
            "body": "But what if, in his defense, the minister IS an imbecile?",
            "score": 11,
            "replies": [
                {
                    "author": "sturzkampfbomber",
                    "body": "As a German I might dont want to give an actual definitive answer to this question, all I'm suggesting is that: there is a possiblity that this might be the case.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "robbzilla",
                            "body": "Nicely worded. I hope you don't also end up in jail!",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Achilles8857",
                    "body": "Strictly on a hypothetical basis of course, but if he were an imbecile, he might do something like arrange to have the home raided of any pensioner who called him an imbecile on social media.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "AlyxDaSlayer",
                    "body": "Their sentence is reduced by a single hour",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "RobertEHotep",
                    "body": "In defamation law, truth is an affirmative defense LOL",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kaiser_Constantin",
            "body": "Im german and Im not sure if it's legal to share my opinion on this",
            "score": 6,
            "replies": []
        },
        {
            "author": "jt7855",
            "body": "Arresting someone because they posted an insult like “schwachkopf professional “ is absurd.  Deputy Chancellor Robert Habeck probably is a professional idiot and a fascist pig.\n\nhttps://preview.redd.it/9kbiwicsybke1.jpeg?width=194&format=pjpg&auto=webp&s=fbf132c795c24a9ad7b6986f8e7cde478a937d08",
            "score": 14,
            "replies": [
                {
                    "author": "TheAlchemist1",
                    "body": "Sorry to burst your bubble homie.  Dudes a Green.  Closest US comparison would be the progressive caucus.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Woopigmob",
                            "body": "Progressive caucas. That's the group that yelled and chased people down for bot thinking like them, right?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Maltoron",
                            "body": "As if progressives haven't shown themselves to be exceptionally tyrannical in recent years.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "No_Temperature_8662",
                            "body": "A fascist with a green armband is still a fascist.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shorttyme3",
            "body": "Speaking out against political rivals in Germany is illegal so surprised 🙄",
            "score": 5,
            "replies": []
        },
        {
            "author": "throwaway195472974",
            "body": "German here.\n\nThe issue is way bigger. People, myself included, get more and more careful what we post online. Not because we want to offend politicians but out of fear that someone might feel offended. The bar is really low. Some guy once created a post, saying that a politician is \"a dick\" on some debatable topic. (In German: \"Du bist so 1 Pimmel\"). That led to their home getting raided. That word \"Pimmel\" or \"Dick\" is one the rather tame side of German swear words. Many people wouldn't even take it serious and consider it a joke instead.\n\nThe situation in Germany is complicated. We will have federal elections this weekend. This is the most important election in Germany, so people are rather stressed out. The AfD (a German party considered on the right) will be the second strongest party according to surveys. The current government basically fell apart, their coalition did not work out.",
            "score": 4,
            "replies": [
                {
                    "author": "yzkv_7",
                    "body": "The most likely outcome is a coalition between CDU and SPD though right?\n\nNo reason to believe that AfD will actually be in government.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "throwaway195472974",
                            "body": "AfD will very likely not be in the government. They will remain opposition.\n\nCDU/CSU and SPD is the mostly likely coalition in my opinion.\n\nIf that all does not work out, there is also a chance that there might be dynamic coalitions. Then there is an opportunity for AfD to work with CDU/CSU. It has already happened recently on the migration laws after our current government fell apart.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gobiego",
            "body": "For a bunch of guys in their teens and early twenties, our founding fathers were unbelievably far sighted, with a great understanding of man's baser instincts for control and authoritarianism. \nIt's sad how many Americans have no knowledge or appreciation for our constitution. The fact that we as fallible humans have not historically lived up to its lofty ideals not withstanding.",
            "score": 4,
            "replies": [
                {
                    "author": "Thuban",
                    "body": "Most of their inspiration came from the Enlightenment. Mostly the Scottish but also the French.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Effective_Reach_9289",
                            "body": "That's up for debate. There are several schools of thought among historians regarding the movements and ideas that most inspired the American Revolution and the Founding Fathers. Historians such as Bernard Bailyn would argue that they were inspired most by Engilsh libertarian Whigs. Read his \"Ideological Origins of the American Revolution.\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hblok",
            "body": "Now tell me how Vance is an extremist in and disinformation bubble again... /s\n\nThese people never stop too look themselves in the mirror, do they.",
            "score": 20,
            "replies": [
                {
                    "author": "kormer",
                    "body": "Haven't you heard? Free speech caused the holocaust.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Hench999",
                            "body": "This might be the single mist idiotic comment I heard from a journalist . I know they are dumb, but damn. ..",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Toaster_Toastman",
            "body": "JFC, what a shit hole",
            "score": 7,
            "replies": []
        },
        {
            "author": "obsidian_butterfly",
            "body": "Ah, so they're back to doing shit like it's 1934 eh?",
            "score": 3,
            "replies": []
        },
        {
            "author": "nein_nubb77",
            "body": "That 60 minute interview about getting arrested for memes and confiscating a laptop and smartphone etc is so Orwellian/authoritarian. WTH is wrong with Germany or even Europe for that matter.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BeeDub57000",
            "body": "It would be a shame if everyone used VPNs to insult German politicians from German IP addresses.",
            "score": 3,
            "replies": []
        },
        {
            "author": "FrancoisTruser",
            "body": "Europe is not well. I hope it heals.",
            "score": 3,
            "replies": []
        },
        {
            "author": "blacklisted320",
            "body": "Make no mistake that the liberals were chomping at the bits to enforce this on us if they had won this election. Silence suppresses the uprising and dissent.",
            "score": 7,
            "replies": [
                {
                    "author": "JakeVanderArkWriter",
                    "body": "champing",
                    "score": 4,
                    "replies": [
                        {
                            "author": "J_DayDay",
                            "body": "Both are correct, since 'champ' in that context fell out of common usage 2 centuries ago.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "chmendez",
                    "body": "I hate to call \"liberals\" people whose ideas not only are against economic liberties but now also against free speech.\n\nWe libertarians or classical liberal are the real liberals.\n\nI refuse to let them appropiate the label when they so authoritarian.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "blacklisted320",
                            "body": "I used that term simply because they identify that way, they are very much the nazis they project on everyone else",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gwhh",
            "body": "Reminds me of previous time in Germany. About 90 years ago.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NoDrama3756",
            "body": "I Didn't know the gestapo was still active in Germany.",
            "score": 2,
            "replies": []
        },
        {
            "author": "moosenoise",
            "body": "So... we should spam insults at german politicians right? The grandchildren of nazis making Opa & Oma proud",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ecstatic-Parfait4988",
            "body": "How can I get contact info for some German politicians and law enforcement? I wanna see if I can start an international incident by calling one something PG-13. Tell him he's a stupid dummy with a wrinkled weiner or something.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TajinToucan",
            "body": "Same in Denmark. You cannot say \"fuck the police\" without a fine or even a jail sentence.",
            "score": 2,
            "replies": []
        },
        {
            "author": "marginalboy",
            "body": "In case anyone is curious about the reality of [freedom of speech in Germany](https://maint.loc.gov/law/help/freedom-expression/germany.php#:~:text=The%20German%20Constitution%20guarantees%20freedom,communication%20rights%2C%20to%20every%20person.).",
            "score": 2,
            "replies": []
        },
        {
            "author": "Johnny_Mister",
            "body": "Is that why Germany is trying to ban opposing political parties from the election. To secure the democracy of the fourth Reich",
            "score": 2,
            "replies": [
                {
                    "author": "Achilles8857",
                    "body": "Got it. In order to secure democracy, it must be brutally suppressed.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Johnny_Mister",
                            "body": "Socialism 101",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HelloImTheAntiChrist",
            "body": "Germany is so unbelievably f**k.",
            "score": 2,
            "replies": []
        },
        {
            "author": "european_hodler",
            "body": "As someone living in Germany I ve to tell you that this is nonsense. American propaganda at its best.",
            "score": 1,
            "replies": [
                {
                    "author": "wod_killa",
                    "body": "So, you’re saying that this incident did not happen?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "european_hodler",
                            "body": "What incident? You can say whatever you want in Germany if you re not antisemitic. We are quite clear on that. We don't have free speech for fascists",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "wod_killa",
                                    "body": "I am looking at a post with a picture on it claiming something happened….",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "riplan1911",
            "body": "That's Ganna end well...",
            "score": 1,
            "replies": []
        },
        {
            "author": "RireBaton",
            "body": "Good thing this guy isn't around anymore, he'd be in prison:\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/August-Landmesser-Almanya-1936.jpg/1920px-August-Landmesser-Almanya-1936.jpg",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Sea_6214",
            "body": "So basically how it was from the 1930s until the fall of the Berlin wall. You do you Germany, you do you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "International_Lie485",
            "body": "How many people would be in prison in USA if we had this law?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Man, Robert Habeck is an imbecile",
            "score": 1,
            "replies": []
        },
        {
            "author": "Recent-Progress-76",
            "body": "And we previously discussed aligning with these nations…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thuban",
            "body": "What's old is new again. Book burning in 3....2...1",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far_Squash_4116",
            "body": "Insulting people was never covered by freedom of speech in Germany.",
            "score": 1,
            "replies": []
        },
        {
            "author": "diderooy",
            "body": "Next step:\n\n\"He is very smart. The smartest person alive. I really really mean it.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "stuckat1",
            "body": "Sad.  I thought Germans had a sense of humor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "poorxpirate",
            "body": "The Germans have been castrated for years my friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ooofisa4letterword",
            "body": "But muh freedum index",
            "score": 1,
            "replies": []
        },
        {
            "author": "GotStomped",
            "body": "Total fucking bullshit",
            "score": 1,
            "replies": []
        },
        {
            "author": "godisfeng",
            "body": "Pathetic",
            "score": 1,
            "replies": []
        }
    ]
}