{
    "title": "That's it that's the whole group",
    "author": "EndDemocracy1",
    "subreddit": "Libertarian",
    "rank": 129,
    "score": 1100,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 101,
    "url": "https://i.redd.it/fd51qpg4z3le1.jpeg",
    "id": "1ix56bk",
    "selftext": "",
    "comments": [
        {
            "author": "None",
            "body": "[removed]",
            "score": 86,
            "replies": []
        },
        {
            "author": "jimmpony",
            "body": "Honestly not super familiar with Sanders' political history but I found these two things with some basic searching:\n\n- Burlington Community Land Trust - developed 320 moderately priced single-family houses and condominiums and helped more than 400 families buy their own homes\n- Prescription Drug Pricing Reforms (Inflation Reduction Act - 2022) - Allowed Medicare to negotiate drug prices for the first time\n\nJust based on this, post seems kind of bullshit\n\nedit: they parmabanned me from the sub for this comment lol",
            "score": 338,
            "replies": [
                {
                    "author": "Fuck_Surfing",
                    "body": "Makes sense, libertarian has morphed into people who are Republican but ✨special✨",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 71,
                    "replies": []
                },
                {
                    "author": "MrMiniskus",
                    "body": "If true that permaban is disgusting. Trying to silence people here that disagree with a mods opinion?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Kreepr",
                    "body": "How dare you!",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Recent-Progress-76",
                    "body": "Even though I am right leaning I appreciate facts. However you should normalize providing proper sources.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fun_Department2717",
                    "body": "medicare negotiating drug prices is unwarranted government intervention in the free market....might as well reduce patent lengths a bit and close the patent loopholes pharmaceutical firms exploit to promote competition and allow competitive pressure to reduce prices and foster innovation.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "alurbase",
                            "body": "Not to mention government negotiations don’t work past a few years when the craft big pharma lobby bribes the same politicians who passed the bill to look the other way as they rename and repackage their drugs to tackle 99.9% similar but legally distinct “health issues” and the negotiated drug has “supply issues”",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Fun_Department2717",
                                    "body": "exactly....the only reason its so costly here is first burdensome regulations and second, allowing pharma companies to renew patent every time they make a minor formula change effectively granting them lifetime monopoly...fuck the big pharma lobby....its one reason our healthcare is atrociously expensive",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "j_musashi",
                    "body": "Calling bullshit on you not being familiar.\nNo one researches a meme like this. No one.",
                    "score": -31,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 232,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 96,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -56,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 190,
            "replies": [
                {
                    "author": "Exprellum",
                    "body": "Because catering to authoritarian figures is anti-libertarian. And this was a joke about an authoritarian figure",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "John2H",
                    "body": "Right? Why can't Bernie just mind his own business?",
                    "score": -96,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 113,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 66,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "Golf_InDigestion",
                    "body": "I don’t think Vladimir Lenin or Karl Marx were corrupt. By your logic, where this is the only criterion, should they be considered libertarians?",
                    "score": -8,
                    "replies": [
                        {
                            "author": "BigDaddyReptar",
                            "body": "Where did I say that would make them libertarians?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Golf_InDigestion",
                                    "body": "You said you’re not a libertarian if you criticize Bernie, for the sole reason that he isn’t corrupt.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "BigDaddyReptar",
                                            "body": "No I said you're not a libertarian if you're going against one of the least corrupt instead of the politicans actually increasing government control",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Golf_InDigestion",
                                                    "body": "I laughed out loud there. One can’t be considered ‘libertarian’ because of criticism of Bernie’s inane ideas? Solely because he isn’t corrupt? That’s the most absurd proposition I’ve heard all day. I suppose we have no license to criticize Paul Krugman or John Maynard Keynes either? Preposterous. Socialist ideas should always be subject to extreme scrutiny. \n\nTo the contrary, being skeptical of statists like Bernie is exactly what makes one a libertarian. And particularly him, because he came within a hair’s breath of the presidency 9 years ago. \n\nHe would’ve presided over the greatest expansion of the Federal government since FDR. To which I think we all should say: HELL NO!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 33,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Libertarian-ModTeam",
                            "body": "Advocating for anti-libertarian positions, policies, candidates, and ideologies is not welcome.",
                            "score": -80,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Libertarian-ModTeam",
                                    "body": "Advocating for anti-libertarian positions, policies, candidates, and ideologies is not welcome.",
                                    "score": -73,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Libertarian-ModTeam",
                    "body": "Advocating for anti-libertarian positions, policies, candidates, and ideologies is not welcome.",
                    "score": -72,
                    "replies": []
                }
            ]
        },
        {
            "author": "loghoser",
            "body": "I think you are confused. That's the picture of every politician that was neither corrupt or had a relationship with Epstein.",
            "score": 323,
            "replies": [
                {
                    "author": "Mdj864",
                    "body": "Fell right in line with Hillary just like all of the other DNC sellouts. While I disagree with him on most things, I used to respect his integrity before that. At the end of the day he won’t bite the hand that feeds him his millions.",
                    "score": -51,
                    "replies": [
                        {
                            "author": "waltur_d",
                            "body": "His net worth is like 3 million.  😂",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 43,
            "replies": [
                {
                    "author": "Libertarian-ModTeam",
                    "body": "Left libertarianism is an oxymoron",
                    "score": -66,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 7,
            "replies": []
        },
        {
            "author": "libertarianinus",
            "body": "\"By simply saving $6,000 a year for 50 years at a 7% compound annual growth rate, Sanders could have amassed $2,600,000. If Sanders saved $10,000 a year for 50 years at an 8% compound annual growth rate, he would currently have over $6,200,000. Therefore, it's not far fetched to believe Senator Sanders is secretly worth over $5 million\"\n\nhttps://www.financialsamurai.com/bernie-sanders-net-worth-is-extremely-high-for-a-democratic-socialist/",
            "score": 98,
            "replies": []
        },
        {
            "author": "Professor_Chaos69420",
            "body": "This sub is joke i think. I cant belive that all of those posts are fr.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MagicManKazaam",
            "body": "Estimated net worths of politicians. Mitt Romney 250-300 million. Darrell Issa $250-$450 million. Rick Scott $549 Million. Nancy Pelosi $267 million. Vern Buchanan $249 million. Mark Wagner $247 million. Pete Ricketts $100 million. Donald Trump in the billions. I can go on and on. Bernie spent the majority of his political career as a non millionaire and only recently in the past few years become a millionaire after signing lucrative book deals since he's gained traction as being one of if not the most consistent politician when it comes to fighting for the American people. What's up with all these fake Libertarians that are really Republicans/ conservatives but embarrassed to claim their party bashing Bernie in this sub so much recently ? Fox News must be pushing an anti Bernie Sanders campaign these past couple of days lol since he's been calling out how the government is turning into an oligarchy and how since in the past few weeks Musk, Bezos, and Zuchenberg have made a few billion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alarmed_Guarantee140",
            "body": "Wow, a whole lot of \\[deleted\\] in here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LagerHead",
            "body": "Bernie didn't lift Bernie out of poverty.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Angrysliceofpizza",
            "body": "I have a fridge magnet of the bottom right picture except Bernie sanders is in the little floating pod baby yoda lived in.",
            "score": 0,
            "replies": []
        },
        {
            "author": "austnf",
            "body": "Why do people think this is a “left libertarian” sub \n\nr/lostredditors",
            "score": -42,
            "replies": [
                {
                    "author": "Cambronian717",
                    "body": "They are so used to “left libertarian” thought they can’t imagine what an actual libertarian position is",
                    "score": -37,
                    "replies": [
                        {
                            "author": "XIITheHangedMan",
                            "body": "“Actual libertarian” is hilarious. Bro needs a history lesson. Then the Mods with their no left liberty bot, so worried of differing ideas they don’t even allow the full scope of the philosophy to be talked about. This place is not Libertarian.",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "AutoModerator",
                            "body": "Left libertarianism is an oxymoron. There can be no liberty without economic liberty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                            "score": -42,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gwhh",
            "body": "So true.",
            "score": -18,
            "replies": []
        },
        {
            "author": "International_Lie485",
            "body": "Should've put his mansions behind him.",
            "score": -24,
            "replies": [
                {
                    "author": "jimmpony",
                    "body": "0% chance you would donate all your money instead of having a few houses if you were rich yourself.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Golf_InDigestion",
                            "body": "So what? They’re not dishonest about going to the mat for workers and the poor. Bernie’s the one claiming that he stands for the working class. He ought to put his money where his mouth is.",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kewissman",
            "body": "You left out his wife",
            "score": -45,
            "replies": []
        },
        {
            "author": "Achilles8857",
            "body": "That's some funny stuff right there.",
            "score": -31,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -5,
            "replies": []
        },
        {
            "author": "Silence_1999",
            "body": "But it’s for the people!  As long as you repeat it enough times and the other congresscritters give their permission then it’s fine.  Everyone will eventually benefit (equally lol) when we reach the utopia which is promised.",
            "score": -33,
            "replies": []
        },
        {
            "author": "Temporary-Sun-862",
            "body": "Take my upvote, I actually lol’d",
            "score": -13,
            "replies": []
        },
        {
            "author": "UnderstandingKey9050",
            "body": "Lmaooo",
            "score": -48,
            "replies": []
        },
        {
            "author": "Panekid08",
            "body": "Bernie love on a libertarian subreddit is crazy.",
            "score": -1,
            "replies": []
        },
        {
            "author": "ENVYisEVIL",
            "body": "3 houses should be adequate enough to support all 5 of them",
            "score": -74,
            "replies": [
                {
                    "author": "Ihatemylife153",
                    "body": "One of them was inherited when his wife's parents died you dipshit. And then he lives in 2 different places to do the job he was elected to do. Is thinking that hard for you?",
                    "score": 91,
                    "replies": [
                        {
                            "author": "Crispy_Potato_Chip",
                            "body": "According to snopes \n\n\n>The senator's main residence in Vermont is a colonial four-bedroom house in Burlington, which he purchased in 2009 for a reported $405,000. He also owns a one-bedroom 1890 row house in Washington, D.C., just a few blocks from the Capitol, which he bought for a reported $489,000. As well, he owns a lakefront cabin in North Hero, Vermont, purchased for a reported $575,000 in 2016.\n\n\n\n\nHe and his wife sold her half of her inheritance house to her siblings, none of the houses he currently owns were inherited ",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "CatepillarJones",
                            "body": "Can definitely tell by how you type that you hate your life",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "Ihatemylife153",
                                    "body": "Ignorance do be bliss don't it......",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "CatepillarJones",
                                            "body": "Someone say doobie?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Herr_Sully",
                            "body": "Calm down bro, he's not gonna suck your dick",
                            "score": -9,
                            "replies": []
                        },
                        {
                            "author": "Ok_Nefariousness9019",
                            "body": "Lol. Big cope. “He must be picked up in a limo after sleeping on silk satin sheets so that he’s well rested enough to redistribute all of my income!”",
                            "score": -31,
                            "replies": []
                        },
                        {
                            "author": "Son_of_Sophroniscus",
                            "body": "y u so mad tho?\n\n\nLMAO 😂",
                            "score": -15,
                            "replies": []
                        },
                        {
                            "author": "Golf_InDigestion",
                            "body": "How’s that Bernie boot taste?",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -33,
            "replies": []
        },
        {
            "author": "Mr_E_Mann1986",
            "body": "https://preview.redd.it/lkc8geezd8le1.jpeg?width=1229&format=pjpg&auto=webp&s=2696e171d2635b5ee814a42fe7ae5a8ce6b0f9b3",
            "score": -7,
            "replies": []
        },
        {
            "author": "Soft_Yesterday5746",
            "body": "DON'T TREAD ON ME COMMIES!",
            "score": -4,
            "replies": []
        }
    ]
}