{
    "title": "Alright here’s one for you.",
    "author": "rowdyroundy775",
    "subreddit": "Libertarian",
    "rank": 110,
    "score": 6,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.dallasnews.com/news/faith/2025/02/26/fairview-mayor-pleads-with-church-of-jesus-christ-of-latter-day-saints-to-avoid-lawsuit/?outputType=amp",
    "id": "1iz750y",
    "selftext": "I’m an exmormon so I have a bias against this church/cult specifically. It has come to my attention that they are attempting to bully a local government over their local zoning laws. Part of me goes “Hell yeah local, small government enforcing their residents will” \n\nThe other part of me goes “Freedom of religion, snd freedom to do with land what you will” BUT ALSO you’re not an individual you’re an organization. \n\nWhat’s the most correct answer here. I’m conflicted with my obvious bias. ",
    "comments": [
        {
            "author": "Explic11t",
            "body": "Ya know, I don't like the church and I wouldn't want them in my town.\n\nThat said, I hate zoning laws so much more.\n\nI'd be on the side of let them do it.",
            "score": 7,
            "replies": [
                {
                    "author": "rowdyroundy775",
                    "body": "I mean it is just the height of their steeple that they’re bitching about.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Psychological-Bed-92",
            "body": "I’m not a huge fan of zoning laws, but this is the church just being plain disrespectful to its neighbors",
            "score": 4,
            "replies": [
                {
                    "author": "rowdyroundy775",
                    "body": "And it’s over something trivial.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "32indigomoons",
            "body": "Eh hard call. I mean I’m for zoning laws in the form of no bars within a certain range of schools or porn etc.. but the church bs I mean are we not all adults? What you don’t wanna be tempted with titties and booze bc you can’t handle yourself? That’s our problem? LOL",
            "score": 1,
            "replies": [
                {
                    "author": "rowdyroundy775",
                    "body": "Its over the height of their steeple. Like its bananas.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Traditional-Survey10",
            "body": "From an anarcho-capitalist perspective, the neighborhood is owned in proportional parts by those who own property there, so the streets and the rules applicable to the properties there should be democratic only between owners. Whoever does not like the rules of the neighborhood, he can express the reason why it is an undesirable situation, using the resources that they have peacefully access to promote his ideas. So, if the streets of the neighborhood are private property of the neighbors, they could block the passage to a specific property. I know it sounds anti-common sense, but it is the systematic repetition and comparison with other neighborhoods, which regulates what behavior is acceptable. Those who want to acquire a property in that neighborhood should take into account the policies of those who own that neighborhood and ensure an explicit contract of those rules. From the Libertarian perspective, that contract should not violate: 1- the right to private property, 2- the right to life and 3- the right to the peaceful realization of individual projects.  But with respect to the regulations on buildings, it is possible to impose the commitment to follow the specific rules. Without violating the other two rights. Because the parties voluntarily agree to follow that contract. In the specific case, that contract does not exist, or in a very broad and illegitimate way the city's rules are applicable even though they come from a political power other than that of the owners of the neighborhood. So, from the Libertarian perspective, that building could be built, because the owners of the neighborhood are slaves of the political power of the city and are subject to its judgment. The underlying problem is why there is an organization that has enslaved the neighbors? The problem it's called [Statism](https://en.m.wikipedia.org/wiki/Statism).",
            "score": 1,
            "replies": []
        }
    ]
}