{
    "title": "What do you like *and* dislike about this current presidential administration?",
    "author": "thiccpastry",
    "subreddit": "Libertarian",
    "rank": 61,
    "score": 24,
    "upvote_ratio": 0.6,
    "num_comments (reported by reddit)": 244,
    "url": "https://www.reddit.com/r/Libertarian/comments/1j13wmb/what_do_you_like_and_dislike_about_this_current/",
    "id": "1j13wmb",
    "selftext": "And do you feel like you're lumped in with the extremists in the MAGA movement? I don't know what else to say for the character count, I'm sorry.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sure_Opportunity_543",
            "body": "If you ask a question you are automatically lumped into a side.   It’s a bad place in the politic world.   Can not have a thought of your own.",
            "score": 179,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 45,
                    "replies": [
                        {
                            "author": "Glittering-Tip-6455",
                            "body": "Just here to give hope and say I vote blue but I don’t agree with everything they do and welcome conversation. I do not entertain hateful speech and I encounter a lot of it, but that is a different conversation.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Simple-Bat-4432",
                                    "body": "I lean more to the right but disagree with a lot of the sentiments there as well. Need more people like you honestly",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Glittering-Tip-6455",
                                            "body": "And more like you too. I hear too many right leaning folks that just tow party lines and never voice opposition. \n\nThis is going to turn into a rant so bear with me. At this point my biggest things are that trump is not pro gun, he is not pro free speech, and he is not pro autonomy. Those are just facts. If he was, the press would not be limited in the Oval Office. If he was, he wouldn’t be purging our military of ready and willing transgender soldiers. And all the lies about Russia starting the war? He acts like we’re all fucking stupid and don’t remember. He is intentionally rewriting history so that he can further his own interests. It’s very troubling and I find it insulting. He’s a convicted felon that is not legally supposed to vote or own a gun and yet, he is the most powerful of all of us.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "But I understand you voted blue? How do you reconcile autonomy with forcing people to take an experimental vaccine? Genuinely interested in your take.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Glittering-Tip-6455",
                                                            "body": "I did vote blue, both 2020 and 2024. I do want to make it known, I’m not glue to the Democratic Party and don’t have to register a party to vote in my state. I am not against crossing party lines so I promise, I’m not one of those. I did not love the mandating vaccines, though I did get the Covid vaccine as soon as I could. I had less of problem with private entities requiring it/barring people without it because that’s not the government.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Simple-Bat-4432",
                                                    "body": "Right, Trump doesn’t even stand for the core “conservative” values as you mentioned. I honestly don’t think he’s smart enough to be the dictator people are making him out to be but more like a toddler driving an 18 wheeler",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "thiccpastry",
                                                            "body": "You said you lean more to the right. What values does Trump have or not have compared to conservatism?",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Simple-Bat-4432",
                                                                    "body": "He signed off on the bumpstock ban and despite the whole “America first” thing it still sounds like we’re going to be fueling foreign wars but we’ll see. He’s doing some things I like even though I don’t like him as a person but overall I’m just waiting to see",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "thiccpastry",
                                                    "body": "The person I know said it's fine he's limiting press in the oval office because Joe Biden's white house correspondents were the dems puppets basically.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Glittering-Tip-6455",
                                                            "body": "Of course they did 🫠 people forget that free speech doesn’t just extend to what they want to hear.",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "No_Temperature_8662",
                                                                    "body": "Did you regret supporting Biden after he cut 440 reporters from the Whitehouse press pool? That was a pretty big anti-free speech thing to do by your logic.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Glittering-Tip-6455",
                                                                            "body": "Yes, I was not okay with that. I don’t take a hypocritical stance and am not afraid to say “I voted for him, but I don’t agree with that.” With that said, I’d vote against Trump in every election. I am a woman who has been raped. He is a felon who is not legally allowed to vote or own a gun in our country. I live in a rural area where people love guns and hate criminals and yet, here we are. \n\nThank you for your questioning, I do appreciate the dialogue.",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "No_Temperature_8662",
                                                                                    "body": "Very glad to hear that you are internally consistent on that. I applaud that part of you. \n\nI'm deeply troubled to hear that you are a victim of rape. I hope the person you did that to you was buried under the jailhouse. It should never happen.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Glittering-Tip-6455",
                                                                                            "body": "I appreciate your kind words. I try very hard to live non-hypocritically. What’s wrong for one is wrong for all. \n\nUnfortunately they, like Trump, had no consequences. I’m sure he’s out there living his best life right now while I carry lifelong trauma. With that said, I have done a lot of healing because that is my responsibility as a human. It happened over 10 years ago and I can tell you exactly what the room looked like, felt like, even smelled like. It doesn’t go away, and that’s why it is so disheartening to watch people like that succeed. It so often doesn’t affect the perpetrator at all. Please remember stories like mine as we go forward in this world.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "No_Temperature_8662",
                                                                                                    "body": "Not something I discuss openly but please know you are not alone.",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "There is no such thing as hate speech, my friend, only speech you hate. It is important that we never make speech you hate illegal. That is how tyrants win.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Glittering-Tip-6455",
                                            "body": "You’re so right. I would never vote to make any speech illegal. I, personally, draw the line at listening to people when they start using slurs. It means the conversation has devolved to a point where everyone is speaking in anger and not from deep thought. But I agree with you, once we make some speech illegal it lends to making lots of speech illegal.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DigRepresentative42O",
                    "body": "I was told to “vote” then when people find out I voted 3rd party my vote automatically is grouped as a waste or a vote to the other side.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "SatiatedPotatoe",
                    "body": "Yeah that's definitely only this administration.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "fennis",
            "body": "Dislike: attacks against personal liberty, tariffs, power shift from congress and the states to the president, rapid growth of the debt and deficit \n\nLikes: deregulation, 2nd amendment protections",
            "score": 78,
            "replies": [
                {
                    "author": "Smiley1236",
                    "body": "Have we seen real 2nd Amendment protections yet?  I am hearing about conversations but have not seen anything from the administration yet. But I could be missing it.",
                    "score": 59,
                    "replies": [
                        {
                            "author": "cocktail_wiitch",
                            "body": "Have yall not seen the video of Trump and Bondi talking about putting forth legislation to take firearms away from anyone they deem an \"enemy of the state\" or \"mentally unwell\"? They're not protecting shit for anyone who isn't a loyalist or a \"patriot\".\n\nEdit: phrasing",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Goldyzar1",
                                    "body": "Can you link the video cause I have been looking for it and search engines are kicking back nothing",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "cocktail_wiitch",
                                            "body": "Can I send video via DM? I've got the video and a letter from Roger Stone calling for the same thing saved to my phone I can send you. I came across the video here on reddit.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Goldyzar1",
                                                    "body": "Sure",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "lajfa",
                            "body": "Authoritarians don't allow the populace to be armed.  But that comes later.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "fennis",
                            "body": "Probably mostly rhetoric, but i think rhetoric matters.  I do believe people in his administration believe in the rights of people to own guns",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "gonets34",
                                    "body": "This, and frankly no change is still better than going in the wrong direction.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thiccpastry",
                    "body": "What would you say are some examples of the attacks on personal liberty?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "fennis",
                            "body": "Removal of trans in the military, anti gay marriage rhetoric, drug policies they are discussing, hard armed approach to immigrants,  (attempted) opening of gitmo as an offshore prison, militarization of the border, abortion restrictions.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "On the abortion restrictions, wasn't the question of abortions simply handed back to the states? I'm all for decentralization. Did I miss something about a federal abortion ban or something?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "fennis",
                                            "body": "Well if you believe, like I do, that it is immoral for the State to restrict your natural (or god given ) rights, it doesn’t matter if it is the federal government, a state government, a city government or your next door neighbor restricting bodily autonomy.  It is not any level of government business who chooses medical procedures including abortions.\n\nNow ill nod to the other people feel differently and they think the fetus has its own autonomy that is equal to or maybe greater than the mothers. If you believe that than abortion should be illegal on any level, its not something that should be legislated by the state either.  Again I don’t support that argument, but if you do not sure why the federal government or the State of California can morally say otherwise.\n\nAs far as abortion restrictions.  The Trump administration has out on several restrictions at the federal level such as the Mexico City policy which blocks  non governmental agencies from promoting or referring abortions.  They have also reimplemented the Hyde Amendment which bars federal funds from being used for abortions.  They also banned funding of abortions for female service members. They also may <still tbd> join the effort to ban mail order medications women use for abortions.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Mediocre_Maize256",
                                            "body": "I agree with giving control of some things back to the states but issues of liberty/autonomy should not be different based on what state I live in.  Imagine all heart medications being illegal in some states but not others and men being told to prevent heart disease through diet and exercize. Oh wait. It doesn't work for everyone nor does it work all the time. That's why medical intervention may be needed.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "The issue here is that a significant portion of the population considers abortion to be outright murder. As in the act that is considered to universally and morally reprehensible. Those states are not saying 'ha ha you have no rights' they are saying 'the baby you conceived has a right to live, you don't get to kill it'. That moral objection is fairly regional so giving it back to the states seems like the right move to me.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PurposelyVague",
                            "body": "Rolling back women's rights is a huge one. The save act as proposed would prevent a large number of married women from voting in federal elections.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Artifycial",
                    "body": "What second amendment protections?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Oquendoteam1968",
                    "body": "Third worldism dressed in Gucci",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "No_Temperature_8662",
                            "body": "This. I think that the renewed discussion of getting rid of the federal income tax is amazing. If there were a way to make it work for tariffs instead that would be much better from a moral stand point. Then it wouldn't be essentially armed robbery, it would be part of the cost of choosing to buy certain goods. Mind you I want all taxes gone eventually but this would be a huge win.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pitiful-Account-6447",
            "body": "Eh, all the trans stuff. The loud and wrong majority ruined the lives of us regular trans ppl… we also hate the blue hair tiktokers who are making men and women uncomfortable. Most of us just want to live a regular and passing life… quietly.",
            "score": 21,
            "replies": []
        },
        {
            "author": "chmendez",
            "body": "I like DOGE, at least the goal/intention, not neccesarily all implementation details(exaggerations, some blunders, but I like the tech approach.)\n\nI dislike tariffs and trade wars. Big setback to freer trade that the world has been going to. I might accept reciprocal trade measures against China and maybe the EU which has had their own share of unfair trade practices. But Canada and Mexico is a big big mistake.\n\nDon't like the bullying against US traditional allies in the west. Very stupid move from Trump.",
            "score": 44,
            "replies": [
                {
                    "author": "jcutta",
                    "body": "I don't like a self serving unelected billionaire being handed the keys to altering the federal government and how it is ran without any accountability.\n\nI also highly dislike the spray and pray approach in restructuring federal departments. They need to be trimmed and in some cases disbanded but it needs to be done with precision and in stages.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Thenameisjoel",
                            "body": "Can you point to an example where the billionaire, acting on behalf of doge, acted in a way that served themselves in some way? Would like this information to tell others, thank you!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PrinzChiyo",
                                    "body": "[Lawmakers question Musk influence over Verizon FAA contract | Reuters](https://www.reuters.com/world/us/lawmakers-question-musk-influence-over-verizon-faa-contract-2025-02-28/)\n\nMusk falsely accused Verizon on failing equipment not produced by verizon, and suggest FAA using starlink instead",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OutrageousAd6177",
                    "body": "I feel like both sides of the aisle can agree to this except the extremes of both.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ctr72ms",
                    "body": "With trump I feel I like the intent of what he is trying to do on about half of it but he just goes about it in the most dramatic way. I agree we should have better open trade deals but he just jumps to trade wars instead of negotiations and discussions.\n\nThe bullying our allies is the same. I think alot of them should step up. I'm tired of the US funding 90% of nato and the UN and us getting involved in every area of the world because nobody else will but he just jumps to the extreme. It works I guess but the path there is just so dramatic when he jumps straight to hitting the problem with a sledgehammer each time.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Nikadaemus",
                    "body": "Canada needed a push to do the right thing\n\n\nWe've been under siege for a decade and most of the people are just lemmings running off the cliff\n\n\nCan't have such a security risk as your biggest border & trade partner imho ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Express-Ad-9326",
                            "body": "Push to do what??? There's faaar more crap coming from America in to Canada. MAGA propaganda",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Nikadaemus",
                                    "body": "You may be looking at border seizure data, but the real story = what's been seized in busts *inside* the country,  and we're at tens of kilos of Fent.  All made here and trafficked using bonded semi drivers",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "incendiarypotato",
                    "body": "+1 across the board.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "No_Temperature_8662",
                    "body": "I don't mind him shaking things up with our allies when those allies have failed to live up to their obligations under NATO. \n\nThe EU has been actively funding Russia during the war in Ukraine buy continuing to buy energy from Russia. Trump called them out on filling Russia's coffers during his first term and I remember the media doing this whole 'don't call out our allies' routine back then, too. Sadly they are still buying energy from Russia today.\n\nThe EU really needs to stop sending aid to Russia.\n\nHe also grilled NATO member nations for not spending their agreed upon percentage of GDP on there local military, also something they still aren't doing. \n\nWhat is he supposed to do? Give NATO members a free pass for funding Russia and not shoring up their own defenses? They are wanting to ignore the real need for defense spending when they have a neighbor like Russia  and then turn to the US to fix it when things go wrong. Gross.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ecleipsis",
            "body": "Pros: tax cuts, deregulation, gov spending cuts, freeing Ross Ulbricht \n\nCons: foreign relations, tariffs, if gov spending cuts are too fast it’s bad as private sector needs time to fill gaps, border patrol and deportations have been poorly handled and people’s rights are being violated.",
            "score": 57,
            "replies": [
                {
                    "author": "hawkeedawg",
                    "body": "Tax cuts?",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Sea_Journalist_3615",
                            "body": "Yeah, tax increases more like, increased spending. Ross was the only real win so far.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "Oquendoteam1968",
                                    "body": "Exact. The Ross thing. Final point. He is creating problems in all the financial markets that looks like a president of Latin America.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Seul7",
                            "body": "You know... for billionaires!",
                            "score": 38,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LibertarianTrashbag",
                    "body": "Nobody talks about the problem of cutting funding and protections too fast. Important things need funding, and people need guardrails, and the current modes we have for this are government-backed. It's totally possible, as well as more efficient and moral, to have other modes of protection and funding for things, but there needs to exist adequate time to do that or else it comes across like you just want to cripple academia and let the rich get away with stuff.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "ecleipsis",
                            "body": "Exactly. There aren’t enough jobs to accommodate without time for the private sector to fill the needs.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "thiccpastry",
                            "body": "Love this so much!!!!!",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "No_Temperature_8662",
                            "body": "Meh, give them the chainsaw. The 'slow and careful' approach of expecting the experts in government to be conscientious and accountable is how we got into this mess in the first place. They have had decades to fix this already and they haven't really bothered to even seriously audit it.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "LibertarianTrashbag",
                                    "body": "Nobody's ever been serious about the \"slow and careful\" approach. Any large push to do so has always been a half-assed attempt by Republicans to get libertarian voters. It's mofos who promise to lower spending on the campaign trail then turn around and triple the debt who have ostensibly pushed for this before. Get actual libertarians in there to either implement real plans for slow change or immediate legislation that sets time limits on our current institutions rather than slashing them outright.\n\nEven the current administration is only \"shrinking the government\" in the sense that it's eliminating unchecked power for bureaucracy and exorbitant spending on social programs in order to redirect unchecked power to himself and exorbitant spending to his projects. \n\nThere is also real danger in destroying this generation in order to make it better for future ones.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "Love your Minarchist flair, by the by. This is not an attack or sarcasm. I too want the state as small as I can get it, ideally zero but one step at a time. \n\nI have trouble with the 'nobody has ever been serious about X' arguments, it feels too close to statist answers for my comfort. That said I too would love to see a mob of libertarians put in charge of these agencies. But I don't think it would go slow or careful that way either. \n\nNow don't mistake me for an accerationist - I'm not that, I just think what whoever gets in charge of this process is going to have the other side screaming 'you are going too fast and you are being too hasty in your cuts'. It is an easy defense. But when I see things like the DOD failing to audit themselves 7 years running and telling everyone 'that's ok, we will get it right next time, trust us' I get fed up with this slow approach nonsense.\n\nIf this was the private sector someone would lose their job the second year the audit failed (if not the first). The fifth year the audit failed I would expect the shareholders to replace the whole C-Suite. Here we are year seven and this looks like malicious refusal to perform the audit.\n\nThat short of thing does need decisive change to fix it. If a department is that frozen, from a business change perspective, they need some serious disruption. Now I'm not sure DOGE is going to cut deep enough (and we do need some deep cuts to get us out of this debt mess) and I too have fears that this may all be political theater, but I do want changes made and soon.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Present_Armadillo_59",
                    "body": "Unless you make over $150k a year, your taxes will be increasing under Trump's current plan. I'm expecting mine to go up at least $1500 in 2026",
                    "score": 16,
                    "replies": [
                        {
                            "author": "anonymous2134",
                            "body": "Which part of his tax proposals will cause taxes to increase for those under $150k? If his 2018 tax rates get extended then it will be no change.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "DannkDanny",
                                    "body": "All you have to do is look at the tax brackets. It's not even magic or anything you can find tax planning sites that will give you a really good estimate based on a few simple inputs. \n\nTaxes are going to go up for a least 80% of Americans.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "onespiker",
                                    "body": "Tarrifs",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "So my taxes only go up if I buy certain foreign goods? I can live with that if he ends the federal income tax. I agree that tariffs are not great but they are much better than income tax increases.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "onespiker",
                                                    "body": ">So my taxes only go up if I buy certain foreign goods? \n\nPretty much everything that is made in American will also go up since what they need are also getting increased. \n\nEven things that are American made and American supplies will get more expensive since the bussnies that does it will want to increase thier profit and will be easy to do it with less competition.\n\n>I can live with that if he ends the federal income tax. \n\nHe won't do that so the net point will be a increase of taxes",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Present_Armadillo_59",
                                    "body": "The 4.5 trillion dollar tax cut he is proposing will not be a tax cut for you unless you are high income. Even his current tax cuts caused a lot of middle class Americans to have increased taxes last year and for this year.. On top of that, the national debit increases $500 billion in the next 2 years with his plan and he is causing so much uncertainty in the economy that he is basically forcing us into a recession.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "No_Temperature_8662",
                            "body": "Your privilege is showing. In the right income bracket $5k is life changing money.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thiccpastry",
                    "body": "Thank you for mentioning that if the government spending cuts are too fast, it's bad because private sector needs time to fill the gaps. I have someone in my life who is perfectly fine with the rate at which things are going because it's \"short-term suffering for long-term gain.\" As if the people being cut immediately like what is happening will ever see a long term gain from losing their job in an already broken economy.\n\nEdit: word",
                    "score": 6,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "thiccpastry",
                                    "body": "Wow, I didn't even think of it from this perspective!!! That just really solidifies my opinion on his cuts he's doing lol",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ecleipsis",
                            "body": "This.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "poneros",
                    "body": "You have to earn about $700k to cancel out the tax increases from the 1st 5 income brackets.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "cyrusthemarginal",
            "body": "Its all extremists on both sides all the way down right now. I like the idea of cutting government spending and waste, there is tons of it. Not a big fan of buddying up to Putin at all.",
            "score": 9,
            "replies": []
        },
        {
            "author": "heatY_12",
            "body": "Dislike: The way undocumented immigrants are treated and spoken about, the pardon of violent J6 offenders, despicable handling of foreign affairs as seen with the Zelensky meeting, tariffs and tax increases, much more to go on about but I’ll leave it at that for now\n\nLikes: DOGE concept is good, execution could be better if the people in charge actually wanted to root out corruption and cut spending, I like the promise of no tax on tips and overtime, I’m not sure what else to put here lol",
            "score": 12,
            "replies": []
        },
        {
            "author": "OVERCAPITALIZE",
            "body": "Like:  cost cutting and firing of tax paid workers that add dubious value. \n\nDislike: chaotic lack of direction and international embarrassment",
            "score": 3,
            "replies": []
        },
        {
            "author": "libertarianinus",
            "body": "I remember that when Clinton laid off federal workers and had welfare to work was celebrated....you would not find this information in today's media.\n\n\n\"Every record has been destroyed or falsified, every book rewritten, every picture has been repainted, every statue and street building has been renamed, every date has been altered\"\n\n1984 Orwell",
            "score": 25,
            "replies": [
                {
                    "author": "liberty_is_all",
                    "body": "Lol, did you even Google it before you spouted this?\n\nI don't like Newsweek but this was a decent recent article  from...yesterday:[Clinton & Trump Federal Government Reduction Comparison](https://www.newsweek.com/trump-doge-cuts-compare-bill-clinton-2037742)",
                    "score": 12,
                    "replies": [
                        {
                            "author": "libertarianinus",
                            "body": "Nope.....my neighbor took the deal in the 90s. From 1998 to 2001, the US took in more money than it spent. It was the only time in 50 years. One thing for sure....if you want the US to fail, keep doing what they have been doing. The definition of insanity is doing the same thing and hoping for a different result.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "liberty_is_all",
                                    "body": "Oh I completely agree that the Federal government needs to shrink, the right way.  The conservative Congress led a lot of the reasons why there was a surplus late in Clinton's second term. And then the Bush era tax cuts and wars made sure that trajectory reversed and jump started the defecit spending we continue to see accelerate today.  The only people not worried about our debt and risks either have their heads in the sand or want the Federal Government to default and eventually fail.\n\nMy main concern was your assertion that this was not common knowledge or that history has been removed/rewritten.  I try to refrain from hyperbole as I think this helps distinguish us from the reds and blues.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "My friend, this is not common knowledge. Many would tell you today that the Republicans 'have never really advocated for balancing the budget'. It is repeated ad nasuem all around you every time a Republican advocates for spending decreases. They are trying to memory hole the fact that it did happen.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Mediocre_Maize256",
                                                    "body": "I always thought that a balanced budget and abortion was all they did care about.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "No_Temperature_8662",
                                                            "body": "To be fair those are two of the popular talking points. They also have various big business interests. It used to be that they where the party of big pharma and the military industrial complex. That is still the case for 'establishment' Republicans. However things have started to take a turn, at least on their surface. \n\nIt is hard to actually read politics from what people say, because they hide their intentions. It is better to pay attention to what they do. \n\nBy and large Trump has been seen as an outsider with the old republican order. The republican 'never Trumpers' were a big force in the media appearances of the 2024 republican primary and they were a thorn in his  administration's side during his first term. \n\nThis perception is why Trump tends to be so popular with the common republican voter (who has been voting for lower taxes and less spending for decades now, only to get more corrupt DC spending without end, both from the dems and establishment republicans). The fact that he is crass and uses unpolished language that is so different from that of the DC career politicians is seen as further proof that he is not one of them. \n\nTrump's trolling, aggrandizing, and general lambasting of the media (which most republicans do not trust due to the obvious, decades long left bias in media reporting) is also seen as a net positive. He doesn't play the game the way they do, further evidence that he is an outsider. Sure Trump is far more wealthy that the average republican but they are numb to that fact. They are used to seeing the wealthy and corrupt in DC, so that doesn't immediately disqualify Trump.\n\nThat core of the common republican voter is currently in contention with the Neo-con part of the republican party. In the past the republican party was seen as the war hawk party, eager to flex the military might of the US when called for. The Iraq and Afghanistan wars and subsequent occupations, coupled with a deteriorating situation domestically (the housing crisis and issues under Obama) have left the common republican asking questions about why we are funding 'forever wars'. Interestingly it has done nothing to diminish the nationalish pride of the common republican voter.\n\nTrump not starting and not funding wars that are unpopular with common Republicans is seen as a huge point in his favor by many. \n\nCovid and the Biden push (we can argue who was pushing to make Covid vaccines mandatory but most Republicans see it as something the Biden administration did) for vaccines left many Republicans longing for the return to normalcy that a Trump presidency would represent to them.\n\nSo now the tables have turned and the democrats are seen as the party of big pharma and the military industrial complex party. This is made clear by the military's acceptance of the 'woke agenda' under Biden and evidenced in the way the Ukraine war started under Biden, the Afghanistan withdrawal fell apart resulting in an undoing of any good the US did in Afghanistan, and in the release of funds to Iran and the subsequent attack of Hamas (known to be funded by Iran) on Israeli.\n\nRepublicans now percive the democrats as being behind a push to censor discussion of Covid, the push to squelch discussion of a peace deal in Ukraine, and as enabling the Hamas attacks in Israel. \n\nIt also doesn't help that the Biden administration, with the help of the media, gaslit the American public about the boarder situation and the rise of inflation. In both cases the stories started off with 'it isn't happening', progressed to 'well there is nothing we can do about it', and then progressed to 'well you are reading this wrong, it is a good thing'.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "carrots-over",
                    "body": "You seriously think what the current admin is doing is the same thing Clinton did?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Mediocre_Maize256",
                    "body": "People had fits then too. Many people on welfare would have been in hospitals,  institutions or poor houses in days past. Their ability to work is limited at best.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HobbyProjectHunter",
                    "body": "Any comments with Clinton (any Clinton for that matter) is a lost cause. He was saved from being thrown out of office by the Dems.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "No_Temperature_8662",
                            "body": "I didn't really understand what you meant by this. How are comments about Clinton a lost cause?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HobbyProjectHunter",
                                    "body": "Everyone knows what Clinton was doing in his position of power. Using Clinton’s example to highlight any potential hypocrisy is not a sound argument. \n\nHistory will judge if Clinton was good, bad or ugly for the country, but to me any person in the highest office being caught with their pants down is not a figure I’d like to cite in examples or arguments.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "I'm not trying to be glib here but the point was that Clinton worked with a Republican congress and together they actually achieved a surplus. This has nothing to do with Clinton's unforced error involving a Whitehouse intern. \n\nYou are kind of proving the point by wallpapering over the Clinton era accomplishment and saying it cannot be discussed.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AldruhnHobo",
            "body": "Waste cuts/not enough waste cuts. Oh and our allegiance to our masters.",
            "score": 6,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "Please explain. Are you for/against the waste cuts or just jaded with both major parties?\n\nIf jaded I'm right there with you.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AldruhnHobo",
                            "body": "Man I'm just aggravated about how our system has come to be. I'm for many, many more cuts and yeah at the same time I'm disgusted with both parties. The whole thing needs to be gutted and rebuilt from scratch.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "awkward-toast-",
            "body": "They raised the debt ceiling.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Nolobrown",
            "body": "Dislike- the tariffs, power grabbing and rhetoric. \nLikes- doge, crypto freedom and spending cuts. \n\nIf I’m talking to a liberal I will get lumped in with conservatives.\n\nIf I’m talking with a conservative I will get lumped in with the liberals. \n\nBut regardless of who I’m talking to they will never consider anything that’s being said. \n\nMy side good, your side bad.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bubbly-Ad-1427",
            "body": "I like the holding the government accountable for the bad spending move, I dislike the tariffs and the foreign policy stuff",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheBannedLibertarian",
            "body": "Likes\n•Pardoned Ross\n•Seems to be pro 2A this time around\n\nDislikes\n•Increasing overall spending while touting and exaggerating small cuts.\n•Expanding executive power\n•Trying to start wars with disastrous foreign policies\n•New taxes (tariffs)\n•Increased inflation from increased deficit\n\nEdit: This comment got me banned so I can’t reply to you u/No_Temperature_8662 but I was referring to Trumps intentions to invade Gaza. Maybe even Greenland, Canada, and Mexico if his mental state continues to deteriorate.",
            "score": 5,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "Genuinely curious, who is the current administration trying to start a war with?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jolly_Job_9852",
            "body": "Like: If you give me some time I'll think of a good one\n\nDislike: The Culture war BS like renaming the Gulf of Mexico to Gulf of America, the imperialist rhetoric in regards to Greenland, Canada and Gaza. The way he treated Zelenskyy yesterday was something I dislike. If they had political differences, these should have been hashed out in private not in front of the public over news media.",
            "score": 6,
            "replies": []
        },
        {
            "author": "PurpleMox",
            "body": "I'm an independent but voted for Trump this election, but its hard, I live in a very liberal place and people judge you heavily if you voted for Trump..\n\nI like that he's cutting government spending, downsizing the government, keeping tax cuts in place, securing the border..\n\nI feel like he's a bit too extreme with his rhetoric at times with some allies, although I totally support him being strong and pushing back on unfair treatment of our country. I think he could accomplish his goals but communicate better and be less triggering for so many people - not that I care that liberals are triggered, but he could maybe be more effective and less divisive with better communication. \n\nI dont like his seeming blanket support for Israel, although I'm not surprised. I was hoping he would be a bit tougher on Netanyahu, the way he's being tough on Zelensky.",
            "score": 10,
            "replies": [
                {
                    "author": "Smiley1236",
                    "body": "To be fair the budgets being passed are not reducing spending. Just moving the deck chairs around. Maybe the long game will work out but lots of growth assumptions being made that historically do not work out.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "MolokoPlus25",
            "body": "As a Canadian I respected his efforts to run his country more like a business and his push to get our border under control (which many of us have wanted for some time) but I am not a fan of how the US has been engaging with us and other countries at present. \n\nI don’t have TDS like many do here, but I am frustrated as both our economies could thrive with better collaboration and resource management. We will not get there with talk of redrawing borders and invasion. \n\nI do not want more war and conflict.",
            "score": 3,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "This. Thank you. Love your 'Taxation is Theft' flair.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wizard_bonk",
            "body": "DOGE, cuts in government spending will always be celebrated\n\nLack of congressional spending cuts / trump putting down the hammer about getting congress to put down equal if not greater cuts in spending as they have done to taxes.",
            "score": 5,
            "replies": [
                {
                    "author": "Oquendoteam1968",
                    "body": "In Argentina it is being a disaster and everything is copied from there, even the email anecdote",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Wizard_bonk",
                            "body": "I wish we had even half the bravado of milei. You know they recorded a budget surplus? A real life budget surplus! I fear we won’t see that for 1000 years in America",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Oquendoteam1968",
                                    "body": "I only know the scam with enough precision. The rest is not within my reach. It is not tangible. And I'm not going to go see it either, because it is the most expensive country in the world by far in terms of quality-price ratio.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sir_Naxter",
            "body": "I hate being lumped in with as a MAGA supporter just because I speak positively of Trump. He’s got a lot of problems, I don’t love the guy, but he is doing good things. He’s literally shrinking the government, this is awesome. That’s what I like. \nWhat I dislike is he isn’t doing enough! We need full on dissolution of agencies. Get rid of IRS all together. \nI also can’t stand his support of Israel. He seems to be in total support and will not change his mind. That’s probably his biggest problem.",
            "score": 3,
            "replies": [
                {
                    "author": "DoctorGonzoEsquire",
                    "body": "I think there is a big difference between \"shrinking\" government and consolidating power. If we are talking about the literal size of the government, why not just have a king?",
                    "score": 42,
                    "replies": [
                        {
                            "author": "thiccpastry",
                            "body": "I like your point. I feel like a lot of people see him as shrinking the government, but I see it as a consolidation of power.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "heatY_12",
                            "body": "This",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "No_Temperature_8662",
                            "body": "A king does not shrink the size of government. A king expands the size of government by taking on all the powers of all three branches and increasing what the government can do to citizens. If you think making kings is what is meant when Libertarians talk about shrinking government then you sorely need to read more Libertarian literature.\n\nWe we talk about shrinking government we are talking about shrinking its powers, giving it a lesser impact on our lives, and often mentioning how we want smaller budgets with fewer unelected agencies.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DoctorGonzoEsquire",
                                    "body": "I'm am well aware of what libertarianism is. I'm talking about what is happening now. There is nothing libertarian about the Trump/Musk regime. What is happening now is consolidating power under the guise of shrinking government.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Express-Ad-9326",
                                    "body": "He has expanded the executive branches power considerably and has been going after the media that dares to question him. Some things have shrunk but its all to give oligarchs more power. Plus project 2025 crap is in the pipeline. He is turning us in to Russia.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sir_Naxter",
                            "body": "To make it even simpler; small government better than big government.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "DoctorGonzoEsquire",
                                    "body": "Right now we have the richest man in the world, who is both unelected and constitutionally barred from being president, unilaterally making decisions about what government we do and don't need. I guess that is technically shrinking government, but if that is what passes as libertarian these days then call me a fucking statist.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "chronoglass",
                                            "body": "Right now we have an unelected constitutionally barred person undoing decades of lazy Congressional decisions. \n\n\nIf it was important enough to do, then vote on how to do it.. don't just vote to allow the president to allocate funds. \n\n\nI truly hope this is a wake up call to how much power the executive branch has been given through outright laziness and malfeasance.\n\n\nMaybe both houses of Congress will stand up and do their jobs. I doubt it . But I can hope.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "DoctorGonzoEsquire",
                                                    "body": "They didn't hand the power to the President. They created what are supposed to be independent agencies. We can argue about whether they should have done that or not, but the idea was never to further empower the president. It is only Trump who has now come in and declared power over all independent agencies. At the same time, he and the richest man in the world have threatened to remove anyone, Congress included, who opposed them. That's dictator shit.",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "No_Temperature_8662",
                                                            "body": "Trump didn't declare it. Article 2 of the constitution and the Supreme Court declares it. \n\nhttps://constitution.congress.gov/browse/essay/artII-1/ALDE_00000243/\n\nAs for Elon being unelected, Trump was elected president *after* he said he would put Elon to work on DOGE. This is what the people voted for. Remember, Obama said elections have consequences.",
                                                            "score": 0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "chronoglass",
                                                            "body": "Exactly.. and legally speaking, everything happening shouldn't be possible. \n\n\nWhy then.. do you suppose it is possible? Legally speaking?\n\n\nCould you maybe think of any reason at all, what is happening, is happening \"legally\". Step away from your moral high ground for a moment.",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "DoctorGonzoEsquire",
                                                                    "body": "The system is made up. It only works when people respect it. Everything is \"legal\" if someone is willing to do it and everyone else is too cowardly to stop it.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "chronoglass",
                                                                            "body": "Oh, I'm sorry, I didn't realize you were in a different reality. Ok, cool, have a nice day",
                                                                            "score": -5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DoctorGonzoEsquire",
                                                                                    "body": "Sorry, I forgot people believe the law is some sort of magical, self-sustaining entity?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "chronoglass",
                                                                                            "body": "So.. what's your argument exactly?\n\n\nTo me I am reading \"no, congress did not make this legal\" followed by \"legal doesn't matter\" which is couched in the \"because it's made up\" argument.\n\n\nIt SOUNDS like you disagree that our current situation is an ongoing problem with our Congress critters. But I'm not seeing that articulated.\n\n\nLet me know what I missed. Because last time I checked, at least as I am interpreting your argument, you are mostly incorrect from a factual stand point.. I mean yes \"legal is made up\" is true.. but like how we got here is kind of the point of my comment?",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DoctorGonzoEsquire",
                                                                                                    "body": "Congress is absolutely a big part of the problem, but it has nothing to do with their delegating power. We got here because we elected a president with no respect for our system of government. He has garnered a cult following and recruited the richest man in the world to help him intimidate Congress into bending to his will. Congress could absolutely stop everything Trump is doing right now if they had the will. They don't because they are all more concerned with re-election than they are mainaining the separation of powers. What Trump and Musk are doing is \"legal\" because Congress is too cowardly to stop them.",
                                                                                                    "score": 4,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "chronoglass",
                                                                                                            "body": "Ok, so you WANT congress to do the bare minimum and leave everything up to the president.. just not THIS president.",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "DoctorGonzoEsquire",
                                                                                                                    "body": "No. Again, it is only this president who has determined he controls everything. I don't want any president to do that. I also don't want the President and his oligarch friend to be the ones to unilaterally undo what Congress has done. Congress created independent agencies. Trump has declared he controls them all and is unilaterally unwinding them. I'm not defending the independent agencies. I'm complaining about Trump/Musk usurping power.",
                                                                                                                    "score": 3,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "chronoglass",
                                                                                                                            "body": "Ok, there is the disconnect.\n\n\nMost of these agencies were not created by Congress. A problem was identified, money was allocated to the president to remedy the problem. The president then has one of the executive offices create an agency and funds it \n\n\nThe agencies that were created correctly (such as the IRS.. sadly) aren't entirely under executive control.. they are, as you say, independent. \n\n\nUSAID for example, you know the big one everyone is freaking out about. JFK EO.\n\n\nEdit: they aren't usurping anything. I think it's being done for the wrong reasons.. but maybe ask congress why they wouldn't create these agencies?",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Nado1311",
                                                                                                                                    "body": "Dude all federal agencies are created by Congress, what are you talking about?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "cgray715",
                                                                                    "body": "They're right. It's the same as a home. Your rules are yours (made up) and they will be followed as long as there are resistance and/or punishments for when the rules get broken. There simply isn't any resistance or punishment from the right because they're too afraid of drawing Trump's ire and this stems from them being afraid of not getting reelected or of being censored like he's done to certain members in the past. \n\nThe right wing simply has no balls. That's the reality of today's situation.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "chronoglass",
                                                                                            "body": "There is no punishment or resistance.\n\n\nThat's it.\n\n\nThis is not a right or left problem. This being legal is the problem.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DoctorGonzoEsquire",
                                                                                                    "body": "I'm not sure we really disagree but you keep saying \"legal\" as if that has some significance. Trump/Musk are doing things. No one is stopping them. Legal or not legal is not really relevant.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "chronoglass",
                                                                                                            "body": "It is relevant when posed with the question of how are they able to do this?\n\n\nIf they were doing it illegally then they are actively going against the way our government is structured. But it HAS been structured this way, BECAUSE of congress. If it hadn't been, this wouldn't be possible.\n\n\nI'm telling you that I don't CARE who has the power to make these moves.. I don't want them to. \n\n\nYou seem to be arguing that you are ok with the people wearing an agreeable team logo having the legal power to make these moves.\n\n\nLegal is the absolute crux of this issue. These things being undone were DONE the same way, by executive order.. otherwise trump couldn't touch em.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "DoctorGonzoEsquire",
                                                                                                                    "body": "They are able to do it because they are doing it and nobody is stopping them. I am not here to litigate how Congress has acted in the past. The immediate problem is what they are not doing now. I don't give a shit about political parties and I don't have an agreeable jersey. The constitutional division of powers is between branches of government, not parties. Even if Congress had designated money for USAID with zero guidance, that doesn't mean they are powerless now. If the executive uses that money for drowning puppies, Congress can stop that. They don't have to throw their hands up because they handed off the money. They can legislate. They can subpoena. They can impeach. The problem is not prior delegation, it's present cowardice.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "chronoglass",
                                                                                                                            "body": "USAID was created by an executive order.\n\n\nIf it was important enough to make permanent.. maybe someone shoulda done that? Otherwise, JFK was a dictator, and you're ok with that.\n\n\nLet's not forget the \"will of the people\" here . We have just let this shit happen, year in and year out. Lesser evil and all of that.\n\n\nIt's great that you finally have a reason to see a problem with it. It's unfortunate that you want it to stop, not be solved.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "DoctorGonzoEsquire",
                                                                                                                                    "body": "I still think we are basically saying the same thing, but I'm wondering why Congress isn't bandaging the gaping wounds while you are complaining that we were driving too fast in the first place.",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "chronoglass",
                                                                                                                                            "body": "Because they don't have the power to \n\n\nRevoking an executive order is standard.. I get that you don't like which ones this guy is choosing, but there was nothing stopping ANY president from doing it.\n\n\nYou want congress to go against the rule of law.. to.. what exactly? Prove it's all a farse and ignite that civil war? Save some feelings? \n\n\nIt needs to be handled by the rules that exist.. even if you don't like those rules. and the way to do that is to do their fucking jobs and recreate these things properly. And changing the rules that exist needs to be handled in the moment.\n\n\nThat's the true fear from them there. \n\n\nThey need to get their hands dirty.. they need to make decisions, not just show on paper they are pro or con \"important for now thing\", taking the accolades and kicking the blame to the guy who at most is gonna be here for 8 years.\n\n\nSo no, I don't think we agree (edit: are saying the same thing), not really.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "DoctorGonzoEsquire",
                                                                                                                                                    "body": "Everything Trump and Musk have done is fine and perfectly legal, but Congress using their Constitutionally enumerated powers to check that is illegal? I guess you are right. We are mortal enemies. Prepare to be destroyed.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "chronoglass",
                                                                                                                                                            "body": "Again, the only power they haven't handed over in these cases, is the ability to just recreate these executive orders as actual passed laws.\n\n\nLaws which someone has to sign.\n\n\nThen when it gets veto'd they over ride that.\n\n\nSo.. Like I said.. their jobs.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "DoctorGonzoEsquire",
                                                                                                                                                                    "body": "I said CONSTITUTIONALLY ENUMERATED powers. How dare you suggest they pass laws. If you were here, I'd buy a glove just so I could slap the shit out of you.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "chronoglass",
                                                                                                                                                                            "body": "Ok . So I guess see my original response then?\n\n\nI dunno\n\n\nI've got an affiliate link for some isotoners if you like. Lol",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": []
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "No_Temperature_8662",
                                                                    "body": "This. Lawsuits are a very real thing. If it wasn't a legal system, or if it was a toothless illegal system, then it would have been assaulted long along with litigation. Chevron deference was, until quite recently, the rule of the game. It still de facto is since we have those unelected bureaucracies running around to enforcing their 'rules' as 'laws' without congress having to vote on those rules.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "No_Temperature_8662",
                                                                    "body": "This. Lawsuits are a very real thing. If it wasn't a legal system, or if it was a toothless illegal system, then it would have been assaulted long along with litigation. Chevron deference was, until quite recently, the rule of the game. It still de facto is since we have those unelected bureaucracies running around to enforcing their 'rules' as 'laws' without congress having to vote on those rules.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "serpicowasright",
                                    "body": "Why come big G, when ‘lil G do good?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "Remember that power corrupts and that absolute power corrupts absolutely. There is a really good reason why Cincinnatus is a revered figure in history. He was an amazing exception to the general rule.\n\nPhilosopher kings are fun Plato arguments but they do not tend work out well in real life. Ideally there would be no state, but that is not the world we currently live in.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "DoctorGonzoEsquire",
                                    "body": "Congratulations on your B- in philosophy 101. I can tell you're excited.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GuyBannister1",
                    "body": "This is my exact thoughts",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Requettie",
                    "body": "I second this.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "thiccpastry",
                    "body": "Are you okay with the rate at which the cuts are happening? Someone else mentioned it's not helpful because the private sector needs time to help fill the gaps, but the cuts are happening too fast (or at least that's how I interpreted their comment).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sir_Naxter",
                            "body": "Yeah, I’m not happy with the speed. I want it faster. I want the tyranny to end now. Not tomorrow, not three months, not next year. I want the threat of force to end. I want to stop hurting non-violent people. These agencies and the federal government apparatus’ of oppression needs to be erased immediately so we can stop anymore harm from coming.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "thiccpastry",
                                    "body": "Do you worry that people won't be able to catch up in this economy? That their lives might be in financial ruin for some time until they can find another job? Not every government worker is a crook, and I feel that if you think that way, you're going down some very black and white thinking. (This is all said in a neutral tone. I try to let people know my tone bc sometimes I can come across as mean)",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Sir_Naxter",
                                            "body": "There are more job openings than there are people to fill them. They should be fine finding a job. I understand that not every government worker is a crook, but they represent and extension and tool of tyranny. Every single worker is a cog in the violent machine which is the US government. Their lives shouldn’t be in financial ruin, there are plenty of jobs in the economy right now.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Curious-Chard1786",
                    "body": "Israel is the only country that supports individualism in the east. Also as a US protectorate they continuously provided great deals on high tech and other business deals.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Sir_Naxter",
                            "body": "Israel is an evil government that shouldn’t even exist. Its leadership and initiatives are pure evil. Whether it’s beneficial to the US to support them is irrelevant, we should never support evil murdering governments.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "Curious, can you give me more details on what initiatives of Israel are pure evil?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sir_Naxter",
                                            "body": "Killing innocent men, women and children, bombing hospitals, destroying people’s homes, killing journalists, censoring media, to name a few things.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "Cool. Very glad to hear you oppose those things when they are done by Israel. Do you also oppose them when they are done by others like the United States, China, or Russia?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sir_Naxter",
                                                            "body": "Of course I oppose the violent actions of the United States, Russia and China. Do you really think I’d make exceptions for other countries? Obviously libertarian principle dictates an hatred for war no matter what. I am totally against the killing of innocents, no matter the country.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "No_Temperature_8662",
                                                                    "body": "You would be surprised then. I run into all types. Very glad to hear you are internally consistent on that.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OniTYME",
            "body": "I like his more blunt and less timid approach to enacting policies and the EO blitzkreig. I like DOGE and them sacking USAID and NED and purging the scum in the government as well as eyeing the Fed and IRS. The tariffs are going to be costly short term but long term, more manufacturing jobs will start opening back up in America granted the next president doesn't Biden everything up. Him going in and trying to end the war in Ukraine and reestablishing good terms with Russia are great.\n\n  \nI absolutely abhor the continued slavery and deference Israel and zionism. I hate that 99% of his cabinet are hardcore zionists. As a result of that, any promises of releasing 9/11, JFK/RFK and Epstein files are all tainted out the gate and I'd be surprised if the info released is completely new or unredacted; thus far, they've not surprised me. I hate that he's talking about ethnic cleansing in Gaza and trying to sell it like a monorail in Springfield. I dislike all that rhetoric about Palestinians dying but never saying how, why, or who is killing them and constantly blaming Hamas as if they exist in a vacuum. MAGA doesn't know the distinction between America First and ZOG and most are willfully ignorant when it comes to Palestine and Israel. I also don't like the rhetoric when it comes to China as is they're any more than just an economic threat to us. Lastly, he really needs to ditch the neocons like Graham.",
            "score": 3,
            "replies": [
                {
                    "author": "bananachow",
                    "body": "That AI Trump Gaza video is definitely our version of the monorail song from The Simpsons.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "The1fox1",
                    "body": "Thai is a really interesting take. Can I ask how you came to a position where your pro Russian relations but also anti zionist?\n\nTo me both these issues are centered around an expansionist state that have a long history of violence with territories that refuse to aquiesce.\n\nIs it just the fear of WW3? Or is there some reason you feel we benefit from Russian relations?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Fabulous_Win9759",
                            "body": "He supports terrorists who target civilians, like Hamas and Putin, that's why. That guy is a fucken goatfucker terrorist and it made him a russkiy sympathizer.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Temperature_8662",
                    "body": "How do you feel about China's recent expansion of the 9 Dash line? The existence of the previous one was considered illegal under international law and China not only ignored that but decided to make it capture even more territory.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OniTYME",
                            "body": "Nothing new. Not really our problem. I'd rather we focus on continuing to cut and eliminate wasteful spending and agencies that have run their course. Warmongering does not benefit anyone but profiteers and profiteers are not the friend of any nation.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AbolishtheDraft",
            "body": "Like: Telling Ukraine to pound sand\n\nDislike: Not telling Isrsel to pound sand",
            "score": 2,
            "replies": []
        },
        {
            "author": "New_Manufacturer5975",
            "body": "PROs: JFK death has been declassified. FDA will be overhauled for the better. Saved from 4 years of the lying GIT called Kamala. \n\nCons: Trump supports Qualified Immunity. Spending is going up. You also can't argue with most Democrats as they turn everything into a pissing contest.",
            "score": 2,
            "replies": [
                {
                    "author": "Glittering-Tip-6455",
                    "body": "Here to be the “not all dems” voice. No one here wants to be lumped and neither do we. I am a blue voice in a sea of red but I welcome conversation.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "New_Manufacturer5975",
                            "body": "I ought to reword my comment. Should say a good chunk of democrats instead of just democrats. My apologies.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Glittering-Tip-6455",
                                    "body": "A necessary distinction for sure. I guess I just have a fundamental misunderstanding of Libertarianism if there is still this much support of him. I always understood that Libertarians were pro gun (he’s not), pro autonomy (he’s not), and pro freedom of speech (he’s not). I am also all of those things, even though I am not a libertarian because of economic reasons, so the vast majority of what has gone on is very troubling. \n\nI am currently outraged about the purging of our military for no other reason than they are transgender. I am outraged about the blatant trampling of free speech that’s happening to the press and anti-Trump elected officials. I am outraged at the clear, nationalist hate that I hear him spewing.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "How do you see your views differing from those of your fellow blues?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Glittering-Tip-6455",
                                                    "body": "I am a lot more pro gun than most blues seem to be. I think that’s probably the biggest difference though I’m sure there are more. Though, I do think people are coming around on that. I have a very blue friend that is talking about shopping for a gun. I’m also not a loyalist to any party. If a trustworthy Republican got up and was actually for the working class, I’d vote for them no problem. I’m tired of hearing that our government needs to run like a business. It doesn’t. And if it does, then it needs to run like we are the CEOs. It’s my belief that our government is there to further our best interests. In the same way that we all have our purpose in society, so does government. We want to act like because we are in a peaceful time that we can all just live our lives in our respective countries without thought to the rest of the world. I feel like the current administration doesn’t believe we have a need for world allies anymore and I don’t understand that. I live in AR and am frequently drowned in a sea of red. I’m viewed as weak for having a heart for people.\n\nI’m also getting a little tired of the blues using women as pawns the same way Trump used immigrants. They want our vote but then our party shows us we don’t actually matter to them, I.e. Trump vs. Biden turnout and then Trump vs. Kamala.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "No_Temperature_8662",
                                                            "body": "Well I'm very glad you are here. I cannot say I will always agree with you but I'll always be glad to hear from you. Your views are welcome and may we always be friends.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Glittering-Tip-6455",
                                                                    "body": "Same to you comrade. I hope for nothing more than the melding of all of our minds to create a safe community for our citizens. I will always fight for your rights and I know you will do the same for mine. Happy to be here.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "No_Temperature_8662",
                                                                            "body": "You have my warm thanks. I object to being called comrade (anti-statist views and all, ;) ) but I embrace it in the spirit it was given. I will absolutely will fight for your rights.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Glittering-Tip-6455",
                                                                    "body": "Since you asked about me: what keeps you from voting blue?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "No_Temperature_8662",
                                                                            "body": "Mainly my objection is the overwhelming belief on team blue that government is the first and final solution to all our problems. That is an insidious poison that infantilizes people.\n\nThey have replaced charity with theft (taxation). I've seen welfare literally destory families. I've personally seen the government take land, lie about their plans for it, and break their promises for the future too many times. \n\nI consider myself a classical liberal, believing in self reliance, equality, free speech, free markets, a well armed people, the corrupting effect of power, and keeping government's role in my personal life as small as possible. I don't care what people do in the privacy of their bedrooms as long as it is consensual and doesn't involve minors. I object to state propaganda. Each year it feels like team blue moves further from these values.\n\nAll too often I see team blue trying to shut down free speech and encouraging censorship. Not saying that team red are angels in this regard but this past decade team blue has been on overdrive. It is telling to me, because no matter what side you are on speech should always be free, it is basis of every honest dialog.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "thiccpastry",
                                    "body": "I like that you saw their comment and took it with grace. I think a lot of people unknowingly upon themselves into more black and white thinking by using phrasing like you did in your original comment (this is said neutrally, not mean). I have been in therapy for so long and I never would have thought that just changing wording would help me. Things become less extreme. It just gets hard when the loudest part of the group is the worst. It takes active mindfulness to make sure you don't begin lumping everyone. \n\nI made this post as someone I love seems to be falling down a MAGA pipeline, but I wanted to see how many Libertarians also agreed with his points, as I feel there's a difference between how a libertarian views conservative policies than an actual conservative.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "New_Manufacturer5975",
                                            "body": "It's easy to let a small percentage of a group represent the whole group. People seem to be too defensive and unable to see through a different lens when it comes to politics. There's plenty of things that I didn't like about Kamala or Trump which even when I tried explaining I wasn't part of the duopoly I still got labeled as one or the other. I've literally lost friends over politics which makes me sad because I respected some of those people as well.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "daltonfromroadhouse",
            "body": "I dislike what they turned Reddit into, I don’t recall the right being so annoying when their team lost.",
            "score": 1,
            "replies": [
                {
                    "author": "Faladorable",
                    "body": "what the january 6 are you saying",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Training-Recipe-7128",
                            "body": "To be fair, I don't think the group that did all that shit on Jan 6 represent even the majority percentage of people that voted that way. I don't even know know someone personally that went to a rally for either side let alone think its okay to storm the capital. But when you have an app with over a billion monthly users that has a noticeable bias and even hatred for trump, it's a little more comparable. It definitely mirrors to an extent the beliefs of people I personally know.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "Saw the footage. Looked more mostly peaceful than the  mostly peaceful protests of the 'summer of love'. Certainly less firey.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dr_Axel_Stoll",
                    "body": "Personally I find the whole \"stolen vote\" conspiracy that got invented by the GOP rather annoying.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "I don't get to vote in America but if I could I would have Trump. I hated him and fell for the TDS crap I'll admit in 2015 until I saw how good America was. \n\nThen I moved to USA under Biden and saw it wasn't at all like my friends said it was. They told me it's become shit since COVID and biden. And was like they need that mother F'er back and he won and I was like blown away at what he is doing so far and confused why people crying when he is doing exactly what many of us in the EU have been too cowardly to do. \n\nHe has only been president a month and I see he done more for this country already than. Biden done in his 4 years. As a foreigner who isn't TDS anymore I'm amazed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HungryFollowing8909",
            "body": "Ross Ulbricht was pardoned, I love that.\n\nI wonder if Assange could get pardoned, I doubt it.\n\nOutside of those two things, if they took Canada over and gave us the second amendment, great? But I'd rather our politicians just stop punishing law abiding gun owners",
            "score": 0,
            "replies": [
                {
                    "author": "kaymakenjoyer",
                    "body": "How is annexing a country good? Thats gotta be one of the least libertarian things possible",
                    "score": 16,
                    "replies": [
                        {
                            "author": "HungryFollowing8909",
                            "body": "It's less than ideal, however the Canadian government is anything but libertarian. It's increasingly authoritarian.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "kaymakenjoyer",
                                    "body": "Then deal with it ourselves, not have an outside force take us over. You’re also assuming we’d get equal treatment which id highly doubt. Trump is not even close to a libertarian, govt cuts aside",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "HungryFollowing8909",
                                            "body": "Canadians are spineless lol, we won't deal with it ever.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "byond6",
            "body": "I live in a very left-leaning area and absolutely get lumped in with conservatives. \n\nThere's a \"100% agreement with my team or it's wrongthink and you're a bad person who deserves violence\" sort of mentality emerging and it's terrible for the future of our society. \n\nRe: what I like- auditing the government to reduce spending and increase transparency \n\nRe: what I don't like- the whole Gaza thing and funding military ops in other countries. I'm tired of my tax dollars going to hurt people I've never met. I don't want us making more enemies for future generations. \n\n\nIt would be nice if they disarm the IRS, kill the ATF, deregulate healthcare (I'll make my own choices for my body thank you very much), stop funding propaganda in schools, stay the hell out of social issues, and cut taxes enough that the single-income nuclear family can thrive again and restore family values for future generations.",
            "score": 1,
            "replies": []
        },
        {
            "author": "masterkorey7",
            "body": "I've figured out that if I say anything other than something negative about trump or anyone his cabinet I'm lumped into the maga crowd. Honestly it's starting to actually push me there. I'm in Washington state....People here are almost communist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhichPut178",
            "body": "The thing that is very strange to me is the fact that anything Trump does is automatically hated by the left/democrats and automatically loved by the right/republicans.\nWhy aren’t there more people that can say I like some of what he’s doing but not some other things.\nExample, 99% of the left hates DOGE. I would think that reducing waste and abuse would be a bipartisan issue.\nExample #2, why can’t Republicans agree that Trump made a fool out of himself during the talks with Zelensky? IMO he clearly did.\n\nThe examples are endless but I hope that we can get people to start thinking for themselves more and see that no one person is all good or all bad.\n\nP.S. The same was true during the Biden administration.",
            "score": 1,
            "replies": [
                {
                    "author": "bem21454",
                    "body": "The government should decrease spending, however, putting Elon Musk in charge of this effort with no real government oversight is an incredibly stupid idea.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "bem21454",
                            "body": "Also, they’re not really reducing the deficit, just cutting programs in order to cut taxes for the wealthy.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "WhichPut178",
                                    "body": "Can you name one thing that you like of the current administration?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "bem21454",
                                            "body": "meh im struggling to think of one. I think DOGE has potential but should not be run by Elon or the 19 year olds he hired, not be detached from the rest of the government, include federal workers, and be more transparent about their operations.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhichPut178",
                                                    "body": "Well, that proves my point.\nI am not claiming that DOGE is good or bad, but the fact that you, and most democrats, cannot find one thing they like (or a Republican, one thing they dislike) shows how polarized we have become.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "bem21454",
                                                            "body": "I believe the issue is middle/lower class vs upper class more so than democrat vs republican. In my opinion, Trump has not acted in the best interest of either party, but rather the wealthy individuals that funded his campaign. His tax cuts and deregulation of business come at the cost of many critical organizations aimed to help lower/middle class families including USAID, medicaid, and likely social security and medicare. Certain figures in media, however, make money largely off the division between the two parties, further reinforcing to people that the “enemy” is the other party and not the wealthy individuals actively lobbying against the working class. I may be wrong, but I personally believe issues such as trans rights and immigration have largely become points of interest simply to distract from the fact that almost everyone is getting fucked in the long run. The division between parties will never end unless they are united by a common enemy.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "WhichPut178",
                                                                    "body": "https://preview.redd.it/q69newug4pme1.jpeg?width=1125&format=pjpg&auto=webp&s=507e446b0a549acd7891cad9b4b6027c64d2f766\n\n[https://www.statista.com/statistics/1535295/presidential-election-exit-polls-share-votes-income-us/](https://www.statista.com/statistics/1535295/presidential-election-exit-polls-share-votes-income-us/)",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "bem21454",
                                                                            "body": "How is that relevant?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "annonimity2",
            "body": "Like - DOGE while I have reservations about it being effective someone is finally doing something about the debt. 2a protections, I like the new ATF director (even if it's not Brandon herrera) and I like that he isn't peddling an AWB. Foreign intervention I don't like that we are still involved in Israel but I'll take what I can get with reductions in Ukraine aid. Scotus picks repealing chevron deference was great and the ammount of gun control they stopped was great. \n\nDislike - Ukraine while I like the decrease in aid I don't like that Trump is framing the war as caused by Ukraine, i want Ukraine to win I just have reservations about the money we are sending. Israel we shouldn't be involved. Deficit spending mostly congress but still spending more than we bring in. Relationship with our allies need I say more. The crypto scams... Just why.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bem21454",
            "body": "dislikes:\ntax cuts exclusively for the wealthy,\ntariffs,\nbehavior toward foreign allies,\nsupport for russia,\nsupport for israel,\nsupport for annexing other countries,\ndoge,\nelon musk holding a position in government,\nthreats to education,\nconsolidation of power,\nclosing the border,\ngold cards,\nthreats to immigrants,\njanuary 6 pardons,\ncutting welfare programs,\npetty behavior,\nattack on minorities,\nsupport of abortion ban,\nlack of opposition to contraceptive ban,\nnumerous lies,\ngaslighting,\nopposition to fact checking,\njd vance,\nrfk jr,\nthreats to personal freedoms,\nsave act,\nmaga glazers,\nmedia pushing division between parties,\nending dei,\ncuts to national parks,\nshittiest cabinet appointees ever,\nrestricting of media access to oval office,\nchallenges to judicial branch\n\nlikes:",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sink_Key",
            "body": "Dislike? Trumps not a very likeable person\n\nLike? His actions make democrats angry and I’m a big fan of that",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gabbz737",
            "body": "They're as crooked as anyone else but I'm glad we're getting the much overdue Audit.\n\nI also do think that if you can't name 5 things you did in a week (that's 1 per day in business week) then you deserve to be fired. I'm tired of our tax dollars paying these lazy cunts to sit on their ass.\n\n----------\n\nI dislike the tariffs... it's a terrible idea. It won't work the way he wants it. The propper way would be to tax companies for using out of country labor and facilities. This would require them to bring manufacturing back to the US as it would no longer be profitable to hire foreigners. \n\nAs it currently stands we don't have the facilities and infrastructure in the USA anymore to produce the way we used to. \n\nThe foreign countries won't eat that tariff, they'll just raise their prices and the consumers will pay because they'll have no other choice.\n\n\n-------------------\n🇺🇸\nPeople will claim I'm like the other side, they say my vote doesn't count, they say my person will never win. I tell them, ur not betting on a winning horse. You're telling them who's best for the job. Even if my candidate never wins, at least those crusty old fucks no where i stand!\nNot everyone has fallen for the lies of the red and blue.",
            "score": 1,
            "replies": []
        },
        {
            "author": "daisymae25",
            "body": "Dislike: Pissing off other countries that are supposed to be our allies, tarrifs, transgender issues, pardoning the violent J6 offenders, among others. \n\nLikes: Not a whole lot so far. I'm in wait and see mode regarding DoGE.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PM_ME_DNA",
            "body": "Like: deregulation, government layoffs, reversing progressive nonsense, telling Zelensky to eat a bag of dicks, freeing Ross. \n\nDislike: Tarrifs, deficit spending , not cutting enough spending",
            "score": 1,
            "replies": []
        },
        {
            "author": "JuanMurphy",
            "body": "Not like…love that the level of corruption is being exposed to the public. \n\nLove that the foreign aid bs…ie funding of groups that are politically biased or against our government interests is being exposed\n\nLove that he’s doing something or attempting to with the unelected bureaucracy \n\nLove that we actually have a transparent president \n\nHope he guts federal law enforcement and destroys anyone that tried to unethically destroy anyone else.   \n\nDislike how he starts his negotiations with preposterous demands. Like the American-Mediterranean Riveria.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loominardy",
            "body": "I’d rank the current administration a 7/10.\n\n(Copying comment from another subreddit where the same question was asked)\n\nGood things:\n\nMoving our institutions more towards meritocracy.\n\nTackling bureaucracy and fraud via DOGE.\n\nGetting a start on cleaning up the issue on our border.\n\nBonus: Pardoning Ross.\n\nBad things:\n\nTry to impose tariffs on our allies to negotiate for things that I’d argue are not worth it. Taxes in general make our economy less efficient.\n\nThere have already been large spending packages passed by Trump and the Republicans and in general not cutting enough spending to justify lowering taxes. So much for fiscal responsibility.\n\n\nAlso I do hate being lumped in with the MAGA Republicans. They are more authoritarian than us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vNerdNeck",
            "body": "Good: DOGE, tariffs (reciprocal), Ukraine, DOD, FBI,  ATF (so far), DEI, govt layoffs\n\nBad: GAZA (not a fan of the current plan, and hope it's just a negotiation tactic)",
            "score": 1,
            "replies": []
        },
        {
            "author": "VirusLocal2257",
            "body": "I like the shrinking of the feds and deregulation. Also pro 2a stuff. But hate the social politics side of things. Religion has no place in government. Let people live how they want too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HamCheeseRedPlease",
            "body": "Dislike: Israel",
            "score": 1,
            "replies": []
        },
        {
            "author": "underwaterpark",
            "body": "Voting 3rd party would work if the next guy did it, but not me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Curious-Chard1786",
            "body": "Trump is the only one worrying about America. Everyone else is worried about treaties that we didn't vote for democratically.",
            "score": -3,
            "replies": [
                {
                    "author": "Wizard_bonk",
                    "body": "Israel",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Curious-Chard1786",
                            "body": "israel is a US proxy that gives the US favorable trade deals and port into the east.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Wizard_bonk",
                                    "body": "1 quadrillion more TAXPAYER dollars to Israel",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Curious-Chard1786",
                                            "body": "what dude? theres compromise, it's called net outcome.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "josephbobersonjr",
                                                    "body": "no, Israel gives us virtually zero and we give them everything.  There’s nothing of value for us in the middle east that we need to get involved with.  And our unwavering support for them has made us more enemies than friends and only will continue to.  and we just help contribute to an ethnic cleansing",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Curious-Chard1786",
                                                            "body": "you're just misinformed then.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Somhairle77",
            "body": "I like the pardons and the purging of parasitic government \"workers\" and petty tyrants. I'm cautiously optimistic about the possibility of audits of the IRS, The Fed, Fort Knox, etc.  I'm thrilled that we might not be backing war in Eastern Europe any more, and that maybe innocent Ukrainian and Russian civilians who don't want anything to do with their government's war might have some peace now.\n\nI'm extremely disturbed about his middle east policy, especially what he's said about Gaza.  Even if that's just a negotiating ploy, there is nothing good that can come from US involvement in the region except to line the coffers of the Military Industrial Complex. Other than escorting US flagged cargo ships through the Suez Canal and through pirate-infested waters (And I really want to see that taken over by private security funded by the shipping companies), and security for embassies; we need to bring home every troop and piece of equipment stationed outside our borders.\n\nI also don't like his expansionist rhetoric.  We need to decentralize, and explore national divorce, not add more territory and people under the thumb of the Washington tyrants.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BigdaddyXL",
            "body": "Applaud the cuts in government and the laser focus on cutting wasteful spending but the grandstanding and show they are putting on is not necessary. \nFrom Elon with the chainsaw, Bondi with the BS Epstein files, Trump with his take over Gaza BS.  \nThe work they are doing is good enough no need to grandstand IMO",
            "score": -1,
            "replies": []
        },
        {
            "author": "ImportantFlounder114",
            "body": "I appreciate DJT clowning Zelensky over his attire.  The utilitarian \"war\" clothes schtick is insufferably European.",
            "score": -7,
            "replies": [
                {
                    "author": "Wizard_bonk",
                    "body": "1 quadrillion more dollars to israel",
                    "score": 10,
                    "replies": [
                        {
                            "author": "ImportantFlounder114",
                            "body": "Yup.  That's the one constant that doesn't change.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Terrible_Penn11",
            "body": "I dislike (actually hate) whatever he has planned for Gaza.\n\nI like DOGE and potentially ending the gravy train for Ukraine.",
            "score": 0,
            "replies": [
                {
                    "author": "thiccpastry",
                    "body": "From your perspective on Ukraine, how do you feel Trump handled that recent meeting with Zelensky?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Terrible_Penn11",
                            "body": "I really don’t care how he treats a beggar like Zelensky…I just want them to stop funding that war.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "HobbyProjectHunter",
                                    "body": "I’d like funding to the US #1 Ally to stop 🛑",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Odin4456",
            "body": "He was the closest major party candidate to libertarian views so I voted for him. Usually vote libertarian but if we had another 4 years of Biden/Harris most of the working class Americans would’ve been hurt even worse than we are. I like that he’s being more libertarian than I expected in some areas, and I’m hoping that most other republicans will see this and start molding the party closer along libertarian lines (it’s a pipe dream, ik, but hey it’s a dream)",
            "score": -4,
            "replies": []
        },
        {
            "author": "Fakerabbit875",
            "body": "I think doge is sick and I think the deregulation and tax cuts will be nice. But it’s so clear that he’s on the side of Putin. The worst thing for me is the idea of selling off our public land to fund his “sovereign wealth fund.” The trump admin can fuck right off with that shit",
            "score": 0,
            "replies": []
        },
        {
            "author": "ProfessorChiros",
            "body": "Like: opportunity to finally restore some fiscal conservatism, reduce bureaucracy and stepping down from role of global police.\n\nDislike: Deceit and dehumanization that has been the foundation of his tactics and strategies since Roy Cohen trained him.  Mostly I dislike how many Americans are so keen to lap up the lies and abandon their own efforts to research and apply critical thinking around what is moral or objectively good.",
            "score": 0,
            "replies": [
                {
                    "author": "Chimp75",
                    "body": "Trump and fiscally conservative should never be in the sane sentence. This clown will cost taxpayers trillions.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ProfessorChiros",
                            "body": "I don't disagree- Rand Paul's words on the budget the Senate just passed (that only Massie voted against) highlights the proposed increases and lies.  As far as the administration and Project 2025 though, there is overt strategy and details on how to bring more fiscal conservatism back.  I fully expect Trump to be himself and operate under self-interest at all times, but I think it's the best shot this country has had in a long time at rethinking what we spend taxes on.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nikadaemus",
            "body": "MAHA is a massive pro.  Too many shenanigans between the revolving door between gov officials, lobbyists and board of directors for Pharma, Monsanto, FDA, etc.   Illness is a big business\n\n\nPopulism is good to rally the people without making it about politics, but about what is good for the People. Not bureaucrats or parties, but the citizens. \n\n\nPushback is mostly through brainwashing. The amount of lies spread about \"what was going to happen\" that never happened during first 4yr administration = concerted effort to rule the serfs through fearporn and divert their gaze from actual threats to their sovereignty, way of life, liberty and the pursuit of happiness \n\n\nThe gov shouldn't be in everyone's day to day lives.  That power needs to be clawed back \n\n\n80/90s no one cared who was in, as it was barely noticeable....  \n\n\nDOGE is big, but the tip of the iceberg.  Military Industrial Complex is the iceberg.\n\n\nI've seen Trump play many winning strategies.  You don't watch the hand to know his moves, there are feints and misdirections\n\n\nHe served up the fakenews media empire on a platter daily. To disclose to people who were paying attention \n\n\n'the leaks are real' but the news is fake \n\n\nRunning 3rd hand gossip with no independent verification isn't journalism, it's trash. People used to trust good editors and legit journalism, but it got replaced with counterintelligence \n\n\nHe's a big player because he's not a politician.  He's got money and fame already, so he can't be bought like most of the muppets \n\n\nHe didn't have to put a bullseye on his back, very little reason either, other than to try and get some wins for the country & it's people \n\n\n🍁 ",
            "score": 0,
            "replies": []
        },
        {
            "author": "agolfman",
            "body": "We finally have smart people like Musk in places where they can make decisions and recommendations. Non political and well intended.",
            "score": -12,
            "replies": [
                {
                    "author": "bem21454",
                    "body": "forgot the /s",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "orwll",
            "body": "Like basically everything I’ve seen so far. \n\nThe thing that impressed me the most was blanket pardoning the Jan 6 people. Brilliant. If they’d made it some case-by-case appeal process the media would’ve kept dredging up the same stories over and over for months and making GOP congressmen defend every edge case. \n\nInstead they took the issue off the table for good. It showed they were not going to be wagged by the leftist media as they were in his first term. They actually are there to make things happen.",
            "score": -4,
            "replies": []
        }
    ]
}