{
    "title": "Clearing Up the Budapest Memorandum: NO, the U.S. is NOT Obligated to Defend Ukraine",
    "author": "DerpDerper909",
    "subreddit": "Libertarian",
    "rank": 58,
    "score": 0,
    "upvote_ratio": 0.49,
    "num_comments (reported by reddit)": 96,
    "url": "https://www.reddit.com/r/Libertarian/comments/1j219cs/clearing_up_the_budapest_memorandum_no_the_us_is/",
    "id": "1j219cs",
    "selftext": "The 1994 Budapest Memorandum is often misrepresented as a binding military agreement that obligates the U.S. to defend Ukraine. That is simply not true. The memorandum, signed by Ukraine, the U.S., the U.K., and Russia, was a diplomatic assurance in exchange for Ukraine giving up its nuclear weapons. The agreement reaffirmed that all signatories would respect Ukraine’s sovereignty, refrain from using force or economic coercion against it, and seek United Nations Security Council action if Ukraine was threatened with nuclear weapons. However, nowhere in the memorandum does it state that the U.S. or U.K. are required to provide military aid or intervene in a conflict. Unlike NATO’s Article 5, which explicitly requires mutual defense, the Budapest Memorandum contains no military commitments and has no enforcement mechanism.\n\nThis also means the memorandum does not justify the U.S. going to war with Russia over Ukraine. The only specific action mentioned is seeking U.N. intervention in the event of nuclear weapons being used. There is no legal or military obligation for the U.S. to send troops or weapons. Ukraine did not secure a defense guarantee like Japan or South Korea, which have formal treaties ensuring U.S. military protection. If Ukraine wanted that level of security, they should have negotiated for it instead of relying on vague diplomatic assurances. It’s not America’s fault that Ukraine signed a weak deal. Unlike Japan and South Korea, which ensured their defense with explicit treaties, Ukraine gambled its security on an unenforceable promise. That is a failure of their leadership, not a U.S. responsibility to fix.\n\nDespite this, the U.S. has funneled billions of dollars into Ukraine’s war effort, not out of legal obligation but for geopolitical strategy. This is about using Ukraine as a proxy to weaken Russia, not about fulfilling some ironclad defense commitment. The most reckless take is the idea that the U.S. must escalate the conflict, even at the risk of nuclear war, simply because of an old diplomatic agreement. The Budapest Memorandum does not require America to fight World War III over Ukraine. The U.S. never committed to guaranteeing Ukraine’s security—only to respecting its sovereignty. That is a crucial difference, and it is one that should end the argument that this agreement justifies endless funding and reckless escalation.\n\nFor those who don’t trust me look at the actual document: [https://policymemos.hks.harvard.edu/files/policymemos/files/2-23-22\\_ukraine-the\\_budapest\\_memo.pdf?m=1645824948](https://policymemos.hks.harvard.edu/files/policymemos/files/2-23-22_ukraine-the_budapest_memo.pdf?m=1645824948)",
    "comments": [
        {
            "author": "RandJitsu",
            "body": "May not be a binding military agreement but it was still clearly a promise. If we want any country to ever give up nuclear weapons again, we need to honor our promise to Ukraine.",
            "score": 56,
            "replies": [
                {
                    "author": "Bunstonious",
                    "body": "This is probably the key point most people are missing, this will signal to all countries they need nukes if they want to deter invasion and could start another \"bad for humanity\" arms race.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "Spandexcelly",
                    "body": ">If we want any country to ever give up nuclear weapons again, we need to honor our promise to Ukraine.\n\nThe nuclear weapons Ukraine possessed were controlled by Moscow and were Soviet holdovers. They were extremely unlikely to have been utilized in any capacity by the Ukrainians. The West was more worried about Russia reacquiring them than they were about Ukraine making them functional. It's an oft overlooked detail of the agreement.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "DoesntLikeJazz",
                            "body": "Not quite. It was agreed that Ukraine's nuclear weapons would be transferred to Russia after 1994 for dismantlement. So keeping these weapons out of Russia was not one of the West's goals. ",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "lamegrain",
                            "body": "To the extent that this is an overlooked detail, it is because it's not based in reality and is simply wrong. \n\nFirstly, do you suppose that there were no Ukrainians trained in the use of these arms that were present after the dissolution of the Soviet Union? Really? I find that doubtful though it is not important because, Secondly, where did the arms go as a result of the signing of the agreement? As someone else already stated, they went to the Russians which is what the West wanted.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Fuck0254",
                            "body": "I was hoping libertarians would know better than to advocate surrender to a country being invaded but I guess I underestimated the power of propaganda",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BackgroundSwimmer299",
                    "body": "It was also never agreed on paper that we would stay out of the Warsaw pact countries and not attempt to align them with NATO but it was agreed to verbally and promised you see how well that went on our part neither side has particularly kept its promises I mean let's face it the US has a long standing history of breaking its own treaties",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zugi",
                    "body": "The U.S. Constitution requires treaties to be signed by the President and ratified by the Senate. A \"Budapest Treaty\" would have been publicly debated and, if it passed, would be enforceable. I agree we should honor treaties (e.g. the \"T\" in \"NATO\".)\n\n\nBut this is just a \"memorandum\". I feel bad for Ukraine, and I agree it sends a bad message, but U.S. taxpayers did not sign up to defend Ukraine.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "KindSadist",
                    "body": "The spirit of the Budapest memorandum was thrown out when the CIA started operating in Ukraine against Russia.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "DerpDerper909",
                    "body": "A “promise” is not a legally binding military guarantee, and it sure as hell isn’t a justification for dragging the U.S. into an endless war. The Budapest Memorandum was a diplomatic assurance, not a defense pact. It never obligated the U.S. to defend Ukraine militarily, and pretending otherwise is just rewriting history.\n\nAbout the “we need to honor our promise or no one will give up nukes again” argument. First off, the U.S. never “promised” military intervention. The document literally says that if Ukraine is threatened, the signatories are supposed to seek consultations and take the issue to the UN—not send troops, not go to war, just talk. That’s what was agreed to, and that’s exactly what happened. The U.S. and U.K. have given billions in aid, weapons, and support—far more than what the Budapest Memorandum actually required.\n\nSecond, no country is giving up nukes based on a piece of paper anyway (except Ukraine.) The idea that if we don’t “honor” this vague, unenforceable memo, countries will suddenly refuse to denuclearize is nonsense. Countries keep nukes because they know military power is the only real security guarantee—not because of a handshake agreement made 30 years ago. North Korea, Iran, and any other nuclear-ambitious country don’t give a damn about what happened to Ukraine—they care about military deterrence, period.\n\nThe U.S. isn’t “breaking” anything by not going to war for Ukraine. Ukraine signed a bad deal. That’s not America’s problem to fix. If Ukraine wanted real security, it should have negotiated a military defense treaty like Japan or South Korea did. Instead, it put its trust in vague diplomatic promises with no enforcement mechanism. That’s not America’s fault, and it sure as hell doesn’t mean we’re obligated to throw endless money and weapons into the conflict. The Budapest Memorandum was never a war guarantee, and anyone still pushing that argument either hasn’t read the document or is deliberately ignoring reality.",
                    "score": -15,
                    "replies": [
                        {
                            "author": "whatwouldjimbodo",
                            "body": "Here’s the definition of assurance \n\na positive declaration intended to give confidence; a promise.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "DerpDerper909",
                                    "body": "Great, you looked up the dictionary definition—now try reading the actual Budapest Memorandum. Yes, an “assurance” is a promise, but not all promises are legally binding or enforceable. That’s the entire point. The Budapest Memorandum was a diplomatic assurance, meaning it was a statement of intent, not a military obligation. If it were meant to be a defense pact, it would have been ratified as a treaty, with clear enforcement mechanisms—which it wasn’t.\n\nThe document itself says that if Ukraine is threatened, the signatories will seek consultations and bring the matter to the UN. That’s it. Nowhere does it say the U.S. must send troops, engage militarily, or provide endless weapons. And guess what? That’s exactly what happened. The U.S. and U.K. condemned Russia, took the issue to the UN, imposed sanctions, and have given billions in aid—far more than what the memorandum actually required.\n\nIf Ukraine wanted a real military defense agreement, it should have negotiated a binding treaty, like Japan or South Korea did. Instead, it put its security in the hands of unenforceable diplomatic wording. That’s not America’s fault, and it doesn’t mean we’re obligated to go to war over it. If you want to argue that the U.S. should blindly fund this war forever, fine—but don’t pretend the Budapest Memorandum legally requires it, because it doesn’t. Read the actual document instead of a Google definition.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "whatwouldjimbodo",
                                            "body": "That’s cool, but the point is that america can’t keep making promises and them breaking them. That’s bad for business",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "DerpDerper909",
                                                    "body": "The U.S. didn’t break any promises because the Budapest Memorandum was never a military guarantee to begin with. You keep acting like the U.S. made some ironclad commitment to defend Ukraine when, in reality, the agreement only required diplomatic action—**which the U.S. already did**. **The issue was brought to the UN, sanctions were imposed, and Ukraine has received more money, weapons, and political backing than anyone could have imagined when that memo was signed.**\n\nCountries don’t base their security decisions on “promises” alone. They base them on military realities. If nuclear states like North Korea or Iran think they need nukes, it’s not because of the Budapest Memorandum—it’s because they know that the only real security guarantee is having a strong military, not trusting pieces of paper. Ukraine made a bad bet by giving up its nukes without securing an actual defense pact. That’s not on the U.S.—that’s on Ukraine for signing a weak deal.\n\nIf you’re worried about America’s credibility, maybe focus on real defense treaties like NATO, where the U.S. actually has binding commitments—not some vague diplomatic agreement that people are now retroactively trying to turn into a war mandate. If the U.S. “breaking promises” were really such a concern, why is NATO still expanding? Why do countries still rely on U.S. military support? Because when it comes to actual, binding commitments, the U.S. follows through. The Budapest Memorandum was never one of those commitments, and no amount of revisionist history changes that.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "whatwouldjimbodo",
                                                            "body": "The US hasn’t broken a promise because we’ve been helping Ukraine. The US is not in a full scale war with Russia. We’re sending weapons to Ukraine. You keep acting like we have boots in the ground in Russia. Ukraine is defending itself.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "DerpDerper909",
                                                                    "body": "Exactly. You just proved my point. The U.S. hasn’t broken a promise because we’ve already fulfilled what little the Budapest Memorandum actually required. The U.S. wasn’t obligated to fight a war for Ukraine, and it hasn’t—but it has provided billions in military aid, sanctions, intelligence, and diplomatic support. That goes far beyond the original agreement.\n\nAt what point is enough, enough? How long does this war continue before people admit that dumping endless money and weapons into it isn’t a real strategy? Ukraine already got way more than the Budapest Memorandum ever promised. The idea that the U.S. owes even more, indefinitely, is just shifting goalposts.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "whatwouldjimbodo",
                                                                            "body": "I think you’re missing the point that Russia not taking over Ukraine also benefits us. We also don’t want china yo take over Taiwan. Under different circumstances maybe we shouldn’t send equipment over there, but unfortunately we waste trillions on military equipment. Sending Ukraine our old outdated equipment that we will never use doesn’t really hurt us",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DerpDerper909",
                                                                                    "body": "I get the argument, but let’s not pretend this is just some free, no-risk benefit for the U.S. Yes, keeping Russia from fully absorbing Ukraine aligns with American geopolitical interests, just like preventing China from taking Taiwan does. But the idea that this war is just about dumping \"old, outdated equipment\" with no consequences is completely false.\n\nFirst, we’re not just sending old weapons collecting dust in a warehouse. We’ve sent billions in cutting-edge military aid—HIMARS, Patriot missile systems, tanks, advanced drone tech, and now long-range missiles and F-16s. Meanwhile, our own stockpiles have been depleted to the point where defense officials have openly admitted that replenishment is a major concern. There’s a reason the Pentagon is scrambling to ramp up production.\n\nSecond, this war is costing far more than just old gear. We’ve spent over $175 billion (and counting) on Ukraine—more than some entire federal departments get in a year. And while people act like it’s \"not a big deal,\" those same people ignore the fact that Europe—who has way more at stake—isn’t contributing nearly as much. The U.S. is once again left footing the bill for someone else’s security while NATO countries drag their feet.\n\nThere’s no clear endgame. Ukraine isn’t in NATO, and we have no obligation to fund this war indefinitely. How much more? How many more years? How much more of our military stockpile before we acknowledge that there’s no real strategy here—just an open-ended, blank-check war that defense contractors and lobbyists love?\n\nIf you want to argue that countering Russia is in our interest, fine. But let’s be frank—this is not just harmlessly dumping old equipment. It’s an expensive, long-term commitment that America is carrying far more than anyone else. At some point, it’s reasonable to ask when enough is enough.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "whatwouldjimbodo",
                                                                                            "body": "So what do you think we should do? Let Russia take Ukraine?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DerpDerper909",
                                                                                                    "body": "Good question. Here's my view. First, freeze the conflict at the current line of control—March 2025’s ugly scar across Ukraine’s east and south. That’s Russia squatting on Crimea, 80% of Donbas, and chunks of Zaporizhzhia and Kherson—18-20% of Ukraine’s pre-2014 turf, per Institute for the Study of War mappings. Call it a done deal for now—no more grinding advances, no more body bags for a few extra miles. Step two: ram through the U.S.-Ukraine minerals deal that cratered on February 28. It’s a $50 billion, 10-year pact to tap Ukraine’s rare earth jackpot—90% of its graphite in Donetsk (500 million tons, 10% of global reserves), lithium deposits in Luhansk and Kirovohrad (Polokhivske’s got 3% of world totals), plus titanium in Zhytomyr, per Ukraine’s Ministry of Environmental Protection. These ain’t just rocks—graphite’s for EV batteries, lithium’s tech fuel, titanium’s jet-grade. Deploy U.S. firms—Albemarle for lithium, Tesla sniffing graphite—boots on the ground, not just cash. Most of these deposits hug that Donbas frontline, 240 klicks from Russian guns—perfect for a human shield. American citizens working those mines mean any Russian push hits our people, spiking the stakes.\n\nStep three: carve a demilitarized zone—40 kilometers wide, 1,000 kilometers long, from Luhansk down to Kherson, a buffer straight out of the Korean Armistice playbook. Stock it with European NATO horsepower: Poland’s 3rd Armoured Division rolls in 30,000 troops with 300 Leopard 2 tanks; the UK’s 16 Air Assault Brigade drops 10,000 paratroopers, rapid-deployment vets from Afghanistan; Germany’s Rapid Forces Division adds 15,000 with Puma IFVs—55,000 total, no half-measures. Arm them heavy: 500 Javelin launchers (2,000 missiles), 50 MQ-9 Reaper drones, ELINT rigs like the UK’s Watchkeeper, and mobile radar to spot Russian arty 50 klicks out. Fund it with a $10 billion NATO-EU escrow—Germany’s flush with $42 billion in Ukraine aid already, France can spare $2 billion, Poland’s got skin in the game at $5 billion. Coordinate via NATO’s Enhanced Forward Presence, rotating 18-month tours, ironclad rules of engagement: Russia crosses, they eat lead.\n\nStep four: lock in a ceasefire treaty—Kyiv, Moscow, U.S., NATO, UN at the table, plus Turkey as a Black Sea wildcard with Erdogan’s grain-deal cred. Ink it tight: any Russian breach of the DMZ spills NATO blood, triggering Article 5 and WW3. Putin’s burning $150 billion a year now—$400 billion total since ‘22, 725,000 casualties—and his $260 billion reserves won’t outlast a global slugfest; China and India ($200 billion trade) ditch him fast if he’s dumb enough to try. Satellite data (Maxar, Feb 2025) shows his Donbas gains stalling—2,000 square klicks since October—so he’s got no juice for a big swing. The minerals deal seals it: $15-25 billion yearly from Donbas mines (Kyiv School of Economics est.) pumps Ukraine’s GDP 20% by 2028, per World Bank math—$50 billion just to rebuild Gaza-level ruin—while U.S. citizens on-site tie our economic fate to theirs, a $10 billion stateside profit stream securing battery supply chains off China’s 70% chokehold.\n\nThis ain’t charity—it’s a steel trap. European NATO troops—55,000 strong—hold the DMZ, not American kids; Putin’s boxed in, not appeased; Ukraine gets a lifeline, not a blank check. We’ve burned $182.8 billion already—halt that bleed, pivot to Asia-Pacific, and let Europe carry the torch. If Putin blinks, he’s facing 55,000 NATO rifles and a $10 trillion alliance GDP—$150 billion war burn’s a rounding error there. He won’t—he’s a thug, not a kamikaze. Minerals keep America invested, not just bleeding sympathy—prosperity’s the best deterrent. That’s the call: de-escalate smart, not surrender. What’s your better shot, genius—keep funding a meat grinder or we can grow some balls and end it the right way?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "whatwouldjimbodo",
                                                                                                            "body": "How does any of that end the war? You’re saying out more troops in and start mining. I have no problem with Ukraine paying for their war with minerals, but nothing of what you said would stop the war and it sounds like an escalation to me. In order for the war to stop, Russia needs to stop. You made a lot of assumptions around what we can do that is purely a decision by Russia.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "DerpDerper909",
                                                                                                                    "body": "The war stops when the incentives change, not when people naively hope Russia “just stops.” That’s the whole point of this strategy—locking in a ceasefire through economic leverage, military deterrence, and strategic positioning.\n\nRight now, Russia has no reason to stop because they see the West as a bottomless ATM funding Ukraine’s survival. They can grind Ukraine down as long as the U.S. keeps writing blank checks. That’s why you force a hard freeze at the line of control—deny Russia further gains while making any future aggression a direct attack on NATO forces. You think Putin wants to start WW3 over more shelling in Donbas? He’s ruthless, not suicidal.\n\nAs for the minerals deal, it ties American economic interests directly to Ukraine’s security. This isn’t about just “starting mining”—it’s about establishing a long-term, self-sustaining Ukrainian economy that doesn’t rely on U.S. welfare forever. If American firms and citizens are on the ground, it means any Russian incursion escalates the conflict beyond just Ukraine. That’s deterrence without direct military engagement.\n\nDoing nothing and hoping Russia quits is not a plan. Just saying “Russia needs to stop” is meaningless when they have zero incentive to do so. You don’t beg bullies to stop—you back them into a corner where continuing the fight is no longer worth it. This strategy locks Putin into a stalemate, cuts the U.S. financial bleeding, and forces Europe to step up. You call that escalation—I call it the only realistic way out.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "whatwouldjimbodo",
                                                                                                                            "body": "I really don’t understand your whole argument. You’re against defending Ukraine because that’s not what the Budapest memorandum says, but your solution is to defend Ukraine even more? You’re locking in a ceasefire by putting nato troops on the ground with the idea that Russia wouldn’t attack nato troops. The incentive for Russia to stop is they are currently wasting money and lives while gaining nothing. You’re solution is fine, but I don’t understand the argument against the Budapest memorandum when that’s your solution",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "DerpDerper909",
                                                                                                                                    "body": "You’re missing the fundamental difference between my plan and the way the war is being handled now. It’s not about whether Ukraine should be defended—it’s about how it should be defended in a way that doesn’t turn into an endless money pit for the U.S. while ensuring long-term security.\n\nThe Budapest Memorandum argument is about legal obligations. The U.S. was never required to go to war for Ukraine—that’s a fact. It committed to diplomatic support, not military intervention. But right now, we’re stuck in a situation where that memo is being twisted into an excuse for an open-ended blank check, with no strategy beyond “send more money and weapons.” That’s unsustainable.\n\nMy plan actually forces an end to the war by freezing the conflict at the current lines and deterring future Russian aggression in a way that doesn’t require endless U.S. funding. The key difference is that instead of just dumping aid into Ukraine indefinitely, we shift the burden to European NATO forces, create an economic investment structure through the minerals deal, and turn Ukraine into a self-sustaining state instead of a welfare client.\n\nYes, NATO troops in a DMZ act as a deterrent, but that’s not “escalation.” That’s a stabilizing force—exactly like how NATO has forces in the Baltics and South Korea has a DMZ. The alternative is what we have now: an indefinite war that Russia can keep grinding away at, while Ukraine bleeds out and the West keeps throwing money into a black hole.\n\nPutin already has an incentive to stop—he’s burning cash and bodies at an insane rate—but he also knows that as long as the U.S. keeps Ukraine afloat, he can just wait us out. By setting clear red lines with NATO troops in a DMZ, securing U.S. economic stakes through minerals, and making it clear there’s no more “free” aid, we cut off Russia’s ability to play the long game. That’s the difference.\n\nSo no, my plan isn’t “more defense of Ukraine”—it’s a structured, enforceable way to stop the war without turning this into a forever war. The Budapest Memorandum argument is about whether the U.S. was ever obligated to do this in the first place—not whether we should end the war on terms that actually benefit America.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "Proof_Moment5796",
                                                                                                            "body": "# “that’s a great plan walter, that’s fucking ingenious if I understand it correctly. it’s a swiss fucking watch.”\n\n\"First, freeze the conflict at the current line of control\" and give Russia a pause for few years while they already rapidly expands power with a massive military buildup (they already spend 30% of their budget into military and producing more ammo and military equipment a month then the whole NATO together a year ) they are not binded by any internal restrictions such as \"care about own ppl life\" or any \"business interests\" unlike the US and EU.  \nStep 2 easing the sanctions that your orange businessman has already promised and restoring relations between pedorussia and EU that will open the way to corrupt EU even more as putler did in the last 10  years before war.  \nStep 3 with support of  the Euro prostitutes lobbied by putler and military power increased several dozen times during the pause - the complete seizure of Ukraine and the beginning of intervention to EU.  \nStep 4 - WW3.  \nStep 5 - I'm looking at the nuclear mushrooms and smile.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Helcionelloida",
            "body": "We did promise to support the UN security council intervening and have betrayed that promise.   \n[https://www.bbc.com/news/articles/c7435pnle0go](https://www.bbc.com/news/articles/c7435pnle0go) \n\nOur continued support of Ukraine is the support of democracy. All that said, Russia is in an extremely weakened state and it's absolute madness that we are aligning ourselves with them.",
            "score": 35,
            "replies": [
                {
                    "author": "DerpDerper909",
                    "body": "The Budapest Memorandum required signatories to take Ukraine’s case to the UN, not to engage in direct military intervention—and the U.S. already did that. Russia has a veto on the Security Council, which makes enforcement difficult, but that’s a structural flaw in the UN, not a “betrayal” by the U.S. The idea that this somehow obligates endless military aid or direct involvement was never part of the agreement.\n\nAs for “supporting democracy”—let’s be honest. Ukraine has suspended elections, banned opposition parties, and cracked down on dissent. That’s not exactly the gold standard of democracy. Supporting Ukraine’s right to sovereignty is one thing, but blindly labeling this as a fight for “democracy” while ignoring what’s actually happening on the ground is misleading. \n\nAnd no, choosing not to fund an endless proxy war isn’t the same as “aligning with Russia.” That’s a simplistic talking point meant to silence debate. The U.S. has already poured billions into this war, and yet Europe—the region most affected—still isn’t pulling its weight. At some point, we have to ask whether this is about protecting Ukraine or just prolonging a conflict that benefits defense contractors and entrenched interests. Wanting accountability and a clear strategy isn’t “betrayal”—it’s common sense.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "RedMoonRaider_",
                            "body": "What do you mean Europe isn't pulling its weight? Combined they've given more money in military aid to Ukraine than the USA has. Check the figures before making claims like that.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DankTrebuchet",
                            "body": "Unbased as fuck",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TK-369",
            "body": "No one will ever willingly give up nukes again, that option is done for good. It was foolish on their part. \n\nIf we're \"defending democracy\", then NATO should have boots on ground or at least working to achieve air superiority. \n\nWe're not, we're not even defending Ukraine. We're just makin' some money and Ukrainians are paying for it with their lives, business as usual (and business is booming).",
            "score": 10,
            "replies": [
                {
                    "author": "William-_-Buttlicker",
                    "body": "I might be an odd ball here but MAD is working just as designed. The only time when a nuclear bomb exploded was when only one country had nuke. If more countries --including Iran and Taiwan-- have nuke, according to MAD and game theory, there's less of a chance of hot wars and the world would  actually be much safer.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TK-369",
                            "body": "On one hand, I agree with you. On the other hand, it's kinda terrifying to have the keys to Armageddon in Iran's hands, for example. But maybe that's better than having our soldiers all over the world, perhaps Armageddon is better at policing. It's pretty black and white, all or nothing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "diamondjiujitsu",
                    "body": "ukraine should just build nukes the second trump fully backs out. F that id be pissed if i was them",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dear-Dream-6293",
            "body": "You can play on words but assurances were given to Ukraine that Russia would not invade etc… and if so the alliance would intervene. Don’t try to defend the defenseless. They gave up Nukes for peace and protection. Period “ the United States of America reaffirm their commitment to seek immediate United Nations Security Council action to provide assistance to Ukraine, as a non-nuclear-weapon State party to the Treaty on the Non-Proliferation of Nuclear Weapons, if Ukraine should become a victim of an act of aggression or an object of a threat of aggression in which nuclear weapons are used.”",
            "score": 2,
            "replies": []
        },
        {
            "author": "HaikuHaiku",
            "body": "Yes, I've been saying this in a lot of threads recently, as the pro-Ukraine crowd really clings to this as though it had a binding force.",
            "score": 5,
            "replies": [
                {
                    "author": "jeschd",
                    "body": "I was so happy to see the document was short and easy to read. Should be clear to anyone who has the link that they are wrong.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DerpDerper909",
                            "body": "yes, everyone READ THE F\\*CKING DOCUMENT before accusing the U.S of \"breaking\" their promise when they actually went above and beyond the agreement!!!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Proof_Moment5796",
                                    "body": "3.The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their commitment to Ukraine, in accordance with the principles of the CSCE Final Act, to refrain from economic coercion designed to subordinate to their own interest the exercise by Ukraine of the rights inherent in its sovereignty and thus to secure advantages of any kind.  \nso Trump must shut the fuck up about his \"deal\"  \nalso  \n2. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their obligation to refrain from the threat or use of force against the territorial integrity or political independence of Ukraine  \nso Trump must shut the fuck up about territorial concessions and forcing elections.  \nalso\n\n1 The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their commitment to Ukraine, in accordance with the principles of the CSCE \\[Commission on Security and Cooperation in Europe\\] Final Act, to respect the Independence and Sovereignty and the existing borders of Ukraine.\n\nso Trump must stop fucking victimblaming Ukraine",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LowHangingFruit20",
            "body": "Don’t libertarians hate bureaucracy? Making silly cases that go against morality due to what some stuffy bureaucrat put on a piece of indecipherable legislation or decree? Doesn’t the idea of a tyrannical dictator stripping property rights and liberty of a free people enrage you as a libertarian? I can have a good-faith argument about whether our tax dollars (or how MUCH of our tax dollars) should go to supporting Ukraine, but I can think of 99 other useless things we spend tax dollars on, and buying anti-tank missiles for Ukraine ain’t one.",
            "score": 2,
            "replies": [
                {
                    "author": "sbrisbestpart41",
                    "body": "Go read Hoppe’s from Aristocracy to Monarchy to Democracy. Its like 70 pages and explains why war is bad in all situations no matter how it is fought (direct, support, proxy).\n\nAlso the Ukrainian government is committing a ton of natural rights violations along with the USA in this entire war as well. That doesnt mean I’m pro Russia, I’m just saying something truthful about our involvement.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "LowHangingFruit20",
                            "body": "Thanks for the recommendation! I’ll take a read of it tonight. I am curious, and in good-faith wanting some clarification: if the argument is to abstain from war entirely, how do you morally justify NOT intervening when it’s clear that the slow progress and conquest of a corrupt regime (couple examples in history come to mind) will become insurmountably difficult to counter when the only sovereign target is YOU (or your country)? I’m not saying the situation in Ukraine fits this description, more of a “ehhh Hitler is Europe’s Problem” kinda thought experiment",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "sbrisbestpart41",
                                    "body": "I think that the mindset of having to help specifically other countries has arisen due to the concept of “Democratic war” which Hoppe explains in his book. \n\nAs for if it is right to intervene I think intervention is always a justification for a “state of emergency” in a country like it was in WWII. And that is how FDR turned this country into a command economy for nearly 13 years and then put Japanese people in internment camps. Plus after the war America expanded its influence exponentially and subjugated every country to a sort of growing “global” anti-national culture.\n\nI dont have an arguement for not going to war in WWII when discussing the morality of it, but I have this thought inside that it just isnt right if it isnt for direct defense. No matter who.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "LowHangingFruit20",
                                            "body": "Cool. I’ll take a read. I will counter the whole narrative of command economy creating the conditions by which the Japanese were interned as maybe not entirely accurate. I submit this: the only place in the United States where we found direct Japanese Empire influence on Japanese citizens to induce espionage and potential sabotage was Hawai’i. Guess where no Japanese-American folks were interned? Hawai’i.  The history of what lead up to 1066 was a very intense and directed effort by “native” American farmers who through straight racism or out-competition by Japanese-American farmers lobbied the government to declare such people as threats: Roosevelt knew he needed the majority of farmers to help support the war effort and folded to their demands. It’s sticky, for sure; but to invalidate the morality and positive world-outcomes of our involvement in WW2 based on the internment of Japanese Americans from a command-economy perspective ignores the horrific racist motivations of those that lobbied for it. The Roosevelt name will always be stained with this sin, but there is NOWHERE near enough attention paid to those who lobbied for it out of ghoulish fear and hatred",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "sbrisbestpart41",
                                                    "body": "I didnt know that but it holistically makes the situation worse anyhow. I could care less about the motivation in the end though. The farmers could have their opinion which I totally disagree with but the amount of power which FDR had is evident. If he is allowed to just scoop up an entire nationality within the states for any reason and put them in camps its a total overstepping of presidential power.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jankdangus",
                    "body": "While justified, I don’t want to hear people grandstand about property rights and liberty, when Ukraine is under Martial Law.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "LowHangingFruit20",
                            "body": "Ok, so what position do we take then? We are all well within our rights to push against the concept of MARTIAL (not Marshall) Law, but could you, in good conscious, saw that what the Ukrainian government is doing under Martial law is significantly worse than the violation of national borders and wholesale slaughter of people in Donbass or Kherson or Crimea? We have to draw a moral line in the sand at some point and just jealously guarding our tax dollars without considering the morality of our actions is empty and lazy.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "jankdangus",
                                    "body": "I want the war to end asap. The longer it drags on, the worser it will get. I think Zelenskyy concern is fair, but I don’t really know how much we can push Putin before he goes nuclear. He has to safe face. I’m fine with sending aid as long as the American tax-payers is paid back down the line.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Thencewasit",
            "body": "Did the Senate ever pass a resolution approving the memo with a 2/3rds majority ?\n\nThen it’s not a binding treaty. ",
            "score": 1,
            "replies": [
                {
                    "author": "DerpDerper909",
                    "body": "Even if the Budapest Memorandum were a binding treaty (which it’s not), it still wouldn’t require the U.S. to go to war. The actual text only requires signatories to seek consultations and bring the issue to the UN—not deploy troops or provide endless military aid. The United States has done MUCH more then that.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Proof_Moment5796",
                            "body": "3.The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their commitment to Ukraine, in accordance with the principles of the CSCE Final Act, to refrain from economic coercion designed to subordinate to their own interest the exercise by Ukraine of the rights inherent in its sovereignty and thus to secure advantages of any kind.  \nso Trump must shut the fuck up about his \"deal\"  \nalso  \n2. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their obligation to refrain from the threat or use of force against the territorial integrity or political independence of Ukraine  \nso Trump must shut the fuck up about territorial concessions and forcing elections.  \nalso\n\n1 The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their commitment to Ukraine, in accordance with the principles of the CSCE \\[Commission on Security and Cooperation in Europe\\] Final Act, to respect the Independence and Sovereignty and the existing borders of Ukraine.\n\nso Trump must stop fucking victimblaming Ukraine",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Thencewasit",
                            "body": "I concur.\n\nIt was more of a statement about the so called constitutional crisis that keeps getting brought up on Trump’s actions",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "DerpDerper909",
                                    "body": "yep no I agree. I was just saying that even if it was ratified, the U.S did meet their obligations to the Budapest Memorandum. It would be obvious to anyone that actually read the very short document but I guess people will keep downvoting me here lmao",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Thencewasit",
                                            "body": "Yes.  It is a very short agreement and purposely so.  \n\n\nAlthough I think if you would look at the reporting around the event, the Clinton Administration did imply that the US (and other parties to the agreement) would fund Ukraine so that it would be in a position to withstand an invasion from Russia.  Although, that was directly after the USSR collapsed and its military was a shell of its former glory so it wasn’t much of a difficult promise.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MazlowFear",
            "body": "I would think standing up to a state like the former Soviet Union trying to take land and liberty from a fledgling democracy would be something we could get behind. Where is the non-aggression principle in this case or is it not aggression because we took Soviet out of the title?",
            "score": 1,
            "replies": [
                {
                    "author": "sbrisbestpart41",
                    "body": "Would you be okay with saving “a fledgling democracy” if Ukraine was South Vietnam?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CryptoThroway8205",
                            "body": "Those are different cases and you know it. Ho Chi Minh was respected by the Vietnamese people and would've won a bloodless election had one been allowed. Instead the US backed a dictator with a sham election in Diem.  \n\n\nUkraine was invaded by a foreign power.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "sbrisbestpart41",
                                    "body": "As far as I am concerned its still a proxy war. Ukraine and America dont have abundant historical ties. We were/are protecting an interest overseas in both cases. Simple as.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MazlowFear",
            "body": "I am just trying to point out that twenty years ago if a former KGB became leader of a failed communist state and invaded their neighbor to steal their resources we would have stood up to them and secured those resources for America. It wouldn’t even matter that they were directly next to our European partners, or threatening the stability of the whole world, we would have been in there. Now we can’t even extort a minerals deal out of them. Trump sucks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WyldRyce",
            "body": "The memorandum is an ascension to the Treaty on the Non-Proliferation of Nuclear Weapons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hour-Statistician219",
            "body": "Ukraine gave up their nuclear arms (ones that could have protected them against Russia) in good faith that all countries will ahere to the agreement. This sets an example that memorandums in good faith are meaningless in world politics and no country should ever take them seriously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "soulesssocalginger",
            "body": "Sure, the wording does allow us to watch as their sovereignty is disrespected by another partner of the agreement because we respect their sovereignty and aren’t the ones breaking the agreement. Spot on, we don’t have to do anything but watch and send our thoughts and prayers - it’s totally working for us on a global scale.  Whohoo! Let’s just watch what happens, good plan idea.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JBAKER2009",
            "body": "Let's simplify it, if Ukraine kept the nukes and stated they would develop the means to use them if they ever needed to, Russia wouldn't be invading them now. As Ukraine would have the nukes to stop them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Relevant-Ad-2950",
            "body": "OP - your pro Russia propaganda isn’t changing any minds.  It’s splitting hairs.   \n\nA promise is a promise on the international stage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Internal_Guide884",
            "body": "You're link to back up your claim **contradicts** you! You're link, Point 4 specifically states that assistance should be provided to Ukraine upon any aggression from any state against Ukraine. In addition to Russia violating conditions by not attacking Ukraine (Point 1), Russia has also violated the agreement by not summoning United Nations Security Council, which the memo specifically states.",
            "score": 1,
            "replies": [
                {
                    "author": "cheese_mite",
                    "body": "what type of assistance? there is nothing said what kind of help it should be lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Internal_Guide884",
                            "body": "What is the context of that section? Or did you think we are to assist with a supply of corn dogs?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cheese_mite",
                                    "body": "if nothing is said about the type of help it could be even corn dogs for refugees. That's how contracts work. There is no such thing as \"assumed\" at this level. Want specific guarantees - it should be described in official document.   \nIt's kinda strange to explain such simple intuitive things 🤷‍♂️",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Internal_Guide884",
                                            "body": "that's not how contracts work.. Really hard to explain such an elementary concept, try to understand \"judicial interpretation\"... it applies to international law as well. That's how contracts work... just say'n ..",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Own-Bookkeeper2109",
                    "body": "https://preview.redd.it/8nkiayd81jme1.png?width=602&format=png&auto=webp&s=7559391e16f0a55b877b99c34bb43c711528fbaa",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Internal_Guide884",
                            "body": "This is correct, and what did the Security Council state?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SpawnOfTarterus",
                            "body": "You are missing the \"or\" portion, but even still, both are true. 1st, \"should become a victim of an act of aggression,\" they have... Russia invaded them. 2nd, \"or an object of a threat of agression in which nuclear weapons are used.\" Russia has threatened to use nuclear weapons in Ukraine multiple times since they invaded. So Ukraine has been both a victim of aggression AND an object of a threat of aggression involving nuclear weapons.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Timirninja",
            "body": "OMG, you’ve dug deep into memorandum and forgot to mention significant detail, for some it’s an elephant in the room - political sovereignty was promised. Russia didn’t invade Ukraine before 2014. There was soft coups in Ukraine before 2014, but that did not render Russia’s direct response. Only after legitimate president of Ukraine was overthrown, only then Russis intervened and took actions to prevent Crimea falling into NATO’s hands",
            "score": 0,
            "replies": [
                {
                    "author": "Proof_Moment5796",
                    "body": "2. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their obligation to refrain from the threat or use of force against the territorial integrity or political independence of Ukraine, and that none of their weapons will ever be used against Ukraine except in self-defense or otherwise in accordance with the Charter of the United Nations.\n\nso please... tell me... which Charter of the UN allowed pedorussia to invade Ukraine? or may be it was an act of self-defense??????",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Timirninja",
                            "body": "Bingo",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Proof_Moment5796",
                                    "body": "Bingo what?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Timirninja",
                                            "body": "Political sovereignty was promised by the west and Russia. Political sovereignty was violated by means of government overthrow, Russians barged in to Crimea in response. Chiken or the egg?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Timirninja",
                                                            "body": "You don’t know about government overthrow of 2014 where Vikky Nuland and US diplomat discussing future leaders of Ukraine before it actually happened? Who pays you troll?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Son_of_Sophroniscus",
            "body": "Thanks for this post.",
            "score": -3,
            "replies": [
                {
                    "author": "DerpDerper909",
                    "body": "yep, there is A LOT of propaganda going on into gaslighting libertarians and some conservatives into believing (and emotional manipulating) we are obligated to protect them, when we aren't. It isn't our fault that Ukraine signed a dumbass deal.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Proof_Moment5796",
                            "body": "3.The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their commitment to Ukraine, in accordance with the principles of the CSCE Final Act, to refrain from economic coercion designed to subordinate to their own interest the exercise by Ukraine of the rights inherent in its sovereignty and thus to secure advantages of any kind.  \nso Trump must shut the fuck up about his \"deal\"  \nalso  \n2. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their obligation to refrain from the threat or use of force against the territorial integrity or political independence of Ukraine  \nso Trump must shut the fuck up about territorial concessions and forcing elections.  \nalso\n\n1 The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their commitment to Ukraine, in accordance with the principles of the CSCE \\[Commission on Security and Cooperation in Europe\\] Final Act, to respect the Independence and Sovereignty and the existing borders of Ukraine.\n\nso Trump must stop fucking victimblaming Ukraine",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DerpDerper909",
                                    "body": "This is a perfect example of cherry-picking lines from the Budapest Memorandum without understanding what the document actually says—or what it doesn’t say.\n\nFirst, reaffirming a commitment to Ukraine’s sovereignty does not mean the U.S. is obligated to fund an endless war or reject negotiations outright. Nowhere in the Budapest Memorandum does it state that the U.S. must keep pouring billions into Ukraine indefinitely or oppose a diplomatic settlement. In fact, the document explicitly states that in the event of a security threat, the signatories are supposed to seek consultations and bring the matter to the UN—not automatically go to war.\n\nSecond, let’s address this idea that “Trump must shut up about a deal.” Diplomacy is how wars end. If your argument is that negotiating peace is somehow a betrayal, then you’re essentially advocating for a forever war with no clear exit strategy. Ukraine has lost hundreds of thousands of soldiers, is running out of manpower, and is now begging for more aid while the U.S. is footing the bill. At some point, there has to be an off-ramp, and refusing to even discuss a settlement is pure delusion.\n\nThird, the whole “territorial integrity” argument ignores reality. Ukraine’s borders in 1994 are not the same as Ukraine’s borders in 2025. The fact is, Russia has de facto control over Crimea and significant portions of the Donbas. You can shout about maps and agreements all you want, but in the real world, borders are determined by who holds the ground. Pretending that these territories can be taken back by sheer force at this point is fantasy.\n\nFinally, to be clear—nobody “victim-blamed” Ukraine. Acknowledging that NATO expansion, the 2014 coup, and years of ignoring Russian security concerns contributed to this war isn’t victim-blaming; it’s understanding the full picture. You can scream about Budapest all day, but at the end of the day, Ukraine signed a weak, unenforceable document instead of securing an actual defense treaty. That’s not America’s fault.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Proof_Moment5796",
                                            "body": "cool, you are \"right\"... so... if somebody will breake into your house, fuck your wife, kill your doughter and throw you out from your home police should just say that nobody cares about your property rights, your wifes human rights , and your doughters right to live on paper cuz argument ignores reality and YOU personaly unable to beat killer from your home by sheer force and at this point it is fantasy, and it's not police fault cuz killer is also a police officer and has a gun.  \nThen police should make you a deal that you will get access to your kitchen and bedroom in exchange of 50% of your income and force you to sign a peace deal with the killer.  \njust tell me... in which lab they breed such r3t@rds as you are?\n\nand if you gonna tell me about \"oh no between countries it's not the same as on between humans level blah blah blah\" no... the last time world thought that it's not... the last time when world forced a victim to sign a \"deal\" in 1938 we got the most bloody war next year in a history of humanity, we Ukrainians learned this lesson hard, our country were the one where n-i germany killed the most people in their ethnic \"clearing\", we were the ones who fighted back our land and throwed away this human maggots back to Berlin, so shut the fuck up and if you don't wanna to help just stop fucking interfering and forcing us to surrender.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "DerpDerper909",
                                                    "body": "Ah yes, the classic “let’s compare geopolitics to home invasions” argument—because clearly, international diplomacy and war between nuclear-armed states work just like a burglary case in suburban Ohio.\n\nLet’s break down your emotional meltdown piece by piece.\n\nFirst off, Ukraine isn’t some defenseless homeowner getting mugged while the world watches. Ukraine has received over $182 billion in military aid, advanced weapons systems, intelligence, training, and economic support. That’s more aid than entire U.S. states get for infrastructure. If you think that equates to “nobody caring,” then you’re either willfully ignorant or just too blinded by rage to think logically.\n\nSecond, you bring up 1938 and the Munich Agreement like you’re the first person to ever invoke it. Here’s the problem—Ukraine is not Czechoslovakia, and Russia is not Nazi Germany. Germany in 1938 was a rapidly expanding power with a massive military buildup and an economy in overdrive, prepping for full-scale continental war. Russia in 2025? A corrupt petrostate that can’t even take all of Donbas after three years of fighting. You act like Putin is going to sweep through Europe, when in reality, his military has been struggling just to hold what they’ve already taken.\n\nThird, you’re out here acting like you get to dictate what the U.S. does with its own money and policy. Newsflash: American taxpayers don’t owe you a damn thing. The U.S. has already done more for Ukraine than it ever committed to under any agreement. If we decide that endless blank checks and weapons shipments aren’t in our national interest anymore, that’s not “forcing you to surrender”—that’s called prioritizing our own security and economic stability. You’re free to keep fighting, but don’t expect the rest of the world to bankroll your war indefinitely.\n\nFinally, you say, “if you don’t wanna help, stop interfering.” Here’s a reality check: Ukraine wouldn’t last three months without U.S. and NATO support. If the West pulls out, you don’t get to “keep fighting”—you get rolled over. So maybe drop the self-righteous victim complex and realize that diplomacy isn’t “surrender”—it’s the only path to survival that doesn’t involve total destruction. You don’t have to like it, but screaming insults and comparing everything to WW2 isn’t a strategy—it’s just whining",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Proof_Moment5796",
                                                            "body": "\"Here’s a reality check: Ukraine wouldn’t last three months without U.S. and NATO support.\" and \"First off, Ukraine isn’t some defenseless homeowner getting mugged while the world watches. Ukraine has received over $182 billion in military aid, advanced weapons systems, intelligence, training, and economic support.\"\n\nthen \"Russia in 2025? A corrupt petrostate that can’t even take all of Donbas after three years of fighting. You act like Putin is going to sweep through Europe, when in reality, his military has been struggling just to hold what they’ve already taken.\"\n\nso... what are we have here... Russia is almost broken poor weak country, but at the same time fighting it back is \"fantastic\" and \"unrealistic\", moreowher it's so powerfull that could counqer Ukraine in 3 month without EU and US help... moreowher it spends 30% of it's budget on war right now and producing more ammo and military equipment a month then the whole NATO together a year. So the real reason is - you stupid enough to belive that they will stop on Ukraine... which exactly bring us back to the 1938 comparsion.\n\n\"that can’t even take all of Donbas after three years of fighting\" then you never seen how Donbass looked like after 8 years of war since 2014, it's a god damn web of fortifications and mine fields, meanwhile in EU they would be able to drive on tanks from Warsaw till Lisbon within 8 hours with a cofee break in Paris (god bless german engineers and their roads, but during the war that's would be EU doom). And belive me, europeans and americans wouldn't fight for the last man behind the last wall of the last destroyed building in the smallest village, you already showed once that you will not.\n\n\"comparing everything to WW2\" not everything my dear, I'm not comparing your small rotten brain with WW2 for example.\n\n\"but screaming insults \" I'm really sorry, you can file a complaint to the \"go fuck yourself and die in pain council \"\n\nI'll repeat my question again just tell me... in which lab they breed such r3t@rds as you are?\n\nAnd I'll ask you again shut the fuck up and if you don't wanna to help just stop fucking interfering and forcing us to surrender.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Proof_Moment5796",
                                                            "body": "\"Newsflash: American taxpayers don’t owe you a damn thing.\"  \nNewsflash: rebelled british ex-colony behind the oceans can do whatever it wanna, but after EU falls it will collapse within a 3 month even without pedorussia direct invasion.\n\n  \nAnd even following your twisted logic, US \"policy\" showing the whole world that “strong” countries are not able to resist banal gopniks, and pedorussia is not the only such country in the world - Iran, Iraq, China, North Korea as a result of your infantility receives a clear message that they can push you through without any consequences, which will ultimately lead to the WW3, which your orange businessman is so fond of mentioning.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Proof_Moment5796",
                                                            "body": "\"Ukraine has received over $182 billion in military aid\"  \nalso about that, stop pretending that that was a charity and money burning, you sent us old equipment that you had to renew anyway (and It's disposal is far from free) and spent most of this money INSIDE US bumping up YOUR manufactories.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jankdangus",
            "body": "Yeah, we aren’t obligated to defend Ukraine, but it’s true  that not honoring the agreement sends a bad message to the rest of the world. Every country wants to arm themselves with nukes now in order to protect themselves because America can’t be trusted to protect them. I guess nuclear proliferation was inevitable, but the world is more dangerous if everyone has nukes. This is why I diverge from libertarians where I don’t really care how much aid we send as long as it’s eventually paid back.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Skeepdog",
            "body": "Exactly - we promised to “RESPECT” their borders, not “defend” them.  Two completely different things.",
            "score": -1,
            "replies": [
                {
                    "author": "Proof_Moment5796",
                    "body": "3.The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their commitment to Ukraine, in accordance with the principles of the CSCE Final Act, to refrain from economic coercion designed to subordinate to their own interest the exercise by Ukraine of the rights inherent in its sovereignty and thus to secure advantages of any kind.  \nso Trump must shut the fuck up about his \"deal\"  \nalso  \n2. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their obligation to refrain from the threat or use of force against the territorial integrity or political independence of Ukraine  \nso Trump must shut the fuck up about territorial concessions and forcing elections.  \nalso\n\n1 The United States of America, the Russian Federation, and the United Kingdom of Great Britain and Northern Ireland, reaffirm their commitment to Ukraine, in accordance with the principles of the CSCE \\[Commission on Security and Cooperation in Europe\\] Final Act, to respect the Independence and Sovereignty and the existing borders of Ukraine.\n\nso Trump must stop fucking victimblaming Ukraine",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "diamondjiujitsu",
            "body": "The Money spent of Ukraine goes into the US economy and we refresh out military. ANy weapons going to ukraine would have decommission fees. There are security assurances in the document. Take your MAGA clown shit somewhere else and hold up the agreement",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -5,
            "replies": [
                {
                    "author": "sbrisbestpart41",
                    "body": "The best for the United States usually means the government and its monopoly on violence. It rarely has to do with the citizens. We should have no allies in specific.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}