{
    "title": "The DOGE cuts",
    "author": "Ok_Mud_8998",
    "subreddit": "Libertarian",
    "rank": 19,
    "score": 76,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 76,
    "url": "https://www.reddit.com/r/Libertarian/comments/1j31nz3/the_doge_cuts/",
    "id": "1j31nz3",
    "selftext": "All of the cuts from DOGE won't mean jack shit if we don't see massive tax cuts, right? I mean, clearing excess spending is nice and all, and adds to national security in a sense because now the country can start paying off its debt... \n\n...but if all these cuts to services and fraud and waste don't lead to some recuperation of resources on our end, it means effectively nothing, right?\n\nI've been on the hook for student loans for fourteen years and I'm down to 25k, and having my taxes go down (fat chance) could potentially save me from misery. \n\nAnd if we got a lump sum \"return\" of cash due to tax cuts, would that not cause massive inflation?\n\nI'm skeptical as fuck. While I agree with the idea of cutting expenses, I'm really uncertain we'll see any benefit.",
    "comments": [
        {
            "author": "mountainguy83",
            "body": "So far from what I see, the DOGE cuts are not resulting in any reduced spending.",
            "score": 211,
            "replies": [
                {
                    "author": "jfmdavisburg",
                    "body": "They'll spend it on something else",
                    "score": 51,
                    "replies": [
                        {
                            "author": "mountainguy83",
                            "body": "Or same thing/service but on a contract (which will go up tremendously over time like Gov contracts always do)…",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "LoneHelldiver",
                            "body": "Better than spending it on propaganda from foreign media about how evil the US is right?",
                            "score": -8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ImTheBatman1939",
                    "body": "DOGE firing people doesn’t save anyone money. The departments still have the exact same budget, since it’s allocated by congress not the executive branch. And if those departments don’t have to spend money on personnel, they will spend it on something else to not lose their budget next year.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "International_Lie485",
                            "body": "1000 new tvs",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LagerHead",
                    "body": "![gif](giphy|AaQYP9zh24UFi)",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "karsnic",
                    "body": "Possibly because it has just started. You actually expect cuts to be made and spending reduced in a month? At least someone is actually addressing the problem, that’s  more action on it then the last 50 yrs.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "mountainguy83",
                            "body": "Hopefully you are right, but it seems like the plan for many of the so called “cuts” is to simply privatize yet still fund… that doesn’t seem like savings to me.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Parabellum12",
                                    "body": "Privatization is a main goal of libertarianism.",
                                    "score": -12,
                                    "replies": [
                                        {
                                            "author": "mountainguy83",
                                            "body": "Privatization that is funded by the government? Because that’s what we are getting.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Parabellum12",
                                                    "body": "Is it not a step in the right direction?",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "mountainguy83",
                                                            "body": "Not if they turn around and spend even more to private companies. I’m all for the cuts on things that are truly wasteful or fraudulent, but in large part that ain’t what’s actually happening. The money “saved” that’s being published is severely inflated (ex: contracts being terminated that are 90% obligated but they are showing the entire contract value as “savings”) and in many cases the money saved by firing a government employee will be immediately spent again on a contract - typically for a lot more money.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "8426578456985",
                    "body": "What are you talking about? [https://www.doge.gov/savings](https://www.doge.gov/savings)",
                    "score": -8,
                    "replies": [
                        {
                            "author": "hey_dougz0r",
                            "body": "Until Congress passes cuts through legislation that money is still spent as far as the US Treasury is concerned.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Janinator",
                            "body": "Their numbers are not accurate unfortunately. They include previously cancelled contracts that provided no savings in those numbers. They double and triple counted some items and misrepresented others. The true savings are closer to a 1/10 of their advertised number.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "BadPAV3",
                            "body": "I think the number will be closer to $5-700B when we're all said and done.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Unfair",
                    "body": "It doesn’t seem so so far but if they can actually cut spending and send out that ‘Doge Dividend’ the republicans wouldn’t lose again",
                    "score": -29,
                    "replies": [
                        {
                            "author": "fosrac",
                            "body": "A \"doge dividend\" is just giving inflation a shot of adrenaline...",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "BadPAV3",
                                    "body": "That's actually the point. They have to create intense inflation to mitigate the debt. It's one of the chair legs. You can't call your creditors to renegotiate the interest rate, but you can affect the value of the capital.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Unfair",
                                    "body": "Not if they actually cut government spending for real",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jahwls",
                            "body": "People forget that would take an act of congress.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Upper-Examination613",
                    "body": "They are getting rid of the national deficit first",
                    "score": -11,
                    "replies": []
                }
            ]
        },
        {
            "author": "libertyforall76",
            "body": "They want to raise the debt ceiling $4 trillion, so it seems like smoke and mirrors!",
            "score": 104,
            "replies": []
        },
        {
            "author": "tclass",
            "body": "DOGE is definitely going to be the pretense for the usual Republican tax cuts for their donor class.",
            "score": 39,
            "replies": []
        },
        {
            "author": "AlphaTangoFoxtrt",
            "body": "We're $36 Trillion in debt. We can't *AFFORD* tax cuts. The interest on the debt alone is $1T a year now, it's surpassed military spending.\n\nI would absolutely love tax cuts, but we cannot afford them. We need to pay down the debt to a manageable level. \n\nYeah yeah, I get it, you didn't balloon the debt so why should you be punished. You shouldn't. But the reality is that unless we get the debt under control, it's going to spiral out of control and lead to hyper inflation.\n\nWe didn't make the mess, but if it doesn't get fixed, we're the ones going to suffer.",
            "score": 13,
            "replies": []
        },
        {
            "author": "trustedbyamillion",
            "body": "I would be rooting for the debt to be paid off more. The consequences of default or currency devaulation is far worse than where income taxes are right now.",
            "score": 76,
            "replies": [
                {
                    "author": "Unfair",
                    "body": "Not if you have all your money in gold and bitcoin like every proper libertarian ",
                    "score": 13,
                    "replies": [
                        {
                            "author": "trustedbyamillion",
                            "body": "![gif](giphy|NJlMya8d3RNCw)",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "ourstupidearth",
                            "body": "It's too bad I don't have either of those things. Not even sure what they are.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "John_Johnson_The_4th",
                                    "body": "You don't know what gold is?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ourstupidearth",
                                            "body": "Nice try IRS, I've never heard of it.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "robtimist",
                                                    "body": "And we lost our bitcoin together in that boating accident last summer, remember?",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConsiderationNew6295",
            "body": "Your taxes and my taxes will likely go up. The people in the club will enjoy tax cuts.",
            "score": 39,
            "replies": []
        },
        {
            "author": "OriginalSkyCloth",
            "body": "Just stop robbing me and future generations for your ease. It’s irresponsible and unethical to deflect responsibility for our lack of tough times to others. Tough times are here, and way overdue. Kick the can down the road some more if you hate responsibility. ",
            "score": 29,
            "replies": []
        },
        {
            "author": "spongebobish",
            "body": "The doge cuts are going to do rat shit about tax cuts. It's saved precisely the equivalent of one cup of coffee from any individual's yearly tax. There is not going to be a lump sum of cash. The only thing it's doing is increasing uncertainty which is horrible for the free market. I think everyone agrees that there needs to be cuts to increase government efficiency but it's obviously only being done to spread censorship and the trump agenda, and not being done through the correct channels which adds to the uncertainty. I guess good news for you is [interest rates are going down](https://www.nytimes.com/2025/03/03/business/treasury-bond-yields-trump-economy.html?unlocked_article_code=1.1U4.xuhE.dS8y-mRdzYZz&smid=url-share).",
            "score": 55,
            "replies": [
                {
                    "author": "AthiestCowboy",
                    "body": "Eh apparently like $700 but yeah still just a drop in the bucket considering every tax payer is effectively on the hook for like $350k.\n\nMy biggest hope is that the left hops on board with the popularity and do their own cuts. Specifically in the pentagon.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "8426578456985",
                    "body": "What are you talking about? Stop watching CNN. It has literally been less than a few months so far. And what cup of coffee is $700? [https://www.doge.gov/savings](https://www.doge.gov/savings)",
                    "score": -9,
                    "replies": [
                        {
                            "author": "spongebobish",
                            "body": "The cup of coffee that is not $700 because I’m not an idiot who believes in all the lies.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "8426578456985",
                                    "body": "You're right. It is WAY smarter to believe the news instead of the line itemized list that is updated weekly and the news is refusing to even acknowledge exists because that means talking about it. Instead lets just pretend that poor kids in Africa are getting the food taken from their mouths instead of reading the itemized list.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "spongebobish",
                                            "body": "You mean the itemized list riddled with mistakes and misleading calculations? Yes I feel smart because I have critical thinking skills and common sense lmao.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "8426578456985",
                                                    "body": "First off, point to the mistakes instead of yelling into the ether. Secondly, I didn't say it was perfectly accurate. I said it is better than believing they are saving $7/person and that its all a scam. You are fully brainwashed in the exact opposite direction you are claiming I am and the fact that you can't see that you are exactly as bad as me is ironic.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "spongebobish",
                                                            "body": "Tell me your tax bracket and I’ll calculate how much it’s saving you😂😂. I’ll even use the amount the doge website claims they saved.",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "mimsy2389",
                                                            "body": "https://www.nytimes.com/2025/03/03/us/politics/doge-musk-contracts-wall.html",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "saintex422",
            "body": "If they cut taxes then the doge cuts would be meaningless lol",
            "score": 12,
            "replies": [
                {
                    "author": "diagnosedADHD",
                    "body": "Yup. That's how I feel, even if my taxes are cut from this or I get a check from all of this it doesn't really matter when the deficit is the same or worse. It just means there are going to be many dysfunctional/understaffed government services, which was already the case for a lot of departments.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "saintex422",
                            "body": "Promises made. Promises kept!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "OpinionStunning6236",
            "body": "I would just love to see a balanced budget for even just a single year before we cut any more taxes. I’m almost 26 and I’ve never been alive for a year when we didn’t add to the debt",
            "score": 21,
            "replies": []
        },
        {
            "author": "Classy_Mouse",
            "body": "Sure. If I am massively in debt and continuing to spend beyond my means, what good is cutting down on my spending if I don't also cut down on my hours worked (and therefore income).  \n\nThis is short-sighted. Cut down the excess spending and pay off the debt. Now we have more to spend because we don't have interest to pay. Then we can discuss significant tax cuts.  \n\nIt is unfortunate we are where we are, but wishing that lowering spending means lowering taxes ignores the reality that past overspending has put us in.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Valuable-Jump-7887",
            "body": "You’re only getting a tax cut if your in the top 1%, everyone else’s taxes are going up.",
            "score": 8,
            "replies": []
        },
        {
            "author": "CornPop71T",
            "body": "I'd love to see a flat tax overall.",
            "score": 16,
            "replies": [
                {
                    "author": "TManaF2",
                    "body": "While it is arguably the fairest way to tax, it is also the least equitable. A progressive tax on income, with no loopholes except for maybe the high cost of care for people with severe-and-expensive disabilities, is arguably more equitable. \nOne issue we, as libertarians, tend to ignore is that of equality versus equitability in the calculation of fairness and justice, hoping that other people's altruism will overcome market and genetic/environmental inequities. (That said, I don't trust politicians to be anything more then crony capitalists looking to enrich their own pockets at everyone else's expense, and I don't know of any IRL society that is, or has been, economically classless, and has been able to survive for more than a generation. Most societies that appear to be classless and resource-unlimited in science fiction and fantasy turn out to be fueled by an underclass that creates the major tension in the work.)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ed_Radley",
                            "body": "The biggest problem recently has been that people are living longer, but that also means the people at the top of certain businesses (and some at the bottom) aren't leaving their jobs to retire for one reason or another: benefits like health insurance at least until Medicare kicks in, the need for control over something you built, a (perceived) lack of interested or competent replacements, you get the idea. Because of this, people who should be moving into positions of power or influence aren't and all the wealth that's accumulating at the top is doing so because nobody else is being given the opportunity to take the reigns until it's too late.\n\nSome people are also choosing professions that don't allow for the kind of upward mobility that's necessary to go from lower class to the upper class in society. We as a society have turned to education too much as a way of delineating this pathway up to the point it no longer functions that way.\n\nWe really need a way to incentivize C-suite workers for S&P 500 companies, possibly even all the way down to the Russell 3000, to retire by 65 and if they need work to occupy them, they take on executive roles for non-profits with a reduced salary. Other clear career paths with defined term lengths and responsibilities outlined within them would likely also help as long as everyone being moved up was competent, everyone getting passed over for certain promotions eventually reached some other valuable position that can afford a living wage, and the very bottom is left for people in transitional stages of life (entering the workforce, relocating, or end of life but still needing a purpose)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Minnesota_Bohemian",
            "body": "We are so far behind on the annual budget that doge will never be able to cut enough to make up for it. Plan on paying income tax for the foreseeable future.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Leaning_right",
            "body": "A 'lump sump' return, on taxes paid won't cause inflation the same as tax refunds don't cause inflation. Since the money is a refund, and just prepaid taxes. \n\nThe same as giving $100 bill for something that costs $75, the lump sump is essentially just returned change.\n\nInflation is from debt spending, when they just create new money and devalue the dollar.\n\nAlthough, the debt limit going up by $4trilly is inflationary.",
            "score": 3,
            "replies": []
        },
        {
            "author": "highlightway",
            "body": "You have it the other way around, tax cuts without spending cuts don't mean anything. But spending cuts without tax cuts still means less inflation.\n\nThat is, if any significant spending actually manages to get cut.",
            "score": 3,
            "replies": []
        },
        {
            "author": "rendrag099",
            "body": "This is why I think nothing will come from this DOGE stuff... because all the money that will be saved will simply be spent in other ways when what we need is a budget surplus to start paying off this debt. The reality is we need to gut spending *and* raise taxes across the board. **Everyone** will need to pay, including people that haven't historically paid much or anything at all. And we the people have zero appetite to pay more in taxes, so politicians have zero reason to introduce fix the problem.\n\n>And if we got a lump sum \"return\" of cash due to tax cuts, would that not cause massive inflation?\n\nIf there is a commensurate decrease in government spending then they offset, so no inflation.",
            "score": 3,
            "replies": []
        },
        {
            "author": "heatY_12",
            "body": "Haha and the smoke begins to clear",
            "score": 4,
            "replies": []
        },
        {
            "author": "Shelif",
            "body": "The reduction in expenses have turned into tax reductions for the rich",
            "score": 15,
            "replies": []
        },
        {
            "author": "Im-a-bench-AMA",
            "body": "Its actually *worse* than nothing, they make cuts, and they keep the same tax rate, and then we get *less* from the government for the same amount of tax dollars.",
            "score": 12,
            "replies": [
                {
                    "author": "flynnparish",
                    "body": "With government, you are always getting less.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Im-a-bench-AMA",
                            "body": "Its a sad ongoing running theme with no change in sight, im sure we both wish it was different. Cheers though, glad to see someone that shares that view",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Im-a-bench-AMA",
                            "body": "Its a sad ongoing running theme with no change in sight, im sure we both wish it was different. Cheers though, glad to see someone that shares that view",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "matt05891",
                    "body": "Not increasing and actively lowering your debt is not worse than nothing. It's actually the very best outcome.\n\nIf tax cuts come right now, for anyone, then it truly is worse than nothing. We need to strengthen (save at this point) the dollar, which will all happen faster without cuts, and then we can cut.\n\nNot that I expect what's needed to be done to actually happen of course.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Im-a-bench-AMA",
                            "body": "Did you not see the budget that was passed by the GOP in the senate recently? Despite all the cuts to govt programs, there were huge tax cuts to the rich and we're operating at an even deeper deficit than last year, plus those tax cuts didnt hit mine or your wallet, its only for the richest people in US society.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "djhazmatt503",
            "body": "Clinton did a lot of the same stuff.\n\n\nhttps://clintonwhitehouse5.archives.gov/WH/Accomplishments/eightyears-02.html\n\n\nI know that for the following years, stuff was cheap and jobs were abundant. But correlation causation yadda yadda.\n\n\nI truly do not like any politicians, but if the uniparty is arguing over budgeting (and not which war to partake in), I'm not exactly mad.",
            "score": 6,
            "replies": [
                {
                    "author": "BadPAV3",
                    "body": "Correction, Bush 41 planted the seeds, Clinton collected the harvest.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ThinInvestigator4953",
                            "body": "Couldnt you say the same about Trump 2016 collecting Obamas harvest? or even trump 2020 collecting bidens?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RussColburn",
            "body": "In order to not sink the economy short term, some percentage of the cuts will need to be returned in tax cuts. I think President Trump has recommended 20% returned to tax payers, 20% to directly to the debt, and the other 60% would cut the deficit. Whether this would be enough - I don't know. Plus, paying down the debt while you tack on more to the debt is counter productive - he probably should just give us 25% and get the budget to balance (or as close as possible) with the rest.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RepresentativeStar44",
            "body": "Reduces inflation rates by having the government create less money through the federal reserve. Please don't reply if you have no understanding of the financial system.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mastiffmory",
            "body": "It won’t be a tax cut. It should help taxes pay down the debt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "abr0414",
            "body": "I said it in another thread, DOGE isn’t about tax cuts or even finding efficiency at all. The problem with the right is that they’d cut their own finger off if it would spite the left (the right includes many libertarians as well) and that’s their number 1 desire no matter what they say.",
            "score": 1,
            "replies": []
        },
        {
            "author": "International_Lie485",
            "body": ">And if we got a lump sum \"return\" of cash due to tax cuts, would that not cause massive inflation?\n\nNo, the money was going to be spend in the economy paying NGO executives $500,000 salaries.\n\nInstead of climate change ,tansrights or plastic straws grifter buying another mansion you get your money back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zombielicorice",
            "body": "Well it is a win to cut government spending regardless. Especially the spending that goes towards media collusion, institutional corruption, and tedious bureaucracy that makes our lives measurably worse.",
            "score": -5,
            "replies": []
        },
        {
            "author": "brando79az",
            "body": "So far, this cleanup seems to amount to payoffs for any single politician. How is Pelosi so hood with stocks anyway? \nI'm glad this money was found but it won't mean anything on its own.",
            "score": 0,
            "replies": []
        }
    ]
}