{
    "title": "Living in the the UK feels like a game of monopoly, i own nothing and owe everything.",
    "author": "Frosty-Meet6245",
    "subreddit": "socialism",
    "rank": 332,
    "score": 203,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.reddit.com/r/socialism/comments/1iofsuk/living_in_the_the_uk_feels_like_a_game_of/",
    "id": "1iofsuk",
    "selftext": "Just a little insight to my life, I'm 21, i live in a relatively rural area in the north of England. it just feels to me that in order for me to even exist it just costs so much money. like senseless amounts of money just going to rent, paying/running/maintaining a car and just the bare necessities. I'm also a uni student and i work part time (all why living in an area that's got a lower cost of living).\n\nI feel like im losing when all i see is people talking about how all these people coming over are ruining the country but how isn't it obvious that most of the major issues we face now are just the result of so many of our governments selling off all public utilities, abysmal investment into any public infrastructure (besides more roads) and a complete disregard for basic economics.\n\nWhy are a small number of people making a massive profit off of the bare necessities that we all need to exist. its unbearable to me that there's a small number of people essentially draining all the money out of our pockets just so we can turn on on the taps or have a roof over our heads, or turn on the lights and worst of all just so we can eat.\n\nHow can so many politicians sit back and watch as everyone is being pushed into destitution?\n\nSupermarkets are making massive profits year on year and yet prices have yet to fall.\n\nHow can i participate in this economy if all my disposable income is just used to simply exist? i have to live frugally just to get by and i can't imagine that's gonna change all that much as life carries on. ill hopefully get a decent paying job from my degree(software engineering) but yet again I'm gonna be bankrupted by rent costs, travel costs, paying back my uni loan for the rest of my life, amongst other taxes and payments i have to make just to live.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_Midnight49",
            "body": "> why do so many politicians sit back and watch as everyone is being pushed into destitution. \n\nBecause the politicians are in billionaires/elites pockets. \nFund their campaigns. \n\nAn increase in corporation tax half a century ago would been seen as normal. Nowadays it’s unheard of. \n\nI am disappointed there isn’t a true Socialist party in the UK anymore. if the greens rebrand to be more about people instead of the environment I think they would gain momentum. \n\nFor what it’s worth I do care about the environment but putting that first as your politics would turn people off.",
            "score": 51,
            "replies": [
                {
                    "author": "Frosty-Meet6245",
                    "body": "I don't think their ever will be a true socialist party simply cos British people are so against being outspoken and going against the establishment. its seen as improper to protest and stand up for what you believe in, were just taught to get on with it.\n\nwe also need electoral reform voting for anyone but labour is essentially the same as voting Tory/reform. We wont ever see any political change in my lifetime while ever the voting system is the way that it is.\n\nI do think my generation is a lot more politically aware but no one acts on it.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Mr_Midnight49",
                            "body": "I do think you’ll be surprised in all fairness. \n\nCorbyn got more votes than Starmer but the media labelled him a terrorist sympathiser. I do wonder how many realise they had the wool pulled over their eyes.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Frosty-Meet6245",
                                    "body": "its terrible what they did to Corbyn, from what i understand he want to a rally for Palestinians right? and im assuming thats what they used to make him out to be a terrorist sympathiser.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "FeelingMassive",
                                            "body": "He was criticized for meeting with Gerry Adams and other Irish republicans at a time when the IRA was still active in violent campaigns. He advocated for dialogue with Sinn Féin and supported a united Ireland which obviously went against the status quo.\n\nHe also defended the ANC and Nelson Mandela when Thatcher labelled them as a terrorist organisation, and was an active part of the anti-apartheid movement back in the 70s.\n\nHe was right about South Africa, he was right about Ireland and he's right about Palestine.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Frosty-Meet6245",
                                                    "body": "yeah it would seem that he has always been pm the right side of history and yet he's been pushed out by the establishment, its ridiculous",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Effective-Zebra-758",
                            "body": "Even when the establishment is squeezing you to death? That's so backwards. Have loyalty to people, not to corrupt governments.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Socky_McPuppet",
                    "body": "> Because the billionaires/elites are in their pockets. Fund their campaigns.\n\nYou have that backwards. The politicians are in the pockets of the billionaire elites.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Mr_Midnight49",
                            "body": "Apologies thats what I meant.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CulturalImagination",
                    "body": "Feels like Greens get shit from both sides - we get called Tories on bikes and middle class NIMBYs by the left, or tofu eating eco freak socialists by the right. If the Greens could connect better with working class folks, they could be an actually somewhat successful left of Labour party",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "InspectorRound8920",
                    "body": "If you used environmentalism to push for better jobs, for example, or cheaper electricity, then yes, it would work.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Mr_Midnight49",
                            "body": "I think any party should do that, im not saying greens should change any of their policies (maybe nuclear disarmament - definitely not the right time) I just think labelling itself as an environmentalist party might make it harder to convey want they also want economically and politically. \n\nRegretfully a lot of people think environmentalism is a scheme to oppress workers.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Frosty-Meet6245",
                                    "body": "i agree its not the right time for nuclear disarmament, its a very unpopular policy and it would be foolish. \n\nid also like to say, because of how the voting system works over here you cant just make a new party that represents you and others that are like you. you have to vote for the best of a bad bunch. Its utterly terrible, were basically forced to vote people into power that only marginally represent what we believe in because the rest of the parties  either would completely annihilate this country or be a wasted vote.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "pooshpeach",
            "body": "It’s really tough out here. \n\nI’m 6 years post uni - also from a low income area. I did everything right, studied hard, got good grades, worked a part time job from the age of 16, graduated with a first class degree from uni but still it just feels extremely difficult just to live.\n\nIt’s even more frustrating when the general public and politicians are more concerned about shouting about culture wars than actually improving the quality of life for us Brits.\n\nIt’s a shame. You’d think that everyone would be more angry at those in charge as opposed to those who are escaping war (most likely cause by us).\n\nI just remain sickely positive that the baddies can’t win and it’s only that delulu that keeps me going 😢😫",
            "score": 16,
            "replies": [
                {
                    "author": "Frosty-Meet6245",
                    "body": "it feels like were sold a lie, go to uni take on a large amount of debt, get a job for a decent wage then spend all that wage consuming things that were almost forced to(without it wed really struggle to get around in this society). \n\nit is very frustrating how people are so easily misled by the media, people don't realise the media are no longer for them but for the rich. its sad to watch people get radicalised by Reform and the likes. But again its a institutionalised issue, people aren't taught how politics works in school, they're taught about how First passed the post works but that's almost the extent of it. Obviously they can go on and learn more at college and Uni but that's by choice.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "pooshpeach",
                            "body": "We absolutely are. I think the real winners are those who didn’t go into higher education - although I think we benefit culturally and personally from university (and the networking aspect). But the debt, the time spent in education is time spent not gaining experience.\n\nThat was the real kicker for me post graduating, any role related to my degree didn’t want a fresh graduate and graduate schemes were basically minimum wage for maximum hours (with rubbish day to day tasks). \n\nI ended up working in a tile shop for the first 6 months after I graduated and then I was hit by covid/lockdown in the March.\n\nIt’s been beyond tough and there hasn’t been any consideration for those under 30s whose lives were paused in covid and made dramatically worse in the rise in cost of living.\n\nEven that phrase is wild. \n\nCost to Live.\n\n😩",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Frosty-Meet6245",
                                    "body": "Yes this is my exact issue at the moment, I'm thinking of dropping out of uni in exchange for apprenticeships. all the benefits uni offers doesn't out way the costs of it nowadays. its terrible really cos i enjoy uni and it is a truly great experience in terms of education and just exposing me to a wider array of cultures and people. \n\nfor what i wanna do i can get a level 4 apprenticeship and then work my way up to degree level while earning a little bit below a graduate and not having to worry about my student debt tax(lets be real its a tax cos no one is ever gonna pay it off while ever it accrues interest).\n\ncost of living! again its so strange how noone questions that the very things that we need just to live have been commodified i mean just look at the wellness industry, day after day i keep seeing people buying products that you wouldn't need to take if people had the time to take care of them selves (eat healthy foods/exercise live a less sedentary lifestyle etc). its so hard to maintain a healthy standard of living while trying to keep up with the ever moving wheel that is capitalism. if we stop for a minute were left behind and its so hard to catchup \n\nheathy foods and going to a gym is a massive cost, fruit and veg in terms of price to calorie ratio are so so much higher then anything you find on a snack aisle in a supermarket.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "JayFv",
                                    "body": ">  there hasn’t been any consideration for those under 30s \n\nIt's no better for millennials.  We got the \"once in a lifetime\" crash in 2008 that disproportionately hit us.  We got hit by covid just as much as everybody else and we're now on track to be the first generation to die poorer than their parents since pre-Industrial times.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FeelingMassive",
            "body": "Ironically (or not?) Monopoly was invented to demonstrate the evils of capitalism.\n\n[Elizabeth J. Magie Phillips](https://en.wikipedia.org/wiki/Lizzie_Magie) (née Magie; May 9, 1866 – March 2, 1948) was an American game designer, writer, feminist, and Georgist. She invented *The Landlord's Game*, the precursor to *Monopoly*, to illustrate teachings of the progressive era economist Henry George.",
            "score": 14,
            "replies": [
                {
                    "author": "Frosty-Meet6245",
                    "body": "Darrow's ability to claim the game as his own and receive credit for it wasn't because of his creative talent, but because he was able to navigate the system—financially, socially, and legally. It's really sad how that she never got the recognition for her idea, although i doubt she would've appreciated it all that much given that it misused and twisted just to make a profit",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "SSuperMrL",
            "body": "Hopefully Jeremy Corbyn can start his own party soon.",
            "score": 5,
            "replies": [
                {
                    "author": "Frosty-Meet6245",
                    "body": "i really hope so too!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Betelgeuse96",
            "body": "Thanks for sharing. I didn't realize it was that bad over there too.",
            "score": 6,
            "replies": [
                {
                    "author": "Frosty-Meet6245",
                    "body": "yes the uk is quite bad at this point, id say its not as bad as the United States but overall its slowly approaching a similar situation.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "msproject251",
            "body": "The supermarket owners seem to love Starmer even before he was elected: [https://www.theguardian.com/politics/2023/feb/25/lord-sainsbury-returns-to-the-labour-fold-with-2m-donation](https://www.theguardian.com/politics/2023/feb/25/lord-sainsbury-returns-to-the-labour-fold-with-2m-donation)",
            "score": 3,
            "replies": []
        },
        {
            "author": "GustappyTony",
            "body": "At 23 I’ve found myself slowly losing my motivation to keep up with society and the games it plays. It feels frustrating to live in such a passive country that just accepts this status quo as not to inconvenience themselves, but I’m sick of it. Is this what life is? Working for someone else’s gain for the rest of my life? To put all my earnings into somebody else’s pocket just so I can survive? Going into an enormous amount of debt just so I can have a slightly better chance than everyone else at finding higher paid work? \n\nWhat’s the point in this? Everything is ran on profit, everything runs on money and consumption and it feels like it’s just gradually grinding me down. I look around and I either see people fine to live this status quo or people who believe the reasons their lives are so bad is because of minority groups and refugees. They’re all so blind to what’s happening and it terrifies me. \n\nI’m not saying any of this in the sense of wanting to live a lazy and cushy life free of charge. But I want to live with more meaning than just survival, and I want to live for myself. This system doesn’t support that, and I’m not convinced I’d be able to live comfortably outside of it. \n\nI’d consider myself to be privileged to have a job and to live with my parents, there’s people out there who don’t have either of those. But I think it’s also providing me more insight into why I’m so tired of life. I’m working a job to save money so I can move out, but to find work and affordable living feels so impossible. And to think that the company I work at will likely make people redundant to save costs instead of taking pay cuts from those who run it just angers me. Everything is just so selfish and inherently wrong, and I feel like everyday we’re living in a nightmare of a world that’s run on a system that shouldn’t exist, for it will never have our benefits in mind. Only the rich and powerful",
            "score": 3,
            "replies": []
        },
        {
            "author": "Anti-Nazi-Defense-Ed",
            "body": "Hey comrade. I'm sorry you're going through a tough time. I hear that England is really poor outside of London. Most of the US is very much the same.\n\nFor your own well-being and future, I would highly advise you to leave the UK for a country that has not been 110% captured by capital. I know you're worn down and tired, but you will need to find it in yourself to pick up a part-time job and/or side hustle, do nothing but work for ~6 months, save every penny you can, and then set off to embark on your life and all of the possibilities and potential that comes with that. \n\nThe few months of grinding away will be worth the lifetime of happiness and security you have in your new life.\n\nGood luck and stay safe comrade.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bistolegs",
            "body": "It gets more bleak for you im afraid.. softwear enginer is a job that can and will be taken by AI. Ive got frends who have been in the industry since its inception. They are all feeling this.",
            "score": 1,
            "replies": []
        }
    ]
}