{
    "title": "Question for germans and people who followed the election: are you happy with the result?",
    "author": "LennyTheOG",
    "subreddit": "socialism",
    "rank": 158,
    "score": 61,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/socialism/comments/1iwzb10/question_for_germans_and_people_who_followed_the/",
    "id": "1iwzb10",
    "selftext": "I mean obviously die Linke was already projected to do well and it arguably could’ve done even better, but I still think it‘s awesome that they were the strongest party in the 18-24 age group and that they had historic high numbers. I also love that the FDP fell out of the Bundestag but my main question is about the BSW. Like in theory they should be great since they originated from die Linke but I always hear negative stuff and that they are right wing on some issues. My question is, are you happy that they seemingly didn’t make the bundestag. And why are they bad? And generally what are your thoughts?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fal0ters",
            "body": "Nothing will fundamentally Change in Germany after this election. The CDU and SPD will form the government and will do Business as usual. The fact that the FDP didn't make it in the Bundestag is a W for all workers in Germany. \n\nThe BSW has some correct positions but they also talk about migration being bad for german workers. That's why I'm glad they also didn't make it in the Bundestag.\n\n\"Die Linke\" has its problems but I’m confident that they find the correct line through struggle within the party.",
            "score": 65,
            "replies": [
                {
                    "author": "Darksunshineme",
                    "body": "Germany will only fundamentally change after 20 or so years, when people above the age of 50 years old from last century stop being the majority of the votes.\n\nThat is why democracy has the nickname of \"Dictatorship of Majority\". And it makes Germany a kind of Gerontocracy.\n\nI wish people were more aware and educated for alternative political systems beyond representative democracy and Dictatorship of a man or a party, like the conciliation system.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "EgyptianNational",
                            "body": "They have been saying this about every country since the 80s at least. \n\nCheck the voting by demographics in Germany gen X (42-50) is increasingly right wing and voted in high margins towards the AFD.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Darksunshineme",
                                    "body": "My mistake. I didn't think conservative government, even the more extreme one, as a fundamental change.\n\nIt is a huge change, but in my view it is only the worse (extreme) version of today's fundamental.\n\nIf it is not the case I am willing to learn.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "EgyptianNational",
                                            "body": "What I’m trying to say is that waiting around for people to become more progressive simply does not work. \n\nA lot of the queer rights in the US (for example) came attached to increased policing of black communities and militarization of police. Arguably as a cover. \n\nI imagine the democrats will come out with a “we are pro trans as long as those trans people hate Arabs/muslims” narrative soon. \n\nOne step forward two steps back with liberals, always.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Darksunshineme",
                                                    "body": "Oh... I totally agree with you. But I don't think the old generation has such plasticity to change. The US has more young people and Americans are less scared to changes, but it has been generations that Americans have not been able to vote for fundamental change. Specially because of industries lobby and other powers.\n\nAnd in the US there are a lot more radical left groups doing grass-root work, which is where people are more effectively educated. Germans, even the ones who consider demselves leftists, are not that active to grass-root work. Even the groups trying to help individuals do by the means of government rather Tham their own means.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "staedt3r",
            "body": "As far as my understanding goes the BSW drew a lot (around 200 members) of the most problematic characters from DieLinke away and has since then embraced a mix of left- and right-wing populist positions. E.g. the majority of the BSWs MPs voted with the CDU and AFD in that fateful vote about the \"Zustrombegrenzunggesetz\".\n\nSo they are not a party that any real leftist could full heartily support. And even their main argument is that they will siphon votes away from the AFD has not worked out and only further moved the overton window to the right.\n\nSimultaneously it resulted in a much less divided DieLinke which now for the most part is quite united in a strong left progessive anti-capitalist consensus, which resulted in more than 20000 new members since the split.\n\nAnd one last thing I want to say is, that now after the Election and with the results now tallied: If the BSW would have entered the Bundestag, it would have resulted in the necessity (because of electoral math) for a coalition between CDU, SPD and Grüne which would have been much less stable than the projected GroKo (great Koalition between the CDU and SPD). Most likey that would have resulted in more stagnation while the likelihood earlier new election would have been much higher. Now the old and once big centrist \"Volksparteien\" will be collectively in charge for the next 4 years while the progressive partis and the fucking nazis will be in the opposition.\n\nThat is kind of the best possible outcome while still being very dangerous and I myself see clear parallels between our time and the \"Weimarer Republik\". And we have to defeat the fascists unless we want to repeat the past.\n\nOne final thing. That the FDP was thrown out the parliament is the one and truly great outcome of last nights election and was truly deserved. \n\nFuck them! If the Election would have been held half a year later as was the normal date, my guess is, that more people worldwide would have been appalled by the state of the world and I hope fascism will become more unpalatable the more the USA further devolves into an authoritarian hellhole .",
            "score": 27,
            "replies": [
                {
                    "author": "LennyTheOG",
                    "body": "thanks for the insight, I never really understood the background of the BSW, this helped. Honestly hopefully y‘all will do better in these upcoming years but my guess is that, with how much the general politics have shifted to the right, (even from SPD/Grüne) Things will get even worse for germany. And since the AFD can always claim to be the „true solution“ because they‘re not a part of the government, they will continue to grow. I wouldn’t be surprised if the CDU will loose votes in a similar quantity as die Grüne/SPD did this election and that the AFD will be the strongest party soon. Best wishes from switzerland",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Death_and_Gravity1",
            "body": "The schadenfreude of Die Linke coming back from the grave to hit nearly 9% while the red/brown adjacent BSW failing to meet the 5% minimum threshold is definitely something.\n\nI'm trying to focus on that cause everything else is a little bleak. Sure 80% rejected the AfD, but that still means 1 in 5 Germans are ok with fascism. A CDU/SPD coalition is not a recipe for change, and if conditions continue to worsen the fascists can benefit.\n\nBut for now there's real momentum behind the left, so that's something",
            "score": 21,
            "replies": [
                {
                    "author": "Iasalvador",
                    "body": "And how many of cdu and fdp voters could join then",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "wicked_pinko",
            "body": "This election was never really about more than who we were going to be fighting for the next four years. It does allow for some analysis though:\n\n\\- Among the 18-24 demographic, the AfD, Linke and BSW got a combined 51%. While these parties differ greatly in their policies, they all ran on the premise that there is something fundamentally wrong with the way this country has been run for at least the last 30 years. This shows that many young people are not happy with the self-appointed \"democratic center\" of CDU/CSU, SPD, Greens and FDP. Unfortunately, many of them are flocking to the AfD, but the Left Party has clearly managed to convince many of those who oppose fascism that their more radical solutions (in rhetoric at least) are the best antidote to fascists. The radical left can use this by showing these people options to the left of the Left Party and getting them organized against fascism and the capitalist system from which it arises.\n\n\\- Right-wing politics has become very popular with a lot of people and the radical left needs a credible counter-narrative. While the Left Party enjoyed quite a success, the biggest winners of the night were the AfD, who have been very publicly shown to be deeply connected to some of the worst fascists in the country, and the CDU/CSU, who have made a turn to more openly right-wing rhetoric since 2021. They won over half the votes in an election with the largest voter turnout since 1990. The issue on which they won is migration and religious fundamentalism, partly because the left has no credible policies on these topics. Immigration to Germany will continue to happen, the left ought to embrace that rather then deny it, and religious fundamentalism (not just in the Muslim communities the right likes to point at, but across all religious groups) is a growing issue that requires some left-wing answers instead of brushing the topic aside.\n\n\\- Finally, the radical left can learn some things from the Left Party, most importantly that the concept of \"verbindede Klassenpolitik\" (unifying class politics) works. It may also be worth it to strengthen the presence of the radical left in online spaces to show young people an alternative on the left. Finally, it remains of vital importance to be engaged in our communities and run campaigns especially on the social issues faced by many. The return of the not-so-grand-anymore grand coalition is bound to create even more resentment towards the two parties that have been in government almost constantly over the last 20 years, we can build on that.",
            "score": 14,
            "replies": []
        },
        {
            "author": "wicked_pinko",
            "body": "I'll answer your BSW question seperately: I don't value them all that much. It would've been interesting to see them in the Bundestag as a party openly in support of Palestine and strongly opposed to the war in Ukraine, but that's about it. Their socio-economic policies are basically on par with the SPD or CDU/CSU and their policies on trans people and climate change are outright abysmal. The Left Party has thankfully taken a clear stance against the war in Ukraine and in support of negotiations, and while some of their members aren't great on Palestine, some of their Bundestag members are solid, especially Ferat Ali Kocak, who entered the Bundestag by winning the Berlin-Neukölln district after running a fantastic campaign and has been very openly pro-Palestine for a long time. Ultimately, I think we're better off without the BSW in the Bundestag, especially given that them entering likely would've meant a coalition of CDU/CSU, SPD and Greens being the only viable government without the AfD and while a small accelerationist part of me wants to see that, the more rational side of my brain knows that such a government would probably boost the AfD to over 30%.",
            "score": 7,
            "replies": []
        },
        {
            "author": "MayhapsJane",
            "body": "I guess it could have been overall worse. I’m personally happy the BSW is out. They might have once been part of the Linke but the BSW is just a Populist Pro Russian and Anti Woke Organization.",
            "score": 9,
            "replies": []
        },
        {
            "author": "bittersweetslug",
            "body": "I'm just happy for Die Linke, as for the AFD, while worrying, I think the CDU/SPD goverment will keep them in check, as a coalition they're simply too moderate to be confortable with the more hardline righwingers",
            "score": 2,
            "replies": []
        },
        {
            "author": "jacquix",
            "body": "Merz is a hardline economic liberal, meaning he's likely to increase reforms to slash whatever is left of government operated programs and turn them into agencies of private economic interest, contracted by the government, like the unemployment office or federal railway transport. The social democrats are more ( but still barely) useful when they're in the opposition, since they'll most likely be part of the government coalition again they'll do what they do best, which is betray working class interest. Linke is at best a minuscule counterbalance to ruthless austerity, they won't have much power to do anything, since most parties agree on core issues. BSW are a farce, unprincipled populists who aren't ashamed to appeal to reactionary lumpenproles. Their presence in the Bundestag would've been essentially a waste of seats.\n\nBusiness as usual, people keep voting against their own material interests, class consciousness is a rare thing, Germany stinks as it usually does.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -6,
            "replies": [
                {
                    "author": "LennyTheOG",
                    "body": "Idk I have to disagree with some of that, I don‘t think what die Grüne did was in any way shape or form positive. I think you should never throw marginalized groups under the bus to make a certain coalition possible. Die Grüne used to be a „progressive“ party, nowadays I don’t really see any difference to the CDU or the SPD. Die Linke is atleast great at most stuff that they advocate for and even tho I don‘t know their exact position on russia, you germans have to accept that the ukrainian fate is and never was in your hand. Obviously I‘m not in favor of the Burgerreichs fascism and how they will exploit Ukraine, but that was always something that was going to happen eventually. No matter what you do, Ukraine will become an unlivable 3rd world country and most people will flee west. Not just because of the war but also because of all the IMF loans and all the national resources they sold. Not voting for die Linke and voting Grüne won‘t change that",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Any-Hovercraft-516",
                            "body": "The war with Russia is simply too much of an issue. Sacrificing immigrants was in no doubt very painful for them, but ultimately the right choice. I disagree that Ukraine's fate is sealed. Militarily Russia is suprisingly weak, especially when it comes to logistics. Giving the Ukrainians access to advanced missile technology would allow them to strike military installations in the heart of Russia, greatly reducing battlefield effectiveness. Weapons distribution can make a difference.\n\nAbandoning Ukraine would hurt way more people in a way more serious way eventually. And it would give way to a ruler that's supporting authotarian regimes and parties like AfD worldwide. While my heart goes out to the Linke, they are simply too naive and idealistic to make such a hard decision. They live in Lalaland when it comes to defense. Which I understand, I'd rather have it we wouldn't have a military at all. But that choice has been made for us already.\n\nPolitically die Grünen are not comparable with CDU/CSU at all. That should be obvious. They have much different stance on equality, worker's rights, consumer rights, animal rights, environmental and climate issues, bureaucracy and tax reforms. SPD is corrupt to the core and cannot be trusted.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LennyTheOG",
                    "body": "and that’s not even to mention that die Grüne fundamentally supported a genocide, which is far worse than any of the positions from politicians of die Linke",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Any-Hovercraft-516",
                            "body": "That's true. Other than CDU and SPD I can at least see them backpedal on that matter though. Against wide resistance they already blocked weapons delivery to Israel due to concerns about the law suit by Nicaragua, accusing Germany of aid to genocide.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "socialism-ModTeam",
                    "body": "Hello u/Any-Hovercraft-516!\n\nThank you for posting in r/socialism, but unfortunately your comment was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.\n\n\n\n- r/socialism's mod team.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}