{
    "title": "Capitalism kills 745,000 people every year. That's 15-20 Million in the 21st Century alone.",
    "author": "Frequent_Okra_5721",
    "subreddit": "socialism",
    "rank": 4,
    "score": 565,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 26,
    "url": "https://i.redd.it/098czje97tme1.jpeg",
    "id": "1j3w7j5",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "geekmasterflash",
            "body": "Capitalism kills far more than that per year. This is just literally working to death, there is also the avoidable excess deaths from starvation, lack of medical treatment, etc, which can be attributed directly to commodification, profit motivations, exploitation and pollution of the global south, and artificial scarcity.\n\nCapitalism kills 20 million a year, give or take.",
            "score": 100,
            "replies": [
                {
                    "author": "ryuch1",
                    "body": "Not to mention western imperialism, profit motivated genocide, political dissident massacres, ethnic cleansing, undocumented migrant concentration camps, etc. etc.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Hateitwhenbdbdsj",
                    "body": "20 million is a big number, and I wouldn’t be surprised if it was true, but how’d you arrive at that? Are there any studies examining how many capitalism kills?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "emteedub",
                    "body": "and they love to have people focused on GMOs, abortion, vaccines etc",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Reditoonian",
            "body": "It kills also the souls and passions of the living.",
            "score": 18,
            "replies": []
        },
        {
            "author": "hmmwhatsoverhere",
            "body": "This is a vast underestimate.",
            "score": 11,
            "replies": []
        },
        {
            "author": "snarkyalyx",
            "body": "8 million starve every year due to capitalism.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Smittumi",
            "body": "Does this chart exclude China?",
            "score": 8,
            "replies": [
                {
                    "author": "Frequent_Okra_5721",
                    "body": "No, Western Pacific includes China.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Smittumi",
                            "body": "Not that helpful as a piece of propaganda. You'd have to get into a complicated explanation of why overwork deaths in China so prove the point.\n\n\nGood propaganda needs to be straightforward.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "snarkyalyx",
                                    "body": "Even the CPC says that China isn't yet communist or socialist. It takes a LOT of work to achieve that. Those deaths can still be attributed to capitalism.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Smittumi",
                                            "body": "They call it socialism with Chinese characteristics.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "AutoModerator",
                                            "body": "As a friendly reminder, China's ruling party is called Communist Party of China (CPC), not Chinese Communist Party (CCP) as western press and academia often frames it as.\n\nFar from being a simple confusion, China's Communist Party takes its name out of the internationalist approach sought by the Comintern back in the day. From [Terms of Admission into Communist International](https://www.marxists.org/archive/lenin/works/1920/jul/x01.htm), as adopted by the First Congress of the Communist International:\n\n>18 - In view of the foregoing, parties wishing to join the Communist International must change their name. Any party seeking affiliation must call itself the Communist Party of the country in question (Section of the Third, Communist International). The question of a party’s name is not merely a formality, but a matter of major political importance. The Communist International has declared a resolute war on the bourgeois world and all yellow Social-Democratic parties. The difference between the Communist parties and the old and official “Social-Democratic”, or “socialist”, parties, which have betrayed the banner of the working class, must be made absolutely clear to every rank-and-file worker. \n\nSimilarly, the adoption of a wrong name to refer to the CPC consists of a double edged sword: on the one hand, it seeks to reduce the ideological basis behind the party's name to a more ethno-centric view of said organization and, on the other hand, it seeks to assert authority over it by attempting to externally draw the conditions and parameters on which it provides the CPC recognition.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MajesticBread9147",
                            "body": "How the fuck is China \"West\" relative to Asia? Using \"western Pacific\" for East Asia and South East Asia for a neighboring region makes no sense",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hawmanyounohurtdeazz",
            "body": "isn’t it 10+ million a year?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Potential_Cycle_8223",
            "body": "It's 10 million per year between wars, starvation, treatable diseases, overwork, etc.",
            "score": 7,
            "replies": []
        },
        {
            "author": "fluffyfirenoodle",
            "body": "My husband is currently trapped in similar circumstances. How do I save him?",
            "score": 3,
            "replies": []
        },
        {
            "author": "PrncssHowl",
            "body": "Capitalism is a death cult.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CMao1986",
            "body": "47,000 people in America die every year due to lack of healthcare, and this is just America.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dolphin591898",
            "body": "This only includes working to death. This does not include imperialist conquest or slave labour in countries like the Congo. This does not include bombings or genocides. This does not include artificial starvation and famine. This does not include deaths for homeless or drug addicts. The number is far higher than this, at least tens of millions per year.",
            "score": 2,
            "replies": []
        },
        {
            "author": "0liviuhhhhh",
            "body": "This is JUST people dying from being overworked.\n\nThis doesn't even consider all the deaths attributed to lack of food, water, shelter, healthcare, war, eugenics, etc.",
            "score": 2,
            "replies": []
        },
        {
            "author": "karankia1",
            "body": "Don’t forget hunger and starvation alone kills 9 million people every year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adam0-0",
            "body": "But what's the cause of death??\n\nI mean it's not sending a fatal number of emails, or attending a fatal number of meetings right?",
            "score": -1,
            "replies": [
                {
                    "author": "POSTINGISDUMB",
                    "body": "it's in the graphic",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}