{
    "title": "Reminder: any use of ChatGPT or AI tools will result in a ban",
    "author": "BulkyAccident",
    "subreddit": "travel",
    "rank": 1,
    "score": 2460,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/travel/comments/1ilfd5x/reminder_any_use_of_chatgpt_or_ai_tools_will/",
    "id": "1ilfd5x",
    "selftext": "Mods are seeing a noticeable increase in users using ChatGPT and similar tools not only to create posts but also to post *entire* responses in comments, disguised as genuine personal advice.\n\nThe sub is one of the biggest on Reddit and as a community it's so important - particularly for a topic like travel which is rooted in authentic human experiences - that all responses come in the form of genuine opinions and guidance. There's absolutely no point in us all being on here otherwise.\n\nMods have tools to identify these sort of posts, but it's worth reiterating moving into 2025 and with increased AI available in our day-to-day lives that any usage of this sort to make your posts or comments will result in an instant ban. The rules are stated very clearly in the sidebar and are not new.\n\nNone of us joined this community to read regurgitated information from a machine learning model like ChatGPT. AI tools can have their place for travellers sometimes, but outside of the occasional spellcheck or minor translation it should never be the main foundational element for any of your posts on this sub.\n\nWe want responses to be *your* opinions and knowledge. If you're asking a question, we want it to be in *your* voice.\n\nIf you suspect any usage we haven't spotted, report it - we are a group of volunteers on a huge sub and things often slip through the net.\n\nI'm sure all users are on the same page here in terms of not letting AI generated content take over here, so it requires us all to work together. Thanks!",
    "comments": [
        {
            "author": "Ok-Instruction830",
            "body": "Great job mods.\n\nUnfortunately, Reddit as a whole has embraced bots and AI. Look at any major subreddit, they’re completely filled with it. \n\nThanks for combatting the BS ",
            "score": 729,
            "replies": []
        },
        {
            "author": "Distinct_Cod2692",
            "body": "W Mods",
            "score": 244,
            "replies": []
        },
        {
            "author": "redditrice",
            "body": "Sometimes, Siri wants to use AI to “improve” my comments, and I’m all like, “No, stop it,” so I think I’m good.",
            "score": 147,
            "replies": []
        },
        {
            "author": "Amar_Akbar_Anthony20",
            "body": "Thank you!",
            "score": 48,
            "replies": []
        },
        {
            "author": "dtagliaferri",
            "body": "what about to make my english understandable?",
            "score": -191,
            "replies": [
                {
                    "author": "BulkyAccident",
                    "body": ">\"AI tools *can* have their place for travellers sometimes, but it should absolutely never be the foundational element of any of your posts on this sub.\"\n\nSpellcheck and small translation is fine but your post should not be primarily structured by ChatGPT.",
                    "score": 206,
                    "replies": []
                },
                {
                    "author": "Chris_Hansen_AMA",
                    "body": "Yeah I’m not loving this rule tbh, there are genuine reasons to use it",
                    "score": -363,
                    "replies": [
                        {
                            "author": "WellTextured",
                            "body": "No one is saying you can't use it. Just don't post it. If AI tools gave you a travel idea and you want to ask a detailed or niche question about it, that's probably fine, but your post needs to be from you, and shouldn't regurgitate what the chatbot spit out. \n\n\nAI isn't just annoying because it's boring to read on this sub. It's annoying because people substitute it for having a brain, doing some research, and asking real questions. ",
                            "score": 153,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}