{
    "title": "Avis/ Priceline charged me twice and won’t give me my money back",
    "author": "Baby_0il04",
    "subreddit": "travel",
    "rank": 6,
    "score": 6,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/travel/comments/1je9re7/avis_priceline_charged_me_twice_and_wont_give_me/",
    "id": "1je9re7",
    "selftext": "Pretty much the title, I used Priceline for flights and car rental. Priceline charged me $700 for the car which included the underage fee. Then when I picked up the car I paid $600, I thought this what the security deposit. When it didn’t get back to my card after a week I called Avis and they said it should be back by today. \n\nNow it’s not back so I called again and this time they said it wasn’t the security deposit and that it was incurrence and underage fee.  But then I didn’t pay a security deposit??? When I asked for a manager the lady got very rude and condescending, telling me Priceline never paid them, so now I’m on hold with Priceline trying to get my money back. (Also each call had a wait time of 30+ minutes. Never using Priceline or Avis again.) \n\nAnyone have this happen? How did you get it resolved? ",
    "comments": [
        {
            "author": "Iylaofthestars",
            "body": "Former hotel employee- this is a common experience with 3rd party booking sites. Unfortunately the only thing you can do is keep calling Priceline, and hopefully learn from your experience. Don’t book with a 3rd party in the future. It is usually less expensive upfront- but you get what you pay for.",
            "score": 11,
            "replies": [
                {
                    "author": "Baby_0il04",
                    "body": "Yeah, I definitely learned my lesson. They also booked us with frontier which also had unexpected charges for the carry on. I went with Priceline cuz my dad who travels a lot suggested it but lesson learned. Either way definitely not going with Avis again after the terrible customer service",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "pubesinourteeth",
            "body": "Contact your bank. If priceline didn't send the money to avis then priceline has charged you for a service you didn't receive. Dispute those charges. Either they'll refund you or they'll pay avis and then avis will owe you a refund.",
            "score": 7,
            "replies": []
        },
        {
            "author": "jetpoweredbee",
            "body": "Another third party horror story.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ravio11i",
            "body": "GL!!!!   \nYet another 3rd party booking site horror story...\n\nI'd do a credit card chargeback and then never use either service again.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Quesabirria",
            "body": "If you're in the US, you have rights. Engage Priceline and Avis in writing, don't do it on the phone. If that doesn't get you resolution, then do a stop payment on your credit card.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Excellent-Pea6622",
            "body": "Just had a similar experience with expedia, got charged twice had to go back and forth with customer service provide booking info dates etc to my bank to get it back",
            "score": 1,
            "replies": []
        }
    ]
}