{
    "title": "Machu Picchu Peru",
    "author": "Calm_Platform8565",
    "subreddit": "travel",
    "rank": 19,
    "score": 1,
    "upvote_ratio": 0.6,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/travel/comments/1jeh298/machu_picchu_peru/",
    "id": "1jeh298",
    "selftext": "Hi ! We were supposed to do the Saltankay Trek from march 22 to 25th. I have seen many notices that the trek was closed, does anyone know if the trail will be reopened until that ? ",
    "comments": [
        {
            "author": "itsgableblanc",
            "body": "Me too! Is their any other alternative for trekking to Machu?",
            "score": 2,
            "replies": [
                {
                    "author": "Shepherdless",
                    "body": "besides Inca(which is guided and much shorter) there are a ton of other trekking options in the area.....but they do not go to MP.  I am not too certain if they have any closures in these.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MilkTiny6723",
            "body": "So says on the US embassy in Peru that it's closed due to extreme weather until mars 31 and landslides. Can't find any info on Peru nationalpark service etc. Very tricky time to go in mars. Things like that can happen. Look up alternatives to do. Machu Picchu will problably be open but the trekks seems closed according to the embassy, so better have alternatives to do planed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "**Notice:** Are you asking for travel advice about Peru?\n\nRead what redditors had to say in the **[weekly destination thread for Peru](http://redd.it/2o1sti)** \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "MilkTiny6723",
            "body": "https://pe.usembassy.gov/weather-alert-extended-closure-of-inca-trail-to-march-31-u-s-embassy-lima-peru-march-14-2025/",
            "score": 1,
            "replies": []
        },
        {
            "author": "Past_Wishbone5025",
            "body": "Peru is in a bit of a situation right now as a fyi. https://apnews.com/article/peru-crime-lima-state-of-emergency-b515974f76179d96461a4091ea216d91",
            "score": 1,
            "replies": []
        },
        {
            "author": "DogFun2635",
            "body": "Check the Peru forums on TripAdvisor",
            "score": 1,
            "replies": []
        },
        {
            "author": "loop-1138",
            "body": "No idea but I did Salkantay Trek about 3 years ago. It was great and we got lucky as few days after I left there were riots in the whole country. I lucked out. 2 years ago I did Manaslu Trek. There was an earthquake in Nepal a few hours after my plane departed Kathmandu\n 😂 So folks heads up, within the next 2 weeks i'll be starting a 2-3 months long road trip heading southwest and working my way up to Pacific Northwest. Expect fireworks soon. 😀",
            "score": 0,
            "replies": []
        }
    ]
}