{
    "title": "Frankfurt Layover: Can I Access the International Transit Area?",
    "author": "pippou",
    "subreddit": "travel",
    "rank": 18,
    "score": 0,
    "upvote_ratio": 0.33,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/travel/comments/1jeh8lo/frankfurt_layover_can_i_access_the_international/",
    "id": "1jeh8lo",
    "selftext": "My friend is traveling to Canada with a layover in Germany at Frankfurt Airport. He doesn't have a Schengen visa, so he won't be able to leave the airport. Will he also be confined to the terminal in this case? I live in a Schengen country and was wondering if there's a way to travel to Germany and spend that time with him, but I don't know if I'll have access to the terminal where he'll be staying. Is it possible to go and see him? What should I do, and who should I ask? I found a hotel in the terminal, but apparently, I can't be a resident there. Is that true?",
    "comments": [
        {
            "author": "leflic",
            "body": "You'd need a boarding pass for a non-Schengen flight from the same Terminal.\n\nYour friend can't get behind passport control, so they can't leave the terminal.",
            "score": 6,
            "replies": []
        },
        {
            "author": "debunkernl",
            "body": "Your friend is not allowed outside the terminal, and you are only allowed in if you have a ticket departing from there.",
            "score": 4,
            "replies": [
                {
                    "author": "pippou",
                    "body": "Any ticket? Even for a country within the Schengen Area?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "elijha",
                            "body": "No, in order to access the non-Schengen departures area, you naturally need a ticket departing the Schengen area",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "**Notice:** Are you asking about a layover or connection?\n\n1. Read the **[Layover FAQ](https://www.reddit.com/r/travel/wiki/mfaq-flying/layovers)**.\n\n2. Read the **[Flying FAQ](https://www.reddit.com/r/travel/wiki/mfaq-flying/)** in the wiki.\n\n3. Are you doing a self-transfer? Read this [excellent guide](https://www.reddit.com/r/Flights/comments/16ym47p/comment/k39c52x/?utm_source=share&utm_medium=web2x&context=3).\n\nPlease make sure you have included the **cities, airports, flight numbers, airlines**, and **dates of travel**.\n\nTransit Visa, Passport, Self-Transfer Questions: **State your country of citizenship / country of passport**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}