{
    "title": "Assassin's Creed Shadows - Review Thread",
    "author": "ChiefLeef22",
    "subreddit": "gaming",
    "rank": 4,
    "score": 232,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 365,
    "url": "https://www.reddit.com/r/gaming/comments/1je9um2/assassins_creed_shadows_review_thread/",
    "id": "1je9um2",
    "selftext": "**Game Title**: Assassin's Creed Shadows\n\n**Platforms**:\n\n* PC (March 20, 2025)\n* Xbox Series X/S (March 20, 2025)\n* PlayStation 5 (March 20, 2025\n\n**Trailers:**\n\n* [Assassin's Creed Shadows: Official World Premiere Trailer](https://www.youtube.com/watch?v=vovkzbtYBC8&vl=en)\n* [Assassin's Creed Shadows: Story Trailer](https://www.youtube.com/watch?v=SHaN4MIGqpo&vl=en)\n* [Assassin's Creed Shadows - Official Launch Cinematic Trailer](https://www.youtube.com/watch?v=aURzPQG5naA)\n\n**Developer**: Ubisoft\n\n**Reviews aggregates:**\n\n# [OpenCritic: 81 average - 84% recommend - 110 reviews](https://opencritic.com/game/16792/assassins-creed-shadows/reviews)\n\n# [Metacritic: 82/100 - 60 reviews](https://www.metacritic.com/game/assassins-creed-shadows/)\n\n**Some Reviews:**\n\n[Fextralife](https://opencritic.com/outlet/501/fextralife) \\- [8.5 / 10.0](https://fextralife.com/assassins-creed-shadows-review/)\n\n>Expansive, detailed and polished, Assassin's Creed Shadows is a fantastic exploration and stealth game with beautiful Japanese aesthetics, somewhat diminished by a thin story, clumsy narrative, and immersion-breaking design choices. Despite this, it's a thoroughly enjoyable entry into the series for fans seeking to explore medieval Japan.\n\n[GRYOnline.pl](https://opencritic.com/outlet/559/gryonline-pl) \\- [Jakub Paluszek](https://opencritic.com/critic/10596/jakub-paluszek) \\- [6/10](https://www.gry-online.pl/recenzje/assassins-creed-shadows-recenzja-gry-rutynowy-otwarty-swiat/z046f0)\n\n>I have experienced quite a few really cool moments while playing Assassin’s Creed: Shadows, but after 40 hours of playtime all those moments are lost in time like tears in rain. This new Creed has some interesting ideas to shake up the formula, but none of them are good enough to make it count. All in all, any potential for greatness was squandered for yet another opportunity to make a very big game.\n\n[Game Rant](https://opencritic.com/outlet/60/game-rant) \\- [Matt Karoglou](https://opencritic.com/critic/10492/matt-karoglou) \\- [9/10](https://gamerant.com/assassins-creed-shadows-review/)\n\n>Assassin's Creed Shadows is a spectacular return to form for the franchise, delivering one of the series' more tightly focused historical adventures. *Shadows* is both the most tightly-paced and consistently rewarding entry in the modern *Assassin's Creed* games, delivering a version of Ubisoft's open-world gameplay that regularly fires on all cylinders in terms of its visual spectacle, historical tourism, meaningful side activities, satisfying combat, and compelling plot that drives the player forward.\n\n[Eurogamer](https://opencritic.com/outlet/114/eurogamer) \\- [Tom Phillips](https://opencritic.com/critic/752/tom-phillips) \\- [4/5](https://www.eurogamer.net/assassins-creed-shadows-review)\n\n>Majestic in scope, impressive in detail, Assassin's Creed Shadows honours the beauty of feudal Japan, even if its strongest moments are saved for the personal stories of two protagonists. And yes, for longer-term Assassin's Creed fans, there are a couple of moments that will excite those with a wider knowledge of the lore. But in general, Shadows is more standalone than perhaps any other game in the franchise to date, its focus fully on Japan, and free of any continuing characters or modern day storylines. That said, there's definitely space left for the future - within Shadows itself through more stories, or perhaps in another game entirely. Before the end credits roll, each character's story is rounded out but also given a tease of what's next, too.\n\n[TheGamer](https://opencritic.com/outlet/731/thegamer) \\- [George Foster](https://opencritic.com/critic/2113/george-foster) \\- [4/5](https://www.thegamer.com/assassins-creed-shadows-review/)\n\n>Despite some repetition and bloat that makes Assassin’s Creed Shadows’ final stretch drag more than the rest of the game excites, its brave approach to exploration in a gorgeous world, heartfelt personal stories, and satisfying tweaks to the formula still make it stand as one of my favourite entries yet. While no one can say if Shadows will be the all-timer hit that both Ubisoft and the series need right now, I can at least say that it’s more than worthy of your time.\n\n[Kotaku](https://opencritic.com/outlet/276/kotaku) \\- Zack Zwiezen - [Unscored](https://kotaku.com/assassins-creed-shadows-review-is-it-good-xbox-ps5-rpg-1851770647)\n\n>*Assassin’s Creed Shadows* doesn’t completely revolutionize the core of the franchise. You still climb towers, take out targets, sneak around places, and interact with real history. However, it does shake up everything around these cores. Now you might climb a tower during winter and see a whole different view than you did in summer. Now you can sneak in the shadows as a lithe assassin or kick down the door as a samurai tank. And it leads to one of the most dynamic, fun, and best-looking open-world games I’ve played this generation, and one of the best *Assassin’s Creed* titles in years.\n\n[Hardcore Gamer](https://opencritic.com/outlet/23/hardcore-gamer) \\- [Kevin Dunsmore](https://opencritic.com/critic/892/kevin-dunsmore) \\- [3.5 / 5.0](https://hardcoregamer.com/review-assassins-creed-shadows/)\n\n>*Assassin’s Creed Shadows* had a lot of elements on paper that made it sound like it could be the best Assassin’s Creed game in years. It was finally going to be set in the long-requested Japanese setting, classic era fans were getting a narrative-focused experience and a greater focus on stealth, and RPG-era fans were getting their vast open-world and activities. While *Shadows* does deliver on a lot of these aspects, it also falls short on nearly as many. Yaskue and Naoe are fantastic characters with stories worth witnessing from start to end, but their stories are told with some of the franchise’s worst animations. The world is beautiful to explore, yet parkour remains an afterthought. Both combat and stealth are the most mechanically deep they’ve ever been, yet are both hampered by RPG mechanics that dilute their effectiveness and make them unnecessarily tedious.\n\n[Rock, Paper, Shotgun](https://opencritic.com/outlet/270/rock-paper-shotgun) \\- [Unscored](https://www.rockpapershotgun.com/assassins-creed-shadows-review)\n\n>A beautiful recreation of 16th century Japan is stained with the clumsy ink of an uninspiring revenge tale, but take your time sneaking through castles and visiting temples to get the most from an impressive open world.\n\n[PC Gamer](https://opencritic.com/outlet/162/pc-gamer) \\- [Morgan Park](https://opencritic.com/critic/2285/morgan-park) \\- [80 / 100](https://www.pcgamer.com/games/assassins-creed/assassins-creed-shadows-review/)\n\n>Come for the neck stabs and stay for the surprisingly great combat, Assassin's Creed Shadows is a stealth action buffet with a story to forget. I don't think Shadows is something to marathon. You could completely ignore the story, come back six months later, and still be up to speed (the heads gotta roll). I know I'll still be picking away at its 30+ castles later in 2025 and 2026, because I get the itch for a great stealth game every few months, and now I have a new one with a whole lot of stuff to do.\n\n[IGN](https://opencritic.com/outlet/56/ign) \\- [Jarrett Green](https://opencritic.com/critic/5288/jarrett-green) \\- [8 / 10](https://www.ign.com/articles/assassins-creed-shadows-review)\n\n>Assassin’s Creed Mirage’s return to the stealthy style that launched this series doesn’t do everything right, but everything it does feels like it was done with purpose. This means a shorter game with a smaller map, fewer collectibles, smaller scope in combat, and a limited selection of gear to play with – all of which I found refreshing relative to the arguably bloated scale of 100-hour games like Odyssey and Valhalla. It also means an overly simplistic plot with mostly forgettable characters, but what the story lacks in depth it makes up for with its straightforward quest progression and fast pacing.\n\n[GamesRadar+](https://opencritic.com/outlet/91/gamesradar-) \\- [Andrew Brown](https://opencritic.com/critic/1519/andrew-brown) \\- [4/5](https://www.gamesradar.com/games/assassin-s-creed/assassins-creed-shadows-review/)\n\n>Not every idea comes together neatly, and two phenomenal protagonists feel wasted on a lackluster story, but this is a titan in the same leagues as series staples Assassin's Creed 2 and Assassin's Creed 4: Black Flag – and Ubisoft's best RPG to date.\n\n[GameSpot](https://opencritic.com/outlet/32/gamespot) \\- [Jordan Ramée](https://opencritic.com/critic/4760/jordan-ram-e) \\- [8 / 10](https://www.gamespot.com/reviews/assassins-creed-shadows-review-shinobi-simulator/1900-6418344/?ftag=CAD-01-10abi2f)\n\n>So much of Shadows' issues come from Yasuke's inclusion. Not because he's a badly written character or because he doesn't feel like he belongs, but because much of what makes an Assassin's Creed game an Assassin's Creed is stripped away to make his samurai fantasy work. Naoe's shinobi fantasy works far better, effortlessly sliding into the gameplay loop of hunting down mysterious targets, puzzling through the best way to reach them, cutting them down, and disappearing without a trace. Naoe and Yasuke's story could have used more unity, especially in giving the duo a shared purpose to drive the plotline and their character development forward. But at the very least, Naoe's gameplay is the best that the series has felt since the transition to a more action-RPG format--Assassin's Creed Shadows is an absolute blast to play.\n\n[VG247](https://opencritic.com/outlet/549/vg247) \\- [Dom Peppiatt](https://opencritic.com/critic/253/dom-peppiatt) \\- [5 / 5](https://www.vg247.com/assassins-creed-shadows-review)\n\n>I’m actually at the point where I’m enjoying finding little problems with the game, because - most of the time - I know that means there’ll be something interesting on the other end of it. That is high praise for any work of art, but in a video game… it really feels like something special.\n\n[Tom's Guide](https://opencritic.com/outlet/851/toms-guide) \\- [Nikita Achanta](https://opencritic.com/critic/10843/nikita-achanta) \\- [4/5](https://www.tomsguide.com/gaming/assassins-creed-shadows-review)\n\n>Assassin's Creed Shadows delivers on its promise of bringing back classic stealth mechanics while introducing new ones and combining the best of the older and RPG titles. The detailed open-world of feudal Japan feels full of life with compelling playable and non-playable characters, and different fighting tactics enrich the combat. But the game struggles to balance its two playable protagonists, and player choices are still inconsequential. TODAY'S BEST DEALS $69.99 at Amazon(Download) $69.99 at Best Buy $69.99 at Walmart\n\n[DualShockers](https://opencritic.com/outlet/285/dualshockers) \\- [Ethan Krieger](https://opencritic.com/critic/11184/ethan-krieger) \\- [5.5 / 10.0](https://www.dualshockers.com/assassins-creed-shadows-review/)\n\n>Assassin's Creed Shadows is a bloated collection of uninspired quests that quickly turn into a repetitive, boring grind. While the art and history teams deserve recognition for their efforts, it's all unfortunately wasted on a narrative that goes nowhere, is poorly explained, and has no satisfying resolutions.\n\n[New Game Network](https://opencritic.com/outlet/405/new-game-network) \\- [Alex Varankou](https://opencritic.com/critic/2669/alex-varankou) \\- [74/100](https://www.newgamenetwork.com/article/2851/assassins-creed-shadows-review/)\n\n>Another solid entry for the series, Assassin's Creed Shadows offers a wonderfully rendered natural world, though it's not as unique as it once could have been. The typical mix of stealth and action gameplay is still enjoyable and is now split between two protagonists, though switching between them can be cumbersome. Fans of the franchise should be satisfied, if not exactly impressed.\n\n[Cloud Dosage](https://opencritic.com/outlet/951/cloud-dosage) \\- [Jon Scarr](https://opencritic.com/critic/11148/jon-scarr) \\- [4.5/5](https://clouddosage.com/assassins-creed-shadows-game-review/)\n\n>Whether Assassin’s Creed Shadows is the best entry in the series depends on what you enjoy. If you enjoy tactical stealth, the game delivers. If you’re more into a challenging combat experience, Yasuke’s overwhelming strength may leave you wanting more.\n\n[TheSixthAxis](https://opencritic.com/outlet/68/thesixthaxis) \\- [Adrian Burrows](https://opencritic.com/critic/4856/adrian-burrows) \\- [9 / 10](https://www.thesixthaxis.com/2025/03/18/assassins-creed-shadows-review/)\n\n>Fans of Assassin's Creed have waited an era or two for a series entry that lets you be a ninja and explore Feudal Japan. Thankfully, the wait has been absolutely worth it. Assassin's Creed Shadows is an astonishing achievement. Vast, impossibly detailed, immaculately researched, and enormously fun, Shadows is easily one of the best games in this storied franchise.\n\n[Push Square](https://opencritic.com/outlet/25/push-square) \\- [Robert Ramsey](https://opencritic.com/critic/932/robert-ramsey) \\- [8 / 10](https://www.pushsquare.com/reviews/ps5/assassins-creed-shadows)\n\n>While Assassin's Creed Shadows is unlikely to win over those who struggled to push through Odyssey or Valhalla, this is still one of the strongest overall entries in the series - and arguably the best of the open world RPG bunch. The storytelling is largely fantastic, the main characters are deeply likeable, and the open world itself is a thing of beauty.",
    "comments": [
        {
            "author": "Bexewa",
            "body": "So around the same scores as Odyssey and Valhalla",
            "score": 435,
            "replies": [
                {
                    "author": "typhoidtimmy",
                    "body": "Reassuring.  I loved Odyssey and Valhalla to a lesser degree.",
                    "score": 191,
                    "replies": [
                        {
                            "author": "Yourself013",
                            "body": "TBH as long as the game isn't as bloated as Valhalla, I'll pick it up during a discount later down the line. Origins and Odyssey were nice, although the latter already felt bloated towards the end, but Valhalla was just too much.",
                            "score": 88,
                            "replies": [
                                {
                                    "author": "typhoidtimmy",
                                    "body": "Yea same feeling.  There were slogs in both.  Odyssey was easier to digest for myself since I am a big reader on the Peloponnesian War, Greek mythology, and the works of Homer and Plato.  \n\nAnd to be honest, it was absolutely gorgeous (Seeing things like the Hot Gates, the Agora of Athens, and the Statue of Zeus at Olympia in all their glory gave me the warm fuzzies as a history nerd)\n\nAnd now, I want to go play again. 🥹",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "Wellsargo",
                                            "body": "Odyssey was just so much more mechanically sound than Valhalla imo. The combat was so satisfying, the looting and gear system while maybe a *teensy* bit excessive was fun as hell to mess around with, the exploration and the world were super engaging, and everything just felt so intentional.\n\nI had so many experiences in that game where I set sail to go do a main quest, only to find myself side tracked on some random ass little island, just to end up spending the next two or three hours of playtime wrapped up in some big ass multi part side quest line which was so completely intertwined with the main story that by the time it was over I looked at my journal and scratched my head because I had completely forgotten it wasn’t a main quest in the first place. It made sailing around the seas sooooo much fun, and every new area was just exciting to get to for the first time.\n\nI think more than any other game I have ever played, Odyssey is hurt *a lot* if you just rush the story and ignore everything else. Because there’s just so much *there* there outside of the main quests that if you don’t experience it everything may feel a little shallow. It’s genuinely one of my favorite RPG’S (favorite game’s period, really) ever.\n\nValhalla just stripped back 80% of what made Odyssey so special to me and replaced it with a giant repetitive slog that lasts *waaaaaaay* too long. So many mechanics and design choices were just completely stripped out of that game and what we were left with felt completely soulless. The first ten or twenty hours are fun, before you realize that the gameplay loop isn’t going to really change at all in any meaningful way, and you still have 50 hours to go. It’s just such a frustrating step backwards. Plus, the world is just so painfully *dull* in comparison to Odyssey’s, which really did feel like you were stepping back in time into this giant and expansive world that was littered with secrets, stories, and god damn *character.*",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "spaceandthewoods_",
                                                    "body": "You nailed it, I had exactly the same experience with Odyssey and loved it. After one big plot point led to some pretty devastating personal outcomes for the main character, I was like \"fuck the plot, I'm going to roam the seas and find myself, because that's what I think Cassandra would do at this juncture\" \n\nAnd so I merrily sailed off and found myself \n\n- Embroiled in both a guerrilla movement and love triangle on my first island getaway, which all ended _horribly_ because of the choices I made across the intertwined quest chains\n. Not a great start to things\n- Tracking down my mysterious origins and finding out some exciting and very plot relevant precursor shit that was still totally optional \n- Having another island sabbatical on Crete where I tried to go the _right way_ about helping the locals (also steering clear of any romance), without any devastating fuckups or heartbreaking revelations. Finally, catharsis! My sea faring sabbatical was over and Cassandra, having actually saved the day for once, could go back to the plot again. \n\nThe game let me piece together my own side quest mini arc full of fun, emotional mini stories and I don't think I've ever been so invested in the story arc _I've_ pieced together for a video game character before.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "targetcowboy",
                                            "body": "Odyssey got me back into the series. Valhalla was decent, but I didn’t enjoy it as much. I’m pretty sure I’ll check this game out at some point.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "todellagi",
                                    "body": "I loved Odyssey even with the bloat\n\nValhalla was the first game I couldn't finish. It felt so much like a chore. Every territory had checklists and checklists, and locked doors, with stories, that just came and went, without any influence on the world. Really started to feel like work. The best moment in that game was honestly uninstalling it.  The relief...",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "eldestscrollx",
                                    "body": "Valhalla was huge, my friend was 200 hours in and still nowhere near clearing all the question marks in the map",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Instantcoffees",
                                    "body": "I personally had way more issues playing through Odyssey than Valhalla. Maybe it's because I played Valhalla first, but I had more fun with it. I really like the Viking setting though.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "DrinkBen1994",
                                    "body": "My issue with Valhalla was the combat was absolutely atrocious for an AC game. It's the worst the series' has been by far.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Gambler_Eight",
                                    "body": "I feel like the Valhalla story was a pretty decent lenght.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EmpJoker",
                            "body": "Valhalla is just too much to love. I love the characters, gameplay, and setting, but holy shit it didn't need to be that big. They could've toned it down a bit",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Strange-Ad7097",
                                    "body": "I agree! Although since it was around the pandemic, I had a lot of time to play that game. Probably my 3rd favorite AC game after 2&3",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Strange-Ad7097",
                                    "body": "I agree! Although since it was around the pandemic, I had a lot of time to play that game. Probably my 3rd favorite AC game after 2&3",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Strange-Ad7097",
                                    "body": "I agree! Although since it was around the pandemic, I had a lot of time to play that game. Probably my 3rd favorite AC game after 2&3",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "chokingonpancakes",
                            "body": "I wanted to love Valhalla but Viking + Assassin just did not hit with me.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "TheVaniloquence",
                            "body": "This is the same team that made Odyssey and Immortals Fenyx Rising, which I loved and got similar critic scores",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "chanaramil",
                            "body": "I bet those scores mean better then either. I think if the game was just as good as those games it wouldn't be as rated as high. People are getting board and critical of assassin creed forumla so I suspect it needs to be outstanding or revolutionary now to get over 80%.\n\n\nBut that is just my guess and this is just pre release review. Reviewers often do odd things so it's hard to judge.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Battlecookie",
                                    "body": "Absolutely. The public’s expectation has such a large role in review scores. Not to mention the name of the studio or publisher.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "typhoidtimmy",
                                    "body": "Good point.  We have become more jaded the more aware of how a lot of AAA properties have devolved into blatant cash grabs with nothing to show for it (looking at you *Dragon Age*)\n\nSolid numbers like this can be even more positive nowadays.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "chanaramil",
                            "body": "I bet those scores mean better then either. I think if the game was just as good as those games it wouldn't be as rated as high. People are getting board and critical of assassin creed forumla so I suspect it needs to be outstanding or revolutionary now to get over 80%.\n\n\nBut that is just my guess and this is just pre release review. Reviewers often do odd things so it's hard to judge.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Mundane-Clothes-2065",
                            "body": "Just to let you know - I am watching review by Luke Stephens and he says it is a VERY different game than them. He likes the game but said this is different direction in the way game is structured.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "iekue",
                                    "body": "Already seeing his hardcore fanboys whine he's been bought 🤣. How dare he enjoy a game they've decided to hate lol.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Mundane-Clothes-2065",
                                            "body": "I know. That comment section is a mess. It's also funny because he has been shitting on Valhala, Concord, Starfield etc non-stop. He easily could have shit on this too and got a viral video.\n\nI am also watching Kinda Funny review rn - 2/4  of them think its great. 1 thinks its meh and 1 thinks its decent. I think 8/10 is where this lands.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Chimmychimm",
                            "body": "Hell yeah! I love the same game over and over.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sesameseed88",
                            "body": "Loved odyssey, exactly what I needed from a game.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LinkedInParkPremium",
                    "body": "Odyssey was amazing. This sounds promising.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "BeginningFew8188",
                    "body": "I liked Odyssey settings and theme",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Messyfingers",
                            "body": "The Odyssey setting carried me through what was a somewhat mediocre game. If the best thing is being able to walk around a facsimile of Japan in that era, it may still be worth it. I reckon I'll get this one",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "erich3983",
                    "body": "I personally loved both of those games so I’m almost positive I’ll love Shadows.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CtrlShiftAltDel",
                    "body": "Excellent because I thought Origins and Odyssey were fun games. The landscaping for both of those games were absolutely fantastic",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dop-dop-doop",
                    "body": "Or DA Veilguard. Doesn't mean much.",
                    "score": -60,
                    "replies": [
                        {
                            "author": "Possible-Emu-2913",
                            "body": "So as good as three games I enjoy then? Cool.",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "TinyFlamingo2147",
                            "body": "Ooooh, the evil bad game.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "mocylop",
                            "body": "Given the sales numbers DA:V would have likely have pulled even/made money had it not been in development hell for 10 years. \n\nIIRC the game was originally multiplayer live-service. So like imagine the extra cost of retooling that to a single player RPG?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Lindestria",
                                    "body": "technically it was a single player retooled to live service then retooled again back to single player.\n\nAnd each of those retoolings had different scopes, so the fact that there's a working game at the end of it is kind of surprising.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "mocylop",
                                            "body": "DA:V is actually a miracle",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Albireookami",
                            "body": "Veilguard isn't a bad game in any metric considering it's development hell.",
                            "score": -25,
                            "replies": [
                                {
                                    "author": "philip2110",
                                    "body": "It’s a bad game if you compare it to good games. That’s a metric.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "ll30yd",
                                            "body": "No it's not, go troll elsewhere.",
                                            "score": -9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Key_Amazed",
                                            "body": "Gameplay is solid, there's a lot of content, it looks good, it runs near flawlessly which should always be recognized in an industry where games are released broken, and has the best hair physics in any game to date.\n\nBut it has a trans character in it so it's awful and \"woke\"",
                                            "score": -17,
                                            "replies": [
                                                {
                                                    "author": "philip2110",
                                                    "body": "I don’t care about trans character and I agree with you it runs well and looks great.\n\nThe gameplay is poor, the story and decisions you can make to impact the game don’t live up to a dragon age game or any RPG that would be considered half good. The level design is terrible and super linear and the game treats you like a moron.",
                                                    "score": 13,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Shirou_Emiyas_Alt",
                                                    "body": "It's story is written like a Kroger HR head wrote it. That alone means it's a bad DA game. I understand that it's become a bit of a flag carrier for dumb culture war nonsense, but it's a mediocre game at best.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "GlazedInfants",
                                                    "body": "Lmao, it’s like you purposefully avoided mentioning the story. Like, hair physics? Really? Gameplay is subjective, but come on dude you can’t seriously be judging if a game is good or not based on graphics and performance alone.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Sph3al",
                                    "body": "Just to clarify, you're saying it's an impressive game because of its development? I didn't know it had such a challenging development speaking frankly.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Albireookami",
                                            "body": "I'm saying it was a good enjoyable game, ran well with no noticeable performance issues, and was fun.   Given what the game director had to do to get the game into that state it is more impressive.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Sph3al",
                                                    "body": "I might give it a second try then. With a budget of 250M, running well is the very least of my expectations. Thanks for the heads-up!",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Sph3al",
                                                    "body": "I might give it a second try then. With a budget of 250M, running well is the very least of my expectations. Thanks for the heads-up!",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Independent_Tie_4984",
            "body": "It would have to be a lot different for me to buy it \n\nOdyssey was awesome, but I couldn't finish Valhalla because it felt like I'd already done it.",
            "score": 186,
            "replies": [
                {
                    "author": "Arastmaus",
                    "body": "Valhalla was waaaaaay too long.  Really overstayed it's welcome. \n\nAlso, abandoning the way they did 2 playable characters in Odyssey was a huge mistake imo.  That was a really cool way of handling it.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "RyutoAtSchool",
                            "body": "The issue is that they basically made the two playable characters in Valhalla pointless. Sure, Kassandra is ‘canon’ for the official novelization of Odyssey, but if you pick male Eivor in Valhalla the story within the game eventually just goes ‘no you’re wrong Eivor was a woman’",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Arastmaus",
                                    "body": "Yeah I agree.  They went from maybe the best application of multiple possible protagonists ever, to something completely forced and uninspired.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "RyutoAtSchool",
                                            "body": "I don’t mind the new system tho, tbh. Odyssey was an interesting idea but two characters, one for each ‘play style’ is fine too. I didn’t ply it but I think they did it for Syndicate?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "RyutoAtSchool",
                                            "body": "I don’t mind the new system tho, tbh. Odyssey was an interesting idea but two characters, one for each ‘play style’ is fine too. I didn’t play it, but I think they did it for Syndicate?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Arastmaus",
                                    "body": "Yeah I agree.  They went from maybe the best application of multiple possible protagonists ever, to something completely forced and uninspired.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AU36832",
                    "body": "With Valhalla, I played non stop for a few weeks then took several months off. Then played nonstop for a few weeks before taking several more months off. And I repeated this cycle for 2.5 years before I finally beat it lol.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "PaladinHunter",
                    "body": "Do you think the stealth mechanics they’ve introduced with Naoe would be different enough for you? Her skill set is definitely adding a level of stealth the series has never seen before which I love as a stealth game enjoyer",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Independent_Tie_4984",
                            "body": "No, it's more than mechanics.\n\nIt has been years, but I guess it was the whole \"go back into the past, do this thing, report back to the future\" premise and everything associated with it.\n\nI'm playing Kingdom Come Deliverance 2 at the moment and simply being in the past is a lot more compelling for me.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "CyberneticDinosaur",
                                    "body": "According to the 4th review blurb above (Tom Phillips of Eurogamer),  this game is \"free of any continuing characters or modern day storylines\".",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Independent_Tie_4984",
                                            "body": "Interesting 🤔",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Canisa",
                                            "body": "Honestly, it's about time! The modern day bits have always been the standout worst parts of every Assassin's Creed game for coming up on twenty years now.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AU36832",
                    "body": "With Valhalla, I played non stop for a few weeks then took several months off. Then played nonstop for a few weeks before taking several more months off. And I repeated this cycle for 2.5 years before I finally beat it lol.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Demianz1",
                            "body": "Exact same cycle for me, honestly it was nice knowing that if i ever wasnt feeling any of the games am into at a certain point, it was always there and there was still some sort of objective or progression to be had, not even including going out of the way for the mysteries or world events on the map.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mundane-Clothes-2065",
                    "body": "Luke Stepehns says it is very different game but he likes. However he says that if you like Valhala you may not like this as much, even tho he likes it more than valhala.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Z0idberg_MD",
                    "body": "I really liked Valhalla the problem was the game was so goddamn long. And the story just dripped out that I lost interest and could never finish it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Z0idberg_MD",
                    "body": "I really liked Valhalla the problem was the game was so goddamn long. And the story just dripped out that I lost interest and could never finish it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Rayeon-XXX",
                    "body": "I liked Valhalla enough to put some hours into it however, I agree it was too long, the gameplay loop was ultimately quite boring, and the world, while seemingly accurately portrayed, was just kind of dull. \n\nAgain I say that having played it for 150 hours.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Grahol",
            "body": "I’m really hoping the hideout feature is good but most reviewers don’t mention much about it.  Despite being disappointed with Starfield I spent a lot of time building outposts. Stuff like that I really enjoy in games",
            "score": 61,
            "replies": [
                {
                    "author": "PaladinHunter",
                    "body": "I think it’s also good they aren’t complaining about it either. So it must not be something so annoying that it ruins the game. Like the Batmobile in Arkham knight",
                    "score": 23,
                    "replies": [
                        {
                            "author": "SgtApex",
                            "body": "To this day I can't believe Rocksteady fucked up one of the most requested features for the Arkham series. The actual gameplay was fun to me it just how much they overused it in combat etc",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DuckCleaning",
                    "body": "Yeah, the hideout feature seems fun because you can upgrade it and call them into fights. Like mixing the hideout feature of Unity with the ability to use them in Brotherhood.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "vertle",
                    "body": "The IGN Reviewer mentions that people who like that sort of thing (me) will not be disappointed so I'm excited. Like you, I enjoyed building stuff in Starfield so I'm looking forward to building a cosy home in Shadows.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ProfitLivid4864",
                    "body": "Yea that’s interesting point . I’m excited for the stealth, combat , and weather systems as well! This should be higher scored than previous assassin creed games. Seems more ambitious polished title in the series",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SwanyPlaysGames",
                    "body": "From what I have played it is kinda wonky. You can tell that this is their first time kinda working with a builder mode. But any time you want to select a new decoration for example you have to do it in a seperate screen. It isn't as good as a bethesda builder but it isn't bad. I think if you like to take the time in games to decorate, I think you'll like the hideout feature. It takes a lot of grinding to unlock all the cosmetics for the hidout though.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ProfitLivid4864",
                            "body": "I think it’s cool they added it on and gave us a wide set of stuff to do in game . Hopefully they improve it through updates",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "brelyxp",
                    "body": "One Italian review said that the hideout is basically useless and optional (no purpose for the story) other than recruit more \"follower\" to summon during combat to help you",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CapKashikoi",
                            "body": "Well, you also need to upgrade the forge to get the transmog system for weapons",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "shinmushagundam",
            "body": "Popcorn ready for the next week.",
            "score": 124,
            "replies": [
                {
                    "author": "SUPRVLLAN",
                    "body": "Good or bad, *gamers will be mad!*",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "SatanHimse1f",
                    "body": "yeah I care more about the controversy than the actual game now - with them threatening to sue people over it I'm very excited to see how that unfolds; I can't imagine it going very well for them",
                    "score": -173,
                    "replies": [
                        {
                            "author": "CyanideIE",
                            "body": "If you read further than just a rage bait headline, they're suing people over the harassment of the devs, considering just how poorly they've been treated by certain members of the gaming community.",
                            "score": 98,
                            "replies": [
                                {
                                    "author": "SatanHimse1f",
                                    "body": "I'm not enraged, nor am I improperly informed - We're talking about 0.00001% of the community btw, and they certainly don't speak for me\n\nI'm assuming you and the other guy who replied to me are chronically online and looking for arguments like this any where you can find them; which is sad\n\nI don't want to partake ngl",
                                    "score": -112,
                                    "replies": [
                                        {
                                            "author": "ActionLegitimate4354",
                                            "body": "Posts in Reddit TWELVE (12) times a day, and then calls other people chronically online, classic internet",
                                            "score": 52,
                                            "replies": [
                                                {
                                                    "author": "Estee321",
                                                    "body": "I’ve noticed this quite a bit, the people who instantly start claiming “chronically online” always seem to be the ones who never log off.",
                                                    "score": 10,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SatanHimse1f",
                                                    "body": "I was more referring to the way they approached their replies to me - Immediate assumptions and condescension, I don't have the patience for that right now unfortunately lol",
                                                    "score": -37,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "VacaRexOMG777",
                                            "body": "Calling people chronically online while being an asmon fan is definitely a take lmao",
                                            "score": 45,
                                            "replies": [
                                                {
                                                    "author": "baraboosh",
                                                    "body": "Tbf he is the biggest streamer, if there's anyone non-chronically online ppl would see, it's asmon.",
                                                    "score": -10,
                                                    "replies": [
                                                        {
                                                            "author": "iekue",
                                                            "body": "Biggest streamer? What? Lol.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "baraboosh",
                                                                    "body": "Is he not anymore?\n\nBack when I used to watch streams he was always at the top",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SatanHimse1f",
                                                    "body": "Whats wrong with Asmon? He's pretty based",
                                                    "score": -52,
                                                    "replies": [
                                                        {
                                                            "author": "MrScoobyDoobert",
                                                            "body": "Fuck asmon. He’s been praising eldolf musker all week. And if you support that, fuck you too.",
                                                            "score": 25,
                                                            "replies": [
                                                                {
                                                                    "author": "SatanHimse1f",
                                                                    "body": "I definitely don't like Elof either but he hasn't been defending him at all - He's used Elofs own AI Grok to fact check him and let me tell you, Elof lies or misrepresents a LOT\n\nYou shouldn't judge a book by it's cover, especially when you seemingly have no idea what you're talking about",
                                                                    "score": -12,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MrScoobyDoobert",
                                                                            "body": "Nah fuck asmon lmao",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SatanHimse1f",
                                                                                    "body": "Ok man",
                                                                                    "score": -4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "AccomplishedSide3434",
                                                            "body": "Everything bro. Everything",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Ice-Fight",
                                                            "body": "Very based.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "iscaf1",
                                            "body": "Holy projection batman",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "CyanideIE",
                                            "body": "If you were properly informed, then you would have read the article on this, which supports what I'm saying. Ubisoft suing people or threatening to sue is true, but without knowing the reason, it can be taken pretty negatively, whereas within context, i.e., suing people who harass their developers, it seems like commonsense and a good response to this kind of thing.\n\nAlso, there's nothing chronically online about correcting you on this, nor is it argumentative to fact-check you on a half-truth.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "keepfighting90",
                                            "body": "You're not very bright, are you?",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ice-Fight",
                                            "body": "THIS\n\nnot touching this shitty game",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Shad0w5991",
                            "body": "Suing people over death threats not negative reviews",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "SatanHimse1f",
                                    "body": "If you can't see that it's just deflection from extremely poor reception to their upcoming game then I don't know what to tell you - I'm not denying people have received death threats, but thats like, in every community that's big enough? Why isn't every company doing something like that, or taking more action? why now? & on top of that how are they even going to prove they were being harassed? Or targeted in anyway?",
                                    "score": -36,
                                    "replies": [
                                        {
                                            "author": "FB_Rufio",
                                            "body": "Why now? Idk this seems to have generated more hated than The Last of Us 2, and that harassment was a shit show. Even Dustborn Devs mentioned people went beyond death threats and got personal numbers and things to harass and threaten them for their game....So maybe, just maybe a big Org has the resources to do something. ",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "SatanHimse1f",
                                                    "body": "honestly I have a tough time believing claims like that with out any evidence - did they supply any evidence? I'd love to see it\n\nI hate TLOU ll with a burning passion and have never threatened any body in my life, online or otherwise lol",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "FB_Rufio",
                                                            "body": "Good for you? Congrats on not being human garbage, I guess?\n\n\nSo how many people involved in some capacity in the gaming industry saying \"we get harassed and death threats\", before you believe them? \n\n\nHow exactly are for example Dustborn Devs supposed to provide proof of phone call harassment? \"That could be anyone on the phone.\" Text messages? Will be called fake...and if they've brought it to the authorities they shouldn't be sharing the proof. The Abby voice actress did provide proof with screenshots.\n\n\nThere's also zero reason for them to make it up. Saying people are targetting employees doesn't generate sales for the game. ",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Resident-Mixture-237",
                                            "body": "Idk bro. Reviews seem solid. Sounds like you’re trying to justify harassing devs just because their game stars a black man and a woman.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "SatanHimse1f",
                                                    "body": "people like you are so weird dude holy shit lol",
                                                    "score": -22,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Zetra3",
                            "body": "threatening to sue people over legit and provable harassment targeted at employees.\n\nnot over controversy, not at ubisoft. Just don't attack people, its that simple.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "Windrider904",
                                    "body": "Seriously. Sue the shit out of them losers",
                                    "score": 32,
                                    "replies": []
                                },
                                {
                                    "author": "SatanHimse1f",
                                    "body": "that's why I'm so excited to see how it unfolds - How are they going to prove that? lol besides that they never even properly defined what they deem to be harassment, and I imagine that was on purpose\n\nAnd are you insinuating that I've attacked people? Or what? I really don't know how to respond to that - Also, lose the condescending tone",
                                    "score": -55,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "God_treachery",
                            "body": "You mean over death threads.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Ice-Fight",
                            "body": "Ummmm excuse me…\n\nWhat?\n\nThey’re sueing for WHAT?",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "Ice-Fight",
                            "body": "Ummmm excuse me…\n\nWhat?\n\nThey’re sueing for WHAT?",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "keepfighting90",
            "body": "There's literally zero chance of Reddit having any kind of positive reaction to this game. Even if the scores were 95, they'd just say it was all paid reviews.",
            "score": 141,
            "replies": [
                {
                    "author": "-elemental",
                    "body": "Ghosts of Tsushima on metacritic: 83. The best Japanese open world ever, combat was awesome!\n\nAC Shadows on metacritic (so far): 82. Meh, seems to be the same Ubisoft slop.",
                    "score": 71,
                    "replies": [
                        {
                            "author": "keepfighting90",
                            "body": "Stellar Blade is like a 81 on Metacritic and Reddit can't stop slobbering over that game.\n\nTBF that game does have big titty anime waifu to appeal to the huge gooner crowd.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Choice-Layer",
                                    "body": "I want a Black Mirror episode where an exploitative waifu simulator game comes out to appeal to all the misogynist asshats and they all love it but it's so tailored to them that no one else can stand it and at some point in the episode all the copies of the game get \"activated\" and it sends a specific frequency through their headsets that deep fries their brains.",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "shgrizz2",
                            "body": "GoT was also open world slop though. Very competent, but slop nonetheless.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Pterodactyl_midnight",
                                    "body": "What does “slop” mean in this context? GoT gave you new abilities as the enemies got harder, all that until the end of the game. The side quests were awesome. I don’t know what else you could do in an open world that wouldn’t make it “slop” in your opinion?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "keepfighting90",
                                    "body": "Elden Ring got 90+ scores and it was basically just a Ubisoft open world bloatfest in Dark Souls clothing.\n\nBut Reddit isn't ready to have that conversation yet.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "cyberslashy",
                                            "body": "Elden Ring doesn't follow any Ubisoft open world design philosophies, to suggest that is disengenious.\n\nYou can argue it was too big for it's own good and could have been a tighter experience, but that's a separate issue.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "freakedmind",
                                    "body": "Facts. Act 1 and a bit more was a 9/10 experience but it quickly went down to a 5 for me personally.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Usernametaken1121",
                            "body": ">seems to be the same Ubisoft slop.\n\nBecause it is. Since when did anyone take reviews of AAA seriously? They always over hype AAA because if they didn't, they wouldn't get the interviews, preview material, and trips out to check out the game. Gaming journalism isn't objective and it's been that way forever.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "offensivename",
                                    "body": "A review of a piece of art is subjective by its very nature. There is no such thing as an objective review.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "nathtendo",
                                    "body": "Absolutely correct young sir.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "-elemental",
                                    "body": "Is every review or AAA games good? Why do they give other AAA games bad reviews then?",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Vazefnier",
                            "body": "they are all gagging if this horizon or ghost! 😂 the double standard.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cyberwolfdelta9",
                    "body": "Anywhere in general one of the YouTubers I watch is being absolutely attacked in the comments cause he said he kinda liked it lmao",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Bantarific",
                    "body": "People overstate the \"paid reviews\" thing but there are multiple cases of reviewers who give bad reviews to mainstream products getting, let's say, treated less well by the companies.\n\nIt's not like the companies just go to the reviewers and hand them $1000 like some people seem to think, but it does create a conflict of interest where maybe a reviewer \"rounds up\" to an 8 instead of a 7.6 because, hey, it's pretty close, right? It's not really that big of a deal, right?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Atulin",
                            "body": "Also, it's not literally $1000 in an envelope, but rather \"oh, only a 4/10 for Blorbo Quest...? Guess you don't want an early press release of Blorbo Quest 2 then...\" which means their review will be released a good few days later than those of reviewers who gave Blorbo Quest 9/10",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Canisa",
                                    "body": "Which also has the knock on effect of filtering out the honest reviewers from the release day hype, ensuring that the on the day reviews are broadly positive.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "godwalking",
                    "body": "yeah. game could have been a 10/10 across the board and reddit would still bitch about it. Reddit's hateboner for ubisoft is quite impressie.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Cyberwolfdelta9",
                    "body": "Anywhere in general one of the YouTubers I watch is being absolutely attacked in the comments cause he said he kinda liked it lmao",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Apex_Redditor3000",
                    "body": "> There's literally zero chance of Reddit having any kind of positive reaction to this game.\n\nThere's also literally zero chance this game is good lol.  As with almost every AAA release these days, you can just skim these scores and pick out the lowest one.  The lowest score is generally the most accurate, and even then it's too generous.\n\nSee also:  Starfield/Veilguard.",
                    "score": -19,
                    "replies": [
                        {
                            "author": "keepfighting90",
                            "body": "It's probably going to better than your favourite game if we're being honest.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Apex_Redditor3000",
                                    "body": "True.  I prefer bad games like TW3, Elden Ring, Rimworld, and Factorio.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "keepfighting90",
                                            "body": "And there's nothing wrong with that :)",
                                            "score": -6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "nathtendo",
                                    "body": "I doubt it's beating Barbies dreamhouse on the Nintendo ds.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nazgut",
                    "body": "because they are paid reviews and not only for this game (and i run similar game website)",
                    "score": -36,
                    "replies": []
                },
                {
                    "author": "NamerNotLiteral",
                    "body": "Funny you say that, because this whole thread, as well as the one on r/Games, is generally positive on this lol.\n\nLike, people are comparing this to Odyssey and Tsushima, not Valhalla, which is good.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "defiancy",
            "body": "I may be in the minority and I don't argue there isn't repitition between entries that can make the games feel stale or stuck in the past but I have really liked every entry of AC I have played (which is all of them).\n\nI'm looking forward to the new game (still didn't pre-order though).",
            "score": 86,
            "replies": [
                {
                    "author": "PureImmortal",
                    "body": "I agree with you, if you take a year or two between playing a new AC game it is actually quite fun. A really fun and enjoyable series",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Fair-Lab-4334",
                            "body": "Last one I played was 3, just didnt find the other games setting interesting, might get this one a go since I like ninja stuff",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "iAyushRaj",
                                    "body": "Also give Origins a shot after this if you end up liking it",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Fair-Lab-4334",
                                            "body": "Man, AC games can be a chore if I end up wanting to collect everything that I get burned out after one game. Probably going to wait a few years if I like this one before playing Origins. It looks cool tho, so thanks for the recommendation",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "iAyushRaj",
                                                    "body": "You don’t HAVE to do it but I understand the completionist mindset. And Origins is nowhere near as long as Odyssey, Valhalla and probably Shadows",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "High-jacker",
                            "body": "This is it. A big part of why people get burnt out at Valhalla is that they play odyssey prior, and origins before that. Each with 2 big dlcs. Valhalla is massive, no doubt, but if you're having fun you can quickly get through the arcs.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dazzler_3000",
                    "body": "Yeah sometimes I just want a story driven, open world game where I can get my dopamine hits by ticking off items on the to do list.\n\nI'm playing through Spider-Man 2 now and that's a similar thing. \n\nAs long as the gameplay is enjoyable (traversal is smooth and combat is good) then I'm happy. I had to put Kingdome Come Deliverance 2 on hold as I didn't have the head to stress about every decision I was making.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ManINtheScreen",
                    "body": "Same here man. Love odyssey and Valhalla when most people didn’t. I’ve always been a fan of the AC games and am super excited for this one",
                    "score": 6,
                    "replies": [
                        {
                            "author": "rich519",
                            "body": "Odyssey was pretty well liked on Reddit when it came out. People were excited for Valhalla and when it first came out I felt like the reaction was generally positive. Since then opinions have been steadily declining and now it’s weird where it feels like you have to defend the fact that you like them.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "iekue",
                            "body": "\"Most ppl didnt\" nah most ppl enjoyed them, they sold gangbusters. Its just the loudass terminally online minority of anti ubisoft ppl etc. that keep goin on about how bad the games are.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "velocicopter",
                    "body": "You're not in the minority - these games are hugely successful.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "tomazmidly",
                    "body": "Nah You are not minority. Reddit IS minority.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dr_Rjinswand",
                    "body": "Excellent, you might be the perfect person to ask! I recently played through Black Flag and it was one of my favourite gaming experiences to date. I know it's widely lauded as the best in the series, but what one do you think I should get next?\n\nI really (and I mean really) enjoyed the combat. It was great to take on a load of people simultaneously and pull off slick moves with ease. I also really liked the way the side quests worked where you could just systematically go through them. Once discovered, they were marked on the map so I knew where I had to go (I don't like running around aimlessly). I had a lot of fun with it and some of the open world oddities were hilarious. Such a fun time. Plus I loved Captain Kenway. \n\nAny suggestions would be super welcome!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GryffinZG",
                            "body": "If you want more of the exact same, rogue, after rogue I’d say start unity if you want to pick up the story thread from there",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MTAlphawolf",
                    "body": "Honestly, the only one I didn't play exhaustively was Mirage. I did really enjoy Origins and Odyssey, which this one sounds in line with. Looking forward to it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dazzler_3000",
                    "body": "Yeah sometimes I just want a story driven, open world game where I can get my dopamine hits by ticking off items on the to do list.\n\nI'm playing through Spider-Man 2 now and that's a similar thing. \n\nAs long as the gameplay is enjoyable (traversal is smooth and combat is good) then I'm happy. I had to put Kingdome Come Deliverance 2 on hold as I didn't have the head to stress about every decision I was making.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dazzler_3000",
                    "body": "Yeah sometimes I just want a story driven, open world game where I can get my dopamine hits by ticking off items on the to do list.\n\nI'm playing through Spider-Man 2 now and that's a similar thing. \n\nAs long as the gameplay is enjoyable (traversal is smooth and combat is good) then I'm happy. I had to put Kingdome Come Deliverance 2 on hold as I didn't have the head to stress about every decision I was making.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zygoatee",
            "body": "So I guess I'll be picking this up for 10 bucks at the end of summer sale",
            "score": 26,
            "replies": [
                {
                    "author": "Zeidrich-X25",
                    "body": "I’ll wait till next year and get it on PS+.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "AshsToAshs",
            "body": "My (spoiler free) thoughts on the game after playing for 30ish hours:  \n[https://youtu.be/\\_pu6WIIJ7Rk](https://youtu.be/_pu6WIIJ7Rk)\n\n\"AC Shadows finally takes us to feudal era Japan via the team that created AC Odyssey. But if you approach it expecting the gameplay of Odyssey, you’ll be disappointed. I think there is a lot to love in this game, especially for AC fans looking for a return to a more slow and methodical approach to stealth. But I remain concerned that by splitting the main character into two, neither of the characters feel properly capable.\"",
            "score": 46,
            "replies": [
                {
                    "author": "DaleDenton08",
                    "body": "If I remember right that was a similar critique in Syndicate.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "GGFrostKaiser",
                            "body": "I think in Syndicate both characters at least were capable of fulfilling the AC fantasy.\n\nI am currently playing the game as well. I will say Yasuke does kind of feel pointless in the game. They do give him a story but he can’t accomplish everything previous AC protagonists could.\n\nThe core elements of AC games in my opinion are:\nExploration/Parkour + Stealth + Combat. Yasuke CAN’T do Stealth at all outside of very specific builds that involve stealth archery (which they limit the amount of silent arrows you can carry significantly). His Parkour is very lackluster as well, because he CAN’T reach the top of the famous viewpoints. And Combat is what he does, but then again, Combat in this game is not as good as Ghost of Tsushima, Souls games or Sekiro, so you do get bored of it at some point.\n\nWhat happens is you explore the world and play stealth as Naoe, and on occasion you play as Yasuke for a specific quest. But then once you leave you go around the world, you find Yasuke’s limitations, which then prompts you to go back to the menu, choose Naoe, and load back to game. Just completely KILLS the gameplay flow.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RoryJefferson33",
            "body": "Is it a return to form?",
            "score": 43,
            "replies": [
                {
                    "author": "chillzatl",
                    "body": "If you like the series, it would seem that's a yes. \n\nif you don't like the series, it would seem that's a no. \n\nIf you're a Reddit keyboard king, everything is always shit.",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "DisagreeableFool",
                    "body": "So far only one review says it is... The day isn't over yet though... ",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "cynical_croissant_II",
                    "body": "seems like just another modern AC game tbh",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "docarwell",
                    "body": "I mean despite how much reddit cries about Ubisoft most of their games are.. fine? Like they almost all play the same but they're usually well done slogs and not unfinished dumpster fires.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Fair_Lake_5651",
                            "body": "Starwars outlaws was pretty unfinished. But other than that their games are pretty mediocre these days but if you find it fun , that's good enough :)",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "docarwell",
                                    "body": "Completely forgot about that game lol mostly had AC and Far Cry games in mind. Pretty samey, collectathons but mostly polished. Most of them are free in the various game passes too",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Fair_Lake_5651",
                                            "body": "I did play farcry idk which one it was repetitive af but it's just the essence of their games ig",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Think_Difference_468",
                                    "body": "Outlaws was pretty solid to me. But I just one girl that fawns over star wars",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Fair_Lake_5651",
                                            "body": "I loved the star wars movies but I only watched the the main entries (aka 1 to 9) after that 9th film i mentally checked out of the franchise",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tango421",
                    "body": "Game Rant said so.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zetra3",
            "body": "so exactly were I expected Good with problems/stale formula\n\nAka every fucking AC ever.",
            "score": 30,
            "replies": [
                {
                    "author": "ProfitLivid4864",
                    "body": "I like the weather system , combat, and stealth improvements . It seems this assassin creed is being held to a higher standard than Valhalla. That game kinda looked meh . Shadows looks a lot more fun and that’s not just because of the setting.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Chelsea_Kias",
                            "body": "Yeah, from what I see, Shadow looks leap and bound better than Valhalla",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Zetra3",
                            "body": "I'll fully admit I'm an AC die hard, but I hated Vahalla (thought still beat it, no DLC playthrough though)\n\nBut yes, the weather system is were I am at, im also for the super hard stealth mode they announced. Im all in",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Atulin",
                    "body": "A solid \"$25 bundle with all DLC during Steam Sale\" kind of a release",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Zetra3",
                            "body": "You do you, my day 1 purchase of your favorite games helps fund those developers who you can't financially support",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jdl03",
            "body": "One of those reviews looks like it was for Mirage?",
            "score": 6,
            "replies": []
        },
        {
            "author": "SwanyPlaysGames",
            "body": "I'd like to say I've played about 80 hours or so. My biggest problem with shadows is the amount of copy paste objectives. Around the 20 hour mark I was starting to get bored with how often I was seeing the same thing over and over and over and over and over. Then it continued for another 60 hours.",
            "score": 12,
            "replies": [
                {
                    "author": "Battlecookie",
                    "body": "lol name me one single open world game that doesn’t have repeating missions. It’s just a way for people to have something extra to do in an open world game.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Psychoticpossession",
                    "body": "So like most of Ghost of Tsushima outside the main quest?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "CollierAM9",
                            "body": "GoT can be platinum’d in 45 hours.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SaintAlunes",
                    "body": "I feel like most open world games have that problem. Ghost and elden ring has that same problem but people still praise it",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Independent_Tooth_23",
                            "body": "Yeah Kingdom Come Deliverance 2 has this issue too with some of the game's quests but the game is still a blast to play.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "keepfighting90",
                    "body": "That's an issue with any open world game. I had the same problem with critically acclaimed open world games like Elden Ring and Cyberpunk, and running into it again with Kingdom Come 2. ER specifically was bloated as fuck and had a ton of copy-paste content. But people give it a pass because it's FromSoft.\n\nDoesn't really change how good the games are overall, to me.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "dulmer46",
                            "body": "ER does not have copy paste objectives, its reuses many of the enemies but thats about it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SaintAlunes",
                    "body": "I feel like most open world games have that problem. Ghost and elden ring has that same problem but people still praise it",
                    "score": 0,
                    "replies": [
                        {
                            "author": "nathtendo",
                            "body": "Can I please ask, what were the copy paste objectives in Elden ring, thanks thanks.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Psychoticpossession",
                    "body": "So like most of Ghost of Tsushima outside the main quest?",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "TravelPhotons",
                    "body": "Ubisoft's achilles heel. I hate all that busywork.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "freemanposse",
            "body": "It just sounds like Odyssey again. I liked Odyssey, but I'm not paying full price for Odyssey But This Time In Japan when they already tricked me into paying for Odyssey But This Time In The Danelaw.",
            "score": 7,
            "replies": []
        },
        {
            "author": "DisruptiveLove",
            "body": "I liked Odyssey however did not like Valhalla. It sounds like I may like this but we will see. I see some issues however again with the modern story which leaves me in a weird place as a fan because I really do not like where it’s at right now nor does it look like that it’s getting better.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DanTheFireman",
            "body": "Did they keep the gear score system from all of the other open world games? I didn't enjoy that very much. Everything else was fine.",
            "score": 2,
            "replies": []
        },
        {
            "author": "amitkattal",
            "body": "This is what I said for months. All I hear is hate towards this game but I know it will do well with sales and even most reviews. it is really annoying ",
            "score": 3,
            "replies": [
                {
                    "author": "chillingmedicinebear",
                    "body": "Ubisoft employee spotted",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Abudabeh77",
            "body": "Looks pretty decent so far! Excited to try it later in the week, been waiting for this one for a while.",
            "score": 6,
            "replies": []
        },
        {
            "author": "BadDogSaysMeow",
            "body": "Obligatory, don't trust mainstream professional game journalists. They praised Veilguard for writing and worldbuilding, called it a return to form when it was the farthest from the original, etc.  \nThey rarely give anything lower than a 7, which makes grading meaningless, and so on... \n\nI'd recommend waiting for reviews and gameplay from youtube reviewers. *^((proper reviewers not Asmon and the like))*",
            "score": 11,
            "replies": [
                {
                    "author": "Mundane-Clothes-2065",
                    "body": "Luke Stephens thinks this a fun game. Not great and has problems, but bad either. Idk if that's enough tho given the PR hit ubisoft has taken.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Hyro91",
                            "body": "Don't trust that plagiarist.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Mundane-Clothes-2065",
                                    "body": "I don't watch just his videos. I also watch Kinda Funny Games - they liked Shadows too. Interested to see where it lands with Skill Up and Jake Baldino.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "renboy2",
                    "body": "Ubisoft sent review codes to a ton of people, many of them are not journalists at all. I agree that you shouldn't trust the big gaming sites, but there are so many more reviewers this time around.\n\nAlso, numbers don't really mean much in reviews. Someone's 9 can be someone elses 6 and vice versa. That's why you should only look at the verbal likes and dislikes, and make up your own mind based on what you like or don't like.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ank1t70",
                    "body": "Why are people acting like an 8/10 is an earth shattering score? Reviewers say it’s an alright game, not generational lol.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "BadDogSaysMeow",
                            "body": "A 8/10 should be an earth shattering score.\n\n>Reviewers say it’s an alright game\n\nAccording to IGN \"alright\" is a 5/10 or 6/10 at most; not 8/10 .\n\nPersonally, I am quite strict with games, and I would rarely give a game more than 6/10.  \nMost of the \"well received\" games would get 4-5/10 from me.\n\nBut as game journalists are either directly or indirectly bribed by game companies.  \nMost game ratings are heavily inflated.  \nA 7/10 is the 3/10 but the journalists aren't allowed to give true ratings.\n\nAs such it's impossible to distinguish a real 8/10 game from a 4/10 game whose rating was increased to 8/10 by bribes.\n\nObviously, youtubers can also be bribed, and some of them go the other way and purposefully give lower ratings when they can profit from negativity and culture war, but there many more bigger/medium sized youtubers who give \"more accurate\" reviews than professional game journalists who do the same.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "GuardianOfReason",
                                    "body": "In what world an 8/10 is an earth shattering score? 10/10 is that. 8/10 is a good game with significant flaws.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "BadDogSaysMeow",
                                            "body": ">These games leave us with something **outstanding** to remember them by, usually novel gameplay ideas for single-player or multiplayer, clever characters and writing, noteworthy graphics and sound, or some combination thereof. If we have major complaints, there are more than enough **excellent** qualities to cancel them out.\n\n\\-IGN\n\nIt's a great game, not good.  \nAnd if it has significant flaws the it must be a masterpiece where it works, not just \"good\".\n\nAnd \"earth shattering\" was in comparison to the majority of other gams, because as I said, most major games are barely a 5.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "GuardianOfReason",
                                                    "body": "AC games always have top of the line graphics and world designs, like you're visiting a piece of history. That, coupled with generic but servicible gameplay, would make it a 8/10 in their own definition to me.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "fuzzmeisterj",
            "body": "Looking forward to it!",
            "score": 5,
            "replies": []
        },
        {
            "author": "ElectricCowboy95",
            "body": "I'm gonna give it a month or two and see user reviews before I commit. I'm sure it's enjoyable enough but I'm just not interested in buying games at full price right off the rip. I want to call out the GRYonline.pl review though. \"All those moments are lost in time like tears in rain.\" That dude just needed a lower score so he could pull out what I'm sure he thought was a genius line and oh so original... barf what a corny and pretentious line.",
            "score": 4,
            "replies": [
                {
                    "author": "Fineck",
                    "body": "It's on ubisoft+ if you want to play it cheap at launch.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sufficient_Vanilla18",
            "body": "Oh it’s got good reviews, must be a conspiracy. Yawn.",
            "score": 3,
            "replies": [
                {
                    "author": "FishySardines99",
                    "body": "I feel like every major release lately gets 8/10, 4/5 or so on, doesn't matter if they are good or bad games",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DamnImAss",
                    "body": "Ubisoft loves paid reviews",
                    "score": -42,
                    "replies": []
                },
                {
                    "author": "TristheHolyBlade",
                    "body": "The reviews don't matter to me at all. I've played enough of their games to see they are trash. So either the reviews are perpetually paid for or critics have garbage taste. Isn't a conspiracy, just explanations.",
                    "score": -68,
                    "replies": [
                        {
                            "author": "Shad0w5991",
                            "body": "Because everyone knows a game is only good if u/TristheHolyBlade thinks it is",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "Lindestria",
                            "body": "Or people enjoy different things. gasp horror.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "TristheHolyBlade",
                                    "body": "Doesn't mean the things they enjoy are any good.",
                                    "score": -12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Firvulag",
                            "body": "More likely you are wrong about them, they are fun",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "TristheHolyBlade",
                                    "body": "My opinion can't be wrong, especially when it's more informed than yours.",
                                    "score": -23,
                                    "replies": [
                                        {
                                            "author": "malbert716",
                                            "body": "Oh brother, you sound like a dork",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "Firvulag",
                                            "body": "Explain how it's more informed, I'm curious",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "TristheHolyBlade",
                                                    "body": "Informed\n\nDefinition: having or showing knowledge of a particular subject or situation.\n\nSo...it sound like I have more knowledge on the subject of gaming than you. \n\nMight want to invest in a dictionary.",
                                                    "score": -13,
                                                    "replies": [
                                                        {
                                                            "author": "Firvulag",
                                                            "body": "Are you okay? I didn't ask what \"informed\" means. i dont think you are all there lol",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DavidanA15",
                            "body": "Or maybe you have garbage taste?",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Key_Amazed",
                                    "body": "\"Your taste is different from mine. And I have good taste because I say so, which means your taste must be garbage\"\n\nSo many children on the internet smh",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -28,
                                    "replies": [
                                        {
                                            "author": "TheClawwww7667",
                                            "body": "Hmmm I don’t believe you. Post your favorite game so we can judge you accordingly.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Parish87",
                                                    "body": "I mean my favourite games are Elden Ring, Mass Effect Trilogy and RDR2 and I think all assassins creed games since 2 are generic trash. However, that doesn't mean I don't understand other people may really enjoy them, which is great. \n\nPeople can have different tastes.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TristheHolyBlade",
                                                    "body": "I'm sorry, who are you?",
                                                    "score": -22,
                                                    "replies": [
                                                        {
                                                            "author": "Yourself013",
                                                            "body": "And who are you? Why should we care about your opinion that you so gracefully decided to share here? \n\nYou're no more important than any other redditors here, and your opinion doesn't mean shit if you aren't prepared to discuss it.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "TristheHolyBlade",
                                                                    "body": "And yet you all decided to engage. I feel pretty important.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Yourself013",
                                                                            "body": "So you feel important when you're the resident dumbass that everyone is laughing at? \n\nGood for you then. Aim high in life.",
                                                                            "score": 8,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "AtsuhikoZe",
                                                            "body": "Post your favourite video game, what's the problem?",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "razzmanfire",
                                                                    "body": "Okay skyrim/mass effect 2 for me how about you?",
                                                                    "score": -3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "VacaRexOMG777",
                                                            "body": "A random person on the internet, like you or me",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TheClawwww7667",
                                                            "body": "It was clearly a joke you moron.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "TristheHolyBlade",
                                                                    "body": "Does anyone know who this guy is? \n\nI don't understand why he's making his weird little comments...",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SingerNo8103",
                                                                            "body": "oh that's actually just how the internet works.\n\nhope that helps",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kubicka",
            "body": "What reviewers can we trust in this age?",
            "score": 3,
            "replies": [
                {
                    "author": "DazZani",
                    "body": "Its usually healthy to find one to three reviewers you like and usually agree/understand and wait for their stuff",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vesania6",
            "body": "None of these I trust.",
            "score": 3,
            "replies": [
                {
                    "author": "SUPRVLLAN",
                    "body": "Who *do* you trust?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kododie",
            "body": "Lot of 8/10. Meanwhile Mortismal outright states he's not recommending the game in first 5 minutes of his review. Which is pretty damning considering how lenient he usually is.",
            "score": 2,
            "replies": [
                {
                    "author": "Gaxx_94",
                    "body": "Sure but this is his first AC game since AC 2, so maybe it's just not his cup of tea.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Reynor247",
                    "body": "A lot of us don't know who that is",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Kododie",
                            "body": "A respected videogame reviewer on YouTube who does 100% completionist reviews.",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "keepfighting90",
                                    "body": "\"respected videogame reviewer\" lmao.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "countryd0ctor",
                    "body": "> Meanwhile Mortismal outright states he's not recommending the game in first 5 minutes of his review.\n\nJesus christ. If even the forced reddit positivity incarnate is unsatisfied with the game, this is going to be something special.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Mundane-Clothes-2065",
                            "body": "This seems to be a different game than most AC. Luke Stephens usually likes to dunk on things. He has milked Ubisoft going to the shits and makes fun of Valhalla every 5 mins. He seems to have liked this specifically because it is different from the usual AC games. I think this is a 8/10 Ubisoft open-world game.  Not for everyone but still polished and just a fun game to play while waiting for the next major release. Unfortunately for Ubisoft, we just got KCD2, Split Fiction, and even Avowed. Next we have Clair Obscur, Doom, Mafia and GTA VI. This might get crushed between those just due to comparisons alone. I am certain that someone is recording the video \"KCD 2 vs Shadows\" right this second.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "countryd0ctor",
                                    "body": "There's also Rise of the Ronin and i cannot emphasize enough how addictive its open world formula is, since it's supported by an awesome combat system with tons of variety.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "IcePopsicleDragon",
            "body": "8 from IGN\n\n  \n[https://www.youtube.com/watch?v=ImyzEeFNqTE&pp=ygUgYXNzYXNzaXNuIGNyZWVkIHNoYWRvd3NkIHJldm9pZXc%3D](https://www.youtube.com/watch?v=ImyzEeFNqTE&pp=ygUgYXNzYXNzaXNuIGNyZWVkIHNoYWRvd3NkIHJldm9pZXc%3D)",
            "score": 3,
            "replies": [
                {
                    "author": "Fancy-Pair",
                    "body": "Solid.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hawkseye_0205",
            "body": "Considering these are the average scores of the last like 3 ac games means I'll end up liking it",
            "score": 3,
            "replies": []
        },
        {
            "author": "LancerBro",
            "body": "After slogging through Odyssey, being burned by Valhalla's checklist simulator and  throwing in the towel about 20 hours in, I'm giving this one a pass. Unless there's radical change to the game, I think I'm done with the franchise.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GangWeed999",
            "body": "Some reviewer really gave it a 5.5/10 because he didnt like the story lmao, no mention of stealth, combat exploration or anything that most players actually care about",
            "score": 0,
            "replies": [
                {
                    "author": "phobos_664",
                    "body": "Back in my day, the story of an AC game was actually what mattered.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "MHWGamer",
                            "body": "you know we are old when we can remember the story of ac2. Voice acting and animation still superior to modern day AC",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ItsEthanCoolCool",
                    "body": "I talk about literally all of those things in the full review, my dude.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "BlindWalnut",
                    "body": "Ah yes, the same publication who stealth edited their DA:V review and offered no transparency or editors notes about it.\n\nTruly the kings of journalistic integrity.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "BlindWalnut",
                    "body": "Ah yes. The amazing website with articles such as \" Kingdom Come Deliverance : How to use your torch \"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ItsEthanCoolCool",
                            "body": "You'd be surprised what basic things people can't figure out in games sometimes, lol.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RadicalRectangle",
            "body": "I’m an unapologetic super fan, only Valhalla lost me in my quest to 100% the game towards the end (took 2 years for me to finally sit down and knock it out). \n\nSounds like I’ll get what I want. I don’t need revolutionary gameplay, I just want a new version of the same game I have admittedly played like 9 times before. Stoked for this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unfamous2423",
            "body": "Once again I have the feeling that if, after Black Flag, Assassin's Creed had split off into a differently named franchise, people would be viewing this in a more positive light. AC to Ubisoft clearly means \"historical setting with light fantasy elements plus weird mechanical twist that sets each game apart\" with the standard Ubisoft collect-athon and map reveal gameplay.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GenuineBallskin",
            "body": "Im too invested in a game im not gonna be buying anytime soon lmao.\n\nUbisoft needs this to be a success. If it isnt, its gonna cause even more issues for the company. Id be sad if Ubisoft goes under. I dont like their games, but its been such a fundamental triple A studio since my childhood. Glad to see that fans of the franchise might be really into it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GenuineBallskin",
            "body": "Im too invested in a game im not gonna be buying anytime soon lmao.\n\nUbisoft needs this to be a success. If it isnt, its gonna cause even more issues for the company. Id be sad if Ubisoft goes under. I dont like their games, but its been such a fundamental triple A studio since my childhood. Glad to see that fans of the franchise might be really into it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Practical_Law6804",
            "body": "Basically: UBISOFT delivering on what it delivers best.\n\n. . .I also do not get the complaints about Yasuke: in Valhalla, I can count on a few hands the number of encounters I bothered to do with stealth. My Eivor, whether raiding or asking Crusaders to \"come at me bruh\" was a straight up tank butchering her way through her enemies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Single-Ad4852",
            "body": "I couldn’t get in Valhalla. It was just too big. The scores look pretty good for this game. I haven’t had the urge the play an Assassins Creed game since the original trio.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Salm228",
            "body": "I’m out of the loop why does Reddit hate Ubisoft and want this to fail?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BatmanForever93",
            "body": "All that controversy for another standard Assassin's Creed game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jmizzle2022",
            "body": "I'm glad it's getting a decent reviews, I'll pick it up when it's on sale",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kourtos",
            "body": "-Thin story \n-Immersion breaking designs \n-Clumsy narrative \n\n    -8.5 okay i guess",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotKam1",
            "body": "Can’t wait to play. We need more games that offer heavy stealth",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maurice__Chavez",
            "body": "You guys can't be serious.\n\nAre we forgetting that these people said that Veilguard was a return to form with excellent writing?\n\nAre we forgetting that Ubisoft sent content creators to Disneyland in exchange for a good SWO review?",
            "score": 1,
            "replies": [
                {
                    "author": "zonecapitalx",
                    "body": "Who cares",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RavenK92",
            "body": "Bought it, my first AC since AC3, because the PS5/XSX DF review looked like a polished next gen experience.  Looking forward to what it will offer on my 4090",
            "score": 1,
            "replies": []
        },
        {
            "author": "chuputa",
            "body": "An average score of 80-82 is pretty much the Ubisoft score at this point XD",
            "score": 1,
            "replies": []
        },
        {
            "author": "lucidzfl",
            "body": "Well if you can’t trust ign who can you trust",
            "score": 1,
            "replies": []
        },
        {
            "author": "DuffmanStillRocks",
            "body": "Absolutely good enough for me, people shit on AC but I always get at least my moneys worth. I’m probably going to keep myself mostly blind to content but it’ll be a nice part of my weekend I hope",
            "score": 1,
            "replies": []
        },
        {
            "author": "Disastrous-Yam-7073",
            "body": "Looks solid to me. I haven't played a AC game to completion since Unity. Or atleast I think I did. Honestly, the only entry I recall beating was Black Flag and the awesome DLC. I was burnt out by then.\n\nAnyways, I look forward to giving this entry a try after over a decade of skipping.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kam_tech",
            "body": "Xenoblade X getting better scores than Assassin’s Creed",
            "score": 1,
            "replies": [
                {
                    "author": "Kam_tech",
                    "body": "I mean it’s the truth",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MuNansen",
            "body": "Let the incel brigading commence.",
            "score": -18,
            "replies": [
                {
                    "author": "DoctorRockstarMD",
                    "body": "Am I out of touch? (Is my game shit?)\n\nNo, it is the children (gamers) who are wrong (incels).",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Raz0rking",
                    "body": "Kinda funny how the same thing was said about The Veilguard and it absolutely tanked.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "locke_5",
                    "body": "REEEEEEEE NO THIS GAME IS ACTUALLY BAD REEEEEEE ANOTHER GAME GOT A HIGHER SCORE REEEEEEEEEEEEEE NOBODY IS GONNA BUY THIS REEEEEE DRAGON AGE VEILGUARD RRRREEEEEEEEEEEEEEEEEEE WOKE REEEEEEEEEE",
                    "score": -9,
                    "replies": [
                        {
                            "author": "ibadlyneedhelp",
                            "body": "Right? It looks like a completly standard entry in the AssCreed games, but now all of a sudden gamers care about \"historical accuracy\" and other bullshit.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Apex_Redditor3000",
                    "body": "lmfao",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "McSchlub",
            "body": "PC Gamer gave it 80/100 but that verdict is kinda yikes.",
            "score": -2,
            "replies": []
        },
        {
            "author": "CrashnServers",
            "body": "Paid actors",
            "score": -1,
            "replies": []
        },
        {
            "author": "Flabbergash",
            "body": "How on earth can you give a game with a clunky story and strange narrative choices an 8.5 / 10?",
            "score": -34,
            "replies": [
                {
                    "author": "Irish_Whiskey",
                    "body": "Because it does a lot of other things well.\n\n8.5 is not some radically high score. I'm not defending Shadows here I've never played it, but \"a clunky story\" is not some deathknell for a game whose focus isn't narrative.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "AdSoggy9252",
                            "body": "This. no matter how much I hate the story, I’ve played almost every AC to the end because of that sense of adventure and exploration. Hate Valhalla story, love Viking longship raids!",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Elegant-Noise6632",
                            "body": "Money. You missed that. Money is why",
                            "score": -25,
                            "replies": [
                                {
                                    "author": "Irish_Whiskey",
                                    "body": "No, this is just childish and leaves me hesitating to respond to people critically in case I'm actually bullying a 13 year old.\n\nGame reviewers are not giving Ubisoft and EA games the same average scores as independent reviewers because they get bribed to do so. They simply don't hate the games with the same passion you do, as someone who hasn't even played it but is deep in a culture war echo chamber.  \n\nThese same reviewers give major titles with hundred million dollar marketing campaigns low scores when they are really bad, like CoD games. If Ubisoft were bribing people for reviews, it wouldn't be for '8.5 it's okay' reviews. This isn't logical, or supported by evidence.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Elegant-Noise6632",
                                            "body": "How is this childish- they spend add revenue on these sites.\n\nAre you saying Ubisoft does not spend money directly with these review sites?",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Irish_Whiskey",
                                                    "body": "I'm saying stop accusing journalists of being bribed for reviews for games whenever you don't agree with their opinions, and using their reviews as validation whenever you do. It's what children do whenever someone disagrees with their opinion.\n\nObjective concern with the influence of money on reviews would start with looking at how outlets deviate for specific publishers compared to other outlets that don't run ads. Not simply hating a game you never played because right wing media told you to, and declaring people liars and frauds when they give it an average review in line with most other reviewers and prior titles in the series.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Elegant-Noise6632",
                                                            "body": "I mean, when you work for an organization being paid millions of dollars by someone you are reviewing.\n\nThat’s a paid review.\n\nSorry not sorry.\n\nThis is not an objective review in any shape of the word, you can’t convince me otherwise because it’s objectively not unbiased due to ya know- the money?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Irish_Whiskey",
                                                                    "body": "If that's your take, then you simply have to not care about all reviews that use advertising. \n\nAs I already pointed out a few times, that isn't what you're doing. You're not accusing good and bad reviews of being bribed and invalid, you're only accusing reviews for a specific game you want to hate when you disagree with the reviews. You can't pick and choose without being obviously inconsistent.\n\nAlso saying it's a paid review is literally untrue. When you aren't being paid for doing the review but for a separate service regardless of whether there is a review, then you aren't being paid for the review. Sorry not sorry, but that's how the English language works.\n\n>This is not an objective review in any shape of the word,\n\nSure, no reviews are objective. But if you want to selectively dismiss some reviews by claiming corruption and not others, then you need more than \"well there's systemic incentives not to trash big games\", especially when those outlets regularly DO trash big games from those publishers.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Elegant-Noise6632",
                                                                            "body": "I prefer sales figures and steam honestly.\n\nSo does most people games journalism is dying because of this issue.\n\nThey are biased because how could they not be?\n\nYou keep giving excuses but can’t refute you can’t be unbiased while being paid.\n\nAlso I think your bias is showing- I have not mentioned a specific game?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jlmurph2",
                    "body": "Because it isn't a movie",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Mindless_Fortune1483",
                    "body": "Hard to say, but Astrobot got GOTY. Not sure if it has good narrative and impressive story, haven't played it.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Andulias",
                    "body": "Have you actually played it?",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "TheClawwww7667",
                    "body": "Probably depends on how much that individual reviewer places the importance of story in if a game is good or not and whether or not it being clunky had an overall impact on their enjoyment of the game. \n\nThe story in Ninja Gaiden Black is pretty awful but that game is a 10/10 to me and NG2’s story is even worse and I would give that game a 9/10. There are plenty of games that don’t have good stories that I would review highly and I suspect many others would do so too. \n\nSo if story is more important to you than anything else then you should find a reviewer that agrees with you on that and use them to determine the quality of the game(s) you are interested in buying.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "HerakIinos",
                    "body": "Not defending the review but narrative is one of the least important things on a video game",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Ethantie",
                    "body": "Oh, so you have already played the whole game then?  Okay, everyone listen to this person who clearly knows what they are talking about!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "deljaroo",
                    "body": "because those are often the least important parts of a game",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RepeatEconomy2618",
                    "body": "Cry more, let the tears run down your face, this game will sell millions",
                    "score": -9,
                    "replies": []
                },
                {
                    "author": "Mazisky",
                    "body": "For the same reason they gave 10 to games like Veilguard I guess.",
                    "score": -17,
                    "replies": [
                        {
                            "author": "Andulias",
                            "body": "Who is \"they\" that gave Veilguard 10/10?",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "RepeatEconomy2618",
                            "body": "Veilguard was a Great Game",
                            "score": -16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nanganoid3000",
                    "body": "I'm thinking the same thing!!!!",
                    "score": -5,
                    "replies": []
                },
                {
                    "author": "Uberdragon_bajulabop",
                    "body": "Simple. Money.",
                    "score": -21,
                    "replies": [
                        {
                            "author": "Mothman405",
                            "body": "So let me guess, if it gets bad reviews they are real and if it's good reviews, they are all paid?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DYMAXIONman",
                    "body": "People love open world slop.",
                    "score": -12,
                    "replies": []
                },
                {
                    "author": "Elegant-Noise6632",
                    "body": "Money",
                    "score": -7,
                    "replies": []
                }
            ]
        },
        {
            "author": "theultimatefinalman",
            "body": "Wow, another middling ubiosft game that takes no risks and recycles the formula from their last 20 games, who could have seen this coming? ",
            "score": -21,
            "replies": [
                {
                    "author": "keepfighting90",
                    "body": "Sounds like FromSoft games to me.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "No_Pomegranate4090",
                            "body": "Dark Souls 2, Bloodborne, Armored Core 6, Sekiro, Elden Ring, all took big risks and changes.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "keepfighting90",
                                    "body": "Lol. Lmao even",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Reynor247",
                                    "body": "Elden Ring open world. Not sure what big risks are in souls 2 and bloodborne",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Sairou",
                                            "body": "Also making an open world game in the age of every game being open world is a huge fucking risk lol. I mean I love Elden Ring, it's the only game I've ever platinumed, but come on, we don't love From Soft for their innovations, but their consistency. The same goes for Ubisoft. The people who liked the previous entries will like this one too, the people who hated them will hate it.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "No_Pomegranate4090",
                                            "body": "People hated Dark Souls 2 because it wasn't Dark Souls 1.5, its negative reception is proof enough that they changed things up significantly",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Reynor247",
                                                    "body": "Wouldn't proof they changed things up differently be things they changed up differently?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "No_Pomegranate4090",
                                                            "body": "sure, if you care for the technical details, you can play the game yourself to see firsthand or go ask ChatGPT",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Reynor247",
                                                                    "body": "Oh I've played it.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Possible-Emu-2913",
                    "body": "Lol, more developers will be copying Shadows for their approach to the open world again. Not that you know what new stuff their doing because of your hatred.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "theultimatefinalman",
                            "body": "God I hope not ",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Possible-Emu-2913",
                                    "body": "Lol. Most open world games already do copy them \n\nBut you don't want more day and night cycles with a light and dark feature that makes stealth far better or changing seasons throughout the world? Shame.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "HerakIinos",
                                            "body": "What did they do differently this time?\n\nA lot of developers do indeed copy ubisoft, but its more their older titles like Far Cry 3 and the earlier AC games, that stablished this formula.\n\nNowadays ubisoft copies more trends than create.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Relevant_Arm_3796",
                                            "body": "Look I'm not agreeing entirely with what the guy said but if a day night cycle that affects visibility is your 'ace' I think it's better to fold lol it's not a bad feature but doesn't disprove his original point, then to add shame like it's some kinda slam dunk, I dunno man 🤣",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZethUser",
            "body": "One of the most polemic games of the year. Won't play it but wanna follow how it ends up.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Low-Hat-4985",
            "body": "Wow, comment section is NUKED.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flipmeister13",
            "body": "Promising reviews.. I hope this game does well.. A good AC is such a treat..\n\nFor me personal the part of \"stealth\" is of putting. I suck at stealth.. I'm the \"coming in with blazing guns\" type of guy. I liked the Greece and Egypt ones (I suck at names.. Sorry)..",
            "score": 0,
            "replies": []
        },
        {
            "author": "locke_5",
            "body": "The comments in this thread are so obnoxious that I just pre-ordered the game out of spite. \n\nCope and seethe, losers.",
            "score": 0,
            "replies": []
        },
        {
            "author": "onestaromega",
            "body": "After how bad Valhalla was, I'm done with AC. They waited way too long to bring the game to Japan. Ghost of Tsushima does a better job than AC could ever hope for.",
            "score": -10,
            "replies": [
                {
                    "author": "PaladinHunter",
                    "body": "yeah maybe if ghost had as many stealth mechanics that come with playing Naoe, but it doesn’t. And for a game where I’m supposed to be a ghost or an assassins I’d like for shadows to be hiding places. Such a simple stealth mechanic that has been here since thief and splinter cell. Assassins creed finally has it, and ghost of Tsushima probably never will.",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "crezant2",
            "body": "I’ll just say the same thing I said about Veilguard before it came out: I hope it flops, because the drama has been so much more entertaining than the game itself could be🍿🍿🍿",
            "score": -3,
            "replies": []
        },
        {
            "author": "AndrewWhite97",
            "body": "Ah we can see the paid-off reviews now.",
            "score": -9,
            "replies": []
        },
        {
            "author": "ItsEthanCoolCool",
            "body": "Whelp. Looks like I gave it the lowest score on all of MetaCritic. AMA. \n\n[https://www.dualshockers.com/assassins-creed-shadows-review/](https://www.dualshockers.com/assassins-creed-shadows-review/)",
            "score": -7,
            "replies": [
                {
                    "author": "DazZani",
                    "body": "Was the stealth any good? Its what im looking forward the most",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "countryd0ctor",
            "body": "Is this a return to form, too?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Cyberwolfdelta9",
            "body": "Im just seeing people attack other people who are enjoying the game I haven't even seen Actual reviews",
            "score": 0,
            "replies": []
        },
        {
            "author": "Kourtos",
            "body": "Same Ubisoft. Same",
            "score": -1,
            "replies": []
        },
        {
            "author": "Ice-Fight",
            "body": "This games gonna bloooooooooooow",
            "score": -1,
            "replies": []
        },
        {
            "author": "Jaksebar",
            "body": "Not worth buying",
            "score": -1,
            "replies": []
        },
        {
            "author": "BagSmooth3503",
            "body": "I can't believe people even buy these games still. Ubisoft slop.",
            "score": -2,
            "replies": []
        },
        {
            "author": "CyanJackal",
            "body": "A reminder that Ubisoft needs this game to be a success if they want to continue being a company. If there ever was a time to be massaging reviewer approval, this is the time.",
            "score": -9,
            "replies": [
                {
                    "author": "WelpSigh",
                    "body": "Reviews are pretty similar to the previous AC games so doesn't seem like they did much. 80/100 scores aren't anything to write home about ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impossumbear",
            "body": "This is a reskin of Origins with a couple of minor tweaks.  Hard pass.",
            "score": -13,
            "replies": []
        },
        {
            "author": "Ironboss49",
            "body": "This is why you don’t judge a game before it comes out, EVEN if it’s made by a disgusting company like Ubisoft. Every game deserves a chance. Absolutely hate it when people sheep hate on games before they come out. Even if it’s a game I’m personally not excited for. It just isn’t right.",
            "score": 0,
            "replies": []
        },
        {
            "author": "shgrizz2",
            "body": "IGN giving an AC game an 8 meast it's basically a 6.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Express-World-8473",
            "body": "I'll wait two years and watch the 2 hours long review by White light.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BMoreBeowulf",
            "body": "Glad to see such positive buzz about it! Can’t wait to give it a go after I finished Metaphor.",
            "score": 0,
            "replies": []
        },
        {
            "author": "raumgleiter",
            "body": "Funny how many reviews talk about the story being so bad. But then there are some saying it's \"fantastic\". Proofs again that each review is just one opinion of one reviewer.\n\nStill wondering now why many think it's bad.",
            "score": 0,
            "replies": []
        },
        {
            "author": "HistoricalWincest",
            "body": "This will hopefully be the final nail in the coffin for Ubishit.",
            "score": -23,
            "replies": [
                {
                    "author": "zonecapitalx",
                    "body": "If you post this exact same thing a few more times like you already have I’m sure it’ll come true. Cope harder",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Flipmeister13",
            "body": "Promising reviews.. I hope this game does well.. A good AC is such a treat..\n\nFor me personal the part of \"stealth\" is of putting. I suck at stealth.. I'm the \"coming in with blazing guns\" type of guy. I liked the Greece and Egypt ones (I suck at names.. Sorry)..",
            "score": -2,
            "replies": []
        }
    ]
}