{
    "title": "Nintendo's Palworld lawsuit \"came as a shock\" to Pocketpair because patent infringement was \"something that no one even considered\"",
    "author": "Laughing__Man_",
    "subreddit": "PS5",
    "rank": 16,
    "score": 737,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 309,
    "url": "https://www.gamesradar.com/games/survival/nintendos-palworld-lawsuit-came-as-a-shock-to-pocketpair-because-patent-infringement-was-something-that-no-one-even-considered/",
    "id": "1jdsrag",
    "selftext": "",
    "comments": [
        {
            "author": "RandomDudeinJapan",
            "body": "Palworld devs probabl after getting sued:\n\nhttps://preview.redd.it/76kfab1rpcpe1.png?width=778&format=png&auto=webp&s=62dd9ae8ed407e71e4c451f4b2772589294d26e0",
            "score": 844,
            "replies": [
                {
                    "author": "sleeper4gent",
                    "body": "i think you mean :\n\nhttps://preview.redd.it/gg81brjsvcpe1.jpeg?width=640&format=pjpg&auto=webp&s=197a85965df02f369755f993d16ac0f32731b344",
                    "score": 1332,
                    "replies": [
                        {
                            "author": "dikicker",
                            "body": "My god yes",
                            "score": 76,
                            "replies": []
                        },
                        {
                            "author": "Cipherpunkblue",
                            "body": "*slow clap*",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "papasoulless",
                            "body": "😂",
                            "score": 59,
                            "replies": []
                        },
                        {
                            "author": "theogkinglion",
                            "body": "🏅",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "SYLOK_THEAROUSED",
                            "body": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dtsung",
                    "body": "The only appropriate response in this context",
                    "score": 38,
                    "replies": []
                }
            ]
        },
        {
            "author": "AwesomePossum_1",
            "body": "Did your lawyer tell you to say that?",
            "score": 399,
            "replies": [
                {
                    "author": "hunterzolomon1993",
                    "body": "I mean it makes sense because how were they to know Nintendo would after Palworld released worldwide take out a patent on something that wasn't patented when Palworld was made and released and then sue them for it.",
                    "score": 152,
                    "replies": [
                        {
                            "author": "B-Bog",
                            "body": "This is false. The original patent was filed in 2021, long before Palworld came out. All Nintendo did in 2024 was to split it up into multiple divisional patents.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "Possible-Emu-2913",
                                    "body": "Palworld was announced in 2021.",
                                    "score": 108,
                                    "replies": [
                                        {
                                            "author": "B-Bog",
                                            "body": "And this is relevant, how, exactly?",
                                            "score": -122,
                                            "replies": [
                                                {
                                                    "author": "ObjectiveSock1015",
                                                    "body": "Because they patented something when they knew a pokemon like game was coming out.",
                                                    "score": 83,
                                                    "replies": [
                                                        {
                                                            "author": "erichf3893",
                                                            "body": "Even if it wasn’t patented these guys are clearly full of it\n\nI get that they want their bread but the fact they were shocked to be sued is hilarious and a blatant lie",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ObjectiveSock1015",
                                                                    "body": "They aren't being sued for creature design. They're being sued for mounting creatures and capture devices.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "erichf3893",
                                                                            "body": "Thanks cap",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Anything_Random",
                                                                            "body": "The capture device patent was actually overturned already. The only patent left standing is the creature mounting one.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DEZn00ts1",
                                                                                    "body": "Wouldn't all they would have to do to win would show games that have creature mounting capabilities the other patent isn't applicable? Like creature mounting is already in many games and some before Pokémon even existed.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Anything_Random",
                                                                                            "body": "My understanding is that in the US to get a patent granted you need to show that what you’ve created is both novel and useful, so what Pokemon needs to demonstrate is that the way they’ve implemented creature mounting is somehow different than other games (and there’s no limit to how minuscule this difference is), but more importantly they need to prove that the way they’ve done things is in some way important and useful to the extent that it merits patent protection.\n\nThat’s what they need to prevent their patent being overturned, but to then win their lawsuit against Palworld all they need to show is that Palworld violated the exact specific implementation of the patent, nothing else is necessary or relevant.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Personal_Ad9475",
                                                                    "body": "They had consulted with multiple lawyers before releasing the game to make sure they were 100% clean (which they were clean that's why Nintendo is filing the patents)",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "erichf3893",
                                                                            "body": "Yeah I read the article too",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Personal_Ad9475",
                                                                                    "body": "You mean every article that has covered it?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "erichf3893",
                                                                                            "body": "Everything you said is in this one, so I don’t really see your point",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Personal_Ad9475",
                                                                                                    "body": "I'm just saying that every article covering it has said the same thing I just said, except for the obvious Nintendo shills",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "B-Bog",
                                                            "body": "So what? Palworld was multiple years off from release, they could've easily avoided any patent infringement. But ripping off Pokemon was more important....",
                                                            "score": -92,
                                                            "replies": [
                                                                {
                                                                    "author": "PM_ME_UR_CIRCUIT",
                                                                    "body": "Let's not lose sight of the fact that patenting game mechanics is scummy as fuck. Copyright your code, go for it, but to patent the idea of a video game mechanics is shitty behavior and should 100% be discouraged. Look at what happened with the nemesis system.",
                                                                    "score": 72,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "ObjectiveSock1015",
                                                                    "body": "The point is, pokemon saw a competitor that was doing a more mature version of Pokemon (that had everything plus more, that fans had been asking for for years) and said \"no, competition isn't what we want\" so they patented things so they can stiffle their competitors. Do you think Pokemon should be the only monster collecting game? Do you think COD should be the only shooter? Do you think StarCraft should be the only RTS game?",
                                                                    "score": 49,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Buddhabelly2016",
                                                                            "body": "I agree patents stifle competition. But it’s also the only legal way right now to protect what you have created/invented… which seems fair to me that folks shouldn’t get to copy something you created/invented (without some form of compensation)",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ObjectiveSock1015",
                                                                                    "body": "That's fair but one of the patents is literally riding on animals. Pokemon is literally patenting whatever and hoping it sticks so they have more ammo on palworld and other monster hunting games.",
                                                                                    "score": 16,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "kr4ckenm3fortune",
                                                                                            "body": "Now, i wish Peta had won their lawsuit against Nintendo over Pokemon....",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "B-Bog",
                                                                            "body": "What a load of nonsense. First of all, absolutely nobody ever asked for Pokemon to become a shitty survival game where you have to punch trees and rocks 5000 times to be able craft a Pokeball lol. I don't even remember anybody asking for Pokemon with guns (which, some Pokemon have had guns since Gen 1, they just don't fire bullets, but that's kinda besides the point)\n\nSecond, other monster collecting games have existed FOR DECADES. Nintendo has never sued any of them. And why might that be? Hmmm, could it maybe have sth to do with the fact that none of those competitors got as close in creature designs as they legally could and then basically marketed their whole game off being \"Pokemon with guns\"? Naaah, that can't be it. Nintendo is just mean and greedy!!11",
                                                                            "score": -11,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ObjectiveSock1015",
                                                                                    "body": "They maybe didn't specifically mention all of palworlds specific traits, but they certainly have been asking for a pokemon game with better graphics, more mature themes, the open world battle system, an open world environment that doesn't put you on rails etc. etc. etc.\n\nThere are other monster collecting games, just none that are good. They're too afraid of doing anything remotely close to pokemon or trying to build on pkmns systems (but making it their own) and make them better, hence why no one plays other monster collecting games. Monster collecting games are afraid of getting sued by Nintendo and Pokemon, a notoriously sue happy company.",
                                                                                    "score": 15,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "fluke1030",
                                                                                            "body": "Erm.. No? There are a lot of good MonColle games out there and a lot of people are playing it. Cassette Beasts, Monster Sanctuary, even big name like Digimon have good games.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ObjectiveSock1015",
                                                                                                    "body": "Cassette beasts have a daily player count of 200 people and 2700 all time peak, monster sanctuary has a 200 daily player count and a 1300 all time peak. If they had the player base palworld does (50,000 daily and 2,100,000 peak) theyd be getting sued too.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "fluke1030",
                                                                                                            "body": "Both games is available on other consoles as well. You can't use only steamdb to count the player base.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ObjectiveSock1015",
                                                                                                                    "body": "I've never seen the game advertised, never heard them being talked about, don't know a single person that's heard or played them. I didn't hear about them until this thread. They are not successful, plain and simple.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "B-Bog",
                                                                                            "body": "The games are still not even in the same genre, though. Pokemon is a JRPG, Palworld is a survival game like Ark or Rust. You cannot get your Pokemon fix from playing Palworld and there is probably a sizeable disparity in target demographics, as well. So Palworld is unlikely to have any serious impact on Pokemon sales numbers whatsoever and Nintendo probably would not have paid any attention to the game had it had more original creature designs that didn't intentionally give the impression of \"Pokemon with guns\" and not used rip-off Pokeballs.\n\nAs for the second point, that's just not true. Cassette Beasts, for example, does exactly what you are talking about. It plays pretty much exactly like top-down Pokemon, only with a few new ideas thrown in. So why didn't they get sued, then? Because they came up with their own creature designs, that's why.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ObjectiveSock1015",
                                                                                                    "body": "So if palworld wasnt satiating the consumers pokemon itch( I know it did mine) and not pulling in a massive amount of pkmn players, why is pokemon suing something that supposedly isn't even their competition, and now is having to retroactively patent things like *checks notes* riding animals and dismounting? \n\nI've never heard of beast cassettes or know a single person that's played it. It has an all time peak of 2700 players. I guarantee you if it had the success palworld had Nintendo would be suing as well. They are kinda known to sue at the drop of a hat.\n\nPokemon is literally suing palworld over capture devices, and riding the creatures.",
                                                                                                    "score": 8,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "B-Bog",
                                                                                                            "body": "\"Pokemon\" isn't suing anybody, it is Nintendo. And they didn't \"retroactively\" patent anything lol, not sure what that is even supposed to mean. Also, that one patent is not just about riding creatures in general, mounts of various forms exist in tons of other video games. Rather, from what I understand, it is specifically about the process of instantly summoning mounts in mid-air like was first seen in Arceus.\n\n>I've never heard of beast cassettes or know a single person that's played it\n\nOK, it is still an example of the very thing you claimed doesn't exist because everybody is supposedly too afraid of Nintendo lol  \n\n\n>I guarantee you if it had the success palworld had Nintendo would be suing as well\n\nAnd how exactly did Palworld become so successful? What was the thing that set the internet ablaze? This is the very point Ive been making the whole time here: Palworld would not have gotten anywhere near the attention it did if it had not, very purposely, ripped off Pokemon's creature designs as closely as legally possible and then handed them firearms in a calculated move to have people go \"IT'S POKEMON WITH GUNS DUDE!!!\". Them also ripping off Pokeballs was really only the icing on the cake.\n\nWhich, from Nintendo's POV, is a total nightmare in terms of brand protection (or, more specifically, avoiding brand confusion), but they couldn't sue over the legally distinct ripoff designs, so they came up with the next-best thing.\n\n>They are kinda known to sue at the drop of a hat.\n\nWhich is probably why they have almost never sued any other company over the hundreds of gaming patents they hold? lol",
                                                                                                            "score": 4,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Kiwi_In_Europe",
                                                                                                                    "body": ">And how exactly did Palworld become so successful? What was the thing that set the internet ablaze? This is the very point Ive been making the whole time here: Palworld would not have gotten anywhere near the attention it did if it had not, very purposely, ripped off Pokemon's creature designs as closely as legally possible and then handed them firearms in a calculated move to have people go \"IT'S POKEMON WITH GUNS DUDE!!!\". Them also ripping off Pokeballs was really only the icing on the cake.\n\n>Which, from Nintendo's POV, is a total nightmare in terms of brand protection (or, more specifically, avoiding brand confusion), but they couldn't sue over the legally distinct ripoff designs, so they came up with the next-best thing.\n\nIf this was the perspective of the gaming industry from the get go, gaming would have never become what it is today. Imagine Romero suing Duke Nukem 3D because it copied shooting and movement mechanics as well as hud design and other artistic similarities. Same with the competition between Quake and Unreal Tournament. Imagine every shooter after doom being forced to remove rocket jumping, or in legalese \"the action of moving rapidly in a given direction due to player controlled explosives.\"\n\nRegardless of how derivative they are, you correctly admitted that creating cute monster designs is not illegal. There is nothing that makes what Palworld is doing worse than say what Pocket pair originally did making various similar designs to monsters from SMT, or what Marvel and DC have been doing with each other for years. And as we've established, patenting game mechanics is an abhorrent practice in the industry that just holds games back. There's a reason you can only find a handful of examples and only from the scummiest companies.\n\nI'll never understand why some people have an obsession defending large corporations. I'll never glaze Palworld, I think it's a fun game but nothing particularly special, but no developer deserves to be sued in anticompetitive, abusive ways to stifle fair and legal competition.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "B-Bog",
                                                                                                                            "body": ">There's a reason you can only find a handful of examples and only from the scummiest companies.\n\nThis is extremely untrue. Japanese gaming companies especially patent stuff all the time as a protection from outside patent trolling. They just usually never sue each other over these mechanics. However, obviously rip off another company's character designs in a legally distinct way and hand them guns, even though that franchise and company is notiorusly kid-friendly, and the gloves may come off. \n\n>than say what Pocket pair originally did\n\nYeah, because PP are creative leeches that never had an original idea in their lives. Their last game was a shitty BotW clone down to recreating Bokoblin camps (only without the amazing system-based gameplay, of course) and Palworld rips off stuff not only from Pokemon, but also Dark Souls/Elden Ring, Fortnite, survival games like Ark and Rust etc. I have no sympathy for these people and framing it as if they of all studios are somehow fighting a fight for creativity and innovation and fair competition is irony of the highest order.\n\n>abusive ways to stifle fair and legal competition\n\nPP could've simply come up with their own creature designs (and not ripped off Pokeballs, too), and I doubt Nintendo would've had any problem with their game, just as they never had any problems with Digimon or Monster Rancher or Cassette Beasts or god-knows how many other monster-catching games/franchises.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "_NovaZero_",
                                                                                    "body": ">First of all, absolutely nobody ever asked for Pokemon to become a shitty survival game where you have to punch trees and rocks 5000 times to be able craft a Pokeball lol.\n\nAbsolutely nobody asked for Pokemon to become whatever \\**gestures vaguely at Scarlet and Violet, BDSP, the addition of paid DLCs*\\* THAT is, but TPCI/GF/Nintenderp did it anyway.\n\nPretty sure it was just for money, so yeah, they are pretty fucking greedy.",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "B-Bog",
                                                                                            "body": "I am definitely not arguing in favour of the state of modern Pokemon, lord knows the games have their problems. But the claim here was that Palworld is a better version of Pokemon that the fans have been demanding, which it isn't, it's a totally different game in a different genre that just rips off certain select elements from Pokemon, mostly for marketability (as it rips off plenty of other stuff from other games, too; the whole affair is a hodgepodge of stolen ideas, as were Pocket Pairs previous games)\n\nAs for money, Nintendo is suing for a grand total of....drumroll.....$65,700.",
                                                                                            "score": 4,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "TragGaming",
                                                                                            "body": "People were asking for Pokemon open world for ages\n\nBDSP is just a straight Sinnoh remake, which people were indeed asking for.\n\nYoure wrong on both accounts lmao",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "[removed]",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "None",
                                                                                                            "body": "[removed]",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "[removed]",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "None",
                                                                                                                            "body": "[removed]",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "None",
                                                                                                                                    "body": "[removed]",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "None",
                                                                                                                                            "body": "[removed]",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "None",
                                                                                                            "body": "[removed]",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "[removed]",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "None",
                                                                                                                            "body": "[removed]",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "None",
                                                                                                                                    "body": "[removed]",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "None",
                                                                                                                                            "body": "[removed]",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Lesismore79",
                                                                                    "body": "Oh look a wild Pokébro has appeared, it uses Butthurt, it's not very effective",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Lesismore79",
                                                                                    "body": "A wild Pokébro has appeared, it uses butthurt . . .it's not very effective",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "B-Bog",
                                                                                            "body": "Very creative answer, almost at the levels of Pocket Pair's output 👍\n\nAlso, I can count the number of Pokemon games I have played in my life on one hand lol. If  Pokemon stopped existing as a franchise altogether from one day to the next, I would be completely fine. I just don't like creative leeches.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Indigo__11",
                                                                            "body": "Bruh you have any idea how many Pokémon clones there is? And WHO is asking for Pokémon with guns (“fans have been asking for” what?). \n\nSo why would Pokémon care or even react this quickly to another Pokémon clone being announced",
                                                                            "score": -8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ObjectiveSock1015",
                                                                                    "body": "If you keep reading the thread, you'll have your answer to the first question.",
                                                                                    "score": 12,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Indigo__11",
                                                                                            "body": "No there ain’t, every point was addressed by B-Bog. So it doesn’t answer my comment",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ObjectiveSock1015",
                                                                                                    "body": ">Fans have been asking for what?\n\nIf you would've kept reading you woulve seen my answer. Here I'll post it again for you. \n\n\n>They maybe didn't specifically mention all of palworlds specific traits, but they certainly have been asking for a pokemon game with better graphics, more mature themes, the open world battle system, an open world environment that doesn't put you on rails etc. etc. etc.",
                                                                                                    "score": -1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Pizzaplanet420",
                                                                                    "body": "There really isn’t that many pokemon clones….\n\nMaybe in the mobile space? But for console \nand pc gaming? Barely any at all.\n\nIf you can list more than 5 I’d concede my point.",
                                                                                    "score": 7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Indigo__11",
                                                                                            "body": "As the other person there replied to you, there are tons. \n\nSo why would Pokémon care when another one was announced ones again",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ObjectiveSock1015",
                                                                                                    "body": "Because no one plays those games, they might as well not exist.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Indigo__11",
                                                                                                            "body": "So why are ya’ll saying that Nintendo freaked out and made a patent against Palworld when Palworld was another of the many Pokémon clones when announced",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ObjectiveSock1015",
                                                                                                                    "body": "Because  palworld was pulling literally pulling 100 times as many players as any of the other monster collecting games. It was seen as a direct competition to pokemon. Those other games are a garage sale with some tools for sale, Pokemon was home Depot and palworld was lowes",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Indigo__11",
                                                                                                                            "body": "Was Palworld pulling 100x the players compared to other Pokémon clones in 2021?",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "ObjectiveSock1015",
                                                                                                                                    "body": "Not in 2021 but when it came out yes. Palworld had some hype around it when it was announced in 2021. More hype than any of the other monster collecting games.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Indigo__11",
                                                                                                                                            "body": "Did it though? Compared to already more established Pokémon clones like TemTem\n\nYour whole point is that Nintendo only filed the patent due to Palworld when palwrold at the time was just another Pokémon clone",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "ObjectiveSock1015",
                                                                                                                                                    "body": "Established? Temtem has 300 daily players. You are mentioning games that don't have an impact on Pokemon. Palworld did make an impact on Pokemon and is maintaining roughly 50k players a day.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Indigo__11",
                                                                                                                                                            "body": "Bro TemTem is 5 years old and wasn’t released last year like Palworld, that game for a single player ingot game was more established",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "ObjectiveSock1015",
                                                                                                                                                                    "body": "Nobody plays temtem. Pokemon applied for the capture devices and mounting animals patent in February 2024, one month after palworld was released.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Indigo__11",
                                                                                                                                                                            "body": "Dude what is this cope? For a indie single player game people absolutely played TemTem, it was more well known in 2021 then Palworld was, why do you keep denying this.\n\nAnd the patent that Palworld infringed was done in 2021",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "ObjectiveSock1015",
                                                                                                                                                                                    "body": "36,000 concurrent players is their all time peak, that's a very small number for an all time peak. It wasn't competing against pokemon. What patent are you talking about? Nintendos suit against palworld has to deal with Mounting Creatures and capture devices. Both of which were applied for in Feb of 2024. This is what Nintendo is suing Palworld for:\n\n\nPatent No. 7545191: Patent application date: July 30, 2024, Patent registration date: August 27, 2024 \nPatent No. 7493117: Patent application date: February 26, 2024, Patent registration date: May 22, 2024 \nPatent No. 7528390: Patent application date: March 5, 2024, Patent registration date: July 26, 2024 \n\nGame Mechanics at Issue:\nCreature Capture: The patents cover the mechanic of throwing a ball to capture and possess a character in virtual spaces, which is similar to the Pal Spheres used in Palworld. \nMounting Creatures: The patents also cover the mechanic of riding objects or creatures, including the ability to summon flying Pals for quick traversal, which is present in Palworld. \nTiming of Palworld Release:\n\n\nPalworld launched in early access on January 19, 2024, which is before the patents were applied for and registered. \n\nNotice how all those patents are well after the release date of palworld.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Indigo__11",
                                                                                                                                                                                            "body": "After doing some digging, the patent you are talking about was based on the previous patent Nintendo has done before, which is the 2021 that people brought it up here. They filed ANOTHER patent last year as well",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "ObjectiveSock1015",
                                                                                                                    "body": "Because  palworld was pulling literally pulling 100 times as many players as any of the other monster collecting games. It was seen as a direct competition to pokemon. Those other games are a garage sale with some tools for sale, Pokemon was home Depot and palworld was lowes",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "jer31173",
                                                                                            "body": "Nexomon, Nexomon: Extinction, Palworld, cassette beasts, tem-tem, coromon, digimon, I'm sure there's more but those are the ones I know I've played.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Cynixxx",
                                                                                    "body": ">And WHO is asking for Pokémon with guns\n\nAmericans probably, they love and worship guns",
                                                                                    "score": -8,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "trashvineyard",
                                                                            "body": "Your argument would hold more water if Palword didn't blatantly rip off a lot of Pokèmons designs too.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ObjectiveSock1015",
                                                                                    "body": "They aren't being sued for creature designs, they are being sued for mounting/riding creatures and using capture devices. Your argument doesn't hold water.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Peac0ck69",
                                                                                    "body": "I don’t think it’s fair to compare Pals to Pokémon in that way when Pokémon are mostly based on real life animals to begin with. \n\nYou can’t say “well we’ve got a pokémon based on a sheep so you can’t have a pal that looks like a sheep”.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Dultsboi",
                                                                    "body": "https://preview.redd.it/hijtkgpm5fpe1.jpeg?width=1170&format=pjpg&auto=webp&s=5944f21dee776a595a7a975bce124b085fd931ec",
                                                                    "score": 7,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Imaginary_Dig_5014",
                                                                    "body": "Lmao Pokémon also ripped them off in several ways for their new game. I have nothing against the Pokémon games. But Nintendo is a joke. They are being bullies and made because Pokémon is the only thing really keeping their company afloat. And mad because a lot of people refer to palwolrd as a \"Pokémon like game\" and its 100% better than any video game they have or will make 😂",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "B-Bog",
                                                                            "body": "Couldn't be more wrong if you tried lol. Look at the sales numbers for games like Mario Kart 8 Deluxe or Animal Crossing New Horizons. Yes, Pokemon is Nintendo's biggest money maker, but they would still be very successful without it.\n\nAs for Nintendo being \"bullies\", I have already addressed that nonsense in so many other replies, I won't bother to repeat myself here.\n\nEdit: dude apparently had to block me out of fear lol, hilarious",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Imaginary_Dig_5014",
                                                                                    "body": "Okay buddy hang on to your cope before you lose it. 😂",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Silver_Wolf_Dragon",
                                                                    "body": "Damn so Nintendo should go after TemTem too? Ya know since it's the same premise of capturing Tems(monsters) and adding them to the party, TemTem released in 2020",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "B-Bog",
                                                                            "body": "TemTem didn't rip off Pokemon designs in order to market their game as \"POKEMON WITH GUNS DUDE\". I have explained this point in so many replies now, I wish people like you would simply read what is already here instead of bringing up the same dumb talking points that I have already responded to again and again.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Possible-Emu-2913",
                                                    "body": "Don't play the damn fool. Palworld gets announced, Nintendo sees what Palworld is and then they rush to their lawyers to patent a gameplay mechanic. Then Nintendo waited until Palworld made a lot of money and finally sued them.",
                                                    "score": 26,
                                                    "replies": [
                                                        {
                                                            "author": "B-Bog",
                                                            "body": ">Nintendo would after Palworld released worldwide take out a patent on something that wasn't patented when Palworld was made and released and then sue them for it.\n\nThis was the claim I responded to. And it is patently (harrharr) false, whatever you think Nintendo's motivation was to file those patents (which, btw, Japanese gaming companies file all sorts of patents all the time, it's not like this is anything unusual). And, seeing as Palworld wouldn't come out until 2024, I'd say PP had more than ample time to adjust their game to where it doesn't infringe on any patents from the franchise they were obviously ripping off. I mean, they were smart enough to go just as far as legally possible with their creature designs, after all lol\n\nAlso, Nintendo isn't even asking for a lot of money, so that \"waiting until it made a lot of money\" doesn't make any sense (and as if Nintendo, as one of the richest companies in Japan, needs pocket change from PP lol). The lawsuit is probaby more about brand protection than anything else because Pocket Pair chose to brazenly market their game off the back of Nintendo's biggest franchise.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "520throwaway",
                                                                    "body": ">  Also, Nintendo isn't even asking for a lot of money, so that \"waiting until it made a lot of money\" doesn't make any sense\n\n\nThat's because their main ask is to literally take PalWorld off the market.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "B-Bog",
                                                                            "body": "Yup.",
                                                                            "score": -2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Whole_Thanks_2091",
                                                                    "body": "Genre monopolizing you mean. Basically, no one can make a successful game in the cute/cool moncatch  genre without pokemon shutting them down. The changes to their patents are the same level of corporate mafia as the changes to mickey mouse patent so the house of mouse keep the rights indefinitely.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "tcpgkong",
                                                    "body": "and why would Pokemon patent exactly that in 2021, the same year as Palworld is announced, when Pokemon itself has been around for 20+ years before that?",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "PotatEXTomatEX",
                                                            "body": "Not sure if you're aware, but its standard in Japan. Bamco is holding on THOUSANDS of patents just for gaming alone.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "B-Bog",
                                                            "body": "Why not lol? They don't owe anybody anything, they can file whatever patent they want whenever they want. Better question: Why would Pocket Pair not make sure they are not infringing on any patents from the franchise they are clearly ripping off and marketing their whole game off of?",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "ACO_22",
                                                                    "body": "Mind blowing that you’re defending Nintendo on this. \n\nTrying to create patent infringement to stifle other games because you don’t want something else that’s not even on any of the consoles you release in is crazy.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "B-Bog",
                                                                            "body": "It's not mindblowing at all. PP could've simply come up with their own creature designs like plenty of other monster-catching franchises did instead of ripping off the ones of the biggest media franchise in the world and handing them guns. But then absolutely nobody would've cared about their mediocre survival game. Play stupid games, win stupid prizes.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ACO_22",
                                                                                    "body": "It was literally cleared legally in Japan which is why it’s mind blowing. \n\nThey checked beforehand and was given the all clear only to be hit by fucking patent infringement in a game. Something that is widely considered taboo and wrong (looking at you nemesis system) \n\nDefending patent infringement in gaming is pathetic\n\nYeah, the stupid prize they won was a fuck ton of money.\n\nThey’re also not going after PP for creature designs, so your issues are irrelevant",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "B-Bog",
                                                                                            "body": "The creature designs were cleared, sure. As I have said plenty of times in other comments now, they are \"legally distinct\". It is still blatantly obvious to anybody with working eyeballs that they intentionally got as close to the Pokemon designs as they could without infringing copyright and then brazenly showed off those creatures with guns in the trailer to market their game.\n\nAnd I'm well aware that the suit is not about the designs. But that doesn't mean that the ripped-off designs are not the reason behind why Nintendo chose to sue in the first place. Because they, like basically all other big Japanese gaming studios, actually hold a shitload of patents over which they could sue all kinds of companies for. But they usually never do (because the Japanese gaming industry holds these patents mainly as protection from outside patent trolling). So it really doesn't take a genius to figure out what is going on here.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ACO_22",
                                                                                                    "body": "Right, so your idea is Nintendo are using this obscure broad patent infringement to sue over something that was legally cleared, and you’re here defending them for it haha. That’s an even worse explanation than just suing them for the actual patent infringement \n\nThere’s a reason why Japanese patent infringements aren’t taking paticularly seriously in the west. It’s because they patent something so broad that it could come up in so many things that it’s just not serious. \n \n\nPP wont lose this, and I look forward to Nintendo being knocked back a bit. Hopefully this opens the floodgates to more games.",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "B-Bog",
                                                                                                            "body": "It's neither obscure nor broad, PP could've very easily avoided the patent infringements, especially the Pokeball one, which they demonstrated themselves by swiftly patching it out after the lawsuit got filed. But then maybe not as many people online would've gone crazy with the \"IT'S POKEMON WITH GUNS DUDE\" hype, which was the whole play here.\n\nAgain: Nintendo is suing mainly as a matter of brand protection. Also again, they cannot do so over the designs themselves, even though they are very obvious ripoffs, so they chose the patents. And you are batshit crazy if you think that other companies wouldn't act in the same way, given the chance. If you made e.g. a legally distinct Astrobot copy with a real gun that sets the internet ablaze, I bet Sony wouldn't be all too pleased and looking at all their options, too.\n\n>Hopefully this opens the floodgates to more games.\n\nThe \"floodgates\" have been open for decades lol. Digimon exists. Monster Rancher exists. Even SMT/Persona. Indies like Cassette Beasts. None of them had ever had a problem with Nintendo. Hmmm I wonder why....",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Buddhabelly2016",
                                                            "body": "Yeah, like the guy said “why not”. In the US patent system you can file patents for something you created in the past, as long as you are able to prove when you created it when you file for the patent.\n\nI mean, otherwise protecting what you invent/create would be prohibitively expensive, requiring \npre-emptive (and costly!!) patent filing as the creator/inventor is developing their goods.\n\nIt would turn R&D to something only viable to folks with deep pockets (aka the rich or big companies). These type of entities already triumph enough as it is…",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Beasthuntz",
                                                    "body": "A game is in development long before it is announced. ",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "B-Bog",
                                                            "body": "Who gives a shit? It's not Nintendo's or any other company's job to check out what games are in development before they file a patent lmao. Palworld could've simply not ripped off Pokemon in a legally distinct way and given those ripff designs guns, thereby creating lots of possible brand confusion for Nintendo's biggest money maker, and they never would've attracted Nintendo's ire in the first place. But they had to do that in order for their mediocre survival game to get the attention that it did, so here we are.",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "Beasthuntz",
                                                                    "body": "Context matters, champ. Your misplaced anger doesn't change the fact that you don't understand the situation and no amount of screaming and using \"big words\" is going to help you out of the hole.\n\n\nFacts matter and that's the game was in development before the patent was filed, thus making your entire argument goofy and void. Don't ask questions if you can't handle simple answers that destroy your entire argument.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "B-Bog",
                                                                            "body": "Not sure what \"big words\" I used here lol, or where you think I was screaming. I think this reply honestly says more about you than about me or the situation at hand.\n\nAgain: A game merely being in development has zero bearing on the ability of another company to file any kind of patent. It is the job of the company developing the game to make sure they don't infringe on any patents, especially not patents connected to the giant gaming franchise they are obviously ripping off and on whose back they are marketing their game. They did have the foresight to get legal counsel on the creature designs, after all.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Beasthuntz",
                                                                                    "body": "You really have to follow the context of your argument. You asked a question, people answered and then you ask, \"what difference does it make?\"\n\n\nThe game was in development before the patent was put out- so Nintendo could have easily done some shady dealings. Because the patent isn't over art style, it's over a gameplay mechanic. \n\n\n\"It's the job of the company developing the game to make sure they don't infringe on any patents...\"\n\n\nWhich you've repeatedly been informed that the game was in development BEFORE the patent. ",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "B-Bog",
                                                                                            "body": "Bro, I don't know what language to say this to you in: The game merely being in development is totally irrelevant. It doesn't change anything. The initial claim to which I responded here was that Nintendo filed the patents after Palworld **released,** which would have had very obvious implications for the validity of their lawsuit. However, that claim is not true, as established. Simply having started the development of a game doesn't somehow entitle you to not have to change said game to comply with the law as is exists when the game actually releases.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Beasthuntz",
                                                                                                    "body": "It's not irrelevant- that's context to your entire argument. The problem is you're trying to make an argument and case with a pre-conluded end. That's not intelligence speaking. It's quite opposite.\n\n\nContext matters: you made a claim and you were repeatedly told the game was in development before Nintendo filed a patent. End of conversation.\n\n\nNow, it's up to the court's to decide the timing of the patent and corporate espionage....etc. Was Nintendo tipped off. There's a whole world behind your cut and dry pre-concieved conclusion. \n\n\nThat's on top of it being laughable that you remotely care what companies are doing. Buy the games or don't. Do you act this silly over your favorite brand of french fries or bread? ",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DragonborReborn",
                                    "body": "Sorry do you think games only take 6 months to develop?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "B-Bog",
                                            "body": "Already been down this conversational route before with somebody else, read what is already here.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "DragonborReborn",
                                                    "body": "Yeah I did read it. You don’t understand how the world works. It’s okay",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "WingerRules",
                                    "body": "How can they patent something in 2021 that was an open concept for almost 30 years?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "B-Bog",
                                            "body": "Wdym \"how\"? They filed a patent that nobody else had filed before and it was accepted by the patent office. That's it. Also, I'm not aware of that specific mount summoning mechanic appearing in any other game before Arceus, but I could be wrong.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "whatadumbperson",
                                            "body": "You can't in most parts of the world. There's a reason they only have the patent in Japan. Personally, I'd just tell Japan to kick rocks and sell the game everywhere but there. I'm petty and there's a reason I don't own a successful game company.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Nonadventures",
                                    "body": "What is the patent on? Cockfighting?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Personal_Ad9475",
                                    "body": "And the only reason they did that was because the single patent wouldn't win the case, it's a scummy strategy used by a scummy company.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ExtendedSpikeProtein",
                            "body": "You should stop spreading misinformation.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "erichf3893",
                            "body": "Even if it wasn’t patented they’re clearing riding on the coattails of Nintendo which is the only reason it got any traction",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SimpForEmiru",
                                    "body": "Exactly, the entire premise of the game itself is that it’s similar to Pokémon. Anyone who argues against this is just being dishonest ",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "hunterzolomon1993",
                                            "body": "I mean its a survival game that is way closer to ARK then anything else. It takes the capture monsters idea from Pokemon yes and the monsters are clearly based on Pokemon but the gameplay loop isn't Pokemon at all.\n\nFun fact Palworld has real time combat and the first Pokemon game released after PW will have real time combat a first for the series. Food for thought.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DisparityByDesign",
                    "body": "The age old “I didn’t know that was illegal” defense.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Alt_CauseIwasNaughty",
                            "body": "In their defense, Nintendo created the patent after palworld released specifically to sue them",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "B-Bog",
                                    "body": "Nope. They split up the original patent into multiple divisional patents in 2024, but the original one was filed in 2021.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "masterofallvillainy",
                                            "body": "After palworld was announced... In 2021",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "B-Bog",
                                                    "body": "Which was not what was claimed here lol, but you Palworld fans all seem to have the exact same braindead talking points. The game being announced doesn't change diddly-dick about the legal situation.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "masterofallvillainy",
                                                            "body": "Don't play dumb. Nintendo had over 20 years to patent. And they decide to do so only after another game is announced.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "B-Bog",
                                                                    "body": "And PP had every chance not to rip off Pokemon's creature designs and hand them guns, thereby creating lots of possible brand confusion for Nintendo's biggest money maker, or to be even slightly creative for once in their lives and come up with a different method of catching monsters before launch, but here we are :) play stupid games, win stupid prizes.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "strawberry_jelly",
                                                                            "body": "Won’t somebody think of the brand?",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "B-Bog",
                                                                                    "body": "Talk about missing the point. I am simply saying it shouldn't come as a surprise to anyone, especially not Pocket Pair themselves, that Nintendo is taking any and all legal action available to them in this case. FAFO",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Indigo__11",
                                                    "body": "Dude you have any idea how many Pokémon clones there is? Why would then rushed to make this patent for another one being announced",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "AggressiveRip9389",
                                                            "body": "Yall know pokemon isnt the original either its just the most popular",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Indigo__11",
                                                                    "body": "Dude Pokémon was released in 1996, not that many games before it that had the same concept",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AggressiveRip9389",
                                                                            "body": "So whats your point literally does nothing to rebuttal what i said",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "AggressiveRip9389",
                                                                            "body": "Dragon Quest and Shin Megami Tensei just dont exist to you huh",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Indigo__11",
                                                                                    "body": "You said Pokémon wasn’t “original” or “the original”, can you tell me other games that did its concept prior to 1996?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Indigo__11",
                                                                                            "body": "That is the same genre of jeog, not the same concept of capturing monsters with a ball and collecting them",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "AggressiveRip9389",
                                                                                            "body": "So you also cant read either?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ElHumanist",
                                    "body": "What was the patent and was it overly broad?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Still-Midnight5442",
                                            "body": "It's basically about the catching mechanics/catching with a thrown object.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "chuputa",
                                                    "body": "\"catching with a thrown object in a 3d-space and in real-time\" to be more specific.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "EffectiveShopDweller",
                                            "body": "It’s a patent for throwing a fucking ball to catch a monster.\n\nThe lawsuit is only valid because of the way Japanese laws abide. It’s a patent that was registered after palworld was already live. But it’s a “sub patent” or “daughter patent” to a older one, which in this case, the Japanese court takes into consideration the parent patent date.\n\nSo yeah, bullshits.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ElHumanist",
                                                    "body": "That is disappointing to hear from Nintendo",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "EffectiveShopDweller",
                                                            "body": "Yeah it’s completely unfair to pocket pair, seeing they put passion in that, which is a homage to Pokémon and Nintendo do that",
                                                            "score": -6,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "jkpnm",
                                                    "body": "Craftopia already got the throw ball to catch animal & that's PP game before palword. No Nintendo patent during that game",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Thisthattheother1",
                    "body": "No, their lawyer said it would be totally cool to make a pretty obvious rip off to a game from a famously litigious company.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "whatadumbperson",
                            "body": "Let me guess... you haven't played it have you? So confident about something you essentially know nothing about. Other than a handful of monster designs the gameplay isn't similar.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Esham",
            "body": "I'm always surprised how little ppl know about this. \n\nPatent infringement in japan is another beast.  Its why 22 out of the 23 they applied for in US were thrown out as it's vague stuff that would dragnet tonnes of mechanics.\n\nRemember, ZERO ip infringement occured but stuff like capturing a creature and throwing a ball to release it is a no go.  \n\nLook up their patents sometime,  its staggering and might be indicative of why nintendo games stand alone with very few copy cats coming out of japan.\n\nI bet mario jumping on a goomba is patented",
            "score": 194,
            "replies": [
                {
                    "author": "dodrugzwitthugz",
                    "body": "But do they get the nemesis system?",
                    "score": 22,
                    "replies": [
                        {
                            "author": "RESEV5",
                            "body": "Not the same as the nemesis system but watch dogs legion has some sort of grudge system/relationships between npc's which is quite cool",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SimpForEmiru",
                    "body": "I guarantee if I made a game about a Sicilian electrician jumping on mushrooms I’d be rightly sued",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Esham",
                            "body": "Lol the patents are worse than that.  \n\n One i recall being riding a creature you captured then being able to aim while on it so pocketpair removed the cross hair while riding a pal. \n\nThey eventually added it back in but that's how vague they are.  \n\nThe one that stuck is throwing a ball and having a creature pop out of the ball where it lands so now pals appear next to you when you summon them.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -28,
                    "replies": [
                        {
                            "author": "Warden326",
                            "body": "This observation isn't about patent infringement. It's about copyright infringement. My guess is they were ready to defend a copyright suit but not a patent suit.",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "GuardianOfReason",
                            "body": "Ask Hawkeye and Green Arrow, Namor and Aquaman, etc...",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -21,
                                    "replies": [
                                        {
                                            "author": "PM_ME_UR_CIRCUIT",
                                            "body": "Lmao ok... Wade Wilson <-> Slade Wilson, Deadpool to Deathstroke. \nMarvel has an almost analogous character to nearly every single DC character and vice versa.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Hexbox116",
                                                    "body": "Lets not forget omniman, superman, and goku.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RainbowIcee",
                            "body": "They were sued for the \"pokeball throwing\" they don't care the monster look alike. In fact, what the monsters look like isn't a selling point and will never really will be if you think about it. So when it comes down to it, no one really cares besides internet argument.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Coffee____Freak",
                                    "body": "The monsters were definitely a selling point. The whole reason why this game ever became popular was that it was “Pokemon with guns”",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Chillindude82Nein",
                                            "body": "Eh. For me, it was \"open world pokemon that plays quick and snappy with survival and combat elements that I can share with my son\".\n\nMy son does not know a single pokemon, but he loves browsing the paldex, exploring caves with his pals, and everything else in palworld.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "RainbowIcee",
                                            "body": "But not what they looked like, their design doesn't really matter so long as they aren't purposely ugly. They could have been regular animals with guns it wouldn't have made a difference in the long run ",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Coffee____Freak",
                                                    "body": "They wouldn’t have gone viral/been getting all this publicity if it wasn’t for their design",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "RainbowIcee",
                                                            "body": "That's only because people assumed the design would be the problem, when you can't get any clearer than a court case to say they didn't even care to sue them for it. Only people on the Internet make a case out of it, and as someone who has played almost all Pokemon games they are correct, pokemons can look like w/e so long as it's not ugly, what I mostly care about is the exciting ball mechanic that decides if I caught that legendary or not. The combat itself isn't even good, it's just matching the weakness to get that x1.5 or x2.0 damage. But catching that super legendary with a regular pokeball not a master ball? Now that's the thrill.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Yaminoari",
                            "body": "If I were to point out the differences Like all the stuff around Verdashs neck Verdashes ears being different. Verdashs eyes being way smaller.\n\nBut if were really going there Pokemon took dragonquest designs in the original and did this exact same thing. So should Square enix sue nintendo over designs?",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DADAchuYT",
            "body": "Here comes ppl who can't read and think this is about pal designs.",
            "score": 54,
            "replies": [
                {
                    "author": "Cobra_9041",
                    "body": "What’s it about then? Genuinely",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DADAchuYT",
                            "body": "To simplify, they're trying to patent the idea of summoning monsters by throwing a spherical item. They made this patent after palworld was made and then used it to sue them. Palworld had to removed the ability to summon pals by throwing the ball, they just spawn beside you now. From now on, no devs can make a game where you summon a monster using a ball or you can get sued by nintendo.",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "SinisterDexter83",
                                    "body": "Ark has used an identical system for about 10 years now. I wonder if they'll catch a lawsuit as well...",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "capekin0",
                                    "body": "So don't use a ball, use another device like Digimon did with digivices.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "ServantOfTheSlaad",
                                            "body": "Another game called Coromon uses a spinny disc like item",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "behemothbowks",
                                                    "body": "Man I really loved that game too, one of the best nonpokemon pokcet monster games I've played",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "520throwaway",
                                            "body": "I think it's any thrown object.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "MC0295",
                                                    "body": "How is this legal? It’s like if Rockstar copyrighted stealing cars for open world games",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "HumansNeedNotApply1",
                                    "body": "They weren't trying, they have this patent in Japan.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xRadiantOne",
            "body": "What's crazy to me is SMT was doing the monster on your team thing way way before pokemon did it.",
            "score": 5,
            "replies": [
                {
                    "author": "obsertaries",
                    "body": "Not way WAY before, SMT1 was 92 and Pokemon was 96. There were lots of other games like that at the time too.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "IGeneralOfDeath",
            "body": "They had never heard of the term?",
            "score": 42,
            "replies": [
                {
                    "author": "Tyrant_Virus_",
                    "body": "Patenting game mechanics is pretty rare and also considered kinda taboo among game devs. That’s why WB patenting the nemesis system then doing jack shit with it after Mordor gets brought up frequently.",
                    "score": 109,
                    "replies": [
                        {
                            "author": "MyBackupWasntRecent",
                            "body": "I FUCKING HATE WB GIVE ME MY NEMESIS SYSTEM IN OTHER GAMES I LOVE IT SO MUCH PLEASE\n\nSorry I get emotional about the nemesis system. It’s pretty good 👍🏻",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "artaru",
                                    "body": "that patent is expiring in a few years and that precise mechanic wont' be \"novel\" anymore so it can't be patented. \n\nGames can utilize it then. Honestly they can start building it now and time release with expiring of the ptaent.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Potatoman365",
                                            "body": "“A few years”\n\nIt expires in August of 2036. Over ten years from now.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "artaru",
                                                    "body": "fair enough, a few years is inaccurate. It does expire in 2035 so it'll be about 10 years. Considering game dev can take a few years it wouldn't be farfetched to think devs can start building this into their system in 5-7 years (to be released post 2035)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ElHumanist",
                                    "body": "My understanding is that they even removed it from the original game, and feel like there is something more to this.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "RayTracerX",
                                            "body": "? They did not",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "ElHumanist",
                                                    "body": "Yeah, if you Google it, it says it was removed in 2021 due to shutting down the servers it seems.",
                                                    "score": -11,
                                                    "replies": [
                                                        {
                                                            "author": "MyBackupWasntRecent",
                                                            "body": "Playing the game rn, I can still access the online stuff and the weekly community challenges are still working. Idk what shut down then",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "ElHumanist",
                                                                    "body": "> Now, Monolith has announced that online features for the game will be shut down from December 31st this year. Whilst this is perhaps understandable for a game that is now six years old, it does mean that certain aspects of the game will no longer be available to any players still enjoying the title or people who have not yet picked it up. The features affected by this change are the Nemesis Forge, Vendetta missions and leaderboards, and other social and achievement aspects of the game.\n\nhttps://www.cbr.com/lotr-shadow-mordor-servers-closing-nemesis-system/\n\nThat article is from November 2020. I am glad it is wrong.\n\nu/raytracerx",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MyBackupWasntRecent",
                                                                            "body": "Oh yeah vendetta and leaderboards are still up, at least on pc. I’d be so sad if such a good game went down",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ElHumanist",
                                                                                    "body": "So is the nemesis system still up?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "MyBackupWasntRecent",
                                                                                            "body": "Course. I’d be surprised if they disabled the best system they’ve ever made",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Scrollingmaster",
                                                                                            "body": "To be clear this is not the system themself they are talking about. This is features like your enemies going into your friends games and such. \n\nThe nemesis system is part of the game. It doesn’t require online and wouldn’t be simply removed.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ElHumanist",
                                                                                                    "body": "That is good to hear, I was having difficulties understanding what was removed. So if I planned on playing shadow of war later, the change would impact that experience but not shadow of Mordor if I am just playing by myself?",
                                                                                                    "score": 0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "RayTracerX",
                                                            "body": "What are you talking about? Its available everywhere and still has the Nemesis system",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "B-Bog",
                            "body": "It's not rare at all, especially not in Japan where it is common practice for the game industry to file patents, not to be able to sue each other over them, but to protect themselves from outside patent trolling. However, this is purely an unspoken gentleman's agreement, so to speak. So, if, hypothetically, a studio were to come along and, say, market their game off the back of the biggest franchise of another company while also ripping off many of their creature designs as closely as legally possible, and do so in a way that the other company finds pretty unsavoury (maybe because said big franchise is aimed mainly at kids and the game is portraying the copycat designs with firearms), then that might not be considered very gentlemanly behaviour and that company might investigate what kind of patents it has lying around that could become a problem for that studio.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Buddhabelly2016",
                                    "body": "I think lots of people don’t know that this context is actually relevant often times for infringement. Like just cause your patent is somewhat relevant to another company’s product is not usually enough reason for the legal system to create onerous penalties. Like often you have to show things like infringement is willful, and damaging..",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "erichf3893",
                                            "body": "Seems intentional but idk about damaging",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "PotatEXTomatEX",
                                                    "body": "The context of damaging is that it came out at a time where Pokemon was getting heavily labasted and Pal was getting used as ammo to shit on it because it was so similar eg \"See even this rando company can do a better job than you!!\".",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "erichf3893",
                                                            "body": "Temu pokemon",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Buddhabelly2016",
                                                    "body": "Yes, it can be hard to show willful and damaging. But it’s not always required to having like smoking gun level of proof. Often times in patent cases it’s decided by a judge, who are allowed to draw conclusions… or they are often settled and every bit of evidence on each helps push the needle for settlement",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "robertman21",
                            "body": ">considered kinda taboo among game devs\n\nNo it isn't lol",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Rei1556",
                            "body": "false, blatantly false, game companies have patented shit ever since, loading screen? that was patented, title screen?(this was SNK iirc)patented, a high score leaderboard? patented(SNK too i think), minigame as a loading screen? patented (namco), previous game as a bonus item unlock like some sort of dlc before dlc? patented(koei vs capcom), touchscreen control? patented(nintendo, nintendo vs colopl) and i forgot the one that was about sega vs simpsons, game companies especially japanese game companies have patented a lot of their game ideas/mechanics even if they haven't used it, as long as they think it could be used for a game they would patent it",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "makemeking706",
                    "body": "Probably hyper focused on avoiding copyright infringement that they weren't even considering other types of exposure. Which makes sense since they are businessmen and game devs, not lawyers.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Possible-Emu-2913",
                    "body": "Only scumbag companies patent gameplay mechanics.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Totoques22",
                            "body": "Imagine encouraging unoriginal slop",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Possible-Emu-2913",
                                    "body": "Calling Nintendo or any other company like WB scumbags for patenting gameplay mechanics is not encouraging anything.\n\nAlso, it's nice to see a Pokemon like game in something other than 720p/15fps.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Getupkid1284",
            "body": "Weird because everyone else knew it would happen 😂",
            "score": 3,
            "replies": []
        },
        {
            "author": "AzraelKans",
            "body": "'Oh wow I'm shocked.' Said the developer whilst literally painting a clown face to a Pikachu figure in his desk.\n\n\n'now if you excuse me, I'm designing a character for our next release' ",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 42,
            "replies": [
                {
                    "author": "Baelorn",
                    "body": "I mean, I'm no fan of Nintendo but I also think Palworld is unfinished slop that would have gotten zero attention if they hadn't ripped off a bunch of Pokemon designs. Literally 90% of the grassroots marketing was \"lol Pokemon with guns\".",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Kiwi_In_Europe",
                            "body": "Even if what you're saying was true (which is debatable and , personally I had a fun 60 hours with it and return here and there.) derivative and \"slop\" games are allowed to exist. There is nothing illegal about the Pal designs.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "_ECMO_",
                                    "body": "It absolutely should be illegal to steal design like this.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "Kiwi_In_Europe",
                                            "body": "They did not steal the designs lmao. Pokémon do not have the rights to cartoon animal monsters *in general.* You have to prove that the design shares a significant amount of elements that were directly taken. Another good example, Master Chief and Doom Guy. Both have green power armour with orange/gold visors, but the details are different enough to be distinct.\n\nGod arguing with Nintendo fans is the worst lmao",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "_ECMO_",
                                                    "body": "Everyone who has eyes can see that the designs shares significant amount of specific elements. The only way you get this kind of similarity is if you directly and deliberately take them.\n\nMy mind cannot grasp how you can even argue otherwise. ",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Kiwi_In_Europe",
                                                            "body": "My guy, two different people drawing different cartoon sheep are still gonna end up with creatures that resemble sheep lmao. I haven't seen a single example that passes a reasonable legal definition for a direct copy.\n\nThat aside, games have been lifting designs and elements from each other since forever. [Cough cough](https://statics.memondo.com/p/01/vrus/2024/01/VRU_205022_6ac427f7314e44928d181e56c7ea4a9e__cuando_te_das_cuenta_de_que_pokemon_copio_a_dragon_quest_1200px.webp?cb=9156297)",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "theogkinglion",
                                                            "body": "I remember showing a young cousin into Pokémon about Palworld and he started naming everyone by their Pokémon name instantly. No doubt they’re not similar. Buuuuuut also fuck Nintendo.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DatBoiSaix",
                            "body": "Yeah but the reason it got recommended by people isn't for \"pokemon with guns\" but instead \"pokemon but actually good\". Patenting game mechanics is insane on the same level as patenting a chord progression.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "HungoverHero777",
                                    "body": ">”pokemon but actually good”\n\nExcept this isn’t true either because besides catching them, it plays nothing like pokémon. It’s another penny-a-dozen survival crafter.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bostonbedlam",
                    "body": "Nintendo gets away with so much shit it’s ridiculous. But gamers are a giant hivemind. Once they decide they love or hate something they stick to it (even a game, before its release; usually because of who developed it)",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Ballin095",
                            "body": "Fax bro. ",
                            "score": -9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ballin095",
                    "body": "Speaking facts. Fuck Nintendo ",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "MyUltIsMyMain",
            "body": "Game mechanics shouldn't have patents. Like I m pretty one of the pokemon patents is basically just throwing balls to catch something. That's ridiculous. \n\nAnother one i hate is that no one can use the nemesis system from shadow of mordor. That was so fun and no one can use it.",
            "score": 7,
            "replies": []
        },
        {
            "author": "ImHereForTheMemes184",
            "body": "I hope they win. Otherwise we'll be seeing a bunch of giant game developers be patenting basic game mechanics more often and suing their competition",
            "score": 7,
            "replies": []
        },
        {
            "author": "whyamihere2473527",
            "body": "How",
            "score": 5,
            "replies": []
        },
        {
            "author": "BelBivDaHoe",
            "body": "Nintendo is a legal powerhouse. \n\nThis is frivolous but could easily stand in Japan",
            "score": 2,
            "replies": []
        },
        {
            "author": "SpungyDanglin69",
            "body": "I love Pokémon. But palworld was on the right path to be exactly what I've always been looking for. Either Nintendo should step up or leave them alone",
            "score": 1,
            "replies": []
        },
        {
            "author": "SimpForEmiru",
            "body": "I do not believe this for a second. There’s no way not even a single individual at the company thought that what they were making was similar to Pokémon…",
            "score": 1,
            "replies": []
        },
        {
            "author": "StormOfFatRichards",
            "body": ">came as a shock\n\nJust use Lomyx or whatever the name of your dirt-type electric resistant friendemon is",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "author": "Correct-Treacle-8373",
                    "body": "Pokemon didn't invent monster collecting. Palworld still would have copied whatever was popular.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "BackgroundWindchimes",
            "body": "You mean to tell me a company directly traces and copies Pokémon, one of Nintendo’s biggest IPs, the same company known for being very protective of their IPs, was surprised to be sued?\n\nThey basically pointed and laughed at Nintendo for months as their fans were telling Nintendo to go fuck themselves. They knew, they just didn’t care. ",
            "score": -20,
            "replies": [
                {
                    "author": "cellardoor_shop",
                    "body": "The lawsuit isn't about IP infringement, it's about patent infringement. This statement basically says, \"We thought we'd get sued for having similar monsters, but not for similar game mechanics.\"",
                    "score": 43,
                    "replies": [
                        {
                            "author": "AerospaceNinja",
                            "body": "Yeah, but hopefully this allows the patents to be thrown out and negated as game mechanics shouldn’t be patentable",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "BackgroundWindchimes",
                            "body": "No, it’s saying “we thought we could get away with stealing from Nintendo in one area but our lawyers said they couldn’t touch us in this area so we got sloppy”. \n\nDid they really think Nintendo would throw their arms up and go away? There’s a reason Nintendo took so long, they were finding every way they could legally take action and win. ",
                            "score": -24,
                            "replies": [
                                {
                                    "author": "Alt_CauseIwasNaughty",
                                    "body": "The thing is Nintendo couldn't find anything to sue them for, so they created this patent a few months after palworld released specifically to sue them. That's why it took them so long",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "BackgroundWindchimes",
                                            "body": "And? Maybe Palworld should’ve created an original game that wasn’t just copying other people’s work. ",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "Alt_CauseIwasNaughty",
                                                    "body": "What they made was unique in its own way, at least I don't know any other survival monster collector with guns and slavery and it's fun. Not denying that some monster designs are just copied homework with small changes but hey that's not what this lawsuit is about. Pokemon hasn't made a single good game in over 10 years and Nintendo being butthurt over palworlds popularity at launch was always funny to me.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "BackgroundWindchimes",
                                                            "body": "Palworld literally just took Pokémon, including the designs and ball mechanic and threw it into another genre. You can’t take a green sonic, put it into a PUBZ clone and act like it’s doing anything original. At least digimon and every other Pokémon clone of the day did something more than “it’s this in another genre”. \n\nThe only people butthurt are fans of Palworld that want to act surprised that the company they obviously copied from sued them and want to throw “well, Nintendo wasn’t improving on the thing I like so it’s okay to steal” as their only defense. ",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Thedunk07",
                                                                    "body": "And? Palworld is a more fun game lol\n\nWhat you just said could apply to hundreds of games. Should CoD be the only first person shooter? Gran Turismo the only racer? It's laughable to think that people think it's good that Nintendo is suing a company that made a similar game over the fact the they are throwing a ball to catch monsters lol",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BackgroundWindchimes",
                                                                            "body": "You’re comparing a game that stole character designs and ball-capturing mechanics to “yea, well…world war 2 was already a game…”? Quality reasoning. Really showing the mindset of people that think Palworld is a good game. ",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "PotatEXTomatEX",
                                                                            "body": "> And? Palworld is a more fun game lol\n\nHow do you prove the other person's point in the first line bruh lol",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SlowlygettingtoFIRE",
                            "body": "You do know patents are a form of IP as well right….",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "hunterzolomon1993",
                                    "body": "You do know the patent didn't exist until months after the game released right? Its like Nintendo taking out patent out on BotW style free climbing and then going after every game that came out since BotW that has that type of climbing. Its like From Soft taking a patent out on the bonfire system and then going after every Soulslike that released after Dark Souls.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "SlowlygettingtoFIRE",
                                            "body": "Errr yea, I’m just correcting the commenter above who assumed that patents and IPs are different, when in fact patents are a subset of IP",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "hunterzolomon1993",
                                                    "body": "Ah right sorry my bad.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DADAchuYT",
                                            "body": "These guys have 0 clue what the patent is and just hates palworld.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Loki-Holmes",
                    "body": "Wasn’t the tracing thing faked? I remember hearing that and then it later coming out that the images that were going around used altered mons/pals.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Raycut9",
                            "body": "You are correct. The person who allegedly showed that the models were \"literally the same\" admitted they lied because they don't like that Palworld \"glorifies animal abuse\".",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "BackgroundWindchimes",
                            "body": "It wasn’t a direct trace but I dare you to look at some of the models and not “Why’s Wooloo in this game with gun? Oh? It’s a different game with a round and fluffy sheep with tiny eyes and horns?”  ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Loki-Holmes",
                                    "body": "It’s almost like they’re both sheep. The Palworld one is bipedal. Wooloo just looks like a stylized sheep. The pal that looks like Electrabuzz is way more similar than lamball is to wooloo.\n\nhttps://preview.redd.it/cyxhv6mrzcpe1.png?width=2000&format=png&auto=webp&s=01cbab28344390a0df6db477684d6dd84b1907a6",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DevotedSin",
                    "body": "The tracing/copying thing was disproved the week it came out.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "BackgroundWindchimes",
                            "body": "Yea, they just took the designs and changed small details. https://preview.redd.it/pokemon-vs-palworld-comparison-v0-d4xedo6v30fc1.png?width=916&format=png&auto=webp&s=52152a18dfcbcd62080d063296cc65d6923dccd9\n\nIt’s like taking Sonic, making him blur and rounding out the quills, calling him Boom and claiming it’s an original design. ",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StonewoodNutter",
            "body": "It’s amazing that Palworld was every made and I’m glad I got to experience it, but come on now. These guys fucked around and now they get to find out. I’m glad they did, because it was really entertaining for us, but we all know they knew exactly what they were doing.",
            "score": -16,
            "replies": [
                {
                    "author": "SuspiciousWasabi3665",
                    "body": "So far 95% of the suit has been in pocket pairs favor. At least from the info that's been released",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "DADAchuYT",
                    "body": "So its ok for nintendo to patent a game mechanic?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "A-Vagrant",
                            "body": "It happens with other companies not just Nintendo.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Possible-Emu-2913",
                                    "body": "Oh well that makes it okay.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "StonewoodNutter",
                            "body": "Idk about that, but other companies shouldn’t use slightly different Pokémon designs and then be surprised when they get sued by the most litigious gaming company out there. It’s pretty brainless not to expect to get sued, so either these devs are liars or idiots.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "zulumoner",
                                    "body": "wow you are dumb. You did not even read what they are getting sued for. You just make shit up in your head.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "_ECMO_",
                                            "body": "But I don’t agree with them being allowed to steal pokemon designs. Regardless of What stupid loophole makes it impossible to sue.\n\nAnd catching monsters with a pokeball is an extremely specific thing and should absolutely be patentable.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "zulumoner",
                                                    "body": "you also did not read the article",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "StonewoodNutter",
                                                            "body": "Everyone knows why they are actually being sued. It doesn’t matter what bullshit reason their lawyers came up with to take it to court. \n\nThey are being sued because you throw Pookiballs at Lucurio while traveling with your best pal, Pikatoo. Palworld was a rip off, and that is why we all liked it.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "StonewoodNutter",
                                            "body": "Do you not have eyes? Can you not see? Are you too dumb to see pattern recognition and recognize two shapes that are the same?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DADAchuYT",
                                    "body": "Except they're not suing because of the designs of the pals. Did you even read the article or just used your emotions because you're nintendo fanboy?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Totoques22",
                            "body": "Absolutely and anybody being against patent is a moron who’s never created anything",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "DatBoiSaix",
                                    "body": "A game mechanic man ? I'm a game dev and that's insane and a big taboo in the industry. But yeah right",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "_ECMO_",
                                            "body": "I don’t understand the issue. \nCatching monster with a pokeball is extremely specific thing and absolutely should be patentable.\n\nIt’s not like they want to patent a jumping character.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "DatBoiSaix",
                                                    "body": "No a mechanic shouldn't be patentable. \nAlso it's not just a monster and a pokeball. For example for one of the patents, throwing any object at any actor and that starting a fight. \nLike if you played a knight simulator and you wanted to throw a glove to start a fight, that's patented. If Nintendo did that early enough, they absolutely could have patented a jumping mechanic, that's the point. I don't have a problem with IPs, I have a problem with patenting a game design element. Like I would have a problem patenting a chord progression in the music industry.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "DatBoiSaix",
                                                            "body": "If Nintendo truly thought they had a case, they would have sued for IP infringement and not this stupid patent bs",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThePokemonAbsol",
            "body": "I mean…. Really Lol?",
            "score": 1,
            "replies": []
        },
        {
            "author": "psych0ranger",
            "body": "![gif](giphy|bjB3gtFvREqqr5NAHW)",
            "score": 1,
            "replies": []
        },
        {
            "author": "RollingDownTheHills",
            "body": "Maybe they should have.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperSayian4Nappa",
            "body": "They were probably more worried about Ark coming after them",
            "score": 1,
            "replies": []
        },
        {
            "author": "tgkad",
            "body": "Same same but different but still same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mankerdota2",
            "body": "They gave us the pokemon game we always wanted lets be honest",
            "score": 1,
            "replies": []
        },
        {
            "author": "shmightworks",
            "body": "After having played Palworld a bit, it's plays nothing remotely close to how Pokemon plays.\n\nI mean Nintendo probably had hoped Pokemon could play like Palworld did, but Palworld got there first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ptd163",
            "body": "I mean they're not wrong. Nintendo didn't have anything they could use at the time of Palworld's launch. What they didn't know or underestimated is how litigious and vindictive Nintendo can be. Nintendo literally made something up and backdated it to a patent from before Palworld's launch because they felt threatened by Palworld.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cats4life",
            "body": "We plagiarized one of the most infamously litigious companies, you’ll never believe what happens next!",
            "score": 0,
            "replies": []
        },
        {
            "author": "IrishHambo",
            "body": "![gif](giphy|3o6wrgQPwbYWY8hwze)",
            "score": 0,
            "replies": []
        },
        {
            "author": "Sinaura",
            "body": "Sure, buddy",
            "score": -6,
            "replies": []
        },
        {
            "author": "OneTrueDennis",
            "body": "They had to at least been aware that they were painting a target on the backs. Nintendo are the villain here, but Pocketpair do come across as tad naive.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Milky_Finger",
            "body": "I assumed palworlds main selling point was that they knew everyone hated how Nintendo handles copyright infringement and they'd sell copies if they capture that enraged market. It worked, but to say that it's anything other than that is a lie.",
            "score": 0,
            "replies": []
        },
        {
            "author": "EBgames123",
            "body": "I am so confused...Nintendo never gives up? Huh, yeah they keep failing to take Palworld down.",
            "score": 0,
            "replies": []
        },
        {
            "author": "iMaSpEdChIlD",
            "body": "Here just to trigger lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "iMaSpEdChIlD",
            "body": "but maybe like make them squares?\n\n![gif](giphy|IfPE0x5gfa5ctKpph6|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "iMaSpEdChIlD",
            "body": "How Making them Squares?\n\n![gif](giphy|sU3WJZQefGwtipSnnL|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "DerLetzteVlad",
            "body": "Oh, really? That's what the judge will say.",
            "score": -12,
            "replies": [
                {
                    "author": "SuspiciousWasabi3665",
                    "body": "They've already thrown out 22 of the 23 patents Nintendo brought forth, with the one Nintendo is clinging onto being \"smooth switching of riding objects in a game\", you know, absolutely pokemons biggest mechanic. \n\n\nNintendo immediately put forth a new patent on throwing balls to capture creatures. Like...during the suit. Palworld removed that the second Nintendo put a patent on it ",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "makkosan",
            "body": "It makes me wonder, If Nintendo so protective / hostile for competitors, How do we have DIGIMON ?",
            "score": -2,
            "replies": []
        },
        {
            "author": "CondomHummus",
            "body": "The lawsuit is bullshit but come the fuck on, of course, Nintendo, one of the worst IP holding demons on this planet will cry about anything that resembles their IP.",
            "score": -2,
            "replies": []
        },
        {
            "author": "RainbowIcee",
            "body": "I see lots of comments commenting on the pals looking like Pokemon but the interesting thing is that Nintendo never cared about that, they sued because of the pokeball mechanic.\n\n\nIf you think about it, newer pokemons looks like crap, and people buy the games wildly. It's practically proven, no one gives a damn what the monsters look like, they never really did. The pokemon design has never been a selling point. But the catching mechanic is.\n\n\nI found that quite interesting, and it makes a lot of sense. Only thing that doesn't make sense to me is the people that think putting Arceus in the game would increase or decrease its sales.\n\n\nAnd quite honestly.. yes. The catching mechanic is honestly the best thing about pokemon. It's simple, yet thrilling.",
            "score": -7,
            "replies": []
        },
        {
            "author": "ILovePamBeesley",
            "body": "People always complain about Sony being money driven, but Nintendo are by far the worst.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Alukrad",
            "body": "So, are they going to go after Digimon too?",
            "score": -4,
            "replies": []
        },
        {
            "author": "iHateR3dd1tXX",
            "body": "If I bought the game you guys think Steam could go as a far to remove it from your library??",
            "score": -8,
            "replies": [
                {
                    "author": "Laughing__Man_",
                    "body": "Nintendo is not gonna win. Most of their other suits have already been thrown out.",
                    "score": -3,
                    "replies": []
                }
            ]
        }
    ]
}