{
    "title": "Ben Starr on What RPG You Should Play Next | Square Enix Publisher Sale",
    "author": "Xeccess",
    "subreddit": "PS5",
    "rank": 14,
    "score": 51,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 39,
    "url": "https://youtu.be/RZ7ZnJMYItg?si=ttTkBdxfFHJcWZ9o",
    "id": "1je8oj4",
    "selftext": "",
    "comments": [
        {
            "author": "Hunchun",
            "body": "Can’t wait to hear him in Expedition 33 next month.",
            "score": 21,
            "replies": [
                {
                    "author": "Googlebright",
                    "body": "He's also in The First Berzerker: Khazan coming out next week.  So much Ben Starr to look forward to!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Possible-Emu-2913",
                            "body": "Don't tell me that...who as?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Googlebright",
                                    "body": "He voices the MC, Khazan.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Possible-Emu-2913",
                                            "body": "Goddammit, I was trying to wait for it lol.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pacoflipper",
                    "body": "Don’t you mean “Clair Obscur: Expedition 33” /s",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ocbdare",
                            "body": "I am trying not to get hyped for this game. But I am pretty hyped for it lol.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "oksojusthearmeout",
                    "body": "Holy shit, next month. Where the hell did the last 3 months go.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fattyoncrack",
                    "body": "Oh good, I thought that came out this month and I got scared! Looks like a real fun time.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_Heart_Sleeping",
            "body": "People seem to dislike FF16 but his role as Clive made me fall in love with the game. Truly one of the best and coolest VA’s in the gaming industry.",
            "score": 29,
            "replies": [
                {
                    "author": "ZeroMayhem",
                    "body": "He did a great job, no question. Of all the issues I have with 16, he's not one of them.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "capnchuc",
                    "body": "The dislike for FF16 is forced just like it was for 15,13,12, etc. The \"fans\" of the series constantly tell other people to not even try the games because it isn't exactly what they want.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Silver_Song3692",
                            "body": "I personally didn’t like the combat, it was like a poor man’s version of Devil May Cry. I didn’t like how often the game took the controller away from me with the long ass cutscenes. The Kaiju battles were pretty but each one turns into a QTE and I don’t really enjoy those. I didn’t like any of the story post >!killing Barnabas!<, it just loses all of its steam for me after that. For what it’s worth, 15 is one of my favorite games of all time, but holy crap if it doesn’t have a good amount of flaws, mostly with the story requiring so much outside material from the game and all of the DLC to be a cohesive story.  I’m not forcing any of that",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "svrtngr",
                    "body": "FF16 is a good game, but it's not a good RPG. \n\nStellar voice acting, though.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ReaperLP-700",
                    "body": "Brother FF16 is a modern dat arpg masterpiece in my opinion. Does the story suffer from pacing absolutely, is the rich looking world actually pretty empty once you start exploring yes. But my god just fighting stuff has never been better than ff16. The combos, music and abilities are all chefs kiss.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fuddlesworth",
                    "body": "FF16 suffers from the problem of expectations.\n\nThe fact that it is a numbered FF is the problem. Being a numbered FF, you would assume it's the main team working on it, but that's not the case as the main teams are working on the FF7 remakes. That in itself is the main issue. It plays like the non-numbered games. It lacks a lot of what makes a numbered FF game polished.\n\nIf it was labeled as something else, I think it wouldn't have as much negative reception as it did.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KiwiKajitsu",
                    "body": "You like him trying to sexy whisper every single line he gives?",
                    "score": -7,
                    "replies": [
                        {
                            "author": "I_Heart_Sleeping",
                            "body": "You don’t?",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "Possible-Emu-2913",
                            "body": "I'm a guy, straight, but some times a guys voice just hits in a way that's pleasant lol.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "goblinsnguitars",
                    "body": "It was the (20 minute cutscene - 5 minute gameplay - 10 minute cutscene) loop and useless companions that often vanished I hated.\n\nDragon Age Veilguard did the same thing (among many dumb things on it's own) minus the random exposition dumps.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kambi28",
                            "body": "We havent played the same veilguard it seems",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "goblinsnguitars",
                                    "body": "Please show me a video where the companions do damage above the explorer difficulty.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Possible-Emu-2913",
                            "body": "We played two very different games. Did you only play the demo for FF16? And for Veilguard...did you actually play it?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "goblinsnguitars",
                                    "body": "Yes. I played both.\n\nFinal Fantasy 16 was great with dope DLC in the spurts when it wasn’t a cutscene fetch quest montage.\n\nVeilguard is great when the companion characters aren’t talking like a bunch of Gen Z Americans.\n\nFelt like a CW fantasy show.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JuanMunoz99",
            "body": "This guy can read a phone book and make it interesting.",
            "score": 24,
            "replies": []
        },
        {
            "author": "butterbeancd",
            "body": "Wow, an ad that was actually fun and still got across the selling points of the games being offered. More like this! And not gonna lie, this actually made me interested in Romancing Saga 2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "narutomaki",
            "body": "FF8 for life!",
            "score": 12,
            "replies": []
        },
        {
            "author": "RedXIII1888",
            "body": "FF9 > FF8.",
            "score": 6,
            "replies": [
                {
                    "author": "I_Heart_Sleeping",
                    "body": "Both are good but my nostalgia for 8 is oddly super high. I think I enjoy the game more than 7 and 6 even. \n\nSomething about Squall and the gang really sticks in my memory compared to other FF games.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Z3M0G",
                    "body": "FF9 is perhaps my least favorite FF in the entire series, while FF8 is perhaps my favorite.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bladeneo",
                            "body": "Whereas I love them both, with 9 a slight favourite. There's room for both in your life, just open your heart ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "rockmanzerox06",
                            "body": "You must have the patience of a saint. That draw system and having your stats tied to magic inventory made me lose interest. I was liking the story though…..",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AgentOfSPYRAL",
                    "body": "My favorite FF, and one of my favorite stories and soundtracks in games period.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ayrios440",
            "body": "Ben Starr is pure awesomeness.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Marauding_Llama",
            "body": "When the voice of Astrobot tells you to play FF8, you do it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "McChillbone",
            "body": "FFVIII truther?",
            "score": 1,
            "replies": []
        },
        {
            "author": "noblex123",
            "body": "FF6 gang rise up",
            "score": 1,
            "replies": []
        },
        {
            "author": "Balbright",
            "body": "Wonder if he’ll make a video like this for Expedition 33 next month",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ensaru4",
            "body": "I'm currently in a playthrough and is honestly feeling really burnt out by Chapter 11. Chapter 11 feels like it might be shorter, thankfully, but I'm just about wanting to play anything other than Rebirth right now.",
            "score": 1,
            "replies": []
        }
    ]
}