{
    "title": "Clair Obscur: Expedition 33 builds on a \"heritage of JRPGs\" like Final Fantasy 7, 8, 9, and 10, but it's also \"inspired by Sekiro\" and taking pieces from deckbuilders",
    "author": "Turbostrider27",
    "subreddit": "PS5",
    "rank": 8,
    "score": 43,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.gamesradar.com/games/jrpg/clair-obscur-expedition-33-builds-on-a-heritage-of-jrpgs-like-final-fantasy-7-8-9-and-10-but-its-also-inspired-by-sekiro-and-taking-pieces-from-deckbuilders/",
    "id": "1jegrrk",
    "selftext": "",
    "comments": [
        {
            "author": "Et_Crudites",
            "body": "Love Sekiro. Can tolerate deck builders. Not sure how those two combined integrate smoothly with old school JRPGs…",
            "score": 1,
            "replies": [
                {
                    "author": "Kell_215",
                    "body": "I’m about to read the article like that other guy said but this was funny asl and basically my thought😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IrishSpectreN7",
                    "body": "Just read the article and you'll know exactly what mechanics they're referring to.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sixtus_clegane119",
                    "body": "Are deck builders like hearthstone and gwent",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SuperBackup9000",
                            "body": "Yeah but “deck building” in JRPGs tend to just be a roundabout way of implementing cooldowns. So just think of using an ability as using a card, and the ability coming off of cooldown as drawing the card. Just have to be more mindful of what you use and not spam",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ElJacko170",
            "body": "I've watched plenty of previews of this game and do not *at all* see where the \"inspired by Sekiro\" comes from, unless we're still acting like Sekiro invented parry mechanics.",
            "score": 1,
            "replies": [
                {
                    "author": "IrishSpectreN7",
                    "body": "The article says that enemy attack patterns tend to be off-rhythm and difficult to predict. That's the inspiration. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kyingmeat",
                            "body": "So like bosses since the ps2 days lol",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "IrishSpectreN7",
                                    "body": "I would say that bosses *generally* are pretty easy to read and react to.\n\n\nBut regardless, you can draw inspiration from something even if that thing didn't *invent* the concept. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "420NugShareBox",
            "body": "Really excited to try this one",
            "score": 1,
            "replies": []
        },
        {
            "author": "btg7471",
            "body": "Just give us a public demo",
            "score": 1,
            "replies": []
        },
        {
            "author": "rangers_guy",
            "body": "I have this one pre-ordered but I'm really hoping to see some reviews before it comes out. It looks wonderful, but I'm also leery of some of the mechanics. ",
            "score": 1,
            "replies": [
                {
                    "author": "nervousformyclasses",
                    "body": "Which mechanics?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrConor212",
            "body": "Jennifer English and Charlie Cox is enough to get me to buy this tbh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Iwillnotspazthistime",
            "body": "Calling a mechanic that’s in every Mario RPG “inspired by Sekiro” is very funny to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BigLittleSlof",
            "body": "Oh please don't have deck builder shit in this game, I was looking forward to this :(",
            "score": 1,
            "replies": [
                {
                    "author": "JMM85JMM",
                    "body": "Read the fairly short article before you despair...\n\nIt's like a deck builder in that abilities cost points rather than mana and because abilities can synergise well with one another. There's no actual deck building.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Default_Defect",
            "body": "So, take something good and slap a bunch of overrated nonsense on it?",
            "score": 1,
            "replies": [
                {
                    "author": "IrishSpectreN7",
                    "body": "It's just learning enemy attack patterns to time your blocks.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}