{
    "title": "The Wire - McNulty Listens to Bodie",
    "author": "earhere",
    "subreddit": "television",
    "rank": 6,
    "score": 621,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 115,
    "url": "https://www.youtube.com/watch?v=GtB95rneCso",
    "id": "1je4ekf",
    "selftext": "",
    "comments": [
        {
            "author": "cmgr33n3",
            "body": "That conversation got him killed.",
            "score": 334,
            "replies": [
                {
                    "author": "pm_me_ur_McNuggets",
                    "body": "His death got to me the most.",
                    "score": 192,
                    "replies": [
                        {
                            "author": "dubblix",
                            "body": "*This is my corner*",
                            "score": 88,
                            "replies": [
                                {
                                    "author": "rzenni",
                                    "body": "*You ain't puttin' me up in one of them empty ass houses neither!*",
                                    "score": 49,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "davej999",
                            "body": "When Poot is trying his best to reason with him but its not enough , sad stuff\n\nWhich is weird to feel that way about a guy who murdered a child at point blank range for no reason",
                            "score": 104,
                            "replies": [
                                {
                                    "author": "swandive19",
                                    "body": "He was a child too",
                                    "score": 89,
                                    "replies": [
                                        {
                                            "author": "davej999",
                                            "body": "He was also his friend",
                                            "score": 54,
                                            "replies": [
                                                {
                                                    "author": "STFUNeckbeard",
                                                    "body": "Which is why it was even more horrible for Bodie to have to go through that.",
                                                    "score": 28,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "itsbraille",
                                                    "body": "He was also an elf.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bguzewicz",
                                    "body": "It wasn’t no reason, Wallace was snitching. And it was a direct order from Stringer. Not that that makes it okay, obviously, but you know…",
                                    "score": 60,
                                    "replies": [
                                        {
                                            "author": "lonelyinbama",
                                            "body": "Game is the game",
                                            "score": 62,
                                            "replies": [
                                                {
                                                    "author": "bguzewicz",
                                                    "body": "Always.",
                                                    "score": 27,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BaconatedGrapefruit",
                                                    "body": "The game is also rigged, something Bodie realized a step too late.",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DeapVally",
                                            "body": "Anyone who spends their time witnessing shit, they gone get got.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Slapmeislapyou",
                                            "body": "They had no proof Wallace snitched or even talked to police though. ",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "bguzewicz",
                                                    "body": "Tell that to Stringer. He’s the one you need to convince, not me.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "STFUNeckbeard",
                                    "body": "If you think there was no reason for that, I don’t think you understood the vast majority of the show lmao",
                                    "score": 23,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "K_Uger_Industries",
                            "body": "Especially the blocking of it cementing his status as “one of them bald bitches on the chess board”. He’s shooting diagonally forward, and then gets taken out by a knight move",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "CollateralSandwich",
                            "body": "That's when I gave up on the show. He was the last straw for me. The show kept killing off its best characters and in my opinion, not replacing them well enough. I think it goes without saying I don't like this show as much as most do.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cantonic",
                    "body": "Not the conversation, just being seen with McNulty!",
                    "score": 63,
                    "replies": [
                        {
                            "author": "Neuroccountant",
                            "body": "Sure, Marlo’s guys had to assume what they were talking about, but their guess was correct. And they were already suspicious by the time of that conversation, if I remember correctly.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "cantonic",
                                    "body": "Yeah I just mean that Marlo’s guys didn’t even bother to check. Just the suggestion that Bodie betrayed them and he was dead.",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "TheCatapult",
                                            "body": "Marlo had multiple people murdered over the *rumor* that one of them called him a “dick sucker.” \n\nMarlo cared so much about his reputation for being tough/manly but he left no legacy. After his arrest, he wasn’t even recognized on the streets. Omar is a legend on the streets and gang bangers would flee in fear just on seeing him despite Omar “being” what Marlo feared being called. \n\nThe Wire is incredible for all its subtle juxtapositions.",
                                            "score": 101,
                                            "replies": [
                                                {
                                                    "author": "dmtdmtlsddodmt",
                                                    "body": "And the cheese stands alone",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "author": "mullahchode",
                                                            "body": "not that other cheese though, he ain't standing no more\n\nthat was for joe",
                                                            "score": 14,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Darko33",
                                                    "body": "It was a brilliant editorial decision by the show's architects to have Jamie Hector deliver a chilling yet ultimately dispassionate performance as a stone-cold killer in Marlo throughout the last two seasons -- right up until he finds out in lockup that his crew hadn't been informing him that Omar has been publicly calling him out on the street. It makes that scene all the more effective when he finally shows some emotion. https://www.youtube.com/watch?v=NQwk7aLOM3c",
                                                    "score": 10,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "six_days",
                                                    "body": ">The Wire is incredible for all its subtle juxtapositions.\n\nOne of my favourite juxtapositions...\n\nWhen Marlo finds out people are spreading rumors about him, he shouts \"My name is my name!\", one of the few times his sociopath exterior breaks and he shows some emotion. \n\nOf course, seasons earlier, the Greek and his enforcer Spiros mused about the police maybe knowing their identities. \"My name is not my name\" is how Spiros brushes off the threat.\n\nTwo different criminal worlds, two polar opposite perspectives.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cryptic1842",
                    "body": "Damn spoiler",
                    "score": -27,
                    "replies": [
                        {
                            "author": "mullahchode",
                            "body": "skill issue",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sammy_Bubba",
            "body": "Pretty amazing journey for Bodie on the show - considering how he acted and what he did in Season 1 to Wallace. I was genuinely upset when he met his fate after this - a testament to the writing and his acting.",
            "score": 202,
            "replies": [
                {
                    "author": "STFUNeckbeard",
                    "body": "Drives me nuts when people hate Bodie for Wallace lol. Wallace fucked up, and Stringer is a monster. Bodie is just the pawn and didn’t want to do it. He’s even mad and pleading with Wallace at the end, and Poot is the one that finally pushes him. What was Bodie supposed to do anyway? “Nah sorry String I’m not gunna do it.” Yeah that would have ended well for Bodie. Fucking most shallow reading of the situation and character ever if you get mad at Bodie lmao",
                    "score": 109,
                    "replies": [
                        {
                            "author": "PaulaDeenSlave",
                            "body": "\"We either step up or we step the fuck off.\"",
                            "score": 49,
                            "replies": []
                        },
                        {
                            "author": "Ghost_man23",
                            "body": "The whole point of the show is there are no real villains. There are just humans and circumstances.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "Darko33",
                                    "body": "To build on that I'd say the villains are the systems, which reward inertia and punish innovation. No matter which institution you're talking about, that stays the case -- the names and faces change, but reform remains impossibly elusive.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "FacelessCougar69",
                                            "body": "We live in a society",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Slapmeislapyou",
                            "body": "Whoa whoa whoa. This is one of my favorite Wire takes to argue about. So you'll have to excuse my lengthy reply. Lol.\n\n\nMaybe it's been a long time since you watched The Wire, but I keep The Wire, Sopranos, Seinfeld, and Peaky Blinders on a background rotation pretty much all year. \n\n\nBodie, 100,000% wanted Wallace killed and two scenes in particular confirm this. \n\n\nhttps://youtu.be/TfnSzfNZUAc?si=Se3Dw2A8U1kz6_8Z\nhttps://youtu.be/uf5Wv4AvN7s?si=7sk5I-YCv81e00rb\n\n\nBodie only sought out reasons to discredit Wallace, and when given an opportunity to speak up for him and save his life with Stringer, he decided to talk down on Wallace, pretty much sealing Wallace's fate. \n\n\nAnd remember, nobody had proof Wallace snitched. It was only speculation and Bodie still thought he deserved to die. \n\n\nFast forward to the Little Kevin situation. Little Kevin, talked to the cops and didn't snitch to them but snitched to Randy. And unlike Wallace EVERYONE knew Little Kevin at least spoke with the police. \n\n\nSo at the point where Bodie was ready to take the stand to avenge the death of Little Kevin, I saw Bodie as the ultimate hypocrite. And was not bothered at all when he got gunned down. He's cool with all the senseless murders, one which he participated in....until it directly affected him?!?!? \n\n\nBecause for me as a viewer his character was irredeemable after shooting Wallace, a kid mind you, after having zero proof Wallace ever talked to the cops anyway. \n\n\nHe just thought Wallace was weak, and wanted favor with Stringer more than he wanted Wallace to be alive. \n\n\nBodie was a POS.\n\n\n\n\n ",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Darko33",
                                    "body": "There's one detail that undermines your thesis here just a little -- Bodie's tough-guy routine with Wallace was an act. He can't even pull the trigger with confidence -- Poot (of all people) has to finish him off.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Slapmeislapyou",
                                            "body": "My thesis is that Bodie is a POS, not the state of his nerves while shooting Wallace.\n\n\n\nIdk how Bodie hesitating at the final moment before he shoots Wallace changes anything about his role and participation in Wallace's death. If anything, it makes it even worse, because it shows he fought over those feelings and still shot him. \n\n\nBodie isn't a marine, or a cop...he's a teenage drug dealer. And according to the story, Wallace was his 1st murder and someone he knew intimately since childhood. \n\n\nWhat do you expect? You expect him to empty the clip on someone he's known since childhood like Schwarzenegger in Predator or something? \n\n\nOne thing that's great about the writers of The Wire is their dedication to authenticity, and Wallace's death scene is proof of that. \n\n\nMurders irl are not carried out like an action movie or most crime dramas where the shooter is composed and sure of his or herself. \n\n\nIrl murder is often frantic, nerve driven, and people getting shot with shaky hands. And I think this scene captured that perfectly. ",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Darko33",
                                                    "body": "On my first watch, I thought he was a POS too. But I realized after a while that the hesitation wasn't just nerves. He doesn't actually want to do it. But he knows if String found out he couldn't, he'd be the one in Wallace's shoes. \n\n...somewhere around the third or fourth rewatch, I just felt bad for him. A quote by Vonnegut comes to mind: he was very much among \"the listless playthings of enormous forces.\"",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Slapmeislapyou",
                                                            "body": "Everyone always says \"Stringer forced him to do it.\" But their conversation in the car contradicts that, as well as their conversation during Wallace's last meal. \n\n\nDee had already put Wallace back to work, so Bodie could have easily told Stringer no, Wallace is cool, Wallace is strong, there's nothing to worry about etc, instead he does the total opposite and shits on his name, CONFIRMING Stringers doubts about Wallace. \n\n\nAs aforementioned, gaining favor with Stringer and exterminating a \"weak link in the chain\" was more important to Bodie than trying to save Wallace's life and imo that played the greatest role in Wallace's death, not Stringer questioning Bodie about Wallace.\n\n\nSo I have to disagree that Bodie was a \"listless plaything of enormous forces\", when his answers to String about Wallace, is precisely what sealed Wallace's fate. ",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "semiomni",
                            "body": "Yeah, Bodie was just following orders, people like that famously don´t deserve to be blamed at all.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "bangzoom93",
                            "body": "Yes and no, Bodie was definitely a pawn but it’s not like him and Poot had no agency. They could’ve signaled to Wallace to stay out of the city and I think Stringer would’ve forgotten about it, but they were young and Stringer was so much higher up to be almost mythical to them so I get why they didn’t disobey",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Emperor-Commodus",
                                    "body": ">They could’ve signaled to Wallace to stay out of the city\n\nWasn't Wallace already moved out of the city by the cops? He's only killed because he comes back. I don't think Bodie or Poot would have tried to get Wallace out of the city because they already knew he wouldn't stay away.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "bangzoom93",
                                            "body": "Yes, but he calls them from where he is being stashed",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "STFUNeckbeard",
                                                    "body": "Yeah they know he’s stashed and they don’t rat him out, but he comes back anyway. It’s sad because Wallace was too innocent to realize coming back was a death sentence and people say “it’s all he knows”, but sorry that’s just survival of the fittest in action. Dude signed his death warrant as soon as he came back, and unfortunately Bodie was the one made to pull the trigger.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Slapmeislapyou",
                                    "body": "Bodie could've also signaled to Stringer in the car that there was nothing to worry about with Wallace. \n\n\nBut instead chose to do the opposite. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "empiresk",
                                    "body": "The only people who were able to walk away clean were Cutty and Poot and that was only after serving time in jail and/or the Barksdale organisation vanishing.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "Starbucks__Lovers",
                                            "body": "Poot the shoe salesman was quite a reveal",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "BaconatedGrapefruit",
                                            "body": "I wouldn’t even say Cutty walked away clean. He did a bit and the Barksdale’s owned him a favour for it. His saving grace was that Avon played the game straight.\n\nMarlo would have killed him the second he turned his back to leave.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "cotsy93",
                                    "body": "String would have had Poot kill Wallace and Bodie both. You can't stay in that organisation with clean hands after a conversation like that.",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "djackieunchaned",
                    "body": "I genuinely still remember where I was when I watched this ep. Was home on winter break and tried to watch a hockey game on tv with my dad after but was zoning out hard cuz I was still shook haha I was so sad",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shrewdy",
            "body": "*\"This game is rigged man, we like them little bitches on the chessboard\"*\n\n*\"Pawns\"*\n\nLove the callback to start of S1, and how much Bodie has learned in the meantime. Nearly 2 decades since The Wire ended, and I've yet to see a TV show to surpass it.",
            "score": 151,
            "replies": [
                {
                    "author": "Corky_Bucheck",
                    "body": "That’s a bit generous.  Seasons one and three were  great.  Two was tolerable.   Four and five were as ridiculous as Brooklyn 99 episodes without the humor.",
                    "score": -51,
                    "replies": [
                        {
                            "author": "rinuxus",
                            "body": "Had to jump in here,i will not have S02 maligned, \n\nS02 was a fantastic season.\n\n>''We used to make sh*t in this country, build sh*t.\n\n >Now we just put our hand in the next guy’s pocket.''",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "LegAlarming1602",
                                    "body": "I'm with you on this. It was a huge transition from the corners S1 to the docks S2, and I didn't appreciate it the first time, but on rewatch S2 is freaking great.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "rinuxus",
                                            "body": "Sobotka is great, McNulty messing with his old crew from a boat is great, The Greek and that whole thing is a solid story.\n\nThe social commentary from Sobotka about why Baltimore is in the state it is in, still rings true.\n\n''so we can get some fucking ships in here!''\n\nI think there's a case to be made that S02 is the best of them all.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "shrewdy",
                            "body": "Season 4 is one of the greatest seasons of TV that I've seen. You can dislike it if you like, but you'd be in the minority",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Corky_Bucheck",
                                    "body": "People also like Dancing with the stars, Taylor Swift and Joe Rogan.  That doesn’t make those things good.",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "author": "dasbtaewntawneta",
                                            "body": "i like how you have to tear other things down to prop up your own opinion. The Wire clearly didnt have it's intended affect on you",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Corky_Bucheck",
                                                    "body": "Pot, meet kettle.   You tore down my opinion because I don’t like the same TV show.",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "Ap3x-Mutant-",
                                                            "body": ">Season 4 is one of the greatest seasons of TV that I've seen. You can dislike it if you like, but you'd be in the minority\n\nThey didn't tear down your opinion, they literally said your entitled to it.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Darko33",
                            "body": "I think you're misremembering S4",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Corky_Bucheck",
                                    "body": "No I remember it quite clearly.",
                                    "score": -19,
                                    "replies": [
                                        {
                                            "author": "Live_Art2939",
                                            "body": "And if you think it’s ridiculous then either you’re being intentionally contrarian or you have never lived in a city before because The Wire is literally the only hyper realistic show ever made, written by people who actually lived those careers.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ilikethemfatandugly",
                            "body": "RE ELECT FRANK SOBOTKA",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Kanye_Is_Underrated",
                            "body": "wow, you see an occasional shit take here and there, but this right here, this is an absolutely horrendous take. i congratulate you on your singularly horrible taste and opinions. you are at the very least, a rare individual.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Corky_Bucheck",
                                    "body": "Lol this is the kind of unhinged brain dead comment I’d expect from a Kanye west fan.   Yeah dawg.  McNulty banging prostitutes slamming booze in parking lots and staging a murder spree is such a serious plot 🤡",
                                    "score": -6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "dwhogan",
            "body": "McNulty and Bodie are the same in many ways.  They are chaotic outliers in their own systems of order.  McNulty works with the law because he believes in an inherent greater good, but he doesn't see crime as inherently evil, he just sees the evils that happen to align with crime.  He also sees the evils that hide behind law, and it drives him to rebel.  \n\n  \nBodie is humane in a way that many of his peers have lost their humanity.  He feels for his boys, and he understands right and wrong.  He's grown up with impossible choices his whole life, and he's done his best to maintain a moral compass in spite of the inhumanity of the street.\n\n  \nHis first comment in this scene is about how nice it is that they're in such a serene space and it's also in the city.  This is from a kid who has barely ever left the confines of Baltimore, except when he had to go to Boys Village, or drove to Philly for String.  He says \"i feel old\" and yet he's probably barely an adult.  He's lived many lifetimes in the course of a childhood, and yet, he's wise in a way that McNulty respects and mourns.",
            "score": 130,
            "replies": [
                {
                    "author": "socialmediaignorant",
                    "body": "He also respects the laws of the game and didn’t like when they were broken. I’ve worked with kids like this who are so damn smart and have the ability to do anything but circumstances hold them down. It’s heartbreaking and that’s why I was devastated (and probably still am) by his death.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "dwhogan",
                            "body": "Respect cedes with each generation... Whether it gets replenished is what makes a difference.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "socialmediaignorant",
                                    "body": "Loved your comments. They are how I see the show too and what touched me about the scene and character.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "dwhogan",
                                            "body": "Thanks for this :)  Such a gift to have media like this - to share humanist stories in ways that reach us across and throughout the aether.  The digital campfire may be flawed but it can also be so tremendously beautiful.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "socialmediaignorant",
                                                    "body": "A show that brings our collective life long experiences together is such a gem and why this one is so rare. It’s amazing.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "falldownkid",
            "body": "Y’all can’t be playing no checkers on no chess board, yo!\n\nI've probably re-watched this show 5 times, and each time I still pick up new call backs and connections.",
            "score": 50,
            "replies": [
                {
                    "author": "dubblix",
                    "body": "I finished another watch last week. It's so good. Check out We Own This City too",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Senorspeed",
                    "body": "Every piece matters",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "ExpoAve17",
            "body": "My all time favorite show,  and still holds up today.",
            "score": 55,
            "replies": [
                {
                    "author": "bajcli",
                    "body": "I've heard/read firsthand from people who \"couldn't get into it because of the old timey phones,\" it drove me up the fricken' wall.   \nPeople watch shows about dragons, knights fighting with swords and shit, but you can't get into arguably the best show ever because some of the plot revolves around technology that's a couple decades old?   \nJesus wept.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Fadedcamo",
                            "body": "I will agree that some of the scenes involving the investigation side of things with tracking of cell phones and texting and pay phones stand out as particularly dated when compared to today's tech. No fault of the show, just an effect of the time the story takes place.\n\nWhereas a fantasy show with dragons doesn't have that same disconnect because it's entirely fantasy or at worst, from a thousand years ago level of tech.\n\nIt was cool and realistic how as the show went on, it showed the criminals getting smarter and taking advantage of new technologies to continue their empires. Burner phones, Marlo using picture messaging, etc.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "socialmediaignorant",
                                    "body": "I actually appreciated seeing how things developed. It’s like a history class.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Chargercrisp",
                    "body": "it’s soooo fucking good even today",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "socialmediaignorant",
                    "body": "I watched it two months ago and it’s in my head at all times. It’s so damn good.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Professional_Yak1320",
            "body": "Bodie, my G.",
            "score": 13,
            "replies": []
        },
        {
            "author": "PaleZebra288",
            "body": "so many earned minutes of a payoff here throughout four seasons!",
            "score": 25,
            "replies": []
        },
        {
            "author": "derpferd",
            "body": "Going through the comments here.... yeah, I'm going back in again. Been nearly a decade",
            "score": 27,
            "replies": [
                {
                    "author": "cheeseburgerforlunch",
                    "body": "Same. I've seen it like 6 or 7 times all the way through but not since like 2017.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "derpferd",
                            "body": "Hol up? 2017?\n\nChrist, it's probably way longer than a decade now I think about it",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "El_Superbeasto76",
            "body": "J.D. Williams should be a much bigger star.",
            "score": 8,
            "replies": [
                {
                    "author": "TinyMassLittlePriest",
                    "body": "Facts",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "socialmediaignorant",
                    "body": "Amen. I looked up everything he’d ever done after this and was sad it wasn’t more.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JesseHaley617",
            "body": "One of my favorite scenes from the series.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Airblazer",
            "body": "The wire is without a doubt the finest  tv show ever made.\nMy favourite shows are sci fi. Expanse, BSG, Star Trek etc AOS, \nBut the wire surpasses them all.\nIn my mind these shows are all 9-9.5 as I’ve rewatched them a few times.\nBut I’ve never finished a show and immediately think of doing a rewatch straightaway.\nThe Wire is a straight up 10. \nNo other show deserves a 10.",
            "score": 5,
            "replies": []
        },
        {
            "author": "TrentonTallywacker",
            "body": "“I feel old. I been out there since I was 13”\n\nHim saying this as a 20 year old just breaks my heart",
            "score": 4,
            "replies": [
                {
                    "author": "socialmediaignorant",
                    "body": "I’ve known kids like and it’s as sad as you’d think. You see them come through the ER as little kids and then over time they graduate to the trauma bay from gang violence. It hurts every single time.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "nyquil99",
            "body": "Wonder how McNulty would feel about Bodie if he knew >!Bodie killed Wallace!<",
            "score": 12,
            "replies": [
                {
                    "author": "Okichah",
                    "body": "McNutty knows the game and that nobodies hands are clean.\n\nHe was congenial with Omar and he was an admitted murderer of anyone that was “non-civilian”. The minute Wallace came back to the pit he was back in the game.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "STFUNeckbeard",
                    "body": "He probably would have felt even worse for him knowing he was forced to by Stringer and the circumstances of his situation.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "KnotSoSalty",
                    "body": "Of course McNulty knew.  Why else would Bodie and Poot be in put in charge of a crew all of a sudden after season one?  He overlooks it like he overlooks the murders Omar does.  McNulty also knew that Stringer gave Bodie the order.  To McNulty Stringer is a boss and the boss’s are the real enemy.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "socialmediaignorant",
                            "body": "This. You get it. Morality is subjective.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "socialmediaignorant",
                    "body": "What do you think the pawn line referred to? He’s not in charge. He’s a pawn. McNulty knows.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ditzy_Pooper",
            "body": "shut that door",
            "score": 2,
            "replies": [
                {
                    "author": "Fadedcamo",
                    "body": "Ay yo shut that door?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "alohadawg",
            "body": "Magnificence",
            "score": 2,
            "replies": []
        },
        {
            "author": "KnotSoSalty",
            "body": "Sometimes I wish McNulty had driven Bodie straight to a recruiter’s office that afternoon.  F’ the case.  F’ Baltimore.  Just give him a chance to be a soldier, that’s all he ever wanted to be.  Probably be good at it too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LechuckJunior",
            "body": "“You want it to be one way, but it’s the other way.”",
            "score": 2,
            "replies": [
                {
                    "author": "socialmediaignorant",
                    "body": "I say this every damn day. It’s the most beautiful statement.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chris_HitTheOver",
            "body": "You’re a soldier, Bodie. (And soldiers die.)",
            "score": 1,
            "replies": []
        },
        {
            "author": "jamesmcgill357",
            "body": "One of my favorite scenes but also makes me sad because of what it leads to",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThreesKompany",
            "body": "Bodie’s line “I feel old” is one of the heartbreaking of the series. He’s basically a kid, 19, and the stuff he has seen and done by that age is crazy.",
            "score": 1,
            "replies": [
                {
                    "author": "socialmediaignorant",
                    "body": "Agreed. It’s such an important part.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "howmanywhales",
            "body": "For me it’s when he says “hell yeah” - it’s just so sad the more and more you think about it. And also what it says about the human condition and experience and all that",
            "score": 1,
            "replies": []
        },
        {
            "author": "alohadawg",
            "body": "Magnificence",
            "score": 1,
            "replies": []
        },
        {
            "author": "Karenzi",
            "body": "Named my first pet after Bodie because of this scene. RIP bobear",
            "score": 1,
            "replies": [
                {
                    "author": "djackieunchaned",
                    "body": "Bobear was a soldier",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}