{
    "title": "Ron Moore on ‘Battlestar’, ‘Outlander’, ‘For All Mankind’, and His ‘God of War’ Show (Confirms 2 Seasons in the Works)",
    "author": "Ok_Scientist_8147",
    "subreddit": "television",
    "rank": 14,
    "score": 111,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 61,
    "url": "https://youtu.be/Xu704p568-Y",
    "id": "1je447l",
    "selftext": "",
    "comments": [
        {
            "author": "GasPsychological5997",
            "body": "Battlestar Galactica is still one of the best shows I’ve ever seen. I often find myself thinking about it even 20 years later.",
            "score": 48,
            "replies": [
                {
                    "author": "grambleflamble",
                    "body": "Adama and Roslin need to come save us. We need you, Space Parents!",
                    "score": 11,
                    "replies": [
                        {
                            "author": "GasPsychological5997",
                            "body": "So say we all",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "MattyKatty",
                            "body": "We must have watched different shows because Roslin was close to dooming humanity multiple times using very bad logic and was a power-hungry tyrant who literally tried to rig her presidential election (you know, just like the guy you seem to be complaining about constantly from a quick ctrl+f of your profile). \n\nShe was also making leadership decisions while being high off her rocker (again, just like a different guy you seem to complain a whole lot about)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "grambleflamble",
                                    "body": "I agree, we watched different shows.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "StarkhamAsylum",
                    "body": "The ending really fell flat for me.   Overall the show was great.  I need to put it on my rewatch list and see if it hits different the second time around.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SomewhatSammie",
                            "body": "The big twist at the end still sucks, but it's a pretty solid ending if you just subtract that from your mind. Better to have \"too much\" ending like Battlestar than \"too little\" like a lot of shows that don't end up answering their questions, or concluding their plot-lines in a satisfactory way.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Perentillim",
                            "body": "I like everything except Starbuck. And not just her last scene, the stuff that happens in the Nebula and through S4. \n\nI remember at the time people thought her dad was the missing Cylon model, it was a great theory. Didn’t go anywhere and there wasn’t a good alternative offered by the show.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "paul__k",
                                    "body": "In the interview, Moore basically admits that he doesn't have a good answer for Starbuck. IMO, what is really unsatisfying about the whole thing is not that we don't know the answer, but that there really isn't one.\n\nIt's the kind of thing that David Lynch might have done: Here is this weird thing that doesn't really make sense, and he isn't going to explain it to you, and maybe he himself doesn't quite know what it is. But that works for his type of surrealism, whereas here it doesn't.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Perentillim",
                                            "body": "Yuh. I mean I know the explanation - God did it. \n\nBut… that isn’t satisfying. Why do that vs giving Laura a vision or Baltar following cryptic hints from headSix.\n\nUltimately it feels like they wanted a cliffhanger, and then wanted another. Which is a little too much how a lot of S3 / S4 feels - dropping track as you run over it",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Eroe777",
                    "body": "It was so very, very of it's time- Post 9/11- and it was so very, very good.  \n\nI consider it the greatest show I don't really want to watch again.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YogiBarelyThere",
            "body": "That first episode of Battlestar Galactica was great television.",
            "score": 65,
            "replies": [
                {
                    "author": "Kylestache",
                    "body": "Most of Battlestar is great television, so say we all.",
                    "score": 81,
                    "replies": [
                        {
                            "author": "grilledcheez_samich",
                            "body": "So say we all!",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "avalyntwo",
                                    "body": "So say we all!",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PM_ME_YOUR__INIT__",
                            "body": "Luckily those episodes can be skipped",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Maverick916",
                            "body": "I'm gonna disagree with you on that",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Kylestache",
                                    "body": "That’s just what a frakkin toaster would say.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "AgonizingSquid",
                                    "body": "there are like 4 garbage filler episodes but most is great, that puts it at one bad ep per season",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zestyclose-Cloud-508",
                    "body": "33?  Fucking epic.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "mullahchode",
                    "body": "what about the other 80 or so? lol\n\nwhat a weird comment for a goated series",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DUNG_INSPECTOR",
                            "body": "What is weird exactly about pointing out that a particular episode of BSG is exceptionally good?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "mullahchode",
                                    "body": "the implication",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FlopsMcDoogle",
            "body": "Katee Sackhoff would be great as Freya. It's hard to imagine any big dude good enough to be Kratos tho.",
            "score": 23,
            "replies": [
                {
                    "author": "Amaruq93",
                    "body": "What about that big bad guy in \"Reacher\" that manages to make *him* look tiny?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "FlopsMcDoogle",
                            "body": "I haven't watched Reacher yet but I'm looking at this 7 foot monster Olivier Richters now. This guy would actually make Kratos look small....",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "AegonThe241st",
                            "body": "TBH he's not a great actor. Can tell the acting pool for people that make Alan Ritchson look tiny is pretty small",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "GarlicRagu",
                                    "body": "It depends on how he's writing it but does kratos need to be a good actor? I'm no expert in the series but what little I've seen isn't that demanding of the role.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Phonejadaris",
                                            "body": "Depends on which trilogy they're adapting. For the Greek era, no. For the newer games, absolutely yes.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JohnnyGFX",
                    "body": "I would prefer Elizabeth Olsen as Freya, I think.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Notarussianbot2020",
                            "body": "I doubt she has the time.  Marvel is like signing your life away (for money lol).",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "FlopsMcDoogle",
                            "body": "I think Olsen's a better actress, but too young and too beautiful. Sackhoff is beautiful too of course but she seems hardier. She looks like she could scrap moreso than Olsen. She looks like she could put Kratos in his place.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ugh-Another-Username",
                    "body": "That guy that played Master Chief in the Halo series could do it.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "FlopsMcDoogle",
                            "body": "Pornstache? Hmm he is tall and muscular. Does he have a perfectly shaped head when you shave his hair off tho? Lol",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "boringlife815",
                    "body": "Anthony Mackie as Kratos.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pop-chip",
            "body": "I just wish someone would rip the keys to Star Trek away from Kurtzman and give them to Moore.",
            "score": 42,
            "replies": [
                {
                    "author": "pocketMagician",
                    "body": "There would be a lot more hot make outs and I'm okay with that cause Voyager did too.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "monsantobreath",
                            "body": "Moore worked on voyager for one episode only and said the writers room was a miserable place.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Schwiftness",
                    "body": "Ds9 is still my favorite trek, and Moore was one of the writers.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "monsieurxander",
            "body": "A couple of months ago I briefly met Katee Sackhoff and didn't realize it was her until she was walking away. lol",
            "score": 14,
            "replies": []
        },
        {
            "author": "Lexinoz",
            "body": "Always love seeing Bo Katan, I mean Starbuck doing her thing.",
            "score": 12,
            "replies": []
        },
        {
            "author": "avalyntwo",
            "body": "Such a good talk, great guy and writer. I'd have zero interest in a God of War show usually, not expecting much in terms of quality. But this one might actually be good.",
            "score": 6,
            "replies": [
                {
                    "author": "Perentillim",
                    "body": "It was the Wheel of Time showrunner at first. What an amazing re-roll",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "FromLefcourt",
            "body": "I hope they bring back Bear McCreary. His music made Battlestar so much more iconic, and obviously he's already the game's composer.",
            "score": 6,
            "replies": [
                {
                    "author": "Perentillim",
                    "body": "I can’t imagine Bear not being involved. I hope they let him go utterly wild like in BSG.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jg_92_F1",
            "body": "Whenever I see Ron Moore I think of that episode of Portlandia where they made some random dude named Ron Moore write more episodes of Battlestar Galactica",
            "score": 4,
            "replies": []
        },
        {
            "author": "presswanders",
            "body": "Hey Starbuck, what do you hear?",
            "score": 3,
            "replies": [
                {
                    "author": "ralten",
                    "body": "Nothing but the rain",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dirtydovedreams",
            "body": "What the frake??",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrConor212",
            "body": "Didn’t think he spoke about the GoW series, must have skipped past it",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Lone_Apple",
            "body": "His time on ST:DS9 was fantastic. Then the last season happened.",
            "score": -9,
            "replies": [
                {
                    "author": "Amaruq93",
                    "body": "What are you talking about?! He wrote some of that season's best:\n\nTake Me Out to the Holosuite, Once More Unto the Breach, Inter Arma Enim Silent Leges, Tacking Into the Wind, The Dogs of War",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "SherlockJones1994",
                    "body": "Are you really talking shit about season 7 of ds9? It’s arguably the greatest final season of any trek show!",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "monsantobreath",
                    "body": "That was one of the best if not the best season of any trek.\n\nThe final dozen episodes written as a single coherent narrative was ground breaking for TV at the time.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "The_Lone_Apple",
                            "body": "Totally crapped on Dukat's redemption arc by making him the mustache twirling villain again",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Joetheshow1",
            "body": "This guy couldn't even be bothered to play the games, not optimistic for his GOW show",
            "score": -13,
            "replies": [
                {
                    "author": "scbundy",
                    "body": "He's not a gamer. Even on the easiest mode, he probably wouldn't get very far.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Shiirooo",
                            "body": "SIE games are casual games.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "scbundy",
                                    "body": "For us, yes.  I could give my wife the controller, and she'd never beat the first wave of enemies.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Reylo-Wanwalker",
                    "body": "But did he watch it?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}