{
    "title": "Disney+ Adds New “The Simpsons” 24/7 Livestream",
    "author": "KillerCroc1234567",
    "subreddit": "television",
    "rank": 10,
    "score": 261,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 68,
    "url": "https://whatsondisneyplus.com/disney-adds-new-the-simpson-24-7-stream/",
    "id": "1je5ct7",
    "selftext": "",
    "comments": [
        {
            "author": "WrongSubFools",
            "body": "*Livestream?* Really? Sounds just like a regular stream to me. \n\n>No, Homer. Very few cartoons are broadcast live. It's a terrible strain on the animators' wrists. ",
            "score": 174,
            "replies": [
                {
                    "author": "Knotted_Hole69",
                    "body": "Just repeats over and over, I wouldn’t mind it if it’s something you want on for background noise, and not because I’m super lonely or anything lol idk what your on about",
                    "score": 17,
                    "replies": [
                        {
                            "author": "PKrukowski",
                            "body": "Livestream typically would mean something actually happening live. \n\nIts a pedantic joke.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Faithless195",
                    "body": "> Futurama - Painstakingly drawn in front of a live audience",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Weekend_Updated",
            "body": "Perhaps I will accidentally awaken at 3AM and catch a brief, groggy glimpse of that Treehouse of Horror scene where Homer is in full 3D, and he reaches for the goldfish and they scatter away, and some very sad music suddenly emerges, and the vibe becomes -- for this type of show, at least -- almost bizarrely depressing and soul-aching.",
            "score": 129,
            "replies": [
                {
                    "author": "Mattyzooks",
                    "body": "Homer looking at the stars after his mother leaves gets me every time.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "Gloomy_Leader_2556",
                            "body": "I watch this episode whenever I feel like I need to get out a good cry and just can’t. Same with the Bob’s Burgers episode where he takes the kids to visit his mom’s grave. My mom died when I was a kid so they just hit me so hard.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Mattyzooks",
                                    "body": "Same unfortunately.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Tacdeho",
                                    "body": "I don’t remember much about the Bobs Burgers movie, but I very much remember the reveal of Bob’s mom, and I cried like a fucking child.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Gloomy_Leader_2556",
                                            "body": "Yeah the fact Louise’s bunny ears are an homage to her grandma’s beanie was so sweet. My daughter is 9 months old I already see some of my mom in her. She’s got the same eye dimples when she smiles. I watched that movie for the first time last month and hid my tears from my wife and son lol.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "StarTruckNxtGyration",
                    "body": "That music just played in my head. It’s so strange, there’s nothing else like it in any other episode of The Simpsons.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Paralta",
                    "body": "Thats my favourite tree house of horror!! \n\n Bart - \"Homor you have to jump!\"\n\nHomer - \"no problemo\"\n\n*immediately falls through the portal",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SlowTeal",
                    "body": "What scene is that?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_Iceman2288",
            "body": "US only. Shame.",
            "score": 17,
            "replies": [
                {
                    "author": "MelancholyEcho",
                    "body": "Of course it is…",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "pizzapiesinthesky",
            "body": "What streams are available on Disney+? I'm looking for a list but can't find any.",
            "score": 17,
            "replies": [
                {
                    "author": "foxhound012",
                    "body": "There's a kids stream, news stream, disney original/Pixar stream and a star wars/marvel/narnia stream",
                    "score": 14,
                    "replies": [
                        {
                            "author": "pizzapiesinthesky",
                            "body": "For Star Wars/Marvel/Narnia, is it just one stream or one for each of those?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "MysteriousHat14",
                                    "body": "Narnia is canon to the MCU now.",
                                    "score": 27,
                                    "replies": []
                                },
                                {
                                    "author": "foxhound012",
                                    "body": "Just one, it alternates between them, it also play both tron movies and pirates of the Caribbean movies\n\nSome of them get played in sequence tho, star wars usually plays in three, so if you catch a new hope, chances are you'll get rotj if you decide to marathon it",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Locke108",
                                    "body": "One stream. It’s called “Heroes” or something.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Memphisrexjr",
                            "body": "I only see News and Kids stream so far.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "foxhound012",
                                    "body": "Ah then you're probably on the plan with ads right? \n\nYou can only play the kids and news streams if you're on the plan with ads",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Memphisrexjr",
                                            "body": "That makes sense. I have the $5-$10 Hulu/Disney Bundle.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tourgott",
            "body": "That's smrt.",
            "score": 12,
            "replies": [
                {
                    "author": "cadtek",
                    "body": "Yu mssed a",
                    "score": -10,
                    "replies": [
                        {
                            "author": "Tourgott",
                            "body": "[Boy, I really hope someone got fired for that blunder](https://www.youtube.com/watch?v=ls5BFzuxGw4)",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "cadtek",
                                    "body": "Touche",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "flcinusa",
            "body": "Disney+ reinvents \"Every Simpsons Ever\"",
            "score": 6,
            "replies": [
                {
                    "author": "CarrieDurst",
                    "body": "I mean Disney owned FX when that happened",
                    "score": 2,
                    "replies": [
                        {
                            "author": "flcinusa",
                            "body": "Did they? It was in 2014",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CarrieDurst",
                                    "body": "My timeline might be off then my mistake",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LiveFromNewYork95",
            "body": "As someone who still has cable and prefers to channel slip as my main way of watching TV I like streamers diving more into \"channels\" but I still would like to see them resemble real channels than just 24/7 streams of shows. They've gotten better with channels centered around themes rather than just shows. But with the Hulu/FX resources they have I'd watch a ton of a FXX inspired live stream, The Simpsons, Family Guy, Bob's Burgers, Always Sunny, etc. there's enough good shows they have access to that I'd enjoy the channel without picking one specific show.\n\nThey have a throwback movie stream right now. But I'm shocked they don't have a Disney Channel Throwback Channel. DCOMS and old shows with old Disney Channel bumpers. I know the answer is that while on the internet we like to say this idea would work, in practice nostalgic gimmicks like this don't really move the needle, but I could dream.",
            "score": 14,
            "replies": [
                {
                    "author": "sirbissel",
                    "body": "Yep, I miss the kind of serendipity of the old TV model, where you could just kind of flip the channels and find your local Fox affiliate playing The Abyss at 2 pm on a Saturday, or you have a general idea that on a weekday between 5 and 7 pm you can turn to Fox and they'll have some reruns of Malcolm in the Middle, That 70s Show, King of the Hill, and the Simpsons, but you didn't necessarily know which episodes you were getting and it wasn't a \"sit down and decide specifically to watch them\" sort of thing...",
                    "score": 11,
                    "replies": [
                        {
                            "author": "jjohnson1979",
                            "body": "A lot of people argue that on demand streaming services are better because you get to choose what you watch when you wanna watch it! But sometimes, you don't want to choose, you just wanna watch \"what's on, now\".",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "sirbissel",
                                    "body": "I mean, that isn't to say I don't also enjoy the \"I can watch what I want to watch right now (mostly, assuming it's actually on a streaming service, and I subscribe to that streaming service, or am willing to pay to rent the thing I want to watch...)\" model, but yeah, there's something to be said about not having to specifically choose something. \n\n(And while on this soap box, I miss some of the more fun parts of TV, like where they'd show movies that were hosted - I'm thinking like Svengoolie - which I think may still be around - or USA's Up All Night, Dinner and Movie, etc. ... though maybe those're relegated to cable, and since I just use streaming and OTA TV I mostly get sports and local news...)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Remote-Plate-3944",
                    "body": "I'm a huge fan of channels on streaming sites. Shudder was the the first of the services I have had that did it. I get decision fatigue all the time. It's nice to just pick something already in progress than tackling the thought of finding something and then starting it from the beginning.  I am way more likely to watch something new using them also.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Vestalmin",
                    "body": "If a channel has ads I actually want the bumpers back. It gives a sense of place that I miss",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "theummeower",
                    "body": "Probably has something to do with syndication rights. \n\nChoosing to watch an episode of a show on streaming is different than the streaming company provided a curated list of shows playing on loop, which is basically what syndication is. \n\nSo I imagine the reason we don’t have it is because the lawyers for the streaming companies have told them if you do something like that you open yourself up to lawsuits about syndication fees and could lose if it is determined that curated live streaming is essentially the same as broadcast syndication.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ImmortalMoron3",
                    "body": "Yeah, I like these too. It reminds me of the old random streams you could find on Winamp back when I was in high school. I remember there was one that only played MST3K and I'd watch it all the time.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pilgrimteeth",
            "body": "They need to adopt a “Random Simpsons episode” button like Hulu used to have, you could even go in and select/de-select particular seasons to be pulled from, it was great",
            "score": 6,
            "replies": [
                {
                    "author": "Goose-Suit",
                    "body": "Also let them be in the regular 4:3 format. Zooming in so it fits 16:9 looks like shit",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LordXenu45",
                            "body": "There's actually an option for this under extras. Turn off the \"remastered\" aspect ratio.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Goose-Suit",
                                    "body": "Holy shit that’s huge",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jogoso2014",
            "body": "Good idea",
            "score": 3,
            "replies": []
        },
        {
            "author": "JSchau941",
            "body": "I’m on the Disney+ app (in US) and don’t see it yet. Has it not been uploaded yet? Can’t find it anywhere",
            "score": 3,
            "replies": []
        },
        {
            "author": "Bibileiver",
            "body": "Fuck yesssssssssss",
            "score": 6,
            "replies": []
        },
        {
            "author": "Rakatok",
            "body": "I wish all these streaming services would just add a shuffle button for series.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mkmichael001",
            "body": "I used to watch 24/7 streams for free years ago of Simpsons, family guy and south park on Justin.tv",
            "score": 4,
            "replies": []
        },
        {
            "author": "Swordf1sh_",
            "body": "This should help me catchup on the 30+ seasons I’ve missed",
            "score": 2,
            "replies": []
        },
        {
            "author": "unsaltedbutter",
            "body": "How many days can they play w/o repeating an episode?",
            "score": 1,
            "replies": [
                {
                    "author": "flcinusa",
                    "body": "Based on the FX Networks original Every Simpsons Ever marathon, 12 days, and that was 11 years ago so probably closer to 18 now",
                    "score": 6,
                    "replies": [
                        {
                            "author": "sirbissel",
                            "body": "Did they include ads (and will Disney+ include ads?)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jake3988",
                    "body": "Well, this is pretty easy math.\n\nCurrently there's 782 episodes that have ever aired.  I'll ignore that this season, as always when airing, is currently exclusive to Hulu (and potentially soon, exclusive to Fox's new service) because the end result won't really change.\n\n782 * 1/2 hour = 391 hours / 24 hours = 16.29 days.\n\nAnd obviously this does not count the movie nor the original shorts nor the new shorts created for Disney+, which I'm assuming are not included in the stream anyway.  If they all are, more like 16 and a half days.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "krish0",
                            "body": "Episodes are closer to 22 minutes long so you have to shave about 4.3 days off of that total.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "BruceChameleon",
                                    "body": "Depends on if you get ads or not",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "moderatenerd",
            "body": "donuts...",
            "score": 1,
            "replies": []
        },
        {
            "author": "antiquated_it",
            "body": "I wish I could pay half as much and only be able to stream the Simpsons since it’s the only thing my kids watch anyway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dagreenman18",
            "body": "I would love a shuffle and the ability to restrict it to certain season, but otherwise hell yeah this is perfect background TV",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hunterrose242",
            "body": "I legit enjoy these \"live channels\" that are on streaming services.  I can eat my entire dinner while trying to decide on a damn show to put on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "apple_kicks",
            "body": "We’ve gone to broadcast channels doing reruns on a schedule, to streaming what you want but now back to channels playing reruns on a schedule but it’s called live streaming now",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhenomsServant",
            "body": "Does that include Stark Raving Dad, or are they just continuing to pretend that episode never happened?",
            "score": 0,
            "replies": []
        },
        {
            "author": "fallenmonk",
            "body": ">offering 767 episodes across seasons 1 thru 35\n\nNo thanks. Make a stream that's just the first 10 or 11 seasons, then I'll check it out.",
            "score": -6,
            "replies": []
        },
        {
            "author": "Timmah73",
            "body": "Like sure you can just put it on and let it go but when I think livestean I think how Bob Ross and MST3k are streaming on twitch and YouTube.  Steaming simpsons with a live chat would be awesome",
            "score": -5,
            "replies": []
        }
    ]
}