{
    "title": "Crushed 😭",
    "author": "DudMiilk",
    "subreddit": "StardewValley",
    "rank": 19,
    "score": 754,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 35,
    "url": "https://i.redd.it/yv7p3a3l8epe1.jpeg",
    "id": "1jdyusr",
    "selftext": "Just got a new phone, did the fun little transfer of all my data/files/pics/vids/apps/contacts/music/downloads, EVERYTHING, etc, open my game for some chill time and.. I don't even know how many hours in total, but 3 different files.. just gone.. my spouses.. my ANIMALS... MY PRISMATIC SHARDS 😭😭😭 am I just a silly goose and everyone knew this shit doesn't transfer orrrrr?? WHY IS THIS NOT MORE KNOWN im legitimately upset 🤮💀",
    "comments": [
        {
            "author": "JanileeJ",
            "body": "It doesn't save to the cloud like some games.\n\nThe wiki had instructions on how to find your save files. If you still have your old phone, maybe you can transfer the save files?\n\n[https://stardewvalleywiki.com/Saves#Mobile\\_.28Android.29](https://stardewvalleywiki.com/Saves#Mobile_.28Android.29)",
            "score": 437,
            "replies": []
        },
        {
            "author": "DarthRheys",
            "body": "We've all been ther and you know what? The next time you'll start a new game will be even better, you'll enjoy it even more and you'll achieve your goals even faster. You didn't lost a game, you lost a save. The game will always be there for you. Take a break, play some other thing and when you're rready, jump back into it. It's going to be great, i assure you.",
            "score": 228,
            "replies": [
                {
                    "author": "Trick-Flight-8749",
                    "body": "This is really lovely advice! It didn't happen to me but I would be devastated.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "ScyllaOfTheDepths",
                    "body": "I lean into a different aesthetic every time with a new themed farm. First was forest lumberjack, 2nd was ocean themed on the beach farm, and my current one is cottage core with a touch of goth on the wilderness farm. Do a new aesthetic, try a new farm type, make it fun.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thick_Suggestion_",
            "body": "Happened to me when I got a new phone... didn't know about it, wiped the old phone.... rip 500hours 😭😭",
            "score": 28,
            "replies": []
        },
        {
            "author": "Different-Pin5223",
            "body": "Oh my god I wish I knew what to tell you. I play on PC. I'm so sorry, commenting and upvoting to boost",
            "score": 81,
            "replies": []
        },
        {
            "author": "Bae_Mes",
            "body": "I'm so sorry! That really sucks! And it is ok to be upset about losing all your games.",
            "score": 19,
            "replies": []
        },
        {
            "author": "aisamo",
            "body": "this happened to me! first time I switched phones my save didn't transfer, second time I switched phones the new save file did which had me confused\n\nI found my old phone and ended up connecting it to my computer, found the save file and transferred it to my laptop, then I got my new phone and dropped the save file in the appropriate folder and voila, had my original save file again",
            "score": 13,
            "replies": []
        },
        {
            "author": "bringtwizzlers",
            "body": "Oh I would throw up profusely. I'm so sorry",
            "score": 12,
            "replies": []
        },
        {
            "author": "TheEmoQueer",
            "body": "Mine transferred over with no issue but I was so scared it wouldn’t. RIP :(",
            "score": 9,
            "replies": [
                {
                    "author": "Mehmeh111111",
                    "body": "I'm so scared it won't that I still play on my old phone like it's an iPad.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Agreeable-Owl5533",
            "body": "My game data is saved to iCloud on iOS. Just confirmed between my phone and iPad.",
            "score": 7,
            "replies": [
                {
                    "author": "arashi256",
                    "body": "Same as me. I switch between iPhone and iPad and it syncs between them using iCloud. I wish it had a native cloud save solution, though. I have a different save on PC, would be nice to sync between all devices. I understand that's probably not on the cards though, with the developer being one guy.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Agreeable-Owl5533",
                            "body": "Apparently, you can. It’s just a pain to move the files over. You have to use iTunes.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "arashi256",
                                    "body": "Yeah, I was hoping for something a bit more seamless than that :) I know it can be done but I'd like something official, you know?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Charming_Couple_5163",
            "body": "that would be my 13th reason",
            "score": 7,
            "replies": []
        },
        {
            "author": "Evil_Black_Swan",
            "body": "If you still have your old phone, can you try the transfer again?",
            "score": 7,
            "replies": []
        },
        {
            "author": "infamdog55",
            "body": "https://preview.redd.it/dwzovxuklfpe1.jpeg?width=811&format=pjpg&auto=webp&s=addf4594988cf52f11bb8b5974825410c759f217\n\n(But fr that sucks bro hope you can fix it)",
            "score": 5,
            "replies": [
                {
                    "author": "TheMainStream",
                    "body": "Thy end is now...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "wolfgang784",
            "body": "Mobile game data very very rarely transfers automatically when doin phone data transfers. Always gotta look up first how each game you want saved stores its stuff and how to copy it (if it even can, some won't work when copied over). We all learn that one the hard way, though.",
            "score": 5,
            "replies": []
        },
        {
            "author": "RagingKERES",
            "body": "Just did this myself.  Download a file Explorer. Go into your data files from the Explorer.  Do not go into the save file(only my saves from before 1.5 were in here).  Instead, look for a file with your farms name.  There's your save, copy the file, email it to yourself, open in the new phone and plant it into the same folder and spot as the other phone.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Dreamerbloom11",
            "body": "If you still have your old phone you can transfer the save files to your new phone\n\nYou just have to search for the folder they are in",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gold_Particular_9868",
            "body": "[My honest reaction if this happens](https://youtu.be/ehP84CGU4T0?si=0iXr9KlLqznNX7HR)\n\n\nNo but rlly that blows I'm sorry man ",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpaceWorm33333",
            "body": "This happened to me with Minecraft and honestly it crushed me too because that was my first experience. I’m so sorry!!! I have no solution for you just hope you can come back to it when it hurts less ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stillverasgirl",
            "body": "I lost my first ever farm so I totally feel your pain",
            "score": 1,
            "replies": []
        },
        {
            "author": "aslittatti",
            "body": "Same thing happened to me I was devastated, didn't play for a year. Picked it up again recently on March 3rd and it's my best play through yet",
            "score": 1,
            "replies": []
        },
        {
            "author": "beultraviolet",
            "body": "You know what, I just started a new save on Switch and it’s like a whole new game because of all the updates mobile doesn’t get. Starting over won’t be so bad!",
            "score": 1,
            "replies": []
        },
        {
            "author": "WesternKey2301",
            "body": "Genuinely think I'd cry for a bit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "asahidryck",
            "body": "But it’s so fun to restart!!! It’s not all for nothing ❤️❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suu-Da-Slime",
            "body": "https://preview.redd.it/pbtyu3l4kgpe1.jpeg?width=1080&format=pjpg&auto=webp&s=3f25e408b77e8aa988a5879721192db4f36961ea\n\nThis is so sad that reddit gave me it reaction meme",
            "score": 1,
            "replies": []
        },
        {
            "author": "TerenceMiller",
            "body": "Hope you fixed it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Long-Definition5088",
            "body": "I FEEL YOUR PAIN.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otherwise_Disk3824",
            "body": "You could use cheats to get everything back. It'll take some work but if you remember roughly what you had you could.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Druidic_assimar",
            "body": "This is an easy fix as long as you still have your old phone, and you own a computer.\n\nThere are instructions on the wiki on how to move your file from your phone to your computer and vice versa. \n\nJust be aware that sometimes there can be an issue with the code (I had a glitch where my mill wasn't showing up) and if that happens you'll need to go fix it. I generally just use notepad to do that on pc. Hopefully you don't have that issue, maybe he fixed it in the recent patch.\n\nAnyways, take a deep breath, you can get your game back :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "kelbe11",
            "body": "I play on my iPhone and it saved to the cloud, so when I got a new phone it transferred. I’m so sorry, I would be devastated 😩",
            "score": 1,
            "replies": []
        }
    ]
}