{
    "title": "Stardew Notebook",
    "author": "Charming_Couple_5163",
    "subreddit": "StardewValley",
    "rank": 4,
    "score": 2775,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 97,
    "url": "https://www.reddit.com/gallery/1je1hj1",
    "id": "1je1hj1",
    "selftext": "i found it so much easier to play when i have something to check things off with - any ideas of things i could add? ",
    "comments": [
        {
            "author": "west-desert",
            "body": "Yo why can I do this for games but not my actual life?",
            "score": 293,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "i’m literally in the middle of my exams but all i wanna do is this 😭",
                    "score": 156,
                    "replies": []
                },
                {
                    "author": "Bromswell",
                    "body": "Same.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Intmilan7",
            "body": "This is just beautiful and your handwriting is very pleasant to read.\nI know the wiki is out there but I also enjoy hand notes to thumb through, but this is next level - Well done!\nOne thing to add…How have you not doodled a junimo on the cover? Lol",
            "score": 248,
            "replies": []
        },
        {
            "author": "lackingsavoirfaire",
            "body": "As a bullet journaler I don’t know why I never thought of this. I just have some frantically scribbled notes in my work notebook lol",
            "score": 71,
            "replies": [
                {
                    "author": "Space_Oddity_2001",
                    "body": "I'm not a bullet journaler but the notebook I use is an A5 \"dot grid\" notebook that is marketed as a bullet journal. Depending on your bullet journal style, it translates really well to a SDV journal. \n\nAlso, for anyone wondering, an A5 notebook fits perfectly with the SDV Guidebook. 😁",
                    "score": 17,
                    "replies": [
                        {
                            "author": "lackingsavoirfaire",
                            "body": "Ooh interesting. I was considering buying the SDV guidebook but I might just DIY one instead. I don’t do a tonne of drawing in my bullet journal but I do make it look pretty.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Space_Oddity_2001",
                                    "body": "I think a personalized SDV Guidebook would be a lot of fun to put together! But I do like the SDV Guidebook, too, and I've enjoyed having it.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "IDoAnythingForABook",
                            "body": "I love my A5 dot grid notebook! The one I have isn’t made anymore by the company, and I’m desperate for a new source. Where did you get yours from??",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Space_Oddity_2001",
                                    "body": "I have this one: [https://www.amazon.com/dp/B07SVTHR88](https://www.amazon.com/dp/B07SVTHR88)\n\nIt may seem a little pricey but they occasionally go on sale and you can get it for a little less, but this is also a three pack. The pages are a really good weight so they don't bleed through easily. My favorite thing about it is that because of the clear cover, either side is the front, it easily converts to a left handed notebook, and you can decorate the first page to be the cover and if you make a mistake, you can rip it out and start again.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wrong_Mark8387",
            "body": "I love this! I go through periods when I work too much to play and then can’t remember what I was doing when I return to the game. A friend has a spreadsheet but I think I would work better off a notebook. This is great!",
            "score": 15,
            "replies": [
                {
                    "author": "Space_Oddity_2001",
                    "body": "I have three different games (of SDV) ongoing so I use a notebook to remember what I was trying to accomplish in each version. Each game has a different farmer name &  farm name, and I don't want to find myself playing basically the same game, just in three different settings so I give myself different goals and different vibes for each section. I come around to each randomly, every couple of weeks, when I have time, and I don't want to find myself trying to (for example) make big money on a farm that I set up to just gather a bunch of forage and chill. \n\nI tried using a spreadsheet, and even a notes app, but ultimately I found I liked having a notebook that I could just write myself quick notes in. It's also great for when you aren't on the computer or working on something you can't toggle away from and just want to grab it and scribble down some random layout that you just thought of or some reminder that just came to mind.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Charming_Couple_5163",
                    "body": "yes!! this is exactly how i felt, and also with having expanded installed i get so lost sometimes with how much content there is. it’s just a nice lil helper while i game",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lokregarlogull",
            "body": "https://preview.redd.it/strguin5ghpe1.jpeg?width=1180&format=pjpg&auto=webp&s=0f85f98e4a75d4ce630973c079dc03d6d6dd4a9b\n\nI'm not jelous of those notetaking skills at all",
            "score": 14,
            "replies": []
        },
        {
            "author": "v_batorr",
            "body": "This is amazing could you upload it somewhere I would love to use it.",
            "score": 18,
            "replies": [
                {
                    "author": "Not_AHuman_Person",
                    "body": "It's a bit pricey but the [stardew valley guidebook](https://www.fangamer.com/collections/stardew-valley/products/stardew-valley-guidebook) is basically this",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Charming_Couple_5163",
                    "body": "i want to clean it up a bit but i’d love to digitise it on my ipad once i have!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dawnonpurpose32",
            "body": "Love it! I also make notes. I keep a gift guide page for all the characters.",
            "score": 10,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "thank you! oooo that’s so smart i’ve definitely gotta add that in!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "RBDibP",
                            "body": "I've added a section to my notes where all the buildings and requirements for building them are listed!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZorroFuchs",
            "body": "That's dedication",
            "score": 8,
            "replies": []
        },
        {
            "author": "DegredationOfAnAge",
            "body": "You're a cool person.  Incredibly creative! \n\nAnd here I am just playing in windowed mode so I can easily access the wiki",
            "score": 7,
            "replies": []
        },
        {
            "author": "lockelan",
            "body": "I also have a few SDV notebooks. One is for vanilla play. It has birthdays, easy to get loved and likes gifts for when you're just starting out. Then I have one that's for various modded versions, like SDVE. Yours is definitely prettier than mine! My handwriting is bad lol",
            "score": 6,
            "replies": []
        },
        {
            "author": "MrsTorrance",
            "body": "I do this too!!!\n\nRight now it's a looooooong note in my phone but I also love a notebook.",
            "score": 5,
            "replies": []
        },
        {
            "author": "IDoAnythingForABook",
            "body": "Omg a new productive procrastination task just dropped!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Geographyporn",
            "body": "I need one of these I’m always forgetting to do things lol",
            "score": 3,
            "replies": [
                {
                    "author": "Geographyporn",
                    "body": "And yes I have the to dew list mod",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Helophilus",
            "body": "I admire this, my life is chaos.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TadaSuko",
            "body": "I WANT ONE",
            "score": 3,
            "replies": []
        },
        {
            "author": "Scared_Flatworm_7977",
            "body": "... I'm doing this just to have an item that showcases my obsession. First I need to get good handwriting lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "Charming_Couple_5163",
            "body": "umm thank you all?? i didn’t expect such lovely words!! i wanna neaten it up a little and make sure it’s easier to read before i create something that i can share with people! if anyone has any ideas of sections i should add or fun additions please let me know! <3",
            "score": 3,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "there are also some sections i didn’t take photos of just because of how many pages i’ve filled, the book is a lot longer but i really didn’t think anyone would take notice 😅",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spiike86",
            "body": "Woow. Nowadays I use mods or a second monitor with wiki. But it reminds me of the old Harvest Moon games on the ps1. I did exactly the same at the time with index cards and a strict sorting. All days, all prices, all recipes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "xJadee_",
            "body": "IM IN LOVE!! 😍😍😍\nI'm so glad I'm not the only one who does this 😭😭",
            "score": 3,
            "replies": []
        },
        {
            "author": "ItchyBalance7864",
            "body": "🫡",
            "score": 2,
            "replies": []
        },
        {
            "author": "Quinzal",
            "body": "No way, Grandpa in real life",
            "score": 2,
            "replies": []
        },
        {
            "author": "pine1501",
            "body": "dedication !",
            "score": 2,
            "replies": []
        },
        {
            "author": "crummytortilla",
            "body": "Wow, and I thought I was put together with my printed and stapled packet. I aspire to be you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "nsgyarc",
            "body": "Now I know pets can wear hats. If it doesn't work I'm gonna be mad.",
            "score": 2,
            "replies": []
        },
        {
            "author": "realbigfoot24",
            "body": "If it’s not a secret, what in the “farm” topic?) I’m very interested in how you designed it)",
            "score": 2,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "no worries! the farm section is a slight work in progress so i didn’t take a photo but it basically has a mini map drawing of my farm (i use the 4 corners farm) and i draw where i want my buildings to go/where i want paths. just basically a lil design plan before i officially do it in the game!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Space_Oddity_2001",
                            "body": "I love doing a written out map! 😍 There's something very satisfying about drawing out your own map and being able to add notes & observations, like what worked and what didn't and what you want to do differently next year.  \n\nAlso, coloring in your map like it's your own personal coloring book. 😉",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Space_Oddity_2001",
            "body": "I use a grid notebook so I can make a map of how I want to layout my crops. I know that a lot of people use the Farm Builder, but I like being able to sketch it out on paper and then go back and make notes on what worked and what didn't. \n\nAlso, sticky notes with \"TTD\" (things to do) because between leaping out of bed, checking the calendar, watching the news & weather, watering crops, then grabbing a thing for someone who's birthday I saw on the calendar ... often followed by a pell-mell dash to the forest to check the Traveler's Cart ... I too often realize that it's four-thirty and, dang it, I was supposed to go pick up my newly finished pick-axe from Clint.\n\nSorry, Clint! That one was on me! 🤣",
            "score": 2,
            "replies": []
        },
        {
            "author": "LaughingBeer",
            "body": "If you are anything like me, someday you will be able to play with all that in your head and you will look back on your notebooks fondly as part of the journey you wish you could experience again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Imisstheoldgames",
            "body": "This brings me back to the days of gaming when everything wasn't on the internet. Making notes on where to find an npc or where to go for a side quest... damn I miss those days. Every game was full of wonder for me.\n\nFor those wondering this was the wiki for games back in the days, just make it yourself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alexandra_the_gre4t",
            "body": "I love this!",
            "score": 2,
            "replies": []
        },
        {
            "author": "doornumberfive",
            "body": "Amazing! I want to sink the next week into recreating this myself. I'd second the recommendation for a gift guide. Also could be fun to do a page for tailoring a wardrobe.",
            "score": 2,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "i use a small A5 notebook so that it doesn’t get as overwhelming as a larger book!! goodluck <3",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "8bitGalaxy98",
            "body": "I love gaming journals and notebooks so much",
            "score": 2,
            "replies": []
        },
        {
            "author": "LizzyBug92",
            "body": "Love this! I once attempted to make a journal but it was too much haha",
            "score": 2,
            "replies": []
        },
        {
            "author": "thewisestpig",
            "body": "AMAZING love this. it's so simple and clean, but so useful.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ZeroDucksHere",
            "body": "I see you play SDV Expanded. It definitely needs a notebook with all the information.. great job",
            "score": 2,
            "replies": []
        },
        {
            "author": "nyxeris90",
            "body": "I also did this last summer, and then made a PDF with more info as well last month (like the festivals, Ginger Island, books, cooking recipes) \nTook me three full days to make that pdf, and I kept forgetting to add stuff 😭 ended up at 66 pages",
            "score": 2,
            "replies": []
        },
        {
            "author": "PRIMITIVE-BLAST",
            "body": "Well, now I need a label printer. Thank you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HBROSE",
            "body": "This is amazing! I wish I had the patience to do this. Inspiring for sure ![img](emote|t5_2wb7y|51693)",
            "score": 2,
            "replies": []
        },
        {
            "author": "p1Xel83",
            "body": "Love that, thx for sharing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Perfectdyani",
            "body": "I would love to get into this game like that I feel like itsss sooo relaxing",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cpaebara",
            "body": "Wow",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChapterNorth349",
            "body": "I want your level of dedication T-T",
            "score": 2,
            "replies": []
        },
        {
            "author": "skullpture_garden",
            "body": "I commend your layout skills. I would misspell one word or overshoot a line and throw the whole thing away.",
            "score": 2,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "hahaha tipex has been my best friend 😅",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "stubrador",
            "body": "Aw I love this, I have to do stuff like this too for loads of games!\n\nThanks for sharing 🙂",
            "score": 2,
            "replies": []
        },
        {
            "author": "stubrador",
            "body": "What about adding the cost and materials required for farm buildings and the sell prices of artisan goods.\n\nAnd remember the different stars on sellable items affect the sale price 🙂\n\nAnd museum artefacts ticklist",
            "score": 2,
            "replies": []
        },
        {
            "author": "RJSnea",
            "body": "What notebook is this? 😍 I love stationary and my own Stardew notes are frustrating to find in my Moleskine.",
            "score": 2,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "i will find the brand when i’m home!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FroggiePenguin2021",
            "body": "That is dedication!",
            "score": 2,
            "replies": []
        },
        {
            "author": "IonicHalfling1993",
            "body": "I would literally pay you to make one for me. I have seen so many disappointments on Amazon for \"Books\" on SV and I've been looking for something exactly like this! Please make them and put them on Etsy! You would make so much money from us players who love organization and concise notes!",
            "score": 2,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "i want to clean it up and hopefully do this if enough people would like this??",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FeetInTheEarth",
            "body": "I can put grapes in the dehydrator?! I CAN PUT A HAT ON MY PETS?!?!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Different-Pin5223",
            "body": "You bullet journal folks amaze me",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bunnsie121",
            "body": "you’re so smart omg",
            "score": 2,
            "replies": []
        },
        {
            "author": "InTheFlesk",
            "body": "I have a Stardew Valley bullet journal too! I got fun sticker sets off Etsy and Redbubble, so most of the items also have pictures to go with.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheOldDrunkBear",
            "body": "I just want to buy this to use as a checklist....",
            "score": 2,
            "replies": []
        },
        {
            "author": "Negative-Ad-8270",
            "body": "Where did you get your book?",
            "score": 2,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "i bought a bunch from a charity shop but i will check the branding!!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Negative-Ad-8270",
                            "body": "Thank you ❤️!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Snake_Squeezins",
            "body": "One day, many years from now, you're going to find this in a box and smile. These sorts of things are treasures. Artifacts from a time of simple joy and cathartic pleasure. I have some old maps I drew from an old super Nintendo game still. Secret of Evermore. You made it yourself for a utilitarian purpose, to organize and squeeze a thorough enjoyment out of something you enjoyed immensely. Never let this go. It's more important than you realize even now. Cool post.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HackedTheGate",
            "body": "Love it! I feel like I need to do something like this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bromswell",
            "body": "Same.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LobsterFew4672",
            "body": "\"random notes for your forgetful ass\" I felt that so much 😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "FunTraditional9064",
            "body": "I need to do something like this. I just use a cc checklist I found on Pinterest",
            "score": 2,
            "replies": []
        },
        {
            "author": "subtle-magic",
            "body": "I love this, it's very similar to old notebooks I used to keep for the game. Crop planning and that season's fish were the big ones for me to track. I made a PDF guide to track my progress now, but I'd never have been able to get the layout right without the earlier handdrawn stuff.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stralisemiai",
            "body": "I have a Stardew book too! I bought one of those pens with 4 colours of pastel ink in it to pair with it. It brings me alot of joy! Thanks for sharing yours!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Moist-Comfortable-10",
            "body": "You made a farmers almanac \nAmazing",
            "score": 2,
            "replies": []
        },
        {
            "author": "duliwuli",
            "body": "wowwow this brings me back to my childhood and the many spiral notebooks my sister and i had for harvest moon. 🫶 we’ve since upgraded to spreadsheets",
            "score": 2,
            "replies": []
        },
        {
            "author": "RetroBratRose",
            "body": "Until the pics loaded, I thought it was gonna be like the Death Note, but for farming.... Farm Note.\n\n\"I'll take this potato seed...AND I'LL PLANT IT!!!\" 🤣",
            "score": 2,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "😭😭😭",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Safe_Engineer_969",
            "body": "This is super impressive! Are you a PM? You should be",
            "score": 2,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "thank you!! ooo sorry what’s a PM?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "othersymbiote",
            "body": "oh… that’s… so pretty. mine always come out like shit lmao",
            "score": 2,
            "replies": []
        },
        {
            "author": "babytaco2015",
            "body": "Pets can wear hats??? Thank you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Obvious-Maximum-8504",
            "body": "You need to put this into print. I would absolutely buy one",
            "score": 1,
            "replies": [
                {
                    "author": "Space_Oddity_2001",
                    "body": "There is a Stardew Valley Guidebook with a lot of the game info, but in book form. I have the 1.5 edition (and the company that I got it from sent 1.6 updates as a freebie PDF when 1.6 released) and have absolutely zero regrets about getting it.\n\nEdited to add that it makes a great base to starting a personalized notebook like OP's journal.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "NachtKnot",
            "body": "This is lovely. I also feel more comfortable having notes of certain games lol, although I'm not as organized. Out of curiosity, do you happen to know what your MBTI type is?\n\nBtw the extra note of pets can wear hats is a must, I did not know until my second run where I accidentally clicked on my pet, it was a beautiful discovery :')",
            "score": 1,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "i’m INFP-T and 20(F), i’ve never looked into them too much so i hope that’s an okay one 😅",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Longjumping_Fan_3057",
            "body": "You've got too much spare time",
            "score": -4,
            "replies": [
                {
                    "author": "Charming_Couple_5163",
                    "body": "it really didn’t take that long! i just find it saves me time having to jump between open tabs and my game, also i’m forgetful so taking notes of things i can come back to later has been super helpful",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}