{
    "title": "Ok no this broke my heart",
    "author": "This-Effective8965",
    "subreddit": "StardewValley",
    "rank": 2,
    "score": 4156,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 67,
    "url": "https://www.reddit.com/gallery/1je6ctq",
    "id": "1je6ctq",
    "selftext": "I know it's well known in the Stardew community that Jodi has her regrets about marrying and starting a family so young but I always thought that's just something she confides to the player and no one else suspects a thing. This is my first time seeing this dialogue from Sam and it honestly broke my heart. Poor Sam is so sweet and loving when it comes to his family so I can only imagine how this thought is bothering him.",
    "comments": [
        {
            "author": "boilyourdentist",
            "body": "I yearn for more people to discuss Sam’s more depressing/serious dialogue because I feel like the fanbase views him as either “manchild” or “no thoughts always happy”",
            "score": 1301,
            "replies": [
                {
                    "author": "bindsaybindsay",
                    "body": "THIS Sam is my favorite bachelor and when people talk about him like that I know immediately that they've either never gotten him past a few hearts or they just skip dialogue altogether. He is incredibly empathetic and emotionally aware of his complex family situation. He goes out of his way to be a role model to his little brother and doesn't want his mom to feel any unnecessary stress, and wants her to feel like she can depend on him to be responsible.",
                    "score": 556,
                    "replies": [
                        {
                            "author": "DemonicSockPuppet",
                            "body": "I used to always marry Sebastian, but then decided to give Sam a chance and now he's my favorite person, along with his brother. i love Vincent to bits and giggle every time I give him a snail. But Sam is incredible, stays empathetic and positive in a tough situation, his father is away fighting in a war. sam doesn't know wether he'll come back, sees his mother struggling, but chooses to stay strong and optimistic. He also enjoys the same things I do irl, like music, taking walks in the forest in the fall and living in a small town.",
                            "score": 192,
                            "replies": [
                                {
                                    "author": "Fit-Ad-508",
                                    "body": "Seb gives you coffee and takes care of wounded frogs! 😭 Alex is great but I’m taking my emo amphibian lover.",
                                    "score": 40,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Haunted-Blueberry",
                            "body": "Sam is the BEST boy. I was so surprised by his arc. I didn’t think I’d like him much. But his 14-heart event specifically is such a satisfying conclusion of his journey.",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "No-Appearance1145",
                            "body": "I don't care for Sam as a spouse (I did marry him). I care about him though because he's still a sweet guy.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "Mental-Clerk",
                            "body": "Agreed. When I first started playing I did think he was probably not the guy for me, but getting to know him better I really considered him, but Seb captured my heart first. I will marry Sam one day though just to experience it. I think he'd be a great husband.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Patient_Town1719",
                    "body": "He strikes me as the guy who stays fun loving as he gets older because he has a deep understanding of the troubles in the world and that helps them keep positive.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "Starthenut",
                    "body": "Agreed! It drives me crazy when people call him immature because to me, Sam is incredibly mature. I'm not sure if people don't see his year one exclusive event but I was surprised the first time I saw it because for once, he wasn't happy go lucky. Sam definitely prefers to be happy and not dwell on the negatives but that doesn't at all make him a manchild.",
                    "score": 75,
                    "replies": [
                        {
                            "author": "Arcalium",
                            "body": "I've said it before, but Sam is very emotionally mature and perceptive! Given the fact he's supposed to be \"the man of the house\" in Kent's absence, plus how he acts in his 3-heart event, I don't agree with the common sentiment that he's a \"manchild\" for acting so positive and upbeat despite his circumstances. Especially since it's for Vincent and Jodi's sake. He's trying to ensure their lives aren't tougher and more grim than they already are, and he does what he can. Jodi mentions money being tight. She's a stay-at-home mom. Sam has a part-time job (working at Joja, and if Joja's gone, he works at the museum/library) to help pay the bills.\n\nI also don't see the \"correct\" choice in the 4-heart scene (the infamous egg snack scene) as an indication that he's childish either. Jodi takes on the burden of raising two kids by herself, and her dialogue outright indicates that she's overwhelmed and doesn't want Sam and Vincent to have to deal with that same stress. Of course, this is to their detriment (Sam can't cook), but it's a result of having kids so young and missing out on her own youth that she embraces the opposite for them. Hence, her reaction to him dropping an egg is overblown because it's effectively the straw that broke the camel's back. The player claiming responsibility for the egg is them doing their part to ease her stress, or at least ensuring she doesn't blame her adult child (who has already given her enough grief in the past, if you recall his record for community service hours and penchant for pulling pranks) as someone causing more trouble for her.",
                            "score": 55,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jacksonLisa5p1",
                    "body": "Let's be real, that hurts.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "SammyFirebird79",
                    "body": "I think his positivity is a coping mechanism, TBH - same with his being \"childish\", like he's making up for a childhood cut short when his dad was deployed and he became the \"man of the house\".\n\nThe guy's been parentified to some degree, yet infantilsed/coddled in others (not being expected to do chores, for instance). Can imagine there's a lot of conflicting feelings about it all 🙁",
                    "score": 57,
                    "replies": [
                        {
                            "author": "FP509",
                            "body": "I can actually relate to this. I’ve been looking after my sisters since I was 8 (to the point where my mom told me my sisters listen to me more than her), but I was also spoiled and babied so much that at I’m closer to 30 than 20, and I only just learned how to open a savings account and use a credit card. I freely admit that I have arrested development, and it fucking sucks.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ARandomPerson666",
                    "body": "YES! People need to see that he's more than our golden retriever boy and has serious dialogue along with the happiness. Hell, I wish people would notice that his \"manchild\" behaviors come from Jodi's parenting. The whole family has their issues, and it explains the way themselves and the others in their household are. I love Sam and his family!",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "ShokaLGBT",
                    "body": "He was my first boyfriend in the game and I always thought he was mature. His 14 hearts event is proof of him growing as a person",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "xkise",
                    "body": "I always thought the community got that it's obvious that this kind of \"always happy\" behavior from him it's his way of copping with everything about his family",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "GracefulGlider",
                    "body": "My thoughts exactly! I dunno if people just miss his 3 heart event or what. The dude is a golden retriever no doubt, but he's also a rare unproblematic loving older brother who wants to do right by his sibling in his father's absence...",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "TahaymTheBigBrain",
                    "body": "I cant take Sam seriously because of that dumbass cut ☠️☠️",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Unfair-Coffee904",
                            "body": "I’ve always loved the cut. The nostalgia is strong, as he reminds me of a 2d Cloud Strife",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "runetrantor",
                            "body": "Art packs really help.\n\nI didnt dislike him, but he was simply not my fav bachelor, until I used that DCBurger pack, which made him look a bit less young teen, and now he is up against Alex as my fav one.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Jordan10193",
                            "body": "Super saiyan Sam 💀",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SparkyDogPants",
                    "body": "Even golden retrievers get sad.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Infamous-GoatThief",
            "body": ":(((( I love Jodi and this always makes me so sad",
            "score": 196,
            "replies": [
                {
                    "author": "TheNamesMacGyver",
                    "body": "Every time I play, I wish I could do more to take care of her and the kids.  She's a dedicated mother, and she loves her family but facing the world alone while her husband is deployed, then returned a different man takes a toll on anyone.  Kent is a good dude, but he isn't equipped to take the stress of running the household away.\n\nI just want the best for them all.",
                    "score": 127,
                    "replies": [
                        {
                            "author": "missandie2000",
                            "body": "Me too! I want the ability to stock the fridges of all the NPC’s and I would put 100’s of dinners in there to make Jodi’s life a bit easier.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bluespottedtail_",
                    "body": "Jodi was my second friend IIRC (after Linus💛). I love her and relate to her a lot",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Zookeepergame6373",
            "body": "he’s such a sweet heart and I totally think he’s an underrated character!!! he was my second choice this play through….. but I can’t stop marrying Elliot 💀😅",
            "score": 167,
            "replies": [
                {
                    "author": "KlutzyConstant5394",
                    "body": "this is real. love u 4ever elliot",
                    "score": 49,
                    "replies": [
                        {
                            "author": "No-Zookeepergame6373",
                            "body": "I told myself to branch out with someone new (my second long play) but every time I talk to him I’m reminded of why I strongly pursued him the first time 😂 something about a man dedicating a book to me worked…",
                            "score": 29,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bloodthistle",
                    "body": "Elliot is just perfection, so romantic. He also manages to turn the most mundane things into pure magic and says/does the sweetest things. \n\nHe and Emily are my top 2 but he wins for being extra romantic.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Ladybug_0_1",
                    "body": "my second choice after sam would always be elliot haha. i guess these two are similar in some ways",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kqthryn",
            "body": "oh no :( i never knew this about Jodi and their family. does she ever state that she’s like unhappy in her marriage? that breaks my heart, especially since Sam clearly knows about it too.",
            "score": 53,
            "replies": [
                {
                    "author": "r33nie",
                    "body": "I don't think she ever talks specifically about being unhappy, but you definitely get the sense that she misses the freedom of her youth (maybe a freedom that she never got to experience herself).",
                    "score": 80,
                    "replies": []
                },
                {
                    "author": "SnoopyMcDogged",
                    "body": "She just regrets not doing more before settling down with a family, many parents go through this is they have kids when in their late teens/early twenties but without really *enjoying* their newfound freedom from their own parents/guardians or doing the things that are easier when you don’t have commitments tying you down such as university, travelling or career development.",
                    "score": 60,
                    "replies": []
                },
                {
                    "author": "SammyFirebird79",
                    "body": "If you're high enough hearts with her, she sometimes confesses that she dreams about what her life would be like if she didn't have a family, admitting there's some regrets there.\n\nTo her credit, at least she has the decency to keep those thoughts to herself (unlike my own mother), but kids aren't stupid - as this dialogue shows.",
                    "score": 49,
                    "replies": []
                }
            ]
        },
        {
            "author": "wanttotalktopeople",
            "body": "I'm not sure she's specifically sad about marrying young. I took it as the stress from being a military wife and raising the kids mostly by herself.\n\n\nSometimes life turns out painfully and you wish you didn't have to deal with those struggles. For example my grandma lost my grandpa to cancer in his thirties and had to raise her kids while working full time. But she says she never regretted marrying him young. Only regrets that she didn't have longer with him, because of how deeply in love they were.\n\n\nMaybe I'm projecting, idk. I just feel it's a bit deeper than \"don't marry young or you'll always carry a secret pain of wondering what could have been.\" She can be deeply unhappy with having an absent spouse and then watching him struggle with PTSD without necessarily wishing they hadn't married.",
            "score": 26,
            "replies": []
        },
        {
            "author": "QuiznakingCat201",
            "body": "This is the reason why I love Sam! I feel like he’s incredibly empathetic and wants the best for everybody. He doesn’t show it often, but he’s really an understanding man",
            "score": 19,
            "replies": []
        },
        {
            "author": "Eeveelover14",
            "body": "The whole family would benefit from therapy. They all try to pretend it's ok for each other's (and their own) sake but that's only making it worse.",
            "score": 18,
            "replies": []
        },
        {
            "author": "runetrantor",
            "body": "Also speaks of Sam's emotional intelligence, that he can tell what I can imagine is well hidden by Jodi.\n\nHe may not be like, 'Maru smart' but he aint no idiot.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Far_Suggestion_9504",
            "body": "HIS FACE\n\n-She was hiding some inner pain 😏",
            "score": 16,
            "replies": []
        },
        {
            "author": "Mental-Clerk",
            "body": "The poor woman is run off her feet, raising two kids on her own while dealing with the stress of a soldier husband in a combat zone. On top of that, she has to deal with all the morally questionable people in the fandom who want to steal her husband when he returns home. I'd have some inner pain, too.",
            "score": 7,
            "replies": [
                {
                    "author": "masquerademage",
                    "body": "i don't wanna steal her husband! i just wanna borrow him for a few ~~decades~~ days... :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Any-Top-610",
            "body": "Sam: \"My mother could be in pain\"\n\nSam's face: :)",
            "score": 11,
            "replies": []
        },
        {
            "author": "Dontaskmeidontknow0",
            "body": "It’s interesting that her name is Jodi; Jody is slang for a military spouse who cheats while their partner is deployed.",
            "score": 11,
            "replies": [
                {
                    "author": "This-Effective8965",
                    "body": "It's most likely intentional by ConcernedApe in the most heartwarmingly way possible, since she IS a military spouse but is undoubtedly devoted to Kent and waited three years for him to come home.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "thumb_of_justice",
                    "body": "Jody's not the cheating spouse; Jody is the guy who seduces the wife. I know it's weird because Jody is usually seen as a feminine name. \n\n\"The name \"Jody\" is thought to have evolved from \"Joe the Grinder,\" a character in early 20th-century African American blues songs. Joe the Grinder was depicted as a man who would seduce a man's wife or girlfriend while he was away, often in jail or otherwise occupied. This figure morphed into \"Jody,\" symbolizing https://www.maintainernation.com/who-is-jody-in-the-military/#:~:text=The%20character%20of%20Jody%20emerged,century%20African%20American%20blues%20songs.the archetypal man who takes advantage of a soldier's absence to woo their partner.\" Source:",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Visit_Extreme",
            "body": "Not to mention he does the most volunteer hours!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Worth-Amount-7765",
            "body": "He won’t talk to me anymore bc I divorced him 😔",
            "score": 3,
            "replies": []
        },
        {
            "author": "Starfishness",
            "body": "Sam: Saying the most heartwrenching thing possible\n\nAlso Sam: 😏",
            "score": 3,
            "replies": []
        },
        {
            "author": "i-Qwerty",
            "body": "\"I asked her once and got the feeling she was hiding some inner pain.\" Meanwhile Sam's portrait: 😃",
            "score": 3,
            "replies": []
        },
        {
            "author": "blukid_AD",
            "body": "this dialogue stung the first time i read it but seeing Sam’s face like 😼 in the corner made it hard to stay that way LMAO",
            "score": 3,
            "replies": []
        },
        {
            "author": "LuminousRabbit",
            "body": "Jodi complains 24/7 and it drives me nuts. She doesn’t have to baby her adult son! He can do dishes. He can clean. He can learn to cook. She needs to stop being a martyr, step back, and ask for help. I say this as a mother myself. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "justking1414",
            "body": "There is clearly so much I have missed in this game. I’m definitely gonna try and max out everyone’s hearts on this play through.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EcstaticReach8496",
            "body": "Oh no, Sammy",
            "score": 2,
            "replies": []
        },
        {
            "author": "Much-Routine-8964",
            "body": "Do we ever get a cut scene where we see Kent and Jodi reconcile or just settle with those feelings?? It always breaks my heart when his younger brother mentions that his dad doesn’t play with him like he use to 🥺",
            "score": 2,
            "replies": []
        },
        {
            "author": "BogSwamp8668",
            "body": "Her husband also came back to her, raising two boys as a single mom, full of war flashbacks and PTSD fits",
            "score": 2,
            "replies": []
        },
        {
            "author": "greyest",
            "body": "I have a soft spot for Sam because he's practically the only nice person in town when he catches you going through the garbage (even if he still loses hearts). Everyone else besides Linus be judgmental af",
            "score": 2,
            "replies": []
        },
        {
            "author": "WarAgile9519",
            "body": "Damn this game for not allowing me to make that women happy !.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jerbsina7or",
            "body": "I suspect many of the issues of Sam's family are because of Kent's occupation (soldier). It is implied that there is currently a war going on, that Kent was sent to, and they were getting slaughtered. I suspect that Kent is dealing with a lot of PTSD and it probably affects the family quite a bit.",
            "score": 1,
            "replies": [
                {
                    "author": "Dogmom2013",
                    "body": "I got the cut scene with the popcorn... so I would say yes, Kent for sure has PTSD and lashes out.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RailfanAshton",
            "body": "atleast he’s concerned for her",
            "score": 1,
            "replies": []
        },
        {
            "author": "AggravatingCamp9315",
            "body": "Poor Sam",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redplushie",
            "body": "I wish Jodi knows she can still be a fun mom, she's young after all!",
            "score": 1,
            "replies": []
        },
        {
            "author": "BingeWatcher578",
            "body": "I think Jodi is the girl from good luck babe",
            "score": 1,
            "replies": []
        },
        {
            "author": "P_Grammicus",
            "body": "Yes, his post-marriage comments along the lines of >!if the thing did not get done today don’t be mad!< bother me as well. There’s a few variations of them, all about essentially unimportant tasks.",
            "score": -5,
            "replies": []
        },
        {
            "author": "bluehippofoot",
            "body": "I'm more than happy to take your dad if they split. Your mom might be a good match for Harvey. Could be a win-win for everyone",
            "score": -7,
            "replies": []
        },
        {
            "author": "flintybackpack",
            "body": "yo thats nothing compared to penny’s lore",
            "score": -7,
            "replies": []
        }
    ]
}