{
    "title": "Well... What now?",
    "author": "FalconerGuitars",
    "subreddit": "skyrim",
    "rank": 3,
    "score": 1409,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 118,
    "url": "https://www.reddit.com/gallery/1je3qq8",
    "id": "1je3qq8",
    "selftext": "Ok, can I be done with this character now?  Please?  ",
    "comments": [
        {
            "author": "grumpyoldnord",
            "body": "Now go find Karstaag.",
            "score": 817,
            "replies": [
                {
                    "author": "Divine-Crusader",
                    "body": "For real. It takes hours (and multiple followers exploits) to prepare for the battle against Karstaag.",
                    "score": 371,
                    "replies": [
                        {
                            "author": "Mike_or_whatever",
                            "body": "stelf archur go brrr",
                            "score": 222,
                            "replies": [
                                {
                                    "author": "justasusman",
                                    "body": "_tanks the arrow_",
                                    "score": 82,
                                    "replies": [
                                        {
                                            "author": "O_oLivelovelaugh",
                                            "body": "You and the user above ya should be my followers 😄",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "NC458883",
                            "body": "I took on Karstsaag as a novice gamer with a level 25ish character and no followers. I did have an entire inventory of healing potions.\n\nHit, drink potion, hit, drink potion, hit, drink potion.  \n\nIt took me several tries but I did it.  I literally never saw the fight because the screen was just me swinging my weapon and drinking potions.  \n\nIt was intense!!!  I'll be a higher level before I try it this time.",
                            "score": 164,
                            "replies": [
                                {
                                    "author": "Morethantrash",
                                    "body": "The same thing happened to me, I was just exploring solstheim, wandered into a cave and saw that mf running toward me. Literally hit the same hit:potion ratio after dying like 5 times in a row\n\nEdit: to all the nerds coming for me, I beat karstaag like 3-4 years ago, MY BAD for not remembering how I encountered him or the exact steps I took to summon him. He’s a hard mf to kill, that’s all I remember",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "No_Database9822",
                                            "body": "This can’t happen — you need to retrieve his skull from a Riesling cave and put it on his throne.\n\nEdit: typo. Riesling is a wine, I meant Riekling as in the little goblin things.",
                                            "score": 68,
                                            "replies": []
                                        },
                                        {
                                            "author": "DistractedAttorney",
                                            "body": "Uhhhh that’s not how this works… not sure why people just lie",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Morethantrash",
                                                    "body": "If I did a precursor quest prior I have no idea, I’m not lying when I say I stumbled on the cave",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "hilow299",
                                                            "body": "To summon him you have to put his skull on his throne. There isn't a way that he just spawns",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Dovanator258",
                                                            "body": "Ge doesn't just fucking spawn when you enter his area. You interact with his skull and throne, you lied",
                                                            "score": -4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PJRama1864",
                            "body": "*Confused in Restoration Loop*",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "HeavySpec1al",
                            "body": "No it doesn't? It takes X amount of healing potions and pressing the attack button",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Darkeye3",
                            "body": "Not really? Just have good restoration and a decent weapon, and with a little skill he can be beat. I did have a glass Cannon follower but she went down instantly cause... Glass cannon",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FalconerGuitars",
                    "body": "I did!  That guy had never SEEN so many dremora lords.  \nI'm saving my summons of him.  Until what? I have no idea lol",
                    "score": 66,
                    "replies": [
                        {
                            "author": "Electronic_Picture26",
                            "body": "I use him to kill the ebony warrior. They both have mad resistances",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "FalconerGuitars",
                                    "body": "I lucked out.  I walked in to see him with a CREW.  Serana and her ghoul, my riekling pet who summons a storm atronach, my two dremoras/ ancient death priest when I had time to cast him.  \nBut no cheats, no hiding on the cliff.  Pure numbers, baby.",
                                    "score": 56,
                                    "replies": [
                                        {
                                            "author": "Electronic_Picture26",
                                            "body": "You and I play skyrim the same. \n \nTo quote Flownominal and Thugnificint from the boondocks.  \n\"Riley thats the whole point of belonging to a crew n***a. So you ain't ever gota worry about handling shit like a man.\n\nYea man we don't fight fair n***a we believe in overwhelming force. \"",
                                            "score": 44,
                                            "replies": [
                                                {
                                                    "author": "Dallacar",
                                                    "body": "BOOTY BUTT BOOTY BUTT BOOTY BUTT CHAEKS!!",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Electronic_Picture26",
                                                            "body": "Is it booty but cheeks or move them but cheeks",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Electronic_Picture26",
                                            "body": "My cheater ass loves to have Serana, Teldryn Sero, Reikling, their summons plus my 2 dremora lords (sanguine rose). We roll in 9 deep and put a beat down on Karstag.",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "Tony_Stank0326",
                                            "body": "I'm clearly playing wrong then. I do have Serana with me and she typically uses one of the many summoning staves I gave her in a fight, but I typically either go in with my enhanced Dwarven crossbow with Fortify archery, or Leroy Jenkins it with Spellbreaker and a Daedric Sword",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "The_quest_for_wisdom",
                                    "body": "I didn't find Karstaag himself to be a tough fight. \n\n  \nI found the doorway with a loading screen that he kept throwing me through (which reset his health to full) to be the biggest obstacle to beating him. Once I got maneuvered into a spot where he was ONLY throwing me into a wall the fight was cake.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Electronic_Picture26",
                                            "body": "I've never had him throw me out of the areana",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "The_quest_for_wisdom",
                                                    "body": "He did it three times in a row. It felt like I was taking on an old school NES boss with multiple stages to the fight. Except he didn't power up or change tactics each time, he just reset his health bar. \n\nAfter the first time it happened I moved away from the doorway, but he still managed to punt me through the loading area from different parts of the room two more times.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Electronic_Picture26",
                                                            "body": "That sucks i can totally see him giant stopping you out of the arena",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "reclusivegiraffe",
                    "body": "I just defeated Karstaag at a little under level 50. I had Serana with me, and the first thing I did was summon Arniel’s shade. He was completely distracted by Arniel, so I was able to spam fireball from a distance while Serana shot ice spikes (helpful, I know). Fight lasted less than 2 or 3 minutes.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Electronic_Picture26",
                    "body": "Indo Karsten first then use him to stomp the Benny warrior",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "TNTTom04",
                    "body": "Oh god, I think the only reason I actually beat him is because he bugged on a small ledge and got stuck and I was able to just bow him down, if he'd kept coming after me I would have run out of health potions",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Beginning_Chair955",
                    "body": "Yeah he's actually a surprisingly tough fight \n\nLike I beat him 1st try \nI had some pretty good armor on with Luke 600 damage total and like 2400 armor and he did almost kill me but I do also have like 40 full health potions so I beat him pretty easily \n\nSurprisingly only used 1 full health potion",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PlasticIV",
            "body": "I’d try the main quest next",
            "score": 279,
            "replies": [
                {
                    "author": "FalconerGuitars",
                    "body": "Wait... You're gonna try and tell me there's a MAIN quest?  \nI don't buy it.",
                    "score": 176,
                    "replies": [
                        {
                            "author": "amilmore",
                            "body": "Remember that weird big dragon at helgen from 2011? Apparently he’s important.",
                            "score": 117,
                            "replies": [
                                {
                                    "author": "FalconerGuitars",
                                    "body": "you know... now that you mention it.  That does sound familiar...",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "author": "BikingEngineer",
                                            "body": "I think I remember someone me saying something about a bleak falls something or other. Maybe you should look that up.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Ale_jandro1101",
                                                    "body": "I think I heard about a civil war or something too, but that’s probably nothing",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "shake_N_bake356",
                            "body": "Bleak Falls Barrow? Nope, never heard of it",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kobilasuzy",
            "body": "https://preview.redd.it/5qaxa64r0gpe1.jpeg?width=1920&format=pjpg&auto=webp&s=d10c432a73ac983a0521f900870d5c21bea6a152",
            "score": 212,
            "replies": []
        },
        {
            "author": "i_cant_stdy_plz_help",
            "body": "https://preview.redd.it/rjwg2r0u7gpe1.jpeg?width=810&format=pjpg&auto=webp&s=cfd3ef27024e7cbd56ae4c435338f52d5ae0c409",
            "score": 163,
            "replies": [
                {
                    "author": "Grotti-ltalie",
                    "body": "Skyrim players blown away on finding this insane exploit after 13 years",
                    "score": 60,
                    "replies": []
                },
                {
                    "author": "Quirky_Inspection",
                    "body": "https://preview.redd.it/pclg0mpp9gpe1.jpeg?width=2200&format=pjpg&auto=webp&s=de2640ea1d0b5380c04ddb324650cbcf98f4622f",
                    "score": 54,
                    "replies": []
                }
            ]
        },
        {
            "author": "One_Experience6791",
            "body": "Karstaag next lol. On my experience, I've fought the Ebony Warrior and Karstaag and Karstaag is considerably more difficult.",
            "score": 59,
            "replies": [
                {
                    "author": "smkestcklghtn",
                    "body": "Karstaag.  Wish I never heard that name. Fought him dozens of times before I realized I wasn't even close to being where I needed to be to beat him",
                    "score": 21,
                    "replies": [
                        {
                            "author": "One_Experience6791",
                            "body": "Hahaha right! It's even more difficult when using combat mods. I currently am using \"Smilodon\" mod and it cranks the fight up to 11 lol almost feels like a Souls game lol",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FalconerGuitars",
                    "body": "Dude that was such a savage fight.  It was so much fun.  \nI managed to spam Dremoras and I two-handed a pumped up Dawnbreaker and I have the broken Windshear scimitar with the 100% chance to stagger any enemy, so I kept whacking him and he wasn't ever able to move except once when there was so much going on I kept missing him.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "good_green_ganj",
                    "body": "Man that’s funny because I was able to kill karstagg with ease my first time around. 5 characters later, and I still haven’t been able to beat the ebony warrior.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Runa_Tiger",
                    "body": "Karstaag is lvl 140. Minimum. Ebony warrior is lvl 80 (maybe 90), and AFAIK, he doesn't scale with your level.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dr0neshuffler",
            "body": "Plat the game.\n\nGet all the daedric artifacts. Fully develop all of the hearthfire houses. Marry Lydia or Ysolda and start a family by adopting one of those poor children from Riften. Become thane of every hold and buy all of the thane houses. Finish all of the faction quests. Blot out the sun.",
            "score": 16,
            "replies": [
                {
                    "author": "Livid_Ad9749",
                    "body": "Nah adopt the children who are on the streets. Marry Jenassa or Brelyna",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoYaks",
            "body": "Who is this Ebony Warrior? How do I do battle against them? What question is it? I’m so intrigued…, \n\nTia",
            "score": 39,
            "replies": [
                {
                    "author": "Sego72",
                    "body": "Think he just randomly shows up when you hit lvl 80.",
                    "score": 51,
                    "replies": [
                        {
                            "author": "AutoYaks",
                            "body": "Oh well I better start levelling up then. What’s the quickest and easiest way to level up in your opinion? \nTia",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "smittenWithKitten211",
                                    "body": "Well there are exploits all around. Fast Travel to large distances while casting Telekenesis to level Alteration, spam Muffle (with exp boosts like the mage stone and lover stone (aetherius crown lets you get two stone buffs at once)) to level Illusion, Use Fortify Resto Enchanting loop (idk this one but heard you can create extremely high damage weaponry)",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "SharpCheddarBS",
                                            "body": "Spamming mage light at the mountaintop just outside solitude gate is by far the fastest for spamcast leveling. You can get from base to 100 alteration within a couple minutes",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "smittenWithKitten211",
                                                    "body": "why is that a specific spot for it? I have heard this exploit as well but never made sense to me",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "SharpCheddarBS",
                                                            "body": "Its about rendering distances and cells. The mage light accumulates xp by distance, but if it crosses a cell border (which most good looking cliffs seem to do) the xp doesn't hit for some reason. That peak is one of the few good high points that don't cross cell borders to hit, combined with that great distance, it gets you like 3 levels of alteration per light",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "smittenWithKitten211",
                                                                    "body": "Damn that's interesting. Maybe I will try, definitely seems easier than finding Telekenesis early on or just spamming stoneflesh-spells",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PANDABURRIT0",
                                            "body": "That’s what I did. Then when I saw him I snuck up behind him and used Mehrunes Razor. After like a minute I got lucky and he immediately died at like 3/4 health lol. Super anticlimactic",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "AutoYaks",
                                            "body": "Thanks so much for the info, I’ll definitely be trying this out",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Noah_the_Titan",
                                                    "body": "If you dislike exploits, then alchemy is by far the easiest way to level",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "AutoYaks",
                                                            "body": "I don’t mind an exploit or two 😉, when you say alchemy you mean making potions yeh?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "stormyw23",
                                    "body": "Piss off the guards in markath and don't die while levelling light and heavy armour over and over.\n\nIt takes ages, but there's lots of guards level restoration while you're at it.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "AutoYaks",
                                            "body": "Sounds good I’ll also be trying this out",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "stormyw23",
                                                    "body": "I find markath to be the best for it as lots of guards, Easy escape, Lack of people to care about, and you possibly don't need to go there often if you can't pay bounty.\n\nLike there's so many more guards in markath more than any other hold.\n\nJust turn the difficulty down if you're getting killed too quick and have become ethereal ready",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "AutoYaks",
                                                            "body": "Totally agree with you on the amount of guards in Markath so this makes so much sense, looks like I’ll be spending the next few hours trying this out. \n\nThanks 🙏🏽",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SpiralDesignn",
                                    "body": "Backstab a meditating greybeard for sneak and one-handed levelling.   \n  \nSpam Soul trap on a dead animal for conjuration levelling.\n\nTorture a victim with a fire spell for destruction levelling. Also heal him at the same time for restoration levelling.\n\nCollect as much copper ores, Spam transmute, make gold ingots and make necklaces for smithing leveling. Might as well increase Alteration.\n\nRestoration Loop for alchemy and enchantment levelling.\n\nUse Skeleton Key for lockpicking levelling.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Runa_Tiger",
                                            "body": "You mean iron ore, there is no copper.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SnipesWL",
                            "body": "I had him show up in passing recently and I’m only in the 40s currently",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "marc_0028",
                    "body": "Its a warrior that send u letter too meet him, when u reach level 80. He invites u too fight him too the death",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "EmployeeVarious7462",
            "body": "Hey you you’re finally awake…",
            "score": 7,
            "replies": []
        },
        {
            "author": "lurker2358",
            "body": "Now you search him.",
            "score": 5,
            "replies": [
                {
                    "author": "FalconerGuitars",
                    "body": "I just dragged his whole body back to Hendraheim.  I keep what I kill.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "PvtThrockmorton",
            "body": "You look at the sunset and slowly bleed out knowing you saved Tamriel and defeated your greatest opponent \n\n\nAnd then it gets complicated, the Daedric soul bidding war, you was cheeky and gave a piece of your soul to well…. Everyone",
            "score": 4,
            "replies": []
        },
        {
            "author": "DaedricTamer",
            "body": "Play again with 2500 mods. He has MCO attack moves and has immunity to a lot of my combat perks. I just have my cronies beat him up but still much tougher.",
            "score": 5,
            "replies": [
                {
                    "author": "Noah_the_Titan",
                    "body": "Genuinly how does that work? Are you playing a maintained modlust luje LoreRim? My personal midlist cant handle 200 mods with 50of them being engine fixes etc. Even with LOOT SSEEdit and wyrebash",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DaedricTamer",
                            "body": "I've been modding for a few years now. I don't even use crashlogger anymore because I add like 3-5 mods at a time and check in game if its working correctly and MCM loads. \n\nI started on Immersive and Epic when it was maintained so my 4090 computer has that modlist which I heavily modified and updated which taught me alot but its on 640 version of the game running BHUNP.\n\nNow my 3080 TI build has the 1170 version of the game with 3BA. I have not found a good reason not to just update my original PC to 1170 but alas I would rather not start over. \n\nI only have like 2 mods that are fixes and even if a specific mod needs its own fix its just a patch not going to take up load order. I play to have waifu followers like my mod [https://www.nexusmods.com/skyrimspecialedition/mods/143163?tab=posts&jump\\_to\\_comment=151561082](https://www.nexusmods.com/skyrimspecialedition/mods/143163?tab=posts&jump_to_comment=151561082) \n\nIf you're asking like how did I genuinely get to this point. A lot of reading, trial and error. I started as a trouble shooter for Immersive and Epic discord, There was a issue in Screen Archer for Skyrim (similar to F04) that was driving me nuts. Turns out the issue was Smooth Cam. I have not had to make 1 single loot SSeedit or bash in my last 3 years. I either fix load order, disable something, set a rule in Vortex for it. I use Vortex which for me was easier than Mo2 which I still havent used but im sure has its own benefits. There are a lot of abbreviations that people use that even I use that come naturally and honestly there are a lot of things people expect you to know, which even I don't like I actually don't know how to make my own patches. Never had to. But I do know how to change dialogue conditions and other easy stuff for followers so they say stuff at certain times or places.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DarkTypie",
            "body": "![gif](giphy|eCUKKmVrVN5FSvNIW7)",
            "score": 3,
            "replies": []
        },
        {
            "author": "warlock-tourist",
            "body": "Yeah. The ebony warrior is a decent challenge. None of my usual approaches are guarateed to work, and having him in your face in no time is a rather big problem...",
            "score": 3,
            "replies": [
                {
                    "author": "FalconerGuitars",
                    "body": "I can't stress enough how clutch the Windshear scimitar is.  For any big boss really.  That and having a crew with you.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "warlock-tourist",
                            "body": "For a melee build, maybe. But even then, your own crafted weapons are likely to be more powerful than whatever pig iron imitation the ebony idiot had. the real problem with him is his sheer power and skill. Hed be just as much of a problem with a wooden sword and forsworn armor.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Huntatsukage",
            "body": "Now, you retire to some mountains somewhere to live out the rest of your days as words and songs of your heroic deeds and exploits fade into memory and become forgotten to time immemorial.",
            "score": 2,
            "replies": [
                {
                    "author": "FalconerGuitars",
                    "body": "I have Hendraheim which has a great view.  \nThat's not a bad idea.  Fill the armory, take a seat and SAVE.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "LQDSNKE92",
            "body": "Just when i thought i knew skyrim inside and out...must resist the urge...TO MAKE A NEW CHARACTER!!!! \n*",
            "score": 2,
            "replies": [
                {
                    "author": "LQDSNKE92",
                    "body": "![gif](giphy|GRSnxyhJnPsaQy9YLn)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sirjackthepleb",
            "body": "What do you mean?, now you can play the game",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ghysteskrank",
            "body": "Now Canis Root and Imp Stool and reverse pickpocket every single NPC to paralyze them for 68 trillion real world hours.",
            "score": 2,
            "replies": []
        },
        {
            "author": "219_Infinity",
            "body": "Throw his body off a cliff",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beginning_Chair955",
            "body": "Man my fight doth this guy was hilarious \n\nSo I was just fighting some guards in solitude you know commiting my daily dose of murder \n\nBro comes up\n\nI accidentally hit him with a power attack and he's already down to like half HP \n\nBut he did also hit me and I went down to like a small sliver of HP but with like waaaay too many healing potions I just power attacked him again and he died",
            "score": 2,
            "replies": []
        },
        {
            "author": "Constant-Yard8562",
            "body": "Probably time to help Gerdur out and let Balgruuf know there's a dragon on the loose.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SirDoktorKetamine",
            "body": "Nothing. You win.",
            "score": 2,
            "replies": [
                {
                    "author": "FalconerGuitars",
                    "body": "Hot damn! *hits bong and relaxes*",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Regular_Astronaut725",
            "body": "Who's the ebony warrior?",
            "score": 1,
            "replies": [
                {
                    "author": "AndysHam91",
                    "body": "The actual final boss of Skyrim. He doesn't appear until you reach something like level 80.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "_GatCat_",
            "body": "Now we can play the game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aknalag",
            "body": "Your finally awake.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gantelbart",
            "body": "Now install morrowind <3",
            "score": 1,
            "replies": []
        },
        {
            "author": "Truebuckshot01",
            "body": "I beat karstaag before him so I just summoned my new buddy and acted as a backup archer lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brave_Ad_4139",
            "body": "I wasted him with 4 strikes with Nerveshatter, before he even got a chance to hit me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hahaha_Me",
            "body": "Well try singel parenting or something man, I don’t know what to tell you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zero_Skill_dev",
            "body": "mods or find all the items you want. black books are fun, maybe go after some unique items. build all 3 houses to maximum",
            "score": 1,
            "replies": []
        },
        {
            "author": "NDB12",
            "body": "Now? Now you can play the game.\n\nWell done adventurer!",
            "score": 1,
            "replies": []
        },
        {
            "author": "unseeing_allseeing_i",
            "body": "You wait to fight him at the mountain? I rock his shit as soon as I see his annoying ass, it’s ON SIGHT with his ass",
            "score": 1,
            "replies": []
        },
        {
            "author": "Livid_Ad9749",
            "body": "I once made an evil necromancer who got trapped in the soul cairn. Still there to this day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Naive_Rain_5713",
            "body": "maybe, at the time i doesnt knew of the ebony warrior i just got the gear without thinking but the difficulty was way out of the enemies a had found until then",
            "score": -2,
            "replies": []
        },
        {
            "author": "Naive_Rain_5713",
            "body": "there was a playthrough i made that i accdentaly found the ebony warrior on a draugr tomb with some bandits i was lvl 40 os something and a stealth archer, i killed him without talking using the traps and archery it took me almost 1 hour to kill it and gained a ebony set, only later i would know that you should find him on high lvl",
            "score": -33,
            "replies": [
                {
                    "author": "Disastrous-Fox8505",
                    "body": "Seeing how he doesn’t spawn until you hit level 80, bullshit. \n\nNow, that being said you’re probably talking about the champion of Boethiah in knife point ridge.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Naive_Rain_5713",
                            "body": "i don't know if it was him but was a full plated ebony warrior and i said i dont tried to talk with it and never found him on that playthrough even after i got at lvl 80 but was right after release maybe a bug, maybe wasnt him never gonna know",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "Godivore",
                                    "body": "He's thinking of Umbra",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "stormyw23",
                                    "body": "Yeah, there's plenty ebony-wearing dudes and the champion of Boethiah has a special chestpiece that hurts near-by enemies, was it that one? You actually can't even go where you fight him and find him before you get to level 80, Well you can go there but he won't be there",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Acceptable_Bass4591",
                    "body": "I'll take \"Things that never happened\" for 500, Alex",
                    "score": 16,
                    "replies": [
                        {
                            "author": "AutoYaks",
                            "body": "🤣🤣",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cherokiller",
                    "body": "No.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "nagrom6888",
                    "body": "You probably found a bandit with a regular ebony armour and not the Ebony Warrior. \nThose are two diff beings. \nMoreover he finds you, you don’t find him. He waits for you till you’re level 80 and then challenges you to a duel and never has any “bandits” as companions. He isn’t some lowly guy out for money. \nHe seeks death by combat and the glory to die by a worthy opponent.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Livid_Mammoth4034",
                            "body": "If he seeks death by combat, why doesn’t he just learn summoning and then spam summons until they overwhelm him?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "nagrom6888",
                                    "body": "Wouldn’t that count as partial suicide by magic? \nHe needs someone else to deliver there kill and will continue to fight until he meets a worthy match. \n\nI wish you can meet him in Sovngarde after killing him, where he is at peace or probably picking fights with legends.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Livid_Mammoth4034",
                                            "body": "I mean, it’s just as suicidal to summon a Daedra to fight you than it is to fight the super powered death machine that is the DB.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "nagrom6888",
                                                    "body": "It boils down to semantics.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}