{
    "title": "Alteration Magic Will Have So Much Potential In TES VI",
    "author": "Ecstatic_Ganache9427",
    "subreddit": "skyrim",
    "rank": 11,
    "score": 115,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 71,
    "url": "https://v.redd.it/4fvx50mcwhpe1",
    "id": "1jecs03",
    "selftext": "",
    "comments": [
        {
            "author": "The_Real_MikeOxlong",
            "body": "Lmao with how underwhelming and neglected the Skyrim magic system is, and how much was cut between morrowind and oblivion too, I have no hope for what magic will be like in TES VI. So far, the trend is *not* looking good",
            "score": 257,
            "replies": [
                {
                    "author": "0L1V14H1CKSP4NT13S",
                    "body": "By TESVII magic will literally be slight of hand tricks you perform one time during a quest called \"Party Tricks.\"",
                    "score": 85,
                    "replies": [
                        {
                            "author": "Loud_Chapter1423",
                            "body": "Destruction magic will be a bic lighter and a can of axe",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "pocketjacks",
                                    "body": "And both brands will offer a collab for twice the price of the non-TES6 products.   Kids will set their friends on fire and everyone will claim ignorance that it would happen.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Brad_Brace",
                                            "body": "For 200 dragon gems you can get an AXE logo cape.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ok_Award_8421",
                            "body": "I was thinking Magic will be like in the Witcher at this rate.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Middle-Opposite4336",
                                    "body": "That would be an improvement",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "vicvonqueso",
                            "body": "IS THIS YOUR CARD?!",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "verbalyabusiveshit",
                            "body": "Jesus…. Sounds like Counter Strike will beat TES with the magic fire grenade",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Brad_Brace",
                            "body": "And be named Arch Mage, after your party tricks cheered up the region's ruler.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Secretly_A_Moose",
                            "body": "I feel like mentioning TESVII in this sub is akin to mentioning A Dream of Spring in r/asoiaf",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "skovbanan",
                    "body": "*Between Oblivion and Skyrim we removed the feature of creating magic spells. After Skyrim’s huge success, in TES VI we have followed this trend, and now also removed the feature of using magic!*",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Qaztarrr",
                    "body": "I think trying to extrapolate any kind of trend from those games doesn’t really make sense. Morrowind, Oblivion, and Skyrim all came out within the span of 8-9 years - we’ll probably be almost double that amount from Skyrim’s release by the time ESVI drops. Skyrim’s success essentially ended the series and whatever we get with VI will be from a practically entirely new team and with entirely different goals. ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Greedyfox7",
                    "body": "I never got too far into oblivion and have never played morrowind but I’ve always thought they could have done so much more with the magic system. It almost feels like they put in the bare minimum and called it a day",
                    "score": 2,
                    "replies": [
                        {
                            "author": "pinesolthrowaway",
                            "body": "Magic in Morrowind was a lot of fun, you could custom make your own spells if you wanted to\n\nAnd as they tended to be wildly OP, you’d want to",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Greedyfox7",
                                    "body": "I’ll have to buy it and get another copy of oblivion and just start from the beginning because that sounds awesome",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "elbow_user",
                    "body": "The game is going to be (supously) in hammerfell and high rock, the breton have great using of magic. And if they get the modders (like in CC) maybe we can get some really nasty magic.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "toe_jam_enthusiast",
                    "body": "I remember making my own overpowered spells in oblivion. I was so disappointed in Skyrim magic set up",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Galimeer",
            "body": "Joke's on you, Alteration will be cut from TES6 entirely and armor spells will be added to Restoration.",
            "score": 38,
            "replies": [
                {
                    "author": "saint-grandream",
                    "body": "Then we'll merge the One and Two-handed trees. Then Pickpocket and Lockpicking will just be \"Thieving.\" 5 trees per group!",
                    "score": 15,
                    "replies": [
                        {
                            "author": "ScaredActuator8674",
                            "body": "I'm scared for the day it'll just be three trees: Melee, Magic, and Sneak.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Jetstream-Sam",
                                    "body": "Then the next game after will just have \"stat\":and it's a number that just goes up\n\nWait, that's basically destiny's light system",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "theDefa1t",
                    "body": "You're probably right",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Oohbunnies",
            "body": "Just 97 more years to go! \\\\:D/",
            "score": 60,
            "replies": [
                {
                    "author": "Ecstatic_Ganache9427",
                    "body": "![gif](giphy|7BvCdOLnn0XTDBnpV3|downsized)",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "windybeam",
            "body": "Levitation is BANNED by the mages guild.  Didn’t you get the memo?",
            "score": 25,
            "replies": [
                {
                    "author": "Brad_Brace",
                    "body": "Way too many boy mages where looking up to catch a glimpse of girl mages underthings, so of course mage principals decided the way to go was banning levitation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DragonCult24",
            "body": "What magic mods are you using?",
            "score": 10,
            "replies": []
        },
        {
            "author": "JustARandomTeenHere",
            "body": "Ngl I expect FAR more from the modding community than anything Bethesda can come up with.",
            "score": 8,
            "replies": [
                {
                    "author": "Informal-Document-77",
                    "body": "I mean, one has a record of failure and neglect, while the other isnt getting paid or gets paid very little and makes stuff times better... yeah no wonder lol!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VagrantandRoninJin",
            "body": "Nah. Magic will simply be color and slow bullets and flamethrowers again. Maybe a beam attack like a Kamehameha. Maybe more magic weapons like bound sword. \n\nDon't allow your hopes to get too high for this next elder scrolls game. The track record of Bethesda suggests it's going to be a massive letdown. I'm just hoping some other developer ends up making the next generational hit, their own Skyrim with amazing magic. Lore wise, magic is extremely powerful in elder scrolls. In-game, you're shooting weak guns and playing mind tricks.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Echidnux",
            "body": "That’s levitation!!! You’re breaking the law!!! I’m telling Todd!!! (/s)\n\n(Gotta love when Alteration is a better skill for Nightblades than Illusion)",
            "score": 13,
            "replies": [
                {
                    "author": "Vylnce",
                    "body": "I mean, actually changing reality is generally going to be more powerful than simply changing how people experience it.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Ecstatic_Ganache9427",
                    "body": "![gif](giphy|3ohs4cGYhsc7LFJUJO)",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "DJenser1",
            "body": "https://i.redd.it/3w3neb2rsipe1.gif",
            "score": 4,
            "replies": []
        },
        {
            "author": "PoilTheSnail",
            "body": "You think bethesda could program something like that?",
            "score": 9,
            "replies": [
                {
                    "author": "TriumphITP",
                    "body": "I mean, levitation was literally a spell in morrowind. You could run around in the air anywhere you wanted.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Ok-Iron8811",
                            "body": "Stackable potions also",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Informal-Document-77",
                    "body": "At this point im pretty sure the TES VI code if it ever comes out even, will be written by ChatGPT or some other LLM, thought, might work better than what bethesda makes... Which isnt a very high standard lets be honest lol, at the very least code wise for sure.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "HuTyphoon",
            "body": "Don't have your hopes up for TES6. Bethesda has not been on the best of streaks lately. Also parrying with magic, lol ok",
            "score": 3,
            "replies": []
        },
        {
            "author": "Shitthemwholeselves",
            "body": "I'd be surprised if alteration is in the next game. Put the armor spells in conjuration, and it just has a bunch of utility spells, and we all know what happened to mysticism.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ReyAlpaca",
            "body": "If you give the mod pack... Illl install skyrim again",
            "score": 8,
            "replies": [
                {
                    "author": "Ecstatic_Ganache9427",
                    "body": "OCM Wabbajack Modlist",
                    "score": 13,
                    "replies": [
                        {
                            "author": "ReyAlpaca",
                            "body": "Sigh.... Installs Skyrim again",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mysterious_Trick969",
            "body": "What are you some kind of doctor doom?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Burgemeesterbart",
            "body": "Bro the only alteration magic user 😭",
            "score": 2,
            "replies": [
                {
                    "author": "Livid_Ad9749",
                    "body": "Hell no. I use the hell put of it. Paralyse is such a fun spell, even if its animation is boring",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jordantylermeek",
            "body": "Tes 6 magic will be different colors of destruction magic.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SecludedEddy",
            "body": "I just want to be able to cast magic with two handed weapons again",
            "score": 2,
            "replies": []
        },
        {
            "author": "cynical_croissant_II",
            "body": "With how Bethesda does things I'm pretty sure it's just gonna be Skyrim with fancier effects lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "jasir1115",
            "body": "This is what Alteration should be. It's weird how illusion is more powerful in Skyrim. Illusion only changes how you see things, alteration literally plays with reality. Transmutation is a good example.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Suaveman01",
            "body": "Don’t get your hopes up too high, Bethesda has only gone down hill since Skyrim. I’m only hoping they build a game good enough for modders to save.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DylanRaine69",
            "body": "They are bringing back levitating?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Scrollwriter22",
            "body": "Dear god do not start setting expectations this high before we know anything then bitch when it’s as basic as Skyrims if the game ever actually comes out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EnycmaPie",
            "body": "Bethesda has been simplifying their games as the years go by. Bare minimum empty open world, linear quest lines, basic skill system. And then leaving it to the modding community to finish the game.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pitiful_Asparagus176",
            "body": "Don’t set your expectations too high, or at all. They’ve become the most low effort developer in the industry, don’t get your hopes up.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LQDSNKE92",
            "body": "Wait are you telling me the stuff i wanted to do with alteration, in skyrim, was possible on oblivion?! Like ive geard people talk about nagic in oblivion ...but god damn that was cool.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rath_Brained",
            "body": "Alteration magic is my favorite. It is so slept on.\n\n\"I disregard the rules of the universe and insert my own. I am the only God I see here.\"",
            "score": 1,
            "replies": [
                {
                    "author": "Snekonomics",
                    "body": "Same, especially with Apocalypse and Odin. So many cantripy spells and spells that just make you fast, float, tanky, or otherwise manipulate the world around you. It’s my favorite school of magic by far.\n\nIllusion wishes it were half as cool as Alteration, Conjuration is fun but I’ve never been much of a necromage person, and Restoration is just healing potions and sun damage (which is powerful, and I’ll still use it, but so so boring). Destruction is just zap, flame, freeze in 50 different configurations.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SukanutGotBanned",
            "body": "...for modders!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specific-Judgment410",
            "body": "What mod is this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Svartrbrisingr",
            "body": "With how bland Skyrim was mechanically and star field was world wise. I've 0 hope for TES6. We are going to get an empty desert with a handful of ai generated dungeons. Enemies with the dumbest ai possible. Only swords and bows. And the worst story imaginable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FenrirHere",
            "body": "I'd be surprised if there was any more magic in TES VI than buffing your sword with one of three elements and casting mage light.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slykethephoxenix",
            "body": "This will be amazing in VR.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real_KazakiBoom",
            "body": "I’d love for someone to tell me what magic mods are used in the “OCM” wabbajack mod list since the OP doesn’t know",
            "score": 1,
            "replies": []
        },
        {
            "author": "shaun4519",
            "body": "What mods are you using for these spells",
            "score": 1,
            "replies": []
        },
        {
            "author": "SALEM3333",
            "body": "Omgwhat mods are these if you dont mind me asking",
            "score": 1,
            "replies": [
                {
                    "author": "Ecstatic_Ganache9427",
                    "body": "OCM Wabbajack Modlist",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Real_KazakiBoom",
                            "body": "In other words, you don’t know. You just installed a mod pack not knowing the mods in it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "endmostchimera",
            "body": "Hey I think there's some Skyrim left in your mods",
            "score": 1,
            "replies": []
        },
        {
            "author": "HowToNoah",
            "body": "Youre right! Just think how far video games will advance in the next 30 years!",
            "score": 1,
            "replies": []
        },
        {
            "author": "l0s37",
            "body": "this is the company that sold you a armored horse as apart of a dlc and the horse didnt have better stats",
            "score": 0,
            "replies": []
        }
    ]
}