{
    "title": "Do you remember your first few hours playing this game?",
    "author": "Mooncubus",
    "subreddit": "skyrim",
    "rank": 9,
    "score": 133,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 74,
    "url": "https://i.redd.it/h3tpbdsqeipe1.png",
    "id": "1jefak6",
    "selftext": "I still remember getting to Riverwood, sitting at the dining table in and learning about the Stormcloak rebellion. Then I spent like an hour excitedly playing around with the blacksmith stuff. I remember getting the wolf pelts and crafting some armor, then trying to find more wolves. I found the whole system so cool. And then I remember getting jumped by a dual wielding Dark Brotherhood assassin and I was like \"YOU CAN DUAL WIELD??\"\n\nGood times... So what about you guys? Any good memories from your first few hours playing?",
    "comments": [
        {
            "author": "catwthumbz",
            "body": "Oh yea baby. I’m getting a taste of it by playing dagger fall rn\n\nI spent probably my first 20 hours in river wood just chucking bodies in the saw mill",
            "score": 21,
            "replies": [
                {
                    "author": "Mooncubus",
                    "body": "The first few hours playing a Bethesda game you've never played before always feels special.\n\nI honestly hadn't considered trying that lol",
                    "score": 9,
                    "replies": [
                        {
                            "author": "verbalyabusiveshit",
                            "body": "„Special“ is an interesting choice of Word. Stressful, scared…. Are my words",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wandering_Wolf_17",
            "body": "I remember walking out of the cave from Helgen and just being in pure awe of the landscape before me. Then looking out at Bleak Falls Barrow, not having a clue what was in store for me there, and being like \"I'm going there first\". Then I killed a chicken in Riverwood and skipped the dialogue at the gates of Whiterun because I was taken to pay my bounty. Man, this game had me questioning my love for AC2 which was my favourite game at the time (still love it), and now Skyrim is one of the greatest games I've ever played. Absolutely fell in love from the get go.",
            "score": 15,
            "replies": [
                {
                    "author": "BigJ_57",
                    "body": "Why did I do the same shit? I even tried to fight the guard and got absolutely owned 😭",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Wandering_Wolf_17",
                            "body": "😂 I don't think I even tried, I just panicked and surrendered",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mooncubus",
                    "body": "Were you like me and went there before ever even going into the Riverwood Trader? It was honestly years before I found out you can start the quest there instead of the pop up when you enter Bleak Falls.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Wandering_Wolf_17",
                            "body": "Yeah! I got stuck for a while coz my fighting skills were frankly quite shit, but I somehow managed it coz I didn't think to just turn back. But yeah, I went there first and got the damn thing and when he asked me to get it I was like, \"oh, this old thing I just found in this randomly draugr infested place that was completely unexpected to me?\" That was fun.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TheTiniestSiren",
                                    "body": "It also took me way to long to have the thought that if I'm dying I can just flee haha",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Wandering_Wolf_17",
                                            "body": "Honestly! Like, I was probably only two minutes in but it took me so long getting there in my head I was probably like, I'm too far in, I can't turn back now.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vickydont_",
            "body": "I was like 6 years old (17 now) when I first got the game on Xbox 360, I skipped a LOT of dialogue, but I still had fun just exploring and killing everything like a sandbox game :) I was a menace in riverwood, and I immediately went to the first dungeon for the golden claw. It is a great game, and I hold many memories with it.",
            "score": 7,
            "replies": [
                {
                    "author": "Mooncubus",
                    "body": "6 years old?? Dang that's wild. When I was 6 I was just struggling to beat Pokemon Yellow lol",
                    "score": 5,
                    "replies": [
                        {
                            "author": "vickydont_",
                            "body": "Yeah 6 lol. I originally got it because my cousin played RE6 with me at his house & I thought it was a cool game, so I bought Skyrim thinking it was RE6 since the logos are similar (to the eyes of a child). Best mistake ever honestly, I have done over 20 playthroughs (though never fully LOL) over the past 11 years, I love this game so much! Right now I am playing the Skyrim Together mod with my BF, it is a tad bit janky but it has been the most fun I've had on the game",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Killer_wiee333",
            "body": "I attacked a chicken and had saved just after it so i spent it trying not to die",
            "score": 4,
            "replies": []
        },
        {
            "author": "Fit_Tradition8007",
            "body": "I was 17, I couldn’t  believe the next TES was released. I played Oblivion a lot in my childhood, so I was excited about how much I was going to explore and live in a whole new beautiful world. I was not in a hurry, but my “friend” spoiled me main quest a bit, because he rushed through the main quest in a day or two. What a savage.",
            "score": 4,
            "replies": []
        },
        {
            "author": "LightyLittleDust",
            "body": "Very loosely. It was back in 2011 when Skyrim came out, and I was 14. I think my very first character was a female Breton, and I wandered into Windhelm straight after Helgen, joined the civil war on Ulfric's side.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HecklersCock420",
            "body": "Yes. Waited all day for the postman. He came, no Skyrim. Cried. Got called an idiot. Gets delivered 30 mins later. Feel like an idiot. Fight giant spider. Best day of my 12 year old life.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HauntingRefuse6891",
            "body": "God no I can barely remember what I did last week never mind back in ‘11.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BFR5er",
            "body": "13 years ago? Nah. I remember being a bit overwhelmed, but I was well versed with Fallout 3 and New Vegas so it was a HUGE shock.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OrwellianCrow201",
            "body": "I was over at my friend’s house and I had never played a game like it ever before ~~even to this day~~. It scared and intimidated the crap out of me but eventually felt like home. I’ve been playing it on and off but I’ve been there since day 1.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheArcanist_1",
            "body": "Yeah, I am generally a massive sucker for magic and cool flashy explode-y stuff in general so I got soooo hyped when I found out there is an entire college dedicated to learning magic and murdering people with fireballs. I didn't realize carriages existed so I took a long painful walk to the College. When Faralda greeted me with a test I was worried it might be something on a higher level but then I passed the test easily which hyped me up even more. And then I saw the actual college and was soooooo amazed by just how beautiful the building is. I still have that save btw, great times.",
            "score": 2,
            "replies": []
        },
        {
            "author": "suzmckooz",
            "body": "Yes.  I was overwhelmed, confused, and didn't understand why everyone wanted to fight me.  I thought it was too dark, and I missed Link.  LOL.  \n\nTook a couple more starts (and maybe a couple more years) before I got super into it.  And a few other games under my belt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "rootbearus",
            "body": "Not really.  It's kind of just a blur. I ran in to every bandit and draugar hideout and killed everything over and over for 50 levels. I did not understand that I had skill points either so I was doing it all with just the skill levels",
            "score": 2,
            "replies": []
        },
        {
            "author": "Low_Party",
            "body": "My first playthru, I completely missed the Standing Stones",
            "score": 2,
            "replies": []
        },
        {
            "author": "Oohbunnies",
            "body": "Not so well, although I do remember the few of hours before hand.  I closed the office, got down to the nearest Games and bought it and an Xbox 360.  I remember it as the little shits ripped me off.  The console came with a choice of new release AAA game.  I said I wanted to swap it for Skyrim.  A simple request seeing I was spending about 300 quid!  They said they could only accept the brand new game, still in it's wrapper and perfectly fine to sell as new as used.  They would only knock £5 off the price.  Last time I ever went to that chain, they would've lost a fortune.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DyeuZomb10",
            "body": "I remember how lost I was, the map seemed so huge. First dragon fight, the drogr ! Man, my best memory ever",
            "score": 2,
            "replies": []
        },
        {
            "author": "ixaias",
            "body": "yes!\n\nI had a notebook with an celeron and installed Legendary Edition. Ran like shit on 720p so i played on 800x600.\n\nfirst hours was like, mindblowing. How could a game from 2011 (i first started playing in 2018) be so rich in content? I literally played 10 hours straight.",
            "score": 2,
            "replies": []
        },
        {
            "author": "megatronnewman",
            "body": "I'm in the middle of my first couple weeks playing and I'm in love. Can't believe I slept on this game so long.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok_Silver_1932",
            "body": "I remember getting lost trying to get to Whiterun",
            "score": 2,
            "replies": []
        },
        {
            "author": "HappyStufff",
            "body": "I accidentally killed a chicken in Ivarstead and went into a complete panic as a load of NPCs attacked me. I remember running up the start of the 7000 steps to get away from them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Toombes_",
            "body": "Very much so. I had taken the day after launch off work for this very purpose. A couple buddies and I set up a whole cave in one of their basements each of us brought a console and a tv, we st out for iHOP and went to the midnight launch (whish was actually at midnight, as they used to be), as this was tradition for us. Man, we went home, had all agreed to head to bed, and when one of us woke for the day, they'd wake everyone else up so we could all start together. Those first 10 hours were insane. We all decided to head in different directions and join different factions, we had a group text going where we updated each other on our progress and tales of our adventures. We mostly lost touch over the years, but sometimes we reach out and reminisce. What a time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HowToNoah",
            "body": "Ya i was really young and ran straight to windhelm, my brother convinced me to talk to every person in the city. By the time i was done i had so many quests i was too overwhelmed and broke down in tears, didnt play again for a few years lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Greedyfox7",
            "body": "Yeah, got yeeted by a giant pretty quickly",
            "score": 2,
            "replies": []
        },
        {
            "author": "Paraceratherium",
            "body": "Yeah, 2013. Male argonian. Took a right turn down the Helgen track towards the hideout with Warrior and got very confused in a snowstorm. Still think Argonian is the best. 🦎",
            "score": 2,
            "replies": []
        },
        {
            "author": "SAL10000",
            "body": "Vividly yes",
            "score": 2,
            "replies": []
        },
        {
            "author": "Waste-Stuff-7401",
            "body": "this has been one of the most emotional reads i’ve had on Reddit, thanks :-D",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aware_Rhubarb4006",
            "body": "I was just wondering around. Baffeled by how cool and beautiful this game is. Ahhh, the simpler times",
            "score": 2,
            "replies": []
        },
        {
            "author": "Busy_Ad6259",
            "body": "Skyrim has always been apart of my life but I only just beat it this month! My first memories of the game is being a little kid in my brothers bedroom roaming around as a Khajit (because kitty of course) casting flames. Last moment I remember is running up on a giant",
            "score": 2,
            "replies": []
        },
        {
            "author": "NMA6902",
            "body": "Yup, playing through helgen as a khajit, finding the sparks spell book and thinking it was the coolest thing ever, and then promptly playing till lvl 46 or so only to accidentally delete my save while clearing old clutter saves because the xb360 organization was atrocious haha.",
            "score": 2,
            "replies": []
        },
        {
            "author": "cocoaminty__",
            "body": "Unfortunately I don't. I started playing Skyrim as a child, and also around the same age I got assaulted at. Trauma really messed with my memory so I don't remember much of my childhood. I barely remember much of my first Skyrim playthrough, but I do remember the universal experience of killing the chicken in Riverwood and getting attacked by everyone😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "Quirky_Inspection",
            "body": "Absolutely. I stared at Bleak Falls Barrow for a lot longer than I thought I should have. Years later I still do it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "your_big_pony",
            "body": "First hours were in the mist - it was my first rpg ever and I just did what my bf told me to do. But I remember my first hours in Rift. Golden autumn, beautiful views… and spiders, spiders everywhere! It was terrifying! I was afraid to go out of town at night! Not that I have arachnophobia, but after that all my characters in every game hate spiders.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ContinualTie484",
            "body": "I thought solitude was a refugee camp for the rebels LOL. Also vividly remember my first time finding a giants camp and wondering over mammoth cheese. It’s like I was actually there haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "-General-Specific-",
            "body": "I remember my first encounter with this damned game. A number of my friends were so excited for it, but I had never even heard of elder scrolls. So I redboxed it. I grabbed a copy for the PlayStation 3, as was the style at the time. And I brought it home. The game looked lovely but played like crap. Terrible game. Glitching everywhere, crashing, bugging out. Dragons flying backwards. Cats and dogs, living together. Total anarchy. Couldn’t figure out why they all loved it. Then I realized I was the ONLY one playing it on ps3, as was the style at the time. So I returned the game to Redbox and got it for the 360, which is what we used to call an Xbox back then. I got it home and it was a complete 180, which is half of a 360. Give me 2 180s for a 360 you’d say. The game looked a bit worse, but played great. So much fun. When it was time to return that game, I ended up buying it on steam and got the best of both worlds. Game looked its best and played its best.",
            "score": 1,
            "replies": []
        },
        {
            "author": "R_110",
            "body": "No, it was 200 years ago",
            "score": 1,
            "replies": [
                {
                    "author": "-General-Specific-",
                    "body": "200 years? Personally, I blame the institute.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Creative_Newspaper65",
            "body": "That was a longggg time ago",
            "score": 1,
            "replies": []
        },
        {
            "author": "AudieCowboy",
            "body": "Right now I want that knapsack, and a mod to make the imperials the Union and the Stormcloaks the Confederates and have guns",
            "score": 1,
            "replies": []
        },
        {
            "author": "WandFace_",
            "body": "Decided I wanted to make a full set of leather armour before heading to whiterun. I spent time in whiterun tundra where I tried to take on a mammoth. Big mistake.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hippiechu",
            "body": "i first had the chance to play the game on Nintendo Switch (very late into my life. i was about 19). I was taken back by the graphics and loved the atmosphere of the game. Now years later I've gotten an ROG ally, and I'm enjoying those views FAR better than i ever did before",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tricky-Extent-7099",
            "body": "I'm in my first 40 hours, so yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "carnelianPig",
            "body": "yes! it lasted around 13 few hours",
            "score": 1,
            "replies": []
        },
        {
            "author": "IgokFC",
            "body": "One thing I distinctly remember from my first couple of hours in my original play through, is walking down the path and around the corner to have Whiterun presented in front of you. I was awestruck by how massive it looked and how good the graphics were",
            "score": 1,
            "replies": []
        },
        {
            "author": "Phillip67549",
            "body": "No. Only think I can really remember is I lost both Lydia and Serana on my first playthrough. They just disappeared entirely",
            "score": 1,
            "replies": []
        },
        {
            "author": "sillygoose1228",
            "body": "Yes, it was a god damn nightmare! I had no clue what was going on because my husband wouldn’t tell me anything for fear of spoilers",
            "score": 1,
            "replies": []
        },
        {
            "author": "trilogyjab",
            "body": "I remember so distinctly. My brother had just bought the game for his playstation, and I was visiting him for the weekend. He told me I had to try the game out, that it was one of the best games ever made. So i spent a few minutes building a Nord character and then got right into the game. Followed Hadvar into Riverwood, then headed to Fort Greymoor and began killing bandits. By the time the fort was cleared out, I already knew I was gonna buy the game as soon as I got home. Haven't gone more than a few months without playing it since then. I still enjoy going to Fort Greymoor early on to level up a bit. But I usually kill at least one dragon first, so I have a shout when I get there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "akirakush",
            "body": "i had broken my leg and had to stay in cruches for months, at some point i saw it on youtube and asked my mom to buy a disc for my 360. still wish i had just come across the disc without ever seeing the youtube videos, just to be completely shocked by the game, but i was still amazed when i first played, it was beautiful, i played for thousands of hours",
            "score": 1,
            "replies": []
        },
        {
            "author": "wasted_tictac",
            "body": "I remember my follower jump scaring me in Ustengrav and in a panic I did a kill animation on them. \n\nI cried and laughed because I had to lug all their crap, and mine,  back to Dawnstar to sell.",
            "score": 1,
            "replies": []
        },
        {
            "author": "puzzlepasta",
            "body": "Yes, i was climbing to the old guys and i physically felt tired like i was climbing too. Crazyyy",
            "score": 1,
            "replies": []
        },
        {
            "author": "phantom-scribbler",
            "body": "I remember my first few hours watching my son play this game.  It's what got me into gaming, and by gaming, I mean Elder Scrolls and Fallout and that's it.  It was a revelation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrDufferMan3335",
            "body": "Yep. Got in on Christmas of 2011 at 14. By then Fallout 3 was already my favorite game but I went in blind and somehow didn’t realize it was the same studio. I was immediately in love with the world. It’s why I will never hate bleak falls barrow no matter how many times I go through it, it was my first dungeon and my first real experience with the game. Played about 8 hours a day all of winter break. Now I play it again every winter",
            "score": 1,
            "replies": []
        },
        {
            "author": "cjk2793",
            "body": "I was blackout drunk in college playing with friends before heading out to party. I don’t really remember any of the first 40 hours of game play bc that’s what it was every time lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tsiatk0",
            "body": "Nah I was too stoned 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "OzbiljanCojk",
            "body": "Understanding how big the map is was a big wow.\n\n\nClimbing to High Hrothgar was epic.\n\n\nThat Eldergleam Sanctuary dagger made me feel so guilty about those people.\n\n\nEpic fight with Hagraven on that small hill.\n\n\nFirst dwarven elevator rising in the middle of mountain.\n\n\n\n\n\n\nBeautiful memories.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yayautism7314",
            "body": "Yes.  Stuck in Bleak Falls Barrow cause I died at a door and the game would spawn me at the door, getting killed, repeatedly.  It would be years before I tried to play Skyrim again, finally getting past that point and eventually beating the game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuentinTarzantino",
            "body": "Yeah. The fucking bee or rabbit or padamame. What ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GlamMetalGopnik",
            "body": "My first few hours of Skyrim were all spent on character creation",
            "score": 1,
            "replies": []
        },
        {
            "author": "crmtttm",
            "body": "I remember getting my ass kicked because i killed a chicken",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adi-A_123",
            "body": "The way I started playing Skyrim was I only had a xbox 360 so I went to my local games store and bought a bunch of games like halo and cod. But the one that struck my eye was skyrim. The very reason i even considered playing was Secunda. After leaving helgen, A thief or bandit like asked me to hold something for him and I was so confused with Skyrim. What do I do now? I was like why is it open world from the start. Then I somehow got to riverwood and the rest was history",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheCorpseParty1",
            "body": "Of course. I went to Riverwood killed a chicken everyone freaked out then I ran to Whiterun and was killed by a Guard. Phenomenal Game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zig_Zag_ZugzWang",
            "body": "My first few hours, was with survival mode, because i missclicked, and my game was not about \"Fight with dragons\", this was \"Fight with hunger\", really, 0 jokes",
            "score": 1,
            "replies": []
        },
        {
            "author": "DunstanCass1861",
            "body": "Yes, and it was without a back pack! Nah, not disrespecting. Enjoy my friend!",
            "score": -1,
            "replies": [
                {
                    "author": "Mooncubus",
                    "body": "The backpack is included in Anniversary Edition. This is just a screenshot from my most recent playthrough. I don't have screenshots from my first playthrough back in 2011 because you couldn't take screenshots on 360.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DunstanCass1861",
                            "body": "I know I wasn’t hating. I got the first edition when it came and played that to death. Moved away from home and didn’t have a console until the switch and downloaded it again about 4 weeks ago. I was amazed by all the new content. It really was a different game almost. I also rock a backpack",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}