{
    "title": "Abstimmung zu Schuldenpaket: Wagenknecht verabschiedet sich mit Eklat aus dem Bundestag",
    "author": "PaulMuadDib-Usul",
    "subreddit": "de",
    "rank": 7,
    "score": 414,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 84,
    "url": "https://www.fr.de/politik/abstimmung-zu-schuldenpaket-wagenknecht-verabschiedet-sich-mit-eklat-aus-dem-bundestag-zr-93633997.html",
    "id": "1jebwpt",
    "selftext": "",
    "comments": [
        {
            "author": "hn_ns",
            "body": "> Bundestagsvizepräsidentin Petra Pau (Linke) erteilte der Gruppe einen Ordnungsruf und warnte: „Sie wissen, welche Konsequenzen ein zweiter Ordnungsruf hätte.“ Daraufhin wurden die Transparente eingezogen.\n\nSo tief stecke ich in der BT-Sitzungslore dann doch nicht drin: was passiert bei einem zweiten Ordnungsruf innerhalb einer Sitzung, (Edit: *automatischer*) Ausschluss aus der Sitzung?",
            "score": 335,
            "replies": [
                {
                    "author": "senor_uber",
                    "body": "Ordnungsgeld oder Ausschluss aus der Sitzung.\n\nErster Ordnungsruf ist quasi eine gelbe Karte.",
                    "score": 298,
                    "replies": []
                },
                {
                    "author": "MajorGef",
                    "body": "Auschluss aus der Sitzung und damit auch Ausschluss von der Abstimmung.",
                    "score": 121,
                    "replies": []
                },
                {
                    "author": "johannes1234",
                    "body": "Ausschluss von der Sitzung. Siehe https://youtu.be/fhTqFnTFyJs für Präzedenzfall.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "hn_ns",
                            "body": "> Siehe https://youtu.be/fhTqFnTFyJs für Präzedenzfall.\n\nErklärt Lammert nicht ab Minute 9:12, dass die Fraktion der Linken in der Sitzung explizit nicht aufgrund von (wiederholten) Ordnungsrufen ausgeschlossen wurde oder verstehe ich ihn da falsch?",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "johannes1234",
                                    "body": "Das ändert nicht substantiell. Heute war Petra Pau amtierende Präsidentin und die war sicherlich mit dem Fall vertraut (sie war damals bereits Vizepräsidentin und Teil der Fraktion deren Mitglieder ausgeschlossen wurden) und hat sich entschieden zunächst mit einem Ordnungsruf zu versuchen die Ordnung wieder herzustellen. Dies war nicht unbedingt nötig. Je nachdem wie streng das Präsidium des 20. Bundestags die Regeln auslegt und was da für Abmachungen getroffen wurden. Im 17. wurden die Regeln, nach verschiedenen Vorkommen, aber eng ausgelegt.\n\n\n§ 38 der Geschäftsordnung verlangt auch weiter keine Ordnungsrufe. https://www.bundestag.de/parlament/aufgaben/rechtsgrundlagen/go_btg/go06-245164 (§ 36 regelt Ordnungsrufe und folge rein aufgrund von Ordnungsrufen)",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "hn_ns",
                                            "body": "> § 38 der Geschäftsordnung verlangt auch weiter keine Ordnungsrufe.\n\nGerade deshalb klingt es für mich so, als ob die Fälle anders gelagert sind: Lammert schließt die Linken mit Verweis auf § 38 und Erwähnung dessen, dass für den Ausschluss kein Ordnungsruf notwendig ist, aus, der Kommentar von Pau heute klingt für mich so, als ob ein zweiter Ordnungsruf automatisch den Ausschluss zur Folge hätte (womit kein Gebrauch von § 38 gemacht werden müsste).\n\n> § 36 regelt Ordnungsrufe und folge rein aufgrund von Ordnungsrufen\n\nVon einem automatischen Ausschluss kann ich in § 36 nichts lesen, da geht's doch nur um die Entziehung des Wortes, nicht um den Ausschluss aus der Sitzung.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "johannes1234",
                                                    "body": "Es geht um die Würde des Hauses, die durch die Plakataktion gestört wird. Die amtierende Präsidentin hat heute erst Mal mit einem Ordnungsruf reagiert und auf weitere Konsequenzen hingewiesen, die Abgeordneten haben darauf die Plakat eingepackt und Ordnung war wieder hergestellt. Die amtierende Präsidentin hätte vermutlich auch direkt § 38 verwenden können, hat sich aber für den weniger harten weg entschieden und sich das Recht vorbehalten.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "hn_ns",
                                                            "body": "> Es geht um die Würde des Hauses, die durch die Plakataktion gestört wird.\n\nDas ist offensichtlich, sonst hätte es den Ordnungsruf nicht gebraucht.\n\n> und auf weitere Konsequenzen hingewiesen\n\nDarauf, ob es bei einem zweiten Ordnungsruf *automatisch* zwingend zu verhängende Konsequenzen geben würde, bezog sich meine ursprüngliche Frage.\n\n\"Sie wissen, welche Konsequenzen ein zweiter Ordnungsruf hätte.\" klingt für mich so, als ob es einen Automatismus gäbe, den kann ich der Geschäftsordnung allerdings nicht entnehmen.\n\n> Die amtierende Präsidentin hätte vermutlich auch direkt § 38 verwenden können, hat sich aber für den weniger harten weg entschieden und sich das Recht vorbehalten.\n\nAuch das klingt nicht danach, als ob es einen solchen Automatismus gäbe, korrekt? Dass es nicht zwingend einen (ersten) Ordnungsruf braucht, um jemanden aus einer Sitzung auszuschließen, ist mir bekannt und eben durch § 38 abgedeckt.\n\nZusammenfassend noch mal in aller Deutlichkeit: Folgt aus einem zweiten Ordnungsruf zwingend und automatisch der Ausschluss aus der Sitzung?\n\nFalls ja: welchem Punkt der Geschäftsordnung ist das zu entnehmen?\n\nFalls nein: ist der Satz von Pau einfach als \"Sie wissen, dass ich Sie nicht nur zur Ordnung rufen, sondern auch von der Sitzung ausschließen darf.\" zu verstehen?",
                                                            "score": 11,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ComfortableAfraid477",
                            "body": "Wie \"normal\" die Welt damals noch war..",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Anthyrion",
                                    "body": "Ja, damals galt die Linkspartei als \"Störenfried\", aber selbst die waren noch harmlos. Erst als die Schreihälse und Falschnachrichtenverbreiter der blaunen in den Bundestag einzogen, ging es bergab.\n\nIch wünschte wirklich, unsere hohen Herrschaften würden endlich den Verbotsantrag abnicken.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Freibeuter86",
                    "body": "Dann rollen sie Guillotine raus, ganz üble Sache.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Buntschatten",
                    "body": "Kreuzigung vorm Brandenburger Tor",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kolenga",
            "body": "Ich würde ja gerne sagen, dass wir die Frau damit endlich los sind. Aber sie wird sicher auch weiterhin in jede zweite Talkshow eingeladen.",
            "score": 291,
            "replies": [
                {
                    "author": "Tubaenthusiasticbee",
                    "body": "Erstmal das und es gibt immernoch die nächste Bundestagswahl. Diesmal haben die es nur ganz knapp nicht in den Bundestag geschafft, bei der nächaten Wahl sieht es vielleicht anders aus.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "bensen3k",
                            "body": "Wird halt ohne Kohle schwerer",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "No-Confidence-9191",
                                    "body": "Wenn die Russen eins Verstanden haben, dann dass langfristige Investitionen immer eine Chance abwerfen. Die Verräterin kommt wieder.",
                                    "score": 70,
                                    "replies": [
                                        {
                                            "author": "mschuster91",
                                            "body": "Die Russen stecken ihr Geld lieber in die AfD. Wagenknecht und Lafo haben a) selber genug Kohle und b) genug Verpeilte die das BSW unterstützen. Ist doch bei der MLPD das gleiche Spiel, die haben auch ordentliche Finanzmittel bei denen andere Parteien mit den Ohren schlackern.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lutscher_22",
                                                    "body": "Wenn das BSW gleich gute Ergebnisse wie die MLPD einfährt, können wir sehr zufrieden sein.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Wobbelblob",
                                                            "body": "Denke ich auch. Ich werde zu jeder Wahl daran erinnert das der Haufen noch existiert, aber ansonsten vergesse ich die immer. Finde ich in Ordnung.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Viertelesschlotzer",
                            "body": "Es gärt schon jetzt in der Partei. Entweder der Parteivorstand hört mit dem Mircomanagment auf und lässt auch andere Meinung als die der Großen Vorsitzende zu, oder das BSW rutscht entgültig in Richtung Politsekte ab und damit in die Bedeutungslosigkeit. Womit ich kein allerdings kein Problem hätte.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "marseletron",
                                    "body": "Das ist genau mein Humor. In eine Partei eintreten, die buchstäblich nach der Großen Vorsitzenden selbst benannt ist und dann beschweren, dass nur ihre Meinung zählt. Wenn es doch nur irgendwelche Hinweise dazu gegeben hätte im Bündnis SARAH WAGENKNECHT.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "DaveyJonesXMR",
                                            "body": "Wahrer Zarenknecht bitte",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Anthyrion",
                                    "body": "Leider haben wir mit 20% der Wählerstimmen noch immer eine Verräterpartei im Bundestag. Und die wird alles in ihrer Macht stehende tun, um jede mögliche Aktion gegen Russland zu torpedieren und zu unterminieren.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mcm_xci",
                            "body": "Dann unter ganz anderem Namen: SWB! 🥸",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "polite_alpha",
                            "body": "Die neue Regierung wird die Eingriffe Russlands in unsere Politik nicht mehr tolerieren, daher wird das bsw untergehen. Good riddance!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sure-Money-8756",
                    "body": "Und jedes Jahr ein Buch",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "leopold_s",
                    "body": "Immerhin nur noch in jede zweite, statt wie zuvor in gefühlt jede..",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adiroquai",
            "body": "Auf nimmerwiedersehen. ",
            "score": 369,
            "replies": []
        },
        {
            "author": "Crato7z",
            "body": "Und Tschüss, ein Kremlin Gremlin weniger",
            "score": 126,
            "replies": [
                {
                    "author": "SenatorSeidelbast",
                    "body": "Wie wär's mit \"Kreml-Dämel\"?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "ReneG8",
                            "body": "Zarenknecht?",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "GenevaPedestrian",
                            "body": "Passt nicht, das e ist kurz, das ä ist lang",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nudel22",
            "body": "Niemand wird BSW vermissen",
            "score": 227,
            "replies": [
                {
                    "author": "Arkensor",
                    "body": "Was für'n Ding? Klingt nach einer Krankheit",
                    "score": 25,
                    "replies": [
                        {
                            "author": "3esin",
                            "body": "Ja",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "simonfancy",
                            "body": "Das war BSE…",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IchEsseNurBrot",
            "body": "Raus aus dem Bundestag und zurück in den Kreml.",
            "score": 132,
            "replies": [
                {
                    "author": "KriminelleForelle",
                    "body": "Wetten wie lange wirds dauern bis sie bei Gazprom im Vorstand sitzt?",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Strandhafer031",
            "body": "Demnächst dann auf Tournee durch russische Talkshows?",
            "score": 27,
            "replies": []
        },
        {
            "author": "Vinterblot",
            "body": "Ding Dong! Niemand hat dem linken Parteienspektrum der Bundesrepublik mehr geschadet, als das Ehepaar Lafontaine-Wagenknecht. Hinfort mit euch!",
            "score": 79,
            "replies": [
                {
                    "author": "Feisty_Camera_7774",
                    "body": "Ich finde Lafontaine kommt hierbei etwas schlecht weg",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Jenne1504",
                    "body": "Och naja, wenn man auf die Wahlergebnisse der Linken guckt seit der Abspaltung… ;-)",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ReneG8",
                            "body": "Hä? Ist das dann nicht das was OP meint? Linke ohne Zarenknecht = win",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Jenne1504",
                                    "body": "Ja, meins war ne Antwort auf „haben […] geschadet“. Seit den Split haben sie ganz gut wieder was zur Wiedergutmachung beigetragen durch ihr Verhalten",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Levian3000",
                                            "body": "Ja. Hoffe, Die Linke nimmt die BSWler hoffentlich nicht zurück, Linke ist Grad so schön stabil (und letzte linke Partei im Bundestag)",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Tintenlampe",
                                                    "body": "No true Linksman!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrChrisis",
            "body": "2024 - 2025 \n\nWer BSW nicht mitbekommen hat, hat nichts verpasst",
            "score": 9,
            "replies": [
                {
                    "author": "absolutely_not_spock",
                    "body": "Das Gegenteil der reunion von Oasis",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beautiful-Act4320",
            "body": "Die kann ja jetzt auch [Tiger Botschafterin](https://www.spiegel.de/ausland/russland-karin-kneissl-von-wladimir-putin-zur-tiger-botschafterin-ernannt-a-4396d1ac-96c2-44cd-9752-0e80713f44dc) in Russland werden",
            "score": 19,
            "replies": []
        },
        {
            "author": "Danihilton",
            "body": "Ich war zwar auch gegen das Schuldenpaket, aber diese Aktion war einfach nur peinlich. Gott stehe den Bundesländern bei, die sie noch ertragen müssen, bevor diese Partei sich auflöst",
            "score": 17,
            "replies": [
                {
                    "author": "Hobbitfrau",
                    "body": "In Thüringen gibt's schon mächtig Zoff zwischen dem Landesverband und Zarenknecht. Die hat nämlich behauptet, Thüringen hätte nicht genug Wahlkampf gemacht bei der Wahl (das BSW hatte hier 9,4 %, wohlgemerkt).\n\nBisher lässt sich der Landesverband aber nicht wirklich reinreden. Dass Sarah jetzt hier aufschlägt und sich persönlich um Thüringen kümmern will, ist daher zum Glück ziemlich unwahrscheinlich. Aber die Auflösung vom BSW umso mehr ...",
                    "score": 6,
                    "replies": [
                        {
                            "author": "HippoRealEstate",
                            "body": "In 30 Jahren wird man sich wahrscheinlich fragen, was das eigentlich für eine komische Partei war, die in Thüringen für eine Legislaturperiode nicht nur im Landtag saß, sondern sogar an der Regierung beteiligt war. Komplett wild. Ich frag mich, was in 4 Jahren, nach der nächste LTW, aus denen wird.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheHypnoRider",
            "body": "Und ich dachte für einen Moment das sei Satire. Das linke Sprachrohr des Zaren wird auch immer unausstehlicher.",
            "score": 7,
            "replies": []
        },
        {
            "author": "GlobalGuppy",
            "body": "Wie sagt man hier so schön \"Tschö, wa.\"",
            "score": 4,
            "replies": []
        },
        {
            "author": "Munortap_Otcepxe",
            "body": "Tschüüüß",
            "score": 5,
            "replies": []
        },
        {
            "author": "St3pp3nwol4",
            "body": "Wagen wer?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Giu90__",
            "body": "Eine Russlandh*** weniger ...",
            "score": 5,
            "replies": []
        },
        {
            "author": "IRockIntoMordor",
            "body": "Die kleine Zarenknecht möchte Aufmerksamkeit haben nach der Schlappe bei der Wahl. \n\nDirekt danach ging sie beleidigt ins IKEA Småland und warf den anderen Kindern Bälle an den Kopf.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ProfessorStrangelord",
            "body": "„1914 wie 2025: NEIN zu Kriegskrediten!“?\n\nWohl eher: \"1946 wie 2025: JA zur Unterwerfung unter Russland!\"\nAber dazu müsste man ja ehrlich sein...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valentiaga_97",
            "body": "In nen aufsichtsrat posten in russland? 👀",
            "score": 7,
            "replies": []
        },
        {
            "author": "PROMEENZ",
            "body": "Die Wagenknechte werden in 5 Jahren vergessen sein.",
            "score": 5,
            "replies": [
                {
                    "author": "Slart1e",
                    "body": "5 Jahre? Die sind in 5 Tagen nach Bildung des neuen Bundestages vergessen.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "PROMEENZ",
                            "body": "Nein, weil sie doch noch in Landtagen sitzen.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "THE12DIE42DAY",
                                    "body": "Und durch die Talkshows ziehen wird.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "TsubasaSaito",
                                            "body": "Irgendwie muss man ja easy money machen wenn der Staat dich nicht mehr bezahlt, nä",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GeneralReject",
                    "body": "Russland wird schon dafür sorgen, dass ihre Agentin weiterhin politischen Schaden verursachen kann.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MangoJerry81",
            "body": "So, jetzt kehrt in Deutschland hoffentlich ein bisschen Ruhe ein bei dem ganzen Chaos der letzten Tage (Wunschdenken). Die soll sich bei Gasprom einen schönen Posten geben lassen und uns in Ruhe lassen. Oder schön eine Pause mit Oskar und Gerd genießen. Für lokale und Landespolitik ist sie sich ja eh zu schade.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Antwerp2",
            "body": "Die Russen Fraktion verabschiedet sich in die ewige Bedeutungslosigkeit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Peti_4711",
            "body": "Selbst der daneben sitzende Herr Bartsch lässt jegliche Begeisterung vermissen. \n\nSolche Aktionen dienen doch nur für Youtube Videos, die man dann unter der eigenen Anhängerschaft verteilt. Von den anderen Politkern wird sich keiner angesprochen fühlen. Von den Zuschauern, die keine BSW Anhänger sind, wahrscheinlich auch kaum jemand.",
            "score": 5,
            "replies": []
        },
        {
            "author": "sejoki_",
            "body": "Das ganze \"Eklat\" zu nennen ist ungefähr so, als würde ich sagen, es gab heute ein Eklat in meiner Wohnung, weil jemand nackt aus dem Schlafzimmer ins Bad gelaufen ist.\n\nWenn es niemanden interessiert, ist es kein \"Eklat\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ruebennahse",
            "body": "OK.",
            "score": 2,
            "replies": []
        },
        {
            "author": "juuu1911",
            "body": "Hoffentlich auf Nimmerwiedersehen, aber ich bin mittlerweile zu pessimistisch um zu glauben, dass wir sie wirklich los sind.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nosebear17",
            "body": "Wagenknecht war mal im Parlament? Das hat tatsächlich Seltenheitswert!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leaval11",
            "body": "Haben sich nicht mal die Mühe gemacht unterschiedliche Schilder zu machen xD",
            "score": 1,
            "replies": []
        },
        {
            "author": "burner69burner69",
            "body": "good fucking riddance",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grabs_Diaz",
            "body": "> die Schulden in Höhe von bis zu 1.500 Milliarden Euro ermöglicht. Die Gelder sind vorgesehen für Militär (500 Mrd. Euro), Infrastruktur (500 Mrd. Euro) und Klimaschutz (100 Mrd. Euro)\n\nDie Darstellung ist so doch ziemlich falsch, wenn ich richtig informiert bin. Tatsächlich geht es um 500 Mrd. für Infrastruktur, davon 100 Mrd. für den Klima- und Transformations. Währenddessen sind Verteidigungsausgaben (sowie Zivilschutz, Ukrainehilfen etc.) komplett von der Schuldenbremse ausgenommen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nimo80",
            "body": "Schlechte Verliererin, schlechter Abgang.",
            "score": 0,
            "replies": []
        },
        {
            "author": "SpecialFlimsy2955",
            "body": "hahahahahahahahahahahahahahaha\n\nciao zahrenknecht, du wirst nicht vermisst",
            "score": 0,
            "replies": []
        },
        {
            "author": "aAdramahlihk",
            "body": "Da hat die wanna be Oligarchin wohl Bekanntschaft mit dem Türsteher gemacht.",
            "score": 0,
            "replies": []
        },
        {
            "author": "20x_kaioken",
            "body": "Wieso sitzt sie im Bundestag ohne Sitze",
            "score": -1,
            "replies": [
                {
                    "author": "MisterMysterios",
                    "body": "Noch ist das der alte Bundestag. Der neue Bundestag hat seine erste Sitzung erst nächste Woche",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}