{
    "title": "Julia Klöckner: Warum ausgerechnet sie? | Schäuble, Lammert, Süssmuth: Wenn es um das zweithöchste Amt im Staat ging, setzte die Union auf Exzellenz. Jetzt soll Julia Klöckner Präsidentin des Bundestags werden.",
    "author": "Lurchi1",
    "subreddit": "de",
    "rank": 5,
    "score": 446,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 89,
    "url": "https://www.zeit.de/politik/deutschland/2025-03/julia-kloeckner-bundestagspraesidentin-amt-herausforderung-afd",
    "id": "1jedw62",
    "selftext": "",
    "comments": [
        {
            "author": "ClausKlebot",
            "body": "Klapp' die Antworten auf diesen Kommentar auf, um zum Text des Artikels zu kommen.",
            "score": 1,
            "replies": [
                {
                    "author": "Lurchi1",
                    "body": "https://archive.ph/yt3tI",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "FlaviusBelisarius505",
            "body": "Ihr überseht das Gute: Die Bundestagspräsidentin kann nicht Ministerin sein",
            "score": 524,
            "replies": [
                {
                    "author": "Oreelz",
                    "body": "Das liest sich immer so als wäre Durchfall in der Nachspeise besser als im Hauptgericht.",
                    "score": 399,
                    "replies": [
                        {
                            "author": "Correct_Ninja_2213",
                            "body": "Oh Gott, ich kann nicht mehr!",
                            "score": 52,
                            "replies": []
                        },
                        {
                            "author": "KainLTD",
                            "body": "okay der war mega gut :D hut ab, hut ab.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Doebledibbidu",
                            "body": "Sie, Sir sind ein Poet!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ApolloIII",
                            "body": "😂😂",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "LinqLover",
                            "body": "Hat da jemand eine Hausdurchsuchung bestellt? 👮",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sea_Struggle4973",
                    "body": "Ich stimme dem zu... das Problem ist: Die Wechselbank für schlechte Minister ist bei der Union verdammt voll. Spahn und Dobrindt winken schon freudig. Auch die SPD hat das eine oder andere Gesicht zu bieten, dass eigentlich politisch erledigt sein sollte.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "9Strike",
                            "body": "Bei der SPD hoffe ich noch, dass die die unbeliebten Minister:innen los werden (zB Nancy Faeser). Aber an sich hat die SPD doch relativ gute Minister (Hubertus Heil, Karl Lauterbach, Boris Pistorius).\n\nBei der CDU gibts ja wirklich niemand.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bilzui",
                    "body": "wäre eine gute Nachricht, wenn da nicht noch Typen wir Dobrindt und Spahn wären",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HippoRealEstate",
                            "body": "Ganz ehrlich, selbst wenn die nicht da wären, wären dann halt die nächsten inkompetenten/korrupten Union-Trottel am Start. Es ist nicht so, als ob die Partei da einen Mangel hat.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GeorgeJohnson2579",
                            "body": "Lass Bundespräsident Dobrindt aus dem Spiel!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RPS_42",
                            "body": "Die kann man doch bestimmt noch zu Bundestagsvizepräsidenten machen!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-Cobbler-9219",
                    "body": "Und deshalb haben wir von der Leyen….",
                    "score": 11,
                    "replies": [
                        {
                            "author": "mschuster91",
                            "body": "Die hat sich aber wider Erwarten auf europäischer Ebene ziemlich gut geschlagen.\n\nBei dem sonstigen Gruselkabinett aus Unionsreihen ist da wenig Anlass zur Hoffnung.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DirectorSchlector",
                    "body": "Schade ich hatte schon drauf gewettet dass sie Deutschlands komplette Grundwasserreserven Nestlé überschreibt.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Rasakka",
                    "body": "..Sie ist die zweitmächtigste Person im Land, vor Merz.. und mal sehen, wer der nächste CDU Bundespräsident wird.. Spahn, Dobrindt?",
                    "score": -1,
                    "replies": [
                        {
                            "author": "FlaviusBelisarius505",
                            "body": "Bei allem Respekt: Sie ist nicht dir zweitmächtigste Person im Land, sondern nur funktional die Vertretung des Staatsoberhaupts.\n\nDie ächtigste Person ist in D der BuKa, dann der Vize-BuKa und dann vermutlich die Fraktionschefs oder der Kopf der MPK.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Lady_Johanna21",
                                    "body": "Vertretung Staatsoberhaupt? Da verwechselst du wohl Bundestagspräsident mit Bundesratspräsident. Letztere/r übernimmt nach Art. 57 GG die Vertretung des Bundespräsidenten. Lediglich in der Protokollarischen Rangfolge (oder wie das heißt) ist BT-Präsi 2. hinter BP, dann erst der Kanzler auf 3.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "johannes1234",
                                    "body": "Wieso ist der Vizebundeskanzler mächtig? Das sitnnenFunktin, die es in der Form, wie das präsentiert wird, nicht gibt. In der Praxis ist das mehr ein Titel um Koalitionspartner einen Titel zu geben.\n\n\nRichtig: Der darf einmal in den Sommerferien die Kabinettsitzung leiten, das ist es dann aber auch. In allen anderen Sachen wird Vertretung auch Mal kurzfristig anders verteilt. Und vor allem rückt der Vize nicht nach, wenn der Kanzler stirbt o.ä. sondern dann wird der Bundestag einen neuen Kanzler wählen. Anders als in den USA, wo der Vizekanzler dann voll übernimmt.\n\n\nEin Vizekanzler kann mächtig sein, weil er ein mächtiges Ministerium leitet.\n\n\n\nBundestagspräsident ist aber auch nicht unmächtig. Kontrolle über Tagesordnung, Abstimmungen und bestimmt über die Ordnung im Haus (im Zweifel mit Hilfe der unterstellen eigenen Polizei) Klar, in der Praxis passiert das im wesentlichen im Konsens über den Ältestenrat, aber für die Fälle, eines \"notwendig\" ist, sind die Instrumente da. Abstimmungsreihenfolge festlegen, Zwischenfragen nicht zulassen, Abgeordnete ausschließen, ... das kann auf Ergebnisse Auswirkungen haben.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "FlaviusBelisarius505",
                                            "body": "Das liest du falschrum. Der Vize hat ein wichtiges Ministerium, weil er der Vize ist. Nicht umgekehrt. Der Vize ist der Kopf der Kabinettsgruppe der kleineren Partei. Praktisch Inhaber der kleinen Richtlinienkompetenz.\n\nDer Bundestagspräsident hat Einfluss auf den Ablauf des Verfahrens in der Legislative, aber praktisch keinen auf das Ergebnis. Er ist Kopf der Institution selbst.\n\nZugegebenermaßen liegt die Schwäche aber auch an der zunehmend schwachen institutionellen Selbstwahrnehmung der Parlamentarier. Die Regierungsfraktionen sehen sich zunehmend als Fortsetzung der Exekutive und nicht wie vorgesehen umgekehrt.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "johannes1234",
                                                    "body": "Nein. Zwischen dem Minisiterium und dem Vize ist kein Zusammenhang und das \"Vize\" fuhrt auch nicht zu irgendeiner Formmvon \"kleiner Richtlinienkompetenz.\" Es ait nichts weiter als ein schmückender Titel. Alle Macht (jenseits der Leitung des Ferienkabinetts, die der Kanzler aber jederzeit anders delegieren kann(\\*) und das auch mehr Show ist) kommt aus anderen Funktionen. Daraus dass er Minister ist, daraus dass er Parteivorsitzender(\\*\\*) ist etc. \n\n\nChristian Lindner war z.B. nicht Vizekanzler, hat aber eines der mächtigsten Ministerien geleitet (möglicherweise mächtiger als der Vizekanzler mit dem Wirtschafts&Klimaministerium) und war als Parteichef innerhalb der Partei mächtig (im Zweifel mächtiger als Habeck bei den Grünen)\n\n\nDas Vizekanzler Ding ist reines Zeremoniell ohne viel Bedeutung.\n\n\n\\*) Es kommt auch regelmäsig vor, dass Kanzler wen anders, gerne auch nur im Bereich bestimmter Aufgaben,  gemäß Art. 60 Abs. 1 zum Vertreter bestimmt. Immer pragmatisch daran hängend, warum es die Vertretung braucht (Kanzler auf Auslandsreise, aber irgendwer soll irgendein Dokument unterschreiben können etc.) \n\n\n\\*\\*) Bei den Grünen ist das wegen Trennung von Amt und Mandat komplizierter, aber das ist auch Parteiinterne Debatte, die nicht am Titel als \"Vizekanzler\" hängt.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TensionOk2479",
                                            "body": "Sorry, aber der Vizekanzler leitet nicht automatisch die Kabinettssitzungen, wenn der Kanzler im Urlaub ist. Der Kanzler benennt seine Vertretung.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "johannes1234",
                                                    "body": "Sag ich ja. (Wobei der Vizekanzler der Default als Vertreter ist, dies aber dynamisch anders gemacht wird, im Sommerurlaub des Kanzler ist es aber Gewohnheit, dass der Vizekanzler einmal Medienwirksam eine Kabinettssitzung eines Kabinetts aus denen, die jcutnim Urlaub sind, leitet)\n\n\n\n\nVize ist zu 99% reines Zeremoniell.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GeorgeJohnson2579",
                                    "body": "Bundestagspräsident ist auf Platz 2 in der Hierarchie, nach dem Bundespräsidenten. \n\n\nMan kann sich jetzt noch streiten, um welche Rangfolge es genau geht, dann könnte z. B. auch der Bundestagspräsident dazukommen.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wassertopf",
                            "body": "Sollte das nicht das nächste Mal ne Frau werden?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "hn_ns",
                                    "body": "Dann hat Klöckner ja sogar noch Aufstiegschancen. Ü",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Rasakka",
                                    "body": "Achso? War mir so nicht bekannt, vorallem da die Person ja vermutlich von der CxU kommt, hielt ich gendern für unnötig. \n\nVielleicht schenken sie der SPD auch wieder den Posten, mal abwarten.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Lanky-Fish6827",
                            "body": "Scheuer!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Senigata",
                            "body": "Gottpräsident Maggus",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "01KLna",
            "body": "\"In jeder Partei gibt es einen Personenkreis, auf den zwei Eigenschaften zutreffen und der deshalb der jeweiligen Führung Kopfzerbrechen macht: Das sind Personen, die man erstens mit Posten versorgen muss, sei es wegen Alter, Geschlecht, Loyalität, Kompetenz, aus Repräsentationsgründen, oder schlicht, weil sie andernfalls als freie Radikale gefährlich werden könnten. Und für die zweitens im engeren Personalpuzzle kein Platz ist\".\n\nIch bin nicht immer Fan der ZEIT, aber das ist eine gute Analyse - sie ist unumgänglich wahr. Klöckner ist auch deshalb von Vorteil, weil Merz dann jedweden Hinweis auf Sexismus umgehen kann: 'Was denn, ich habeimmerhin einer Frau zum zweithöchsten Job in Deutschland verholfen\". Joa. Mehr als *eine* Frau braucht es ja eh nicht.",
            "score": 167,
            "replies": [
                {
                    "author": "Springfieldhere",
                    "body": ">Ich bin nicht immer Fan der ZEIT, aber das ist eine gute Analyse - sie ist unumgänglich wahr. Klöckner ist auch deshalb von Vorteil, weil Merz dann jedweden Hinweis auf Sexismus umgehen kann: 'Was denn, ich ha e immerhin einer Frau zum zweithöchsten Job in Deutschland verholfen\". Joa.\n\nGenau und die AFD ist nicht rassistisch und homophob weil Weidel eine lesbische Frau ist, die mit einer Schwarzen zusammen lebt. \n\nDie Wähler der CDU muss man garnicht so austricksen,  die haben eh kein Problem mit Sexismus.",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "sejoki_",
                    "body": ">oder schlicht, weil sie andernfalls als freie Radikale gefährlich werden könnten.\n\nBJK incoming",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "stadtkroete",
                    "body": "Tosendem Applaus wäre Frau Klöckner jedenfalls nicht gefährlich geworden als freie Radikale. Zuletzt hat sie vermeintliche Radikale inmitten von Familien beim Demo-Sonntag identifiziert, weil der Chef, dem gegenüber sie sich so loyal in der Rede zeigt, sich beim Wahlpoker Ende Januar demaskiert hat:\n\nhttps://www.ardmediathek.de/video/phoenix-vor-ort/julia-kloeckner-auf-dem-cdu-parteitag/phoenix/Y3JpZDovL3Bob2VuaXguZGUvNDc3MjQ1Mg",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "aAdramahlihk",
            "body": "Korruption?\n\nVetternwirtschaft?\n\nVon der Leyened?\n\nMan stelle sich einen Arbeitgeber/Betrieb vor, der einen Befördert wenn man nur Scheiße baut und eine offen korrupte Drecksau ist, aber Steuer- & Bestechungsgelder sind ja unendlich, da kann man ja nicht pleite gehen!",
            "score": 31,
            "replies": [
                {
                    "author": "_predator_",
                    "body": "\\> Man stelle sich einen Arbeitgeber/Betrieb vor, der einen Befördert wenn man nur Scheiße baut und eine offen korrupte Drecksau ist\n\nAlso so ziemlich jedes Unternehmen? Je größer desto schlimmer wird's. Was Lobbyisten in der Politik sind, ist das Sales Team von Zulieferern in der Wirtschaft.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "SoftwareOdd8846",
            "body": "Peter-Prinzip? Nach oben Wegloben? Sie war so scheisse",
            "score": 82,
            "replies": [
                {
                    "author": "hn_ns",
                    "body": "> Peter-Prinzip?\n\nDafür hätte sie in dem, was sie getan hat, gut sein müssen.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "SoftwareOdd8846",
                            "body": "Nein im Kern sagt es: „jeder steigt so weit auf, wie seine Inkompetenz es zulässt.“ sobald du etwas gut machst, bleibst du dabei",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "DriedSquidd",
                                    "body": "Im Gegenteil. Wenn du einen Job gut machst, wirst du so lange befördert bis du ihn schlecht machst.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "SoftwareOdd8846",
                                            "body": "Laurence J Peter aus '69 .. denke wir reden über den gleichen dude . Da muss ich nochmal recherchieren",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Certain_Arachnid2834",
                                                    "body": "Du bist gut in deinem Job > wirst befördert > bist da drin schlecht aber degradieren geht halt nicht \n\nIst die eine der zwei Aussagen, also greift hier nicht",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "hn_ns",
                                    "body": "> im Kern sagt es: „jeder steigt so weit auf, wie seine Inkompetenz es zulässt.“\n\nEs besagt, dass du solange aufgrund guter Arbeit aufsteigst, bis dich deine Inkompetenz an einem weiteren Aufstieg hindert.\n\n> sobald du etwas gut machst, bleibst du dabei\n\nDu steigst ja gerade auf, *weil* du die aktuelle Tätigkeit gut ausführst.\n\n> The Peter principle states that a person **who is competent at their job will earn a promotion** to a position that requires different skills. If the promoted person lacks the skills required for the new role, they will be incompetent at the new level, and will not be promoted again. If the person is competent in the new role, they will be promoted again and will continue to be promoted until reaching a level at which they are incompetent. Being incompetent, the individual will not qualify for promotion again, and so will remain stuck at this final placement or Peter's plateau.\n\nhttps://en.wikipedia.org/wiki/Peter_principle#Summary (Hervorhebung durch mich)",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "robsti",
                                    "body": "Genau das Gegenteil: das Prinzip besagt, dass man, solange man etwas gut macht, befördert wird. Erst wenn man sich bei einer Tätigkeit als unfähig herausstellt, wird man nicht mehr befördert. \nDas hat zur Folge, dass leistungsstarke Mitarbeiter solange befördert werden, bis sie keine Leistung mehr bringen können und gleichzeitig leistungsschwache Mitarbeiter auf Posten bleiben, für die sie nicht geeignet sind. Irgendwann führt dies dazu, dass alle Hierarchie-Ebenen durch unfähige Mitarbeiter besetzt sind.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Thorusss",
                                    "body": "genau falsch herum",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UESPA_Sputnik",
                    "body": "> Peter-Prinzip? Nach oben Wegloben?\n\n\nDas wäre dann das Dilbert-Prinzip. ",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Comfortable-Roof-185",
            "body": "Ich finds okay. Nestle braucht ja auch irgendeine Vertretung im Bundestag.",
            "score": 54,
            "replies": [
                {
                    "author": "Harry_Gelb",
                    "body": "Wenn auf dem Rasen vorm Weißen Haus vom Präsidenten Autos verkauft werden, dann kann bei uns die Bundestagspräsidentin auch den Reichstag zum Maggi-Kochstudio machen. Ist doch eh alles egal inzwischen.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Paddy31",
            "body": "Klar, der exzellente Schäuble.",
            "score": 61,
            "replies": [
                {
                    "author": "Wolkenbaer",
                    "body": "Der war wenigstens intelligent (wenn auch punktuell etwas vergesslich). Ich kann bei Klöckner nur vermuten, dass man Schadensminimierung betreiben möchte.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "BennyL2P",
                    "body": "Immerhin war er die erste schwarze Null ;)",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnnieInTeal",
            "body": "Ich nehme an, sie ist einfach günstig zu kaufen.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Lurchi1",
            "body": "Der Artikel bringt eigentlich nur eine These dafür vor, wieso ihre Loyalität zu Merz zu diesem Job führte:\n\n> Warum es nun kein Fachressort für Klöckner wurde, sondern gleich ein Job zwei Etagen höher, wo doch die Ministerien in der künftigen Koalition noch nicht mal verteilt sind, [darüber wird munter spekuliert](https://archive.ph/ffydP). Eine Erzählung, die die Runde macht, führt nach Bayern, wie könnte es anders sein. Markus Söder, CSU-Chef und mit einer gewissen Ausdauer gesegnet, wenn es darum geht, einen Groll zu hegen, soll vor allem Armin Laschet verhindert haben wollen. Der Ex-Kanzlerkandidat, in Fehde mit Söder vereint, galt bis zuletzt als einer der möglichen Anwärter auf das Amt des Bundestagspräsidenten.\n\nDer Link geht zur FAZ von gestern:\n\n> Wie derzeit in Berlin zu hören ist, hat sich auch der CDU-Bundestagsabgeordnete und Kanzlerkandidat des Jahres 2021, Armin Laschet, Hoffnungen gemacht, Parlamentspräsident zu werden. In der CDU sagt mancher, der 64 Jahre alte Laschet könnte das Amt gut versehen. Laschet selbst hat aus seinen Ambitionen kein Geheimnis gemacht. Ein Hindernis für ihn ist, dass er aus Nordrhein-Westfalen kommt, wo es – angefangen bei Merz – schon genug CDU-Männer gibt, die nach der Bundestagswahl in Berlin etwas werden wollen. Allen voran Generalsekretär Carsten Linnemann und der stellvertretende Fraktionsvorsitzende Jens Spahn.\n>\n> Doch entscheidender dürfte etwas anderes gewesen sein. Berichtet wird, dass der CSU-Vorsitzende Markus Söder gegen Laschet gewesen sei. Die Wunden aus dem Wahlkampf 2021, in dem Laschet Söders Hoffnungen, selbst Kanzlerkandidat der Union zu werden, zerstört hat, sind offenbar zu tief. Den Vorschlag für den Posten des Bundestagspräsidenten macht Merz jedoch in Abstimmung mit der CSU, schließlich braucht man auch die Stimmen der CSU-Abgeordneten. Gegen Klöckner haben die Christsozialen, also Söder, offenbar weniger Einwände.",
            "score": 9,
            "replies": [
                {
                    "author": "sloth_takes_a_nap",
                    "body": "War ja klar, dass Söders gekränktes Ego mal wieder im Spiel ist. Dass man als Spitzenpolitiker so eine beleidigte Leberwurst sein kann...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Quarktasche666",
            "body": "Weil es nicht um Kompetenz geht.",
            "score": 7,
            "replies": []
        },
        {
            "author": "bullettenboss",
            "body": "Darf Nestlé sie dann weiterhin als Lobbyistin benutzen?",
            "score": 6,
            "replies": []
        },
        {
            "author": "LunaticWithPogoStick",
            "body": "Leute vom Format Lammert und Süssmuth sind inzwischen rar in der Union.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CoatAltruistic49",
            "body": "To be fair, Zensursula als EU-Präsidentin ist nun auch nicht der heiße Scheiß",
            "score": 15,
            "replies": [
                {
                    "author": "Gefaxelwaxel",
                    "body": "Sie schlägt sich da auf jeden Fall besser als sie es im eigenen Land je gemacht hat",
                    "score": 20,
                    "replies": [
                        {
                            "author": "CoatAltruistic49",
                            "body": "Die Messlatte lag nun auch nicht besonders hoch, aber aus den eigenen Fehlern lernen zu können, hat in der Politik in der Tat heute schon Seltenheitswert.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Born-Network-7582",
            "body": "Ich mag die Dame nicht. Gibt es objektive Maßstäbe, an denen man sie bewerten kann?",
            "score": 10,
            "replies": [
                {
                    "author": "schmidtis95",
                    "body": "Die deine Meinung zu ihr ändern könnten? \n\nNein die gibt es nicht. Objektiv kann man da von nicht mögen eigentlich nur zu Verachtung/Hass kommen.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "johannadambergk",
                    "body": "Sie hat Erfahrungen als Weinkönigin.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "namesareunavailable",
            "body": "tja... das werden einige fürchterliche Jahre, wo wir uns das dämliche Gelaber anhören dürfen :)",
            "score": 3,
            "replies": []
        },
        {
            "author": "RetroButton",
            "body": "Beförderung bis kein Schaden mehr angerichtet werden kann?",
            "score": 3,
            "replies": []
        },
        {
            "author": "DirkUsed",
            "body": "Weil sie keine bessere haben. Schaut euch doch das gesamte Parlament an. Wer sticht denn da heraus ?",
            "score": 3,
            "replies": []
        },
        {
            "author": "BooombasticHero",
            "body": "Sie hat halt die besten Frühstücksflocken. Sorry, die süßesten Frühstücksflocken.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Strakiz",
            "body": "Schlimm wenn ausgerechnet die Frau das beste CDU-Mitglied sein soll.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Snake_Pilsken",
            "body": "Keiner ist cooler als Bärbel Bas.",
            "score": 1,
            "replies": []
        },
        {
            "author": "reversetranskriptase",
            "body": "Naja mit 100.000 Mark-Schäuble hat die Nestle-Klöckner doch nicht nur einen kecken Spitznamen gemein. Fügt sich Mmn nahtlos in diese \"Exzellenz\" mit ein.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kirdnehnaj243",
            "body": "Die Union hat auch auf Ursula von der Leyen (66, CDU) als EU-Kommissionspräsidentin gesetzt ...",
            "score": 2,
            "replies": []
        },
        {
            "author": "shinrak2222",
            "body": "Exzellenz in Korruption.",
            "score": 1,
            "replies": []
        },
        {
            "author": "litnu12",
            "body": "Mit Ruhm hat sich keiner der genannten bekleckert.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fandango_Jones",
            "body": "Da die FDP raus ist muss die Lobby Schublade wieder aufgefüllt werden. Völlig logisch! /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "NezOfLife",
            "body": "Kann die Tante nicht einfach wieder Vollzeit bei Nestlé arbeiten und die Scheinpolitik lassen?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Peti_4711",
            "body": "Klöckner selber hin oder her, aber der Zeit Artikel hat einen kleinen Schönheitsfehler. Er erwähnt auch niemand anderen. Wenn ich mich da so bei der SPD und der Union umschaue, mir fällt spontan auch niemand anderes ein, höchsten noch eine Wiederwahl.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lord-dr-gucci",
            "body": "Merz ist ein Schwachkopf, niemand wollte ihn je haben.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Illustrator6845",
            "body": "Ich habe mir den Wiki Artikel von ein paar bisherigen Präsident:innen durchgelesen und was ist passiert CDU. Rita [Süssmuth](https://de.m.wikipedia.org/wiki/Rita_S%C3%BCssmuth) oder [Eugen Gerstenmaier](https://de.m.wikipedia.org/wiki/Eugen_Gerstenmaier) waren enteger und haben sogar für weniger Diäten & Abgeordnete geworben. \n\n[Lammert](https://de.m.wikipedia.org/wiki/Norbert_Lammert) einfach nur ein alter mürrischer Mann & Botschafter des Bieres, Schäuble ein korrupter Parteisoldat und Nestle Klöckner ist laut eigenen Worten die demokratische Alternative zur AfD.",
            "score": 1,
            "replies": [
                {
                    "author": "EmploymentCareless66",
                    "body": "Lammert ein mürrischer Mann?\n\nEr war der geborene Bundestagspräsident.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "FellowKidsFinder69",
                    "body": "Lammert war wahrscheinlich den wir je hatten?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Informal-Term1138",
            "body": "Nestlé hat also die Präsidentschaft im Bundestag gekauft. Interessant.",
            "score": 1,
            "replies": [
                {
                    "author": "DeanoDeVino",
                    "body": "Und Stufe 1 Fleisch",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "One_Strike_Striker",
            "body": "Mir fallen eine ganze Menge nicht exzellenter Bundestagspräsidenten ein: Bas, Thierse, Jenninger, der furchtbare Richard Stücklen, auch Rita Süßmuth und Wolfgang Schäuble finde ich (in der Rolle) überbewertet. Das ist ein Jokerposten um noch jemanden unterzubringen der für den Proporz fehlt oder ein Amt braucht und es ist eher Zufall, wenn dabei hervorragende Besetzungen wie Lammert oder Renger entstehen.",
            "score": -4,
            "replies": [
                {
                    "author": "TheCatInTheHatThings",
                    "body": "Was hattest du jetzt gegen Bas? Und was ist dein Problem mit Thierse? Und in welcher Welt war Süßmuth nicht exzellent?",
                    "score": 14,
                    "replies": []
                }
            ]
        }
    ]
}