{
    "title": "The managed oppo…sorry…Democratic Party “resistance”",
    "author": "proper_bastard",
    "subreddit": "LateStageCapitalism",
    "rank": 54,
    "score": 4452,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 89,
    "url": "https://i.redd.it/x0cfc2vt54ie1.jpeg",
    "id": "1ilegq6",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vilnius_Nastavnik",
            "body": "But it’s absolutely critical that you donate TODAY",
            "score": 342,
            "replies": [
                {
                    "author": "proper_bastard",
                    "body": "Roe v Wade has been overturned....we are urgently asking you for a $15 monthly donation so....\n\n....so we can fight for the thing that we could have codified anytime but it was more useful for us to use as a gun to your head to scare you into voting for us",
                    "score": 278,
                    "replies": [
                        {
                            "author": "fazedncrazed",
                            "body": "The best part is the last time around the DNC used the \"we will codify roe vs wade\" carrot, they dictated as their candidate someone who spent most of their career *trying to overturn roe vs wade.*\n\nhttps://www.snopes.com/fact-check/biden-vote-overturn-roe/\n\nHe *won*, partly on that promise of restoring abortion, and in four years as president tried to do fuck-all about it. Which is surprising to his voters somehow.\n\nThe truly insane, maddening thing is the dems will run on it again, and it will work again, because no one looks up legislative history and/or everyone has the memory of a goldfish.",
                            "score": 28,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "proper_bastard",
                                    "body": "ACA is just death by incrementalism",
                                    "score": 42,
                                    "replies": []
                                },
                                {
                                    "author": "A-CAB",
                                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Numerous-Ad-8743",
                    "body": "But if you don't donate, how will the latest batch of senile, dysfunctional geriatric losers win the umpteenth MosT iMpoRtaNt EleCTioN oF oUr LiFetiMe?!?!",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "Axrxt76",
            "body": "The only 2 ways you can view this are: They wanted this outcome and are complicit, or, they are trying to punish voters to scare them back to the party. Either way, fuck them! I've watched their inability to counter the GOP for decades all while shivving the left. Casting them as delusional children while the \"adults\" were hastening fascism",
            "score": 52,
            "replies": [
                {
                    "author": "comunnacho",
                    "body": "Liberals will never take side with the left when we really need them to. Never.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "cheese_scone",
            "body": "Remember kids it's not red vs blue it's the 1% vs you!",
            "score": 34,
            "replies": [
                {
                    "author": "proper_bastard",
                    "body": "Red and blue is a total con. Just another bourgeois trick to keep us at each other's throats. I live in the American South and these people are primed for an actual left wing economic populist (at the least) message. If only they had one to vote for...",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "evhan55",
            "body": "I hate it here 😫",
            "score": 111,
            "replies": []
        },
        {
            "author": "eu_sou_ninguem",
            "body": "The only thing worse than the party is the majority of the voters who, as usual, place the blame on us minorities instead of where it belongs.",
            "score": 163,
            "replies": [
                {
                    "author": "NormieSpecialist",
                    "body": "It’s so shocking to me honestly. I’ve never seen the Democrats messed up as badly as they did with Kamala and yet all of the libs choose to blame it on Palestinians, immigrants, and even each other at some points. It’s genuinely madness.",
                    "score": 107,
                    "replies": [
                        {
                            "author": "Sugar_and_Cyanide",
                            "body": "It's nothing new, they've been doing this same song and dance for a very very long time. I remember all the way back when Bush 'won' vs Gore.. they blamed Progressives and Leftists then.\n\nThey do it every time they lose.\nIt's never their fault, the party is never at fault.\nIf it's before the election they scream at us to vote Blue no matter Who.\nIf it's after the election then either: 1) It's our fault they lost. 2) They won and they didn't need us anyway so shut up it's not time for changes now, doing such changes as leftists want would lose them the next election!\n\nI'm tired boss...",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "NormieSpecialist",
                                    "body": "I can’t imagine. I’m only recently paying attention.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "AntiquarianThe",
                                    "body": "You really think we're going to blame....[homeless people for not showing up to vote when the process is painful and difficult](https://www.findlaw.com/voting/my-voting-guide/the-homeless-vote--can-you-legally-cast-a-ballot-.html) to register and the results do not help their material conditions?\n\nOr blame Indigenous Americans who suffer under massive voter restrictions including \"non-illegal\" measures like how the Duckwater reservation in Nevada have to travel 140 miles each way to reach the closest elections office in Tonopah? [This is also in view of bipartisan support for erasing indigenous links to their historical land](https://nativenewsonline.net/environment/apache-stronghold-takes-oak-flat-fight-to-supreme-court) and continuing the genocide of indigenous people in the name of profit.\n\nOr wait, how about BIPOC non-voters when v[ote suppression is legal and widespread and disproportionately targets them](https://www.brennancenter.org/our-work/research-reports/impact-voter-suppression-communities-color) and their communities, and the bipartisan results are hostile against them no matter what?\n\nNo, we are not going to blame people or non-voters for having absolutely no faith at all in the \"sacred results\" of this wretched system. Our enemy is the capitalist class and its reactionary foot soldiers who defend it at any cost.",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "Malkhodr",
                                    "body": "What exactly were their choices? Genocidal girlboss War Criminal or Genocidal moron War Criminal? Neither offered any solutions that would help people. Both of them were and still are funded by the same oligarchs fucking us all over. \n\nWhat is there to vote for? You could say 3rd party, but why would most Americans even bother when third parties historically never win, nor is their platform even known because of corporate censorship. \n\nPeople not voting is the natural response to not having a single good option available that they were aware of.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "proper_bastard",
                    "body": "Democrats have conditional support. If you're a marginalized group that doesn't vote for them they are as savage as the worst conservative you'll find.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "WightMask",
                            "body": "We all seen what they were doing to the Palestine protestors in liberal cities. I never seen them go after any hate groups as bad or as abusive. It really was sad to see.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "__GayFish__",
                    "body": "Schroedingers voter: if you vote, they won but they didn’t really need it so they won’t give you the policies, but if you don’t vote, they can’t win without it and you’re actually voting for the other team that will also *checks notes * also not implement your policies.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "_CriticalThinking_",
                    "body": "Mind you there are still people blaming Sarandon",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "96385",
            "body": "That's not true at all. They've issued multiple statements and even sent several mildly worded letters.",
            "score": 58,
            "replies": [
                {
                    "author": "mightybuffalo",
                    "body": "No, no more angry letters. It’s time to work WITH the fascists on our shared goals. /s",
                    "score": 34,
                    "replies": [
                        {
                            "author": "96385",
                            "body": "Democrats rebranding as \"the good fascists\".",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "HAHA_goats",
                                    "body": "Funded with the good ~~bribes~~ donations from the good billionaires.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "uhlemi11",
                                    "body": "Fascism lite *now with fewer calories!",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "SnapesGrayUnderpants",
                                    "body": "The lesser of two evils is still evil.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "proper_bastard",
                                    "body": "Happy Cake Day!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RedAndBlackMartyr",
                    "body": "And many a furrowed brows.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "LamentableFool",
                    "body": "Mildly?? I'm pretty sure they've SLAMMED by now.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Putrid_Race6357",
            "body": "Save us from fascism!!! Do what it takes to keep Trump from taking office!!\n\n\n^^^Also ^^^we ^^^are ^^^voting ^^^for ^^^his ^^^nominees",
            "score": 33,
            "replies": []
        },
        {
            "author": "bomboclawt75",
            "body": "DNC: Okay, everyone NOT on the AIPAC paycheck leave now, and don’t come back.",
            "score": 14,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 33,
            "replies": [
                {
                    "author": "both-shoes-off",
                    "body": "Perhaps stage a bunch of protests around the country with every single issue on a sign ranging from hyperbole to healthcare without having a clear goal other than expressing discontent. \n\n ....Maybe [cry wolf everyday](https://youtu.be/GXA5mbW1DX8?si=Ot-N6iac29P6BSPS) and blow things out of proportion often enough so that when something real bad actually happens everyone just ignores it due to the many times before when it wasn't real.",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "diapoetics",
            "body": "Most liberals seem to have defaulted back to the same worn out stuff they've been doing and saying for years *ad nauseam*, things that have shown to fail or be ineffectual: Vote shaming, blaming everything on Putin, blaming everything on the Chinese communist hiding under their kitchen sinks, desperately begging people to write strongly worded letters to their elected officials, and pleading with people to go passively stand on sidewalks holding snarky signs in the least disruptive way possible.\n\nBesides that, the liberals in power are playing at lawfare, which will ultimately prove a dead end given what we are currently facing with the collapse and disregard for the law, a system of laws that has been fucked and broken far too long to begin with. Trump has immunity, according to the supreme court, and he can just pardon whoever he wants if the law comes after them. Also, democratic congressional lawmakers are trying to go to different governmental department buildings to talk with people and are being told to fuck off, they can't come in.\n\nStepping back and observing, it all just looks like a last ditch desperate attempt of a dying party, doing the same things that have failed, in order to try to save and defend the system as it is torn apart and collapses. Good riddance.",
            "score": 33,
            "replies": []
        },
        {
            "author": "skjellyfetti",
            "body": "Remember folks, the DNC is a private corporation and, together with the RNC, they're both owned and operated by the same oligarchs, who work **solely** for **CAPITALISM**.\n\nSo, with our glorified \"two party\" system, we merely have the illusion of differing and opposing goals and policies. Sure, there are those issues that matter, like abortion, but at the top, they don't give a fuck 'cause their money will buy them whatever they want—abortion included. Shit, they even have their own police, military and intelligence apparatuses, which ~~is~~ was the US Government.\n\nIt's all theater, based on a false nobility and patriotism.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Historical-Edge-9332",
            "body": "I can’t wait for them to threaten to not raise the death ceiling, only to raise it without getting a single concession from the Republicans.\n\nIt hasn’t happened yet, but it’s already basically guaranteed.",
            "score": 9,
            "replies": [
                {
                    "author": "Pearl-2017",
                    "body": "Idk, the current Republican party seems pretty happy to have Elon cut everything; the debt ceiling discussion should be interesting. They are all going to want their paychecks.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "frootcock",
            "body": "Don't worry, Hakeem Jeffries says God is still on the throne so everything is ok and nothing matters",
            "score": 6,
            "replies": []
        },
        {
            "author": "justinsane85",
            "body": "But they did a photo op in front of the Department of Education and stared disappointingly at the dork guarding the door.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Unselpeckelsheim",
            "body": "No no no, you misunderstand; they voted! Therefore they have done literally all there is to do politically every 4 years... they just simply *can't* do anything else 😔",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 7,
            "replies": [
                {
                    "author": "A-CAB",
                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Viridian_Crane",
            "body": "[https://en.wikipedia.org/wiki/French\\_Resistance](https://en.wikipedia.org/wiki/French_Resistance)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Laguz01",
            "body": "They need to realize any deal with silicon valley or billionaires in general is a deal with the devil and should be treated accordingly.",
            "score": 4,
            "replies": []
        },
        {
            "author": "comunnacho",
            "body": "The dems doing batshit since the cheeto took office is the writing on the wall leftists have been calling our for years: liberalism is dead. \n\nThe \"positive\" side is that the space is up for grabs",
            "score": 4,
            "replies": []
        },
        {
            "author": "CheeseReaper77",
            "body": "We’ve tried nothing, but we got an idea everyone will love. Bipartisanship (bend over and let the republicans fuck us when they tell us to). \n\nIf the dems want to preserve any sense of being a coherent party they need to cause as much chaos as possible - I don’t even like the dems, I’m here so that should tell you all you need to know - whatever the republicans try to do, the dems need to oppose it. Grind senate to a halt and slow it down by any means necessary. \n\nThey need to get off their high horse by thinking they’re the bigger and better person by not offering opposition. Its like they’re fucking 10 and not fighting back because fighting is bad and you’re supposed to be above that because you’re mature. But that shit doesn’t work when the person you’re not fighting is literally trying to make deportation camps. \n\nInstead of doing anything, the Dems try to maintain they can’t do anything and ask for more of your money, its literally their new strategy. Damn man, look how bad things are, maybe you should have voted harder, anyways mind giving me some more money so I can get voted in next time???\n\nMaybe I’m expecting too much from the Dems, even though I my expectations are literally rock bottom, but then again what should I expect from a bunch of fossils that sit back and take hundreds of thousands from corporations.",
            "score": 3,
            "replies": []
        },
        {
            "author": "luxoflax",
            "body": "No, no. The Americans who keep downvoting such sentiments insist they are the real victims as they didn't vote for Trump and they're out there, supposedly, holding cardboard signs! If anything will stop the madness, it's witty cardboard!",
            "score": 9,
            "replies": []
        },
        {
            "author": "toramanlis",
            "body": "the counterfeit left",
            "score": 5,
            "replies": []
        },
        {
            "author": "MrDeathMachine",
            "body": "Aint sen Pelosi in quite awhile.",
            "score": 2,
            "replies": [
                {
                    "author": "proper_bastard",
                    "body": "Thank the gods for that. At least they got rid of that ossified leadership of geriatrics.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Getout311",
            "body": "They're so goddamned useless. I hate them so much. I always have and I always will. Their voters gave them all this money and power and charged them with protecting the nation from going off a cliff, and they failed us. Spectacularly. Not only do they fail us, they have a GALL to then blame the voters. As if offering them NOTHING of any substance, was supposed to be good enough. As if we work for THEM and not the other way around. \n\nLook within? Ask what was wrong? Ask what the people they are supposed to be REPRESENTING really want? NO!!!!!!!!! Double down! TRIPLE DOWN!!!!! We need MORE videos doing Tiktok dances with the rich and famous. We need a laughably tone deaf flier that says we saved Americans 23 CENTS on their summer BBQs! That'll show DRUMPF!!!! Wait, we're losing in the polls? Ugh it must have been those worthless MINORITIES again!!!! BROWN people are such BIGOTS!!!! We should have deported more of them when we had the chance!!!!\n\nMay the Democratic party be reduced to nothing. May not a single subatomic particle of it remain. This I pray. This I invoke. I beseech God or Satan or Odin or Vishnu, to blight the wild ass. \n\nA fucking CURSE upon the Democratic party.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Go-Chain3811",
            "body": "c'mon now...democratic party did not do nothing....\n\nthey did do a lot of virtue signaling...lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "Blackbarret85",
            "body": "You guys sit still while your country is completely rearranged into fascism. I guess you need to feel it before fighting.",
            "score": 5,
            "replies": [
                {
                    "author": "proper_bastard",
                    "body": "Says the German. You and the French can't even get your own house in order with the far right (again).",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Blackbarret85",
                            "body": "300k were on the streets in one city alone just yesterday. And yes, we have problems too. But I will fight them. You guys are doing nothing.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "rolipolicanoli",
                                    "body": "I mean, he can use the same argument back? \"We have problems too, but I will fight them\" which many here do at their local levels. He could bring up fed workers and teachers currently trying to hold the line outside of aspects of protest and daily calls from citizens to their legislators. He could say that compared to a 84.6 million populous, a crowd with only the size of 300K with the serious implications of rising far-right parties, it looks like \"You guys sitting still while your country is completely rearranged into fascism.\" if you want to twist words through size comparisons to feel superior.\n\nHave some sonder man, people try where they can at the local level. Beliefs aren't something that can immediately be changed - there's millions of people who see the writing on the wall, but you can't magically make the millions of people who don't see it change their beliefs to suddenly be empathetic and motivated to actually do something about it. Generalizing doesn't help, and belittling people in shit situations doesn't help either.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "boistras",
            "body": "Donny Studied Mein Kampf for four years . He's Light years ahead of the Dems.",
            "score": 2,
            "replies": [
                {
                    "author": "proper_bastard",
                    "body": "I've always thought the Trump Presidential Library will be Mein Kampf, a stack of 80s Hustlers and Green Eggs and Ham.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "khir0n",
            "body": "Just go go go go to polls!",
            "score": 2,
            "replies": []
        },
        {
            "author": "becken_bruch",
            "body": "Same in Europe",
            "score": 1,
            "replies": []
        },
        {
            "author": "bestill234",
            "body": "If only they had more money. /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "anohioanredditer",
            "body": "Join DSA",
            "score": 1,
            "replies": [
                {
                    "author": "proper_bastard",
                    "body": "PSL",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "proper_bastard",
                    "body": "Legal action is moot. SCOTUS will make it all \"legal.\" Even when there is no basis for something they invent law to suit it like the presidential immunity case. Framers of the Constitution knew about this and provided it for legislators and specifically not for the executive. But apparently, from what amounts to read tea leaves on a 200 year old document written by slavers, immunity for presidential legality was what they *really* meant",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MrandMrsSheetGhost",
                    "body": "While I appreciate your vigor, we have to be careful not to yield to spontaneity. If we want to fight this we need to be organizing and strategizing. If we act brashly like MAGA did it will end in the same result, probably worse. The fascists are just waiting for provocation to bring down the hammer, we have to make sure that the hammer can't break us first. Are the \"democrats\" going to do that? No. They never were. It's up to us, the working class.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kenny-du-Soleil",
            "body": "I'm starting to feel like \"We've tried nothing and we're all out of ideas\" is more apt for the online left. Maybe let's stop waiting around for liberals to save us and get active in local political matters to ensure atleast some protections for ourselves and our communities? \n\nNot saying no one is doing that but it feels like that'd be more useful than the constant doomerism about things that no one in this sub has much influence over.",
            "score": -3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -17,
            "replies": [
                {
                    "author": "JimDa5is",
                    "body": "What's puzzling is naming one thing they've accomplished in the last 40 years. Oh, sorry, forgot for a moment that it's MY fault they couldn't pass anything because I wouldn't vote for Clinton|Gore|Kerry|Obama|Clinton|Biden. Selfish of me, really, to not toss aside the entirety of my political beliefs to vote for their republican-lite candidate so they could chalk up a W",
                    "score": 18,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "proper_bastard",
                                    "body": "ACA forces me to purchase a private, for profit product without allowing me the option to buy into Medicare\n\nAnything involving LGBTQ was the Democratic Party being brought kicking and screaming into this century. You are conveniently forgetting your pedophile rapist President Clinton signing DOMA into law and instituting \"Don't ask don't tell\"\n\nStudent loan cancellations....didn't really happen. They intentionally chose their legal basis on the HEROES Act which was murky. This was not by accident. They wanted the appearance of doing something they knew would be overturned (which is their favorite tactic). The Higher Education act explicitly grants permission to waive loans but it would have involved cancelling everything and Democrats will never do that.\n\nCREDIT CARD Act of 2009 was passed with broad \"bipartisan\" support (90-5 in the Senate) so that was low hanging fruit.\n\nEven Trump and his fascists reauthorized CHIP. Again, low hanging fruit.\n\n\"Protect Social Security and Medicare\" - Biden along with 25 Democratic Senators and over 150 House Democrats helped pass the last major cut to SS benefits in 1983. Biden, as president, passed multiple cuts to Medicare Advantage benefits.\n\nReversal of a Muslim ban is obvious and nothing really to crow about when Zionist Biden's foreign policy to the Middle East was more or less \"Give Netanyahu everything he wants.\" They didnot moving the embassy back to Tel Aviv, did not reverse Trump's recognition of Israeli sovereignty over the Golan Heights and....underwrote a fucking genocide in the service of some judeo-fascist lebensraum policy\n\nSeriously...the bar was \"don't participate in a genocide.\" You voting for that says more about you and liberalism as a whole than it does the left.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "JimDa5is",
                                            "body": "I love how dems always trot out ACA. Without mentioning that it was written by the insurance industry and was significantly less comprehensive than the program supported by Richard fucking Nixon in 1973 that included single payor.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "CaptaiinCrunch",
                                                    "body": "BIDEN and HARRIS and by extension YOU also have Palestinian blood on your hands. Shame on you for cynically using people's suffering to advance your blood-soaked political agenda.",
                                                    "score": 9,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "A-CAB",
                                                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "A-CAB",
                                    "body": "This is a leftist subreddit, right wing comments will be removed and the user banned.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "s0ck",
                                    "body": "Great, but none of that helped me at all.\n\nPrices still went up, wages did not keep up, and more services exist out there for things that we used to just be able to buy/have without constantly paying for it.\n\nI know what the democrats say, that meaningful change is hard and we should only ever expect small, incremental changes. Meanwhile, the other side is uprooting our entire democracy, making drastic, wide sweeping changes. \n\nSo, it just seems to me that democrats always could have improved my life by legislating it so, but they chose instead to beg the wealthy for crumbs and mercy and kindness. Fucking weak.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "A-CAB",
                                                    "body": "This is a leftist subreddit, right wing comments will be removed and the user banned.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "proper_bastard",
                                                    "body": "Closet conservatives...\n\nTell me you don't understand politics without telling me",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "s0ck",
                                                    "body": "Nope, but I expect legislation that actually does enrich me somehow, TOO. That's the part that was missing.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "proper_bastard",
                    "body": "For those playing \"spot the DNC shill\" at home\n\nhttps://i.redd.it/p1216oghn4ie1.gif",
                    "score": 15,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "proper_bastard",
                                    "body": "I mean... you're literally proving the point of the meme lib. There is plenty they can try. They can call for a general strike. They could object to everything in the Senate (only takes one) to slow down everything. They can threaten to deny a quorum and shut the government down until Musk is removed from his position and DOGE is disbanded. They could actually....try.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "absolute_tosh",
            "body": "Yeah, [you can't post your way out of fascism](https://www.404media.co/you-cant-post-your-way-out-of-fascism/)",
            "score": 0,
            "replies": []
        },
        {
            "author": "sxales",
            "body": "Oh look, more blaming the democrats for not stopping Trump instead of blaming Trump (and his supporters).",
            "score": -5,
            "replies": []
        }
    ]
}