{
    "title": "Donald Trump just gave a massive gift to the big banks. His administration’s decision to dismantle the Consumer Financial Protection Bureau is another clear signal: Trump is loyal to Wall Street, not workers. ➡️",
    "author": "Prudent_Bug_1350",
    "subreddit": "LateStageCapitalism",
    "rank": 33,
    "score": 420,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/gallery/1imfaiw",
    "id": "1imfaiw",
    "selftext": "https://www.instagram.com/p/DF50TSBvrVx/?utm_source=ig_web_button_share_sheet\n\nPSL (Party for Socialism and Liberation) https://pslweb.org\n\nJoin the Fediverse: https://jointhefediverse.net/join?lang=en-us\n\nMastodon, Peertube, Pixelfed: easily replace Twitter, Instagram and YouTube: https://m.youtube.com/watch?v=5npl2KCt2ok\n\nPeerTube: An alternative to Big Tech’s video platforms 👉 https://joinpeertube.org/#find-peertube-videos\n\nCold War 2: US officials call to overthrow China’s gov’t, expand military budget to $1.4 trillion: https://youtu.be/Q3RMl33SqNE?feature=shared\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slow_Grapefruit5214",
            "body": "This is a prime example of how elites use the prejudices and bigotries of the general public to fleece them. MAGA believes that they are winning, even as Trump and Musk dismantle institutions that are intended to protect them from being preyed on by the people who have actual power: billionaires, big tech and Wall Street. As long as Trump and Musk put on a show of targeting the people that MAGA hates (minorities, immigrants, etc.) they don’t actually care that they are being fleeced.",
            "score": 19,
            "replies": []
        },
        {
            "author": "unirorm",
            "body": "Look up for [Triangles of Corruption - Iron Triangles etc. ](https://duckduckgo.com/?q=triangles+of+corruption&t=brave&ia=web)\n\nThat would explain you a couple of things.",
            "score": 12,
            "replies": []
        },
        {
            "author": "calefa",
            "body": "I happen to listen to Tucker Carlson quite often (yeah I know) and he often brings the predatory interests that some (all) credit card companies carry. It will be interesting to see whether he mentions this at all.",
            "score": 9,
            "replies": [
                {
                    "author": "Dr_Poopenheimer_MD",
                    "body": "Cucker Tarlson",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sea_Huckleberry_7589",
            "body": "Trump and media shills will promote this as a big win for consumers.  \n\nIf the stock market goes up even half a percent then who cares about any later consequences?",
            "score": 4,
            "replies": []
        },
        {
            "author": "PPPHHHOOOUUUNNN",
            "body": "Their money is greater to him than your vote",
            "score": 1,
            "replies": []
        }
    ]
}