{
    "title": "The True Face of Capitalism",
    "author": "Brilliant_Shine2247",
    "subreddit": "LateStageCapitalism",
    "rank": 17,
    "score": 1315,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 37,
    "url": "https://i.redd.it/quwxukca4hie1.jpeg",
    "id": "1imub6d",
    "selftext": "This is where I sleep tonight. Or rather, try to sleep. It's not working so well. \n\n\n\nYou see, I have a brain injury that makes it nearly impossible for me to work, and definitely impossible for me to find work that will get me off the streets. Also, because of the winter, all the shelters are filled. Even homeless people have the sense to come out of the cold. \n\n\n\nTo be clear, I'm not trying to gather sympathy or soft beg. Not at all. Well, not unless someone can offer to change society to help me out. I usually get all I need out here with my writing. \n\n\n\nNo one does \"white flag shelter\" around here because, so they say, insurance companies don't like that shit. So, churches are being regulated out of, well, being churches. \n\n\n\nOur president just spent $15,000,000 to go to a football game and then left during halftime. Meanwhile, Meals on Wheels gets defunded. That's some real leadership right there. \n\n\n\nUp until Friday I had a spot deep in the woods with a nice cozy tent. I was out of sight and out of mind. Never once had any problems until the leaves fell from the trees and nature betrayed me. Then, the business nearby decided that people shouldn't have to see some bum living in the woods. So the local cops came by, and, well, you can guess what happened. \n\n\n\nThey were nice enough to give me a 15 minute window to gather my life together and get the hell out of there. As they stood by watching me frantically try to gather all I could carry a couple of them found it amusing to watch a sixty-one year old man with brain damage try and gather what was important to him and some laughs were had. \n\n\n\nThey did offer to take me to jail, which is privatized around here. Incarceration for profit. The absolute pinnacle of capitalism gone mad. \n\n\n\nWhat they don't seem to get is that they need people like me. They need us to be seen so that the factory workers have an incentive to show up. On time and ready to keep the machine fed. But it can't be fed enough. Glad to be of service to you, Master Musk. \n\n\n\nI'll round this up because my fingers are getting useless. Guess that's what I get for being a human fucking being. \n\n\n\nIt could be worse, though. The guy that had been next to me for two years had all his stuff just set on fire because they couldn't find him to let him know he was unsightly. \n\n\n\nI wonder if Tolsoy ever had that problem. Maybe they don't like me because I'm no longer a cog, my ball bearings seem to have slipped out. \n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElliotNess",
            "body": "We can totally eradicate poverty and homelessness, the main problem we, as Western society, run into is trying to eliminate these things while maintaining a primary profit motive.\n\nBest of luck to you, OP. I feel many of us will be joining you soon.",
            "score": 184,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "I already see it happening. Cars parked overnight at Walmart. New faces every week at the local \"feedings\". And this is a small rural town. I can't imagine how it is in the metro areas. \n\nCalifornia and New York spent enough money on the homeless situation to buy tiny houses (or better) for every homeless person in the country. Where did it all go? That's the question we need to be asking. \n\nI appreciate the good words comrade.",
                    "score": 102,
                    "replies": [
                        {
                            "author": "wastingtoomuchthyme",
                            "body": "> California and New York spent enough money on the homeless \n\ntrue but the $ goes to landlords who jack up the prices/profit.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "Yup. And the politicians friends who head up the \"task forces\". \n\nMake no mistake. There is no war on homelessness, only a war on the homeless.",
                                    "score": 45,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ok-Construction8938",
                            "body": "Where are you located? I’m broke as 💩 right now but I’ve been trying to keep extra snacks on me / give out granola bars to people looking for help on the subways",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "I'm in a little rural, redneck town in NC called Lexington. \n\nBeing homeless in a rural area has it's pros and cons. One big pro is that it's a whole lot safer. Plus, for me, people tend to know you and if they know you're not drunk or on dope then they tend to be cooler towards you. More woods to find safer camp spots. \n\nSome cons are there are less resources available and the folks here tend to be a little less edjumacated, and close minded. I could probably make an equal list for both.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brilliant_Shine2247",
            "body": "The most powerful weapon in the world is a voice. Use your's.",
            "score": 206,
            "replies": [
                {
                    "author": "therustyworm",
                    "body": "Dear op. I've been there before man. I'm currently in a halfway house, working a part time job, paying $600/month in rent. Have you ever heard of oxford house? They might take you in and the rent is doable because youre splitting it what 5-8 guys, sometimes more depending on the house. I'm not aware of your circumstances, and I wish only to help. Peave, love, and chicken grease.\n- Rusty Worm",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Brilliant_Shine2247",
                            "body": "I've been sober for a little over 25 years now. And guess where I stayed when I got out of rehab. At an Oxford House in Greensboro, NC. \n\nThat place saved my life, no doubt. You know about 90 in 90? I did 90 in 42. Hahaha. That's how terrified I was to drink/use again. This is no shit, it was a year after getting out of rehab before I would step foot in a convenient store again. I would pay someone $5 to go inside and pay for my gas if my wife (at the time, now ex) couldn't be with me when I filled up our car. Hahaha. After 4 shots at rehab, I finally took it seriously. No one thought I could do it except me. \n\nBut I do appreciate the tip, comrade. Lot of good stuff in those places, usually.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kilometers13",
                    "body": "You write beautifully",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Brilliant_Shine2247",
                            "body": "Thank you very much. Not bad for a guy who couldn't string a complete sentence together 7 years ago. \n\nI appreciate. If you haven't, then check out my Ko-fi page. It's completely free and there is a lot of insight into the homeless situation there.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Brilliant_Shine2247",
                            "body": "That person is me. I wouldn't post anyone else, man. No way.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "-zybor-",
                                    "body": "Apology. I thought this was another photo from some users on here snapping random unhoused people on their street and doing nothing. I got so mad at this photo and was like wtf why didn't the photographer do stuff to help, and not realized that you are the OP.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Brilliant_Shine2247",
                                            "body": "No problem. I thought that's what you were thinking, because that shit gets me pretty foul as well. \n\nThat's like when you stay in a shelter, you aren't allowed to record or take pics, but then the churches come through there with a fucking professional photographer. I flew off big time in one shelter over that. \n\nNo problem, my friend. I still love you! Hahaha",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Brilliant_Shine2247",
                            "body": "I've been out here now for 7 years, comrade. Been through 3 bridges, 5 tents and an abandoned house. I know the rules, comrade. I change names in my essays, unless the person in question wants their real name used.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NormieSpecialist",
            "body": "I’m so sorry. You deserve better. We all do.",
            "score": 63,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "But if I hadn't been through what I have over the last 7 years, then I wouldn't have had anything to write about. \n\nWhen I look back on my previous life it amazes that I walked through life like a robot. Then, after my injury and ensuing brain surgery I found I couldn't read. I lived under a bridge for 6 months going through magazines I got from the library until it all started coming back. \n\nNow I'm on the edge of a contract. If it happens, I will change the homeless situation in this town for the better. \n\nI'm making noise, comrade, I'm making noise!",
                    "score": 56,
                    "replies": [
                        {
                            "author": "NormieSpecialist",
                            "body": "You still deserve better lol. But still I’m glad you found something meaningful through this experience. And I think you’re right. I want to make some noise too, even if it’s a whisper.",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "TentacledKangaroo",
                            "body": "Have you considered writing a book about your experience? Self-publishing doesn't have the stigma it used to, so the barriers to entry are much lower than they used to be (especially since I think you already cleared your otherwise biggest hurdle -- the tax stuff -- if you already have a ko-fi account). You can use tools like Draft2Digital and/or LeanPub to publish it (LeanPub is its own platform, while D2D is its own and a hub to publish elsewhere). I think they both do a \"pay what you want\" model, too, as do others if those ones don't match your values.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brilliant_Shine2247",
            "body": "I write a lot about the homeless situation. There is a link to my Ko-fi page in my profile. Keeping with my distain of capitalism, everything is free to read. No exceptions. And if anyone wants a free copy of my 1st book, just hit me up with an email address and it's your's. \n\nStay true to your values!",
            "score": 34,
            "replies": []
        },
        {
            "author": "monkeywench",
            "body": "Insecure housing is used to keep the working class afraid. \n\nIf working class people stopped investing in their own retirement and instead invested (time, money, and other resources) into a society that didn’t require everyone to work or be born into wealth in order to have the very basics, then they’d take care of their own retirement/disability, their children’s and everyone else’s. ",
            "score": 30,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "This is so true. Like I say, I honestly believe that homelessness is a vital part of capitalism.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rethlor",
            "body": "Keep going comrade, you got this",
            "score": 12,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "One thing I've figured out over the last few years is that you'll never know how strong you really are until being strong is all you have left.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "LennyTheWeasel",
                            "body": "Bleak but true friend I hope things get better for you",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "I have no doubt they will. I appreciate the good words, comrade!",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "theunnameduser86",
            "body": "I’m lucky enough to be on unemployment until after spring ends. I don’t have much to give, but if you have a cash app or the like, then I’d be more then happy to send you something you can use to get a hot sandwich.",
            "score": 9,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "That's the kind of thing the rich hate to hear. \n\n\"I ain't got much, but I'm willing to share!\"",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Muted_Birthday5484",
                            "body": "Can I ask an honest question? If someone genuinely wanted to try to help you right now would there be a safe and practical way to get you something that might help your current situation that you can think of?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "I'm actually good as gold right now. I've got a new Cabela's tent and an Artic rated sleeping bag that I managed to snatch up today. Warm food in my belly. I can't ask for any more than that my friend.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Odd-Youth-452",
            "body": "Aizawa-sensei?",
            "score": 3,
            "replies": [
                {
                    "author": "Brilliant_Shine2247",
                    "body": "I don't know what that means. Sorry",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TentacledKangaroo",
                            "body": "It's a reference to a manga/anime called _My Hero Academia_. Aizawa, one of the teachers [is known for sleeping in a yellow sleeping bag, and in unconventional places](https://myheroacademia.fandom.com/wiki/Shota_Aizawa).",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Brilliant_Shine2247",
                                    "body": "Well shit, could be a long lost cousin of mine. Hahaha. \n\nI prefer to think of myself as David Carradine's character in the old show Kung Fu. Caine. Walking all over the wild West with nothing but a small bag and a mat to sleep on. Keeping the American west safe one kick at a time",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brilliant_Shine2247",
            "body": "Little snack bags with some cheese and crackers, maybe some type of Slim Jim's, tuna packs, of course any kind of chocolate, little packs of water flavoring/enhancers (they make little single use packs), small packs of Kleenex, cheese stick, etc.. \n\nI hear police like to use small patties of excretement at night in dark areas. That's why you, or anyone else, should never get all pissed off or judgemental if someone out here doesn't take your food, or takes it then throws it away. Would you take food from a perfect stranger when even the cops are known to put shit on bread and give them to the homeless? Not to mention all the allergies today. I remember once that this guy in Wilmington would get like 50 Little Caesars pizzas and hand them out at the library every Friday. I stuffed myself like a damn python one day and a guy came up and asked me if I wanted a bag lunch he was handing out and I said \"no\" and I really thought we were going to come to blows. There are many reasons why someone would turn it down",
            "score": 1,
            "replies": []
        }
    ]
}