{
    "title": "Is the \"subversive protest\" of Superbowl halftime show of any value?",
    "author": "barnabas77",
    "subreddit": "LateStageCapitalism",
    "rank": 21,
    "score": 434,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 170,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1imw16f/is_the_subversive_protest_of_superbowl_halftime/",
    "id": "1imw16f",
    "selftext": "TBH, I find the discussion around the subversiveness of Kendrick Lamar's performance and its critique of the US so irritating and distracting. People with a minimum of media literacy are celebrating this as the ultimate act of defiance. As if KL is leading a march on Washington when in reality all our asses are getting bread-and-circus'ed 24/7...\n\nI wrote this somewhere else but feel it is relevant for the point I am trying to make:\n\nYou get an idea how broken and rigged the outlets for legitimate opposition are, when you have people cheering a millionaire artist hiding subversive messages in the biggest \"panem et circenses\" spectacles of late capitalism. \n\nThe venues of protest, the \"potentiality space\" for true alternatives to the current system is already so severely limited that even this form of protest is seen as \"biting attack on the status quo\". It is not. It is an impressive cultural Trojan horse inside the fortress of hegemonic culture. But it reeks of couch activism that gives people the impression that \"finally someone said something\" without anyone having to do actual serious thinking about how and when to organise actual resistance against ... yes, what exactly?!? \n\nAgainst Trump and Tech-bro fascist blitzing over a country where over half of the population lost the ability of critical thinking to even understand what is happening? Or against the continuous stifling of discourse over true alternatives of a system whose inherently violent commodification of fucking everything and the destruction of our planet on the name of financial gains, growth and comfort is leaving people cheering for even minor, ultimately meaningless feats of protest?\n\nActual organising of communities on a regional level, re-building connections and exchange that is not virtual (and thus not controlled by exactly the kind of people who are destroying the country), unionizing, intersectional solidarity, these are some of the true goals that should be on our agenda. \n\nSo question: Is this actually the pinnacle of actual protest that can currently be mustered in the US? People on social media congratulating themselves  for finding (not so) hidden messages in a Superbowl halftime show? Will this lwad to tangible results? Or is it just the meme of the day that will be forgotten in a week or two: entertainment/art, slightly sprinkled with legitimate concerns about the deeper underlying problems of the status quo?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "lenivushood",
            "body": "I think that's a major issue is that people are obsessed with symbolism rather than actual change. It's easy to discuss and feel good as you really don't have to do anything. It's kind of like with Obama, people would go on and on about the symbolism of his victory rather than the actual facts of his administration.",
            "score": 375,
            "replies": [
                {
                    "author": "-98765411111",
                    "body": "Facts indicating he was a blood thirsty war criminal who fancied extra judicial murder and who also laid the groundwork for trumps border cages. ",
                    "score": 55,
                    "replies": []
                },
                {
                    "author": "Alexatypemypassword",
                    "body": "Agreed. It seems to be very American, although it's still a problem in Europe where I live. As an activist, in my experience it's really difficult to work with people coming from a symbolic, performative kind of activism, aka roaming on social medias arguing how some Netflix series actually saved feminism and insulting people disagreeing with them. When you work with them in real life, they are used to placate their own point of view on everything, because on social networks and in medias, you actually can cherrypick the contents going your way and you don't really have to make things work since you're only working with ideas anyway. As a result, they often split away, they spend significant chunks of time arguing even on irrelevant points, they underestimate the importance of organizing and they're satisfied with symbolic actions. I know many people start organizing partly because they've been moved by some symbolic event or fiction, and that's okay, but this whole obsession about performative activism is counterproductive, and as such I try to avoid speaking about it, even more to new activists, even though I'm knowledgeable about it.\n\nStill, I think it's important to be open about it, because if they're moved by symbolic actions, it means they've already started realizing something must be done. It can be the starting point for some activists, and our power is in number and organization, not in gatekeeping potential allies (not saying you are).",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "incogkneegrowth",
            "body": "The only radical person in that performance was the guy who flew the Sudan/Palestine flag.",
            "score": 219,
            "replies": [
                {
                    "author": "SuperHawkk",
                    "body": "Absolutely. And that’s why he was immediately tackled by security and removed. The powers that be recognized only his actions as a threat. He is a man with great strength in my eyes, and I’m in awe of his bravery to take such a public stand. We should all aim to be more like him.",
                    "score": 93,
                    "replies": [
                        {
                            "author": "Explorer_Entity",
                            "body": "This much glazing I'm like \"you must be that guy lol\". /jk",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Andro_Polymath",
                            "body": "Has anyone checked on that guy to make sure he hasn't been \"disappeared?\" That is where our movement fails: Shining a light on the brave people who are covertly *disappeared* for their resistance. ",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "fellowteenagers",
                                    "body": "I just watched a news interview of him from the yesterday/today (not sure), they said he got a lifetime ban from attending NFL games but nothing criminal was brought against him afaik",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Suttrees",
            "body": "Stop waiting for celebrities to do shit for us. They don't care, they are millionaires who only worry about your consume of their product. If it wasn't like that, they'd be speaking out and changing people's minds (they HAVE that power on the regular normie). Yet they decide to stay silent or do performative and useless shit because they also don't want to scare their conservative fanbase. \n\nBuild a community and educate your neighbors. The time will come when we don't need the elite to speak for us.",
            "score": 126,
            "replies": [
                {
                    "author": "SuckMyDickNBalls69",
                    "body": "Hell yeah.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "MouthyMishi",
                    "body": "That's literally what Kendrick was saying. He couldn't have made it clearer. Turn the TV off. Go meet with your people(community) and figure out how to take care of each other. He's also said he's not a savior. I'm not sure why people expected him to do more. He's literally doing what great artists do. He's getting people talking and thinking. That's the role of art in revolution, propaganda is a different beast so I'm not counting it. He could not have said more without repurcussions and right now he's more useful as a messenger than a political prisoner. He also laid out a whole blueprint of actions, specifically for the Black community that I won't be discussing in mixed company. AAVE is historically about doublespeak. It's how we managed over the centuries of living in an America that literally hates us so much they let this happen.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rogue_General",
            "body": "Well, it's quite literally performative and does next to nothing of real value but make libs feel better. \n\nAn actual protest is disruptive and uncomfortable to the ruling class. This ain't it.",
            "score": 292,
            "replies": [
                {
                    "author": "87StickUpKid",
                    "body": "Art can inspire action.",
                    "score": 108,
                    "replies": [
                        {
                            "author": "jiggjuggj0gg",
                            "body": "I truly don't understand why anyone thinks the entertainment act in the middle of a consumerism fest was ever going to be an actual protest.\n\nKendrick did what Kendrick does, which is hide political sentiment behind a thin veil of digestible entertainment. You can take the performance as a *wake up, you've been played and it's time to act,* or as a *Kendrick pwned Drake!*. That's the point. Nothing else was ever going to be shown on that kind of platform.\n\nThere's a reason he kept saying *turn the TV off.* Was he saying it to Drake, who he thought might tune in, because he lost the diss war? Or was he telling the biggest American TV audience of the year that they need to stop hoping someone else will sacrifice themselves first, while they sit around on their couches wondering why nobody is doing anything, with no real intention of sacrificing their comfortable life to stand behind them?\n\nI guess we'll never know.",
                            "score": 81,
                            "replies": [
                                {
                                    "author": "somniopus",
                                    "body": "👏👏",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Forgotlogin_0624",
                    "body": "I’d say that all protests are performative.  I think the idea with them is to create a spectacle that makes your cause visible to people, and allows people a space to connect with each other.\n\nThe problem is people have been conditioned to think that’s enough.  Not our fault, our schools, our parents, our media all said the same thing.  That if you get enough people believing the same thing a phase shift will occur.  They weren’t lying, not all of them, most of them believe that.\n\nProtests are a prelude to real work, things like what OP mentioned already, building capacity to then actually do things both through traditional electoral means, as well as more direct action like strikes and even more direct action that I won’t specify here.\n\nAnd we know that because that’s how it worked last time.  That’s also why we’ve been conditioned to forget that.\n\nSo I get annoyed at the libs too for trying to do a victory lap here, all you can do is remind them of history.",
                    "score": 65,
                    "replies": [
                        {
                            "author": "jiggjuggj0gg",
                            "body": "Yes, the idea of a protest has been so watered down that people think it means walking around holding a sign at the weekend.\n\nMarches started because they were a march *to* somewhere to do something more effective, or because everyone could get together on a picket line because they were on strike. \n\nReal protest requires sacrifice and disruption, which people are just not currently willing to undertake. The number of people who complained the protests last week were on a Wednesday when they had work was eye-opening. \n\nIt reminds me of the climate change discourse. Nobody wants their own life to change. They think someone else should do it. The government should pass legislation to impact 'the corporations', not understanding that a) any impact on 'the corporations' will be passed straight on to them as consumers anyway, and b) that they *have the power* to skip the middleman by just not consuming things they don't support, or consuming the things they do, until 'the corporation' is forced to change. As a very basic example the government didn't force companies to make or offer vegan milks, that came about entirely through consumer behavior; equally, no government is going to stop companies making plastic tat when everyone *keeps buying plastic tat.* \n\nIn exactly the same way, everyone seems to want 'the government' to step in, seemingly not realising that all the branches are being disintegrated and that the actual government does not agree with them. \n\nActual change requires understanding that some of your comfort might need to be sacrificed, but too few are willing to band together to make that sacrifice powerful enough. But even the tiniest sacrifices, like cancelling Amazon Prime and deleting Meta accounts, and not giving them your money and data, seems too far for most people.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "fourthjonas",
                                    "body": "we've been systemically insulated, atomized, and had our choices artificially constrained. focusing on individuals needing to do more, while not entirely invalid, misses the broader scope.\n\nwe need a unifying *positive* message. shaming people for participating in capitalism, or calling them unwilling to change, is also not a direction forward. those people \"complaining\" about not being able to attend a protest on a wednesday might be unable to make ends meet if they don't work. \n\nchange is harder than ever to stomach in a world governed by algorithms that show you content tailored toward your personal bubble. it also makes you less aware that you even have an alternative.\n\nboycotts & consumer pressure are not enough to stop the overproduction of plastic. how are we supposed to not buy plastic? all of our food, consumer electronics, basic household necessities, come with mountains of plastic packaging, and they do so because it's cheap and durable. alternatives are harder to find and often more expensive.\n\nsocial media & online shopping were sold to us as a way to bridge the gaps caused by a sprawling, suburbanizing pattern of development. at this point, they're deeply embedded into society. it's not easy for every single person to just cancel their facebook account if it's the only way to reach their rural relatives.\n\nattack the system, not the people within it.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 5,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SuckMyDickNBalls69",
                                                                    "body": "*high-fiving the fuck out of myself for not getting deleted*",
                                                                    "score": 20,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cnews97",
                                                                            "body": "Yeah wtf happened here lol",
                                                                            "score": 8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MarzipanMab",
                                                                                    "body": "I'm guessing it was the person arguing with me but using alt right playbook techniques such as goal posting, demanding exact language, etc cause all my comments while down voted violently appear to still be here",
                                                                                    "score": 9,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ChefMoToronto",
                                                                                            "body": "Keep fighting back. Only way we're gonna make a comeback.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -43,
                    "replies": [
                        {
                            "author": "ElliotNess",
                            "body": "Firstly, they always have their panties that way. Secondly, of what use is them having their panties that way to the revolution?",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -47,
                                    "replies": [
                                        {
                                            "author": "ItWillBeBarbarism",
                                            "body": "oh stfu you debate lord.",
                                            "score": 29,
                                            "replies": []
                                        },
                                        {
                                            "author": "ElliotNess",
                                            "body": "If you're gonna claim I said something, quote my words",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": -34,
                                                    "replies": [
                                                        {
                                                            "author": "ElliotNess",
                                                            "body": "Nothing in the parent comment says \"powers that be.\"\n\nIf you want to make an argument against someone's words, then quote those words. Don't just make shit up. (Further, the parent comment is nothing that I said. If you want to engage with what I said, do so. Don't rebut something that I never said, argue against a point that I never made, and think that you've done anything of value)",
                                                            "score": 19,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ElliotNess",
                                                                                            "body": "Have one yourself",
                                                                                            "score": 7,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "WAR_T0RN1226",
                                            "body": "\"the powers that be\" got upset in the same way they get upset by the stuff Fox News shows them. So basically a little culture war busy box for them to play with for a week until the next thing.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "nw342",
                            "body": "Sure, it pissed off the conservatives and trump a lot, but who cares about that? At the end of the day, trump is still the president, and is implementing project 2025 with little impediment. A halftime show isnt stopping that...",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "AudioSuede",
                                    "body": "So a protest has to fully stop the opposition to be valid or valuable? Bad news: Almost no protest has ever done that on its own. If this were the entirety of the resistence to Project 2025, sure, that would be bad. But no one anywhere has suggested that we stop here, or that we don't organize and take other actions because this one performance was enough. That's just a made-up argument",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "somniopus",
                                            "body": "Right? Like, I didn't realize it was KL's responsibility to fix fascism with one performance lol",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MarzipanMab",
                                    "body": "You know who tried to stop that? Black people. You know who didn't? Performative white people.",
                                    "score": -6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "verifiedkyle",
            "body": "The performance was performative. Correct. Very hot take.",
            "score": 51,
            "replies": []
        },
        {
            "author": "cubicwarbear",
            "body": "Kendrick literally started off the performance by saying something to the tune of \"the revolution will be televised, you've got the right time but the wrong guy.\" I think he was saying that we are ripe for some kind of change in the USA, but that we shouldn't hold him up as the person to usher it in. For a lack of better words, my read is that he was telling us to turn the TV off, go outside, and start building/organizing for a better world.",
            "score": 105,
            "replies": [
                {
                    "author": "kurtums",
                    "body": "Literally ends his performance with \"Turn the TV off.\" I think this take is spot on.",
                    "score": 68,
                    "replies": []
                },
                {
                    "author": "This_means_lore",
                    "body": "“The cat is out the bag/ I am not your savior”",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "addisonshinedown",
            "body": "Very confident we got as extreme of a protest as he was allowed to play.",
            "score": 50,
            "replies": []
        },
        {
            "author": "uglylittledogboy",
            "body": "Stop instigating leftist infighting with stuff like this.",
            "score": 27,
            "replies": [
                {
                    "author": "crustlin",
                    "body": "amen",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "dakunut",
            "body": "He’s an artist, who has repeatedly throughout his career advocated for revolution. Tpab is one of most revolutionary works of modern art today. What’d you want him to shoot Donald trump himself? Theory v. Praxis. His role as a revolutionary figure is cemented in the community and culture whether you think it’s valid or not. He is the continuation of a long line of Black progressive thinkers in this country. Marcus Garvey, Elijah Muhammad, James Baldwin, Malcom X, Tupac Shkaur, Kendrick Lamar. It’s up to you to educate yourself",
            "score": 62,
            "replies": [
                {
                    "author": "mymau5likeshouse",
                    "body": "Fucking thank you,\n\n I've been tearing through his discography since Sunday, and his bars are powerful and inspirational. listening to his soul made me feel moar optimistic and cheerful for a better future than anything in the past two months",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "AudioSuede",
            "body": "All resistance movements need cultural touchstones, like subversive art and music, to thrive. Performative resistence is still resistence. It's not like Kendrick Lamar can pass any laws, he's a cultural figure, and he used his platform to speak to the culture. I personally wished he'd been a bit more overt with his messaging, because I think what he did went over too many heads, but he presented a piece of distinctly black performance art laden with symbolism of rebellion in the middle of the largest televised spectacle in America every year, with Trump himself in attendance. At a time when a lot of people feel demoralized and overwhelmed, even performative protest can be uplifting. \n\nI think we need to get over this hatred for performative protests. They're not hurting the movement, they're a piece of it, and they can have a strong psychological impact on the people within the movement who need to see them. Obviously they shouldn't be the centerpiece of political resistence, but we'll never win without art to inspire us. Besides, I guarantee Kendrick's listens will spike this week, and much of his music is deeply politically conscious. New listeners being exposed to messaging which speaks to our causes is a net win for the movement. \n\nThere's a vein of leftist activism that dismisses art as being a lesser form of activism, discouraging those who use creative expression to voice their dissent. It's a foolish, self-defeating mindset. And yes, art is commodified in our society, so naturally profit is a part of most creative endeavors, especially at a scale and platform as large as this one. But labor is also commodified, and we wouldn't discourage people to leverage their labor to advance the movement through strikes or unionization, so that argument is specious.\n\nIf you didn't care for it, fine. But stop trying to tamp down any excitement within the movement this might generate, because we need that excitement to win.",
            "score": 27,
            "replies": []
        },
        {
            "author": "DariosDentist",
            "body": "I disagree - we haven't had any leaders outside of Bernie grilling RFK and few AOC tweets put up any resistance to this regime.\n\nWas it performative? Yes it was literally performative. But it was also the first time in the last month that we've seen any real resistance to Trump and the tech-bros. Will it inspire people to resist? Time will tell but at least it was one of our cultural leaders speaking up and people feeling something which is a lot more than anyone else has done not only within the last month but probably since the election.",
            "score": 68,
            "replies": [
                {
                    "author": "WAR_T0RN1226",
                    "body": "> But it was also the first time in the last month that we've seen any real resistance to Trump and the tech-bros\n\nWhat resistance was there to Trump and the tech bros?",
                    "score": 21,
                    "replies": [
                        {
                            "author": "jiggjuggj0gg",
                            "body": "The performance was telling everyone they've been played (*this is the American game,* 'WRONG WAY' lit up in the crowd, the entire thing being on a Playstation controller, *the right time but the wrong guy*), to stop believing government promises (*40 acres and a mule, this is more than the music*), to stop following the government's instructions, even though it could get violent (Uncle Sam spelling out the rules, when Kendrick breaks them, being told *you lose a life*), that even though the US is deeply divided (DNA performed while Kendrick splits the US flag in half) it's divided the wrong way (*they not like us*), and that you need to stop sitting on your couch waiting for someone else to do it all for you (*turn the TV off*) or you will lose the game (GAME OVER at the end).\n\nAll thinly disguised as some consumer-, advertiser-friendly \"lmao he just owned Drake!!\" if you disagree or don't want to pay attention.\n\nA rapper performing at the consumer event of the year is not going to be the guy to lead a revolution, but it's certainly not like he was ignoring what's happening or didn't have a strong message for people who want to listen.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "WAR_T0RN1226",
                                    "body": "Sounds to me like simply a through-line from some of the themes in TPAB and a huge stretch to call it *specifically* anti-Trump, Republican, tech bro, etc\n\nPeople calling it those things specifically reeks of libs trying to once again co-opt a message about larger institutions and culture and turn it into their own narrowly-focused, performative axe grinding session",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "dakunut",
                                            "body": "Dude what do you think TPAB was about???",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "barnabas77",
                    "body": "I am more than happy to be proven wrong and that this sparks anything. \n\n\nMaybe I am too jaded or too strongly rooted in action-oriented activisim but from the outside it doesn't look like anything but a blip on the meme-sphere that people rally behind for a week before being distracted by other stuff. \n\n\nKL doesn't strike me as a leader or rallying post for any kind of action (nor should he have to be). But exactly the fact that apart from Bernie, AOC and socially conscious rapper there don't seem to be distinct voices of protest, seems weird. ",
                    "score": -4,
                    "replies": [
                        {
                            "author": "DariosDentist",
                            "body": "If you were actually action-orientated then you would be putting your energy towards action not trying to clown people from behind a keyboard who felt inspired by a performance. Now you're trying to walk it back with this \"maybe I'm just jaded\" woe-is the leftist-me bullshit when you're just trying to divide the people who are inspired and coming together for this moment. \n\nKL isn't a leader for you. Fine. Being a leftist and resisting doesn't look the same for everyone. It doesn't mean you get to write a self-important diatribe dismissing people who  do see him as a cultural leader and did feel hope from his performance.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "EZMulahSniper",
                                    "body": "Kendrick has a whole song saying he’s not a savior",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "DariosDentist",
                                            "body": "Outside of untitled/unmastered I'm not a big Kendrick fan so I don't know the song, nor do I care about it - savior or not he has a role as an artist that he was clearly leaning into - even if was just for that moment.\n\nPeople have been scared shitless for the last few months and someone who inspires others stood up and gave a performance that meant something to some people. Can't we just be happy about that rather than critique and dismiss it to nothing?",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "MouthyMishi",
                                                    "body": "Not to mention Kendrick performing hopefully means more people listening to him. If you learn nothing else about that man, at the very least look at some of his direct action work as an example of how  to organize these things yourself in your neighborhood.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DinnerKind",
                    "body": "Saying AOC is just \"putting up tweets\" is really dismissive.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "DariosDentist",
                            "body": "I'm not trying to be dismissive so please don't derail the conversation with semantics - my point is that even our l eey few leaders who are drowned out in the maga noise couldn't break through the masses the way KMs performance did",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DinnerKind",
                                    "body": "I don't think it's semantics to point out that AOC is doing actual work, meanwhile leftist online are trying to figure out if a Superbowl halftime show is the call to action we've been waiting for.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "DariosDentist",
                                            "body": "Whatever works for you works for you and whatever works for everyone else works for them - I think it's allllll love.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "austinbucco",
            "body": "It’s been interesting to watch this performance be simultaneously overhyped and underhyped. It was a great performance with an overtly political message; it wasn’t anything more or less than that. It wasn’t a revolution or a protest, and it also wasn’t terrible and boring.\n\nKendrick is first and foremost an entertainer, and he mostly shrouds his messages in varying layers of symbolism and metaphors. He rarely comes out and directly says what he thinks about politics. He also views himself as being representative of the community he comes from, but not necessarily being a figurehead or leader of that community.",
            "score": 5,
            "replies": []
        },
        {
            "author": "tultamunille",
            "body": "Check yourself before you… \n\nHe said he’s not the guy, turn off the TV and not so subtly dissed the sitting POS. \n\nGreat Super Bowl show imo. One of the best. I don’t have a problem with music with a message.",
            "score": 6,
            "replies": []
        },
        {
            "author": "grepsockpuppet",
            "body": "You're right friend. You're taking the right approach - keep posting on Reddit. Keep up the great work!",
            "score": 33,
            "replies": [
                {
                    "author": "MarzipanMab",
                    "body": "Though in fairness, before the consolidation of all the social medias, internet organizing was a viable and valid form of organizing and protesting. It's just so badly compromised now, by design of course, that it is rendered nearly moot. Nearly but not entirely. However, think pieces like this are usually just for self fellation. They speak of things that can be done and then offer no resources for said things. Weird weird weird",
                    "score": 21,
                    "replies": [
                        {
                            "author": "SuckMyDickNBalls69",
                            "body": "Stop making sense. You missed the point by not doing the celebrity worship!",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "MarzipanMab",
                                    "body": "Whoops a doodle. Silly me. I can't help it. I'm just a girl :P",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "SuckMyDickNBalls69",
                                            "body": "Females can be just as powerful as men.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "grizzlybaroo",
                                                    "body": "Women! A men and females, in here??",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SuckMyDickNBalls69",
                    "body": "Cynicism and dope profile pics will set us free.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "MarzipanMab",
                    "body": "Ope",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MarzipanMab",
            "body": "Also, Kendrick is well known in his community for his efforts giving back to said community. So like, y'all just be talking to head yourself speak and it's almost always at the detriment of black folks. Work on that, yea?",
            "score": 25,
            "replies": [
                {
                    "author": "SuckMyDickNBalls69",
                    "body": "Links?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "MarzipanMab",
                            "body": "I think it would be far more beneficial for you to look into it yourself. Really do the work so you don't feel performative, ya know?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "SuckMyDickNBalls69",
                                    "body": "If we were together, I would hope you'd accept my hug. We're both struggling. I hope you understand that I'm on your side.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SuckMyDickNBalls69",
                                            "body": "but, defending a millionaire celebrity is wack AF",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SuckMyDickNBalls69",
                                    "body": "*note - no links, just anger.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "MarzipanMab",
                                            "body": "Remember those dog whistles I mentioned? Implying I'm angry for not acquiescing to your request is absolutely a racist and sexist dog whistle",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "MouthyMishi",
                                                    "body": "They always jump to the dog whistles. It's that old cliché but white leftists are always white first. We have to rememeber they don't know what real organizing looks like because most of them only have the watered down civil rights movement as a reference. We, on the other hand, have been doing shit like building community gardens cause we don't always have yards, we create orgs that help the formerly incarcerated find work cause it hits our communities so hard. The work is the work our parents and grandparents still tell us about. We got Loyalty, royalty inside our DNA.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "EZMulahSniper",
                            "body": "Google pgLang\n\nLiterally the first hit \n\nhttps://www.billboard.com/music/rb-hip-hop/kendrick-lamar-pop-out-donation-charities-los-angeles-1235720142/",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "shorteningofthewuwei",
            "body": "While his performance wasn't \"sufficient\" for an actual revolution, I think it's worth establishing as a baseline that within the history of African American music, it was definitely a watershed moment, as Kendrick Lamar was the first solo hip hop artist to headline one of the most televised moments of the year (and of all time). Now, again, while the performance can only ever be a performance, art still has a valuable role to play within the struggle for liberation from oppressive systems, even if art alone is not sufficient in terms of the organization required to provide meaningful alternatives to living under an oppressive system. \n\nWith that being said, everyone is free to interpret art as they choose, but I think that people who say stuff like \"he's just a rich guy pandering to rich people\" simply don't understand how personal the layers of social commentary and symbolism woven into the performance are to Kendrick. He has not forgotten his roots, and he used the half time show performance as an opportunity to say what he had to say in the way that I think was the most subversive that he was allowed to on that platform. \n\nThink about it this way. Has any other super bowl halftime show sparked so much debate? Symbolically representing the divisions that polarize American culture, society and politics under late stage capitalism doesn't magically solve those problems, but at the very least it gets people talking about them. I think that if you can't acknowledge the artistic feat involved in pulling that off, it's your loss.",
            "score": 10,
            "replies": []
        },
        {
            "author": "MarzipanMab",
            "body": "The show was for Black people. That's why you don't get it and that's fine but to devalue it because you don't understand it is kind of wack.",
            "score": 46,
            "replies": [
                {
                    "author": "MrTambourineSi",
                    "body": "I'm all for massive change, protest and as much disruption as possible but not everyone can do that and not everything will be like that. I feel like a big issue of the left is that it's too easy for us to tell you what's not good and that something doesn't work but rarely offers any viable solution. The average person feels deflated, they don't have a ton of energy and they get told what they do or don't do isn't good enough still.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "MarzipanMab",
                            "body": "I genuinely feel like posts like this are strictly to sow further dissent between the groups that should be coming together because who has the right to say that ANY form of resistance is wrong. We have no idea who this show might inspire to move. It all starts with a pebble but everyone wants to act like they are a boulder all the time.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "MrTambourineSi",
                                    "body": "100% disharmony and chaos are perfect for the right",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MarzipanMab",
                    "body": "Down voting me because I am acknowledging that Kendrick is and has always been a rallying cry specifically for black Americans is also pretty wack. Again, just because YOU don't understand the significance of this kind of protest doesn't make it any less valuable. As the most disenfranchised minority group it's nice to have someone talk directly to us in our language who understands and is so deeply emeshed in the culture. Black joy and excellence is absolutely a viable form of resistance. Further more, we need to not act like music and art isn't a huge part of revolution as well. It can't all be destruction. There must be creation but art is always devalued when it comes from black American hands. We have single handedly built every significant cultural aspect of America to have it stolen from us since time immemorial and the second we reclaim any of it, it's a problem. Work on deconstructing your proximity to whiteness and maybe talk to the people it impacts about why it's important",
                    "score": 40,
                    "replies": [
                        {
                            "author": "SuckMyDickNBalls69",
                            "body": "Power allows performative protest.\n\nWhatever \"message\" was allowed on purpose.\n\nedit = double statement removed",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "MarzipanMab",
                                    "body": "Perhaps on the surface but once again, this was very specifically for black people. There are elements of it you cannot ever understand without being incredibly in touch with the culture which, surprise surprise, incredibly few Americans are even among the Black Americans. This performance is going to be dissected for months and possibly even years to come. What's the opposite of a racist dog whistle? Whatever that is, it was full of that. If you didn't hear, it wasn't for your ears and that was the point.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SuckMyDickNBalls69",
                                            "body": "Sucks you want to make it about race and not class.\n\nAgain, this was *allowed*.",
                                            "score": -15,
                                            "replies": [
                                                {
                                                    "author": "MarzipanMab",
                                                    "body": "Sucks that you refuse to acknowledge how both can be true.",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "SuckMyDickNBalls69",
                                                            "body": "To focus on race and not consider class in *this* subreddit?",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "jiggjuggj0gg",
                                                                    "body": "Sorry but to not realise the irony of your statement is wild.\n\nRace is an incredibly important part of America, including *within* class division.\n\nThere is also a huge sentiment amongst black Americans at the moment that they're sick of being cannon fodder and being expected to be the first to make moves when they are the most at risk of state violence, and are already in the crosshairs of this administration.\n\nBlack Americans have stood up time and time again, and white Americans only seem to follow when it's big enough for them to slip into the crowd. \n\nTelling them to ignore race and focus on class when that sentiment has never been extended to them is quite something.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MouthyMishi",
                                                    "body": "They allowed us to sing in the fields too. We have created so much slang and so many genres to make sure we can talk to each other across vast distances.  Just because y'all started rapping, doesn't mean you understood hip hop which was always rooted in Black conscious thought. Musical protest is Black History. It's February you'd do well to learn some.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SuckMyDickNBalls69",
                                            "body": "How's come only special black people can intercept this special message that us, non-blacks can't comprehend?",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "MarzipanMab",
                                                    "body": "Because you don't engage with the culture. Period.",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "somniopus",
                                                    "body": "You have to take your fingers out of your smug ears first",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MouthyMishi",
                                    "body": "Slave spirituals were a means of planning escape without white enslavers catching on. Hiding messages in music is Black AF. It's ok that you don't get it the other thing about Not Like Us is making sure we understand who's working with us and who's an op.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConundrumMachine",
            "body": "We are nearing peak circus. I think the only thing that'll work is spectacle. Persistent, impossible to ignore spectacle.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Azisan86",
            "body": "Whenever you speak up, you inspire others to do the same.",
            "score": 5,
            "replies": [
                {
                    "author": "CMarieDalliance",
                    "body": "Yes, but words are not adequate to the task at hand.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Azisan86",
                            "body": "Yes, but words inspire action.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "CMarieDalliance",
                                    "body": "Not near often enough",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Azisan86",
                                            "body": "Absolutely, but something is better than nothing.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "CMarieDalliance",
                                                    "body": "Spectacle can be worse than silence",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Azisan86",
                                                            "body": "Yes, but not this time.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "CMarieDalliance",
                                                                    "body": "Remains to be seen",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "crustlin",
            "body": "It's not like it was an anti capitalist performance, but I think it was a pretty important form of resistance against a growing culture of white supremacy. Black Abe Lincoln! Serena Williams crip walking! Damn. I see your point, but there's also room for more intersectionality. No resistance against the empire without resistance against white supremacy.",
            "score": 5,
            "replies": []
        },
        {
            "author": "TheAngryXennial",
            "body": "No it didn’t just rich people singing to the choir of other rich people",
            "score": 23,
            "replies": [
                {
                    "author": "paokca",
                    "body": "I do trust Kendrick Lamar “gets it.” I think.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "rzenni",
            "body": "Politics is and always has been downstream for culture.  Conservatives understand that and have been very good at using culture wars to push their agendas.\n\nIs one half time performance as effective as 20 years of Sean Hannity in prime time?  No, but we have to start somewhere.",
            "score": 21,
            "replies": [
                {
                    "author": "H_E_Pennypacker",
                    "body": "Start somewhere? A decade ago we had Colin Kapernick causing actual controversy by protesting the national Anthem. It arguably cost him his career. That was starting somewhere.\n\nSunday night we had Kendrick Lamar getting paid millions for doing 4 of his regular songs with the regular lyrics. Nothing more. We have gone backwards. What did you take away from the performance as being subversive?",
                    "score": 21,
                    "replies": [
                        {
                            "author": "rzenni",
                            "body": "Super Bowl performers don’t get paid.   They get scale and expenses only.\n\nThe past performers are billionaire Rihanna, inauguration Snoop Dogg, Justin Timberlake, and Maroon 5.\n\nWho would you prefer?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "H_E_Pennypacker",
                                    "body": " Going off-script and making an actual statement about how fucked up things are in the US until security pulls him off stage would be actually subversive. Someone just doing their regular shit that everyone expected is not subversive.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BrightestofLights",
                            "body": "It wasn't the regular lyrics tho",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "H_E_Pennypacker",
                                    "body": "What was it? I missed it",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "BrightestofLights",
                                            "body": "It's mostly between every song,\nLike \"40 acres and a mule this is more than just the music\"\n\nWhich I'm doing off memory, but 40 acres and a mule were promised to freed slaves and never given.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "H_E_Pennypacker",
                                                    "body": "Then it should have been less coded and more overt, people had no idea",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "blacbird",
                                                            "body": "What people had no idea? White people? Every black person in the US knows what 40 acres & a mule is about. White people should too if they have any education about slavery.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SuckMyDickNBalls69",
            "body": "Power allows spectacle.",
            "score": 3,
            "replies": []
        },
        {
            "author": "FormerLawfulness6",
            "body": "I think this leans into the \"great man theory\" of history. We shouldn't be looking to celebrities for guidance. If you're already personally invested, you probably won't be looking to them for inspiration either. That doesn't mean something like the halftime show is worthless, as if it would make no difference if they had some jingoistic ballad for empire instead. \n\nNo single action is going to be the pinnacle of the movement. We need every tool we can get. Big flashy art pieces have their place. Peaceful protest has a place. Malicious compliance, resistance, mutual aid. All of it. \nUnwinding empire is a slow process that takes all of us.\n\n The halftime show isn't stopping anyone from using the other tools at our disposal. Use it as a conversation starter if it suits you. But the only way to address media literacy is to get people talking about what aet means. Even if it's just a silly halftime show.",
            "score": 7,
            "replies": []
        },
        {
            "author": "wryan4",
            "body": "Kendrick made an entire song about this (savior)\n\n“Kendrick made you think about it, be he is not your savior”\n\nAlso from that song: “capitalists posing as compassionate be offending me”",
            "score": 6,
            "replies": []
        },
        {
            "author": "Doorbo",
            "body": "What does it matter? It happened, and some people found it inspiring. Those folks are the ones we should be exposing to further propaganda. If we think the show was performative and useless, then turn the results into something useful.",
            "score": 8,
            "replies": []
        },
        {
            "author": "memisbemus42069",
            "body": "Nobody is actually going to do anything until they start starving. As long as there is something to be lost, people will never revolt",
            "score": 2,
            "replies": []
        },
        {
            "author": "tummateooftime",
            "body": "I think Kendricks performance was perfectly fine. At the end of the day hes still a performer with a career and he doesnt want to jeopardize it.  \n  \nAt the beginning of the performance he says \"The revolution will be televized, right time, wrong guy\". Implying that he's not the guy for the job, but its the time for a movement",
            "score": 4,
            "replies": []
        },
        {
            "author": "DtownHero17",
            "body": "Kendrick fans, man. They do this with his lyrics, too. Creating 20,000 meanings to make them feel good at night whilst nothing is groundbreaking or changing. He performed at a SB, the height of the Capitalist performative stage, powers that be okayed this and people think they are hurt?",
            "score": 5,
            "replies": [
                {
                    "author": "hugz4jesus",
                    "body": "If his performance helped a few more people to get inspired enough to start organising, and learning theory, then its a good thing. Stop this miserable whining man. Let people enjoy things. If you are a black person in america it probably felt like a triumph.\n\n\nHell, as a hiphop fan I just loved him calling Drake a pedophile while grinning to the camera.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "billsamuels",
            "body": "If Kendrick was a real threat he'd by dead by now. Read: MLK, Malcom, Pac, even Kevin Samuels.",
            "score": 5,
            "replies": []
        },
        {
            "author": "astropelican",
            "body": "Americans have lost the plot completely. Their outrage is as performative as the phony sports games they follow and the crooked / predatory celebrities they worship. Rome needs to fall. It’s the only way out.",
            "score": 3,
            "replies": []
        },
        {
            "author": "xrty2357",
            "body": "To me it seemed like a powerful protest without a call to arms, which is basically what we have on here everyday.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Scared-Marketing995",
            "body": "US libs like their symbolism but nothing that goes further than that. For what it’s worth I thought it was a good performance, nothing more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JimDa5is",
            "body": "\"It is an impressive cultural Trojan horse inside the fortress of hegemonic culture.\"\n\nCompanere, you win the \"Most Beautifully Written Passage on Reddit\" for today and since we all know that everything in  Amerika has to be a fucking competition that means you're better than us somehow :) Truly, though, that was lovely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Your post was removed because it contained a sexist term. You should receive a message from the automoderator telling you the exact term the post was removed for. For more information, see [this link](https://weeklysift.com/2015/06/29/slurs-who-can-say-them-when-and-why/). **Avoiding slurs takes little effort, and asking us to get rid of the filter rather than making that minimum effort is a good way to get banned. Do not attempt to circumvent the filter with creative spelling; circumventing the filter will result in a permaban.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dazzling_Drop_835",
                    "body": "Thank you for making this post. I thought I was losing it. If KL went up and said “no one buy Coca Cola until Palestine is free” THAT would have been revolutionary. But no…he made … an American flag out of black people 😭 ?? Like what does that do for the world other than give simpletons something to be impressed by.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpiralEver",
            "body": "Yes. So little has value. That had some.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrHall",
            "body": "i guess it's better than not doing it? i'm not sure it helped be it's better than kid rock",
            "score": 0,
            "replies": []
        },
        {
            "author": "Comosellamark",
            "body": "Thanks for saying this, your words feel sobering. I’m tired of seeing all the dick riding for what amounts to capitalism’s big night. \n\nI love Kendrick Lamar as an artist, but I felt nothing while watching the halftime show. Why would I?",
            "score": 1,
            "replies": []
        },
        {
            "author": "nike_storm",
            "body": "Thought it was pretty lame to say \"the revolution will be televised\" for OP's exact reasoning. How is it a revolution if we're all (presumably) at home stuffing ourselves lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "ragepanda1960",
            "body": "Just another system of control baby. That's what the circus always is.",
            "score": 2,
            "replies": []
        },
        {
            "author": "WaferLongjumping6509",
            "body": "It was cute at best in terms of being “subversive protest.” I honestly had my hopes up that it was going to wildly overt and aggressive.  For some reason.  It would’ve been a nice strong/visible platform to make a real statement ya know?",
            "score": 2,
            "replies": []
        },
        {
            "author": "insomniacinsanity",
            "body": "Honestly I think there is very much a place for art as protest, Kendrick Lamar is an artist at the top of his game and he was given power and a platform and he did not disappoint \n\nArt matters, why do you think Trump wants  to control the Kennedy center, why do you think dictators squash the arts??\n\nhe made people start talking and he didn't bow to those in power who were likely expecting a very different show, like all good art he left room for interpretations, we've become so used to media telling us the answers instead of actually thinking about them , I don't think that makes it ineffective it's just not something people are used to doing anymore, stretch your brain a little \n\nDo I think art alone is enough, nope absolutely not, people are going to have to make sacrifices and put bodies on the line but I think you probably underestimate the strength and courage it took to put on a show like that in front of the president, and  within an organization like the NFL, I think he was brave and brilliant and it  certainly counts for something",
            "score": 1,
            "replies": []
        },
        {
            "author": "whitisthat",
            "body": "Do you live in America/are you American?",
            "score": 1,
            "replies": []
        },
        {
            "author": "theycallmewinning",
            "body": "The Right acknowledges \"politics is downstream of culture.\" That's a direct quote from Andrew Breitbart, a conservative blogger and ancestral figure for many of the figures we are now suffering under here in the US.\n\nThat isn't a direct, immediate relationship - one needs to build institutions around culture, to implement culture in the social and material world of laws and rules and behaviors.\n\nWe are, I think, in a moment when the cultural renovations and moral regimes developed in the 1960s (the Black, Indigenous, and immigrant challenges to America's assumption of righteousness, and the white backlash to them) are reaching their apogee \n\nThe institutions that hold them haven't quite locked in yet. That's for us to finish. \n\nAs a Californian raised on hip-hop, I enjoy Kendrick immensely and I think ther presenting it at the Super Bowl (the same way we did Eminem and Snoop and such( (is a reflection that were what the culture's *feeling* - but I am hungry for action, for a social order that reflects that cultural one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capital-Cricket-9379",
            "body": "Hey cool, you know some big words. Your point is reasonable, but you write like a pompous ass whose entire phd wannabe persona hinges on convincing people how much smarter than everyone else you are. Talking at people like this is exactly why the ones you need to connect with most will never be interested in what you have to say. Spend some time connecting w real people instead of right-clicking 'thesaurus' and then maybe you'll actually affect some of the change you desire. Your reddit posts aren't going to save the world.",
            "score": 0,
            "replies": [
                {
                    "author": "brianofblades",
                    "body": "go to therapy",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Explorer_Entity",
            "body": "Everyone in my county muted the halftime show and did other things... cause black people/rappers. Pretty fucked up, I know. Legit everybody watched the game, and I know at least 3 households that did this, and everybody is on FB talking about the game, but nobody cares about the HT show. California, USA btw.\n\nI avoided the entire thing... cause I dislike football/sports/consumerism, and it all seems so fake, like scripted for betting, like WWE, Boxing, whatever.\n\nAlso just the sound of sports games in general triggers my panic attacks. Constant screaming crowds, and annoying af \"commentators\" ignoring the game and rambling NON-STOP about nonsense, like some athlete playing college ball back in the 80s. like jfc...\n\nIt truly is \"bread and circuses\", and nothing that matters.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Dazzling_Drop_835",
            "body": "Thank you for making this post. I thought I was losing it. If KL went up and said “no one buy Coca Cola until Palestine is free” THAT would have been revolutionary. But no…he made … an American flag out of black people 😭 ?? Like what does that do for the world other than give simpletons something to be impressed by… not to mention the performance was paid and approved for by just about every major corporation in America, since they all sponsor the Super Bowl. Makes u wonder.",
            "score": -2,
            "replies": []
        },
        {
            "author": "kentonalam",
            "body": "no, it has no value. Period.",
            "score": -2,
            "replies": []
        },
        {
            "author": "QuislingX",
            "body": "I'm being told in another thread how \"political\" the, hold on let me check my notes... Performance of the top 5 trending Kendrick songs on Apple iTunes at the super bowl, was ackshually very important and symbolic!",
            "score": -4,
            "replies": []
        },
        {
            "author": "Nivek656",
            "body": "No. It’s liberalism and therefore nonsense.",
            "score": -3,
            "replies": []
        }
    ]
}