{
    "title": "Thoughts on calls to impeach the federal judge who blocked DOGE's Treasury access?",
    "author": "TreeLicker51",
    "subreddit": "AskTrumpSupporters",
    "rank": 124,
    "score": 92,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 165,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1im6uiu/thoughts_on_calls_to_impeach_the_federal_judge/",
    "id": "1im6uiu",
    "selftext": "Musk, and other Trump supporters, think that the federal judge who temporarily blocked DOGE's access to the Treasury should be impeached: [https://www.cnbc.com/2025/02/09/musk-calls-to-impeach-judge-whose-order-blocks-doge-from-treasury-systems-access.html](https://www.cnbc.com/2025/02/09/musk-calls-to-impeach-judge-whose-order-blocks-doge-from-treasury-systems-access.html)\n\nI'm curious about your thoughts on a few matters:\n\n(1) First and foremost, do you agree or disagree that the judge should be impeached?\n\n(2) What is your understanding of the legal basis for impeachment? Does the judge's decision to temporarily block DOGE's access to the Treasury meet that requirement?\n\n(3) And finally, does impeaching a federal judge for a ruling serve a purpose that isn't already provided for by the appeals process? If so, what is that purpose?\n\n**Edited bonus questions:**\n\n(4) It seems like  lot of Trump Supporters feel the judge should be impeached. If impeachment failed, would you support prosecution of the judge by the DOJ, assuming they had the time and resources?\n\n(5) If yes to 4, what should be the crime and punishment faced by the judge?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "Honestly, while I don't agree with the ruling we're talking about here, I don't think it is worthy of impeachment.  I just think it was a ruling I disagree with.",
            "score": 3,
            "replies": []
        },
        {
            "author": "UnderProtest2020",
            "body": "I didn't know judges could be impeached, so I won't claim to know what I'm talking about there. I would like to ask though why Trump shouldn't have access to Treasury Department documents, considering the Treasury Department falls under the purview of the Executive Branch which Trump heads.",
            "score": 1,
            "replies": [
                {
                    "author": "JackOLanternReindeer",
                    "body": "Where does this order say Trump himself cant have access? Also this order was amended to clarify that acting secretary of the treasury can access the information simply not DOGE until further review of the legality of it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "JoeCensored",
            "body": "The TRO expires in 3 days.   No point as far as moving things along.   \n\nA TRO at 1AM without giving government council an opportunity to respond, seems fishy and unusual at minimum.   \n\nThe judge had only become the emergency judge to respond an hour earlier, so had crafted the TRO before he even had any responsibility for the case.  Writing a TRO before you even have the case before you, I wouldn't be surprised if that violated some kind of ethics rule.",
            "score": -26,
            "replies": [
                {
                    "author": "hypermodernvoid",
                    "body": "For me, it's more about the overall messaging, per JD Vance and similar, by stepping right up to the line of suggesting: \"Trump can just ignore the courts\" recently, and Trump's attempts by executive action to do things only Congress itself is supposed to be able to do, per the Constitution. Conservatives already have a Supreme Court supermajority, so it's surprising to see so much whining already about temporary freezes from lower courts, etc., but regardless, don't we all want to still live in a democracy where there's rule of law, and the three (intentionally) *co-equal* branches retain their powers per the Constitution? I know I do.\n\nI have my qualms for sure with modern leftism, same for conservatism, and the kind of echo-chamber, tribalistic division that is pushing people away from the reality a majority of Americans agree on plenty of things (sometime differing on the paths to get there, but still), but my main opposition by far to Trumpism is with what is a clear disrespect for the Constitutional order. JD Vance, et al., per the Constitution - something him and Trump both swore to uphold is *dead wrong* trying to suggest Trump can just ignore court orders/judges - do we all at least agree on that, regardless of where we fall politically? I also know I do.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "TopGrand9802",
                            "body": "What were your thoughts on Biden ignoring multiple rulings over the student loan playoffs?",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "hypermodernvoid",
                                    "body": "My thoughts are that he didn't do that at all, because after the 6-3 conservative SCOTUS ruled against him, he immediately shelved his much more ambitious plans to forgive $10/$20k of student loan debt per borrower. He *did* continue an attempt at some forgiveness with a very watered down program that's known [known as SAVE, ](https://studentaid.gov/announcements-events/save-plan)which basically is supposed to allow lower and middle income borrowers to make a certain amount of minimum payments over a certain amount of years, and even if they didn't meet the total the rest of the loan(s) would then be forgiven.\n\nSAVE was of course also immediately challenged in court - AFAIK it just hasn't reached the SCOTUS again, where it maybe (probably, honestly) will even be overturned, in favor of students paying the total outright on outrageously high-interest loans sold to them before their brains were fully developed after having \"you'll be a failure if you don't go to college\" drummed in their heads.\n\nWere you aware of either of those facts, and the context? Biden didn't ignore the courts at all - he went from attempting to straight up writing off $10 to 20k of loan debt for each borrower, to a much weaker program requiring tons of payments for a hope of some small forgiveness, once the SCOTUS ruled against him, knowing full well that program could be challenged up to SCOTUS again (and it is, currently).\n\nAlso, did any judge rule Biden was in contempt of any court by continuing with that watered down program? No, and so do you see the difference between all this and outright ignoring court order(s)? Especially when taking actions the Constitution explicitly states only the Congress can?",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PCBName",
                    "body": "> I wouldn't be surprised if that violated some kind of ethics rule.\n\nIs that something that matters to you? Should we expect our government officials to follow ethics rules?",
                    "score": 43,
                    "replies": [
                        {
                            "author": "JoeCensored",
                            "body": "Courts following their own ethics rules is something everyone should expect.   Breaking ethics rules whenever the case involves big bad orange man violates 14th amendment equal protection.",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "PCBName",
                                    "body": "Gotcha. Ethics rules are important and we should expect officials to follow them. Look forward to seeing that applied across the board soon. Thanks!?",
                                    "score": 58,
                                    "replies": [
                                        {
                                            "author": "TopGrand9802",
                                            "body": "We've been looking for the law to be followed by both sides forever. That would include Biden ignoring multiple rulings against forgiving student debt.\n\nGuess we'll see how this goes after it's actually gone through the courts.",
                                            "score": -11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Cardboardlion",
                                    "body": "I'm a lawyer who litigates federally and has clerked for a Judge. No ethics rules related to that, how would you even distill that as a rule? Feel free to actually take a look at the ethical rules that bind the legal profession if you wanted to get an idea of how those rules are formulated. \n\nAs to the TRO itself, highly unlikely the Judge drafted the TRO, a clerk likely did it for them and the Judge merely edited. That aside, you can draft a TRO in minutes. When you're presented with a narrow legal issue, an hour is plenty of time to decide and issue a TRO.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "congeal",
                    "body": "The plaintiffs likely had a copy of their TRO for the judge to sign. That's how stuff like this often happens. Plaintiffs may have even filed that TRO beforehand, did you check?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Real_Etto",
            "body": "If a judge are making rulings past on politics instead of rule of law then they should not be a judge. It is really that simple. If he is willing to make this ruling on the president then want rulings is he making on every day citizens that have no recourse. He and everyone like him no matter right or left should be removed. We need to get back to rulings based on the Constitution.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Owbutter",
            "body": "1) Yes.\n2) It's the only remedy in this case because:\n3) My understanding is that this judgement can't be appealed. It's a TRO, and makes it a waiting game on the judiciary.\n\nAnswer this for me though, because the NTS keep evading the question... What purpose does it serve to block the legally appointed head of the Treasury Department from accessing the records too?\n\nTo those of you misinterpreting what I stated:\n[The Trump administration said that a judge’s order blocking Elon Musk’s government efficiency team from accessing Treasury Department payment systems wrongfully prevents Treasury Secretary Scott Bessent from doing his job, adding a new wrinkle to a fight over the handling of the sensitive payment data.](https://www.msn.com/en-us/money/other/doge-treasury-data-block-wrongfully-limits-bessent-doj-says/ar-AA1yLxPN)\n\nScott Bessent is the Secretary of the Treasury and he was denied access by this TRO. Keep evading.\n\nEdit: It seems that the judge clarified that it doesn't apply to Scott Bessent and I therefore retract my previous statements. I don't support impeaching the judge.\n\nhttps://www.reuters.com/legal/order-blocking-musks-doge-treasury-systems-doesnt-apply-bessent-judge-says-2025-02-11/",
            "score": -30,
            "replies": [
                {
                    "author": "howmanyones",
                    "body": "Just to clarify, when you say legally appointed head of Treasury Department, are you referring to Scott Bessent? Does he not have access?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Owbutter",
                            "body": "The order included Scott Bessent. I would assume that means he doesn't have access.",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "Heffe3737",
                                    "body": "Have you actually read the order, or are you just reiterating the claim made by the defendants in this court order/the pundits? Bessent himself is fine to access the treasury - he just can’t “grant access” to anyone as a “special appointment”, and neither can trump.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Owbutter",
                                            "body": "I mean I linked an article from Bloomberg that stated he (Bessent) didn't have access. Feel free to provide a counterpoint.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Heffe3737",
                                                    "body": "Would you consider reading the order itself? Because it pretty clearly only applies to special appointments. \n\nhttps://fingfx.thomsonreuters.com/gfx/legaldocs/myvmbzdenpr/02082025doge_order.pdf",
                                                    "score": 19,
                                                    "replies": [
                                                        {
                                                            "author": "Owbutter",
                                                            "body": "> Defendants: DONALD J. TRUMP, IN HIS OFFICIAL CAPACITY AS PRESIDENT OF THE UNITED STATES; U.S. DEPARTMENT OF THE TREASURY; and SCOTT \r\nBESSENT, IN HIS OFFICIAL CAPACITY AS SECRETARY OF U.S. DEPARTMENT OF THE TREASURY\r\n\n> ORDERS that, sufficient reason having been shown therefor, pending the hearing of the States’ application for a preliminary injunction, pursuant to Rule 65 of the Federal Rules of Civil Procedure, the defendants are (i) restrained from granting access to any Treasury Department payment record, payment systems, or any other data systems maintained by the Treasury Department containing personally identifiable information and/or confidential financial information of payees, other than to civil servants with a need for access to perform their job duties within the Bureau of Fiscal Services who have passed all background checks and security clearances and taken all information security training called for in federal statutes and Treasury Department regulations; (ii) restrained from granting access to all **political appointees**, special government employees, and government employees detailed from an agency outside the Treasury Department, to any Treasury Department payment record, payment systems, or any other data systems maintained by the Treasury Department containing personally identifiable information and/or confidential financial information of payees; and (iii) ordered to direct any person prohibited above from having access to such information, records and systems but who has had access to such information, records, and systems since January 20, 2025, to immediately destroy any and all copies of material downloaded from the Treasury Department’s records and systems, if any\n\nLet me ask you, is Scott Bessent a political appointee? Because it pretty clearly applies to him.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "Heffe3737",
                                                                    "body": "Why dont you think Bessent is specifically excluded from the bolded verbiage, given the earlier wording of “the defendants”? In other words, why didn’t you also bold the part that says “…the defendants are” at the start of that bolded section? In full context, the passage reads:\n\n“The defendants are (ii) restrained from granting access to all political appointees, special government employees,…” \n\nThis seems like the defendant’s lawyers are splitting hairs against the intent of the order, simply because they don’t want to abide by the ruling, no?",
                                                                    "score": 12,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "Owbutter",
                                                            "body": "I have read the order. Is Scott Bessent a political appointee?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 12,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Owbutter",
                                                                            "body": "Source: https://fingfx.thomsonreuters.com/gfx/legaldocs/myvmbzdenpr/02082025doge_order.pdf\n\n> restrained from granting access to all political appointees, special \r government employees, and government employees detailed from an agency outside the Treasury Department, to any Treasury Department payment record, payment systems, or any other data systems maintained by the Treasury Department containing personally identifiable information and/or confidential financial information of payees\n\nDoes the above apply to political appointees? Does the order make exceptions for them?",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[removed]",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Owbutter",
                                                                                            "body": "Yes, I quoted it.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "[removed]",
                                                                                                    "score": 7,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Owbutter",
                                                                                                            "body": "There is no exception that I see. He's a political appointee, it's explicitly stated that political appointees are restricted from having access.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "None",
                                                                                                                    "body": "[removed]",
                                                                                                                    "score": 5,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Owbutter",
                                                                                                                            "body": "Yes.\n\n>government employees detailed **from an agency outside the Treasury Department**.\n\nHe is not a government employee in this sense, and it explicitly states political appointees. A political appointee would never be detailed to another agency.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "None",
                                                                                                                                    "body": "[removed]",
                                                                                                                                    "score": 5,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Owbutter",
                                                                                                                                            "body": ">government employees detailed **from an agency outside the Treasury Department**.\n\nI think you're being honest with our disagreement, I appreciate that. In my opinion (and I'm not a lawyer but I have been trained in legal reading in contract disputes) is that the exception is only for employees of the department, I.E. members of the civil service. The Secretary of the Treasury is a part of the Treasury Department but is also a named class (political appointee) that is bound by the order. There is no exception for him, in my opinion.\n\nI've stated my opinion on this, I'm sorry but I'm not going to debate this point further.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "howmanyones",
                                                                    "body": "It seems that this game of semantics is irrelevant unless he is actively being blocked. Is Scott Bessent explicitly saying he does not have access?",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Owbutter",
                                                                            "body": "I don't know, none of us do but the DoJ seems to think so and they're the highest law in the land. So let's pretend for a moment that it's true. Is blocking the legally appointed head of an agency from viewing the data needed for them to do their job appropriate?",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "KhadSajuuk",
                                                                                    "body": ">DoJ seems to think so and they're the highest law in the land. \n\nIs there a particular reason you assume this to be the case? The Judiciary--as defined by its powers granted to it by the constitution--is to purposefully act as a check on the powers of the Executive, which the DOJ falls under. This makes the courts' rulings on this crisis the highest \"law\" next to that of the Supreme Court.\n\nIt is perfectly within the Judiciary's purview to check actions performed by the Executive and determine whether they are legal or illegal.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Owbutter",
                                                                                            "body": ">The Judiciary--as defined by its powers granted to it by the constitution--is to purposefully act as a check on the powers of the Executive, which the DOJ falls under.\n\nIs there a particular reason you assume this to be the case? The three branches of government are co-equal, each balancing the others. Is there a particular reason that you took my quote out of context, which was the DoJ's analysis of the judge's TRO, to imply that it took something from the judicial branch?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "howmanyones",
                                                                                    "body": "I think I'd rather wait for some sort of proof that what you say is happening before commenting on a hypothetical?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Owbutter",
                                                                                            "body": "It recently came out that the judge clarified their order and stated that it didn't include Scott Bessent, I updated my original post to reflect this, but it was downvoted into oblivion and needs to be opened.\n\nI'm not trying to be snarky at all and if what I say sounds like it is, I apologize in advance. There is a lot of FUD on both sides right now, there's a lot of things going on that make it hard to track what's actually going on. So most things on social media are hypothetical and play on people's worst fears.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "BoppedKim",
                                                                                                    "body": "Will this clarification change the way you interpret future decisions? If so, how?",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "KhaleesiSenju",
                                                                                                    "body": "I read your replies and unless I misunderstand you, are you NOT reading that the order said that Scott Bassent and Trump just were barred from GRANTING ANYONE ELSE access to the treasury, not that they couldn't access it? It was quoted so many times to you and you seemed to keep reading it as they had no access, but it clearly said they couldn't GRANT anyone else access outside of the dept etc..........",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Owbutter",
                                                                                                            "body": "The order was unclearly written, do you know how you can tell? Because the judge had to come back and clarify their intent. I don't know what you want from me.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "BoppedKim",
                                                                                                                    "body": "I don’t think it was unclearly written, and many others agree. Despite the need for clarification will this change how you interpret future rulings and make you question what your hear?",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Owbutter",
                                                                                                                            "body": "I question everything. When an NS told me I was wrong, I even researched more to make sure I wasn't missing something. And I disagreed with the NS interpretation, and most were rude when I disagreed with their interpretation as well. Do you think your assumption is a sign of arrogance?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "BoppedKim",
                                                                                                                                    "body": "Assumptions are often arrogant and I’m no different ;) Sorry NS were rude, thank you for answering the question?",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Owbutter",
                                                                                                                                            "body": "My pleasure. I hope that you have a great day!",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fluugaluu",
                    "body": "You edited so I’ll address this new information. Thank you for that article.\n\nExcept it isn’t the only remedy. The order was brought on by a lawsuit from multiple states trying to stop DOGE from having access. This lawsuit must be addressed. So, in order to stop any more possible mishandling from happening, the judge ordered everybody to get their hands off. And then told everyone to decide how it was going to go, are they going to push for DOGE to be in power in the treasury and face a massive lawsuit, or will they be barred? All of this from the article.\n\nThere is not only one remedy and we are not waiting on the courts. Do you still think we should impeach this judge?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Owbutter",
                            "body": "Yes, impeachment is the correct way forward.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Fluugaluu",
                                    "body": "Why?",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Ice_1669",
                    "body": "> What purpose does it serve to block the legally appointed head of the Treasury Department from accessing the records too?\n\nSounds like bullshit to me. There are career staffers whose job it is to gatekeeper that data. There are access protocols that are not just appropriate but essential when accessing sensitive data. \n\nYou’ll notice the order does not prevent an executive from reviewing the data. Just accessing it. The complaint is just lawyer doublespeak to try to justify the collusion between Trump and Musk. \n\nEdit: After reading the order, this is indeed bullshit. The order only stops appointees outside of the treasury department. \n\nFollow up questions: \n\nwhy did you believe these claims? \nDo you think Trump lies or is he an honest man? \n\nHow would you check the facts on a story like this to determine who is lying?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Owbutter",
                            "body": "> Defendants: DONALD J. TRUMP, IN HIS OFFICIAL CAPACITY AS PRESIDENT OF THE UNITED STATES; U.S. DEPARTMENT OF THE TREASURY; and SCOTT \r\nBESSENT, IN HIS OFFICIAL CAPACITY AS SECRETARY OF U.S. DEPARTMENT OF THE TREASURY\r\n\n> ORDERS that, sufficient reason having been shown therefor, pending the hearing of the States’ application for a preliminary injunction, pursuant to Rule 65 of the Federal Rules of Civil Procedure, the defendants are (i) restrained from granting access to any Treasury Department payment record, payment systems, or any other data systems maintained by the Treasury Department containing personally identifiable information and/or confidential financial information of payees, other than to civil servants with a need for access to perform their job duties within the Bureau of Fiscal Services who have passed all background checks and security clearances and taken all information security training called for in federal statutes and Treasury Department regulations; (ii) restrained from granting access to all **political appointees**, special government employees, and government employees detailed from an agency outside the Treasury Department, to any Treasury Department payment record, payment systems, or any other data systems maintained by the Treasury Department containing personally identifiable information and/or confidential financial information of payees; and (iii) ordered to direct any person prohibited above from having access to such information, records and systems but who has had access to such information, records, and systems since January 20, 2025, to immediately destroy any and all copies of material downloaded from the Treasury Department’s records and systems, if any\n\nLet me ask you, is Scott Bessent a political appointee? Because it pretty clearly applies to him. Let me ask you, is this still bullshit?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Ok_Ice_1669",
                                    "body": "> Let me ask you, is Scott Bessent a political appointee?\n\nYes, which is why the above does not apply to him. \n\n> and government employees detailed from an agency outside the Treasury Department\n\n**and** is inclusive. ",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Gonzo_Journo",
                    "body": "Doge and Elon Musk are the head of the treasury?",
                    "score": 40,
                    "replies": [
                        {
                            "author": "LuolDeng4MVP",
                            "body": "Don't you think he means Bessent?",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "BiggsIDarklighter",
                                    "body": "But don’t they know Bessent isn’t blocked?\n\nhttps://www.reuters.com/legal/order-blocking-musks-doge-treasury-systems-doesnt-apply-bessent-judge-says-2025-02-11/",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "LuolDeng4MVP",
                                            "body": "Agreed, he may be wrong about Bessent, but doesn't it seem like that's who he was talking about, not doge?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "paran5150",
                    "body": "Would it have been possible to block only DOGE’s access? If that is possible I think many on the left would be ok with only head of treasury being able to access it.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Owbutter",
                            "body": "Certainly it would have been possible. Why did the order include the Senate confirmed head of the agency?",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "BiggsIDarklighter",
                                    "body": "Are you aware that Bessent isn’t blocked? And that he was never blocked? The judge made a point to clarify this today because of the wild claims going around that Bessent had been blocked as well. So does this change your opinion on impeaching the judge since now you have the facts?\n\nhttps://www.reuters.com/legal/order-blocking-musks-doge-treasury-systems-doesnt-apply-bessent-judge-says-2025-02-11/",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "IfYouSeeMeSendNoodz",
                                            "body": "He’s been parroting thst all day. He said the exact same thing to me earlier. He is the epitome of the Trump Supporter stereotype of “Everything is fake news unless it agrees with Trump/Elon”. I stopped responding to him eventually though, but he’ll be back tomorrow tomorrow right?",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Owbutter",
                                            "body": "Are you aware that the article you linked came out about three hours ago and hasn't made it into the broader news? Further, I already answered about my reasoning on impeaching the judge:\n\n>The Secretary of the Treasury, Scott Bessent was blocked from accessing his agency's data. He is the administrator of the agency, I don't see why he should be blocked from accessing it. It's why I feel this is an overreach, it's why I feel the judge should be impeached.\n\nSo, based on my quote above from a different response today that if the article is correct that I'd support impeaching the judge?",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "BiggsIDarklighter",
                                                    "body": "But you’re aware the judge didn’t change anything in the order, that this judge just clarified what the order already said? And it never said that Bessent was blocked, it was Elon Musk who said Bessent was blocked not the order. So the “news” of this had already come out when the original order came out. It’s just that Elon Musk didn’t understand it, or didn’t choose to understand it because it was easier to get people riled up and on his side if he claimed that the Treasury Secretary was blocked instead of just his DOGE people. So do you see how it was that Elon told everyone that the order blocked Bessent and not that the order actually blocked Bessent? And that there is no new news because the order’s the same?",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Owbutter",
                                                            "body": "The DoJ said Scott Bessent was blocked, my reading of the order said he was blocked, I provided an article from Bloomberg that reported he was blocked. But keep your assumptions going.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "BiggsIDarklighter",
                                                                    "body": "Are you saying that just because Elon and the DOJ misread the order and because you did as well that it warrants the judge being impeached? Because isn’t that what happened? That you all just misunderstood the order and then jumped to impeachment?",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Kuriyamikitty",
                                                                            "body": "Judge wrote or signed a badly prewritten TRO wrong. Stop excusing a bad move that needed clarification.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BiggsIDarklighter",
                                                                                    "body": "Are you aware that requests to clarify are very common? And that judges typically will appease defendants and clarify motions just to ensure all parties fully understand an order? \n\nThe order was very clear as Judge Vargas just ruled:\n\n>In entering the TRO, it was Judge Engelmayer’s **clear intention**, as had been requested, to maintain the status quo that existed prior to the adoption of the Agency Action described in the Complaint until such time as a hearing could be held on the preliminary injunction motion.\n\nJudge Vargas only agreed to clarify because that’s just what judges do to ensure all parties fully understand an order. The DOJ was just playing dumb. Any 1st year law student could understand that the order didn’t apply to the Treasury Secretary for a couple of reasons:\n\nFirst, the order explicitly was in answer to a complaint about the NEW policy, which means that any EXISTING policies are not even considered. As Judge Engelmayer’s order clearly stated:\n\n>The State’s lawsuit challenges a **new policy** by the United States Department of the Treasury, at the direction of the President and the Secretary of the Treasury, which, as alleged, expands access to the payment systems of the Bureau of Fiscal Services (BFS) to political appointees and “special government employees.” \n\nThe complaint was specifically about this NEW policy extending NEW access to “political appointees.” It had nothing to do with EXISTING access that was already being given to “political appointees,” yet the DOJ seized upon the phrase “political appointees” and pretended they had no idea it didn’t include the Treasury Secretary, who, as a “political appointee,” has always had access. So nothing changes for him. The order does not include him. And the DOJ knows damn well it doesn’t include him. At least they should know that if they’re even halfway competent lawyers because they would have seen countless orders with similar language during their careers.\n\nSecond, the order specifically called out those who could not be granted access and specifically stated that the order only applies to those “outside the Treasury department”:\n\n>restrained from granting access to all political appointees, special government employees, and government employees detailed from an agency **outside the Treasury Department**\n\nThe motion was all just theater by the DOJ. Do you honestly think that the DOJ lawyers can’t understand the language of a simple order? Would those be the kind of lawyers you’d think Trump would put in place?",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Owbutter",
                                                                            "body": "Please don't insult my intelligence, I've shoveled back the same shitty attitude you've given me this entire time while giving you serious answers to your questions. I've posted dozens of comments in this thread all saying the same thing and none of them alluded to Musk or used Musk as a source.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BiggsIDarklighter",
                                                                                    "body": "Wait, I’m confused. Are you saying that you didn’t realize the OP question you responded to is specifically about Elon calling to impeach the judge and includes a link to an article about Elon calling to impeach the judge?\n\nIf that’s what you’re saying then fine, but can’t you see how one would ask questions about Elon since that’s what the OP question was about? And since Elon’s DOGE team is what started this whole ball rolling to begin with? That there never would have been an order from this judge or any judge if not for Elon’s team trying to gain access to American citizen’s private financial and personal data? And that Elon is the one who first started the rumor claiming the order blocked Bessent even though it didn’t? \n\nI assumed that you understood all this was tied to Elon as it is all tied to Elon, but if you’re saying differently, if you’re saying you learned about this judge’s order completely independent of anything Elon had to say about it and formed your opinion about the judge’s impeachment completely independent of Elon’s call for his impeachment then fine, but again, can’t you see how one would assume you were aware of Elon’s deep and integral involvement in all this since you responded to OP’s specific question about Elon and his calls to impeach the judge who issued the order against his DOGE team?",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Owbutter",
                                                                                            "body": "Thank you. Please look at my original post:\n\n>To those of you misinterpreting what I stated:\n[The Trump administration said that a judge’s order blocking Elon Musk’s government efficiency team from accessing Treasury Department payment systems wrongfully prevents Treasury Secretary Scott Bessent from doing his job, adding a new wrinkle to a fight over the handling of the sensitive payment data.](https://www.msn.com/en-us/money/other/doge-treasury-data-block-wrongfully-limits-bessent-doj-says/ar-AA1yLxPN)\n\nIn the article (from Bloomberg via MSN) that the DoJ felt that it was restricting Scott Bessent from the data that he would need to have access to administer the Treasury Department. Prior to even responding to this thread I had already formed my opinion, and I responded as such based on what I knew at the time. I don't know who was first to say what or whatever and honestly I could not care less, my entire stance was predicated on the Secretary of the Treasury being barred from doing his job. As people came in with different points, I followed up on their points of view, even reading the order myself and based on my reading, agreed with the original article that I posted. It seems like my objection is resolved and so my opinion of the right course of action changes too. Not every TS is a blind ideologue.\n\nI do appreciate your more positive response. Thanks again and I hope this clears everything up.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "BiggsIDarklighter",
                                                                                                    "body": ">To those of you misinterpreting what I stated: The Trump administration said…\n\n>In the article (from Bloomberg via MSN) that the DoJ felt that it was restricting Scott Bessent from the data that he would need to have access to administer the Treasury Department.\n\nBut to be clear, you do now see that the article you linked doesn’t say that the DOJ felt the order was restricting Bessent from the data he would need to have access to? You do now see that the article actually said that the DOJ was claiming that because DOGE was being blocked from access that this would then somehow impact Bessent’s ability to do his job? So the DOJ never said Bessent was blocked. On the contrary, they acknowledged that he wasn’t blocked and that it was just DOGE that was blocked. \n\nThe article even quotes the judge’s order which explicitly states that the order does NOT apply to Treasury employees:\n\n>The order temporarily bars Treasury from “granting access to all political appointees, special government employees, and government employees detailed from an agency **outside the Treasury Department**.”\n\nSo can you now see that since the DOJ wasn’t the one saying Bessent was blocked then the rumor came from someone else? And that that someone else was Elon Musk?\n\n>I don’t know who was first to say what or whatever and honestly I could not care less, my entire stance was predicated on the Secretary of the Treasury being barred from doing his job. \n\nAnd so knowing now that your stance was most likely predicated on Elon Musk’s words and not the DOJ’s, even if subconsciously and unintentionally, what do you think of Elon whipping up all this undue outrage and calling to impeach this judge based solely on the false claim that Bessent was blocked from access when in fact Trump’s own DOJ had already said that Bessent wasn’t blocked?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Owbutter",
                                                                                                            "body": "I'm sorry, what now?\n\n> In a filing Sunday, the government argued that a temporary restraining order limiting “all political appointees” from accessing the data should be vacated because it ties the hands of high-level employees like Bessent, his chief of staff and his deputy secretary.\n\nThe article literally states my original assertion. Did Musk file? No, the Department of Justice filed. I know you're obsessed with this but you really need to let it go, it's not healthy.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "paran5150",
                                    "body": "Do we have confirmation that he does not have access? Does he need access to preform his duties as head of treasury? Why can’t DOGE make sure that they people they want to have access to the dat pass all background checks and security clearances, and also go through the  IT security training?",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fluugaluu",
                    "body": "DOGE is now the legally appointed head of the Treasury Department? Do you have a source for that?",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "Kuriyamikitty",
                    "body": "The fact the judge had to go back and clarify this AFTER there was a filing against it says why the judge is biased, probably signed off on a prewritten TRO and shouldn’t be a judge.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Owbutter",
                            "body": "Yeah, one of the other TS posted a timeline and that's what it seemed, that the statement was prewritten, I'm just willing to give the benefit of the doubt. That there are no NS that can even acknowledge any of it is unfortunately unsurprising.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BarracudaDefiant4702",
            "body": "1. Certainly worth considering.  It still has to go through congress and senate...  Does seem excessive for one bad ruling unless there were other rulings in addition to this one, or evidence there was additional wrong doing such as a bribe.\n\n2. That's a question for the senate and congress.\n\n3. To keep the judge from making more bad rulings in the future.\n\n4. Only if it was concerning something not brought up in the impeachment process.",
            "score": -1,
            "replies": []
        },
        {
            "author": "defnotarobit",
            "body": "1. I heard that the order didn't have any evidence to back up their claims, if that's true then yes I believe the judge should be impeached, removed from the bench, banned for life, and prosecuted if this can be determined to be a crime.\n\n2. If the plaintiff did not present any evidence and the judge enacted this ban knowing this, I don't see this as very good justice.\n\n3. Yes, it does.  It stops this judge from enacting other biased judicial opinions.\n\n4. Yes, if this action was taking without any evidence.\n\n5. Disbarment at the very least, jail time at the worst.",
            "score": -5,
            "replies": [
                {
                    "author": "tuckman496",
                    "body": "> and prosecuted if this can be determined to be a crime\n\nWait, we care about crimes again as long as they’re perceived crimes by people that stand in the way of Trump? How can you argue that this wouldn’t be a flagrant political prosecution against Trump’s enemies?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "defnotarobit",
                            "body": "I'm not that well versed in laws a judge can break but using common sense it sounds like there is some law being broken so I am not sure how you get that this is about perceived crimes.  What in my statement makes this perceived?  I stated it as a fact that \"if this can be determined to be a crime\" and NOT \"I feel this is a crime\".\n\n>How can you argue that this wouldn’t be a flagrant political prosecution against Trump’s enemies?\n\nWhat makes this NOT a political prosecution against Trump and his agenda?  Everyone knows Trump has been politically prosecuted in many other ways.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "coulsen1701",
            "body": "Whether or not the TRO expires is completely irrelevant. This is maladministration and the congress has every right and the responsibility to impeach and remove this judge.\n\nFurther, the judge in DC who had ruled that the executive branch may not remove websites from executive branch agencies and departments without so much as a hint of constitutional reasoning also must be impeached and removed. It’s becoming plainly obvious the bureaucracy is staging a neo-confederate revolt to transfer power away from the sitting and duly elected executive officer of the United States and transfer it to themselves. Investigations must be conducted and the full weight of the law must be used against anyone who is participating in this blatant coup.\n\n- keep downvoting folks, every downvote equals a sad lib. Looks like I’ve made 15 of you cry so far, let’s pump those numbers up!",
            "score": -15,
            "replies": [
                {
                    "author": "opc100",
                    "body": "Why would you say \"the sitting and duly elected executive officer of the United States\" instead of just \"the President\"?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "coulsen1701",
                            "body": "To make you ask questions",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZarBandit",
                    "body": "Bravo!  Completely agree.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "fullstep",
            "body": ">do you agree or disagree that the judge should be impeached?\n\nAn egregious overreach and misuse of power is certainly a legitimate ground for impeachment.\n\n>What is your understanding of the legal basis for impeachment?\n\nWhile generally only used for illegal or immoral acts, impeachment can be for any reason the people decide. All that is necessary is to get sufficient support in the form of votes.\n\n>does impeaching a federal judge for a ruling serve a purpose that isn't already provided for by the appeals process?\n\nYes. Appeals do not remove a judge for misuse of power. Impeachment does.",
            "score": -18,
            "replies": [
                {
                    "author": "Plastic_Key_4146",
                    "body": "Aren't Musk's work in the treasury and President Musk's EO's an egregious over reach and misuse of power?\n\nIf you're doing an audit, you bring accountants, not hackers. If you're making things more efficient, what are they optimizing for? How is it eliminating waste, fraud, and abuse to close the departments that were investigating Musk? Musk is starting payment processing with X (regulated by CFPB) and USAID was investigating Starlink.\n\nWhy did he fire all the fraud police?",
                    "score": 32,
                    "replies": [
                        {
                            "author": "fullstep",
                            "body": ">Aren't Musk's work in the treasury and President Musk's EO's an egregious over reach and misuse of power?\n\nI can't imagine why it would be. Trump has the authority to conduct internal audits, and has the authority to delegate that task. There is no improper use of power.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "Ok_Ice_1669",
                                    "body": "Shouldn’t the auditors have clearance to view sensitive data? \n\nWhy is it necessary to violate federal law regarding NPPI to do an audit?\n\nGiven that DOGE is accessing NPPI in violation of federal law, shouldn’t that breach be noted in the audit and remedies immediately?\n\nHave you ever participated in an audit of a financial institution?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "fullstep",
                                            "body": ">Shouldn’t the auditors have clearance to view sensitive data?\n\nMost if not all of the data they are accessing is public information and, if not published on a government website, is available via FOIA request. If there is anything that requires special privileges, I have no reason to assume they were not granted those privileges.\n\nTo suggest they are violating federal law is baseless.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Ok_Ice_1669",
                                                    "body": "The judges order says the states are likely to prevail in their assertion that these people are violating federal law. It prohibits people **without proper credentials** from accessing government systems. \n\nHave you read the order? I’m not a lawyer but it appears to me that it doesn’t stop anyone with the proper credentials from doing their job. ",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Kuriyamikitty",
                                                    "body": "The President has power over classification on a whim.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "fullstep",
                                            "body": "Which part of the constitution says that the president can't conduct internal audits and eliminate wasteful and fraudulent spending?",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "fossil_freak68",
                                                    "body": ">Which part of the constitution says that the president can't conduct internal audits and eliminate wasteful and fraudulent spending?\n\nArticle 1 of the constitution gives congress the power of the purse. Fraud the president has latitude, but he can't unilaterally just nullify congressional budgets. It's why the spending freeze has been blocked by so many courts.",
                                                    "score": 19,
                                                    "replies": [
                                                        {
                                                            "author": "fullstep",
                                                            "body": ">Article 1 of the constitution gives congress the power of the purse.\n\nWhich is not pertinent. No one is arguing otherwise.\n\n>he can't unilaterally just nullify congressional budgets.\n\nThe constitution gives the executive branch the responsibility to spend the funds allocated by congress. With that responsibility comes a degree of flexibility in the way the funds are used. The impoundment act of 1974 gives the president the power to defer, delay, and in some case outright cancel funds, for various reasons.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "fossil_freak68",
                                                                    "body": ">The impoundment act of 1974 gives the president the power to defer, delay, and in some case outright cancel funds, for various reasons.\n\n  \nCould you cite where in the act it lets the president cancel funds? My understanding is any cuts must be first submitted to congress before being implemented.",
                                                                    "score": 15,
                                                                    "replies": [
                                                                        {
                                                                            "author": "fullstep",
                                                                            "body": "As an example, funds can be cancelled or reduced if the purpose of the funds was achieved without spending it. Also funds can generally be delayed for up to 45 days after notifying congress of the reason, which then needs approval form congress after 45 days.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "fossil_freak68",
                                                                                    "body": "I mean, I get that is what they are going to try to argue, but I'm asking what specifically in the act gives the president the power to dissolve an agency and eliminate it's entire budget without first getting congressional approval? Specific line items I get, but that's not at all what they are doing.",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "fullstep",
                                                                                            "body": ">I'm asking what specifically in the act gives the president the power to dissolve an agency \n\nI don't know which agency you're referring to but agencies created by executive order can be dissolved by executive order. If created by congress, they can only be dissolved by congress.\n\nThat said, I am unaware of any congressional-created agencies they have dissolved. USAID is still functioning, for example.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "fossil_freak68",
                                                                                                    "body": ">I don't know which agency you're referring to but agencies created by executive order can be dissolved by executive order. If created by congress, they can only be dissolved by congress.\n\nWas the  Consumer Financial Protection Bureau not created by congress? While it hasn't been formally dissolved yet, it's being absolutely dismantled despite congress explicitly founding and funding it.",
                                                                                                    "score": 7,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Kuriyamikitty",
                                                                                            "body": "Technically he can eliminate the agency as it is since his branch picks how it’s run, create a new agency and then continues the payments under the general umbrella that Congress gives. I bet nowhere did Congress specifically create a line item in a budget to make a Sesame Street show anywhere, but that was the vehicle chosen for funds for generalized goals, which would let him change how the funding is applied to the actual goal.\n\nEdited for a slight line forgotten as I think faster than I type.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TreeLicker51",
                                    "body": "By that same logic, doesn't a federal judge have the authority to issue a temporary restraining order?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "fullstep",
                                            "body": ">doesn't a federal judge have the authority to issue a temporary restraining order?\n\nOnly if there is an applicable law that the judge is exercising. There is no law in this case since what Trump is doing is wholly within his power.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TreeLicker51",
                    "body": ">An egregious overreach and misuse of power\n\nDo you think the same is true of the judge who blocked Trump's order to end birthright citizenship? Was that an abuse of power by the judge?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "fullstep",
                            "body": "No. The judge asserted a previous interpretation of the law. Interpreting laws are what they are supposed to do. There was no overreach.\n\nIn this case, there is no law restricting what Trump/Musk are doing, so there was no lawful basis to block it, yet they did it anyways. It is an overreach.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "TreeLicker51",
                                    "body": "Thank you. Follow ups:\n\nDo judges also have the power to issue temporary restraining orders or preliminary injunctions?\n\nIf they do, is this still a case of judicial overreach?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "fullstep",
                                            "body": ">Do judges also have the power to issue temporary restraining orders or preliminary injunctions?\n\nOnly within the scope of their duties of interpreting the laws. Issues absent of any laws are not in their scope.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "TreeLicker51",
                                                    "body": "Isn’t the purpose of a TRO to put a halt to\nsomething while its legality is reviewed (and the relevant laws are interpreted)? What do you think a TRO is for, exactly?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "fullstep",
                                                            "body": ">Isn’t the purpose of a TRO to put a halt to something while its legality is reviewed \n\nYes but it is not without limits. Some semblance of a law must first exist to be reviewed. There is no law in this case.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "TreeLicker51",
                                                                    "body": "The judge’s blocked DOGE because 19 states sued the executive branch for violating the Administrative Procedures Act. The judge is issuing the temporary restraining order so that the law mentioned in the previous sentence can be reviewed to ensure that DOGE’s access to the Treasury is still in conformity with it. The text of the judge’s decision is linked in this thread.\n\nDid you read the judge’s ruling before you agreed with Musk’s statement? And given this new information, do you still believe that the judge’s ruling was unrelated to the interpretation of the law and that he overstepped his legal authority?",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "fullstep",
                                                                            "body": "You can't just cite an arbitrary law. It must be applicable. The Administrative Procedure Act does not prohibit the President from conducting audits within his own branch of government. No such law for that exists.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TreeLicker51",
                                                                                    "body": "Okay, so Trump and his supporters (like you) feel one way about what the law implies, and the plaintiffs (the 19 states) feel another way. That’s what the judicial branch is for, to mediate disputes over the law. It sounds like the judge is doing his job by halting DOGE so the law can be reviewed. Why should the judge therefore be impeached?",
                                                                                    "score": 7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "fullstep",
                                                                                            "body": "The implication is that the judge knowingly cited an inapplicable law, which is a misuse of power and an impeachable act.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "TreeLicker51",
                                                                                                    "body": "Who’s saying it’s an inapplicable law? Are they a legal expert?\n\nHow do you know what the judge’s ulterior motives are?",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "KhadSajuuk",
                                                                                                    "body": ">The implication is that the judge knowingly cited an inapplicable law, \n\nThis law is inapplicable according to who, exactly? The Executive--Trump, Musk, Vance--branch? The Executive is not responsible for determining legality--that is explicitly the role of the Judiciary, which is currently making its decision. \n\nThis goes without even mentioning the erroneous belief that President Trump or Elon Musk are more qualified to determine matters of the law than judges appointed by prior administrations.",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Ice_1669",
                    "body": "> An egregious overreach and misuse of power\n\nWhy do you feel this way? Who told you to believe this?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Kuriyamikitty",
                            "body": "Article 2, with an Agency under full Executive control.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TreeLicker51",
                    "body": ">\n\nAn egregious overreach and misuse of power is certainly a legitimate ground for impeachment.\n\n>\n\nWhile generally only used for illegal or immoral acts, impeachment can be for any reason the people decide. All that is necessary is to get sufficient support in the form of votes.\n\n\\*\\*\\*\n\nDo you see a tension between these two statements? In the first statement you're saying that there's a legitimate grounds for the impeachment. In the second statement you're saying that it doesn't matter if there are legitimate grounds for the impeachment. Did this judge do something illegal or didn't he? Or are you saying it doesn't matter?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "fullstep",
                            "body": ">Did this judge do something illegal or didn't he? \n\nPossibly illegal. Certainly immoral.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TreeLicker51",
                                    "body": "The United States Constitution describes the requirements for impeaching a federal official. Is “immoral conduct” in the description?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Debt_Otherwise",
                    "body": "Musk and co are not government employees.\n\nWhy is it overreach if your role as a judge is to uphold the law?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mispeeledusername",
                    "body": "Is this the same grounds used to impeach Trump twice or was that partisan lawfare? What is the difference between that then and this now, if any?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "whateverisgoodmoney",
            "body": "1. Yes. Impeachment is a governmental process available to anyone wishing to remove a judge. Not just judges whom I agree or disagree with.\n2. See above.\n3. See above.\n\nThis is the correct way for the Executive and Legislative branches to interfere with the Judicial branch.",
            "score": -19,
            "replies": [
                {
                    "author": "Windowpain43",
                    "body": "What is the justification for impeachment?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "whateverisgoodmoney",
                            "body": "I do not think it matters. It is the only way that we can vote for unelected officials like judges.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "Windowpain43",
                                    "body": "Are judges not approved by the Senate? I'm not suggesting that a judge cannot be impeached. I'm asking about what the justification is in this specific case.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Kuriyamikitty",
                                            "body": "The Senate looks to state rights. The House is the closest the average person gets to act in federal manner as they represent blocks of people.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Windowpain43",
                                                    "body": "Sure. How is that relevant to this conversation?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "whateverisgoodmoney",
                                                            "body": "The check on the power of judicial is impeachment, just as it is the check on the executive.\n\nThis check can be exercised by the legislative.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Windowpain43",
                                                                    "body": "I am not disputing that. I am asking about the justification for impeachment in this instance.\n\nIs impeachment supposed to be used when the president doesn't like a ruling by a judge? Because that's all this seems to be.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "whateverisgoodmoney",
                                                                            "body": "Yes. This is EXACTLY the case to use impeachment. If a president is ignoring the judicial (or legislative for that matter) the remedy is impeachment.\n\nHaving said that, the judicial ruling SHOULD go through the entire judicial system and be ruled on by SCOTUS, but impeachment can happen for whatever reason.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BigDrewLittle",
                    "body": "Wait, isn't adherence to governmental processes part of what Trump is against? Isn't that why he's letting Musk take pruning shears to the DOE, CFPB, and FDIC today, and the SSA tomorrow?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "whateverisgoodmoney",
                            "body": "I have no idea what you are talking about.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "mispeeledusername",
                                    "body": "I think the point is that Trump and, as far as I can gather, his supporters, are virulently against systems and processes that pose any checks against Trump’s power. I also think it is obvious that this doesn’t fit the bill of a system that stands in Trump’s way for now, so supporters are happy to lean on it. Does that help? \n\nThe other question I have is, does that not remove the moral high ground of following due process when due process is only learned on when it benefits Trump and is otherwise derided as corruption?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kuriyamikitty",
                            "body": "No, it’s more he’s against Bureaucracy. Didn’t you defend Democracy, cause Bureaucracy is nowhere near Democracy.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Scynexity",
            "body": "I agree with impeachment. The basis would be a misuse of power. Stopping the executive branch from accessing its own systems is plainly absurd and a threat to national security. I commend Trump for his restraint so far in not simply ignoring the order - he would be within his rights to do so. Impeachment is necessary because the judge could otherwise repeat this practice indefinitely, forever stopping any President from acting.",
            "score": -9,
            "replies": [
                {
                    "author": "Debt_Otherwise",
                    "body": "You say that the system “belong” to the government but the data in those systems technically belong to the people whose data that is.\n\nGovernment is the custodians of the data but according to law are not allowed to do whatever they want with it. In particular Elon Musk and his employees are NOT government employees either so have no jurisdiction. That’s what the judge is arguing.\n\nDo you agree? If not, why not?!",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Scynexity",
                            "body": ">  In particular Elon Musk and his employees are NOT government employees\n\nIncorrect, Musk is a government employee, and so are those working for DOGE.",
                            "score": -6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "I don't know about impeached, maybe. But a district judge does not have the authority or ability to stop the federal government from executing policy. Only the Supreme court can do that.",
            "score": -10,
            "replies": [
                {
                    "author": "TreeLicker51",
                    "body": ">But a district judge does not have the authority or ability to stop the federal government from executing policy.\n\nCan federal judges challenge executive orders? If not, is this [information ](https://www.fjc.gov/history/administration/judicial-review-executive-orders#:~:text=Since%20the%20early%20days%20of,actions%20of%20the%20executive%20branch)provided by the the Federal Judicial Center, which extensively discusses the power and lengthy historical precedent of the federal courts to challenge the executive, wrong?\n\n>Only the Supreme court can do that.\n\nHow do cases reach the Supreme Court? Don't they have to start in lower courts, for example, federal court?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Ilosesoothersmaywin",
                    "body": "Is it more likely that this judge did something illegal here or that you are wrong with what this judge is authorized to do?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "Nope there's no odds to play here.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "fossil_freak68",
                                    "body": "Did you feel that way when judges blocked Biden's initiatives that didn't make it to the supreme court?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "KhaleesiSenju",
                    "body": "Ever heard of checks and balances, bud?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}