{
    "title": "Would you Rather Accept for Immigration a Canadian who is of Sub-Saharan African Ancestry or a Belarusian who is of Eastern European Ancestry?",
    "author": "WhatARotation",
    "subreddit": "AskTrumpSupporters",
    "rank": 115,
    "score": 1,
    "upvote_ratio": 0.52,
    "num_comments (reported by reddit)": 51,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1iolxlr/would_you_rather_accept_for_immigration_a/",
    "id": "1iolxlr",
    "selftext": "Each person has the \"median\" cultural attributes of somebody in their demographic-for instance, the Belarusian will eat whatever the median Belarusian eats and have the same political views/values as the median Belarusian.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "MakeGardens",
            "body": "I’ll take the Canadian. They probably already know a lot about the country and would have an easier path to citizenship, and a likelier chance at success, all things being equal.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gaxxz",
            "body": "Which has skills more in demand in the labor market?",
            "score": 2,
            "replies": []
        },
        {
            "author": "coulsen1701",
            "body": "Like in the country at all or they’re coming into my friend group? I’d probably have more in common culturally with the Canadian, but the Belarusian might make a really good borscht and I haven’t had good borscht since my Bubbe died, and I could use someone to help me with my Russian fluency, but also Canadians know how to drink and thats always a good time.\n\nEither? Neither? Both? I can’t speak for others but I don’t care what color someone is. I was raised dirt poor and largely in mostly black neighborhoods and later Hispanic ones and a good number of my friends have been hispanic and black. If you can assimilate reasonably into the culture (and no that doesn’t mean they abandon their own heritage, most Americans have pride in their Irish, Italian, Jewish, African, Mexican, etc heritage despite maybe never having even been to their family’s country of origin) then there’s no issue. Shit, half of my TikTok is newly naturalized citizens from all over the world and I think it’s great. Do it the right way and I have no issues, do it the wrong way and I don’t care if you’re from Canada, England, Belarus, Ghana, or Juarez.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "Which Canadian Providence are they from?",
            "score": 2,
            "replies": [
                {
                    "author": "glasshalfbeer",
                    "body": "Asking the tough question.  Whats the wrong answer here?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "B.C, Ontario and Quebec. The Newfies and PEI folks are goofy but not ruled out immediately.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ivan_Botsky_Trollov",
            "body": "my vote goes for the Belarussian\n\nI guess that liberals will choose the Canadian-African every time",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dark_knightTJ",
            "body": "the whole point of moving to the US is to live and be an american, if someone is going to come from canada, africa or china doesnt matter and is going to try and turn america into these countries i dont want them. theres a reason they dont want to be in their home country anymore",
            "score": 1,
            "replies": []
        },
        {
            "author": "long_arrow",
            "body": "what's the purpose of this question? it's not grounded in reality or even future predication",
            "score": 0,
            "replies": [
                {
                    "author": "WhatARotation",
                    "body": "Many TS when pressed on why they want to restrict immigration say that they view modern immigrants as being culturally incompatible with America rather than as a sort of racial vermin poisoning the country, but I don't believe them, and I appear to be correct looking at the other responses here.\n\nSo would a POC who has American culture be more preferable than a white person who has a culture that is completely foreign?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "long_arrow",
                            "body": "I don’t care about race. Merit matters. Culture does not matter. Democratic values matter",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Owbutter",
                                    "body": "I'd like to respectfully disagree, culture absolutely matters. Import a Sharia Muslim and tell me it doesn't matter. Just because they're from Canada doesn't mean that they've adopted a more Canadian culture.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "long_arrow",
                                            "body": "Let me clarify. Democratic values trump culture, when a certain culture contradicts democratic values, then democratic values supersede that culture. I hope that makes more sense. In the sharia Muslim case, no I wouldn’t accept them. But in the case of Korean culture vs Mexico culture, I don’t care too much .",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "WhatARotation",
                                    "body": "I agree with you 100%. Does it bother you that many other TS don't?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "long_arrow",
                                            "body": "I don’t think that’s a high percentage. There are always far-right or far-left people.  If I know one , yes I would be bothered. But I don’t know anyone like that. Maybe they are all online",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "basilone",
                                            "body": "You're drawing incorrect conclusions due to poor framing of your original question.  If you just ask \"black vs white\" and there's no additional context, people are just going to do a surface level statistical analysis and say the white guy.  Why?  Statistically less likely to be on welfare, have children out of wedlock, etc.  The only differential you provide is culturally western, which is far too broad to tell us anything about the individual.  Denzel Washington is culturally western, and so is a hardened convict from Oakland.  Does the black guy from Canada have a nice family and good career?  Does the the white guy from Belarus belong in the next season of Trailer Park Boys?  You effectively provided no criteria to judge on aside from generalized group statistics, so not so surprisingly you got answers based on group statistics.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "thirdlost",
                            "body": "TS are not anti immigration.  We are anti law-breaking. \n\nTo not see the distinction between legal and illegal immigration is either ignorant or purposefully antagonistic",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "11-110011",
                                    "body": "Have you ever scrolled the immigration questions on this sub? There are MANY TS who are completely against it at all.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheGlitteryCactus",
            "body": "Which one brings in more value to the US? Are they skilled or artistic?",
            "score": 1,
            "replies": []
        },
        {
            "author": "kapuchinski",
            "body": "https://youtu.be/Z5DHQ8W9k0U?si=qUumxh68crzVzoxI",
            "score": 0,
            "replies": []
        },
        {
            "author": "SincereDiscussion",
            "body": "There's nothing special about black Canadians, so the question is basically \"black or White immigrant?\". I don't see any reason why I would ever not want the White immigrant...\n\n(Ideally, I don't want either, for what it's worth).",
            "score": -9,
            "replies": [
                {
                    "author": "WhatARotation",
                    "body": "Would the fact that the Canadian shares most of our Western Judeo-Christian American values while the Belarusian very likely does not change anything?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "I have no idea what you are referring to so that is pretty hard to answer.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "WhatARotation",
                                    "body": "While I personally don't think this way (it would be stupid for me to, for I have Eastern European, Southern European, and NW Indian ancestry myself and therefore am not a WASP), many TS claim that they wish to restrict immigration because they view the current stream of third-world immigrants as incompatible with Western values.\n\nIn this post, I tried to neutralize the cultural argument by comparing a POC with western culture to a white person without it.\n\nSo I suppose I'm asking: Does race supersede cultural compatibility as the chief reason you want fewer immigrants?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "Right. I get that argument. I try to focus on things that are more concrete than just \"culture\", as I talked about in another comment (ideology, behavior, general outcomes). Ideology = voting patterns, responses in surveys; behavior = very broad, but most obviously crime stats; outcomes = things like wealth/income, health, education, etc. \n\nYou seem to want to get me to say that I care about race for its own sake, and I do. I'm White, I like White people, I like the societies we build, and I want to maximize the chances that we continue existing (while being independent and prosperous). So if that is your big experiment, I have no problem saying that yes, I absolutely care about race. But I don't think a person has to have all of my views on race in order to share most or even all of my views on immigration. \n\nRegarding values: I just don't know what it means in this context, because even if you got me to concede that there was a hypothetical black Canadian whose values were closer to mine than a hypothetical Eastern European, it doesn't really have any implications for immigration policy unless you think this is true on aggregate (or that we have some sort of selection process to filter out people with Bad Values, or people that simply lie about their values, etc.). I get that for you it's a thought experiment, and I'm supposed to just take it as a given that one person shares my values and the other doesn't. But if race and values aren't actually separable in that way, then that isn't possible.\n\n* Example: how would I feel about a Chinese person who had my exact values and worldview? Well, he would be a proud Chinese nationalist who wants the best for his people. So he either wouldn't leave China in the first place or he would only be here insofar as it delivers benefits back home! Both are far from ideal. So sharing 'values' doesn't actually mean anything. You can be a good person in my eyes and still make for a bad American.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lock-crux-clop",
                    "body": "If the question boils down to black or white, why do you always prefer the white one?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "First and foremost, I'm White, so that makes it pretty simple. Basic in-group preference at that point.",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "lock-crux-clop",
                                    "body": "Do you say first and foremost to imply there are other reasons beyond in-group preference?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "SincereDiscussion",
                                            "body": "I'm saying there *could* be other reasons, but they could be endlessly nitpicked and in-group preference is sufficient.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "lock-crux-clop",
                                                    "body": "What other reasons could there be?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "SincereDiscussion",
                                                            "body": "Group differences in things like ideology, behavior, general outcomes. I don't know the data on this as it specifically relates to black Canadians or Belarusians, but if you just assume they'll vote and act like black and White people (respectively), you can easily find all sorts of stats on this kind of thing.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "IfYouSeeMeSendNoodz",
                                                                    "body": "Can you define acting like “black people”?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SincereDiscussion",
                                                                            "body": "As in, having outcomes resembling those of black people in any statistic you can think of.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "pimmen89",
                                                                                    "body": "Such as having a job, following the law, and paying your taxes? Or is there some other outcome the vast majority of black people in the US have that you were thinking of?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Ivan_Botsky_Trollov",
                                                                                            "body": "yes:\n\n[https://ucr.fbi.gov/crime-in-the-u.s/2019/crime-in-the-u.s.-2019/tables/table-43](https://ucr.fbi.gov/crime-in-the-u.s/2019/crime-in-the-u.s.-2019/tables/table-43)",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "SincereDiscussion",
                                                                                            "body": "I really don't get the confusion over what I wrote. \n\n1. Look at any statistic broken down by race.\n\n2. Compare Whites to blacks.\n\nThe assumption I made was, since I don't know much about black Canadians or Eastern Europeans in America, they will cluster with their respective racial groups, in which case what I wrote above will apply.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Abridged6251",
                    "body": "There's also nothing special about Belarusian immigrants either, so why would you prefer them over black Canadians?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SincereDiscussion",
                            "body": "Read my other comments.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "basedbutnotcool",
            "body": "I’d rather neither, but if I had to pick one I’m picking the white one",
            "score": -7,
            "replies": []
        },
        {
            "author": "ethervariance161",
            "body": "Pick the one that has the most money and income potential. Immigrants should be a net positive for the treasury department",
            "score": -1,
            "replies": []
        },
        {
            "author": "sshlinux",
            "body": "The White one",
            "score": -10,
            "replies": [
                {
                    "author": "WhatARotation",
                    "body": "Because the Canadian likely has much more culturally in common with Americans, would it be accurate for me to say that your desires to limit immigration are less about culture and more about trying to get rid of people who aren't white?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "sshlinux",
                            "body": "It's both. Race/ethnicity is culture. A black Canadian would likely have much different culture than mine. As do most black Americans. A Eastern European would have more in common with.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "WhatARotation",
                                    "body": "I'll preface this that I agree that people who fall under different race classifications have different experiences and that informs cultural differences. However, why would you have more in common with somebody who likely doesn't even speak the same language, eat the same food, or vote in free elections than you would with somebody who grew up in an Anglo-Western democracy?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "sshlinux",
                                            "body": "Shared heritage can lead to cultural similarities in terms of language, customs, and traditions. These can include food, literature, festivals, music, films, politics, religious practices, and family values. My daily meals are definitely more similar to Eastern European culture. Europe is where most of our foods originated, bc America had a similar culture to Europe we just Americanized them but my diet would be more similar to Eastern Europe.",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SincereDiscussion",
                    "body": "Indeed. The black Canadian would come here and start lecturing us about slavery, Jim Crow and redlining 5 minutes later. \n\nThis question is so odd because it's written as if having the \"cultural attitudes\" of a Canadian is this huge factor that's supposed to sway us to him, when really it just makes me think of someone who is similar to, but potentially even more extreme than, the worst kinds of liberals in America.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Trumpdrainstheswamp",
            "body": "East European for sure. We need more white people in this country, that is who built this country and the reason it was so great.",
            "score": -8,
            "replies": []
        }
    ]
}