{
    "title": "Trump fires hundreds of FAA employees after deadliest crash in recent history - thoughts?",
    "author": "Charming-Rose",
    "subreddit": "AskTrumpSupporters",
    "rank": 94,
    "score": 200,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 154,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1irjarf/trump_fires_hundreds_of_faa_employees_after/",
    "id": "1irjarf",
    "selftext": "[https://simpleflying.com/faa-probationary-employees-terminated-by-trump-administration/](https://simpleflying.com/faa-probationary-employees-terminated-by-trump-administration/)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sheila5961",
            "body": "The FAA has approximately 50,000 workers. Trump fired/laid off 300 employees, ALL in NON-SAFETY roles. So my thoughts are, What does firing what amounts to 300 minions have to do with a plane crash?",
            "score": 1,
            "replies": []
        },
        {
            "author": "whateverisgoodmoney",
            "body": "Commercial pilot here.\n\nFAA employees does not mean air traffic controllers, nor would reduction in the FAA mean less crashes would happen. We have been stuck at saving human lives due to aircraft crashes for almost 30 years.\n\nWant to reduce airplane crashes? Take the human out of the cockpit. OH NO! I NEED MY HUMAN FLYING THE MACHINE WHICH IS THE RESULT OF 75% OR MORE OF CRASHES!\n\nHumans are idiots and when crashes occur it is because the pilot is smarter than a scientifically determined checklist. The only reason we have humans in cockpits, let alone TWO humans, is because of irrationality. Just like the TSA, it is \"safety theatre\". We have 12,500 airports in the US. We have TSA at 500. Feel safe now?\n\nThe FAA is otherwise a hugely bloated organization functioning on the same rationale as OPs wildly unknowledgeable rage-bait question.\n\nThese are the same people who think that human controlled vehicles are safer than autonomous vehicles.\n\nEDIT: haha the downvotes prove my point. People are completely irrational.",
            "score": -33,
            "replies": [
                {
                    "author": "Remarkable_Kale_8858",
                    "body": "Why exactly do pilots still conduct takeoffs and landings?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Tachyonzero",
                            "body": "Because handling nature’s curveballs at critical moments requires a human’s quick wit and steady hand.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "whateverisgoodmoney",
                            "body": "Because the cost of the infrastructure to allow zero visibility takeoffs and ILS CAT III landings, which have been around for more than 20 years. Which is offset by the need of the general public for a human in the cockpit. We have had this automation for a LONG TIME.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Maximus3311",
                                    "body": "I've asked this before but it bears repeating - have you ever had an even somewhat serious system failure in your flying career?  Have you ever had an autoland fail on you?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "whateverisgoodmoney",
                                            "body": "I have had several critical failures during my career. Less so in large commercial aircraft, but they have happened.\n\nThe secret is to follow the checklist. This is usually where the pilot will crash, is deviation from the emergency checklist. They out smart themselves all the way to the crash site.\n\nWe have FAA data dating back almost 30 years and the results are conclusive: humans cause aircraft crashes more than 80% of the time.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Remarkable_Kale_8858",
                                    "body": "As in not every airport has sufficient ground radar to guarantee safe ILS landings? But autopilot has landed planes plenty before right? It’s just typically handled by you?\n\nWould this change not require maybe having *more* radar technicians rather than fewer?\n\nI have no contention with having self flying planes (to be clear my understanding is the only change would typically be be autopilot taking off and landing every commercial flight) but as with self driving cars the thing is you know there is going to be a deployment curve where stuff goes wrong once that is a widespread commercial enterprise, and with flights that means lives lost. And I just don’t think the public will ever accept that compromise. But you’re a pilot you know way more than me",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Maximus3311",
                    "body": "I'm a captain at a legacy airline.  I 100% disagree with you.  I fly an airbus - the systems work well...when they work correctly.  Like with most machines things often go wrong (systems fail).  That's why we're there. Most of the time the system failures are minor...but they still require attention (can't ignore an ECAM message and just go trucking along)\n\nYou're right - human error is the cause of the vast number of crashes.  But if you take the human out of the flight deck those numbers change drastically.  The reason that the majority of crashes aren't caused by aircraft system failures is that we're there to manage the failures when the systems break down.\n\nTake amateur GA pilots out of the mix and all those \"human error\" crashes are drastically reduced.  Historically - sure.  The industry has a lot of fatal crashes - but those are mostly historical.  Hell even the recent crash in DCA apparently wasn't the aircrew's fault.  The pilots in that blackhawk appear to be the culprits.\n\nHaving two people in the flight deck isn't \"because of irrationality\" or \"safety theatre\".  Aside from the fact that one of the two pilots could be incapacitated (unlikely - but it does happen) people rarely have \"perfect\" flights.  So that's why there are two pairs of eyes, two minds, etc. working together to make good decisions (and catch each other's or the controllers mistakes) or - god forbid - manage a real life emergency (one pilot flies and talks to ATC while the other runs checklists).\n\nOut of curiosity - since you said you're a commercial pilot - what kind of flying do you do? Do you earn your living flying?",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "C47man",
                    "body": "How does a commercial pilot arrive at the conclusion that his or her job shouldn't exist? Why are you in favor of getting rid of your own profession?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "whateverisgoodmoney",
                            "body": ">How does a commercial pilot arrive at the conclusion that his or her job shouldn't exist? Why are you in favor of getting rid of your own profession.\n\nThe same reason why in a couple states you cannot pump your own gas. Autonomous driving and flying (hahaha after 600 feet autopilot engage, for landing, 200 feet autopilot disengage, BY LAW becaue autopilot flies better than humans) is far more safe but there are enough people out there who irrationally believe that autonomous cars or aircraft is more dangerous.\n\nSince the mid 1990s, we cannot improve on aircraft crashes. Why? Because over 75% of accidents are human error. The planes are mechanically as safe as they are going to be. We must eliminate the human.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "C47man",
                                    "body": ">hahaha after 600 feet autopilot engage, for landing, 200 feet autopilot disengage, BY LAW becaue autopilot flies better than humans\n\nYou're... Not actually a pilot are you?",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "whateverisgoodmoney",
                                            "body": "I am. You can read the rest of my responses and engage meaningfully, or not.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Maximus3311",
                                    "body": "Where are you flying that you're required to disconnect the autopilot at 200' on landing? Every airline I've been at has been 160' for CAT I and 80' if CAT II or CAT III is displayed.\n\n\"BY LAW becaue autopilot flies better than humans\"\n\nWhat law? I'd love for you to point out any rule or regulation that states that.  Because I guess me and all the other airline pilots have been doing it wrong all this time.  Would be really eye opening for all of us if you could share where you got your info!\n\nAnd...Have you ever had the autopilot in one of the aircraft you're flying fail on you? I know I have.  IT's rare but it happens.\n\nSo in your scenario with no pilots on board - what happens when the autopilot (for whatever reason) stop working? Get a FA to land it?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "whateverisgoodmoney",
                                            "body": ">Where are you flying that you're required to disconnect the autopilot at 200' on landing? Every airline I've been at has been 160' for CAT I and 80' if CAT II or CAT III is displayed.\n\nWhile I believe you are a commercial pilot, you seem rather unknowledgeable about operating agreements: the airlines operate under Part 121 or 135 and can set their own specific rules. I was speaking in general, meaning Part 91. Certainly, your airline will have its own FAA approved operating agreement. For those of you reading that do not understand what we are talking about, each carrier operating under CFR parts 121 or 135 make an agreement with the FAA as to their own rules. So the rules for Southwest Airlines will be different than the rules for Delta, for example.\n\n>What law? I'd love for you to point out any rule or regulation that states that. Because I guess me and all the other airline pilots have been doing it wrong all this time. Would be really eye opening for all of us if you could share where you got your info!\n\nTouche! Just as you quoted minimums from your companies operating agreement, the part 121 and 135 companies I worked for had rules for use of autopilot. And I mean, you know this as well, you are not up there hand flying at FL35.\n\n>And...Have you ever had the autopilot in one of the aircraft you're flying fail on you? I know I have. IT's rare but it happens.\n\nAbsolutely! And resolved with redundant systems. I recommend 3, just like we use for space travel.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ImAStupidFace",
                                    "body": "> (hahaha after 600 feet autopilot engage, for landing, 200 feet autopilot disengage, BY LAW becaue autopilot flies better than humans)\n\nWhat law prohibits hand flying outside of takeoff and landing, specifically? I have a semi-casual interest (obsession, more like) in aviation, and I've never heard of such a law. I did ask around with some friends who do fly for KLM and Lufthansa, and they didn't seem to know anything about such a law either. SOPs may have rules for when AP should and shouldn't be used, but those aren't laws. \n\nAnother question I have is, if autopilot flies better than humans, why do humans hand fly the takeoff and landing? As I understand it, those are by far the most critical phases of flight where most accidents happen. So if planes could perform those phases of flight safer than humans could, why don't manufacturers focus on automating them?\n\nIn my understanding, the purpose of the autopilot is more to reduce pilot workloads during non-critical phases of flight in addition to enabling precision approaches. Is this incorrect?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "whateverisgoodmoney",
                                            "body": ">What law prohibits hand flying outside of takeoff and landing, specifically? \n\nThe systems onboard the aircraft and on the ground. For example there is ILS CAT I, CAT II, and CAT III. Depending on several factors, you may be able to use CAT I and CAT II under 200 feet, but some visibility must be maintained.  CAT III requires no visibility and is essentially autoland. But CATIII requires very specific ground and aircraft resources.\n\nThe SOPs you talk about, at least in the US, are dictated by an operating agreement between the airline and the FAA. These are under 14 CFR Parts 121 and 135. So the operating agreement for Southwest could be different than the operating agreement for KLM or Lufthansa. The agreements are extremely detailed and are actually \"laws\" in the sense that if you break them, you are in trouble with FAA, not just your company. They are not voluntary.\n\n>In my understanding, the purpose of the autopilot is more to reduce pilot workloads during non-critical phases of flight in addition to enabling precision approaches. Is this incorrect?\n\nWhile true, the fact is that autopilot flies to a much higher degree of precision than human pilots are capable of. Which is why all of the 121 and 135 agreements I ever flew under required autopilot whenever possible.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pliney_",
                    "body": "Do you think a good way to reduce bloat is simply firing a bunch of employees because you can? If they spent some time looking at where there is waste and who is doing a good job and who isn’t and then got rid of a bunch of people that would be fine. But I don’t see how firing all the new employees, most of whom are probably bright young and motivated is a good move. They’re getting rid of young talent likely in areas of need, and instead will be stuck with the people who have been there a while and this group is probably where they actually need to be trimming. But they’re harder to get rid of so rather than coming up with a plan they just fire who they can.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "whateverisgoodmoney",
                            "body": ">Do you think a good way to reduce bloat is simply firing a bunch of employees because you can?\n\nIt is a start.\n\n>If they spent some time looking at where there is waste and who is doing a good job and who isn’t and then got rid of a bunch of people that would be fine.\n\nSunk cost fallacy.\n\n>They’re getting rid of young talent likely in areas of need, and instead will be stuck with the people who have been there a while and this group is probably where they actually need to be trimming\n\nHard to fire government union protected jobs. Otherwise, they would be on the chopping block too.\n\n>But they’re harder to get rid of so rather than coming up with a plan they just fire who they can.\n\n100% agree. But this is what government unions do, just like cops and teachers. They lower the bar of their profession so low so that instead of the unions weeding them out, that the poor performing cop or teacher cannot be fired.\n\nYou see, actual PROFESSIONAL organizations RAISE the bar. Do you think that is happening in government, such as cops and teachers?",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "akesh45",
                                    "body": "Actually, in the aviation industry, they do raise the bar continuously and maintain high standards.\n\nWhat makes you think we don't?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "whateverisgoodmoney",
                                            "body": ">Actually, in the aviation industry, they do raise the bar continuously and maintain high standards.\n\nI would absolutely agree this is true for pilots. The bar is very high, as my attorney friend says \"we must stay above the fray.\" Unlike teachers and cops, which try to push the bar down. To me, this is the definition of a professional. Whatever the legal requirements are, your industry requires much higher.\n\nHowever, unfortunately, the government has a DEI sickness that was infecting even our air traffic controllers, which are even more important than pilots.\n\nBut even the FAA is bloated with jobs that are not necessary. Half they agents at my local FSDO could be cut, I spend a lot of time there, and their time is not used wisely at all.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "akesh45",
                                                    "body": ">However, unfortunately, the government has a DEI sickness that was infecting even our air traffic controllers, which are even more important than pilots.\n\nUh huh.....is the air traffic controller bar not also set high?\n\nFYI I work in the same industry, who do you fly for?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "whateverisgoodmoney",
                                                            "body": "hahah not on my life am I doxxing myself. You are free to doxx yourself if you like. Who do you work for? Are you a pilot?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fmeson",
                    "body": "Do we have fully functioning automatically flying planes? Can you just sit back in the cockpit and press \"go to Houston\"?",
                    "score": 29,
                    "replies": [
                        {
                            "author": "whateverisgoodmoney",
                            "body": "Yes, actually. We do. And have for at least 20 years. ILS CAT III has been around for a LONG time and zero visibiity takeoffs have been around that long.\n\n600 feet after takeoff, press autopilot, 200 feet before landing, disengage autopilot. You are, in fact, not allowed to hand fly aircraft between those two points.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Maximus3311",
                                    "body": "\"600 feet after takeoff, press autopilot, 200 feet before landing, disengage autopilot. You are, in fact, not allowed to hand fly aircraft between those two points.\"\n\nWait I'm sorry - that's 100% incorrect.  I've said this in another couple of places but I'm an airbus captain at a legacy (US) airline.\n\nI'm trying to say this as nicely as possible - who gave you your training? Any real commercial pilot would know that's wholly incorrect.  In fact we're \\*encouraged\\* to hand fly (outside of RVSM airspace) to maintain proficiency.\n\nAs far as your numbers - the 200' on landing...that's incorrect.  It's 160' on a CAT I.  In our SOP it's 80' with CAT II or CAT III displayed.\n\nSo as to my clarifying question in trying to understand your point of view: where did you get your training and why would you think that you're not allowed to hand fly between 600' on climbout and 200' on landing?\n\nBecause I've been flying for two decades, been at 3 airlines (one regional, one ULCC, and now my legacy) and I've \\*never\\* heard that before.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "Fmeson",
                                    "body": "That's for landing, right? Is it safe for pilots to \"hands off\" use ils without needing to monitor it for saftey reasons? Based on my research, it seems like it uses radio signals to get the right approach, but it does not monitor the environment around the plane, so it's not fully autonomous.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Maximus3311",
                                            "body": "Based on him saying this: \"600 feet after takeoff, press autopilot, 200 feet before landing, disengage autopilot. You are, in fact, not allowed to hand fly aircraft between those two points.\"\n\nI have \\*serious\\* doubts that this guy has a commercial rating (or is even a pilot).  At least in the US that's absolutely incorrect.\n\nNow is it possible he's European? I guess it is...I've never flown in Europe (just US/Canada/Mexica/Central and South America and the Caribbean) and won't claim to know their rules (although this still sounds patently false) but at least in the US that's absolutely incorrect.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "ModerateTrumpSupport",
                                                    "body": "I would have serious doubts about his claim in other countries too, so who knows what he's smoking.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "whateverisgoodmoney",
                                            "body": "Yes. It is far safer for an aircraft to land ILS CAT III than hand landing. There is a reason we are prohibited from hand flying during any other segment of the flight.\n\nAre you asking me a serious question or do you just want to be contrarian? Your ignorance is not an excuse to be obtuse. I do not have years to teach you my profession.\n\nI think I am done here.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "Fmeson",
                                                    "body": ">Are you asking me a serious question or do you just want to be contrarian?\n\n\nI'm sorry if I gave you a different impression, but it's a serious question. My question isn't \"can ils land a plane\" but \"can ils land a plane with no pilot input at all\".\n\n\n\n\nE.g., if there is something visually wrong with the runway, will ils abort the landing?",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "Maximus3311",
                                                            "body": "I'll answer this one for you since I'm an airbus captain at a legacy airline - no.  The autoland won't automatically go missed for any number of failures.  At my airline autolands are captain only and we're in the \"ready\" position (i.e. to go around either with autopilot on or manually if both autopilots fail).  We have a number of \"gates\" that we hit where we determine if we can continue the landing.\n\nI have no idea where that guy you're talking to developed his opinions - but for what it's worth every professional pilot I know would think that guy is nuts.\n\nThe idea of a pilotless aircraft sounds great...until you remember that an aircraft is just a big computer.  Computers fail all the time.  And most computers (like the one I'm typing on) exist in a mostly static environment.\n\nSo now take a big flying computer, fill it with passengers, and then send it out into the elements where things like weather/turbulence/etc can change rapidly.\n\nHis ideas? They make no sense.",
                                                            "score": 24,
                                                            "replies": [
                                                                {
                                                                    "author": "ModerateTrumpSupport",
                                                                    "body": "The concept of moving towards automation makes sense though. I 100% agree that a plane is a giant computer, and in some ways we have towards less and less human intervention like having segments where autopilot is doing most of the work.\n\nIn some ways we're there with cars already. On Teslas, I'm more or less comfortable with it driving itself once I get out of my residential roads and onto the main road. I trust it can handle highways too, but on the way home, after it turns onto my street, I'm the one who takes it into the driveway and into my garage.\n\nI think we'll still need humans to do the trickier maneuvers for some time.\n\nSo yes at a high level moving away from having humans handle every single tiny aspect is where most technology has gone, and leaving higher level decisions and judgement calls to humans while computers focus on more simple things to allow the human to have better overall situational awareness.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "whateverisgoodmoney",
                                                                    "body": "Lets talk commercial pilot to commercial pilot.\n\nThe redundant systems currently are human pilots that could be easily replaced by additional redundant systems. I know you want to protect your job, but the facts speak for themselves: when humans are left in control of the aircraft in an emergency that results in a crash, it is far more than half the time that the human causes the crash. This is the case without redundant systems.\n\nIt is statistically a huge win to remove the human from the cockpit. PIC is an outdated notion and it would be better to have a crisis team on the ground running the QRF than know-it-all pilots like yourselves flying the aircraft to the scene of the crash.\n\nYour ideas? They statistically favor far more human deaths. So you can keep your job.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Maximus3311",
                                                                            "body": "Tell you what - we can talk pilot-to-pilot when you can explain to me why you (for some reason) believe it’s the *law* that you can’t hand fly between 600’ on climbout and 200’ on landing?\n\nGiven everything you’ve said - including somehow having total faith in aircraft redundancy being perfectly safe - I don’t believe you’re a pilot at all. \n\nNo one who’s even been through even private pilot training would buy into the whole “you can’t hand fly”. Also autopilot is absolute garbage on an ILS with gusty winds. An even remotely competent pilot will fly worlds better than autopilot in those conditions. \n\nBut hey - you show me the “LAW” (your word) about not being allowed to hand fly between 600’ and 200’ and we can talk.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "whateverisgoodmoney",
                                                                                    "body": ">Tell you what - we can talk pilot-to-pilot when you can explain to me why you (for some reason) believe it’s the *law* that you can’t hand fly between 600’ on climbout and 200’ on landing?\n\nDepends on your operating agreement with the FAA. That is essentially law. If you break it, you are not just in trouble with your company, but the FAA as well. And every Part 121 and 135 company has a separate agreement with the FAA.\n\nDo you disagree with this?\n\n>Given everything you’ve said - including somehow having total faith in aircraft redundancy being perfectly safe - I don’t believe you’re a pilot at all.\n\nReasonable. I am not sure you are either. At least not a commercial pilot. You seem to have a complete lack of knowledge regarding operating agreements with the FAA.\n\n>No one who’s even been through even private pilot training would buy into the whole “you can’t hand fly”. Also autopilot is absolute garbage on an ILS with gusty winds. An even remotely competent pilot will fly worlds better than autopilot in those conditions.\n\nI never said \"cannot fly\". I am saying that your operating agreement under Part 121 or 135 likely does not allow you to hand fly aircraft after takeoff or far under DH.\n\nI disagree with autopilot being useless under crosswind landing conditions. Sure, I could probably defeat stronger crosswinds better with a slip, but you and I know (do you?) that unless it was an emergency, we would never do that.\n\n>But hey - you show me the “LAW” (your word) about not being allowed to hand fly between 600’ and 200’ and we can talk.\n\nAgreed, LAW was hyperbolic.\n\nIts in your companies operating agreement with the FAA. This is not something where you get scolded by HR. You will face actual repercussions by the FAA if you break the operating agreement.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Maximus3311",
                                                                                            "body": "That's not hyperbolic.  No pilot would ever say that.  You were just flat out incorrect. And no actual pilot would ever say that.\n\nThis is what you said:\n\n\"hahaha after 600 feet autopilot engage, for landing, 200 feet autopilot disengage, BY LAW becaue autopilot flies better than humans\"\n\nA third autopilot? We already have 2 - and often the reason an autopilot system fails is another system fails that makes the autopilot unable to operate.  Hell you could have 10 autopilot systems (instead of the 2 we have) but if another aircraft system fails that renders the autopilot unable to do its job then you have 10 inop AP systems.\n\nIt's been long time since I flew the CRJ but I had a stab trim runaway (once - it was one of the scariest things that's ever happened to me).  I had to hand fly the rest of the flight.  As I recall AP was unavailable.  And honestly you wouldn't want the AP on with a control surface malfunction.  That's a good way to kill everyone onboard (and for a bonus possibly some innocent people on the ground).\n\n\"I never said \"cannot fly\". I am saying that your operating agreement under Part 121 or 135 likely does not allow you to hand fly aircraft after takeoff or far under DH.\"\n\nWhich company has, in their manuals or hell - anything in writing - that \"does not allow you to hand fly aircraft after takeoff or far under DH.\"\n\nI also didn't say the autopilot was \"useless\" - it just doesn't generally handle wind gusts nearly as well as an even semi competent human pilot.  When I flew the CRJ700/900 we didn't have autothrottles so those were all on the pilot.  Hell half the time when you'd kick off the autopilot on the ILS most of the \"bumps\" would go away.\n\nThe airbus seems to handle gusts somewhat better than the CRJ and the mini groundspeed function of the autothrust does a \\*better\\* (but not great) job in gusty conditions.  But the engine spooling still lags.\n\nAnd don't even get me started on the CAT III wind limitations (not just x-wind and tailwind but headwind limits as well).  Hell half of my flights in the summer would have to be canceled if we had to rely on autoland.\n\n\"Reasonable. I am not sure you are either. At least not a commercial pilot. You seem to have a complete lack of knowledge regarding operating agreements with the FAA.\"\n\nI'll tell you what - I don't care whether you believe I'm a pilot or not.  I don't have any reason to lie about it.  And if you got really bored you could dig into my post history - it's a hell of a longer than yours.\n\nBut hell - I'll give you that one.  I'm not management and I don't work in the chief pilot's office.  I'm just a dumb, barely literate line pilot.  I don't make up my own checklists or policies.  They tell me \"you do it this way\" and I do it.  They sign the checks and I do what I'm told (as long as safety isn't compromised).\n\nWe'll let the people on here make up their own minds.  I'm sure there are some other people who've gone through even minimal flight training on here who can make the determination themselves.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Maximus3311",
                                                                            "body": "Also - I’m going to keep my job because it’s common sense. Systems (including autopilot) fail. \n\nWhat happens in your scenario when the autopilot dumps out? \n\nI’ll give you a hint - unless there’s someone onboard who can fly the plane everyone dies. \n\nAgain - you’re not a pilot because no pilot with even a passing familiarity with system failures would advocate for pilotless aircraft.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "whateverisgoodmoney",
                                                                                    "body": ">Also - I’m going to keep my job because it’s common sense. Systems (including autopilot) fail.\n\nYou have 3 redundant systems, just like spacecraft. Ultimately, it is cheaper to do this versus paying two pilots, or even just one pilot. The only reason you have a job is public fear. And hey, whatever, if you can make a living because of the irrational public, I get it.\n\nThe problem is, statistically, when the emergency occurs that results in a crash, 75%+ of the time, the crash is human error. You seem to think that only humans can fly airplanes. And your whole argument relies on Autopilot failing. Would you FEEL better, since feelings seem to be all that matters here, if we have 10 redundant autopilots?\n\n>Again - you’re not a pilot because no pilot with even a passing familiarity with system failures would advocate for pilotless aircraft.\n\nPretty much all of my pilot colleagues love their jobs and agree with you. They poured a ton of money and time into a job that really no longer needs to exist, so I understand.",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Maximus3311",
                                                                                            "body": "\"The problem is, statistically, when the emergency occurs that results in a crash, 75%+ of the time, the crash is human error. You seem to think that only humans can fly airplanes. And your whole argument relies on Autopilot failing. Would you FEEL better, since feelings seem to be all that matters here, if we have 10 redundant autopilots?\"\n\nYou're absolutely correct.  I'll do you one better and say that CFIT is greater than 75% of crashes.  I'm almost positive, given the video that just came out of Toronto (I used to fly a CRJ and I flew into Toronto constantly) that whoever was flying got on the backside of the power curve, sank, didn't add power, and hell it didn't even look like they tried to flare.  They beat that runway like it owed them money.\n\nBut the \\*reason\\* that the vast majority of crashes are pilot error?  Because when a system goes sideways there's a pilot there to correct for it.\n\nI had a stab trim runaway on a CRJ 700.  I had to wipe the sweat off my palms a bunch of times before we landed but I dealt with it.  Without a pilot at the controls hand flying and adjusting for a failed control surface - how well is an autopilot going to do?\n\nAutopilot is a tool and it does a great job under the right conditions (which admittedly are most flights) - but systems fail that render the autopilot unable to safely control the aircraft.\n\nYou are right though - I know enough about aircraft systems and failures that I'd be terrified to get on a fully automated aircraft with a human pilot at the controls to address critical system failures.\n\nBut you're right - it might be cheaper.  As long as fatal crashes don't scare the flying public into staying off aircraft it's probably cheaper to pay insurance claims to the families of the dead passengers than it is to pay for 2 pilots on every 121 flight.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Maximus3311",
                                                    "body": "\"Your ignorance is not an excuse to be obtuse. I do not have years to teach you my profession.\"\n\nWhat profession? I'm going to say this as nicely as I can - based on the factual errors you've made (i.e. talking about when pilots are/are not allowed to hand fly) I don't believe you're in my profession.\n\nFor people who are reading this - what he's saying is akin to someone claiming to be a doctor and saying they're not allowed to conduct surgery before they've tried using leeches first to get out the \"bad blood\".\n\nBut I'm honestly interested - if you are, in fact, a pilot - what kind of flying are you doing with your commercial rating? And are you perhaps confusing the FARs with your company's SOP?\n\nBecause we're not just allowed to hand fly (outside of RVSM or on certain approaches like autolands or RF Legs on RNP approaches) but we're encouraged to do so.\n\nSo again - where did you get your training and what type of flying are you doing? Because (respectfully) what you're telling these people is wholly incorrect.",
                                                    "score": 17,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Maximus3311",
                                                    "body": "ILS CAT III...I did my first one as a captain on IOE. Guess what? The aircraft failed the autoland. We were lucky we were VMC and it was a \"practice\" landing. At around 15' (ish) the aircraft pitched up hard and then started to nose over (the rate it was nosing over didn't appear to be what I would have considered \"safe\"). I kicked off the autopilot and hand landed the plane fine. Who knows what would have happened if I just closed my eyes and let the autoland do its thing?\n\nAnd also - have you ever flown a CAT III? There are all sorts of limitations for even a CAT III Dual (i.e. systems that have to be functioning as well as pretty strict wind limitations).\n\nThe autoland is a tool - like everything else in aviation there are appropriate times to use that tool. And there are times you \\*can't\\* use it.",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "rasmorak",
                                                    "body": "Are you confusing your SOPs with the FARs?",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MyOwnGuitarHero",
                                    "body": "Can it land itself in 0 visibility?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Maximus3311",
                                            "body": "Actually - it can.  On a CAT III ILS (edit to add: CAT III Dual - meaning everything is onboard is working.  A CAT III Single there are some combination of INOP systems and we have to have the runway in sight when we hit 50') approach you can land in 0 vis.  I don't know about other aircraft types but I do know Airbus (it's the only plane I've flown with autoland capability).  On a successful CAT III landing it won't only land in 0 vis - it'll hold you on the runway centerline (and you have to kick off the autopilot to taxi off the runway - otherwise it'll attempt to hold you on the runway centerline).\n\nHowever - this is assuming that (a) the aircraft has the necessary (and working) required equipment (b) the airfield has the working and required equipment and (c) the outside conditions (i.e. wind speed/direction, runway condition, etc) meets the requirements.\n\nAnd these landings have pretty tight performance windows.  If there's too much wind (and the allowable wind speed - even for a direct headwind) you can't (at least in an airbus) legally perform an autoland.\n\nSince I need to ask a clarifying question - I hope you found that informative?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MyOwnGuitarHero",
                                                    "body": "That’s absolutely incredible! Damn. Do you think we’ll get to the point in the future where we mostly have planes flying themselves with a “remote pilot” somewhere else to monitor and/or intervene in emergencies? I’m kind of imaging like the “unmanned drone” setup, just for commercial aviation. \n\nAlso, thanks for indulging my tangents on this. My dad (rest his soul) was a private pilot, instrument rated. I basically was raised in the cockpit of a Beechcraft Baron 🥲",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Maximus3311",
                                                            "body": "Eventually? Yes I think that's likely.  But the \"when\" is the real question.  The other guys is adamant that we're ready for it now.  So I'll say two things about that:\n\n1. I don't think he's correct (at all). I've seen way too many system/mechanical failures in my time flying passengers that would have ended tragically without human pilots at the controls.  But instead of a crash - I had sweaty palms and the passengers deplaned none-the-wiser.  That's how it's supposed to be.\n2. Even if the tech currently exists - it's going to be cutting edge.  Airlines aren't just going to replace every plane they have with untested systems.  Everything in aviation takes a long time - and that's how you want it.  The adage is that the FARs (federal aviation regulations) are written in blood.  Look at the collision between the CRJ and blackhawk at DCA.  People have been complaining about those helicopter routes for a long time.  But they only started to make changes there after a catastrophe.\n\nAnyway so even if we do currently possess the tech (I don't believe we do to a level that's failsafe) airlines won't do it for a long time.\n\nAt the end of the day I think (for even current cutting edge tech) there are just too many variables to turn it all over to a machine.  Think of what Sully did landing on the Hudson - there's no way any technology we have could have done that without being specifically programmed for it (I'll be honest - I like to think I'm really good at my job but...damn that guy nailed it and I'm in awe of him dead sticking that airbus onto the Hudson).\n\nThere are also places in our checklist where it says something like \"if this...then do this.  If that...then do this other thing\".\n\nDo we have perceptible smoke? What does it smell like? Where is it coming from? These are things that automation can't (as of yet) do with any degree of precision.  At the end of the day not everything is a mathematical equation - and pilot are there (primarily) for when things don't go right.\n\nI think that's awesome you grew up around aviation.  I didn't (my dad was a math professor - oddly I think it skips a generation because math isn't one of my strengths) and I'm jealous of that.  I hope you have a lot of happy memories flying with your dad! I'd love to take my daughter up...but my wife is terrified of GA.  I made the mistake (when we were dating) of bringing her along on a flight from LA to Vegas in the middle of the summer.  I'm sure you can imagine that it was slightly bumpy.  Plus she sees all the GA crashes and doesn't want me or our daughter anywhere near a small plane.\n\nI guess that's good though...she's not in a rush to cash in on my life insurance.  Seems she still wants me around :)",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Tachyonzero",
                            "body": "Yes, it’s called “drone”.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "Fmeson",
                                    "body": "I appreciate the answer, but I'm not sure that is a sufficient explanation for a layman. It is no doubt technically possible to autonomously pilot vehicles, including airplanes, however, that does not mean a system exists that is sufficient to autonomously pilot commercial aircraft. I'm sure such a thing is being developed, but I am no expert in this field. Does such a thing exist?",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "Mister_Spacely",
                                    "body": "Can I take a commercial drone across the country?",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dr1968",
                    "body": "I thought you were a climatologist?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "MajesticMoomin",
                            "body": "A climatologist/commercial pilot who also puts 40+ hours research into every topic he reads about, apparently?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Maximus3311",
                                    "body": "He also told me has has advanced physics degrees.  A very busy person I guess?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rasmorak",
                    "body": "I've met a handful of GA pilots who are very pro Trump, but I have not met many supporters who are paid to fly. Out of curiosity, what are your ratings and licenses? I'd love to get your more nuanced opinions on Trump as he relates to aviation, if possible?",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Single_Extension1810",
                    "body": "Very interesting take. Is the technology there to do this though?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Maximus3311",
                            "body": "Technology fails.  I've flown plenty of aircraft that have had failures I had to deal with.  I don't know where this guy got his ideas.  Maybe he's the luckiest pilot \\*ever\\* and nothing has ever failed on him?",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "whateverisgoodmoney",
                                    "body": "I think you are trying to convince people why you are necessary when you are not. Do not worry, this whole argument is not about what is statistically the better choice or what is currently technologically possible, but what you and most other humans FEEL: that a human must fly the aircraft for it to be safe.\n\nYou know full well, if you are actually a commercial pilot, that humans cause the vast majority of crashes, and they are not mechanical, but simply pilot error.\n\nAdditional redundant systems and at the very least, elimination of PIC would solve all of this.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "Maximus3311",
                                            "body": "Sorry - I know I said I was done but this is just too funny:\n\n\"elimination of PIC would solve all of this\"\n\nWhat does that even mean? The PIC is the pilot in command.  If you remove one pilot then the other pilot becomes the PIC.\n\nIn a single pilot aircraft there's still a PIC - you just don't have a Captain/FO crew dynamic.\n\nBut maybe I'm misunderstanding - can you walk me through your thought process?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "whateverisgoodmoney",
                                                    "body": "I have made my final comments. I wish we had met under other circumstances and not in a political sub, I believe this would have been a much more productive conversation. I did however enjoy what you had to say, and your comments are pretty much in line with all of my colleagues, so I am the odd man out.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "whateverisgoodmoney",
                            "body": "It has existed for over 20 years. There is no reason to have pilots in aircraft except for public feelings.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ivanbin",
                    "body": "\n>Want to reduce airplane crashes? Take the human out of the cockpit.\n\nSo you want to lose your job? What will you do when replaced by automatic pilots that don't need a human in the cockpit?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Maximus3311",
                            "body": "I'm going to clue you in - that guy isn't a pilot.  He's lying. I always wonder why someone would lie about their profession?  He's not going to change anyone's mind when he gets called out for lying about the type of work he does.\n\nIt's not like we're an ultra rare profession - and I've flown with lots of MAGA men and women so they're in the profession (and likely some on this forum as well).\n\nBased on the things he said that are just \\*patently\\* false he's not going to lose his job.  Because whatever he does for work it's not on a flight deck.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "whateverisgoodmoney",
                                    "body": "Just so everyone else reading this knows, I am not sure this guy is a pilot either. If he is, I doubt he is from the US. He has no idea how operating agreements for Part 121 or 135 companies operate.\n\nHe also wants you to not know the following:\n\n* Statistically, when 75% of crashes are human error, and has been since the mid 90s, the goal for public safety should be to remove humans the cockpit. Unfortunately, we have tons of training, emergency checklists, but human pilots think they can \"out smart\" all of it all the way to the crash site. No training has reduced pilot error from crashes.\n\nHe is doing everything he can to avoid this comment, despite me having made it in several other comments. He only wants to save his job, he does not care about lives.\n\nSo his only last bastion of argument is saying I am not a pilot. Read the entire thread and decide for yourself.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Maximus3311",
                                            "body": "Friend I think we've beaten this horse to death.  I'll say this one more time - I'm a captain at a legacy (US) airline.  Believe me or not - I honestly don't care.\n\nAnd I've addressed this:\n\n* Statistically, when 75% of crashes are human error, and has been since the mid 90s, the goal for public safety should be to remove humans the cockpit. Unfortunately, we have tons of training, emergency checklists, but human pilots think they can \"out smart\" all of it all the way to the crash site. No training has reduced pilot error from crashes.\n\nMultiple times.  But hey I'm off today so I'll do it again - the reason this is the case (aside from the fact that the \\*vast\\* majority of crashes are GA) is that when an aircraft system fails there are well trained pilots who deal with the emergency.  I know this is cliche - but I'll point your attention to Sully.  They lost both engines and were on emergency power until they got the APU running.\n\nDo you think \\*anyone\\* on that plane would be alive today if the aircraft were fully automated?\n\n\"He is doing everything he can to avoid this comment, despite me having made it in several other comments. He only wants to save his job, he does not care about lives.\"\n\nI do love my job - but my job is to get people from point A to B safely always and on time when able. Not caring about lives is trying to save money by fully automating a system that isn't ready for full automation.\n\n\"He has no idea how operating agreements for Part 121 or 135 companies operate.\"\n\nI'll give you that about 135 - I've never worked for a 135 operator.  I was a CFI for a 61 school and then went straight to the regionals from there.\n\nI'm also not in management - I'm given my operating parameters from people way smarter than I am and I operate under those.  My first captain upgrade I was given a wonderful piece of advice: \"If something goes wrong and you're sitting at the end of a long table in a chair with no armrests and the FAA and company asks: 'Why did you do xxxx?' - if you can point to the manual and say 'I did xxxx exactly this way because this is how you told me to do it' - that's generally your get out of jail free card'\"\n\nAnd before we finish I'm going to go back to one of your previous (incorrect) statements:\n\n\"There is a reason we are prohibited from hand flying during any other segment of the flight.\"\n\n\"Prohibited.\"  More hyperbole?\n\nAll those flights that have been dispatched with the AP INOP...were those prohibited (provided they stayed out of RVSM airspace)?\n\nAnyway I'm done going back and forth with you.  But I'll agree with your last point:\n\n\"Read the entire thread and decide for yourself.\"",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "whateverisgoodmoney",
                                                    "body": "I wrote a response to another comment of yours recently, and I think that we could have had a very nice discussion had this not been in a political sub.\n\nI started out as a flight instructor and amassed 1500 hours then went to a 135 operation. I now work for a 121 operation, but fly mainly overseas.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "whateverisgoodmoney",
                            "body": "I have advanced degrees in Physics. I will be just fine.\n\nMost pilots like u/Maximus3311 spent a buttload of cash and many years to get to where they are, and do not want anyone to think they are replaceable.\n\nThe good thing is for them, public fear is on their side. They are not losing their jobs anytime soon. I would even argue that until autonomous driving is universal, and people realize that tech will save 30,000 lives per year in the US, that they, and myself, are in no way at jeopardy of losing their jobs.\n\nStatistically, when 75% of crashes are human error, and has been since the mid 90s, the goal for public safety is to remove humans the cockpit. Unfortunately, we have tons of training, emergency checklists, but human pilots think they can \"out smart\" all of it all the way to the crash site.\n\nI am arguing like a physicist. Everyone else here arguing is simply based on feelings.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Maximus3311",
                                    "body": "Wow so you have advanced degrees in physics \\*and\\* you're a pilot making a living flying? Busy guy.\n\nYou know the difference between an autonomous driving car and an aircraft? If a car has a system failure it can pull over and the occupant can get out.  And if it crashes? A few people die.  Not hundreds. \n\n\"Statistically, when 75% of crashes are human error, and has been since the mid 90s, the goal for public safety is to remove humans the cockpit. Unfortunately, we have tons of training, emergency checklists, but human pilots think they can \"out smart\" all of it all the way to the crash site.\"\n\nI'll repeat this until I'm blue in the face - the reason that's correct is because when there's a critical system failure (not just a caution but a warning) there's a pilot to fly the plane and talk to ATC and another pilot who manages the emergency.\n\nWe do get paid a lot - and the reason is that when systems fail we're trained to deal with an emergency and get the plane on the ground.  Without pilots at the controls of crippled aircraft the numbers would be a lot different.  Hell - I haven't had a very \"exciting\" career and I can think of at least three instances where, if there hadn't been a pilot (i.e. me and the other pilot) at the controls the plane probably would have ended up in the dirt.\n\n\"I am arguing like a physicist. Everyone else here arguing is simply based on feelings.\"\n\nSo you understand the physics of flight but you clearly don't understand the mechanical operation of an aircraft.  You're arguing for a third autopilot - but there are plenty of system failures that render \\*all\\* AP systems INOP (whether you have 2 or 10 it doesn't matter - none of them will work).\n\nBut I'll give you this:\n\n\"Unfortunately, we have tons of training, emergency checklists, but human pilots think they can \"out smart\" all of it all the way to the crash site.\"\n\nYou're not wrong about that.  Intentional non-compliance to SOPs (or standardization of deviation as we like to call it) is a real problem.  Hell people can have the FAA sitting on the jumpseat and they're still engaging in casual conversation in sterile.  And I've flown with people (at every airline when I was a FO) who wanted to do things their own way.\n\nDeviation from checklist discipline and SOP is a huge problem - but it's not as big of a problem as turning over everything to a computer.\n\nYou and I both know we're headed there (eventually) - but the tech isn't there yet.  It's not reliable enough (yet) to stick 150+ people in a fully automated metal tube and launch them into the elements.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "whateverisgoodmoney",
                                            "body": ">Wow so you have advanced degrees in physics \\*and\\* you're a pilot making a living flying? Busy guy.\n\nYes, I highly enjoy math. I even tutor university students to this day, for free, for fun. Including statistics.\n\n>You know the difference between an autonomous driving car and an aircraft? If a car has a system failure it can pull over and the occupant can get out. And if it crashes? A few people die. Not hundreds.\n\nAgreed. However, your whole argument is based on ground communication and/or autopilot failing, but you sidestep everything I say about redundant systems. As if there can only be 1 autopilot in the aircraft.\n\n>I'll repeat this until I'm blue in the face - the reason that's correct is because when there's a critical system failure (not just a caution but a warning) there's a pilot to fly the plane and talk to ATC and another pilot who manages the emergency.\n\n>We do get paid a lot - and the reason is that when systems fail we're trained to deal with an emergency and get the plane on the ground. Without pilots at the controls of crippled aircraft the numbers would be a lot different. Hell - I haven't had a very \"exciting\" career and I can think of at least three instances where, if there hadn't been a pilot (i.e. me and the other pilot) at the controls the plane probably would have ended up in the dirt.\n\nApparently that training has reached a plateau, and has so for 30 years. The obvious conclusion to anyone with a math based training is to reduce human error. This could be done with redundant systems (including autopilot).\n\nListen, I do not think that you are an idiot. I went through the same training you did, I have to do the same training every few months as you likely do, but lets face it, we live in a world where machines can simply do better than we can. If that feels insulting to you, I do not know what to tell you.\n\n>So you understand the physics of flight but you clearly don't understand the mechanical operation of an aircraft. You're arguing for a third autopilot - but there are plenty of system failures that render \\*all\\* AP systems INOP (whether you have 2 or 10 it doesn't matter - none of them will work).\n\nWhich is why I said redundancy for all systems when possible. This is why we have 2 engines instead of one, and the one engine must maintain a certain altitude. Sure, the second engine can go out and we are a flying coke machine, and you will not be able to save the crash, and it will be evaluated as mechanical error (unless the pilot did something to the 2nd engine, which is more likely), but what is the probability of that happening? All of this is built in to the safety equation.\n\n>Deviation from checklist discipline and SOP is a huge problem - but it's not as big of a problem as turning over everything to a computer.\n\nI agree it is a huge problem, but disagree that automated systems would be better and you are providing no evidence to support your claim.\n\n>You and I both know we're headed there (eventually) - but the tech isn't there yet. It's not reliable enough (yet) to stick 150+ people in a fully automated metal tube and launch them into the elements.\n\nI feel extremely confident that it is. However, you are correct, until public perception and those in the industry accept that it is, it is a dead issue.\n\nI feel very good about this being a good ending point to our discussion. I apologize for my snarky-ness, and feel that if that was not a in a political sub we would have had a much more friendly discussion where at the end we disagree as to the timeline, but ultimately, I agree, this is where we are headed.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Maximus3311",
                                                    "body": "\"but you sidestep everything I say about redundant systems. As if there can only be 1 autopilot in the aircraft.\"\n\nI didn't sidestep it - I addressed it but I'll do it again.  Every commercial aircraft I've ever flown has had 2 independent AP systems.  However you can have \\*other\\* systems fail that render every autopilot INOP.  3 systems?  Hell 10 systems? It doesn't matter.  With certain system failures (outside of the autopilot) no autopilot will work.  So if you have one of those system failures and the AP becomes unavailable - without a pilot at the controls you've got a very expensive lawn dart.\n\n\"I feel very good about this being a good ending point to our discussion. I apologize for my snarky-ness, and feel that if that was not a in a political sub we would have had a much more friendly discussion where at the end we disagree as to the timeline, but ultimately, I agree, this is where we are headed.\"\n\nYou may be right.  In general when politics are involved people tend to get their hackles up.  But this is also (for obvious reasons) very near and dear to me.  The safety of my passengers and crew is the most important thing to me - by a wide margin.  The bean counters want to try and push automation that isn't ready for prime time to save money.\n\nIt's not just the elimination of my job that bothers me (although I'm a human being and I care deeply about my career) - but it's the callous disregard for human life in the attempt to save money that really gets to me. Mark my words - fully autonomous aircraft \\*will\\* crash at a greater rate than aircraft with human pilots.  Like I said - I've had 3 flights (that I can think of off the top of my head) that likely would have led to fatalities without humans at the controls.  Instead we landed and the passengers had no idea (just the way it should be).\n\nWe'll be fully automated someday.  But the tech isn't there yet.  The good news is we probably won't have to wait \\*too\\* long to find out which one of us is right.  They're definitely going to allow fully autonomous aircraft flying cargo way before passengers.\n\nSo when they allow that I'll think back to this exchange and watch the results with extreme interest.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "whateverisgoodmoney",
                                                            "body": "Thank you for this well thought out response. This is how I think, had we not started in a political sub, that we would have come to this conclusion must earlier.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Maximus3311",
                                                                    "body": "I do my best - and I agree.  Outside of a political sub it probably would have been a much more civil conversation?\n\nAlthough...I wouldn't ever tell a large group of pilots that fully automated aircraft would be safer.  Go into a big group of us and start saying that - not sure how civil that conversation would be.\n\nAs they used to say in the Old West - \"Them's fightin' words\"",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "whateverisgoodmoney",
                                                                            "body": ">I do my best - and I agree. Outside of a political sub it probably would have been a much more civil conversation?\n\nYes I think so. We were set before we even talked to each other to not just disagree, but defend our positions as if this was a matter of politics. When in reality, our basic arguments were for or against automation.\n\n>Although...I wouldn't ever tell a large group of pilots that fully automated aircraft would be safer. Go into a big group of us and start saying that - not sure how civil that conversation would be.\n\nOh yes, my views are wildly unpopular with pilots, I agree. Like I said, non of my colleagues agree with me. But they all agree that this is the future.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ModerateTrumpSupport",
                    "body": "Yup, humans are the biggest risk in the whole chain. I work in production and automation and it's absolutely the goal to move towards automation and away from humans making judgement calls.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DidiGreglorius",
            "body": "This phrasing of the question is really silly to me. The idea that agency headcount should not be reduced any time a bad thing happens under its purview is illogical at best and terrible incentive alignment at worst.",
            "score": -5,
            "replies": [
                {
                    "author": "DisorganizedSpaghett",
                    "body": "Many of the failures of the aviation industry today are focused around overworked and understaffed employees handling more workload per hour than if they were actually fully staffed. How would further reducing this during an expanding population make this situation better?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "sheila5961",
                            "body": "The FAA has about 50,000 employees. Trump fired/laid off 300 people that were ALL in NON-SAFETY roles. Those’d firings had NOTHING to do with this crash.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -6,
            "replies": [
                {
                    "author": "SookieRicky",
                    "body": "Not OP, but my question is this:  globally speaking, the FAA has an unmatched safety record, so what are these firings based on?   \n\nWas there some sort of secret study performed showing that certain FAA employees are redundant and unnecessary?  \n\nOr is this just political theater at the expense of our safety?",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Dijitol",
                    "body": "So what are your thoughts?",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Competitive_Piano507",
                    "body": "Yes but those fired were people who work on the infrastructure. Would you feel safe knowing there was I don’t know, a shortage of airplane mechanics?",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrhymer",
            "body": "From the linked article: \"Probationary workers are typically new to the organization, with many having been employed for less than a year.\"\n\nTrump is letting go the Biden bureaucrat hires to free up money to hire the highly qualified air traffic controller candidates that were not hired in the last administration.",
            "score": -41,
            "replies": [
                {
                    "author": "Competitive_Piano507",
                    "body": "That’s not 100% true. Those who are promoted also become probationary workers to ensure they are doing the job correctly of their new position. Also the article states none of them were air traffic controllers controllers. Do you feel more safe knowing that we now have a staff shortage in various area like airplane mechanics since it will take a while to replace them, if they will even be replaced at all?",
                    "score": 46,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": ">That’s not 100% true. Those who are promoted also become probationary workers to ensure they are doing the job correctly of their new position.\n\nI don't think that is true. What is your source for this information?\n\n>Do you feel more safe knowing that we now have a staff shortage in various area like airplane mechanics since it will take a while to replace them\n\nYes I think we can safely drop back to 2023 levels of staffing without any disruption whatsoever.",
                            "score": -27,
                            "replies": [
                                {
                                    "author": "Fluffy_Bottle_7303",
                                    "body": "Do you not understand how government probationary periods work?",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "Yes - initial hire probationary is two year where you can be fired summarily.\n\nPromotion probationary is 1 year where you can be demoted to your former level without cause.",
                                            "score": -13,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Detman0",
                                    "body": "Info on probationary periods: https://federalnewsnetwork.com/workforce-rightsgovernance/2025/02/what-are-the-rules-for-probationary-periods-and-federal-employees/?readmore=1\n\nFrom the article: Importantly, a probationary period is not limited only to new employees entering the federal workforce for the first time. Employees who move into the Senior Executive Service, for example, or those who take an extended break from working for the federal government before returning to work at an agency, will usually have to complete a one-year probationary period.\n\n“If you’re essentially doing the same job that you were doing at agency A, and you’re now doing that at agency B, and there was just a week or two gap in between when you left agency A to start at agency B, then you can tack on your prior service at agency A to your tenure,” D’Agostino said in an interview. “But, for example, if you’re going to school to get a degree in something specialized while you’re working at one agency, and then you get a completely different type of job at another agency, you usually can’t tack on your prior service.”\n\nAlso, (not from the article), someone could be a federal contractor for decades, get a federal position using their expertise, and they would start on probation. Someone who gets promoted to a supervisor role, no matter how long they have been a federal employee, would have a probationary period.\n\nHope this helps?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "I think the new rules are if you are in any kind of probationary period and you did not take the sweet buyout offer you are gone with probationary severence only.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MysteriousHobo2",
                    "body": "> Trump is letting go the Biden bureaucrat hires to free up money to hire the highly qualified air traffic controller candidates that were not hired in the last administration.\n\nDo you have a source on this?",
                    "score": 26,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "It's just my speculation.",
                            "score": -27,
                            "replies": [
                                {
                                    "author": "MysteriousHobo2",
                                    "body": "Well hopefully your speculation is right, but that isn't looking the case since it looks like he is just firing people to cut down on the overall size and isn't looking closely at who is actually getting fired, for example, the nuclear workers that \nwere fired and the gov is scrambling to rehire: \nhttps://www.bbc.com/news/articles/c4g3nrx1dq5o\n\nAnd it seems really strange you emphasize 'highly qualified air traffic controller candidates that were not hired in the last administration.' with no sources backing that up. Have you seen any actual evidence that 'highly qualified air traffice controllers' were not hired by the previous admin?",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": ">Well hopefully your speculation is right, but that isn't looking the case since it looks like he is just firing people to cut down on the overall size and isn't looking closely at who is actually getting fired\n\nMight I remind you it has not even been a month. Most presidents get 100 days before the freakouts to this level.\n\n>And it seems really strange you emphasize 'highly qualified air traffic controller candidates that were not hired in the last administration.' with no sources backing that up. Have you seen any actual evidence that 'highly qualified air traffice controllers' were not hired by the previous admin?\n\n3800 people according to the NY Post\nhttps://nypost.com/2025/02/10/us-news/air-traffic-controller-shortage-of-3800-due-to-dei-practices/\n\nNewsweek tells us of a major class action lawsuit that has been filed.\nhttps://www.newsweek.com/faa-reject-air-traffic-controllers-race-airport-crash-2024097\n\nThere is a lot more - but you can search as well as I can.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MysteriousHobo2",
                                                    "body": ">https://nypost.com/2025/02/10/us-news/air-traffic-controller-shortage-of-3800-due-to-dei-practices/\n\nFrom this article, it looks like the suit was filed in 2015, and the part they were suing about, the 'biographical assessment' was removed in 2018. The newsweek article is about the same lawsuit.\n\nSo not only was this not the previous admin, the 'DEI' feature they are suing about hasn't been a factor in over 6 years. So I'm confused how this is evidence that this is an ongoing problem that Trump is actively solving with these firings?\n\n>Might I remind you it has not even been a month. Most presidents get 100 days before the freakouts to this level.\n\nI mean, most presidents don't fire this much of the government with this little oversight. It would be one thing if he was cutting the chaff and we knew he was only cutting the chaff. This seems like a machete taken to the whole thing and figure out the consequences later. From what I can see, that POV is generally supported by TS's, what are your thoughts on it?",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": ">From this article, it looks like the suit was filed in 2015, and the part they were suing about, the 'biographical assessment' was removed in 2018. The newsweek article is about the same lawsuit.\n\n>So not only was this not the previous admin, the 'DEI' feature they are suing about hasn't been a factor in over 6 years. So I'm confused how this is evidence that this is an ongoing problem that Trump is actively solving with these firings?\n\nThe point is not about the when or the who. It's about the qualified candidates that were not hired creating a shortage that did not need to be. \n\n>I mean, most presidents don't fire this much of the government with this little oversight.\n\nI am sick of that term oversight. Either the president is in charge of executive or he is not. Congress cannot be in charge of the executive. It is prohibited by the separation of powers in the constitution. By the same token the courts cannot be in charge of the executive. The only constitutional oversight of the president is removal, election, or limited terms. That is it. The courts can intervene on actions of the executive branch outside of the executive branch but that is all.  The congress can pass laws or remove laws but that is all.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "MysteriousHobo2",
                                                                    "body": "The executive is in charge of enforcing the laws that Congress passed, including the budget Congress has passed. \n\nThe executive cannot choose to not enforce laws passed. Where the courts come in is to define what not enforcing those laws looks like. Congress allocates money for a Government agency to do something, the President fires everyone in that agency, is that overstepping executive authority? \n\nThe courts have previously ruled on stuff like this and laws have been passed to make it so the President can't do stuff like not give the full amount that congress passed to an agency: https://bipartisanpolicy.org/explainer/budget-impoundment/ \n\n> Either the president is in charge of executive or he is not. Congress cannot be in charge of the executive.\n\nThe president is in charge of the executive, but executive has a very specific set of duties outlined in the Consitution and expanded upon/limited by Congress. If it goes outside those duties or there is a disagreement about the scope, the courts step in.\n\nThat is my understanding of the situation, do you agree with that?",
                                                                    "score": 9,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "yungvogel",
                                    "body": "….why do you think they didn’t hire qualified candidates the first time around?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "I did not say that did I.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": ">It is important to note that none of the FAA workers who have been fired are air traffic controllers.\n\nI know the investigation is ongoing but the person(s) responsible for making sure the helicopter avoided the plane should absolutely be fired.",
            "score": -29,
            "replies": [
                {
                    "author": "not_falling_down",
                    "body": ">person responsible for making sure the helicopter avoided the plane should absolutely be fired\n\nDoes it change your mind to know that it's documented that the controller conveyed all the correct instructions, but the helicopter black box shows that some of them were not received by the helicopter pilots? Who, in that case, is *the person responsible*?",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Horror_Insect_4099",
                            "body": "I'm not OP, but you ask what person is responsible?  Seems too early to tell.\n\nIf there are failures where communications verbalized by air traffic controller randomly not audible to pilots, that is terrifying.\n\nFrom:\n\n[https://www.nbcwashington.com/news/local/ntsb-update-deadly-crash-between-plane-army-helicopter-blackhawk-black-box/3845345/](https://www.nbcwashington.com/news/local/ntsb-update-deadly-crash-between-plane-army-helicopter-blackhawk-black-box/3845345/)\n\n\"Homendy said the Black Hawk crew never heard the words “pass behind the” during the transmission from the controller because the helicopter’s microphone key was depressed right then.\"\n\nThat sounds crazy.  Why should use of helcopter microphone block ability to hear incoming audio?  Bad design.\n\n\"Homendy said the helicopter was on a check flight that night when the pilot was being tested on the use of night vision goggles and flying by instruments. Investigators believe the crew was wearing night vision goggles throughout the flight\"\n\nAgain sounds crazy - surely there are better/safer ways to train military helicopter pilots on use of instrument only flights without endangering commercial flights.\n\n\"At one point during the flight before the collision the helicopter pilot being tested called out that the Black Hawk was at 300 feet, but the instructor pilot said the helicopter was at 400 feet, Homendy said.\"\n\nArticle speculates that this might be a bad/misleading altimeter reading.\n\n\"Shortly before the collision, a controller got an alert that the plane and Black Hawk were converging and asked the helicopter if it had the plane in sight. The military pilot said yes and asked for “visual separation” with the jet — allowing it to fly closer than otherwise may have been allowed if the pilots didn’t see the plane. Controllers approved the request\"\n\nDoesn't sound like good decision by controllers in hindsight.  If this approval in review is determined to not have been reasonable, someone still alive could be held accountable.",
                            "score": -7,
                            "replies": []
                        },
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "No idea. My mind was not made up at all and I'm not an investigator. Maybe it was the traffic controller, or the pilot, or co pilot, or a mechanic didn't do radio maintenance, who knows.",
                            "score": -15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DrJ0911",
                    "body": "The person responsible is dead. So who else should be fired? Also should they be fired if it will just understaff them more?",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "We will just have to wait and see what the investigation final report says. I personally don't leap to conclusions on massive investigations I have no professional knowledge of.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "One_Alfalfa_8408",
                                    "body": "Did it bother you when trump jumped to the dei conclusion immediately following the crash? Does it bother you now that trump is firing the faa employees in mass, which I'm assuming is him jumping to a further conclusion.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "Lucky-Hunter-Dude",
                                            "body": "No and no.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Lucky-Hunter-Dude",
                                                            "body": "How would I know?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "snakefactory",
                                            "body": "Okay.. I'll ask.. Why do you bother?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Horror_Insect_4099",
                                                    "body": "I'm here for actual conversations which can be interesting",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lavaswimmer",
                    "body": "The AP has reported today that the staff fired over the weekend included \"personnel that worked radar, landing, and navigational aid maintenance\". Does this change anything for you?\n\nhttps://x.com/NewsWire_US/status/1891581231768252536",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "no.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DisorganizedSpaghett",
                    "body": "Just to be clear, are you aware that because of long term staffing shortages at that location, there was nobody doing the helicopter communications, and the person handling the supposedly dedicated airplane communication has to go back and forth between these two jobs that entire day?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "fullstep",
            "body": "What is the purpose of posting this question? Is there something inherently concerning about firing FFA employees? Without any extra info, I assume this is just trimming of the fat from a bloated and inefficient bureaucracy, and to that end, I approve.",
            "score": -22,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 14,
                    "replies": [
                        {
                            "author": "fullstep",
                            "body": ">You assume there’s a ton of bloat, ineffectiveness, and corruption in any given Government department without receiving ANY evidence that support your claims.\n\nYou must be new to politics and have never held a job at a large company. Bureaucracy and bloat are a natural emerging quality of any complex organization. It's not a matter of IF it exists, it's a matter of how much. And there is plenty of evidence to support it. It's just a matter of whether or not you want to see it. It seems that with democrats, if they don't like the messenger, they deny the message, no matter how obvious and true it is. And the more obviously-true things they deny, the more that reasonable people will walk away form the party, which is what happened during the 4 years under Biden.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "AskTrumpSupporters-ModTeam",
                                            "body": "your comment has been removed for violating rule 3. Undecided and Nonsupporter comments must be clarifying in nature with an intent to explore the stated view of Trump Supporters.\n\nPlease take a moment to review the [detailed rules description](https://www.reddit.com/r/AskTrumpSupporters/about/rules/) and [message the mods](http://www.reddit.com/message/compose/?to=r/AskTrumpSupporters&subject=Comment+Removal) with any questions you may have.\n\nThis prewritten note was sent manually by one of the moderators.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AskTrumpSupporters-ModTeam",
                            "body": "your comment has been removed for violating rule 3. Undecided and Nonsupporter comments must be clarifying in nature with an intent to explore the stated view of Trump Supporters.\n\nPlease take a moment to review the [detailed rules description](https://www.reddit.com/r/AskTrumpSupporters/about/rules/) and [message the mods](http://www.reddit.com/message/compose/?to=r/AskTrumpSupporters&subject=Comment+Removal) with any questions you may have.\n\nThis prewritten note was sent manually by one of the moderators.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "coulsen1701",
                            "body": "You must have missed the commercial pilot who just told you there was massive bloat in the FAA. We’re the most unscientific yet the majority of commercial and military pilots lean right? Make that make sense.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "OldMany8032",
            "body": "Good, hire new employees based on merit and not based on what that person thinks they are. \n\nJust read a story last week that thousands of trainees in an FAA program were let go a couple years back because they didn’t fall into the DEI agenda. Government paid to train them then let them go because of “new set of standards”.",
            "score": -2,
            "replies": [
                {
                    "author": "sheila5961",
                    "body": "Wow! Had the Biden Administration and Pete Buttigieg let them complete training and start at the FAA, MAYBE this crash could have been avoided. It’s going to take YEARS to fix everything the last administration broke.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BlackBikerchick",
                    "body": "Was it confirmed they were hired through DEI? ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -5,
            "replies": []
        }
    ]
}