{
    "title": "Did you support Trump on 2016 and 2020?",
    "author": "HeartsPlayer721",
    "subreddit": "AskTrumpSupporters",
    "rank": 76,
    "score": 29,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 186,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1iuu7t9/did_you_support_trump_on_2016_and_2020/",
    "id": "1iuu7t9",
    "selftext": "I'm mostly interested in the people who say no to one or both of those, because I'd like to learn what changed your mind. \n\nWhat made you change your mind from not supporting Trump in the past to deciding he should be president in 2024?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "G0TouchGrass420",
            "body": "2016 i kinda didnt vote still not sure who I would of voted for. I dont think hillary was terrible per say.\n\n2020 yes.\n\nTrump was and is no saint but watching the media and liberal left go insane taking the things he says so extremely out of context just sends red flags to my brain. The propaganda is scary to me because I do believe that type of propaganda is what made the nazis and we have seen the result of this propaganda over the course of years. 2x assasination attempts on trump.\n\nSome of the big instances that really swung my support to him was the jan 6th stuff. \"very fine people hoax\" The non stop russia stuff. Censorship from social media and the gov't on republicans especially during covid (literally banned the president from twitter). Twitter files.....Mark zuckerburg backing up those claims up. Hunter biden laptop not that I cared about the laptop or hunter per say but the fact that it was heavily censored and banned and we were told it was all russian disinfo only to be found out it was true.\n\nThe 2x assassination attempts probably alone would make me vote for trump because I can't align with a party that thinks that is ok.\n\nTheres a lot there but the generally jist of it is I can't align with fake news hysteria. Thats not the democratic party I voted for under obama. If democrats ever got back to being more pragmatic and logical I very well may vote for them again but something tells me thats not gonna be for a while......",
            "score": 5,
            "replies": [
                {
                    "author": "YellaRain",
                    "body": "What are your thoughts on Russia, irrespective of Trump? Do you view their current relationship with the USA as antagonistic or cooperative?\n\nAre you aware/do you believe the very well documented track record of the Russians doing everything they possibly could to sink hooks into American politics and influence the trajectory of our government ever since the Cold War?\n\nDo you know any of the details about how these Russian agents supposedly affect that influence, by manipulating weak minded, egotistical people?\n\nDo you agree with Trump’s very unique and alarming positions that Russia should be reinstated in G7, Ukraine should surrender to them without any reparations, the USA should leave NATO, and that Putin is a good leader?\n\nIf in fact the Russians did have an asset (***not*** agent…I do not necessarily believe Trump is consciously complicit in their schemes) who had risen to the level of POTUS, how do you think that individual would behave differently than we are currently seeing?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "G0TouchGrass420",
                            "body": "Russia is a country with its own security concerns. I would view them as any other country that is going to make policy's and decisions based on what their people feel is important.\n\nas far as money goes you mean like this? [https://2009-2017.state.gov/p/eur/rls/rpt/eurasiafy10/156881.htm](https://2009-2017.state.gov/p/eur/rls/rpt/eurasiafy10/156881.htm)\n\nEspecially when we just found out USAID was funneling money to media orgs in ukraine.\n\nI remember when dems tried to impeach trump because russia spent 100k on facebook ads. Yet we have funneled millions into ukraine for decades to start a coup in 2014. Now you are all shocked pikachu face like you dunno how that happen. SMH.\n\nUkraine has been losing the whole time only people drunk on propaganda think otherwise. Russia is dealing with them with kid gloves on. Where do you logically see it going if ukraine doesn't make a deal?\n\nLike whats the point? Peace can be made tomorrow and 10s of thousands if not 100s of thousands of lives could be saved.....Or it can end in 5 years as russia slowly grinds down ukraine at its leisure through a war of attrition.\n\nBut I imagine you are the same people who think russia is running out of missiles soon and stuff like that.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "YellaRain",
                                    "body": "> Russia is a country with its own security concerns. I would view them as any other country that is going to make policy’s and decisions based on what their people feel is important.\n\nExcept they’re not *any* other country. Historically, the US has had very positive relationships with most of the world. By contrast, our relationship with Russia and China has been adversarial for the entire lifetime of the majority of our population. \n\n> as far as money goes you mean like this? https://2009-2017.state.gov/p/eur/rls/rpt/eurasiafy10/156881.htm\n\nI did not say money or allude to it in any way. No idea what you’re referencing. \n\n> Especially when we just found out USAID was funneling money to media orgs in ukraine.\n\nEspecially what? This does not answer any of my questions, it is just a vague follow up to a comment you made that was unrelated to anything I said\n\n> I remember when dems tried to impeach trump because russia spent 100k on facebook ads. Yet we have funneled millions into ukraine for decades to start a coup in 2014. Now you are all shocked pikachu face like you dunno how that happen. SMH.\n\nDems actually *did* impeach Trump…twice, successfully. And 100k in Facebook ads was not a central part of the reasoning either time. It is no secret that the USA gives lots of money to many countries around the world including Ukraine. What evidence do you have that there was a coup in 2014?\n\n> Ukraine has been losing the whole time only people drunk on propaganda think otherwise. Russia is dealing with them with kid gloves on. Where do you logically see it going if ukraine doesn’t make a deal?\n\nUkraine is a small fraction of the size of Russia, and they voluntarily surrendered their nukes to us in exchange for guaranteed protection against an inevitable invasion by Russia. That treaty was a large victory for the US, at the time. What kind of deal should Ukraine make now that is in their best interest?\n\n> Like whats the point? Peace can be made tomorrow and 10s of thousands if not 100s of thousands of lives could be saved.....Or it can end in 5 years as russia slowly grinds down ukraine at its leisure through a war of attrition.\n\nCapitulating to tyrants and invaders is the worst international policy you could possibly have. The point is that they literally don’t have a country if Russia can waltz in and take whatever they want without repercussions at any time. \n\n> But I imagine you are the same people who think russia is running out of missiles soon and stuff like that.\n\nInteresting, but incorrect. Would you mind answering some of my questions directly now please?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "G0TouchGrass420",
                                            "body": "Funny you downplay the 100k thing when thats the entire mueller investigation findings.\n\nYou seem really passionate about it. Yet no logical solution for the end of the war other than fantasy.\n\nThat deal which is called the budapest memorandum guess who broke that deal? We did.\n\nUltimately im a pacifist i think your path leads to more dead ukrainians for the same end result. So understand why I think thats silly. essentially to me you want to kill more ukrainians for??? no reason really",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "YellaRain",
                                                    "body": "I strongly encourage you to re-read the mueller report and listen to his testimony. To claim that 100k spent on fb ads was his “entire” conclusion is objectively wrong. \n\nMy actual interest in your thoughts has almost nothing to do with Ukraine, though. I find those thoughts somewhat interesting as well, but they are really a distraction from my focus. \n\nThe question I’m most interested in: hypothetically if Russia were successful in their mission of installing a manipulable asset into the office of POTUS, in what ways would that be noticeably different from the actions that this administration is taking?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "G0TouchGrass420",
                                                            "body": "ahh so you let your true colors show after all that?\n\nthis is where i am forced to block you becuase you think....trump is a russian asset. Like you dont operate in any reality for there to be any discussion with you",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "paulbram",
                                                                    "body": "I find it an interesting thought exercise don't you? How would an ACTUAL Russian asset behave and let's compare those actions with what Trump is doing. Aka: isn't Russia getting basically the best possible outcome for them based on what Trump has been saying? I thought Trump was supposed to be hard on Russia. Isn't that what he said in his campaign?",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "glaring-oryx",
            "body": "I did not support Trump in 2016 and voted for Gary Johnson in that election. Trump won me over during his first term and I fully supported him in the 2020 and 2024 elections. \n\nI became a Trump supporter because of several factors. The first thing that brought me over was how comfortable and supportive Democrats had become with political violence against their opposition. During that time all over social media every liberal I knew was talking about punching Nazis, and loved sharing that stupid comic about the paradox of intolerance as well as videos of Antifa and liberals attacking Trump supporters. Almost nothing they supported was actual Nazis getting attacked, but rather simply their political opposition. They then tried to gaslight us by claiming Antifa doesn't even exist. I'm not sure Democrats realize how much their own bad behavior led to the creation of many Trump supporters.\n\nThe next thing that won me over was Trump's policies. I had become disillusioned with the Republican party prior to Trump. The big names in the party before Trump, the Bushes, Cheney's, McCain's, etc. seemed to be willing to fight tooth and nail to get us into any and every foreign conflict, but couldn't lift a finger to support an actual conservative agenda and certainly would never fight to put America first. Trump was the absolute opposite. \n\nI started supporting Trump in his first term and have only grown to support him more. Democrats have done nothing to convince me they should play a role in running our country, especially with the disaster of Biden's presidency, and Trump this term has taken the gloves off and is getting things done for this country.",
            "score": 5,
            "replies": []
        },
        {
            "author": "MattCrispMan117",
            "body": "Supported Trump all 3 times but since your looking mainly for people who switched l will give a mention of someone like that l knew.\n\nBack in 2020 l volunteered for the Trump campaign and helped knock on doors in Pennsylvania. l knew a guy who volunteered there with us who told me once he didn't support Trump back in 2016 but did after he saw the Kavanaugh hearings. He just thought what the dems put Bret Kavanaugh through was unconscionable.\n\nNot sure if that's what you wanted since its second hand, but its the only person l really knew somewhat well off the top of my head who fits in the catagory.",
            "score": 3,
            "replies": []
        },
        {
            "author": "agentspanda",
            "body": "Nope, didn't vote for him either of the first 2 times; voted for him the third time in '24.\n\n> What made you change your mind from not supporting Trump in the past to deciding he should be president in 2024?\n\nI'm a registered republican since the 90s and I was very sick of the Biden administration's lies. I voted for Biden as a promise of a return to moderate normalcy; instead we got a corrupt administration run by no-name left-wing staffers implementing their social justice vision for America. If I'm going to vote for people that lie to me I'm going to vote for the ones that at least support my policy views and beliefs and I'm done staying on the sidelines while leftists attempt to destroy the nation with their capture of our institutions. If Trump is all we got, Trump is what I'll use.",
            "score": 2,
            "replies": [
                {
                    "author": "HeartsPlayer721",
                    "body": ">a return to moderate normalcy\n\nWhat would you define as the last administration or time of \"moderate normalcy\"?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": "> What would you define as the last administration or time of \"moderate normalcy\"?\n\nProbably the Clinton administration. Maybe 2012-2014 if I'm pressed hard.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Amishmercenary",
            "body": "Supported him on a whim in 2016, he lost some support from me after he denied the election results, but nowadays he's far better for me than anything the left is putting forward. They're just living in their own bubbles of groupthink propaganda at this point, it's insane.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tinycerveza",
            "body": "I voted for Hillary in 2016 🫣 I can’t even tell you why I did that, except that being in California, voting blue is what many people do without actually giving it any thought",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 3,
            "replies": [
                {
                    "author": "mispeeledusername",
                    "body": "What don’t you like about the right and what foundations do you think are better? Do you feel the far right is the lesser of evils or fundamentally good?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mispeeledusername",
                                    "body": "Can you clarify “history never ends” and “man is fallen?” And can you compare them to the faulty foundations rhetoric you see the left as having? I’m asking as a centrist who finds the left and the right equally unsettling in different ways but who fundamentally stands more towards “unbridled capitalism sucks”",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "mispeeledusername",
                                                    "body": "Interesting and helpful to understand your viewpoint. Do you view Elon Musk, Peter Thiel and other technocrats as leftist or rightist?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sshlinux",
            "body": "I voted for him all 3 elections",
            "score": 3,
            "replies": []
        },
        {
            "author": "MajorCompetitive612",
            "body": "Voted third party in 2016, and voted for Biden in 2020. Wasn't until 2024 that I actually voted for Trump, albeit begrudgingly.",
            "score": 5,
            "replies": [
                {
                    "author": "Horror_Insect_4099",
                    "body": "What were deciding factors for your 2024 vote?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "MajorCompetitive612",
                            "body": "Was leaning towards it for a while, but the debate is what sealed the deal. Told me that 1) Biden was mentally unfit to serve for another term and 2) the Biden admin, MSM, and most of the Dems in Congress knew this and kept it from the public.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "HeartsPlayer721",
                                    "body": ">but the debate is what sealed the deal\n\nI understand having your mind made up in regards to Biden. (I did too!) But did Biden dropping out alter your mind at all?\n\nWas it Harris you disliked, her policies, or the general deceit you felt from the overall Democratic party that ultimately led to you supporting Trump this time?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Dreamer217",
                                            "body": "Harris literally said she “wouldn’t change anything Biden did during his presidency” and Trump used this in his ads… pretty much answers your question and sealed the deal for the country.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "HeartsPlayer721",
                                                    "body": "Hey, you're not the person I asked!\n\nI'm looking for POVs from people who didn't support Trump and now do.\n\nDid you ever *not* support Trump before 2024?",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Fando1234",
                                    "body": "That's a fair answer. May I ask what made you vote Biden in 2020 over Trump?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "JealousFuel8195",
                                    "body": "Why did it take the debate for you to recognize Biden's decline? There were many signs. \n\nFor me, it was very obvious. I had a parent that had dementia and Alzheimer's. I saw the signs prior to Biden getting elected.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LegitimateSituation4",
                                            "body": "Biden was clearly in decline. Many aren't happy with how the cycle played out. Do you see the cognitive decline in trump, as well?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "JealousFuel8195",
                                                    "body": "I do not see any noticeable decline in Trump.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "DynamicBongs",
                                                    "body": "Compared to 2016? yes you can tell he’s older but in terms of the way he talks and responds to people now isn’t anything concerning cognitive wise IMO. He very much has his mental faculties. Could he rapidly decline in the next 4 years? Maybe.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "MajorCompetitive612",
                                            "body": "Admittedly, I don't follow politics 24/7 so although the were signs, I think the fact that he's got a stutter and has a history of gaffes kinda minimized them to me. But with the debate, you he time to prep and be ready, and he seemed utterly lost.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "glaring-oryx",
                                                    "body": "Yeah I can see that. His staff and the lapdog media worked very hard to downplay his decline and before the debate it could be easy to think it wasn't actually that bad.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MajorCompetitive612",
                                                            "body": "Exactly. You could probably grab a short clip of almost anyone tripping over words, having a brain fart, etc and make it seem like they've got screws loose. The debate was a whole different animal.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "To be perfectly honest, I did not vote in any POTUS election until 2024.  That's not because of support or lack thereof of any candidate, but rather because of the electoral college (let's not get into this) and realizing that I lived in a very blue area of very red states.  My vote, in as such, didn't matter.\n\nI did vote in 2024, solely to help boost the popular vote, only because it was a bit of a joke, and my wife (who is far more to the right than I am) asked me to.  I vote in local elections, but I understand how the system is gamed and I'm not a huge fan of spending two hours doing something that won't matter.  My district will go blue.  My state will go red.  That has been the case ever since I have been old enough to vote.",
            "score": 3,
            "replies": [
                {
                    "author": "Davec433",
                    "body": "Freaknomics did a piece on this. Yes your vote nationally statistically has no impact.\n\n>Since a single vote almost never alters an outcome, what’s in it for the voter?\n\nLocally that’s different. A district in my state was tied and went to a coin toss.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JustGoingOutforMilk",
                            "body": "Yup.  I support the POTUS, period, because I want the country to do well.  But locally, I am far more interested.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Independent-Club-918",
            "body": "I couldn’t vote in 2016, or 2020 so I didn’t pay attention whatsoever. I did however support trump this past election",
            "score": 2,
            "replies": []
        },
        {
            "author": "noluckatall",
            "body": "No, 2024 was the first time I voted for him. Primary reasons were immigration and Democrat-promoted infiltration of DEI into all facets of society. The [long march through the institutions](https://en.wikipedia.org/wiki/Long_march_through_the_institutions) reached a tipping point for me.",
            "score": 2,
            "replies": [
                {
                    "author": "HeartsPlayer721",
                    "body": ">immigration\n\nWhat indicated, to you, that immigration was *more* of a problem in 2024 than in prior years? (Or was it not that it was necessarily worse and more that you found yourself more aware/Informed of the topic?)\n\n>Democrat-promoted infiltration of DEI into all facets of society.\n\nWhat, exactly, is it that you dislike about \"Diversity, equity, and inclusion\"?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DidiGreglorius",
            "body": "Yeah. Not in the primary in 2016 but the general. \n\nI stopped supporting him for a while *after* he lost in 2020 but am obviously supporting him again now.",
            "score": 2,
            "replies": [
                {
                    "author": "apeoples13",
                    "body": "What caused you to stop supporting him? What caused you to start supporting him again?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "DidiGreglorius",
                            "body": "I thought he was unelectable and that the 2020 election saga was embarrassing. As far as supporting him again: \n\n- Ron DeSantis ran a poor campaign and fizzled out; polling indicated Trump *was* electable. \n- I thought the Biden administration’s policies on immigration, student loans, and transgenderism — among many others — amounted to an active assault on the country. I don’t care to debate these policies again in this thread. \n- I was alarmed by the coordinated response of the DNC, Intelligence Agencies, large corporations, and the Democrat Press to defend Biden throughout his candidacy and Presidency. Not a hallmark of a free and competitive political system.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "apeoples13",
                                    "body": "Thanks for your response. I agree with your last point that it did seem like a coverup on Bidens mental state especially in the last year. Do you feel the same coordinated response is happening now with Trump? It seems he’s installing loyalists in all aspects of government that won’t criticize him. In addition he’s criticizing and banning members of the press (AP) for not falling in line. I’m just curious if you see any similarities there and if it troubles you at all?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "basedbutnotcool",
            "body": "Yeah I did in both instances.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Quiet_Entrance_6994",
            "body": "I was 14 when Trump first got in office so I couldn't vote for him but everyone around me was angry that he'd been elected. I personally didn't care either way, but I thought the reaction around him was insane. I remember all the kids in my class were talking about it before class, one girl was crying over her family being deported, and the teachers were either insulting Trump or not speaking about it. \n\nIn 2020 I was fully planning on voting for him. I was 18 and I'd been doing some research in the months before the election. Social issues are mainly what made me decide to vote for him.",
            "score": 3,
            "replies": [
                {
                    "author": "Commie_Cactus",
                    "body": "Can you elaborate on what social issues he was going to address that made you vote for him? Did they overcome being found liable for rape of Carroll, being co-defendants with Epstein for the rape of a 13 year old in ‘96, talking about his daughters breasts when she was 3, talking about dating a 10 year old in 10 years, and bragging about watching children change at his pageants?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "General social issues like feminism, LGBT issues, abortion, and racial issues. It was more that I was very anti what the left was proposing and more in favor of what the right had, and Trump was the nominee. \n\n>Did they overcome being found liable for rape of Carroll,\n\nI do not believe that woman was raped. At best she's a loon as far as I'm concerned. \n\n>being co-defendants with Epstein for the rape of a 13 year old in ‘96, talking about his daughters breasts when she was 3, talking about dating a 10 year old in 10 years, and bragging about watching children change at his pageants?\n\nThe rest of this I would need context for. I understand you're using this to say he's a bad person (at least a rapist and very plausible a pedophile) and how could I vote for him if he's such a terrible person. I'm not going to play into that.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "HeartsPlayer721",
                                    "body": ">I'm not going to play into that.\n\nBecause you don't believe he's capable of that? Or because you don't care?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "I believe that if he was that terrible of a person, his supporters would see that and the news wouldn't have to lie about him over and over and over. \n\nGiven that the news has lied about him over and over to assassinate his character, I do not believe anything the left says about Trump at face value.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "timforbroke",
                                                    "body": "How would his supporters magically know he’s a terrible person without ever meeting him or being around him for an extended period of time (besides getting information from other sources)?",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "They would know if the people who keep accusing him of terrible things could credibly verify that he's this terrible person. \n\nThey can't and they haven't, so many of them don't see him that way.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "KriistofferJohansson",
                                                                    "body": "Trump himself has openly bragged about sexually assaulting women. \n\nIs he a liar too? Are you fine with sexual assault?",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "If you're talking about the grabbing women by their privates thing, he was talking about groupies I believe. Those women have no self respect or dignity and I do not feel bad for them.",
                                                                            "score": -5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "KriistofferJohansson",
                                                                                    "body": "Do you think the law should only protect those who you respect? Who needs to respect you for you to be able to have the protection of the law?\n\nIf Trump was talking about grabbing the pussy, aka sexually assaulting, other than “just groupies” would that then be a crime?",
                                                                                    "score": 10,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "LockStockNL",
                                                                                    "body": "Do you also believe some women are at fault for being raped because of the way they dress?",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "That's an invalid question.",
                                                                                            "score": -2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "thedamnoftinkers",
                                                                                                    "body": "Why?",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                            "body": "Because it's bad faith. \n\nLeftist people always ask obvious questions like this and it's exhausting. Questions like that deserve to be mocked and ignored because they aren't said in good faith.",
                                                                                                            "score": -1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "External-Ad1169",
                                                                    "body": "Do you think that his power and influence have anything to do with the fact that these stories and court documents were never covered in the mainstream media?",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "They were covered in mainstream media, or at least mentioned. \n\nI think given how much the government and many powerful people hate him that his money and ínfluence would've meant nothing compared to theirs.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "TenEighths",
                                                    "body": "Why do you think the news lies about Trump?\n\nWhat makes you distrust what they say?\n\nWho do you trust?\n\nThere are countless videos and recordings of Trump saying a multitude of racist, sexist, and any other kind of hateful things about every kind of person. \n\nHave you just not heard him say any of these things?\n\nDid you hear the Access Hollywood tape where bragged about being able to sexually assault any woman he wants to because he's rich and famous?\n\nDoes that align with your values?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "I think they dislike that Trump is a figurehead for people they dislike. A vocal figurehead who trashes them constantly. \n\nThey've lied way too often about things and continue to lie about certain things. \n\nIndependent media and really just what makes sense. If Trump says something but does something else or there's enough evidence to show he's doing something else, then it's fair to say he's lying.\n\n>Have you just not heard him say any of these things?\n\nI think all that supposed evidence is either incorrect or being understood differently.\n\n>Did you hear the Access Hollywood tape where bragged about being able to sexually assault any woman he wants to because he's rich and famous?\n\nI believe there he was talking about groupies and I don't care that he's telling the truth about those women.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Born-Sun-2502",
                                                                    "body": "Even if they were so-called  groupies he very specifically said that \"I don't even wait. And when you're a star, they let you do it. You can do anything. ...\" So he is doing it immediately and assuming they like it? Then you immediately see it in action when they attempt to coerce the female reporter into giving \"the Donald a kiss\" It's truly disgusting. Using your power and influence to sexually pressure women (even if it's THAT innocentand not assualt) is gross.\n\n\nWhy do you think E.Jean Carroll is crazy or however you described her ",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "Again, groupies have no self respect or boundaries. They, like many women, will allow themselves to be disrespected and treated like sex toys for status. I don't feel bad for them putting themselves in that situation.\n\n>Why do you think E.Jean Carroll is crazy or however you described her \n\nBesides her story not making sense, she literally had an interview with Anderson Cooper I believe where she was talking about the \"rape\" in an almost jokey, unserious say. And even said she didn't want to call it rape.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Born-Sun-2502",
                                                                                    "body": "\"LIKE MANY WOMAN  will allow themselves to be disrespected and treated like sex toys for status.\" \n\nI think you mentioned that you're a young man. As a mom to an 18-year-old son, I’d be really disappointed if he had this view of women. Are you basing this opinion on your real-life experiences with women, or is it coming from social media and online spaces? If it’s the latter, I’d encourage you to look beyond that, and if it’s from personal experience, it’s unfortunate that you've encountered women in situations that led you to feel this way.\n\nMore importantly, I would never want my son to think it's okay to grab women's private parts without their consent. Whether or not the person protests afterward, unsolicited physical contact—especially something as invasive as grabbing women \"by the pussy\"—is still sexual assault. Consent matters, always\n\n\nAs far as discrediting a rape victim because she didn't act victim-y enough, I don't know what to say to that.",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": ">I think you mentioned that you're a young man.\n\nJust to be clear, I'm a woman. If I said I was a man instead of a woman earlier then my apologies for that. \n\n>As far as discrediting a rape victim because she didn't act victim-y enough, I don't know what to say to that.\n\nRape victims don't all act the same but they sure don't act in some ways and E. Jean Carroll acted like a nutcase.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Commie_Cactus",
                                    "body": ">General social issues like feminism, LGBT issues, abortion, and racial issues. It was more that I was very anti what the left was proposing and more in favor of what the right had, and Trump was the nominee.\n\nWith feminism, human rights for LGBT people, bodily autonomy, and racial equality being objective goods, and the public overwhelmingly supporting all 4, why do you feel like you want someone who will deny those things to citizens?\n\n>I do not believe that woman was raped. At best she's a loon as far as I'm concerned.\n\nWhy don't you believe the jury of Trump's peers that his lawyers helped pick and who had access to all the evidence and testimony, who eventually came back with a unanimous verdict? If I say that I don't believe Joe Biden is senile, does that make it not true or am I just wrong?\n\n>The rest of this I would need context for\n\nWhat context do you need for someone who was co-defendants with his best friend, Epstein, for raping a 13 year old at a party in 1996? What context would make that okay? (note that wasn't the only child he sexually assaulted, there were at least 3)\n\n>how could I vote for him if he's such a terrible person. I'm not going to play into that.\n\nDo you prioritize upsetting liberals over morality and your own self-interest? You'd rather vote for a felonious, child and wife raping, teen spying, Epstein BFF and frequent flier, incestuous, adulterous, bankrupt, impeached man with concerning cognitive decline just to upset people you don't know?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Commie_Cactus",
                                                    "body": "I appreciate you taking the time to respond but it doesn't look like you are here to actually have a discussion or answer questions. I asked objective, relevant, fact-based questions that I'm interested to hear your opinions on if you wouldn't mind at least trying to answer or dispute a few of them?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "I'm happy to answer questions and talk. Your questions were biased and pointed in a way that made actually responding feel pointless. \n\nI've responded to other people here who asked questions in what I assume you'd say are akin to what you asked but they at least asked in a less biased way.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Commie_Cactus",
                                                                    "body": "If you don't want to answer them for a specific reason, or cannot answer them I understand. I took great care and more time than I wanted to in crafting them to learn more about how your mind works. I realize that answering any of them objectively would likely clash with your personal world view and I'm not here to try to stress you out.  \n  \nAre you capable of answering them or should I rephrase them / ask new questions?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "Rephrase them, please.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Commie_Cactus",
                                                                                    "body": "Absolutely. Hopefully this removes any perceived bias or bad-faith arguments within the questions and leaves them a bit more clear and objective.  \n  \nWith feminism, human rights for LGBT people, bodily autonomy, and racial equality being overwhelmingly supported by the general public, do you feel like voting for Trump who opposes them is a decision you made based on your own personal desires or the good and will of the country?\n\nWhy do you feel the jury of Trump's peers that his lawyers helped hand select and who had access to all of the evidence and testimony surrounding the events that took place made a mistake in unanimously finding him liable for the SA of EGC?\n\nIf someone was co-defendants with Jeffrey Epstein (of which they were very close friends) for raping a 13-year-old at a party in 1996, what context would make that okay to have done?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": ">With feminism, human rights for LGBT people, bodily autonomy, and racial equality being overwhelmingly supported by the general public, do you feel like voting for Trump who opposes them is a decision you made based on your own personal desires or the good and will of the country?\n\n\nTrump doesn't oppose any of those, and that's my problem with the left. Trump is pro-LGBT, pro-woman, supports exceptions like incest and rape concerning abortion, and racial equality. He's a Democrat from the 90s. \n\nThe problem is that he doesn't support what people like you support on these issues so you position him as anti all those things. He is not, he's made that clear, his supporters in all those minority groups have made that clear. You're simply incorrect. \n\n>Why do you feel the jury of Trump's peers that his lawyers helped hand select and who had access to all of the evidence and testimony surrounding the events that took place made a mistake in unanimously finding him liable for the SA of EGC?\n\nAs far as I'm aware, that case was in New York. That's not fair ground for Trump to have a fair case. \n\n>If someone was co-defendants with Jeffrey Epstein (of which they were very close friends) for raping a 13-year-old at a party in 1996, what context would make that okay to have done?\n\nThis is still a badly phrased question but I'll answer it. \n\nWhen Trump is proven to have done something or there is at least a good amount of evidence pointing towards him doing something, then we can talk about how terrible he is.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Commie_Cactus",
                                                                                                    "body": ">Trump doesn't oppose any of those, and that's my problem with the left. Trump is pro-LGBT, pro-woman, supports exceptions like incest and rape concerning abortion, and racial equality. He's a Democrat from the 90s.\n\nTrump has been behind women losing their bodily autonomy (abortion, healthcare access, and on the docket: birth control, no fault divorce, marital consent), the removal of LGBT protections in the workplace and housing, and has whipped the right up into an absolutely rabid frenzy over trans people existing - trying to legally erase them while states like florida put laws on the books to quite literally execute them. These actions don't align with your personal view on Trump\n\n>As far as I'm aware, that case was in New York. That's not fair ground for Trump to have a fair case.\n\nWhat is unfair about it being in new york? Should we throw out all court cases where people don't like the state they're tried in? Does it negate the jury's non-partisan judgment?\n\n>When Trump is proven to have done something or there is at least a good amount of evidence pointing towards him doing something, then we can talk about how terrible he is.\n\nI'm asking for clarity on what context would make that action itself okay. I know that even if my own family member were in that boat I'd have long since cut all ties with them. You can read the court dockets, testimonies, evidence, etc in the court filings for the case. He is extremely well documented as being pedophilic and his very intimate friendship with Epstein doesn't really help him out there. Do you feel it's okay to support someone like this?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                            "body": ">Trump has been behind women losing their bodily autonomy (abortion, healthcare access, and on the docket: birth control, no fault divorce, marital consent), the removal of LGBT protections in the workplace and housing, and has whipped the right up into an absolutely rabid frenzy over trans people existing - trying to legally erase them while states like florida put laws on the books to quite literally execute them. These actions don't align with your personal view on Trump\n\nAh, I see what's happening here. You don't understand what my position on feminism, LGBT, and race issues are so you assumed I'm for those things and you're trying to make the point that Trump is against those things. \n\nHe isn't, so you're still wrong with everything you said, but I thought I'd make sure that's what's happening here. \n\n>I'm asking for clarity on what context would make that action itself okay. I know that even if my own family member were in that boat I'd have long since cut all ties with them. You can read the court dockets, testimonies, evidence, etc in the court filings for the case. He is extremely well documented as being pedophilic and his very intimate friendship with Epstein doesn't really help him out there. Do you feel it's okay to support someone like this?\n\nOnce again, until he's actually done something I don't really care. Being accused of something terrible doesn't mean you did that. People can even be wrongly convicted, so until there is good evidence to show he did something, I don't care.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "thedamnoftinkers",
                                                                                                                    "body": "Didn't you specifically say you voted for him *because* of his policies on those issues? How can he be for them, then, if you're not and you voted for his policies that roll them back?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                            "body": "If you'll notice, I said I was very anti what the left was doing. Which, if you were aware of the differences between the left and right, you know that the right is not in favor of what the left is on these issues. \n\nWhen it comes to the right, you all keep asserting things like them not being in support of racial equality when that is blatantly incorrect. We're just not in favor of what you all are in favor of. \n\nLike I told the other person: not being in favor of what the left wants based on different issues doesn't mean that we are against those things in principle, entirely. It just means we don't agree with the left's position.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "Commie_Cactus",
                                                                                                                    "body": "I (seemingly correctly) assumed you oppose women's rights, human rights for LGBT people, bodily autonomy, race equality, etc, not that you were for them. I'm very aware Trump is also against them, which would be why I literally said both of those in my previous comment. I stand correct, again.\n\nHe objectively raped several children, several wives, several women, said he'd be dating a 10 year old in 10 years, talked about a 3 year old ivanka's breasts, was best friends with Epstein, flew to his island 7 times, and bragged about watching children change at his beauty pageants. None of that is good enough for you to even entertain the possibility of acknowledging that he's not a good person?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                                            "body": ">I (seemingly correctly) assumed you oppose women's rights, human rights for LGBT people, bodily autonomy, race equality, etc, not that you were for them. I'm very aware Trump is also against them, which would be why I literally said both of those in my previous comment. I stand correct, again.\n\nAh, I misunderstood again, my bad. Let me try this again. \n\nTrump does align with everything I said he does. It's just not in the way leftists like you would prefer. For example, concerning abortion, Trump is in favor of exceptions for rape and incest. He's also fine with the abortion pill being distributed. He has been in countless fights with the pro-life community over these things, even though he's only slightly better than the left on this. The left is for unrestricted baby murder, Trump is less for that and got Roe taken away. He's the better option. \n\nYou brought up human rights for trans people. The right is largely for their human rights, we're just not going to agree on leftist logic. A transwoman is a type of man and a trans man is a type of woman. Transwomen are not women, transwomen are not men. Men are not allowed in women's spaces, so our sports and bathrooms are ours. Having them recognize their own biology and acting accordingly isn't taking away human rights. We're fine with them getting jobs, having housing, and getting food and everything else. \n\nThose are only two examples but this is my point. You're evaluating and phrasing things based on your own criteria and not seeing the reality. Trump's actual positions are just Democrat ones from the 90s, y'all would've been on the same side a couple decades ago. \n\n>None of that is good enough for you to even entertain the possibility of acknowledging that he's not a good person?\n\nI don't believe he did any of that. I haven't seen evidence of that, just heard it repeated over and over.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bubsimo",
                    "body": "Why did you plan on voting for him if you were right there hearing about the terrible things he was doing?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "In the first part I was 14 so I couldn't have voted. Even then, I didn't believe anything the people around me were saying.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bubsimo",
                                    "body": "Why did you choose to believe Fox News instead of the people around you?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "I never watched Fox and the people around me were children and/or people who I knew were eating up mainstream depictions of Trump.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "YellaRain",
                    "body": "\nWould you say that your opinion was more swayed by facts that you discovered through research, or just the general insanity that you perceived in peoples’ reactions to his election?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "Moreso by the insanity of people, but it's almost a 60-40 situation.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "YellaRain",
                                    "body": "Thanks. Were there any people that you care about or are close with among the group of people with crazy reactions? Or did your circle of peers/family tend to align more with the position you ended up taking yourself?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "My entire family and probably most of my classmates disagree with me. \n\n>Were there any people that you care about or are close with among the group of people with crazy reactions?\n\nBack in 2016, those people were a few friends I had and 2 of my favorite teachers. In 2020, it was my immediate family. Currently it was only my advisor at school. We're not super close but she's really cool and we get along well.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "YellaRain",
                                                    "body": "Very interesting. Thank you. \n\nDid you ever feel like you understood where all those people were coming from and you just disagreed with how important certain things are, or did you completely not relate to their concerns and think they were ridiculous?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "Both in a way. \n\nI was raised around these people or around people like them and I understood where they were coming from and how they understood things to be. I still thought they were ridiculous and stupid.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "YellaRain",
                                                                    "body": "So if not from your family and peers, who you say predominantly disagree with your views, what was the biggest influence on your opinions forming the way that they did?\n\nFor example, is there a celebrity personality that you follow and resonate with? Or do you watch/read a lot of news from any particular source that seems especially reliable or important?\n\nI don’t know the best way to phrase this, but what I’m trying to get at is the cause of your views being so diametrically opposite to many of the people that you are close with.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "I think that's just the way I came out. As far back as I can remember all of my views aligned more with conservative Republicans rather than Democrats. \n\nFor contexts, I'm a 22 year old black girl from Chicago. I was raised in a family where I should've been all for the BLM riots, hating Trump and Republicans, and men like many on the left do. I absorbed none of that. \n\nIf anything, it just made me angrier at my environment because it all sounded backwards and gross.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "XelaNiba",
                                                                                    "body": "That's interesting.\n\n\nWhere did you source your information about Trump as a candidate?\n\n\nWhat was your environment like? I know black girls from Chicago raised with money & privilege and black girls from Chicago raised in poverty.\n\n\nWhat is it about feminism that offends you? ",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "Just watching people talk about him on YouTube. Lots of Blaire White. \n\nI guess technically I was raised in poverty. I was homeless a lot and lived in a basement for a while. Not in a hostage way, the basement was built to like an apartment. Kind of. \n\nFeminism doesn't look empowering to me and sends more of a message that it hates men (unless the men are brown and/or pretending to be women).",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "XelaNiba",
                                                                                                    "body": "That's a hard way to grow up, I can see why you'd reject the values of the people who were responsible for your circumstance.\n\n\nIf I'm reading you right, it sounds like you're now in secondary education? How do you manage that without any family contribution? \n\n\nI admire your grit, good for you for making a better way for yourself. \n\n\nI would ask you to reassess feminism. But for the feminist movement, you wouldn't be able to cast a vote or attend higher education. Your employer wouldn't be obligated to provide you with benefits, just male employees. Your future husband would have the legal right to rape you. Without the OG 19th century feminists, you wouldn't be able to own property or have a bank account.",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Born-Sun-2502",
                    "body": "Your classmates fear had no impact on you? is there a reason why you object to a pathway to citizenship for those who live here and are contributing to see society? It just seems like the obvious solution to our declining population issue rather than forcing women to give birth to unwanted babies which will give rise to a whole host of other issues.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Quiet_Entrance_6994",
                            "body": "No, I didn't care that they were scared. Their parents were here illegally so they had to leave, simple enough. \n\n>It just seems like the obvious solution to our declining population issue rather than forcing women to give birth to unwanted babies which will give rise to a whole host of other issues.\n\nI'd rather the population decrease and we rebuild around the people having kids.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Shoddy-Cherry-490",
                                    "body": "No offense, but that is some heartless stuff for someone who has barely lived long enough to even begin making a mark on the world!\n\nI get that illegal immigration can be hard to stomach for those who go through the arduous grind of obtaining visas/ residency legally, but when you consider the substantial and often unimaginably gruesome hardships of actually trekking to and across the US border, I have the utmost respect for those people.\n\nRegardless of how young you are, I am genuinely curious why you express so little empathy for these people that generally speaking have not been dealt an easy card in life?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "You're confusing me not being overly emotional with me having a lack of empathy. \n\nI can empathize with people crossing the border illegally and understand their motivations for leaving their home countries. No amount of empathy or understanding I have for those people and their lives will make my heart bleed for them. \n\nThey broke the law, they need to leave, period. They can come back legally, but they can't stay here.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Dutchman36",
                                                    "body": "So people upholding the law is important to you then? You say integrity and having positive moral compass is must have for you and people you support?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "Upholding the law is important. \n\nI'm not expecting great integrity or great moral compasses from people nowadays. I'm Catholic, barely anyone is living up to that moral standard.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Dutchman36",
                                                                    "body": "So how is that important to you but you support a president who has violated the law and doesn’t uphold it in his actions currently?  Is there a double standard?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "As far as I know Trump hasn't done that.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dutchman36",
                                                                                    "body": "Is it that you don’t know or that you don’t want to know? \n\nConstitutional law prevents shutting down USAID without congress, withholding funding is a violation of the Impoundment Act, granting Elon access to people personal data violates privacy Act, in addition to the felonies he has which include falsifying business documents, you’re saying you know nothing about any of this?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "I only know things I learn from people talking about this stuff and what I research on my own. It's not my job to know about a lot of this stuff so I'm not going to research everything.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Shoddy-Cherry-490",
                                                    "body": "It sure does not sound like you have much empathy for illegal immigrants and the plight that motivates them to leave the country, but I will take your word for it that you at least feel empathy. \n\nHaving said your stance seems to be an absolutist one that ignores the socioeconomic realities of human migration.\n\nDo you agree that in most cases, it’s essentially a victimless crime, i.e. that their trespassing of the border causes no harm directly or indirectly to US citizens or legal resident aliens?\n\nDo you agree that there are those migrants to whom legal avenues of immigration are not realistically attainable either because of the situation they find themselves in (destitution) or because they lack minimum qualifications? \n\nWhat do you think about alternatives to deportation? - for example mandating community service to illegal immigrants caught by law enforcement and in return providing them a path for legalization.\n\nWhat is your take on abolishing birthright altogether and creating a merit-based system of citizenship?\n\nI am also curious about your take on those who cheat the system to ensure the legality of their status, such as green card marriages. Do you think those people should be deported as well?\n\nDo you think modern immigration laws are in contradiction to laws or even the absence of laws of past generations that basically make immigration harder for new arrivals than for those whose ancestors came here in the 18th or 19th century?\n\nDo you think legal avenues for immigration should be expanded as a measure do combat illegal immigration? \n\nDo you think the circumstances of migrant’s living condition in their home countries should be given any consideration in their ability to immigrate to the US or do you think we should uphold a system based only on merit and qualifications, i.e. only allow the educated ones into the country?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": ">Do you agree that in most cases, it’s essentially a victimless crime, i.e. that their trespassing of the border causes no harm directly or indirectly to US citizens or legal resident aliens?\n\nYes and no. Just crossing the border, no. Once they get here they're taking our money and resources and that harms Americans. \n\n>Do you agree that there are those migrants to whom legal avenues of immigration are not realistically attainable either because of the situation they find themselves in (destitution) or because they lack minimum qualifications? \n\nSure. \n\n>I am also curious about your take on those who cheat the system to ensure the legality of their status, such as green card marriages. Do you think those people should be deported as well?\n\nI don't think marrying someone should give you a path to being a citizen. \n\n>Do you think modern immigration laws are in contradiction to laws or even the absence of laws of past generations that basically make immigration harder for new arrivals than for those whose ancestors came here in the 18th or 19th century?\n\nI think now that we're in a very stable world, I think we should have a much stricter immigration system. Something I love about Japan's is that it's really really dense to finally become a citizen. \n\n>Do you think legal avenues for immigration should be expanded as a measure do combat illegal immigration? \n\nNot really. I think we need to reform immigration period, but I have no interest in making it easier for immigrants. \n\n>Do you think the circumstances of migrant’s living condition in their home countries should be given any consideration in their ability to immigrate to the US or do you think we should uphold a system based only on merit and qualifications, i.e. only allow the educated ones into the country?\n\nNo. I do not care how bad someone's life is in Central America, South America, Africa, wherever. Their suffering does not mean that we should open our arms wide and bring them in, especially when our country is falling apart. \n\nWhen our country is not in shambles, then we should consider who can come in based on our benefit.\n\n>It sure does not sound like you have much empathy for illegal immigrants and the plight that motivates them to leave the country, but I will take your word for it that you at least feel empathy. \n\nLike I said before, my empathy does not control me. I can feel bad for someone and I can fully understand why they did something. If they did something wrong, I'm not going to go easier on them or help them.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Shoddy-Cherry-490",
                                                                    "body": "So you don’t consider the United States a country that is historically tied to immigration?\n\nIf we were to pursue a more closed society like Japan where indeed the people have strong historic ties to the land they live on, should we have to re-examine the merit of those people whose parents, grandparents or great grandparents came here illegally? Like where does their right of citizenship come from?\n\nAgain, how do you feel about a system in which citizenship is entirely merit-based, including those whose families came over on the Mayflower?\n\nBy the same line of thinking, instead of simply deporting people, a costly and entirely fruitless exercise, should we offer alternatives to legalize citizenship /resident alien status? Military service has historically been a popular avenue for foreigners to obtain US citizenship. This could easily be expanded to civil service programs by which illegal immigrants can obtain legal status!\n\nI mean let me be blunt and ask you why do you deserve citizenship in this country? Have you or any member in your family done anything to earn this privilege?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": ">So you don’t consider the United States a country that is historically tied to immigration?\n\nMaybe this wasn't you who I wrote this to, but I said the US was built by settlers and later immigrants. \n\n>If we were to pursue a more closed society like Japan where indeed the people have strong historic ties to the land they live on, should we have to re-examine the merit of those people whose parents, grandparents or great grandparents came here illegally? Like where does their right of citizenship come from?\n\nAssuming we did have that, I'd say it comes from the US. They've been here for generations, they're Americans. \n\n>Again, how do you feel about a system in which citizenship is entirely merit-based, including those whose families came over on the Mayflower?\n\nWhy would we go back to the Mayflower? \n\n>By the same line of thinking, instead of simply deporting people, a costly and entirely fruitless exercise, should we offer alternatives to legalize citizenship /resident alien status? Military service has historically been a popular avenue for foreigners to obtain US citizenship.\n\nI'm not interested in giving illegals an easier path to citizenship. They can leave and come back legally or not at all. I'm happy to spend as much money as needed to get people who shouldn't be here out of the country. \n\n>I mean let me be blunt and ask you why do you deserve citizenship in this country? Have you or any member in your family done anything to earn this privilege?\n\nI was born here. My family has been here for generations. My citizenship is a given.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Shoddy-Cherry-490",
                                                                                    "body": "Explain to me how your \"nativist\" attitudes about the United States of America aren't both philosophically and practically quite un-American?\n\nThe [percentage of immigrants living in the US since 1848 has oscillated between 5 to 15%](https://www.migrationpolicy.org/programs/data-hub/charts/immigrant-population-over-time) and currently sits at 14.3%. Furthermore, since 1900, first and second generation immigrants have [made up between 20 and 35% of the US population](https://www.pewresearch.org/chart/immigrant-share-of-population/).\n\nSo in the face of this reality and ignoring the question of immigration status (because that has varied over the years) are you suggesting that the United States of America move away from what has historically been an \"open society\" with a relatively high percentage of immigrants (14.3%) to one of a \"closed, \"nativist\" society\" with a relatively low percentage of immigrants like Japan (2.7%)?\n\nSecondly, why do you make the distinction between \"settlers\" and \"immigrants\"? They are subsets of the more generic \"migrant\" population. Just in terms of numbers, the number of \"settlers\" that came to America to build colonies on \"virgin\" land, and we all know that it wasn't that, is so insignificantly small when compared to the number of immigrants that come here every year.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "America's weak immigration system along with one of its political parties pushing this \"empathetic open boarders\" approach to immigration, so I'd prefer we have something much stricter like Japan. Unlike America currently, Japan has a commitment to it's people. \n\nAmericans are not replaceable. Americans are not interchangeable with immigrants. Just be sure you're allowed to come here doesn't make you an American. Americans have an identity, a history, and a culture that deserves to be preserved. \n\n>Secondly, why do you make the distinction between \"settlers\" and \"immigrants\"?\n\nBecause they aren't the same thing. Settlers build, immigrants come to what is built.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Shoddy-Cherry-490",
                                                                                                    "body": "But you can’t demonstrate how what you are describing is in line with 250 years of American history? How the American dream has always been an idea to aspire to and work for rather than something that needs to preserved like a painting in a museum. \n\nAnd what about America is really worth preserving? Strip malls and giant parking lots? Suburban McMansions? McDonalds and Coca-Cola? Mega churches? NFL franchises owned by billionaires? \n\nI am being facetious! But this sounds strangely backward looking like Europe…not forward looking like America!",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Quiet_Entrance_6994",
                                                                                                            "body": "I think the issue we have here is that you have a very American, commercial view of America while I have one that's much more akin to other countries.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Born-Sun-2502",
                                    "body": "*WHY* would you rather the population decrease ( which is bad for the economy) than creating an easier path to legal immigration? ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Quiet_Entrance_6994",
                                            "body": "Because I care about our population of Americans that foreigners cannot replace. I'd also rather we reform things to fit people who are citizens who benefit the country rather than just focusing on making money.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Born-Sun-2502",
                                                    "body": "You realize we are a nation of immigrants, right? That's kinda the whole concept our nation was built on.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "We're a nation of settlers and some immigrants. That doesn't mean that we are not our own country with our own culture that deserves to be preserved.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "JuliaLouis-DryFist",
                                                                    "body": "\"Settlers\" is a funny phrase when you actually put a looking glass on history. Imagine a country like Saudi Arabia completly taking over every aspect of everyone's lives right now? You can't because of the constitution. Think of it just washing across the nation, a sort of detiny manifest? (Look it up) Until the constitution is just a peice of paper. Your gun can't protect it anymore. It's just a piece of paper.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Quiet_Entrance_6994",
                                                                            "body": "Everything you just said means nothing. \n\nWe are a nation of settlers and later immigrants.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "idontcarolol",
                                                                                    "body": "The “settlers” WERE immigrants, how is that lost on you? They weren’t indigenous to the land therefore they immigrated, the same as those who you encourage to be deported now.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Quiet_Entrance_6994",
                                                                                            "body": "It's \"lost\" on me because settlers are not immigrants, that's why I used different words.",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Accomplished-Staff32",
                                                    "body": "you care about \"our\" population. Who do you include in \"our\"? Is it the same group that Musky wants having babies?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Quiet_Entrance_6994",
                                                            "body": "I include the American people.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "handyfogs",
            "body": "I was 13 in 2016 and I thought he was going to put my friends into concentration camps LOL... \nI was 17 in 2020 so I still couldn't vote, but I supported him then because I live in a blue state and I hated the way the democratic party had responded to COVID. \nI voted for him in 2024.",
            "score": -1,
            "replies": [
                {
                    "author": "thedamnoftinkers",
                    "body": "So, just out of curiosity, do you know anyone who died from COVID?\n\nI'm from Virginia originally but moved to Australia as an adult for my husband. I was here through COVID, which was handled exactly as Fauci (and the World Health Organisation) recommended. Most Aussies didn't kick up a fuss, as much as it sucked, because we got it.\n\nI live in Adelaide, which for the first *two years or so* of the pandemic had [six deaths from COVID](https://en.wikipedia.org/wiki/COVID-19_pandemic_in_South_Australia). *Six.* It was only after we loosened restrictions that the death rate went up significantly. (That number of six includes two deaths in the last 4 days of December 2021, after the restrictions had already been loosened. One of those deaths was a two year old.)\n\nWhen my husband and I caught COVID the first time, we had already been vaccinated, and he still wound up in the hospital. The doctors told him the vaccination probably saved his life, because although he had no risk factors for death except being over 40, COVID hit him really hard. (It hit me hard too, I can't remember being much sicker.)\n\nThankfully he survived it and his grandparents, both in their 80s, also survived it- they will have been married 70 years this year, and they are a joy and source of so much love to us all.\n\nAs of [the 19th of February 2025](https://en.wikipedia.org/wiki/COVID-19_pandemic_death_rates_by_country), the US has had 1.2 million deaths in a population of 340 million, with a death rate of 3,560 deaths per million people. Of all the wealthy countries, it has the highest death rate by far.\n\nAustralia has had 25,000 deaths in a population of 27 million and has a death rate of 963 deaths per million people.\n\nI still have family back in the States, but thankfully few elderly relatives, and of those that are they are all former doctors or other health care professionals. My mother, who's 80 now, moved back in with her spouse from the nursing home because she was too at risk for COVID there and she and her spouse self-segregated and disinfected everything that came into the house. But she's still here! She only got COVID after, I want to say, three or four vaccines. \n\nSo you can see why I'm curious about why you didn't like how the Democrats handled COVID. From over here, they were the ones who seemed to be advocating for common sense.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Super_Pie_Man",
            "body": "Yes. I was in it for the lulz in early 2016, but I wasn't actually MAGA. Then everyone kept lying about him about everything. I defended him so much I turned into an actual Trump supporter.",
            "score": 0,
            "replies": [
                {
                    "author": "HeartsPlayer721",
                    "body": "What lies did you find yourself defending the most? (Maybe a top 3?)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Super_Pie_Man",
                            "body": "I'm sorry, that was a long time ago. I clearly remember the \"They're [Mexico] not sending their best\" hoax. Trump claimed that foreign criminals are sneaking into our country and committing crimes, the left found that to be racist. I remember Clinton claiming somehow Trump had had her emails hacked and published. Even though we know how both email leaks happened (One, the files were locally copied onto a USB 2.0 flash drive, based on the file creation dates, implying the hack was local. The other was Podesta falling for a phishing scam and had a laughably weak password.) I remember shortly after the election, the Russia Collision hoax, even though no one could ever tell me what crime/ impropriety Trump did. It baffles me how many people believed such a nebulous claim.\n\nEdit: Oh, and the fake piss document. Trump had an alibi.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "I voted 3rd party in 16 And Trump ever since. The switch was made easy because Trumps election in 16 showed everyone how insane and evil the left is. No further questions.",
            "score": 0,
            "replies": [
                {
                    "author": "HeartsPlayer721",
                    "body": "Insane and evil in what way(s)?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -8,
            "replies": [
                {
                    "author": "mathis4losers",
                    "body": "First, thanks for your response. As a NS, I do not defend the moral high ground the Left has taken nor do I support sensationalized reporting (that happens on both sides frankly). \n\nHowever, I view it the exact opposite way you do. I feel like TS gaslight the Left by blaming the media while they want me to ignore what I see with my own eyes. I watched the debates in 2016, I observed him as President, I watched his COVID Press conferences, I heard him say before the election in 2020 that if he loses the election it means it was rigged, I heard his election fraud claims, I saw his speech on Jan 6, and I have seen his Truth Social rants. How is any of that influenced by the media?",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "mrsoap3",
                    "body": "Can you elaborate? When you say mainstream you think every major news outlet on the world is pushing a narrative? I’m used to reporting based news from other countries, mainly Fox stands out pushing chaotic entertainment to me, I read they eliminated the requirement to share both sides of a story in USA in the 60s or 70s. Which news sources do you trust?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "JealousFuel8195",
                            "body": ">When you say mainstream you think every major news outlet on the world is pushing a narrative? \n\n>\n\nI can't speak for the international media outlets. YES, I do believe that all main stream media outlets in the America, ABC, NBC, CBS, CNN, MSNBC, and Fox News push a narrative. They distort facts. Even when they agree with Trump on an issue they put a negative spin on it. \n\nThe biggest difference is conservatives have one media outlet. Fox News. Meanwhile, liberals have more than the 5 I listed.",
                            "score": -4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HeartsPlayer721",
                    "body": "What media *do* you trust? And what makes you feel they're more trustworthy than the others? \n\n>Post-COVID especially, I saw people really starting to wake up to the industrial scale gaslighting that most of Western society has been living under \n\nWhat are some examples of gaslighting that you've seen/are seeing?\n\n>we have been living in something of our own version of the Truman Show. Its one of those things that *feels* like a conspiracy theory\n\nI'm not sure I understand what you mean here.  That we, the people, are shut off to what's happening in the rest of the world?\n\n>everything the media has been accusing Trump of being and doing is the very things that the bureaucratic establishment is guilty of,\n\nWhat accusations are these? (Just one or two, if you're willing. Doesn't have to be everything.)",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "schabern4ck",
                    "body": "In my experience things are not always black or white, but different shades of gray. Do you think that the truth could be somewhere in the middle? Or do you think democrats = wrong and republican = right?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "JealousFuel8195",
                    "body": "Unfortunately and sadly, many liberals still believe and trust main stream media. I have friends that regurgitate what they were told by CNN, MSNBC etc.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "eggroll85",
                            "body": "Do you think that most people form their opinion of Trump based on the main stream media or just looking at/listening to him?",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "vs7509",
                            "body": "Is it possible that they are not simply regurgitating but have formed their own opinion that happens to be different from yours?\n\nI get this a lot from my TS relatives when really I’m just watching Trump literally speak and reacting to it.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "FlexTape0",
                                    "body": "depends on the person but I doubt the average non supporter of trump is perfectly informed about him, especially if their main criticisms are surface level things like \"felon\" \"racist\" etc.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "KriistofferJohansson",
                                            "body": "Are you suggesting that the average Trump supporter is perfectly informed about him? \n\nHow many news articles have we seen about Trump supporters horribly regretting their choice to vote for him once they found out what he actually stands for?\n\nI’m willing to bet that non supports have a better idea of what a man he is than the supports do (otherwise there wouldn’t be as many supporters).",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "FlexTape0",
                                                    "body": "Do trump voters regret their vote? Considering he's been mostly doing what they voted him in for, there's really nothing to regret lol.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "thedamnoftinkers",
                                            "body": "Do you think it's out of the realm of possibility that people could have watched Trump himself speak and decided he was racist? Or that he didn't have much respect for the law?\n\nI remember seeing him talk about illegal immigrants from Mexico as \"rapists and criminals\" and that was pretty decisive for me. I teach ESL and I know plenty of immigrants, legal and less so, and while there are bad apples in every bunch, every illegal immigrant I've personally known has been 100% about work and family, and either wanted to go back home eventually or find a way to become legal. Aside from their papers, I've never known them to get so much as a speeding ticket- usually they're terrified of cops, for good reason, and thus terrified of breaking the law.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "FlexTape0",
                                                    "body": "Late reply, but your experience obviously leads you yo believe that illegal immigrants are generally normal people, and I would agree with that.  Another's experience might be the \"rapists and criminals\" trump referred to. A large portion of illegal immigrants are legitimate criminals beyond immigrating illegally\nIt's not racist of trump to say that inviting millions of people over the border at once illegally no less is going to invite thousands upon thousands of criminals into the country, he wasn't referring to every illegal as a rapists (legally tho yes they're all criminals)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Fando1234",
                            "body": "Do you think this effect is true on the republican side to? With people parroting what they've heard on fox or the various social media commentators they follow? \n\nFor the record I'm not denying what you're saying, I'm sure it's true of liberals. Only that it also seems to be the same on the right with a different 'narrative'.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "JealousFuel8195",
                                    "body": "It's also true on the republican side but to a lesser degree. The primary reason is there's only one Fox News. vs at least 5 liberal TV stations.\n\nI can't even watch the local ABC, CBS or NBC news here in Florida, without liberal bias.\n\n  \nEven our local Fox TV channel leans slightly left.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "thedamnoftinkers",
                                            "body": "You don't think people are watching OANN or Newsmax?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JealousFuel8195",
                                                    "body": "Some do. I know very few people that watch either. Newsmax is rated 50th in TV viewing between 8-11 PM. MSNBC is 15th with CNN 17th. Foxnews is 3rd.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CptGoodMorning",
            "body": "I voted Obama in 2012, was very active in Democrat politics. Grew a little weary of Dems by 2016 because moral Universal positions and arguments A) did not seem to work and B) did not seem to be applied well to particular situations. So I was sorta sitting out 2016 as neutral and just observing.\n\nWhat followed with how the left reacted to Trump and his supporters, made me confident the left had something very, very, very wrong about how they modelled, explained and described the world. What they believed about themselves, America, the world, and reality itself was just untrue, not beautiful, not loving, and worse. It was cruel, hateful, violent, destructive and harmful.\n\nWhereas Trump's arguments were uplifting, hopeful, unifying, smart. He seemed to appeal to eternal truths about the nature of competition, hierarchies, love and accountability toward one's own, and unapologetic pursuit of Courage, Truth, Beauty, and Goodness. \n\nSo I switched. \n\nMy conviction and clarity has only increased with time.",
            "score": -1,
            "replies": [
                {
                    "author": "HeartsPlayer721",
                    "body": ">What [Democrats] believed about themselves, America, the world, and reality itself was just untrue, not beautiful, not loving, and worse. It was cruel, hateful, violent, destructive and harmful.\n\nWhat beliefs are you referring to?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "CptGoodMorning",
                            "body": ">>What [Democrats] believed about themselves, America, the world, and reality itself was just untrue, not beautiful, not loving, and worse. It was cruel, hateful, violent, destructive and harmful.\n\n>What beliefs are you referring to?\n\nI was speaking generally of the vast panoply of categories that political groups necessarily make calls on. \n\nPolitical groups can be identified and evaluated by their beliefs and actions. In no order, be it energy, crime, sex, property, divisions of people, science, God, sexuality, defense, etc. And much can be discerned by how they describe both today's scenario, historical scenarios, and their ideal vision of the future. As well as their description of their opponents and what they think will result if their opponents gain power.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "flyingchimp12",
            "body": "Honestly I was young but I might’ve supported Rand Paul at first and then trump in 16’, or maybe I would be more concerned about picking someone that can win the general, idk. In 24’ I mostly didn’t support him, I saw him as too old and less energy than in 16 and his first term was a circus a lot of a time particularly because he picked horrible horrible nominees and I didn’t even hear him discuss that issue on the Campaign trail in any detail. I’m very satisfied with the people he picked thus far but we’ll have to see, hopefully the remain effective with less drama and knives out.",
            "score": 0,
            "replies": []
        },
        {
            "author": "JealousFuel8195",
            "body": "I voted for Trump all 3 elections. Trump also won all 3 elections.",
            "score": -16,
            "replies": [
                {
                    "author": "Commie_Cactus",
                    "body": "Can you elaborate on what makes you say he won his second election after losing it?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "11-110011",
                    "body": "Why did he run for a 3rd term if he won the second election?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ph0on",
                    "body": "Do you have any data to back up your claim in any way, shape, or form? Does that mean he knowingly ran for and won a 3rd term already?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "JealousFuel8195",
                            "body": "No, that's not what I mean. I'm of the opinion that Biden didn't win the 2020 election. \n\nI have no desire to relitigate the 2020 presidential election. Now with the benefit of hindsight, I'm glad Trump \"lost\" in 2020 and has come back with an agenda I love.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}