{
    "title": "How do you view art?",
    "author": "SomeFatNerdInSeattle",
    "subreddit": "AskTrumpSupporters",
    "rank": 70,
    "score": 22,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 87,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1iwftdu/how_do_you_view_art/",
    "id": "1iwftdu",
    "selftext": "I don't really have context for this I'm just curious. \n\n\nWhat do you believe is the purpose of art?\n\nDoes art have inherent value?\n\nShould tax payers fund art projects?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "Art can have many purposes, so this first question is, I think, a little silly.  For some people, art is a career path.  For others, it is something that they enjoy.  For still more, it is a way of making a statement.  There's just too many types of art for me to say one particular purpose behind it.\n\nArt does not have any inherent value, in my opinion.  That doesn't mean it is inherently worthless, but rather, something extremely well-done is going to be more valuable, to the average onlooker, than what Little Jimmy drew at kindergarten today.  But I'm sure his parents will still enjoy it.\n\nThis third question gets tricky, and I'm not sure how to approach it, truthfully.  There is practical art and impractical art.  For example, cooking is an art form.  I do not mind tax dollars being used to employ chefs and cooks to cater functions and the like, and I understand the importance of having food available to the POTUS and other lawmakers.  If the Mint decides to issue a new coin/bill with additional features, artists will have to be called upon to design the images.  Heck, every time a new government site pops up, photographers and graphic artists are employed.\n\nI also don't mind \"beautification\" projects, or functional ones.  I have issues with what I call art for art's sake in the form of monuments and the like, just because it's a ton of money that sits in one place, but that is more of a me thing.  I also have problems with art that is meant to be divisive or insulting.\n\nSo, I guess basically, my answer to all three questions is \"It depends.\"  Sorry if that's not much help.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Fignons_missing_8sec",
            "body": ">What do you believe is the purpose of art?\n\nI mean you can take this question as small or as big as you want, there is no one purpose of art. It is to entertain, to communicate ideas and build cultural standing around those ideas, to study the human condition, a form of self expression, and any number of a thousand other things.\n\n>Does art have inherent value?\n\nArt and what it allows is one of the fundamental things that makes us human, so I would say it has about as much inherent value as anything.\n\n>Should tax payers fund art projects?\n\nOccasionally, but mostly no.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "I believed art had purpose until somebody taped a banana to a wall and called it art, then it sold for millions somehow 😭",
            "score": 3,
            "replies": [
                {
                    "author": "ScotchBingington",
                    "body": "Does all art need to have a purpose?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "marx_was_a_centrist",
                    "body": "What do you feel about capitalism and the free market? Is this a greater critique of art or capitalism? When should the fair and open market price, with supply and demand, not rightfully dictate the exchange price of an item?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Fignons_missing_8sec",
                    "body": "The banana was great, maybe the best piece of conceptual art of modern times.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ScotchBingington",
                    "body": "How would you define the financial value of art?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "sshlinux",
                            "body": "Depends on the artist. Michelangelo art is worth more than some guy putting a banana on a wall lol.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ScotchBingington",
                                    "body": "So are you equating value with effort?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "sshlinux",
                                            "body": "Yeah which equates to talent",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ScotchBingington",
                                                    "body": "So you're saying that all artwork which takes a lot of effort equates to talent?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "sshlinux",
                                                            "body": "Yes",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ScotchBingington",
                                                                    "body": "Do you believe Jackson Pollock paintings equate to talent? Either way, why?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "sshlinux",
                                                            "body": "Yes",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Depends on the “art”",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ScotchBingington",
                                    "body": "Why did you put art in quotes?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Because a banana taped to a wall is somehow called art, I don’t believe it should be referred to as art",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Wootai",
                                                    "body": "Marcel Duchamp started a modern art movement with his “readymades” where he first attached a bicycle wheel to a stool in 1913. He then continued to push the boundaries of what was art with “fountain” which was a urinal on its side with the name R. Mutt on it. What Duchamp did at the time was pushed the boundaries and blur the lines between “aesthetic art” and every day objects. Asking us to find beauty in every day objects, the artistry in manufacturing and challenging our ideas of what is art. But also he did it first and was popular. \n\nEvery artist after him says that says “I could have just put a urinal on a pedestal and called it art!” Well, you didn’t so you don’t get the credit. Every artist or critic who says “I could have duct tapped a banana to a wall and called it art”, you didn’t, and you didn’t get the press/popular support. Additionally any attempt to recreate that piece is just derivative and unoriginal. \n\nThink of a Meme like Bad-Luck-Bryan, he’s not the first bad school photo, he won’t be the last, but he was the first to become meme’s to express bad luck, and it continues to be used because it was first and popular. \n\nSo, does it make sense then why something like a duct taped banana would be considered art? Does it make sense that being first, and being original are important to art?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "Fignons_missing_8sec",
                                                            "body": "Comedian (the banana) was great, but I'm also a big fan of his piece before It, America. An 18-karat solid gold toilet that is fully functioning and designed to be used, called America, that was in the Guggenheim before being lent to Blenheim Palace (after a failed attempt to lend it to the Trump white house) where it was promptly stolen while it was plumed in. Say what you want about it, but that whole thing is high art.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Enlightened_Patriot",
                                                            "body": "No that all sounds extremely pretentious and painfully asinine.\n\nIf I wipe my ass and put it in an exhibit, is that art too, because nobody else has done it?\n\nCmon, it’s getting you to question what art is! Expand your mind!\n\nDegeneracy and idiocy is not “art” no matter how novel or popular it is. The idiot who taped a banana to the wall is a disgrace to the historical tradition of western art. The same way scratching my nails on a chalk board isn’t “music” regardless of how edgy you think calling it “music” is.\n\nModern art is not art, it is dysgenic trash, it is a laughing stock of pretentious and imbecilic goofy shit that has less real artistic value than a 3rd grader throwing up on a piece of paper after eating all his crayons.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Owbutter",
            "body": ">What do you believe is the purpose of art?\n\nIt depends on the art.\n>Does art have inherent value?\n\nGenerally it would to someone. Some art, only their creator may love.\n>Should tax payers fund art projects?\n\nSometimes, there are certainly situations where art should be publicly funded, but it should be politically neutral and generally it should be patriotic as well. Federal funds shouldn't be supporting any artist just for the purpose of making art though, if a local government chooses to then they should be able to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sfendt",
            "body": "\\>What do you believe is the purpose of art?\n\nExpression - to evoke feelings, thoughts, ideas, moods, enlighten the mind - sometimes no purpose in particular. \n\n?Does art have inherent value?\n\nTo the beholder - sometimes it has an appraised value (expected value someone might pay for it).\n\n\\>Should tax payers fund art projects?\n\nIn general no, I'm sure someone could find a good case for it, but I'd expect it to be very rare.",
            "score": 1,
            "replies": []
        },
        {
            "author": "populares420",
            "body": "art is to communicate ideas or concepts or can just be for pure aesthetics.\n\ndoes art have inherent value? No. Why would it? It only has value if people find it valuable. \n\nShould tax payers fund art projects? No",
            "score": 1,
            "replies": []
        },
        {
            "author": "Just_curious4567",
            "body": "What do you think, op, about comedians and *their* art?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Justice4Falestine",
            "body": "The deeper question is: Is art for yourself or the world?",
            "score": 1,
            "replies": []
        },
        {
            "author": "tnic73",
            "body": "Art is meant to inspire you to greater purpose. \n\nThe same way competition makes you run faster or jump higher.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGlitteryCactus",
            "body": "  \nI am a furry p0rn artist and I love this question.\n\n>What do you believe is the purpose of art?\n\nArt exists to be beautiful. And also to realize abstract concepts in a way which other people can interpret. \n\n>Does art have inherent value?\n\nSure. I personally find surface level enjoyment in it. If it's pretty, I like it. I suppose it's up to the individual.  \nI believe that some art is less valuable that others. I personally want to see pretty stuff that makes me go *wooooooow*. Stuff like pour-art and abstract, you couldn't give me for free. \n\n>Should tax payers fund art projects?\n\nMy totally bias opinion is yes, the government should buy furry p0rn. Lots and lots of furry p0rn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "heroicslug",
            "body": "The purpose of art is to reflect an aspect of the human soul. \n\n\nArt does not really have an objective value, but it can have significant subjective value. Some famous works of art have an inherent cultural value, yes.\n\n\nTo me, Monet has value (ha) but Pollock does not. But this is subjective.\n\n\nUnder no circumstances should taxpayers fund art projects.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Enlightened_Patriot",
            "body": "Traditional western art has inherent value and you could argue for funding it via local taxes. \n\nModern libtard art isn’t worth anything. It’s cringe watching liberal dorks pretend it is. I hate them. They are worthless, untalented people who have joined a cult with other worthless, untalented people — and they’ve all agreed to pretend their worthless “art” is profound. \n\n> wow you taped a banana on a wall, you are the new Da Vinci!\n\nIt’s like a group of reject basketball players who could never score a point creating their own league and agreeing that the point of the game is not to score, but to turn the ball over and miss shots. They’re painfully stupid, obnoxious, pretentious hipster morons, and they deserve all the contempt they get and more. Their degenerate garbage “art” should be burned.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpicyBanana42069",
            "body": "Tax dollars should never be fund art projects.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gabagool69",
            "body": "These questions all seem very philosophical in nature, but sure I'll take a stab:\n\n> What do you believe is the purpose of art?\n\nAesthetic beauty?\n\n> Does art have inherent value?\n\nIt depends on the art and the value system.\n\n> Should tax payers fund art projects?\n\nIt depends on the cost and the benefit.",
            "score": 1,
            "replies": [
                {
                    "author": "snakefactory",
                    "body": "What about cultural expression?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "CptGoodMorning",
            "body": "Very important. \n\nFor example art can take a Particular, and tell us something true, good, or beautiful about a Universal. Or if we take DesCartes' idea that the beginning of his certainty is that he is, that his experience, his thoughts, are the only true thing he can be certain of, then art is a means to share that true experience to others. \n\nArt of course can be used for evil too. It can corrupt, lie, disempower, deflate, be ugly, etc.\n\nSince government has a duty to her people, she should avoid the latter and engage the former to the extent it promotes courage, truth, beauty, goodness and the rest of the virtues.",
            "score": 1,
            "replies": []
        },
        {
            "author": "orngckn42",
            "body": ">>What do you believe is the purpose of art? \n\nI believe the purpose of art is expression and to capture the reality of the age the art is created in. Perspectives. Having evolved from cave paintings, to stories, to plays, etc. I think art is expression and varies with the time. \n\n>>Does art have inherent value? \n\nI believe so, art serves to capture the current environment. But, it also serves to keep kids off the streets and gives them an outlet. As a practical measure art serves to teach kids how to analyze abstractly and can also teach them about performing in front of audiences. As adults art brings us together for common purposes and serves to give us a way to escape reality for a time. In recent memory, there was a Guillero del Torro exhibit at LACMA that had Stephen Gammell art which was awesome, I go to pop culture conventions all the time (yay SDCC '25), and participated in 6 choirs (3 of which were competition) in high school. Gave me some of my closest friends and dearest memories.\n\n>>Should tax payers fund art projects?\n\nI'm okay with it, to a point. I don't think funding drag operas in Timbucktoo, or wherever, is a reasonable appropriation of our tax dollars, but funding after-school programs here? I'm good with that. Giving grants to original high school or college plays? Grants for school bands and choirs to travel for competitions? That's awesome, especially for low income areas where those kids might not otherwise be able to do that.",
            "score": 1,
            "replies": [
                {
                    "author": "crunchies65",
                    "body": "Love your answer, especially with regard to educational and community programs and also seeing beyond paintings as \"art\" and including plays and music.\n\nWho decides what's appropriate to fund? Should there be a non partisan committee? \n\nLet's say a school or community theater wants to put on a production of *columbinus* or *17 Minutes,* both of which deal with school shootings. Should certain subject matter be dismissed outright or  should a committee read each script and decide first? If it's a theater that puts on multiple productions, should funding be only earmarked for productions that are not questionable (for lack of a better word), or should any group putting on a production considered to be \"questionable\" not get funding at all, even if it's 1 show out of 10 in a season, the other 9 scripts being less or not controversial?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "orngckn42",
                            "body": "I think (and I'm not sure) grant systems are set up where a proposal is put forth through an application process where it is evaluated by a committee and approved or rejected. Personally, I don't think it's any business of the government what communities and schools choose to put on. Art is meant to be provocative. I do think parties should be limited to apply for one grant per fiscal year, to ensure a level playing field for everyone. As for the rest, if they meet qualifications put them in a lottery. That's just my idea.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "crunchies65",
                                    "body": "Anecdotally, I've been hearing from some theaters (it's probably obvious by now I work in the arts) that they don't apply for grants because they are then required to have their seasons approved in order to get the money. And from what I understand, some state grants are funded by the NEA, so while the federal gov might not exercise this approval, their local gov does.\n\nI reviewed the NEA assurance language today: [https://www.arts.gov/grants/legal-requirements-and-assurance-of-compliance#assurance](https://www.arts.gov/grants/legal-requirements-and-assurance-of-compliance#assurance)\n\nDo you think it's ironic that directly above the restriction on funding for groups with DEI statements there are specific requirements to not discriminate against age, sex, disability, race, etc etc?\n\nMy group's DEI committee has only existed about a year, and our goals and accomplishments in this short time have included community outreach to underserved areas, seating improvements for disabled patrons, adding sign language interpreters to at least one performance, adding sensory-friendly performances, and more. Should we be punished for these things? Would simply changing the name of the group be sufficient even if we operate with the same goals? Why?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "orngckn42",
                                            "body": "So, I'm torn in regards to theater. Personally, I think if the part is not specific as to what a person in a role should look like/be, then I think it should be based on talent and ability. However, I'll give a recent example, in the Beetlejuice traveling show Barbara was played by a very talented African American lady. Here is the problem, the part is specific for a Caucasian couple. Even in one of the songs they refer to the Maitlands as, \n\n\"Listen up, I'm not gonna lie\n\nRight now, you couldn't frighten a fly\n\nOr scare a seagull off of a fry\n\nYou ever stop to ask yourselves \"why?\"\n\n\n\nBoth of you are super polite\n\nMiddle class, suburban, and white\n\nWell, all of that is finished tonight\n\nExcept for the white part\n\nObviously\"\n\nNow, casting for the Beetlejuice character is completely open, same with almost every other role,  but for certain roles they are designed for a specific demographic to fill. Unfortunately, some art is discriminatory because of the intent behind the art. I think the intent behind DEI of encouraging underrepresented demographics to compete is fantastic, I think in implementation it ends up being discriminatory. Do I think a theater company should be excluded from grants because they engage in underrepresented areas? Absolutely not, I think art is a wonderful outlet. Are there some areas where there are not enough people to fill the demographics required? Yes, so maybe there should be a thought about changing the play. But, there is art that is maleable to diverse demographics. If you take Les Mis to New Mexico, you will probably have a majority of Hispanic persons auditioning. Now, technically, France in the 19th century was probably majority white. But, there is nothing that specifically restricts the casting. So do blind casting. This is a perfect world in my opinion, blind casting for most parts. Being in choir for so long, I have met talented people from all backgrounds. Going back to Beetlejuice (sorry, love that play), Kelvin Moon Loh from Kuala Lumpur played Otho.  He was fantastic! But watch a video of him trying to do the Beetleuice voice, he can't do it (to be fair, not a lot of people can).  Sorry, I know this is long winded and I'm all over the place. But the arts is a passion of mine, and I don't want ANYONE to be discriminated against. But if I, as a white woman, auditioned for Dorothy in the Wiz, I would not be cast. The character specifically calls for African Americans. So no matter how talented I am, no matter how well I sing the songs, I will never be cast as Dorothy in the Wiz, Nabulungi in Book of Mormon, or Sarah in Ragtime. And that's okay, that is what the art calls for, that is what helps make the art applicable to it's message. It looses meaning when you change some details.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "crunchies65",
                                                    "body": "So, you and I have a TON in common. Most if not all of what you said above I agree with. I believe in blind casting. I believe in staying true to the specifics of a role when and if the playwright or composer specifically called out character traits. I'll point to Ali Stroker and Marissa Bode as great examples of disabled actors who fill their roles beautifully, as an example.\n\nWe obviously differ politically. This is where I get confused. Of course there are things outside of our common views like abortion, immigration, the economy, etc, where we could be wildly different. It just hurts my heart, and I point to the arts as a huge factor in shaping my views, to see Trump deliberately hurting people - and enjoying it, gloating about it. Was his recent [video post calling handcuffs immigration ASMR](https://www.msnbc.com/top-stories/latest/trump-white-house-mocks-immigrants-deported-asmr-x-elon-musk-rcna192820) something you enjoyed?  I can't square in my mind someone artistically empathetic supporting him. Maybe I'm naive? Am I?\n\nI'm not asking you to explain your support of Trump. It's a much larger conversation. I do want to thank you for a great conversation. I wish our commonalities could outweigh our differences.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "orngckn42",
                                                            "body": "Honestly? You and I probably agree more on social issues than you think. I'm pro choice to the point of fetal viability, I'm good with 99% of the LGBTQIA+ (I just don't like men competing against women, we fought so hard to get recognized, if they competed but weren't up for the awards or scholarships, I wouldn't care). The other stuff? I think we probably differ on. I disagree with Trump on some things, but I sure agree with him more than I did Kamala or Biden. If Dems would put up someone who wasn't so radical, I would pay attention. I do get embarrassed by some of the MAGA crowd, just like I'm sure Dems get embarrassed by some of their extremes. The problem is, liberals will swing SO FAR left that it becomes impossible to be okay with it. You want to allow teenagers to be a different gender? That's fine, but hormones and surgery cause permanent damage and their brains are not fully developed. You want to support bringing in minorities? I love that... but remaking the Little Mermaid just to make Ariel African American? Casting specifically Caucasian roles as ethnic just because? That's where I have a hard time.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MattCrispMan117",
            "body": "The point of all art l think is fundamentally to communicate something; feeling, a thought, an image. \n\nl think art is important and part of what makes us human.\n\nl'm not sure l'm against all funding of art but l would be very picky about the sort of art l'd want my tax dollars going to. Obviously nothing post modern or \"\"woke\"\" (for lack of a better term). \n\nAs an example of something l'd be okay with my tax dollars going to we had murreal in the down town of my town for a long time of an artists rendering of what the down town looked like in the 1920s. l thought that was cool and kind of gave the down town some character.",
            "score": 0,
            "replies": []
        },
        {
            "author": "realdancollins",
            "body": "\\>I don't really have context for this I'm just curious.\n\nThat is a great place to start.\n\n\\>What do you believe is the purpose of art?\n\nI do not think it has a purpose.  Art is simply an artist attempting to manifest something that represents what their experience of the world is.  I think this is why conservatives have such a hard time making great art.  They are more driven by the sense of \"ought\" than the average progressive so the conservative art does not effectively resonate with the zeitgeist.\n\n\\>Does art have inherent value?\n\nOf course not.\n\n\\>Should tax payers fund art projects?\n\nNo.  I'd call that \"propaganda\".",
            "score": -7,
            "replies": [
                {
                    "author": "ConceptualisticLamna",
                    "body": "That’s interesting, the bit about propaganda, and I have some questions but mostly your response reminded me of the statues that have been taken down over the years that caused a bit of a whirlwind bc they represented leaders from the confederacy and/or had a gray mark in history. Tax dollars pay for their upkeep. Do you feel like they were propaganda?\n\nSince museums are partly federally funded, What priceless art in the louvre or the met is just art vs propaganda when does it reach a turning point for you?",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "BlueAig",
                    "body": "Can you tell me more about your objection to taxpayer-funded art? I ask because The Washington Monument and Lincoln Memorial were taxpayer-funded, as were the countless memorials to fallen veterans in towns all around the country. In its strictest sense, propaganda is simply something which is shared to support a cause or ideal, so I’d argue that all of those pieces qualify as propaganda. Should government get out of the public art business entirely? Or are there exceptions to be made for projects of adequate cultural or historical value?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "realdancollins",
                            "body": "Monuments are not art.\n\nIf a person got some money from the government to create art, that art is in service to its master.  If a person got government money to create a monument, I'd just not call that art.  I suppose monuments are more aspirational and art is more here-and-now.  That's why it is valuable.  I've got plenty of people claiming to be arrogant enough to be able to explain to me how I should live.  It seems we have a paucity of people who can clearly articulate how we are living.  I suppose that is why Oliver Anthony's \"Rich Men North of Richmond\" resonated so loudly.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "mispeeledusername",
                                    "body": "Am I to understand that you do not view Michelangelo as an artist? At least not his statues?",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "BlueAig",
                                    "body": "Can you tell me more about why art is here-and-now and not aspirational? I have trouble seeing how that holds water. The ceiling on the Sistine Chapel, for example, serves a pretty clear moral function. Religious iconography in general is often instructive and aspirational. Is it not art?\n \nETA: For what it’s worth, I fully agree with your last point, and I think that most popular art inclines in that direction. My point of disagreement is that I think art is a much, much bigger umbrella than that.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "Purpose: A individual's expression\n\nInherent value: up to the individual viewing it. \n\nTax payer funded: fuck no.",
            "score": 0,
            "replies": [
                {
                    "author": "SomeFatNerdInSeattle",
                    "body": "Should the US have helped pay for Mt Rushmore?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "No. Crazy Horse is way cooler anyway. \n\nand Yes I'd throw a few bucks to privately fund Trump being added to Mt Rushmore.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Big_Poppa_Steve",
            "body": "Art has no purpose\n\nArt has no inherent value\n\nTaxpayers should not fund art projects",
            "score": -16,
            "replies": [
                {
                    "author": "feralcomms",
                    "body": "Is entertainment not a purpose? \n\nDoes that entertainment as applied to you have no value? It would se that if you go see a movie (which perhaps we would consider an art) that it would at least be worth the exchange rate of a ticket. \n\nWhy not? Taxpayers subsidize all sorts of aspects of everyday life, why not Art?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Big_Poppa_Steve",
                            "body": "Art has no value. I make lots of art and it has no purpose, and no inherent value. If someone else finds a purpose for it or value in it, that's their business. I would never expect the taxpayers to subsidize me.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "SomeFatNerdInSeattle",
                                    "body": ">I make lots of art and it has no purpose,\n\nWasn't it's purpose for you to express something?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Big_Poppa_Steve",
                                            "body": "Art expresses something, but there is no purpose to it. (If you stick with it long enough, it's a freeing-up feeling.)\n\nWhy would you think the taxpayers should subsidize my self-expression?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "SomeFatNerdInSeattle",
                                                    "body": ">Why would you think the taxpayers should subsidize my self-expression?\n\nI would love more subsidized art",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Big_Poppa_Steve",
                                                            "body": "Who decides what to subsidize?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ban_meagainlol",
                                                    "body": ">Art expresses something, but there is no purpose to it. (If you stick with it long enough, it's a freeing-up feeling.)\n\nIs a freeing-up feeling not a purpose?\n\nDoes doing art bring you any sort of joy, pleasure, happiness, satisfaction, enjoyment, relaxation, anything like that?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Big_Poppa_Steve",
                                                            "body": "Oh, of course. That's why I do it. So does booze, but I don't believe the government should subsidize my bar tab.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ban_meagainlol",
                                                                    "body": "Right but that's not what im saying. You are saying art has no purpose or inherent value, yet you go on to say that you derive some form of satisfaction from creating it. That is a purpose and value in and of itself that is inherent to the creation of art, is it not?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Big_Poppa_Steve",
                                                                            "body": "There is inherent value in the creation of art, not in the art itself",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ban_meagainlol",
                                                                                    "body": "Interesting. So you believe once the art is created and finished, it loses all inherent value and purpose? Do you throw away your art once you finish working on it?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Big_Poppa_Steve",
                                                                                            "body": "Yes",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "feralcomms",
                                                    "body": "Should we get rid of grants programs as offered by the national endowment of arts and humanities?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Big_Poppa_Steve",
                                                            "body": "Yes",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "feralcomms",
                                                                    "body": "No federal grant based funding for the Madison Symphony Orchestra?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Big_Poppa_Steve",
                                                                            "body": "No, sorry. Philanthropic contributions gladly accepted from foundations and private donors.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Big_Poppa_Steve",
                            "body": "No",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tricksofradiance",
                    "body": "Do you not find value in books, movies, or tv shows, even for cultural expression?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Big_Poppa_Steve",
                            "body": "I find value in books, movies, and tv shows, but that value is not inherent.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tricksofradiance",
                                    "body": "I was giving some examples of art that you might engage with. How do you feel about large public art pieces like the Washington monument or Lincoln memorial or various memorials to our Veterans? Many Trump supporters were upset when public art pieces/statues celebrating confederate soldiers were removed- did you agree with them?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Big_Poppa_Steve",
                                            "body": "My understanding is that a lot of those statues were originally put in place with private funds, and often for the purpose of asserting white supremacy when Jim Crow was being dismantled. You can correct me on that if I'm wrong, but I think that's pretty close to accurate. I don't think those statues should have been removed, but rather included in a larger historical context.\n\nAs for the the national monuments, well, those are national monuments. They are titanic and amazing, but I don't think they are there for the artistic value, whether inherent or ascribed.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lemmegetdatdick",
            "body": "To evoke beauty/thought/emotion.\n\nIts value is entirely subjective.\n\nDefinitely not.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Trumpdrainstheswamp",
            "body": "Purpose is for people to express themselves. No, it has no inherent value. No, taxpayers should never fund it.",
            "score": -2,
            "replies": [
                {
                    "author": "tricksofradiance",
                    "body": "Do you not have a single book, movie, television show, tattoo, or other art piece in your life that you feel has any value?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Trumpdrainstheswamp",
                            "body": "They all have value as \"entertainment\" but none of them affect the quality of my life or have any real meaning.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}