{
    "title": "Trump Supporters - Who are the \"Far Right\" and do you consider yourself amongst them?",
    "author": "SteadyDarktrance",
    "subreddit": "AskTrumpSupporters",
    "rank": 43,
    "score": 52,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 191,
    "url": "https://www.reddit.com/r/AskTrumpSupporters/comments/1izhnyt/trump_supporters_who_are_the_far_right_and_do_you/",
    "id": "1izhnyt",
    "selftext": "I'm curious how TS's see themselves on the political spectrum, and where they might place other groups so far as Right, Moderate, Left, Far Left, or whatever other classification you might have.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "AskTrumpSupporters is a Q&A subreddit dedicated to better understanding the views of Trump Supporters, and why they hold those views.\n\n**For all participants:**\n\n* [Flair](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_flair) is required to participate\n\n* [Be excellent to each other](https://www.reddit.com/r/AskTrumpSupporters/wiki/goodfaith2)\n            \n**For Nonsupporters/Undecided:**\n\n* No top level comments\n\n* All comments must seek to clarify the Trump supporter's position\n\n**For Trump Supporters:**\n\n* [Message the mods](https://www.reddit.com/message/compose?to=%23AskTrumpSupporters&subject=please+make+me+an+approved+submitter&message=sent+from+the+sticky) to have the downvote timer disabled\n\nHelpful links for more info:\n\n[Rules](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_rules) | [Rule Exceptions](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_exceptions_to_the_rules) | [Posting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_posting_guidelines) | [Commenting Guidelines](https://www.reddit.com/r/AskTrumpSupporters/wiki/index#wiki_commenting_guidelines)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskTrumpSupporters) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "The far-right are the white nationalists who wants a ethnostate. They do not even consider minority Americans who have been here for a long time as “real” Americans. They are the people who progressives smear as all of MAGA since they are indeed racist and their ideology is abhorrent. Groypers fall into this category. \n\nI do not consider among them. I am a center-right wing populist. There are two political spectrum. The right and left. Populist and establishment. Right and left is cultural issue. Populist and establishment is on economic and systemic issues that rig the system in favor of the wealthy. This system is facilitated by the swamp which are the big donors and special interest.",
            "score": 6,
            "replies": [
                {
                    "author": "barringtonink",
                    "body": "So do you feel that two billionaires are really going to take this system down?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Idk about Trump, but I was weirdly optimistic about Elon Musk. I don’t believe he has any allegiance to Big Pharma, so if he was serious about making the government more efficient then he would call for Medicare being allowed to negotiate drug prices.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "barringtonink",
                                    "body": "Maybe, but what about \"Big Defense Contractor\"?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Yeah, I think he might give himself defense contractors, but if defense spending overall go down then I would take the win. This means Elon would try and defund the bigger defense contractors like Boeing and Raytheon.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Hunter-Dude",
            "body": "On every political spectrum related quiz I'm lib-center, so I'm further left than democrats have been most of my life. The \"Far right\" would be the people who support full abortion bans and banning gay marriage.",
            "score": 9,
            "replies": [
                {
                    "author": "whodey84",
                    "body": "For Lib-Center, what does Trump offer for the following and what gets you excited about them?\n\nHealthcare improvements?\n\nEducation improvements?\n\nUnions/Workers rights?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Lucky-Hunter-Dude",
                            "body": "Nothing. None of those should be a priority of federal government.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "whodey84",
                                    "body": "How is that \"further left\" than dems?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Lucky-Hunter-Dude",
                                            "body": "Democrats love of a nanny state is a relatively recent development. They certainly are FAR LEFT compared to me now.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "whodey84",
                                                    "body": "How recent is \"recent\"? When were Dems further right than your policies?\n\nClinton called for bi-partisan universal healthcare. \n\nCarter made the Dept of Education.\n\nAnd Dems have been pro-union/worker rights since forever.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "handyfogs",
                                                            "body": "I'm interested to see their answer too– not in a condescending way, just out of genuine curiosity. I'm personally economically center-left and I voted for Trump solely because of immigration. It's always nice to come across other people who have shown that they can compartmentalize and prioritize their beliefs instead of aligning themselves with the platform of just one of the two parties.\n\nThat said, I am a bit confused by this person calling themselves center-left but saying that healthcare, education, and worker's rights should not be a priority of the federal government. Isn't a centralized, expansive, and powerful bureaucracy a core part of leftist ideology? Isn't welfare considered to be one of the most highly prioritized issues by Democrats today? \n\nAgain, I'm actually all for decentralization in certain areas– I didn't mind Trump wanting to get rid of the DOE, for example– but I just found it interesting that they also diverged from the historical/standard liberal ideology on this issue, and I would like to know more about that as well.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "MyOwnGuitarHero",
                                                                    "body": "> I voted for Trump solely because of immigration\n\nWhat do you mean by that specifically? Do you hope he does more deportations? Do you hope he streamlines the immigration process to make it more efficient? What have you liked/disliked specifically in regard to his immigration policies?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "handyfogs",
                                                                            "body": "I mean I hoped he'd do mass deportations (I'm pretty disappointed so far, but it's only been a month and some people in power are trying to make it difficult so I'll cut him some lack. He claims to be disappointed with the numbers, too, apparently.)\n\nI do NOT want him to make it easier for people to legally immigrate. I don't like the H-1B stuff, I don't like his stupid Gold Card idea, I don't like any of it.\n\nSo... yeah, hopefully he makes good on his promise of \"mass deportations\" because so far I hear he's accomplished less than Biden. But either way, still far better than Kamala would've been so I'll take what I can get. I'd rather be disappointed than infuriated...",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mehatch",
                                                                                    "body": "What is your ideal version of a legal immigration policy?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "whateverisgoodmoney",
            "body": "As you can see from this thread that there are WILDLY different views among TS.\n\nI personally think that a simple \"left vs right\" axis results in horseshoe theory. A political compass make things more complicated.",
            "score": 2,
            "replies": []
        },
        {
            "author": "agentspanda",
            "body": "Probably anarcho-libertarians who believe in a full-fledged 'no government, no rules, no laws, no state' situation and no, definitely not among them- they're... a lot. That's \"maximalist individual rights & liberties\" which I think goes all the way right on the left/right spectrum from an economics and power perspective. I guess Nazis and the Klan sit in here too *sorta*, but given there's like 10 of them I don't really think that matters to the discussion at the 30,000ft level; and given their whole thing is utilizing the state to oppress people they don't *really* jive with the left/right axis.\n\nIf we ignore size and scope of government and freedom though, then we're talking 'neocon' vs 'neoliberal' and the far right is 'maximum neoconservative', so probably the evangelical right taken to the extreme: utilizing federal power to achieve their social missions. No gay marriage, no abortion, no equal protection clause applications, repeal the Civil Rights Act of 1964, no Harry Potter books in your school library or you don't get federal dollars, etc. They have a lot in common with the far-left though obviously (more on this later). I clearly also don't consider myself among them either; but I used to since they were the closest to my fiscal viewpoint and I just accepted that you've gotta take the whole bundle of sticks- I knew the pendulum was moving left on social issues whether they liked it or not, so I was fine with knowing the social right was going to peter out.\n\n> where they might place other groups so far as Right, Moderate, Left, Far Left, or whatever other classification you might have.\n\nEh, the left/right spectrum doesn't do us a ton of good if you ask me.\n\nYour modern democrat party apparatus is a left to far left organization (it spans the gamut from folks like Manchin to \"abolish private property and shoot CEOs\", so it's a big tent): they believe strongly in using federal (and state/local government) power to achieve their social and economic goals (eg. authoritarianism and strong centrally planned government), they're big fans of growing federal power to ensure it touches as many aspects of individual life as possible, and detractors/alternate viewpoints should be silenced or quieted to prevent spread of their dangerous/harmful/hurtful ideas.\n\nThe problem here is that the modern (or at least pre-2020 Trump) republican party has/had the same problem, it's a right to far-right organization (spanning the gamut from \"90s democrat\" to \"abolish the government, don't tread on me, come and take it from my cold dead hands\"): they believe(d) strongly in using federal (and state/local) power to achieve their social goals (eg. evangelical conservatism), they're big fans of shrinking federal power but growing it in specific sectors to ensure you can avoid most facets of individual life but grow the federal system where it doesn't necessarily interact with people directly (eg. MIC/big business), and they believe detractors/alternate viewpoints should be silenced or quieted to prevent the spread of the devil (eg. dangerous/hurtful ideas).\n\nIt's why the populist movement (eg. Trump) is such a boon; because it seems to sit smack-dab in the middle of the political spectrum where *most* Americans actually are- because the furthest left and right of the spectrum are outliers in their parties. The majority of folks grab a little bit from the party closest to them and hold onto that as their reason for being a \"registered X\", but truth is most Americans [broadly agree on big picture issues and resolution paths for them](https://harvardharrispoll.com/wp-content/uploads/2025/02/HHP_Feb2025_vFinal.pdf) which really explains Trump's appeal.\n\nPut another way, a pro-choice, pro-LGB, anti-war, not *anti-*gun fiscal moderate, social moderate who is a big fan of creeping power but loves slashing expenses (in some places) who reminds you of a blue dog democrat in the 2000s is kinda where most people are. *Significant* progress on the left side of the social scale since the 80s/90s, but measured and reasonable smack-dab somewhere in the middle of the spectrum.\n\nIt's why the neocon right got mad at Trump in 2016, it's why they stayed mad until they gave in and realized the country was moving with him, and it's why the liberal and far-left got mad at Trump and stayed mad.",
            "score": 6,
            "replies": [
                {
                    "author": "SpiritualCopy4288",
                    "body": "I just want to make sure I understand correctly. You’re saying that the modern Democratic Party has a goal of authoritarianism? Is this correct?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "AccomplishedCarob307",
                            "body": "A certain portion of it, yes.\n\nedit: Downvoting me doesn't make it less true.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "flyingchimp12",
                    "body": "I’m sorry I’m not reading all it lol but as for the beginning I wouldn’t call anarcho libertarians far right at all. I think far right almost certainly needs some level of government oppression, militarism, etc. probably based on racial, religious, or other lines. I think it’s what connects the far right and far left is an aggressive state in some aspect. If not you’re more towards the center of the spectrum just higher up or down depending on how much state you want.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "jankdangus",
                    "body": "Anarcho libertarians are far right on economic issues, not social issues.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": "Huh. Not sure why I mixed that up, must’ve been before my morning tea because I know better. \n\nCheers.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "jankdangus",
                                    "body": "Oh nah I just felt like pointing that out for some reason. Because the white nationalists are what people traditionally think of far-right, but yea Javier Millei would be considered far-right as well.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fignons_missing_8sec",
            "body": "There are far more than 1 or 2 axis to judge politics on. There are a lot of answers to what far right can mean because there are a lot of schools of modern right politics. You can look at them (modern Trump evangelicals, post libs, Nietzschen right, tech right, neocons and way more) and see a very different model of what far-right in that group looks like.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SincereDiscussion",
            "body": "I'm not afraid of the label but whether it's appropriate depends on what we mean by the terms. \n\nSome options: an America-centric political spectrum; a global political spectrum; objectively categorizing views as originating on the left or the right regardless of how widespread they are (is this even possible?). \n\nThese generate wildly different answers and people oscillate between them seemingly randomly. Frankly the most parsimonious explanation for how people discuss this is they want to normalize their own views and marginalize/pathologize opposing views, so whatever works to that end is what people use. I am aware of this tendency and am trying to avoid it, but I will be honest, I still have no idea which of these (or some other way?) is actually the best way to conceive of the political spectrum (and assign far left/right accordingly).",
            "score": 4,
            "replies": []
        },
        {
            "author": "ChallengeRationality",
            "body": "I am 100% on board with the Democratic platform of 1996.  \n\nI am a liberal conservative.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MakeGardens",
            "body": "I don’t really have a firm definition of “far right”. \n\nThe terms “far right” and “far left”, to me, have some sort of an anarchistic or terroristic element. It’s not just about politics at that point. \n\nI think of the terms as in “they’ve gone too far” in that they are using violence and being destructive. ",
            "score": 4,
            "replies": [
                {
                    "author": "ThePowerPointist",
                    "body": "Would you consider the January 6th capital rioters “far right” due to inciting violence and destruction of property?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "halkilmer95",
                            "body": "No, because the BLM and antifa riots that proceeded them - and actually amassed a body count - were simply considered \"mostly peaceful protests.\" You can't have two different standards. Since nobody on the Left considers the assault on the White House in May 2020 \"too far\" then we should maintain that consistent standard.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "MJordanFan123",
                                    "body": "I think they were both “too far” but May 2020 and January 6th are not on the same level as far as attacks on government buildings. The Minneapolis/Baltimore riots are much more akin to what we saw at the White House on January 6th don’t you think?  I think when you’re causing violence on both sides - you’re “too far” and you’re wrong. Looting whether it’s a business or a government building is wrong no matter what side the cause is on. \n\nI think the people that committed violence on January 6th should be punished just the same as the people that looted stores and rioted should be thrown in jail. I’m not going to give one side a pass because the other side did. \n\nIt was wrong that BLM rioters didn’t get punished the way they should have. It isn’t an excuse to say the other side shouldn’t be punished for the same thing though. \n\nThat’s just my opinion.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "reid0",
                                    "body": "Why can’t you have two different standards for two totally different things?\n\nBlack Lives Matter protests were primarily about violence by the state against its citizens, or more specifically, things like police officers murdering black people, in some cases right out in the open while people filmed and the person being murdered begs for their life. \n\nAnd then while protesting police violence against black people, the police attacked the black people who were peacefully protesting, which was the catalyst for the rioting which followed.\n\nThen we have January 6th, in which a candidate famous for committing fraud lied to his supporters about the outcome of an election he knew full well that he lost and for which he had attempted to use fraud to claim victory in anyway, in direct contradiction of the constitution.\n\nAfter lying to those supporters he then encouraged them to fight like hell to get their country back and his lawyer suggested they participate in trial by combat and trump promised to join them as the marched on the Capitol.\n\nAfter not doing anything to stop the attack which ensued, in which someone died, trump later told the rioters who pissed and shit in the home of American democracy that he loved them.\n\nAnd you’re suggesting that these two scenarios are equivalent?\n\nLet me point out a few basic differences: \nThe BLM protests happened in the places the BLM protesters lived, whereas the Jan 6th protesters traveled across the country to commit violence.\nThe BLM protesters were protesting something supported by decades of irrefutable proof, whereas there has never been any valid evidence to support trump’s claims of fraud in the 2020 election.\nThe BLM protesters did not come armed with a giant gallows chanting about who they intended to kill, whereas the J6 protesters did.\n\nSo, if you really stop and think about these two scenarios, do you still genuinely consider them equivalent?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "halkilmer95",
                                            "body": ">Why can’t you have two different standards for two totally different things?\n\nThey aren't two totally different things. Both were incidents of political violence based on the belief \"the system\" failed. Just because you're sympathetic to one side and not the other doesn't change this.\n\n>The BLM protesters did not come armed with a giant gallows chanting about who they intended to kill, whereas the J6 protesters did.\n\nOkay, I take it back. They weren't the same thing: The J6ers made giant, theatrical props as part of their demonstrations, whereas BLM & antifa actually murdered innocent people. Not to mention the rapes that occurred at CHAZ/CHOP, which by the way, is what an actual \"insurrection\" and overthrow of the govt looks like.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "reid0",
                                                    "body": "Which of these two scenarios was based on provable facts?\n\nWhich occurred at the Capitol?\n\nWhich involved a [far- right neofascist militia](https://www.reuters.com/investigates/special-report/usa-election-proudboys/) who were convicted of [taking part in a seditious conspiracy](https://www.justice.gov/archives/opa/pr/proud-boys-leader-sentenced-22-years-prison-seditious-conspiracy-and-other-charges-related)?\n\nWhich actually resulted in charges of seditious conspiracy?\n\nWhich was an organised attack on the federal government and an effort to prevent the duly elected president from taking power?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AGuyAndHisCat",
            "body": "I dont know who the \"far right\" are.  What the left and far left call far right is just the Democrat position from as early as 13 years ago.\n\n\nSecure borders, marriage is between a man and a woman, abortion should be rare, anti war, etc were all early obama and hrc positions.\n\n\nSo far right positions would be forced procreation, government providing free guns to citizens, and shooting border crosses on sight.  I don't see anyone advocating for that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FuckYourFuckYou",
            "body": "Far Right and Far Left are the extremists. 10-20% of society. The right is being run by moderates. The left was OVERRUN by extremists. It's why the democratic party is in shambles and the right is thriving, for now.",
            "score": 2,
            "replies": [
                {
                    "author": "Cold_Student",
                    "body": "What kind of extremist positions are the democrats taking? If anything it seemed Kamala tried way too hard to appeal to the center in her campaign",
                    "score": 3,
                    "replies": [
                        {
                            "author": "agentspanda",
                            "body": "I see this espoused a lot by people on the left, but it doesn’t grok with the reality for even a swing voter like me. \n\nEven if it were true, not only did she execute that appeal the worst possible way; but she essentially tried to walk back every opinion she held in the past without having to stake out a new one. That’s wild.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheGlitteryCactus",
            "body": "According to my liberal friends I'm \"Far Right\" because I am a Nationalist and also happen to be white. \n\nIf we don't consider the antics of edgy 13-year old trolls who say stupid/racist stuff for attention as the \"Far Right\" boogeyman, then I'd define \"Far Right\" as those who have rigid political stances based on their interpretation of Religion, e.g. \"No abortion no matter what, because God says so.\" or \"Being gay is a choice and also a terrible sin, because God says so.\"\n\nLikewise, I classify the \"Far Left\"  as those who have rigid political stances based on identity politics, e.g. \"We must be accepting of Fat / Trans / Gay people in entirety and no criticism is allowed.\" or \"If you vote for <Republican> candidate, then you *must* also support <fringe idea>\".\n\nI probably fall somewhere in middle right now. I've moved a little bit to the right, and the DNC *yanked* the center line FAR to the left since Obama's term.",
            "score": 3,
            "replies": [
                {
                    "author": "MJordanFan123",
                    "body": "I’m kind of the same way. I usually find whoever the president is I end up swaying the other direction. You know?  Identity politics and DEI went way too far. I totally agree. Blaming it for the plane crash in Washington DC just as crazy and makes me swing further left hearing that. \n\nBoth sides are so extreme and their position really is built on being the opposite of whatever the other side says on EVERY ISSUE that it’s just this never ending cycle where we can never have anybody in office that actually views the world the same way that most of us do. It’s just one polar extreme to the other every 4 years. \n\nI would love to have a centrist candidate but I just don’t think it will ever happen in a 2 party system. I’m a big proponent of rank choice voting if we could ever get there we’d probably start to see some more moderate candidates that actually are more center left or center right.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "basedbutnotcool",
            "body": "I don’t know where I’d sit. \n\nIn terms of immigration I would be “far right”, but I’m a populist which isn’t typically considered far right. Probably the best term for me would be an ethno-populist. \n\nI’m against elites, against big tech, I want a good healthcare system, good climate change policy, nominally pro lgbt if the kids are left out of it, but my biggest concern is immigration and it trumps all the above issues. \n\nIm curious to hear what people would consider that? For NSers, quote my question and then reply with what you think.",
            "score": 2,
            "replies": [
                {
                    "author": "thedamnoftinkers",
                    "body": "I'm not sure what I'd call you, but I am very curious to hear your take on DOGE and Elon?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "basedbutnotcool",
                            "body": "Good idea in principle, not sure how I feel about the execution, as for Elon musk I’m getting sick of his antics and wish he’d be less prominent within government and just stick to being an awkward tech ceo",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "halkilmer95",
            "body": "The \"Far Right\" is anyone to the right of Bill Clinton. Yes, I'd be among them.\n\nSo are Trump, Elon, Tulsi, RFK, etc. In fact, being a disaffected moderate Democrat who has turned against the military-industrial complex essentially makes one a Nazi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "flyingchimp12",
            "body": "I would say ultra religious, one ethnic state, supports a free economy, almost no regulations, a heavily reduced state outside of the military, uses the state to aggressively go after opponents. I’m sure someone left of center is going to read that and say “thats literally Donald trump” but there’s simply levels to it. \n\nTo address the obvious, Hitler was a radical authoritarian centrist or syncretic, they just call him far right cause he was against far left communism and to demonize opponents of modern liberalism. In fact, scholars these days actually agree hitler is not far right by any modern standard, but that he was far right on the spectrum of the past - not sure why we use the past spectrum exclusively for the NAZIs but yea. \n\nI would say I’m populist right not far right. I don’t care much about religion, race wars, or using the state to go after people. I just want a reduced state when it comes to the economy and social programs while maintaining the size of military and law enforcement, night watchman state",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ivan_Botsky_Trollov",
            "body": "considering how far the overton window has moved to the left, a conservative from the 70s or 80s would be \"far right\"\n\niTS MAGA with some added flavor of American civic nationalism and ethno-centric nationalism\n\nAnd Im kinda there",
            "score": 1,
            "replies": []
        },
        {
            "author": "KnownFeedback738",
            "body": "America First with some flavor of American non-civic nationalism and a skepticism of organized Jewish political groups/movements/influence. I’m probably adjacent. \n\nThe vast majority of MAGA is not that. They’re almost all libertarian or classical liberal types at base but they aren’t extremely ideological (most mass movements aren’t).",
            "score": -10,
            "replies": [
                {
                    "author": "Huge___Milkers",
                    "body": "Would you say the white supremacist in your profile picture is far right?",
                    "score": 37,
                    "replies": [
                        {
                            "author": "KnownFeedback738",
                            "body": "Moderate",
                            "score": -8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyOwnGuitarHero",
                    "body": "Are you skeptical of other groups or just Jews? And why? Sorry, it’s just that I’m Jewish and I’ve never had the opportunity to talk to someone who is open about their cynicism.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "KnownFeedback738",
                            "body": "Other groups aren’t as good at it. Being concerned about foreign interest groups is generally a smart thing tho",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "MyOwnGuitarHero",
                                    "body": "> Other groups aren’t as good at it\n\nWhat does “it” mean here? While I do agree that there’s nothing wrong with healthy skepticism toward foreign interest groups, as a Jew, I’m not foreign. I’m very much an American. Or are you specifically referring to *Israeli* interest groups? Because in that case I think we’re probably in agreement. I definitely do not support the Israeli regime under Netanyahu and while I do think Israel is an important ally for maintaining peace in the Middle East (or at least trying to get there) I think we send them too much aide.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Ivan_Botsky_Trollov",
                                            "body": "**What does “it” mean here?** \n\nsuccesfully lobbying the US govt to do what they want\n\nexample: Ukrainian-americans arent that influential",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jimmydean885",
                    "body": "What does being adjacent to that mean?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "KnownFeedback738",
                            "body": "Quasi",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "jimmydean885",
                                    "body": "you seem to believe it but not really?",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "notapersonaltrainer",
            "body": "The pro-Hamas marchers chanting antisemitic slogans, unironically.\n\nAnd people who unironically pushed academic ethnic quotas under the guise of \"overcrowding\" and \"personality scores\" like their historical brethren. [1](https://perspectives.ushmm.org/item/law-against-overcrowding/collection/higher-education-in-nazi-germany) [2](https://www.ushmm.org/learn/timeline-of-events/1933-1938/law-limits-jews-in-public-schools) [3](https://en.wikipedia.org/wiki/Jewish_quota)",
            "score": -20,
            "replies": [
                {
                    "author": "KnightsRadiant95",
                    "body": "Are nazi trump supporters far right? Are the proud boys who got [excited when Trump said for them to \"stand back and stand by\"](https://www.nytimes.com/2020/09/29/us/trump-proud-boys-biden.html) members of the far right?\n\nAlso I haven't seen current liberals limit Jewish people quotas with the intent to deny Jewish people from attending school. Do you have a source for that? I notice you only showed nazis doing it, but they aren't liberals.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "ApacheGenderCopter",
                            "body": "The amount of actual, far-Right Nazis roaming around the US is minuscule and most are already in prison (think Aryan Brotherhood, KKK, Proud Boys etc.)\n\nThe new Nazis are the Leftists. And it’s not even the “far-Left” because the [Left’s baseline has become a radical movement as is.](https://imgur.com/a/TpogXZj)",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "KnightsRadiant95",
                                    "body": "Can you answer my questions?\n\n>The new Nazis are the Leftists. And it’s not even the “far-Left” because the [Left’s baseline has become a radical movement as is.](https://imgur.com/a/TpogXZj)\n\nPeople on the left say the same about the right and current top where it's gone more right than before but they've stayed the same. Why are they wrong and you're right?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "ApacheGenderCopter",
                                            "body": "Because facts don’t care about your feelings 🤷‍♂️",
                                            "score": -6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Scipio1319",
                                    "body": "This same exact meme has been used but inverse for the left lol. I just don’t understand why we are even saying “oh, the right has wayyy more far right extremists than the left” or vice versa. Why is to always a fucking pissing match? Can’t we just condemn far left and far right dickhead extremists and be done with it? \n\nIf there was actual proof of either side’s claims of who has more then sure let’s talk about it, but a meme isn’t gonna fucking cut it, unfortunately.\n\nAnd by the way, since we should talk about facts, I haven’t heard of any far left extremists storm the capital to overturn an election.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HummusCannon",
                    "body": "Does saying 500,000 dead civilians is too many dead civilians make you far-right?",
                    "score": 45,
                    "replies": []
                },
                {
                    "author": "LockedOutOfElfland",
                    "body": "It's my understanding that a lot of the nuttier, terrorist-sympathizer sentiment in recent protest movements re: Israel-Palestine issues has come not from the right, but from the radical antizionist left.\n\nThat said, I do think there is a horseshoe theory overlap thing going on between leftie antizionists and ultra-right-wing antisemitic conspiracy theorists. But idk about you, in my experience the Hamas apologists out there, at least where I am in the U.S., have typically tended to be left-wingers.\n\nSo I'm wondering what your perspective is to substantiate that statement?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AccomplishedCarob307",
            "body": "American political parties are coalition parties. Trump is a coalition candidate more than the normal presidential candidate. To say everyone supporting Trump is far-right is no different than saying everyone that supported Harris is a PSL member. \n\nThe far-right are the Proud Boys, theocrats, and white-based race essentialists. They are a vanishingly small portion of the population, imo. \n\nI’m healthy right-of-center. Somewhere between a communitarian and a conservative. Individual liberty, reason, and freedom are my paramount issues. Building a local, regional, and national community bonded through a shared respect for those principles is my mission. \n\nI wish the user flairs were a bit more on a spectrum, but I’m more supportive of Trump than I am opposed to him. There’s PLENTY I disagree with him on and can criticize lots of his actions. At the same time, voting for a modern democrat is inconceivable to me in the party’s current state. If I was a voter in the 1990s, I could see myself voting for Clinton.",
            "score": 1,
            "replies": [
                {
                    "author": "Cold_Student",
                    "body": "What new positions have the democratic party taken between Clinton and now that lost you your vote?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AccomplishedCarob307",
                            "body": "For whatever reason, I'm unable to post my response here. [Here is a google doc](https://docs.google.com/document/d/1VTZVo9RuesNsT7nRPZikbP0HuZIKaxSzKI8RZrmGnZA/edit?usp=sharing) with my reply. It is a long one.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Cold_Student",
                                    "body": "Read the full doc and understand your viewpoints, I am also a big believer in the first and second amendment, I do feel that the democrats lately have focused too much on social issues over economic problems, and don't support any attempts on both sides to censor free speech in the name of their beliefs, but this means you're against the book bans conservatives push, restriction of/attacks on the free press committed by Trump, and complete bans of any discussions on LGBTQ topics in schools (i.e. Don't Say Gay) too, right?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AccomplishedCarob307",
                                            "body": "\"Book ban\" is a misleading characterization. No one is stopping Amazon, Walmart, or non-school libraries from carrying books. They're stopping objectionable and inappropriate material from being placed in school libraries and/or educational material. Parents are more than welcome to go buy [\"Lawn Boy\" by Johnathan Evison](https://proteacher.net/discussions/threads/lawn-boy-by-jonathan-evison-graphic-content.656913/) and let their elementary school child read it. But public schools are government facilities, and the government–led by its elected representatives–is free to place reasonable restrictions preventing erotic or inappropriate materials from being provided to children on the taxpayer dime. There are all sorts of material that School libraries do not have and that curriculum doesn't cover. An item being excluded from a finite selection in a public institution designed for the education of children isn't a \"ban\". I do oppose challenges to non-school libraries  offering suggestive or elicit materials, however. I definitely oppose challenges to the private publication or sale of books, though I haven't seen any attempts on this front in America. \n\nJust so I am clear on how you conceive of restrictions and attacks, can you provide an example or two? \n\nI did have an issue with the vague and seemingly-broad reach of the original bill, yes. Students and teachers should absolutely feel comfortable to open up to each other towards building interpersonal relationships before and after the bell, in after-school activities, or in other non-instruction interactions. At the same time, schools and teachers do not have much reason to be discussing such topics in formal education, especially to the ages initially covered (K-3). I know the application is now K-12, but state standards allow \"age-appropriate\" formal instruction; I would need to dig into the standards to determine my view on that. I am fairly comfortable with the amended language [reached through a settlement ](https://www.pbs.org/newshour/show/what-floridas-dont-say-gay-settlement-changes-and-what-restrictions-remain)that clarified the personal/formal-instruction distinction, and finds a happy medium that allows individual expression while keeping subjective and personal views out of formal instruction.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JustGoingOutforMilk",
            "body": "The \"far right\" is largely a boogeyman created to associate \"others\" with them.  It's really a wonderful bit of branding.\n\nThink about it.  When you envision the far right, what do you see in your head?  Are they goosestepping?  Are they wearing strange little mustaches?  And now, look at who gets labeled as far right.  What is it that makes them far right?\n\nOh, that's it.  They're roughly Clinton-era Democrats, more or less.  But that doesn't matter, because you've already made the association in your head and therefore anything far right is bad.",
            "score": 1,
            "replies": [
                {
                    "author": "clumpymascara",
                    "body": "Having studied it quite a bit, Hitler was very big on protecting the Aryan bloodlines and promoting the ideal German family. He then of course blamed their struggles on a different group of people, subtly. For years. Mein Kampf doesn't say \"I'm going to mass murder as many Jews as I can.\" But it does quietly dehumanise them, othering them and other groups. That propaganda built up for years, including book burnings until they started taking action to deal with the fabricated boogeyman. Actions which felt justified to lots of people, else they wouldn't have done them. But aside from race, religion and political opponents, they also removed disabled people, gay people, etc to build the perfect strong Aryan nation.\n\nDo you see any similarities between this and the USA at the moment? Because I do. In the way you all namecall each other, don't see each other compassionately any more. You're already at the dehumanised stage. \n\nAnd a lot of TS would probably think the idea of a perfect nation built on strong white (Christian) families sounds pretty great. I know there have been book burnings and bans. \n\nPlaying along with me for fun, who do you think are the \"Jews\" in this current America? Who's being constantly joked about in right wing circles, whose books are banned and whose lifestyle is seen as a threat to American children?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jackneefus",
            "body": "I consider myself a moderate.  I was a Democrat until about ten years ago and knocked on doors for Kerry and Obama.  I consider Trump a moderate as well as the majority of his supporters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "heroicslug",
            "body": "The far right would be people like Nick Fuentes, who seems to hate Jewish people for some reason. People like David Duke, I think he is affiliated with or runs the American Nazi party. Probably the Westboro Baptist Church, if they're still around. These three named parties are joined by such groups as the Patriot Front, Even though I certainly have my suspicions that such groups are the result of us intelligence agencies attempting to justify their continued existence/ internal police powers.\n\n\nTrump supporters are right-wing/center right. It's important to remember that Trump was/ is a '90s Democrat. Democrats said things similar then to what he says now. \n\n\nMainstream Democrats are center left. AOC, Illhan Omar, and the likes of them are left-wing.\n\n\nThe far left is made up of more or less anonymous elements who dress up in all black and shout about all cops being bastards. \n\n\nThe Overton window has shifted so much. It's honestly pretty remarkable when you think about it. \n\n\nBut we're starting to see a fundamental shift away from the traditional left versus right paradigm, and I'm not really sure what is replacing it. But when you see people Cenk Uygur (I probably spelled his name wrong) agreeing with people like Charlie Kirk, the left right paradigm is well and truly broken.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Big_Poppa_Steve",
            "body": "You should label jars, not people",
            "score": -4,
            "replies": [
                {
                    "author": "tspike",
                    "body": "Do you feel the same way about the labels and nicknames Trump so readily attaches to his opponents?",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Big_Poppa_Steve",
                            "body": "I think that behavior is in poor taste",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "ApacheGenderCopter",
                            "body": "More than often, they deserve it.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mrhymer",
            "body": "The actual IRL far right in the US numbers in the thousands and not the tens of thousands. They are watchdogged by law enforcement and private groups to the point where if one of them takes a shit it's logged on a computer somewhere. They are not vocal online. All the dickheads online are teens fucking with you or leftists desperately trying to create bad guys that justify their nonsense.\n\nTrump supporters are not far right. We are common sense people who want to save this country from people that have an unhealthy relationship with reality.",
            "score": -33,
            "replies": [
                {
                    "author": "petty_cash_thief",
                    "body": "Do you think it’s possible that this is also the case when folks describe the “far left”? Would you consider that perhaps we are all just ants in a jar being shaken up?",
                    "score": 21,
                    "replies": [
                        {
                            "author": "mrhymer",
                            "body": "I wish it was true with the left.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "petty_cash_thief",
                                    "body": "What leads you to feel this way?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "mrhymer",
                                            "body": "It's not a feeling - it's the facts.\n\nAnti-fa is left wing and their acts of violence against people and property are numerous.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "petty_cash_thief",
                                                    "body": "Can you share your sources about this? Would love to investigate further as this has not been my understanding.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "mrhymer",
                                                            "body": "I will let you do your own search.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "petty_cash_thief",
                                                                    "body": "I am looking forward to it- having reviewed some of my main sources, Reuters/AP- can’t find anything: what sources do you suggest?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mrhymer",
                                                                            "body": "google",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "petty_cash_thief",
                                                                                    "body": "When I google will my sourses be infowars?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mrhymer",
                                                                                            "body": "https://www.cbsnews.com/sanfrancisco/news/professor-charged-berkeley-trump-protest-assault/\n\nhttps://www.stardem.com/news/national/anarchy-apple-store-burned-starbucks-nike-stores-vandalized-by-antifa-in-fiery-portland-protests/article_fb30ec5b-c496-52b6-8dee-a28728cced5f.html\n\nhttps://www.npr.org/2020/08/12/901859883/riots-that-followed-anti-racism-protests-come-at-great-cost-to-black-owned-busin\n\nI found 3 in a minute = you will be fine.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "petty_cash_thief",
                                                                                                    "body": "The incident in Portland occurred 4 years ago, do you think this is still an issue? Have you heard anything about antifa recently? Do you feel like all Trump supporters should be lumped in with Neo Nazis and the KKK, or you do feel that viewing this through an objective lens of there’s a spectrum may be more fair?",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Keystone_22",
                            "body": "I had the thought the other day that it would be funny to begin a movement to boycott the word \"Menu\" because it's not only men who cook the food at restaurants.  Or call it Womenu or Xenu.  I got a good chuckle out of the thought.  \n\nSeeing it now, maybe we need to also get rid of the word boycott.  And movement.",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "jimmydean885",
                                    "body": "What prompted this response?",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "Teknicsrx7",
                                    "body": "Huh?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Keystone_22",
                                            "body": "I must have needed /s at the end of my comment.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Teknicsrx7",
                                                    "body": "It just came from left field a bit lol",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "B-BoyStance",
                    "body": "Do you think if someone's opinion of trans people is \"They are people and should simply be left alone\", that they have an unhealthy relationship with reality?\n\nThe trans bashing from right wing politicians makes me very angry. And I don't know any trans people. It's just fucked up and I'm going to vote against the right until they completely drop the issue. \n\nDoes that make me crazy in your eyes?",
                    "score": 26,
                    "replies": [
                        {
                            "author": "mk81",
                            "body": "Mentally ill men exist!!!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "tim310rd",
                            "body": "Yes, they should be left alone, but also leave the children alone, your 4 year old is not trans, and leave women and women's spaces alone, or at the very least don't take it as a personal attack when other people, mainly women, don't want \"identification\" to be the sole criteria for entering their spaces. \n\nAs far as the military goes, HRT causes pretty wild mood swings, especially testosterone, and I don't know if it's a good idea for our military to be giving people medication that will make them physically less capable in the case of MTF transgenders. Probably not.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "MyOwnGuitarHero",
                                    "body": "Curious, are you a woman? That’s not like, a “gotcha” or sarcastic comment, it’s just that as a woman I’ve never encountered a situation where I didn’t feel comfortable sharing space with a trans woman.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "tim310rd",
                                            "body": "No I'm not, but many women are. By spaces I mean changing rooms, potentially bathrooms, sororities, as well as groups specifically meant for women, such as sports.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "canitakemybraoffyet",
                                                    "body": "Yeah in all those scenarios I'd be very uncomfortable sharing a space with any man, including a trans one. Why do you want to force that on us?",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "tim310rd",
                                                            "body": "I don't. I'm arguing against forcing that on people.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "canitakemybraoffyet",
                                                                    "body": "So you support trans men using male restrooms and trans women using female restrooms? Great!\n\nDoes it concern you that Republicans are fighting to force women to share bathrooms with trans men, and men to share bathrooms with trans women?",
                                                                    "score": 9,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "canitakemybraoffyet",
                                                                    "body": "So you support trans men using male restrooms and trans women using female restrooms? Great!\n\nDoes it concern you that Republicans are fighting to force women to share bathrooms with trans men, and men to share bathrooms with trans women?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "tim310rd",
                                                                            "body": "Regardless of identification a trans \"man\" is fundamentally a woman, and vice versa. A trans man has periods, can breastfeed, give birth, etc. I don't think many trans men would feel comfortable in the male restroom either or feel comfortable changing with other men.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "canitakemybraoffyet",
                                                                                    "body": "Why do you think trans men don't feel comfortable with that when that's exactly what they're asking for and saying they want? \n\nAs a woman, I do not feel safe with trans men using my restrooms. On the other hand, I've never felt unsafe with a trans woman. Why are you forcing women to share bathrooms with trans men despite them telling you it makes us feel unsafe?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "tim310rd",
                                                                                            "body": "I have one question? At what point exactly do you feel uncomfortable with trans men. Presumably trans men have always been trans even before they came out, so do you enter changing rooms in fear of the closeted trans man? Are you afraid after they come out and start dressing more masculine? Is it after the breast reduction? Or after the HRT kicks in? Because for a lot of other women with trans women they're against it at every step, from when they were a teenage boy, to when they first started identifying, to when they started cross dressing, to when they got implants and hormones. To me that is the more consistent position. \n\nI say that I doubt their comfortability in the men's room because I knew someone who claimed to be a trans man but I never saw them using male facilities. Did see them in the women's room, no one seemed to bat an eye since they looked like a butch lesbian.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mrhymer",
                            "body": ">Do you think if someone's opinion of trans people is \"They are people and should simply be left alone\", that they have an unhealthy relationship with reality?\n\nI think you need to define government's role in leaving them alone. Because right now we are finding that the US government is all up in that issue and spending millions in tax payer money internationally.\n\n>The trans bashing from right wing politicians makes me very angry. \n\nPlease give some examples of this.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "justfortherofls",
                    "body": "Were the people who attacked the capital far right?\n\nAnd im referring to the people on the front line who were breaking windows, going in with zip ties, pepper spraying and punching cops.  Not the people standing in the back cheering them on.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Teknicsrx7",
                            "body": "I don’t know if they were far right, they were definitely bad people regardless of their political leanings",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "KhadSajuuk",
                                    "body": ">they were definitely bad people regardless of their political leanings\n\nDo you agree with Trump's mass pardon for these bad people?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Teknicsrx7",
                                            "body": "I don’t believe he pardoned any that committed violent acts\n\nEdit: I’ll take the downvotes to mean I’m wrong, can someone fill me in on which people who committed the violent acts that were listed by the commenter and were pardoned? I might be out of the loop and would appreciate clarification",
                                            "score": -8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mrhymer",
                            "body": ">Were the people who attacked the capital far right?\n\nBlack Lives Matter attacked a church not the capital and they were not right wing.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "thedamnoftinkers",
                                    "body": "Wouldn't that be why the other commenter didn't ask about them?",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jaded_Jerry",
            "body": "I couldn't tell you.  I know the left's definition of far right, but it ultimately translates to \"anyone who doesn't tell them what they want to hear.\"  I do mean \\*ANYONE\\* by the way - even when I was a lefty I had people ranging from complete strangers to close friends accusing me of being far right simply because I didn't like how the Democrats talked about Republicans anymore.  Doesn't take much.",
            "score": -9,
            "replies": [
                {
                    "author": "WitnessTheLegitness",
                    "body": "Can you name a specific time when elected democrats, on average, spoke with more vitriol towards republicans than vice versa?",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "handyfogs",
            "body": "This is a complex question, so I apologize in advance for being wordy.\n\nWhat I can tell you easily is that MAGA is not far right, as Trump's platform is honestly very moderate and does not contain anything radically unpopular whatsoever. And honestly, the GOP has moved so far left that they have become even more liberal than the Democrats were in the 2000s. So I can also tell you now that most people in this thread are going to say no, they are not far-right (and they'd be correct), and that the far-right is really [insert nasty insults].\n\nThe reason I said this was a complex question is because it is hard to define what makes someone far-right because there is not really a far-right platform to refer to. Theoretically, the far right should describe anyone who is significantly further to the right than the GOP, which is supposed to represent the center-right. Or, perhaps, it is simply someone whose ideology is significantly further to the right than the average person.\n\nI can answer with certainty that I consider myself to be politically extreme because my ideas are unpopular with the vast majority of Americans, because there is not a politician in office who I feel even nearly represents my beliefs, and because some parts of my beliefs are incompatible with the current structure of our government to begin with, and would therefore require radical change in order to implement. Thus, my beliefs would be considered part of a relatively \"radical\" ideology from where we currently stand as a society (though perhaps I would be considered a centrist in the 17th century, lol)\n\nAccording to horseshoe theory, which I actually do believe in, the extreme left and the extreme right are much less different from each other than they are from the centrists and, often, can even be indistinguishable from each other in their ideas. That said, I consider myself to be, specifically, on the extreme right (far-right) because I believe in blood and soil nationalism, and because I believe in legislating against certain social freedoms– and those ideas are currently perceived as being far-right...despite every practicing far-left government having established the same exact policies. \n\nReally, I think such ideas are simply characteristic of extreme authoritarianism. I'd argue that there is no such thing as a socially liberal authoritarian government, whether LW or RW. But I digress.\n\nThe political spectrum is flawed, but if I must describe my views in the least nuanced way possible, then I am economically center-left and socially far-right. And, yes, I still voted for Trump, whose platform is economically center-right and socially center-left (almost the opposite of me, in many ways), because I was a single-issue voter...lol.\n\nI also think I align with the far-right, despite holding center-left opinions on the economy, because I do care so much more about social issues than I do about the economy, and because I honestly wouldn't truly support any kind of leftist economy until we can sort out our border and immigration problems.\n\nBut I hope I answered your question and explained my thoughts well enough! Have a great evening :)",
            "score": -4,
            "replies": [
                {
                    "author": "SteadyDarktrance",
                    "body": "You don't believe that many of the things Trump is doing now are unpopular?  What do you think are his most popular policy decisions?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "handyfogs",
                            "body": "he and his policies are obviously controversial, as is everything in a democracy– but not unpopular. his approval rating is 52%, and besides, \"radically unpopular\" means radically outside of the current political sentiment and implies that almost no one agrees. obviously, trump has a very significant number of supporters and to be a MAGA conservative in the United States is not considered abnormal lol\n\nand i'm not sure why you're asking for an example of a popular policy, out of the thousands of decisions he's contributed to some of them are bound to be almost unanimously popular? but i'd say his most popular policy move this month is probably the bill that just passed declaring no tax on tips, overtime, or social security (which i remember him campaigning on at rallies. it's nice to see he kept his promise)",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "LatinaMermaid",
                                    "body": "I am sorry but i thought none of the taxes on tips and ssn still hasn’t passed to the Senate yet? I also heard it wasn’t on this current bill. I know the tip thing isn’t happening. Our local news in Vegas is saying that. Since the only reason he won here was for that.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Cold_Student",
                    "body": "What social freedoms do you want limited? And why does that matter more to you than the economy? Economy should be #1 issue for everyone imo since it effects everyone",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "StormWarden89",
                    "body": "\\> I would be considered a centrist in the 17th century, lol\n\nWould you mind outlining where you stand on some former legislative policies that aren't in vogue anymore?\n\nJim Crow?\n\nSodomy Laws?\n\nThe Chinese Exclusion Act?\n\nAlso curious to know if you think women should have the right to vote. Thanks for your time!",
                    "score": 0,
                    "replies": [
                        {
                            "author": "handyfogs",
                            "body": "Jim Crow -> don't really support. there are some concepts that i think are good, like banning interracial marriage (not racist, i can defend this position from a purely philosophical standpoint. i am actually mixed). but the majority of the Jim Crow laws were arbitrary and hateful. plus they were obviously unconstitutional so...it was a lost cause anyway\n\nSodomy Laws -> i'd support that in theory but i don't see how it could possibly be enforced. still, i suppose i'd support it being legislated if not just to send the message that we will not support sexual degeneracy.\n\nChinese Exclusion Act -> definitely support, perhaps with some exceptions. i support anything that makes immigration harder, especially from societies with which we have little in common. nothing against chinese people– i'm part chinese– i think they're great, but they should keep to themselves; their culture, ideas, values, and philosophies are too different from ours. they cannot assimilate easily. also, we need to be careful with them because they are a hostile nation and their people could have questionable motives for wanting to come here. i can't imagine many chinese people actually admire american culture to such an extent where they would abandon their own.\n\nand to answer your last question: no, i do not think women should have the right to vote– and, yes, i am a woman. though i clearly enjoy talking politics, and i enjoy my individual right to vote, i would gladly give it up for the greater good of society. that said, i do not hate women, nor do i think we are stupid or evil or inferior in any way. we are just *different*. we think differently. and i'd argue that the way we think is incompatible, and even poisonous, to politics. men are much more objective and have much more integrity and conviction in their beliefs because high testosterone is associated with such traits. men do not care what others think and do not form their belief system based off of what is socially acceptable, whereas women do. women are extremely vulnerable to propaganda and social pressure; one of our biggest roles in society is to determine what is socially acceptable, and to police each other accordingly. this is wonderful and necessary, but has no place in politics, and historically we seem to have generally understood this.\n\nthanks for engaging in an open and polite discussion about some very controversial and unpopular things!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Vysari",
                                    "body": "I appreciate the honesty in laying out your perspective, but I’d like to understand how you justify these positions in a broader historical and practical context.\n\nYou mentioned supporting bans on interracial marriage, yet you also claim this isn’t a racist position. Given that such laws were historically designed to enforce racial segregation and hierarchy, how do you defend the idea that government should have a say in personal relationships without it being a form of social engineering? If people are freely choosing to marry across racial lines, why should the state intervene? Wouldn’t that contradict the principle of individual liberty?\n\nRegarding sodomy laws, you admit that enforcement is nearly impossible, so what is the purpose of legislating something that can’t realistically be enforced? Is the goal simply to send a political message, and if so, doesn’t that turn the law into a symbolic tool rather than an effective mechanism for governing? If the government is given power to regulate private relationships, where does that authority stop?\n\nOn immigration, you argue that certain cultures cannot assimilate and that restrictions should be placed on groups that don’t share common values. But haven’t we seen these same arguments made throughout U.S. history - against the Irish, Italians, Jews, and Asians - only for those groups to integrate successfully over time? If assimilation depends more on opportunities and integration policies than on racial or cultural background, why assume that modern immigrants are fundamentally different? Wouldn’t restricting immigration based on broad cultural assumptions be more about exclusion than practical governance?\n\nYour position on women’s voting rights also raises some important contradictions. You argue that women are too influenced by social trends to make rational political decisions, but isn’t that an argument that could be applied to large segments of the male population as well? If social pressure and propaganda are the issue, why not advocate for a political literacy test for all voters, rather than singling out women? If testosterone alone determined rational decision-making, why have male-led societies still produced dictators, corruption, and populist movements? Wouldn’t a fairer system be one that evaluates individuals based on knowledge and civic engagement rather than gender?\n\nMore broadly, you argue that extreme positions challenge the status quo, but don’t you think there’s a difference between rethinking societal norms and simply reviving ideas that history has already shown to be deeply flawed? If banning interracial marriage, excluding immigrants based on ethnicity, restricting personal freedoms, and limiting voting rights were truly effective policies, wouldn’t they have led to long-term stability and prosperity rather than social unrest and economic decline? If these policies didn’t work in the past, why do you believe they would work now?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sshlinux",
            "body": "I do consider myself far-right. As do most of my friends irl. I hold National Socialist beliefs. Wasn't till I was in my early 20s.",
            "score": -8,
            "replies": [
                {
                    "author": "MyOwnGuitarHero",
                    "body": "Do you consider yourself a *white* nationalist or no? When I think of far right, that’s usually who I’m picturing.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "sshlinux",
                            "body": "What do you mean by White Nationalist? I'm a White Nationalist I'm a Black Nationalist I'm a Asian Nationalist etc. National socialism is pretty clear that every country should remain it's historically majority native population without the fear of being replaced and genocide. Seems only White people today can't be nationalist and have their own countries. By design and intentional of course. History will repeat itself. Fascism is the only response to the threat. Stop  the threat and fascism dies.",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "opc100",
                                    "body": "Is the land on which the USA sits historically and natively white?",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "MyOwnGuitarHero",
                                    "body": "Ah okay perfect. Thanks. So, sort of an ethnic separatist then. “Japan for the Japanese,” etc. \n\n> Every country should remain its historically majority native population \n\nBut…why? Why *should* that happen? Of course you know my next point is that the US’s native population is not white, and I’m guessing you think I’m about to say, “we should return the US to the natives,” but I *don’t* think that. I’m horrified at how they were treated sure, but — isn’t the entire history of the world filled with people invading other lands and taking them over? Isn’t that just the way the world has always worked, for better or worse? We’re mixed. We always have been, and we probably always will be. Isn’t *that* the “natural” order of things?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "sshlinux",
                                            "body": "Yes we should return it. And the natives should return it to other tribes that settled first. That doesn't justify what's going on today. Not everyone is mixed so idk where you got that information lol. If you want all countries to not be homogenous and mixed isn't that just genocide? Forcing replacement immigration against people's will is not \"natural\" and is a recent thing in modern times.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ApacheGenderCopter",
                                    "body": "Yeah cause only whites can be racist, duhhhh.\n\n/s",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "MyOwnGuitarHero",
                                            "body": "I *don’t* believe only whites can be racist. Did you infer that from my comment? I’m just trying to ask one question at a time but luckily he sort of answered that with his response.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "sshlinux",
                                            "body": "😂 true. They obviously just hate White people and we can't have our own homogenous countries, but everyone else can. I don't expect any good faith responses.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "ApacheGenderCopter",
                                                    "body": "They have become the very thing they swore to destroy… fascists.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "sshlinux",
                                                            "body": "Very true, but they are worse than fascists. They're Communists/Marxists. Just look on Reddit, they have their own communist and marxist subreddits but the far-right doesn't. This is the only ask sub I haven't been banned from the mods have my respect. Reddit is a dying website.  Fascism throughout history only existed as a self defense response to communism. They only support \"Democracy\" if it's people they like. Someone far-right about to gain power by being voted in through Democracy? Arrest them. I wouldn't be far-right or fascist in a peaceful society with no corruption, moderate views have become \"extreme\" by the far left. I know which extreme I'm choosing if forced to pick between the two. My own people and God. Not side ruled by foreign occupiers trying to genocide us to extinction. Take care brother. We'll obviously get down voted in this sub but it doesn't matter, reddit isn't reality.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Academic-Effect-340",
                                                                    "body": "What is your response to other, usually also self described far right, people who say that national socialism is a left wing ideology?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sshlinux",
                                                                            "body": "They're just ignorant conservatives that don't know history. The left wing ideologies stole the term",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MyOwnGuitarHero",
                                                    "body": "Have I not been good faith with you this whole time?",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "knuckle_muffins",
                                    "body": "“Every country should remain its historically majority native population without the fear of being replaced and genocide”\n\nSo like what the settlers did to Native Americans?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "JustGoingOutforMilk",
                                            "body": "How well did that work out for Native Americans?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "knuckle_muffins",
                                                    "body": "Are you saying they got screwed over?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "JustGoingOutforMilk",
                                                            "body": "Yes.  Want to be next in line?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "knuckle_muffins",
                                                                    "body": "You’re saying I’m going to be replaced or murdered?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "JustGoingOutforMilk",
                                                                            "body": "What happens when one population replaces another, historically?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GarrAdept",
                    "body": "Have you found the lable of national socialist to be a respected one? Are you excited for the return of the sieg heil to American politics?",
                    "score": 25,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -26,
                            "replies": [
                                {
                                    "author": "Mexican802",
                                    "body": "If you Google “National Socialism”, what is the first result?",
                                    "score": 27,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "KhadSajuuk",
                    "body": "> I hold National Socialist beliefs. \n\nDo you believe you should feel welcome to say this in America's public spaces?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "sshlinux",
                            "body": "Yeah.",
                            "score": -5,
                            "replies": []
                        },
                        {
                            "author": "ApacheGenderCopter",
                            "body": "Duh. That’s literally what “freedom of speech” means. \n\nIf Leftists are able to behave like radicalised domestic terrorists, then Conservatives should be allowed to be Nationalistic, too.",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "ApacheGenderCopter",
                                            "body": "Musk didn’t “Sieg Heil” and if you genuinely believe he did, get help.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "123twiglets",
                    "body": ">I hold National Socialist beliefs\n\nCan you spell those beliefs out for us, because I'm sure you can understand that \"national socialist\" has a *controversial* history and I wouldnt want to put words in your mouth without understanding you properly?",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "clumpymascara",
                    "body": "As in the very specific term used in German politics around a century ago, that kind of national socialist? Because socialism is usually considered kin to communism in rightwing spaces",
                    "score": 0,
                    "replies": [
                        {
                            "author": "sshlinux",
                            "body": "Yes and those are just ignorant conservatives. Socialist term was stolen by the communists",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "clumpymascara",
                                    "body": "Was it stolen or did conservatives hear the concept and decide it sounded too much like communism?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "sshlinux",
                                            "body": "Both. Like I said some are ignorant of history. Communism is not Socialism. Marxism is not Socialism. They stole the term and confused its meaning. Socialism is an ancient Germanic institution.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mk81",
            "body": "I am whatever you say I am.",
            "score": 0,
            "replies": []
        },
        {
            "author": "CatherineFordes",
            "body": "yes, though it's not an incredibly useful term. \n\nmost in the far \"far right\" have social beliefs that are far right, whereas their economic beliefs will be much more left-wing than your average TS. \n\nreally, it is the best of both worlds. \n\nyou don't have your country flooded with millions of third worlders, but also won't go bankrupt if you stub your toe and have to go to the doctor",
            "score": 0,
            "replies": []
        },
        {
            "author": "Trumpdrainstheswamp",
            "body": "Yes, because there is no such thing as \"far right\" and \"Far left\". It is right or left.",
            "score": -17,
            "replies": [
                {
                    "author": "jankdangus",
                    "body": "You are wrong. Far right are actual fascists and the far left are actual communists. They are a small minority in the country on both sides.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "BuddyOwensPVB",
                    "body": "Don’t people regularly use the term in a meaningful way? I mean the left vs right schema is simplistic, but it does have its uses, right? Wouldn’t people on both ends of the political spectrum be “farther” from the center, or the other side, in most of their beliefs?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "handyfogs",
                            "body": "yes, you are right. i don't know what that person was saying and i don't think they do either",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ApacheGenderCopter",
                    "body": "Nonsense.\n\nThe far-Right is white supremacy groups such as the Aryan Brotherhood, KKK, and Proud Boys etc. \n\n[Though the far-Left is what the regular Left has become](https://imgur.com/a/TpogXZj) - radicalised, anti-Western Marxism.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}