{
    "title": "You won't be obeyed",
    "author": "MagickalessBreton",
    "subreddit": "BaldursGate3",
    "rank": 2,
    "score": 7227,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 99,
    "url": "https://www.reddit.com/gallery/1je35kd",
    "id": "1je35kd",
    "selftext": "",
    "comments": [
        {
            "author": "tiamatt44",
            "body": "Vlaakith: I WISH you to\n\nKerbal: I wish you used your inside voice.",
            "score": 1023,
            "replies": [
                {
                    "author": "zachton44",
                    "body": "The equivalent of a bards 9th level counter spell",
                    "score": 279,
                    "replies": [
                        {
                            "author": "aland_1019",
                            "body": "I am convinced for patch 8 they should add in that if you use the level cap and your character already has lvl 9 magic, you should be able to counter spell that just as a haha moment.",
                            "score": 79,
                            "replies": [
                                {
                                    "author": "BaconxHawk",
                                    "body": "She glares doesn’t say a word and disappears and combat starts as usual. Easy to add, adds lols",
                                    "score": 56,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MagickalessBreton",
                    "body": "https://preview.redd.it/mdg8n2kzegpe1.png?width=688&format=png&auto=webp&s=ad69f491944eb9db874df1887ef1714df245998b\n\n(Later, Scratch would find Kerbal's camp)",
                    "score": 146,
                    "replies": []
                },
                {
                    "author": "puro_the_protogen67",
                    "body": "And vlakith took 400 points of damage from viscous mockery",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ryu_Ugoroshi",
            "body": "Vlaakith just proved that even god-queens aren’t immune to the classic Uno Reverse card.",
            "score": 427,
            "replies": [
                {
                    "author": "Valuable_Material_26",
                    "body": "she a lich not god. And the queen of the hoes",
                    "score": 170,
                    "replies": [
                        {
                            "author": "MagickalessBreton",
                            "body": "Vlaakith isn't a goddess, but neither can she claim dominion over farming and gardening tools. Any good Harborman knows that's Chauntea's domain!",
                            "score": 135,
                            "replies": [
                                {
                                    "author": "Ok_Bit_5953",
                                    "body": "He's a bard though and wouldn't know nothin bout that.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Cruggles30",
                                            "body": "Idk… Bards DO go to college and can take the Religion skill.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Ok_Bit_5953",
                                                    "body": "Fair enough.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kaldricus",
                            "body": "...i can fix her",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Naive_Rain_5713",
            "body": "i made her \"wish\" my death on my first playthrough 😅",
            "score": 226,
            "replies": [
                {
                    "author": "ButWhatIfPotato",
                    "body": "I thought I was the edgiest edgelord that ever edged when I told her to kick rocks and then she nonchalantly proceeded to cast \"fuck you and die\".",
                    "score": 227,
                    "replies": [
                        {
                            "author": "SchighSchagh",
                            "body": "I started playing dnd years ago, and that encounter is surprisingly my only actual encounter with the Wish spell.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Hellknightx",
                                    "body": "It's a shame that high-level play is usually beyond the scope of any adventure modules. I *Wish* WotC would release some 10-20 adventures.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MaverickTopGun",
                            "body": "It was such a FAFO moment for me, I was like oh I didn't realize you were really about that life. ",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Sp3ctre7",
                                    "body": "https://preview.redd.it/z4tqqwo63hpe1.jpeg?width=1920&format=pjpg&auto=webp&s=616c9e9517bd63565f89c21d82e44c8d7686eb21",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MagickalessBreton",
                    "body": "Same! My first character was a Half-Drow Lolth fanatic, I ended up having to skip the whole encounter because it was impossible to survive while staying in character\n\n(I kinda Wish we could counterspell it to really ruin her fantasy of being a goddess)\n\nFor some reason, though, she didn't wish Kerbal to end. She just kept getting angrier as he kept telling her \"No\" and eventually logged off",
                    "score": 89,
                    "replies": []
                },
                {
                    "author": "LadyFruitDoll",
                    "body": "I did the same, but it wasn't malicious! My character was a young, naive, cheerful and curious halfling - basically she had the personality of a happy toddler. She wasn't trying to sass her, she was genuinely confused! If she's a god, why \\*couldn't\\* she just go in and smash the guardian herself? She was trying to show her that yes! She could! Go Vlaakith Go! You can do it!\n\nApparently not.\n\nRelated: playing BG3 as a happy oblivious little halfling child is not really doable when all your companions are 100% on the horn. I couldn't deal with the constant proposals of filth on my beautiful darling Pickles.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Honorsheets",
                            "body": "I dunno a horny party around a naive cheerful completely oblivious to their intentions main character who does not recognize their advances sounds pretty funny to me.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "LadyFruitDoll",
                                    "body": "I mean, potentially, but basically the whole time I was yelling at the screen SHE'S AN INNOCENT BEBE CHILD WHY IS THIS MAKING YOU HORNY and it just got EXHAUSTING.\n\nAt least when I play her in a D&D session (she's one of my regular characters) I can glare suspiciously at whoever has decided to hit on her.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Honorsheets",
                                            "body": "She sounds fun. What class?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LadyFruitDoll",
                                                    "body": "Jillian \"Pickles\" Tealeaf is a thief rogue. She's a dark-skinned lightfoot who changes her hair colour every campaign and plays the tin whistle. She LOVES animals but is terrible at convincing them to be her pets. \n\nI've played her across three campaigns as a 20-something, a 16 year old\\*, and mid-30s less naive self, so I know her pretty well. She's my pure-hearted baby and I love her so much.\n\nI thought I could do a BG3 run as her between 16 and 20 something, but she still wasn't in the right time of life to be considering the fact that bonking exists, y'know? I might do a 30-something run later but I just don't feel like she'd be into the height difference with anyone. That said, I reckon she and Minsc would totally vibe as a couple, weirdly.\n\n\\*when I had to leave the group because I was moving away, she left the party to join a different caravan because she overheard one of the other members saying racist things about halflings - there was a reason but I've forgotten - and it broke her heart\n\nBasically, it showed really early on that playing an asexual/purely platonic character can be really annoying in this game.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Honorsheets",
                                                            "body": "While I'm not ace, I assumed turning down your party members is somewhat painless and mature, since you can tell them to fuck off and they won't ever bring it up again for your sake.\n\nExcept Halsin. I didn't even hit on him and he wanted to bear me, which was hilarious. Let alone a small halfling woman.\n\nAlso terrible at convincing made me laugh.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dolphin_handjobs",
                    "body": "I assumed that since she was astrally projecting herself (or something akin to that) that she couldn't hurt the party.\n\nWas a bit wrong about that.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Abovearth31",
            "body": "\"Listen here you ***little*** shit\" lol",
            "score": 261,
            "replies": [
                {
                    "author": "Xeoah_",
                    "body": "Dungeon soup reference!",
                    "score": 16,
                    "replies": [
                        {
                            "author": "creegro",
                            "body": "*gnome tav squirts some lemon at her eyes*",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "anima201",
                    "body": "That’s the joke.png",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "andyyhs",
            "body": "https://preview.redd.it/m1sbfofpwfpe1.png?width=505&format=png&auto=webp&s=be6bd6b88285c5b18dcc3ebf82c9171f43f84f7b\n\nI kneel because I don't want Bae'zel to disapprove lol",
            "score": 132,
            "replies": [
                {
                    "author": "Abovearth31",
                    "body": "I don't because I like fucking ~~with~~ her. It's funny.",
                    "score": 51,
                    "replies": [
                        {
                            "author": "stalkakuma",
                            "body": "https://preview.redd.it/gc26p6416gpe1.jpeg?width=734&format=pjpg&auto=webp&s=086001387e3b2c054ebff4763a5bb9f9cf63bfa7",
                            "score": 35,
                            "replies": []
                        },
                        {
                            "author": "andyyhs",
                            "body": "Same, I just don't like it when she disapproves, it feels like I've crossed the line.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MagickalessBreton",
                    "body": "That's the neat part about the solo run: can't disappoint Lae'Zel if she's not here to disapprove!",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "Binder509",
                    "body": "She always gets the wave.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fill-In-___-Blank",
            "body": "It's always so funny refusing to kneel and then she kneels immediately after.\n\nLike, who's queen now, Vlakky?",
            "score": 17,
            "replies": [
                {
                    "author": "MagickalessBreton",
                    "body": "https://preview.redd.it/lueem7jsrgpe1.png?width=286&format=png&auto=webp&s=32a571d3c6a219c5f4284c766bf8b443e0c16bbd",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrSandalFeddic",
            "body": "The way she opened her legs towards him for invitation … 😳\n\nSorry I’m going to r/okbuddybaldur",
            "score": 59,
            "replies": [
                {
                    "author": "BrutusTheDane2457",
                    "body": "When you spend too much time on okbuddybaldur.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "MrSandalFeddic",
                            "body": "I thought I was on okbuddy\n\nhttps://preview.redd.it/3xw35pcf5gpe1.jpeg?width=1290&format=pjpg&auto=webp&s=2a8c46705d9ae6f0bb157b4df1dc74914b31263b",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "BrutusTheDane2457",
                                    "body": "Happened to me a few times as well, bud.\n\nhttps://preview.redd.it/p48gfard7gpe1.jpeg?width=1170&format=pjpg&auto=webp&s=203aa75a687fe64bd68d905f37bd53f6c246675e",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "another-reddit-noob",
                                            "body": "seeing both you and u/mrsandalfeddic outside your natural environment of r/okbuddybaldur is absolutely jarring. like seeing your teacher outside of school.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "MrSandalFeddic",
                                                    "body": "![gif](giphy|VIVWFx6c91AAwWLwWB|downsized)",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MagickalessBreton",
                    "body": "https://preview.redd.it/3wayx526dhpe1.png?width=375&format=png&auto=webp&s=6e02ae14f4a16b5e2557e0d34ef93d737095e130",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarthRektor",
            "body": "So I got a game over screen because I mouthed off to her one to many times. I thought I could at least try to fight her….",
            "score": 19,
            "replies": [
                {
                    "author": "MagickalessBreton",
                    "body": "I'm not sure what the exact triggers are for the game over (besides doubting her godhood), but she just threw a tantrum at Kerbal for repeatedly telling her \"No\" and left\n\nI imagine she acts differently depending on whether W'wargaz is alive or not",
                    "score": 11,
                    "replies": [
                        {
                            "author": "DarthRektor",
                            "body": "I was pissed. At least make it an unwinnable fight. wtf is an auto game over in a DnD themed game???",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "extralyfe",
                                    "body": "\"rocks fall, everyone dies\" is a certified hood classic.",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "MagickalessBreton",
                                    "body": "Yeah. I feel that way about Raphael and Voss' first appearance too. I don't mind an enemy being infinitely more powerful than our characters as long as we get to take a swing at them and our inevitable demise fits within the rules\n\nThe fact you can't even attempt to counterspell her Wish just sucks",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "rental-cheese",
                                    "body": "I thought it was amazing",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "starrieEyezz",
                    "body": "I thought there would be a fight too, I mean I killed a God in Divinity 2…\n\nAlas she melted me. Now I at least let her melt me once per play through for funsies.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gloglibologna",
            "body": "Lost my honor mode run to this. I wasn't paying attention and clicked the wrong dialog. \"I wish you were dead\" \n\nFuck.",
            "score": 6,
            "replies": [
                {
                    "author": "morgan423",
                    "body": "That's one of the reasons I'm happy I'm primarily playing on the Steam Deck.\n\nThe natural forced shutdown (Steam button + B) keeps the game from saving so that you can actually choose to restart at your last save if you're forced to.  \n\nHelps big time with Honor Mode because I accidentally misclick objects and dialogue option at least a couple of times per run in a run-ruining way, no matter how careful I'm deliberately being.  I play it so that if I wipe fair and square, that's it, but if I misclick like that, I go back and correct-click.  I'm not going to lose a run due to UI issues.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "MagickalessBreton",
                            "body": "Can't you just... Alt+F4, Alt+Tab and close BG3 or power off your PC or console? It may not be as quick or convenient (if you have unsaved work in the background or if reloading the game is slow), but I don't really see how the Deck has an advantage here\n\nActually, I misclick way more often playing on my Deck than on my laptop because it's very easy to get impatient, skipping dialogue, and press A when inputs start registering but text isn't yet displayed",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Gloglibologna",
                                    "body": "I've tried and in my experience the moment you die the game saves. You would have to force end before death and that shit happens fast.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MagickalessBreton",
                                            "body": "Hm, even then, Alt+F4 is instant, whereas on the Deck you have to hold Steam+B for a while until it takes effect",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AHumbleSaltFarmer",
            "body": "Yeah I totally told Vlaakith to eat shit and got my whole party Thanos snapped",
            "score": 9,
            "replies": []
        },
        {
            "author": "manymoreways",
            "body": "I genuinely wished they had allow us to counter spell her wish.",
            "score": 18,
            "replies": [
                {
                    "author": "WardPhoenix",
                    "body": "Counterspell have a maximum range of what, 30 feet?... Meanwhile she is on a complete another plan.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Korrocks",
                            "body": "Wouldn't you need to have a spell slot equal to hers in order to automatically succeed?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "WardPhoenix",
                                    "body": "9 level spell would be automatic success, but you still need to be within casting range regardless of the level spell.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MagickalessBreton",
                    "body": "As mentioned in another comment, same! Showing to the entire Crèche she's just LARPing godhood would be priceless",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "toastie_22",
            "body": "Smash, next question",
            "score": 5,
            "replies": []
        },
        {
            "author": "Rabid-Wendigo",
            "body": "On my coop evil run my friend suggested all our characters meet vlaakith naked. Was hilarious",
            "score": 9,
            "replies": []
        },
        {
            "author": "stalkakuma",
            "body": "How fed up is Kerbal,  being talked to by everyone? Or are they growing more socially comfortable?",
            "score": 3,
            "replies": [
                {
                    "author": "MagickalessBreton",
                    "body": "TBH, he's not exactly averse to society or conversation, as long as neither invades his personal space and habitat\n\nI'm coming up with his background as I progress through the game and I think the best way to sum it up is that he's used to the life of a hermit and sees visiting civilisation and talking to people as an occasional necessity rather than a normal day to day thing\n\nOf course, he has his own biases, so he's much more mellow towards other Svirfneblin and most Druids, and more antagonistic towards folks who disturb natural forces (Githyanki, Duergar slavers, Wizards, Warlocks)\n\nHe's also so used to shape-shifting (as a Circle of the Moon Druid) and talking to animals that he tends to trample on social conventions without even realising it",
                    "score": 3,
                    "replies": [
                        {
                            "author": "stalkakuma",
                            "body": "The grove certainly had a few like minded druids for him to meet. They certainly like their privacy there, hehe.\n\nOh! What prompted him to visit the creche and not the underdark?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "MagickalessBreton",
                                    "body": "I'm drawing things out of order for the sake of simplicity, but he actually went through the Underdark and *then* went back to the Crèche. I think I had already found Last Light before I went back\n\nThe real reason is I wanted to max XP gain, but for the sake of RP... let's say he followed the tracks of the enslaved Gnomes and took a detour to attempt a rescue\n\nIn the Grove, he really just got along with Apikusis, Rath and Halsin. Folks like Marcoryl or Kagha who want to close off a shelter and won't defend travellers don't sit right with him (which is part of the reason why I'll make him a Ranger/Druid in my follow-up playthrough)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Hellknightx",
                            "body": "Can't wait to see how he handles life in the big city",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "MagickalessBreton",
                                    "body": "So far, he panicked, Wild Shaped into a bird and successfully avoided talking with anyone",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LaidInWater",
            "body": "I could seriously read a full comic strip compilation of Kerbal the Obstinate Lil Shit saying \"No\" throughout the whole campaign.",
            "score": 3,
            "replies": [
                {
                    "author": "MagickalessBreton",
                    "body": "I'm tempted to call him \"The Resolute\"\n\nHe'll definitely have more adventures, but I'll try not to always focus on his lack of cooperation, because that would eventually get stale and predictable. My next two comics at least will be about he's Druidic inclinations\n\nThat said, who knows what's gonna happen in Act 3!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "about36wolves",
            "body": "Who is this kerbal ? Can’t find anything online . Just started playing",
            "score": 3,
            "replies": [
                {
                    "author": "MagickalessBreton",
                    "body": "Kerbal Sweetrock is my OC featured in this comic, [his first adventure](https://www.reddit.com/r/BaldursGate3/comments/1ja9sms/two_is_a_crowd/) got a few views last week so some folks here already know him (and I made [a silly doodle of him](https://www.reddit.com/r/BaldursGate3/comments/1jcmhpd/comment/mi3bqwn/?utm_source=share&utm_medium=web2x&context=3) ereyesterday)",
                    "score": 4,
                    "replies": [
                        {
                            "author": "montybo2",
                            "body": "As a fellow kerbalnaut I feel compelled to follow this man's journey",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "MagickalessBreton",
                                    "body": "He's... not exactly named after KSP (even though I love this game>!'s free demo!< >!and Scott Manley's antics!<)\n\nHis name is a reference to Belkar Bitterleaf from Order of the Stick",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "montybo2",
                                            "body": "My lord and savior Scott Manley lol.\n\nNot familiar with Order of the Stick. Ill check it out!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "MagickalessBreton",
                                                    "body": "Hope you enjoy OotS, it started as funny D&D 3.5e inspired situations and spiraled into one of the best fantasy epics I've ever read\n\nFly safe!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MilodicMellodi",
            "body": "The funny thing is, she’s actually kneeling in the second part. So he technically got his way.",
            "score": 20,
            "replies": [
                {
                    "author": "MagickalessBreton",
                    "body": "My headcanon is, she's so unused to people telling her \"No\", a resolute Gnome is all it takes to break her",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Webbo_man",
                    "body": "![gif](giphy|eOWsyqb4ZpzVYZTwx8|downsized)",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "MadWhiskeyGrin",
                    "body": "well spotted",
                    "score": 7,
                    "replies": [
                        {
                            "author": "MilodicMellodi",
                            "body": "Thank you :3",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Song_8174",
            "body": "Waving politely is the only correct answer.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Skewwwagon",
            "body": "I love this guy please don't stop)",
            "score": 2,
            "replies": []
        },
        {
            "author": "cindyscrazy",
            "body": "Something about her body model makes me think Vlaakith is something like 4 feet tall in real life. \n\nShe makes her image so much taller and makes people kneel due to small man syndrome.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stratis127",
            "body": "I intentionally pissed her off to see what she'd do, and I was not disappointed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "zetsubou-samurai",
            "body": "She kneel. She lose.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheWrongDamnWolf",
            "body": "Dungeon Soup reference? \"You little shit!\"",
            "score": 2,
            "replies": [
                {
                    "author": "MagickalessBreton",
                    "body": "I didn't know about Dungeon Soup, [I was referencing this meme](https://knowyourmeme.com/memes/listen-here-you-little-shit)",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TheWrongDamnWolf",
                            "body": "lol I love it",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sir-faps-a-lot69",
            "body": "Thighs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Juukesx",
            "body": "This B*tch just insta-ended my first honor Mode run just by the wrong choice. I was so pissed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raknirok",
            "body": "I can fix her",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raknirok",
            "body": "I can fix her",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kunseok",
            "body": "can you imagine the smell of the 2nd pic?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Speedhabit",
            "body": "It would be like chalking a pool cue",
            "score": 0,
            "replies": []
        }
    ]
}