{
    "title": "BG3 director: Single-player games are not \"dead\"",
    "author": "AsPeHeat",
    "subreddit": "BaldursGate3",
    "rank": 3,
    "score": 1875,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 127,
    "url": "https://www.videogamer.com/news/baldurs-gate-3-director-says-single-player-games-are-not-dead-they-just-have-to-be-good/",
    "id": "1je79zp",
    "selftext": "",
    "comments": [
        {
            "author": "Automatic_Can_9823",
            "body": "Not sure why this debate keeps coming up every year. It's proven wrong every single year.",
            "score": 1846,
            "replies": [
                {
                    "author": "Cindercharger",
                    "body": "It's the easiest excuse for ceos and shareholders on why their games aren't doing well. Ok, there's also the \"noone wants to play openworld/rpgs/100hour+ games/... anymore\" excuse.\n\n\nOfcourse they can't admit their games are just bad, full of microtransactions and live services noone ever asked for,...",
                    "score": 756,
                    "replies": [
                        {
                            "author": "Automatic_Can_9823",
                            "body": "couldn't agree more. Also, single player games dont just 'stop' when you release them. Look at Space Marine - a dedicated, clear roadmap that keeps people playing. You are dead right, developers need to take accountability for a poor / mediocre game. Larian is at the top of their game - and has the right to comment on these things.",
                            "score": 180,
                            "replies": [
                                {
                                    "author": "Dolorous_Eddy",
                                    "body": "Wanted to get into Space Marine 2 but saw they fell into the FOMO trap like many games these days. Sucks to see.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "VailonVon",
                                            "body": "FOMO crap? have you played the game? You can play the game and unlock some cosmetics for free and then you have paid cosmetics. Where is the FOMO? Unless I'm missing something I haven't seen any indication of FOMO in Space marine 2 I have 60 hours in it so far and haven't seen anything like FOMO.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Dolorous_Eddy",
                                                    "body": "Limited time events and twitch drops",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Jurlar",
                                                            "body": "If memory serves me right they got backlash for it and stopped. Granted, that was a long time ago I was keeping up with that game",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "Dolorous_Eddy",
                                                                    "body": "Nah it’s still a thing and the community gets pissy when you bring it up. \n\nEdit: I was wrong, devs actually backtracked a few weeks ago. Good to see people didn’t put up with that shit. https://www.ign.com/articles/warhammer-40000-space-marine-2-dev-stamps-out-live-service-game-talk-amid-backlash-to-fomo-community-events",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "VailonVon",
                                                            "body": "eh I mean I see your point with that but its just cosmetics and afaik they are not hard to complete like some other games. looking up one of them it was just complete a run on all characters super easy.",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "Dolorous_Eddy",
                                                                    "body": "Regardless of that all cosmetics should be available all the time. I’m surprised that seems to be such a controversial opinion now since not too long ago it was the norm.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "VailonVon",
                                                                            "body": "I think it depends on the game in games focused on cosmetics yea they should always be available.\n\nThink MMOs they are all about the RPG element and building a character.\n\nSpace Marine 2 you are never playing your own character really the cosmetics don't really matter in this scenario.\n\nSame with games like fortnite, PUBG, or any similar battle royal cosmetics don't matter for a different reason is you are just playing a shooter no real RPG element to it.\n\nI wont die on this opinion though for the very reason that if its free anyways not sure why there is a time restriction on it. Its different when it comes to paid stuff.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Dolorous_Eddy",
                                                                                    "body": "It’s a 3rd person shooter. Cosmetics might not matter to you but you’re constantly looking at your gear. Same with other 3rd person games. People like to see their character looking cool.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Angryfunnydog",
                                                                            "body": "It's not controversial, you're right. But bashing great game which just have some cosmetics for multiplayer as limited event seems a bit overreacting no? Especially in the current market where mediocre shit is dominating and on every kcd2 there are 5 avowed \n\nHaving limited events for multiplayer/coop seems fitting. As well as paid cosmetics as long as gameplay-wise all the elements are available to all the players equally. I mean they release whole new modes and operations for free. So it's just seems a bit weird to not play the game at all for them having limited events with some special helmet or smth. It's like the most insignificant element of the game",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "glumbum2",
                                            "body": "Is it another one of those semi looter shooters that basically makes you fall behind if you don't play every day?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "VailonVon",
                                                    "body": "No space marine 2 is not a looter shooter its a horde enemy type game facing tons of enemies at once.\n\nYou have a campaign that has linear map layout and operations that you repeat on different difficulties as extra content but are also other parts of the campaign.\n\nBest way to put it campaign is main character and operations are playing side characters part of the story.\n\nYou repeat the operations to level up your gear to do harder difficulties the only loot is ammo or med stims and couple other things to help you clear the run.\n\nAll gear is specific to what you are playing you just get it and level it up.\n\nEdit: Really space marine 2 is play it if you like the combat doesn't require that much variety in maps to have fun with it.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Angryfunnydog",
                                                    "body": "No, it's badass game where you can rip alien's heads off with your own hands. There's no loot at all and it has pretty solid batch of content both for singleplayer, coop and competitive multiplayer\n\nThey're talking about just some cosmetics for multiplayer modes",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Dolorous_Eddy",
                                                    "body": "Nah just cosmetics in events/twitch drops. But I don’t like having to worry about missing out on anything because I can’t game everyday or turn on a stream",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cel3r1ty",
                            "body": "remember when bg3 came out and AAA devs were like \"don't expect anything like that from us, we'll keep pushing out slop and you will like it\", would've been fucking hilarious if it wasn't deeply sad",
                            "score": 125,
                            "replies": [
                                {
                                    "author": "PzykoHobo",
                                    "body": "\"Consumers can't expect EVERY game to be good! How would we meet profit quotas if we took the time to release high quality, polished products?\"",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "author": "TributeToStupidity",
                                            "body": "It’s unreal the way over the past decades corporations have decided consumers are somehow obligated to buy their entertainment, and will actively attack their fanbase over it.",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "author": "PzykoHobo",
                                                    "body": "Never forget: \"What, you don't have phones?\"\n\nMotherfucker yes, we have phones. So we know what mobile games are like, and that's not the product we want. That's why we're booing you.",
                                                    "score": 37,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Beastlydog23",
                                    "body": "The narratives that came out after BG3 released were wild. I remember the narrative of other gaming companies being legitimately mad at the scale/passion put into BG3. Since in their eyes it would lead to consumers having higher expectations for games in general. You are 100% right. The current state of certain gaming companies is truly sad.",
                                    "score": 34,
                                    "replies": []
                                },
                                {
                                    "author": "flirtydodo",
                                    "body": "That's not what it has been said lol. There are a lot of things that contributed to BG3's success that are not easily replicated (The huge budget, D&D's popularity, sequel to legendary games, long early access, viral hit etc.) \n and this is simply the truth, especially when we are talking about crpgs",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Zielony-fenix",
                                            "body": "Tbh if were talking about AAA games BG3's budget was below what we often see.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "flirtydodo",
                                                    "body": "yeah definitely, that's why I made a point of bringing up crpgs \n\nThis is not larian's first or second or even third game, hell they would know more than me. They were making good games for a long time and none of them are as successful as bg3.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Professional-Hat-687",
                            "body": "Big \"nobody wants to work any more!\" energy. Yeah not for those wages.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "BethanyBluebird",
                            "body": "Also. You cannot tell me if they made merch/cosplay shit easily accessible for people to buy, nerds wouldn't be absolutely THROWING money at them.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "deathangel539",
                            "body": "Agreed, I think half the problem with 100+ hour games these days are they’re full of copy and paste bloat quests, some of which are necessary for level gating purposes. \n\n\nBg3 is probably a 80 hour first run, 30-40 hour second run type of game, a big part of what makes it amazing is the entire expansive element of the world and finding items for your build randomly. Which dissipates largely on a second run, but is still incredibly fun because of how it’s designed. \n\n\nOpen world, long games aren’t the problem, it’s lazy studios making vast, boring, empty worlds on a grand scale simply because they can.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Sprinkhaantje",
                                    "body": "Not me being almost 200 hours into my first run (but almost done now) \n\nLarian could’ve sold me each act as a $60 part and I still would’ve been singing their praises.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "deathangel539",
                                            "body": "I had problems getting overly engaged in dialogue sometimes so skipped some and missed a lot of side stuff on my first run, 200 hours is probably right if you’re exploring everything.\n\n\nI think the £50 I paid for bg3 is the best cost to value ratio of any game I’ve ever bought tbh",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "socialistlumberjack",
                            "body": "amioutoftouch.jpg",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "4look4rd",
                            "body": "Open world games suck. One of the main reasons BG3 is so good is because it has some soft rails and it’s packed with content. It’s not the typical barren land but giant map open world crap that we’ve been getting since GTA3",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "mjwanko",
                                    "body": "I think TES:V Skyrim and Fallout 3/New Vegas/4 would beg to differ. Millions of people play those games and they are considered “old games”.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Mean_Neighborhood462",
                            "body": "With the gaming demographic aging up, if it takes 100 hours, I’m not buying more than 2 or 3 games a year and they’re still going to my backlog with all my Steam sale games, and GamePass games etc.\n\nWhen I was younger, I could go through 2 or 3 a month, but didn’t have the money to keep up.\n\nSo you either have time to play all the big games, or you have money to buy all the big games, but never both.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Jowem",
                            "body": "the profit motive continues",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Not-sure-here",
                            "body": "Waiting for this argument on The First Descendant so that I can roll my eyes",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AbsolutelyHorrendous",
                    "body": "'Well, if we ignore Baldurs Gate, TLOU, Red Dead, Horizon, Spiderman, God of War, etc etc, then *nobody* plays single player games anymore'",
                    "score": 68,
                    "replies": [
                        {
                            "author": "Due-Caterpillar-2097",
                            "body": "witcher 3, and elder scrolls games too",
                            "score": 49,
                            "replies": [
                                {
                                    "author": "Sp3ctre7",
                                    "body": "I mean...Witcher 3 is 10 years old now, and and Skyrim will turn 14 this year.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "Canutis",
                                            "body": "And people still play them. People are still buying them. They continue to generate both revenue and engagement, much more than any of the live-service money grabs that have released and died within that timeframe.",
                                            "score": 50,
                                            "replies": []
                                        },
                                        {
                                            "author": "Division_Of_Zero",
                                            "body": "Cyberpunk 2077 and Elden Ring too.",
                                            "score": 21,
                                            "replies": []
                                        },
                                        {
                                            "author": "Due-Caterpillar-2097",
                                            "body": "People still play these games, proving that singleplayer games aren't just not dead, they are alive forever, especially with mods. Skyrim is just the newest one, what about morrowind ? People play this game to this day and have lots of fun, game from 2002.",
                                            "score": 18,
                                            "replies": []
                                        },
                                        {
                                            "author": "Fit-Association4922",
                                            "body": "Oh my god I feel old.  That went by in a flash.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Due-Caterpillar-2097",
                                                    "body": "Remember watching Skyrim videos and knowing my old family pc with windows xp from 2000 is not going to run it. Same with getting excited over witcher 3, listening to soundtrack over and over, and watching livestreams of game when it came out. Beautiful memories, and first two games I installed on my first ever gaming laptop I got for christmas from parents. Still have em, now on my steam deck <3",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Professional-Hat-687",
                                            "body": "Skyrim still sells for full price at $60",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PzykoHobo",
                            "body": "Since The Game Awards started, there have only been two GOTY winners that weren't primarily single-player: OverWatch and It Takes Two.\n\nSingle player games are sooooo dead.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "CxOrillion",
                                    "body": "And It Takes Two isn't multiplayer in the traditional sense that's meant when people say \"single player is dead\"",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "PzykoHobo",
                                            "body": "Oh for sure. But I knew if I didn't mention it I'd get \"um akshually\"d.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Darksirius",
                            "body": "Hell, I've been playing SW:TOR since it came out. Haven't been in a guild or really any groups in 15 something years. I treat it as a single player game lol.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "0bxcura",
                            "body": "And Black Myth Wukong too... Unless that is a taboo subject",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "AbsolutelyHorrendous",
                                    "body": "I'll be honest, I'd forgotten that game existed, I know very little about it",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "0bxcura",
                                            "body": "Such is the fate of China made games sadly",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Dolorous_Eddy",
                                                    "body": "Black Myth Wukong was actually pretty big in the west. Nothing like China I’m sure, but people definitely didn’t just forget it",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Spicy_Mayonaisee",
                                                    "body": "Can you name another?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "0bxcura",
                                                            "body": "There be this upcoming kungfu action rpg.. where wind meet. Looks quite sweet",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "cel3r1ty",
                                            "body": "i know absolutely nothing about the game except that some people don't like it or at least some people say other people didn't like it for obscure never actually stated reasons",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "whoreforcheesescones",
                                                    "body": "There's plenty of stated reasons though? The developers are very infamously misogynistic. It's very easy to find the reason why people have a problem with them.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "cel3r1ty",
                                                            "body": "sorry, i wasn't trying to come off as glib, it's just that when the game came out i was off social media and wasn't following gaming-related news so now whenever it comes up in conversation and people just say \"game bad\" and move on without elaborating it leaves me a bit confused. never looked into it because the game doesn't look like something i'd enjoy in the first place tbh\n\nedit: also i mostly see \"anti-woke\" grifter types talking about it so i wasn't sure if people actually didn't like the game or if it was a fake outrage \"the lefties are seething\" type thing? idk",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "0bxcura",
                                                            "body": "IGN really had a field day with BM Wukong... So much that it left a lasting effect to the wider audience.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DireDar",
                            "body": "and Elden Ring!",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Riceballs-balls",
                            "body": "Kcd2",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "CxOrillion",
                            "body": "KCD2 now as well",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheFarStar",
                    "body": "Because it's a deliberate misdirection.  \n\nExecutives want to squeeze as much money as possible out of live services and microtransactions, and you can't really do that when you sell a complete game that doesn't nickle and dime the player for every tiny piece of content.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "mechlordx",
                            "body": "And they want multiplayer interaction to cover for some of the content they dont provide",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Professional-Hat-687",
                            "body": "I'll just be in the corner here having violent PTSD flashbacks about the original release of Mass Effect 3 and Galaxy at War.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThisIsTheNewSleeve",
                    "body": "Right!?!? Every single year we get blockbuster single player games breaking records and making a shit ton of money and every single year we get articles like these weighing if single player games are 'dead' or not? \n\nElden Ring, BG3, CP2077, Hogwarts Legacy, Spider-Man, God of War, Pokemon, BotW/TotK, the list goes on and on but these are games making so much money.\n\nSingle player games a thriving. Like Swen said, they just need to be good and they'll do fine.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "bLargwastaken",
                    "body": "Every one of these debates could be rephrased as \"single player games don't give companies as much opportunity to squeeze microtransactions out of players for far less man-power in the studio, so we are pushing propaganda to convince the average gamer that single player is a dying breed\"",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "MeepMeep117-",
                    "body": "It's also mostly on the mistaken assumption that because co-op games are the most sold each year and make the most money (my guess would be the biggest sales each year are this year's Call of Duty and sports games like Fifa, Madden and 2K) it therefore means that solo games are 'not popular'. Which is bullshit since every year we have a banger of a solo game like a BG3, Elden Ring, God of War, Red Dead Redemption, etc... The marker being smaller does not mean it is dead",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "imjustjun",
                    "body": "It generates views. Heck, OP sharing this article is only gonna fuel these pointless debates.\n\nAs long as people are sharing, commenting, and click on these articles they'll keep appearing.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "karkonthemighty",
                    "body": "It's basically explaining why the latest in a game series is suddenly full of micro transactions and became open world grindy multiplayer, aka a game executive is banking on the name alone to move copies and about 300 whales to bring them mega profits rather than just make a normal sequel.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "warfaceisthebest",
                    "body": "Because incompetent devs have to find an excuse for themselves after losing millions of their investors' money.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "GentlemanLuis",
                    "body": "It's proven every time I boot up an online multiplayer game too",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DGlen",
                    "body": "It's a lot harder to keep charging for cosmetics in a single player game so most publishers want them to disappear.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sharkbite1138",
                    "body": "Its like saying \"there are only superhero/marvel movies at the cinema.\" Like open your eyes guys, there's a whole world past online/AAA gaming.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hexdoctor",
                    "body": "Because AAA studios have forced in semi-online features into single player games so they can sell microtransactions. Then they screw over the single player features that make them great. \n\nThe idea that single player games are dead is pushed by CEOs because single player games are harder to overmonetize.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hammererofglass",
                    "body": "Because publishers make most of their money from live service and gambling mechanics and have been trying to will games without those into the cornfield for the last decade.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Beacon2001",
                    "body": "The recent years have proven that single-player RPGs (Baldur's Gate 3) make ton of money, while MMO/Live service games wearing the mask of a single-payer RPG (Dragon Age: The Veilguard) flop.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ridemyscooter",
                    "body": "Especially when the biggest gaming flops as of late seem to be ill thought out live service games and the biggest and best sellers of late seem to be single player games, such as BG3. What I’m really excited about it how BG3 kind of brought back turn based RPGs to the mainstream, so did atlus TBF, and now you’re seeing new AAA turn based RPGs coming out like metaphor and Clair obscur expedition 33.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spyko",
            "body": "~~they are currently dead and will only be revived when I'll be able to play swashbuckler in bg3, c'mon when's patch 8 !~~\n\nthe huge majority of my favorite games in recent years are solo game\n\nplayers love them but they're not as good to sell micro transaction or live service bs so in the eyes of the number crunchers who sit atop game companies, they just see less revenues -> game not as good. I'm so thankful for games like BG3 or so many indie titles to show how important and loved the solo experience is",
            "score": 170,
            "replies": [
                {
                    "author": "sadovsky",
                    "body": "And we saw what happened with the Veilguard debacle. Money crunchers need to quit being so desperate to make money, but that’ll never happen. Sigh.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "literallybyronic",
                    "body": "there's been a swashbuckler mod for BG3 since early access, i'm sure it must be in the mod.io catalog by now.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Spyko",
                            "body": "yeah I think I have it actually, never played it tho, but now that I know we're going to get the Larian cooked version of the subclass (that add stuff like their own version of vicious mockery whuch is so cool) I wanna play that ahah",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Few_Marionberry5824",
            "body": "I don't even look at multiplayer games.  That's like a whole ecosystem of experiences I am not even aware of.",
            "score": 143,
            "replies": [
                {
                    "author": "Jester04",
                    "body": "Closest I'll come is cooperative multiplayer. Me and a few friends/randoms have to work together to do a thing. Whether it's a nice and chill game like Raft or it's a chaotic clusterfuck like Helldivers 2, I vastly prefer working *with* people.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "Professional-Hat-687",
                    "body": "If I wanted to interact with other people, I'd stop playing games and go do that.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "MisterDutch93",
                    "body": "Back in high school I loved playing Halo 3, Reach and CoD World at War online. Probably have more than 500 hours in each game. Nowadays I just cannot find the time to competitively play online. My old Xbox friends have all moved on as well. Current MP games feel more like chores to me. I much prefer a relaxing single player session where I can pick my own pace.\n\n… I just realized I’m getting old lol.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Redfox1476",
                            "body": "It’s the same with tabletop RPGs - used to play every week, religiously, when I was young, but getting half a dozen folks together at the same time, never mind the same table, is so much harder when you’re older.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ComicBookFanatic97",
            "body": "I pretty much only play single player games. They’re very much alive. I don’t need all the toxicity that comes with online multiplayer in my life. More people should take the comfy single player pill. They’d be happier for it.",
            "score": 23,
            "replies": []
        },
        {
            "author": "TLaMagna319",
            "body": "Well story driven games built for single player require the npcs and world to feel more fleshed out than multiplayer games that just need a couple vendors and someone to tell you “point your gun at those guys”",
            "score": 28,
            "replies": []
        },
        {
            "author": "BreadsticksN7",
            "body": "Alphabet title: “But my live service monies…”",
            "score": 36,
            "replies": [
                {
                    "author": "Automatic_Can_9823",
                    "body": "haha",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HydrogenicDependance",
            "body": "Ahhh yes we all know that Books famously died out once the picture Arrived.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Belaerim",
            "body": "They are dead. \n\nUntil Patch 8 comes out. \n\nHow am I expected to play when I know there are shiny new subclasses just around the corner? ;-)",
            "score": 18,
            "replies": []
        },
        {
            "author": "ConcreteExist",
            "body": "The only people who say \"single player games are dead\" are CEOs looking to make a quick buck.",
            "score": 18,
            "replies": []
        },
        {
            "author": "MasterOfViolins",
            "body": "Couch coop <3",
            "score": 34,
            "replies": [
                {
                    "author": "kemical13",
                    "body": "Came here just to say Split Fiction kicks ass.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Flimflam-1",
                            "body": "Split Fiction, It Takes Two, A Way Out. \n\n\nAll bangers from that studio.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "FrostyWhiskers",
                                    "body": "I'm so grateful they exist, and I hope other studio's take notice and start making more couch co-op games.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Automatic_Can_9823",
                    "body": "haha one day",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Glup-Shitto69",
            "body": "Single player games are still the majority, not by much but still.\n\nAll those companies try so hard to convince people to go full multiplayer to sell their microcrap, but they do not consider a lot of gamers are adults with adult lives who cannot compete with teens whose only preoccupations are school and nothing more and have a lot of free time.\n\nThese adults myself included won't buy or download a free game just to get beaten constantly when we can play a SP game and chill while playing it.",
            "score": 6,
            "replies": [
                {
                    "author": "superhappyfunball13",
                    "body": "Competitive multi-player is like a full time job. I pretty much stopped years ago with R6 Siege when people would freak out or TK for not knowing every strategy in the game. \n\n\"WHO THE FUCK PICKS MUTE FOR THIS OBJECTIVE\"\n\nMe I guess, because I like his gun and his wifi routers, my bad for not watching pro league. Can't keep up with how sweaty everyone is even in casual.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrlolloran",
            "body": "Dude absolutely loving KCD2 right now JCBP single player games never went anywhere",
            "score": 3,
            "replies": []
        },
        {
            "author": "SpittingCoffeeOTG",
            "body": "Ofc they are not dead. Over the years I've moved to single player games almost exclusively because of life. I can't play competitive games anymore as I don't have the energy after the whole day of work, taking care of kids and all the stuff around. \n\nAnd I guess I wont be alone.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Mrbluepumpkin",
            "body": "I just brought doom eternal for the second time with all the DLC's and I play that and DMC5 longer than I do most live service games. \n\nThere we go, I just wanted to somehow mention I have doom again, I don't know why. I'm in a bus, bored rn",
            "score": 3,
            "replies": []
        },
        {
            "author": "PatriceLyapov",
            "body": "All I find myself enjoying are single player games. Subnautica, BG3, Dishonored, Slime Rancher, and even Destiny 2 the most fun I have is when I can do stuff on my own. Destiny 2 in particular has shown me why I hate multi-player games. It's because I am playing games to escape, not to be met with the same idiots I meet out there in every day life who almost kill me when I'm driving home from work. Not only meeting the same type of idiots, but now they are anonymous and can act any which way and not meet an societal repercussions for being that way.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zuokula",
            "body": "my skyrim 1000hrs past few months can confirm. But really, not even at 2000hrs of skyrim can compete to time played sc2 or cs. Not to mention wow, though that is not fair with their expansions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "chilicheesepanda",
            "body": "Especially when there is Co-op.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zauberer-IMDB",
            "body": "A journalist approaches a man sitting on a giant pile of money earned from making a single player game...",
            "score": 2,
            "replies": []
        },
        {
            "author": "hornetjockey",
            "body": "People want to keep declaring them dead because the value tilts toward the consumer. Games like BG3 and KCD2 prove that it isn’t the case.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jitterbug726",
            "body": "Good games are not dead. It’s as simple as that. I’ll buy anything that Larian makes, but EA, Ubisoft etc I’ll skip it until maybe they’re in 75% discount. \n\nI’ll buy the shit out of any promising indie game that’s $20 or less too, I’d much rather take a risk on an indie dev knowing full well the game might end up being vaporware.",
            "score": 2,
            "replies": []
        },
        {
            "author": "superhappyfunball13",
            "body": "Only idiots saying single-player is dead are morons like Gubisoft and Activision-Blizzard who want to sell stupid cosmetics",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tom-Pendragon",
            "body": "No shit. Only upper management want to cope and make this into a reality, so the only games that exist are live service games.",
            "score": 3,
            "replies": []
        },
        {
            "author": "OutlawsBandit",
            "body": "if anything its been having a resurgence for the past few years.",
            "score": 2,
            "replies": []
        },
        {
            "author": "uacnix",
            "body": "Yea yea, make more quasi-coop, always online games with their only point of existence being shitty in-app shops and purchases. What can go wrong...",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarvfromSales",
            "body": "My favorite games of all time.. are singleplayer games. I think many on this subreddit would say the same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeavensHellFire",
            "body": "Literally no one thinks they’re dead. This take only exists so people can jerk off their favorite single player games.\n\nIt has always been that they don’t make as much money as multiplayer games which is true.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fire_is_beauty",
            "body": "Most game CEOs: my low effort, high profit live service did not work, what am I doing wrong ?\n\nAlso don't tell me to make a solo game, nobody can actually code in this company.",
            "score": 1,
            "replies": []
        },
        {
            "author": "not_irmilano",
            "body": "Because the community of this game is THE HEALTHIEST EVERRRRR!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "GeorgeStamper",
            "body": "It's funny he says that, I played BG3 couch-co op with my wife.\n\nBut I get the point. Make a good single-player experience without the bullshit that a lot of AAA studios resort to, and there you have it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dazeychainVT",
            "body": "Company that has only released multiplayer games in the past decade says what",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alladin_Payne",
            "body": "They aren't, but all the finance bros in gaming want it to be because a stand alone game isn't reoccurring revenue. They want all games to be saas.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stale-Chalupa",
            "body": " Cool where is my 8th patch",
            "score": 1,
            "replies": []
        },
        {
            "author": "OHarrier91",
            "body": "Team Fortress 2 and Monster Hunter are the only online games I play and enjoy, though the few hours I put into Marvel Rivals were also fun but I didn’t stay there. \n\n\nOtherwise I *only* play single-player games. Getting close to a thousand hours in Rimworld, and over 400 in BG3",
            "score": 1,
            "replies": []
        },
        {
            "author": "waffle299",
            "body": "Single player games are hard to metric, as story quality and engagement need smart, specialized people to make difficult tioquantify decisions.\n\n\nLike movies, it's trivial to make spectical now. It takes people, not outsourced checkbox labor, to make the spectical mean something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BritishBukkake",
            "body": "The only way that statement can hold any weight is by comparing single-players to the likes of Fortnite and GTA5Online. Im missing some examples but those are definite outliers among so many other games. \n\nEvery company wants to be Rockstar or Epic, but that just isn't possible and its unfair to compare games with good profits to games that made profit that surpasses the GDP of some countries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BnSMaster420",
            "body": "The ones I want released are pretty much dead.. I like RPGs like dragon age, mass effect, fallout, elder scrolls, dragon dogma etc. \n\nThe worst news I have gotten in recent memory is that Larien wasn't gonna continue making games in bg universe. So bg being a one off experience absolutely killed my drive to just complete multiple runs..",
            "score": 0,
            "replies": []
        }
    ]
}