{
    "title": "Ye is tweaking to levels never thought humanly possible",
    "author": "40yearoldboomer",
    "subreddit": "Kanye",
    "rank": 6,
    "score": 1312,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 99,
    "url": "https://i.redd.it/s92xigih1epe1.jpeg",
    "id": "1jdybi6",
    "selftext": "",
    "comments": [
        {
            "author": "NibbleOnNector",
            "body": "Tf is he even talking about",
            "score": 411,
            "replies": [
                {
                    "author": "PweaseMister",
                    "body": "barti",
                    "score": 143,
                    "replies": [
                        {
                            "author": "OppositeRock4217",
                            "body": "It’s Carti. You a Blood?",
                            "score": 67,
                            "replies": [
                                {
                                    "author": "SmrtFellaOrFartSmela",
                                    "body": "Farti",
                                    "score": 108,
                                    "replies": [
                                        {
                                            "author": "nopeponope0",
                                            "body": "It’s Carti. You a Flood?",
                                            "score": 114,
                                            "replies": [
                                                {
                                                    "author": "lilkidsuave",
                                                    "body": "Grab the shotgun, we got a Halo to explore",
                                                    "score": 48,
                                                    "replies": [
                                                        {
                                                            "author": "bucketgiant",
                                                            "body": "“This cave is not a natural formation.”",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "Fun-Exercise4164",
                                                                    "body": "no shit cortana, its fucking square",
                                                                    "score": 12,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Admirethesire",
                                                    "body": "Garti",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "organicparadox11",
                                            "body": "Sharty",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "asp821",
                                    "body": "No, he’s probably 14.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LoonieBoy11",
                            "body": "Ngl unexpected W for Carti, i thought he was a lil weird for acting normal around Kanye still but he obviously knows it aint good energy to put in his music",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rustik07",
                    "body": "carti uploaded story where he was asking north to send him a song",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "UniqueXHunter",
                    "body": "Turbo Grafx 16",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "lemonaintsour",
                    "body": "Old Ye",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrandTie6",
            "body": "Ye may not be getting enough oxygen to his brain if the nitrous rumors are true.",
            "score": 192,
            "replies": [
                {
                    "author": "Agreeable-Fix1249",
                    "body": "went to my dentist and got me some ✨️nitrus✨️",
                    "score": 46,
                    "replies": [
                        {
                            "author": "imbidy",
                            "body": "She wanna hop in a Rari",
                            "score": 18,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Seanpines",
            "body": "Imagine fumbling the bag for your daughter lol",
            "score": 411,
            "replies": [
                {
                    "author": "GBC_peep",
                    "body": "oh yeah cause she is so short on money 😭. i think her life was already set before she was even born.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Gnomad_Lyfe",
                            "body": "Her net worth was higher than mine at the moment of conception",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Longjumping-Toe-8659",
                                    "body": "Her net worth is higher than mine will ever be, plus my family",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Excellent-Gur-256",
                            "body": "not money, just fumbling a cool opportunity",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "GBC_peep",
                                    "body": "the opportunity to promote her moms brand?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DerwinDavis",
            "body": "Kanye needs to be under a conservatorship. He is a danger to his finances, his children, and pop culture.",
            "score": 234,
            "replies": [
                {
                    "author": "itskobold",
                    "body": "It's incredible how Britney got slapped with a conservatorship for like 1/1000th of what Ye is doing.  Sexism in the industry",
                    "score": 63,
                    "replies": [
                        {
                            "author": "DerwinDavis",
                            "body": "Exactly.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "PigSkinsHavNoLips",
                            "body": "Tf this gotta do with gender? Y'all reddit people are so weird. Always trying to shoehorn in some feminist bullshit.",
                            "score": -16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "crwcomposer",
                    "body": "He isolated everyone who could potentially be his conservator long ago. Nobody responsible likes him.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Ucazean",
                    "body": "I hope he loses everything",
                    "score": 29,
                    "replies": [
                        {
                            "author": "pickyourteethup",
                            "body": "He's already lost it all. It's not gone yet but he's not able to enjoy any of it so what's the point?",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "DerwinDavis",
                                    "body": "And he can’t blame no one but himself. A few months ago, I would have said he was on his way back. And within a matter of weeks, any progress that he made, it’s all gone once he decided to turn “ye” into a swastika, and for what? He has hella kids with Kim, and he isn’t even worried about the impact all of this is going to have on them. It’s sad, and so unnecessary.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "Ucazean",
                                            "body": "Yep he knows what he’s saying is hurtful and wrong he doesn’t give a fuck so why should I",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Seattlantis8",
                            "body": "Never seen an award for negative rated comment.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Ucazean",
                                    "body": "It’s on the come up I guess lol. It was -20 yesterday",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FruitOrchards",
                    "body": "TBF his finances are no one's business but his. I don't think anyone should be under conservatorship money wise, it's your right to use it how you see fit regardless of what anyone else thinks.",
                    "score": -15,
                    "replies": [
                        {
                            "author": "bynobodyspecial",
                            "body": "He’s using his funds to make nazi memorabilia…",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "FruitOrchards",
                                    "body": "And ? It's not illegal. How about we start doing conservatorship for people who spend their money on weed or coke ? How about designer gear ? Supporting someone you do t agree with ?\n\nWould you apply conservatorship on people who support Palestine? What about Israel ? What about Russia ?\n\nAnyone who just doesn't agree with you right ?\n\nAnd no I'm not a nazi, right wing or even white.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "bynobodyspecial",
                                            "body": "That’s not within the same remit. He’s obviously at a point where he no longer has capacity to make conscious decisions on things which are fundamentally detrimental to himself and his family.\n\nBefore you defend him, this is the same man FIGHTING to get his daughter on a song with Diddy.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "FruitOrchards",
                                                    "body": "His money has nothing to do with anything, it's not detrimental to him or his family. Would have the same thought process either way.\n\nJust admit you want his money taken away because his views don't match yours.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "bynobodyspecial",
                                                            "body": "The fact that there are ethical debates in news articles debating whether or not it’s okay to punch a nazi kind of undermines your whole comment.\n\nhttps://www.motherjones.com/politics/2017/01/video-richard-spencer-punch-antifa-fascism/\n\nhttps://www.theguardian.com/science/brain-flapping/2017/jan/31/the-punch-a-nazi-meme-what-are-the-ethics-of-punching-nazis\n\nhttps://www.vice.com/en/article/we-asked-an-ethicist-if-its-ok-to-punch-nazis-in-the-face/\n\nMost people won’t bother people if they keep their opinion to themselves, or are not actively pushing their opinion on them.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "FruitOrchards",
                                                                    "body": "An ethical debate in a news article means absolutely nothing \n\nOne no it's not ethical\n\nTwo it's illegal\n\nThree what makes you think they won't punch back ?\n\nWhether or not someone keeps their opinion to themselves does not justify a conservatorship over their money regardless of how you look at it.\n\nJust a matter of time before you get a conservatorship for voting \"wrong\" or going against the majority on anything. It's a slippery slope born from \"wrong think\".\n\nWhat happens when the other side gains power and you're the target of retaliation?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "bynobodyspecial",
                                                                            "body": "It’s evidence that it’s a topic of contention and that it happens, which is why wearing Nazi memorabilia  could be detrimental to his family and himself.\n\nThis isn’t about legality it’s about morality and you’re being so obtuse I’m beginning to question yours.\n\nIt doesn’t matter if the Nazi punches back, the fact of the matter is the Nazi gets punched. \n\nDo you believe that he’s in control of his finances? He was being drugged and extorted by his dentist. A man in control of his finances doesn’t get hooked on nitrous.\n\nWhy would I have any desire for him to lose his money, I gain nothing from it. I just think it would be beneficial in the long run. Conservatorships are only as bad as the person actually running them.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FruitOrchards",
                                                                                    "body": "He could afford to wear nazi memorabilia even if he worked at McDonalds\n\nWhos to say he's not in control of his finances? Where do you draw the line ? What if someone buys a brand new truck on finance with 28% Apr ? \n\nWhat if you want to invest all your savings into one stock ?\n\nWhat if you spend $200 a week a on lottery tickets ?\n\nWhy is it because he's rich especially that he should be put on a conservatorship when there's plenty of broke people spending what they really shouldn't be and living paycheck to paycheck or even on welfare spending their money however they see fit ?\n\nNorth is *owed* that money. He could put $5m away for childsupport or is that suddenly not enough to raise a child because he's rich ?\n\nThis desperate attempt to control how people with more money than others should be controlled so they don't \"waste  \nIt\" or whatever.\n\nIf you advocate for this then you should be all for people having to explain every purchase they make when on welfare because their not able to work.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "bynobodyspecial",
                                                                                            "body": "Yeah except he’s not just doing that; he’s also buying diamonds formed in the shape of a swastika. People die over jewellery, especially offensive jewellery.\n\nI’d say considering he’s putting money into Diddy and Nazi merch that he’s not in control of his finances. His political views already lost him 6 billion in deals the first time around. Im pretty sure some companies are dropping him at this moment in time. That’s where he’s investing.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "FruitOrchards",
                                                                                                    "body": "Your political views and what you buy is irrelevant.\n\nWhat if Trump said anyone who buys abortion pills should be under a conservatorship. Same coin different side.\n\nYou're just justifying controlling his money because he thinks differently to you. \n\nPeople lose huge deals literally all the time.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "bynobodyspecial",
                                                                                                            "body": "I’ve not stated my political views, I’ve just stated that he’s using his funds on endorsing and promoting Nazi memorabilia, and that could have detriment to his family.\n\nThe thing to remember here is that there are genuine victims in the case of the nazis and Diddy.\n\nNever thought I’d have to type that sentence but here we are.\n\nI’m justifying controlling his money because he has a massive influence on the world and people less informed will look to him as a role model. He’s normalising the spread of hateful material.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "bynobodyspecial",
                                                                                                            "body": "I’ve not stated my political views, I’ve just stated that he’s using his funds on endorsing and promoting Nazi memorabilia, and that could have detriment to his family.\n\nThe thing to remember here is that there are genuine victims in the case of the nazis and Diddy.\n\nNever thought I’d have to type that sentence but here we are.\n\nI’m justifying controlling his money because he has a massive influence on the world and people less informed will look to him as a role model. He’s normalising the spread of hateful material.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "FruitOrchards",
                                                                                                                    "body": "I wasn't talking about *your* political views I was talking in general.\n\nYou're just wasting my time",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "bynobodyspecial",
                                                                                                                            "body": "I feel exactly the same way.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "ObligationAlive3546",
                                                                            "body": "Hey buddy \n\n\nFuck u",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DerwinDavis",
                            "body": "I feel like this argument goes out the door when someone has 4+ kids. Sure, their mom is rich and comes from a big family (and thank god) but that doesn’t give him an excuse to blow m/billions in the air because he’s mentally unraveling every other month. It’s abusive, it’s traumatic, and it’s irresponsible. Lock his stupid ass up!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FruitOrchards",
                                    "body": "It doesn't go out the door, it's his money. Lock his ass up for what ?",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "DerwinDavis",
                                            "body": "For abusing his platform, being a horrible parent, and supporting the losing team from WORLD WAR TWO?! Idk. Feels like grounds for a conservatorship. Wendy Williams is on ice for far less.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "OkExtension3775",
                                                    "body": "Theirs nothing wrong with supporting the losing team in a war, currently Palestine is the losing team in the war with Israel. The issue is who the losing team supports and what the hard their ideology causes. The only thing Kanye should be charged with is hate speech everything else he does is his constitutional right.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ReplacementOdd4323",
                                                            "body": "Hate speech isn't illegal.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "OkExtension3775",
                                                                    "body": "Then he has no grounds to be charged",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DerwinDavis",
                                                                            "body": "Kanye West is a global entity, and such actions would be illegal in countries like Germany, where Holocaust denial and the display of Nazi symbols are criminal offenses.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "OkExtension3775",
                                                                                    "body": "He’s an American citizen who lives in the us and is currently in the us they can’t charge him for a crime he’s doing in America in a different country",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DerwinDavis",
                                                                                            "body": "You’re missing the point. He’s an influential figure, he’s a father, he’s a representative of a genre, and this country. regardless of the laws, he is held to a standard far above the average civilian—he has a responsibility that he currently is not respecting. Therefore, he should be stripped of his platform, and his wealth should be protected for his children’s wellbeing. Not sure why this is a debate.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "OkExtension3775",
                                                                                                    "body": "Due to the internet this is literally impossible, you can’t strip him of his platform because there are people still trying to be Kanye and want more music from Kanye. Yes these numbers are lower but as long as they exist he can’t lose all his influence. His past music also influences this because people want a “comeback.” His wealth should not be tampered with at all because that’s his constitutional right. He worked for that money",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "DerwinDavis",
                                                                                                            "body": "Yes, and a conservatorship would (a) protect his assets for his children and (b) prevent him from doing further harm to his legacy so that he can (c) continue to generate income to take care of himself, and his children. Allowing him to further spew unnecessary and ignorant hatred for the sake of “promoting my new album” is counterproductive and only diminishes his value as an artist, a brand, and a talent. A conservatorship stops him from doing *more* harm. This man is almost 50 years old, enough is enough.",
                                                                                                            "score": 0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kingfishisgood",
            "body": "OH NO I'M A 47 YEAR OLD MAN AND I FUCKING HATE TAKING ACCOUNTABILITY FOR MY OWN ACTIONS",
            "score": 79,
            "replies": [
                {
                    "author": "pickyourteethup",
                    "body": "hmm, interesting. Have you considered running for president?",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "UniversalHuman000",
            "body": "Why is he talking in third person? \"His tweets\" \"your dad\"\n\nIs Ye tweeting this or someone else? I'm confused",
            "score": 101,
            "replies": [
                {
                    "author": "hatefulevo",
                    "body": "i think he’s talking as if he was carti",
                    "score": 183,
                    "replies": []
                },
                {
                    "author": "OppositeRock4217",
                    "body": "He’s Tweeting it’s from Carti’s perspective",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "MeatyOkraLover",
                    "body": "Kanye isn’t actually North’s father",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "baran132",
            "body": "Did Carti use North's vocals? Idk I didn't listen to the album.",
            "score": 29,
            "replies": [
                {
                    "author": "WWKWDO",
                    "body": "No, Carti name-dropped Skims on a song, Kim posted the lyrics and Carti reposted her storie saying \"tell my niece send me a song\"",
                    "score": 68,
                    "replies": []
                }
            ]
        },
        {
            "author": "Prancer4rmHalo",
            "body": "Hmm.., well at least this is more like regular asshole ye and not Nazi ye.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Nieruz",
            "body": "Kanye didn't even give carti his biggest song. This mf is fucking stupid",
            "score": 21,
            "replies": []
        },
        {
            "author": "GoodDawgy17",
            "body": "this is just some bad mimicry sir cartier is incapable of speaking english",
            "score": 6,
            "replies": []
        },
        {
            "author": "SweatingSeltzerGirl",
            "body": "this man could be literally getting a deep tissue massage by 10 people at once but chooses this shit",
            "score": 3,
            "replies": []
        },
        {
            "author": "myheart2008",
            "body": "🤦🏻‍♂️",
            "score": 5,
            "replies": []
        },
        {
            "author": "AkoysiCoy",
            "body": "He is lost he is dead he sold his soul",
            "score": 2,
            "replies": [
                {
                    "author": "Any_Entertainment146",
                    "body": "heavy on sold his soul. and this is a whole other contract he’s on now",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Active-Case-4180",
            "body": "Honestly man needs to be put in an institution. All is irratic behaviour links to his illness. He refuses meds or help and it’s just clearly getting worse. If he or no one does something mans gon be going down a very dark hole",
            "score": 2,
            "replies": []
        },
        {
            "author": "vitaooman",
            "body": "I’m done someone beat him up already please",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ieatass-086",
            "body": "Carti made carnival a hit, not the other way around",
            "score": 2,
            "replies": []
        },
        {
            "author": "Snoo-43285",
            "body": "Ye just doesnt make any sense he crashed out on Twitter, and then he is mad his peers still want to have a career, and not bring back the holocaust.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Basic_Loquat_9344",
            "body": "At this point I just hope he gets the help he needs",
            "score": 2,
            "replies": []
        },
        {
            "author": "laurent1683",
            "body": "how did kanye give Carti his biggest song lmao",
            "score": 4,
            "replies": [
                {
                    "author": "LarryBigBalls",
                    "body": "Off the grid and he executive produced wlr",
                    "score": 6,
                    "replies": [
                        {
                            "author": "derrick256",
                            "body": ">executive produced\n\nSo he did fuck all",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "jY5zD13HbVTYz",
                                    "body": "He was in the background watching porn and yapping about fucking shoes",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GoodDawgy17",
                    "body": "Whole lotta red",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "deathwish_ASR",
                    "body": "Carnival I guess",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Seattlantis8",
                            "body": "Carinval was Kanye’s biggest song in years and Carti carried that track. He must be upset Carti doesn’t want to work with him anymore.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Necessary-Sale-4784",
                            "body": "well with carnival u could say carti gave kanye his biggest song in years cus it’s kanye’s song and besides the chorus carti is the reason the song is popular lmao",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Illustrious_Abies273",
            "body": "This guy stinks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "squidmilkerz",
            "body": "he has genuine problems I wonder if he is still off the nitrous",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -7,
            "replies": [
                {
                    "author": "crystalwind99",
                    "body": "Nah man, if I was carti I still wouldn't have had Kanye spit some antisemitic bullshit on my album",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Legitimate-Target381",
                            "body": "I wouldn’t have put him on my album either but it’s prolly not the right time to publicly ask Kim to make music with his daughter",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "AnonymousCharmander",
                                    "body": "It's weird because the same can be said about carti and Kendrick",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "whotfisneropax",
                    "body": "glaze",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrandJunket8146",
            "body": "Stupid people on reddit. Ye is right",
            "score": -5,
            "replies": [
                {
                    "author": "eggyracoon95",
                    "body": "https://preview.redd.it/1uj6hop88hpe1.jpeg?width=1290&format=pjpg&auto=webp&s=c70920564d0214f7a034f7faaafb2664286e0084",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}