{
    "title": "Iggy Responds to Ye Tweak Post",
    "author": "CoolRisk4022",
    "subreddit": "Kanye",
    "rank": 0,
    "score": 1671,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 257,
    "url": "https://i.redd.it/h0wigyem2gpe1.jpeg",
    "id": "1je453l",
    "selftext": "Nah wtf ye on rn",
    "comments": [
        {
            "author": "ironyhaioffendmatho",
            "body": "bro I have no idea what the fuck is even happening in hip hop anymore what the fuck has this shit become",
            "score": 691,
            "replies": [
                {
                    "author": "PsychologyRelative57",
                    "body": "A bunch of horrible people within circles that enable and reward their horrible behavior",
                    "score": 78,
                    "replies": [
                        {
                            "author": "LSATDan",
                            "body": "Wait, I thought that was reality TV.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "FunGuy8618",
                                    "body": "Busta Rhymes needs to come back with that Calm Down energy and smack niggas and wrestle with elephants, I miss his benevolence. Maybe get the Abstract back in the kitchen, giving em what they want.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Branjean",
                    "body": "You can't call Ye or Carti hiphop bruh, it's just trolling ass shit",
                    "score": 209,
                    "replies": [
                        {
                            "author": "CoolRisk4022",
                            "body": "Ye used to be hiphop, Carti isn't \"trolling ass shit\" imo",
                            "score": 63,
                            "replies": [
                                {
                                    "author": "pennybones",
                                    "body": "I don't know it was a pretty epic troll to tease an album for 5 years then drop that piece of shit",
                                    "score": 95,
                                    "replies": [
                                        {
                                            "author": "alexgiann2",
                                            "body": "That piece of shit is better than 3 out of the last 4 Kanye albums btw",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Kamishini_No_Yari_",
                                                    "body": "Shit being less shit than other shit is still shit",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "alexgiann2",
                                                            "body": "Many people like it including me 🤷",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "mahtf",
                                                    "body": "Better than Donda, Ye, TLOP?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "djmcnastysack",
                                                            "body": "Pretty sure he means vultures 1 / 2 & Donda and Music is better than all of them if ye woulda kept donda the way it sounded originally music wouldn’t have been better than that",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "alexgiann2",
                                                                    "body": "I meant JIK and vultures 1&2. Tbh for me music is pretty close with donda, both bloated but have some great songs",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "pennybones",
                                                    "body": "Other than a few songs from Donda I wouldn't wipe my ass with Kanyes last three outputs. That doesn't make the new Carti album any better though. The problem with taking 5 years to finish an album is half the songs sound like they were made 5 years ago.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "HythereTM",
                                    "body": "Yeah cus Carti is those last 2 words you had in quotation marks",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "Branjean",
                                    "body": "Yeah Kanye was hiphop until 2010. Almost two decades ago. And Carti is nothing more than a joke bro, sure he got some catchy songs but he is putting zero effort in his music or fans lol, he is clearly taking the piss",
                                    "score": -17,
                                    "replies": [
                                        {
                                            "author": "CoolRisk4022",
                                            "body": "Watch the Throne, KSG, Yeezus, TLOP, ye, and Donda were all banger albums released after 2010. Carti got a good album tho, but I will agree half the songs on MUSIC were not all that great.",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "NeedsMoarOutrage",
                                                    "body": "But at least she's not a fucking Nazi",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Branjean",
                                                    "body": "Bro those albums and songs ar mostly NOT hiphop, and in what world is Donda a banger album bro that shit was garbage ass with 4 decent songs on it. Whole album a big fck you to his mom",
                                                    "score": -18,
                                                    "replies": [
                                                        {
                                                            "author": "CoolRisk4022",
                                                            "body": "Yes they are hiphop, and Donda was not as good as the other ones, but still hiphop.",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "author": "PeterGozinyuh",
                                                                    "body": "Donda was great bro don't let dude gas you up",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Much_Reference_8726",
                                                                    "body": "Donda is goated",
                                                                    "score": -2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Branjean",
                                                                    "body": "Damn then your view of hiphop is piss poor. All good bro, let's agree to disagree",
                                                                    "score": -14,
                                                                    "replies": [
                                                                        {
                                                                            "author": "LiLHaxx0r",
                                                                            "body": "You can't gatekeep what is and isn't hip hop. It's a set definition. You may not like a song or artist but that doesn't mean it isn't that genre...",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Branjean",
                                                                                    "body": "That's exactly my point and they don't fit in that definition lol thanks for proving my point",
                                                                                    "score": -4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "LiLHaxx0r",
                                                                                            "body": "?????????????",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Great_Huckleberry709",
                                                            "body": "Please explain how Watch The Throne is not Hip-hop.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Icy_Selection_2486",
                                                                    "body": "Its kind of a sub genre of hiphop, am guessing that what this dude was refering to?",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "8r3t",
                    "body": "We did it guys! Kendrick restored the culture 😃",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "uptonhere",
                    "body": "I thought Kanye West was asking Iggy Azalea to hook him up with a feature from the group Onyx and wondered how she of all people was rolling with them in 2025",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "ourobourobouros",
                    "body": "It's The Young And The Restless for millennials and gen z\n\n\nIt's literally just drama and gossip. This place has pretty much the same energy as the Real Housewives subs",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Past-Height-4319",
                    "body": "kanye is not hip hop. kanye is shit, spitting shot, trying to be interesting by provocating, mostly about swastikas and pedophilia, so its not even interesting, funny or groundbreaking. its basically shit. and fuck him my favorite artist, he used to be, but now, he is really shit, eating shit, shitman from eyes to toes.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "LocalYote",
                    "body": "The short answer is uncontrolled mental illness.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "MeatyOkraLover",
                    "body": "It’s so fucking pathetic. And the music really isn’t even that good lol",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "getthehelloffmylawn",
                    "body": "you just have no idea... that's all you needed to say",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "haydenfred99",
                    "body": "Hip hop is fine for the most part. Kanye on the other hand is a fucking joke loser.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "-ToxicPositivity-",
                    "body": "if and only if you have been buying/supporting this guys \"art\" in any way then the answer is you. you and other hollow people like you that have shitty taste and like bad art/music from shitty hollow ppl with shitty hollow literally fake ass partners is what hip hop has become.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DelusionalGenius2406",
            "body": "its fucking sad to see peoples kids get dragged into this",
            "score": 274,
            "replies": [
                {
                    "author": "Due_Reading_3778",
                    "body": "Dragged into what exactly? This jagoff will do anything to try and stay relevant. Everyone knows this by now. Any response to this is fuel for him. \n\nBest thing to do is act like he’s invisible and inside of 12 months he will be just that. ",
                    "score": 9,
                    "replies": [
                        {
                            "author": "EssoJ",
                            "body": "“Why won’t everyone ignore him” says the guy commenting on his tweets.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ambitious-Ad8598",
            "body": "let's go iggy and carti is bad y'all just like his music",
            "score": 237,
            "replies": [
                {
                    "author": "traplords8n",
                    "body": "Terrible human being lmao\n\nHonestly I question my own morality just by paying attention to what goes on in the Kanye and carti subs 😭 like bro am I indirectly supporting this type of behavior by consuming the drama involved?",
                    "score": 126,
                    "replies": [
                        {
                            "author": "gumballkami",
                            "body": "This is the classical \"are we the baddies?\" situation lol",
                            "score": 54,
                            "replies": []
                        },
                        {
                            "author": "slugvegas",
                            "body": "Terrible music too tbh. Maybe I’m that guy that can’t keep up with the trends, but I don’t think so bc there are definitely other young talented musicians I like. I just think Cartis music is ass and talentless. He doesn’t produce his own shit, he has no lyrics.. he has a unique vocal style of making noise. This like when Kanye said “my favorite instrument is the human voice”. Carti isn’t even a singer he’s just like uses his falsetto voice as an instrument and makes noise and repeats little phrases on shit other people made for him. Experimental? Sure. But it’s ass bro there are so many talented musicians out there",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "mcy33zy",
                                    "body": "Carti legimately might be the worst artist i've ever listened to, considering the amount of hype he gets.  I threw on the new album the other day and fuckin turned that shit right off after about 45 seconds.  Straight up dog shit music.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Jkru3",
                                            "body": "I’m just going to be honest from my experience as a carti fan, I tend to not like his songs until I listen to them a few times. It’s hard to click with Carti right away if you aren’t used to listening to that kind of Carti. Just wanted to throw that in because if I only listened to the album for 45 seconds I think it would be dogshit too, but it’s possible his music is just not for you at all",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "QuestionNo1290",
                                            "body": "I feel like Die Lit is alright like a like low to mid 6/10 or something. I don't like anything else he made at all though. I feel like he excels in features.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PsychologyRelative57",
                                    "body": "I don't like Carti as well, but I somewhat see the appeal on features. He drops there, does a few fun bars, ad libs, then dips. I think it works well enough\n\nI do not like him in a full album, tho",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Keegan6059",
                                    "body": "I mean you can still give other talented artists credit while still enjoying Carti lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "slugvegas",
                                            "body": "I don’t enjoy Carti bro did the entire point go over your head? I said I don’t like Carti, and it’s not because I don’t like modern music.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Pristine_Accident451",
                                    "body": "You sound like an old man, whether it be rock n roll, rap or any other type of music. Not a very good justification for not liking a musician.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "slugvegas",
                                            "body": "Do you read to comprehend brother? I said specifically there is plenty of other new music and artists that I do like.\nIt’s Carti. Not his age. Not his genre.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Pristine_Accident451",
                                                    "body": "Your whole argument devolves into “it’s just noise”, hence my comment",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "slugvegas",
                                                            "body": "My argument isn’t that it’s just noise at all. My argument is that he’s not bringing production talent, thoughtful lyricism, not playing instruments, not composing etc. Those other genres that you mentioned are filled with really talented musicians. Carti is basically a curator and mediocre vocalist. Basically a boy band with far less vocal talent and a different aesthetic. That’s why I don’t really like him, I don’t think he’s doing anything special.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Jim_489",
                                                                    "body": "Carti as a vocalist is absolutely insane tho you can't not mention that. The difference between him and all the other new age \"rage\" rappers is his versatility in his flows, his voice changes and even his versatility generally. Especially on the new album you can put on 3 tracks and they can have completely different styles, voices etc.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "spiritedweagerness",
                                                                    "body": "If it were so easy, you'd be doing what he does and making millions of dollars.",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "slugvegas",
                                                                            "body": "I didn’t say he wasn’t talented at marketing. Or his aesthetic resonates with his demographic. And I don’t have a label to back me with features and distribution. I’m not cool enough lol",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "spiritedweagerness",
                                                                                    "body": "Attributing his musical feats to marketing is another level of hating. It's okay if his music doesn't meet your tastes. You seem to have rigid and traditional requirements for what music should be. And that's fine. He's working with some of the biggest artists in the world. Clearly, some people get his vision and talent for music.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "slugvegas",
                                                                                            "body": "It’s okay if you’re a Stan brother. I have very open tastes. I like just about every genre out there. I even think people like Trippie Redd and Lil Uzi do it better. I think Carti is good for ad libs and some of his features are ok, he’s just not oozing with talent. There’s no depth, there’s no message, he doesn’t make the actual music. What does he do different than Justin Bieber? He sings on tracks with EDM influence that some more talented producer made for him, and doesn’t have nearly as good a voice as people like JB. He’s pop for young dudes 18-25",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "wtclim",
                                                                            "body": "That's a complete non point.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "spiritedweagerness",
                                                                                    "body": "Keep coping. He's well accomplished, making music for people who appreciate it.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "wtclim",
                                                                                            "body": "Nobody said he isn't. It's just irrelevant to the point being discussed.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "spiritedweagerness",
                                                                                                    "body": "It's not irrelevant. If he's talentless and trash, why isn't the average person doing as good as him?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "wtclim",
                                                                                                            "body": "For the reason that was brought up many messages ago... his image sells. You don't have to be musically talented to be successful in the music industry. To argue you do is a non point as I said, because it's easily disproven.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "traplords8n",
                                    "body": "Idk, music wise, Carti had a certain energy to him before he got big, but I hated WLR, I do not at all understand why anyone would think it's anything but absolute ass cakes. It was so bad I don't even wanna check out his new album, even though my favorite artist is featured on a few songs\n\nBut there is a reason he got famous. His music was never that complex, but he made it sound good. FETTI by him and Maxo Kream is one of the best examples I have of that.\n\nBut I can't help but agree with you to a large extent. WLR was terrible and I can't mark it up to not having a taste for it. I would rather listen to cliche artists over people that genuinely have a bad sound",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Unusual-Item3",
                            "body": "Yes, you are directly supporting this drama by paying attention to it. \n\nIf you haven’t noticed this sub is one of the worst, check out the other ones, this one is unhinged with “trolls” saying terrible things lmao",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "chuyito200531",
                            "body": "Idk if he starts talking about the sub I might have to leave it 😭",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BrianHeidiksPuppy",
                            "body": "Bruh of all the rappers to hate for their antics Kanye is low on the list of actually bad people. Sure he says the most wild shit on twitter. Where are the charges tho? He ain’t caught up in a RICO murder for hire like Mr Holier than Thou- use Yeezy shirt as my doormat- Durk. He didn’t stab a man for leaking his album like Jay Z. He didn’t assault someone like Eminem. He ain’t need a trump pardon like Kodak and Asap. \n\nYeah he’s a shitty person, but on a rappers scale, he’s not.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "LeaningBuddha",
                                    "body": "HES A NAZI. What the fuck do you mean he’s low of the list of “actually bad people”????",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BrianHeidiksPuppy",
                                            "body": "I mean he posts shit on Twitter. The rap community has actual murderers. Tweeting is not worse than murder. Are you 12?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "traplords8n",
                                    "body": "I agree to an extent, but given the current political climate, there's a huge argument to make that he is doing some lasting damage to society as a whole.\n\nI don't think he's doing it intentionally, but it's happening and not something i would personally like to sweep under the rug.\n\nAlso the way he treated Bianca was definitely raising some huge red flags. Yesterday I heard a rumor Kim is building a case to take Kanye's custody away from him, and I think that's legitimately a good idea, for the childrens sake.\n\nThe way I see it, he's more mentally unwell rather than a bad person. He might still be a bad person, but his mental instability is contributing.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "BrianHeidiksPuppy",
                                            "body": "Bruh half this country called Trump Hitler, and the other half said fuck it let’s vote for Hitler then. What damage do you think Kanye west is doing to this country? His influence on Twitter? Inherently less people follow a music artists twitter than listen to that artists music. That’s just a given. In his music he promotes god and Christian values. He ain’t perfect in that pursuit but in his catalogue he has done it more than not, and when he fails he just being horny. His contemporaries promote drug dealing and murder. Who is doing more lasting damage to society as a whole?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ZaynKeller",
                                                    "body": "Lmfaoo Kanye idolizes Hitler and you still have people going “he’s just a good christian man!” Cult of personality is weird.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "BrianHeidiksPuppy",
                                                            "body": "That’s not what I said. Nice straw man tho. What I said was on the list of shitty humans who are rappers, Kanye is pretty damn low on that list considering his lack of actual crimes. To which was responded he is damaging society with his rhetoric, which his music does not do, especially compared to his contemporaries.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Dark_Shadow248",
                                                                    "body": "At this point I’m not so certain that is true. He’s very close with Diddy and seems to be protecting him for some reason maybe he has some involvement during those parties. The real truth will come out soon and we will see 🤷‍♂️ but I see your point that he’s never like murdered anybody",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BrianHeidiksPuppy",
                                                                            "body": "Of course, if things come out down the line that he is like assaulting people at diddy parties or whatever that would change the calculus of like how bad of a person he is. But i would still argue that would be the main driver rather than the tweets. Like sure he is shitty for the tweets, it’s just like in the business of rappers- tweeting is hardly cracking the top of any list of shitty human beings.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "ZaynKeller",
                                                                    "body": "He IS damaging society with his anti-Semitic rhetoric. He’s also damaging my ear drums with the shit music he’s released in the past 5 years.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "judithmrine",
                    "body": "Music tastes are subjective!",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Branjean",
            "body": "YOOOOO I LOVE THE RESPONSES IN THIS THREAD, really shows y'all Ye and Carti stans just as childish as they are. Bunch of pathetic losers on here clowning someone for trying to guard her child from a grown ass 50 year old pubescent nazi loser. Y'all wack asf",
            "score": 327,
            "replies": [
                {
                    "author": "CoolRisk4022",
                    "body": "Exactly",
                    "score": 59,
                    "replies": []
                },
                {
                    "author": "Queasy_Passenger3322",
                    "body": "Well I understand her point but its like she purposely misunderstood kanyes point, he does not actually want anything to do with onyx…",
                    "score": -53,
                    "replies": [
                        {
                            "author": "Branjean",
                            "body": "No it seems you misunderstood her point. He is still making a scene and adding a two year old to his mental downfall publicly on the internet. Why defend something so pathetic?",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "lookingforgasps",
                            "body": "The point is not to bring kids into this shit. How did she misunderstand that?",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "OkExtension3775",
                                    "body": "Carti brought ye’s kids into it",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Queasy_Passenger3322",
                                    "body": "She is a celebrity, people talk about them all dag everyday there is nothing you can do about it… i see people mention Onyx everyday on tiktok. How is this bringing her any less “peace”…? Lol",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "JustDeetjies",
                                            "body": "I mean. The child is two and just a child. The child is not a celebrity. \n\nSo maybe the fifty year old man can simply not mention him? \n\nWhere is the disconnect buddy?",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "EssoJ",
                                                    "body": "Or also, mentioning a 2 year old child that is born into a family of 2 celebrities is completely irrelevant to his future well-being.\n\nYe didnt bring him up out of nowhere. It’s a direct response to his friend who he feels betrayed by mentioning his daughter. \n\nIm gonna get downvoted because “think of the children! 😱” and “Ye Nazi bad 😱” but y’all really have zero critical thinking abilities.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OkExtension3775",
                    "body": "Kanye is making a point using him doing the same thing carti did to get back at him",
                    "score": -58,
                    "replies": [
                        {
                            "author": "olaf525",
                            "body": "I do wonder how some of you get dressed in the morning. Brain rot beyond recoverable.",
                            "score": 28,
                            "replies": []
                        },
                        {
                            "author": "Branjean",
                            "body": "Bro running mental gymnatiscs in his head just to make excuses for a literal neo nazi, pathetic bro lol",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "OkExtension3775",
                                    "body": "He’s not a nazi, while he has supported them he’s also made tweets saying he wasn’t one",
                                    "score": -26,
                                    "replies": [
                                        {
                                            "author": "Branjean",
                                            "body": "Yeah i believe kanye over you bro. Dude a nazi, he said so and he shows so by wearing nazi chains and shirts.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "OkExtension3775",
                                                    "body": "Kanye has made tweets saying he wasn’t a nazi anymore",
                                                    "score": -23,
                                                    "replies": [
                                                        {
                                                            "author": "Branjean",
                                                            "body": "Bro he is wearing a nazi chain as we speak, shut up what are we even talking about",
                                                            "score": 22,
                                                            "replies": [
                                                                {
                                                                    "author": "OkExtension3775",
                                                                    "body": "Ok but he has said he’s not a Nazi why does that matter? Why r u making assumptions based on his actions instead of listening to his words that actually come directly from him?",
                                                                    "score": -7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "onewithnonumbers",
                                                                            "body": "You’re joking right? Like this has gotta be rage bait, you can’t just say that the only way to know if someone is a nazi is if they admit to it",
                                                                            "score": 14,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "OkExtension3775",
                                                                                    "body": "It is tho because someone could just be using Nazi imagery for clout and not actually agree with it.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "onewithnonumbers",
                                                                                            "body": "I’m gonna try to be as respectful as possible in saying this, that sort of view is super dangerous and very uneducated. I think there’s no real point to distinguishing between “real” nazis and people using the nazi imagery for clout, because someone willing to use nazi imagery for clout is still basically a nazi. People who genuinely do not agree with nazi shit and are disgusted by it would NEVER use it for clout or any purpose because the understand the harm that those symbols do. Anyone willing to wear a shirt with a swastika on it is a nazi in my book, I don’t give a fuck what they have to say about it because they could literally just lie and say “oh I’m not a nazi”, and according to your view I’d just have to accept that",
                                                                                            "score": 7,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "BestBettor",
                                                                                            "body": "“It is tho because someone could just be using Nazi imagery for clout and not actually agree with it.”\n\nBro are you actually serious? How far are you willing to go with defending this nonsense?",
                                                                                            "score": 4,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "OkExtension3775",
                                                                                                    "body": "Idk man I’m bored asl and enjoy arguing",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "mothernaychore",
                                                                                                            "body": "well enjoy being fucking stupid and never providing anything valuable to anyone unfortunate enough to find themselves in a conversation with your dumb ass. you and kanye both oughta do what your nazi supreme leader did and shut the fuck up permanently. dumb ass mf.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "OkExtension3775",
                                                                                                                    "body": "I’m not a nazi😭 im neutral in this. I play both sides",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Drewismyname",
                                                                                                                            "body": "Nah you got kanye’s deep mad down your throat",
                                                                                                                            "score": 3,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "OkExtension3775",
                                                                                                                                    "body": "Yummy🤤",
                                                                                                                                    "score": -1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "author": "solanamell",
                                                                                                                            "body": "You must be 12, or have failed so spectacularly in adulthood you spend all day acting like one. Either way, I hope you get your life back on track somehow.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "OkExtension3775",
                                                                                                                                    "body": "Neither and my life is fine, u back here with that assuming shit.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "Suinlu",
                                                                                                            "body": "Then you should do something else since you really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really suck at arguing.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "OkExtension3775",
                                                                                                                    "body": " Nah I’d win",
                                                                                                                    "score": 0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "yeahitisaword",
                                                                            "body": "Have you never heard the phrase \"actions speak louder than words\"?",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "OkExtension3775",
                                                                                    "body": "That phrase is bs and only true in certain scenarios because there is always a reason for a persons actions",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "yeahitisaword",
                                                                                            "body": "If you go around fucking chickens, you are going to be called a chicken fucker-- doesn't matter what the reason is. You seem to lack very basic critical thinking skills; I genuinely wish you the best and all the luck in the world because life may end up being hard for you if this isn't some elaborate troll. Have a good one.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "CJ_Swisher",
                                                                            "body": "Kanye could punch this fucking idiot in the face, and he would say \"but Kanye said he's not punching me in the face.\" You can't even argue with this level of stupid.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "OkExtension3775",
                                                                                    "body": "Kanye is the goat and id thank him for the punch. I would feel happy about myself because my goat finally acknowledged me and my existence",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "ro_hu",
                                                                            "body": "Are you retarded?",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "OkExtension3775",
                                                                                    "body": "Maybe🤔 idk tho I haven’t been diagnosed yet",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Branjean",
                                                                            "body": "Because there is a different in action and words brody. His actions show hatred and discrimination and clearly hurt people. Saying \"oops my bad\" doesn't make it okay, especially if you continue the hatred. \n\n  \nRiddle me this, if Hitler would've held a speech and said 'guys guys i am not a nazi lol is joke' and continues his hateful shenanigans is he then no longer a nazi or would you still view him as one?\n\nLet me make it simple; if i beat up a kid from turkey just because he's skin is different and i say \"guys no worries i am not a rasisct\" then would you judge my actions as normal and okay?   \n  \nCommon bro get his dick out of your mouth and grow up",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "OkExtension3775",
                                                                                    "body": "That’s different because Kanye also made post on twitter apologizing to whoever he “hurt”",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Branjean",
                                                                                            "body": "Apparently his dick is also in your ears. Let's agree to disagree lol, have a good one homie",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "1nc0gn3eato",
            "body": "It be a long time before you ever see me again",
            "score": 35,
            "replies": [
                {
                    "author": "RedditgoldEnthusiast",
                    "body": "this shit is loaded",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "GenoveveSimmons15",
            "body": "This is such a mature response. She’s better than me because if I were her, I would’ve drug him to Hell & back.",
            "score": 137,
            "replies": [
                {
                    "author": "Youwontbreakmysoul",
                    "body": "It’s clear she’s keeping it classy for her son (on the off chance he sees this one day). Massive respect to her, because I couldn’t. ",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "S1gurdsson",
                    "body": "he doesn’t need to be any more drugged💀",
                    "score": 14,
                    "replies": [
                        {
                            "author": "GenoveveSimmons15",
                            "body": "There’s no way he’s not just on nitrous. Dude’s out here giving crackhead vibes.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EssoJ",
                    "body": "No the fuck it isn’t a mature response. It’s an attention-seeking and virtue-signaling response. You misconstruing that for maturity is ALARMING. ANY response from her just keeps her child more involved rather than letting it go because Ye will tweet 100 more controversial things in the next 48 hours and nobody will give a fuck about what he said about Onyx (which he barely even said anything about to begin with).",
                    "score": -6,
                    "replies": [
                        {
                            "author": "KendrickBlack502",
                            "body": "You are not a smart person.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "EssoJ",
                                    "body": "Zero substance comment, all insults. all of you retards speak the same way. Shut the fuck up",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "KendrickBlack502",
                                            "body": "nuanced comments deserve nuanced responses. you said nothing of substance so I returned the favor.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "EssoJ",
                                                    "body": "I said what I thought and explained why. You said nothing. Keep being a bitch.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Individual_Hold_4661",
            "body": "She's responding reasonably even though Kanye has been being anything but reasonable.",
            "score": 46,
            "replies": [
                {
                    "author": "Dreams-Visions",
                    "body": "Ye has never been someone you can get louder than in a conversation. He will just become more ignorant and go places you aren’t willing to follow. It’s a no-win, that path. Only option is to try to speak with kindness and rationality, even when every fiber is screaming, “fuck this sorry nigga and his momma too!”",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "AdLost576",
            "body": "People just need to start replying to him saying \n\n“Bro, just take your meds” and nothing else",
            "score": 52,
            "replies": []
        },
        {
            "author": "TouchingFlaxLife",
            "body": "Kanye is such a loser man",
            "score": 52,
            "replies": []
        },
        {
            "author": "Inevitable-Baker-462",
            "body": "This fall off needs to be studied in centuries to come.",
            "score": 35,
            "replies": [
                {
                    "author": "Pkmn_Gold",
                    "body": "Bro is not even gonna be known in centuries",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "its_LOL",
                    "body": "Fall off so insane J Cole is making an album named after it",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PsychologyRelative57",
            "body": "I find it crazy that this is an almost 50 year old dad",
            "score": 13,
            "replies": []
        },
        {
            "author": "ElMatasiete7",
            "body": "She's being a good mom, Kanye is being an absolute dumbass as usual.",
            "score": 10,
            "replies": []
        },
        {
            "author": "badabing121212",
            "body": "she handled that perfectly tho fr",
            "score": 9,
            "replies": []
        },
        {
            "author": "disperoticostomp",
            "body": "Shit goes hard when the most adult and reasonable person speaking is Iggy Azalea..",
            "score": 11,
            "replies": []
        },
        {
            "author": "duoersuper",
            "body": "Carti is fucking garbage ever since he left awful records",
            "score": 7,
            "replies": [
                {
                    "author": "Positive-Bluebird567",
                    "body": "Nah he made Ohh in 2015",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Space_Banane",
            "body": "What is ye even about bruh",
            "score": 11,
            "replies": []
        },
        {
            "author": "Keegan6059",
            "body": "All ye got left now is ty and the hooligans",
            "score": 4,
            "replies": []
        },
        {
            "author": "Party_07",
            "body": "If in 2018 someone told me that Iggy Azalea would be a better parent than Kanye West I would have legit died laughing \n\nFast forward 7 years and here we are, wtf is this timeline that we're living right now",
            "score": 7,
            "replies": [
                {
                    "author": "someone_HO_HO",
                    "body": "2018 was 7yrs ago bro.😭",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Party_07",
                            "body": "I originally put 2016 by mistake and then forgor to correct the number of years, my bad bro",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "someone_HO_HO",
                                    "body": "Its all good my g. But shit dawg 7yrs is still a lot.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Party_07",
                                            "body": "Yeah, I feel you, but it doesn't feel like enough for such a 180\n\nLike, 7 yrs ago Kanye was still the GOAT and everybody was on his dick, and Iggy was the opposite, after all that 2018 Cypher business, trash music and industry plant accusations \n\nBut now Ye is being clowned by everyone, and the man deserves it ngl, and now Iggy is receiving a fair amount of support, which she kinda deserves, I mean, her 30 yr old baby daddy has more public pictures while wearing a thong than he has hours spent with their son, so, good for her\n\nIt's just crazy how in not even a decade Kanye went from the GOAT to a POS and Iggy went from a hated artist to someone which the community looks towards with empathy now\n\nIt's like I said, a weird ass timeline",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "someone_HO_HO",
                                                    "body": "Tbh i wasnt a hiphop head back then but im what the scene was. \n\nAnd youre 100% right with ye shit bro. Everyone respected him and enjoyed his work, wanted to collab too. \n\nReally wild with iggy too tho. \n\nAs of late ive just realized that yk all these artists and shit, theyre just ppl. And honestly for me personally its no longer worth it to idealize them anymore. \n\nI used to be a diehard kanye fan even after the pier morgan stuff when his twitter was taken and he was just yk silent. I was cool with that kanye. \n\nAnd now its just a clownshow and im like dang this is the guy i used to fw and actually idealise at some point in my life as a kid.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CombinationBetter443",
                    "body": "I mean, in 2018 he was a fucking disaster. what would make you think she'd be a bad parent? her music sucks but she prolly has and had more time to be a good parent, as opposed to mr multi hyphenate dumbfuck over here",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Icy_Selection_2486",
            "body": "Why he want onyx and north so badly involved in music? Not only he dragged her daughter into feature with diddy but now he wants carti's son too, the fuck Ye?",
            "score": 7,
            "replies": [
                {
                    "author": "Representative_Bat81",
                    "body": "Music is a toxic industry, which is why I am going to force my kids into it.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Icy_Selection_2486",
                            "body": "Engagment bait or smth?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Representative_Bat81",
                                    "body": "What? Half of his music is complaining about the music industry. Do you not understand?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Icy_Selection_2486",
                                            "body": "No i mean putting his own kid into the album full of sex is weird and now this drama he have with kim makes it even worse\n\nI have no clue if he does it for the bait or is he seriously thinks north should have a song with a registered sex offender",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BusyDragonfruit8665",
            "body": "She is being way to nice. Who would want to be associated with his crazy ass.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fabulous-Let-1164",
            "body": "Ye is getting out of hand now..",
            "score": 3,
            "replies": []
        },
        {
            "author": "Juicyrunner87",
            "body": "Guy uses boomer font.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LmaoImBoredHelp",
            "body": "Never thought I'd be defending Iggy but she's just tryna be a mom and keep her kid(s?) out of drama and these lame grown ass men keep bringing her and her kin up. They're retarded.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FittedsRDope",
            "body": "Get Kanye off all platforms, get rid of this fool!",
            "score": 2,
            "replies": []
        },
        {
            "author": "flyonthewallbro",
            "body": "I’m sorry if Carti really not in Onyx life then I don’t want to listen to that overhyped ass album that little boy do not deserve that",
            "score": 2,
            "replies": []
        },
        {
            "author": "someone_HO_HO",
            "body": "Carti has other children too? With whom? Didnt know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exact_Conflict8318",
            "body": "Omg iggy just lowkey dissed his other baby mom 👀",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lordbogaaa",
            "body": "Kanye Making Iggy have to be reasonable.  Not on my bingo card",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheRebelNM",
            "body": "I don’t understand. He asked for her kid to be in a song and people are saying that crossed the line?\n\nWhat are we talking about? Id say its weird, for sure, but acting like this is despicable behavior isn’t adding up. What am I missing?",
            "score": 1,
            "replies": [
                {
                    "author": "epoc657",
                    "body": "Would you want your small child associated with a man praising Diddy and Hitler?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Delicious_Income_712",
                    "body": "Would you want your child to be associated with a nazi-pornaddict-abuser-rapeapologist?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Traditional_Rate7302",
            "body": "This situation made me realize theres a whole other perspective to being a celebrity’s kid. Like its not always great with the money and everything because, especially now, you get plastered all over the internet from the moment youre born. You have no control over your own private life and are subject to the public’s ridicule 24/7",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arfuuur",
            "body": "got his ass",
            "score": 1,
            "replies": []
        },
        {
            "author": "megamuppetkiller",
            "body": "No way she wrote that herself",
            "score": 1,
            "replies": [
                {
                    "author": "epoc657",
                    "body": "A smart person lets their PR team do the talking, and then you have whatever Kanye does",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Campbellmike-7373",
            "body": "Keep speaking your mind Kanye!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Campbellmike-7373",
            "body": "Keep speaking your mind Kanye!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nostradamus101",
            "body": "lmao she's right, but isn't she the one on only fans posting content that her son can discover and endure in perpetuity from strangers online? Digital legacy? Just food for thought",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nostradamus101",
            "body": "lmao she's right, but isn't she the one on only fans posting content that her son can discover and endure in perpetuity from strangers online? Digital legacy? Just food for thought",
            "score": 1,
            "replies": []
        },
        {
            "author": "Campbellmike-7373",
            "body": "Keep speaking your mind Kanye!",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrinciplePlastic1414",
            "body": "If anyone is going to hell it’s him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accomplished_Rich_98",
            "body": "Ye is a fatherless clown that never knew what a family looks like",
            "score": 1,
            "replies": []
        },
        {
            "author": "ogjeweldawg",
            "body": "It's so sad seeing rappers attack eachothers children",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vogt156",
            "body": "In perpetuity. Going use that a lot now",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProfessionalSnow943",
            "body": "I once again confused iggy azalea and azealia banks and was like “oh god here we go”",
            "score": 1,
            "replies": []
        },
        {
            "author": "squidmilkerz",
            "body": "Ye is no stranger lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweaty-Razzmatazz948",
            "body": "Kanye be bored and probably laughing every time he tweets. 🙄 Like this… He annoying!\n\n![gif](giphy|GQpgxKurbGEaeEKMAi|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuestionNo1290",
            "body": "Kanye is such a clown",
            "score": 1,
            "replies": []
        },
        {
            "author": "KenHeisenberg",
            "body": "This nigga needs to get his ass beat",
            "score": 1,
            "replies": []
        },
        {
            "author": "Extreme_Employment35",
            "body": "And I thought you were talking about Iggy Pop...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Physical_Trouble9504",
            "body": "As a fan of Carti's and Ye's music I feel like Ye should be taking his meds and completely get off the internet and Carti is just a horrible human being. It's sad that kids like Onyx and North are being dragged into this",
            "score": 1,
            "replies": []
        },
        {
            "author": "BothChannel4744",
            "body": "Isn’t dude like 4? We gon hear goo goo gaga on the track.\nYe at least didn’t say it too disrespectfully to be fair.\nIggy response very good tho, albeit if the kid ends up being a Ye fan one day he gon hate his mom for not getting him on a song 😭 I’d be tweaking if my mom passed up that opportunity",
            "score": 1,
            "replies": [
                {
                    "author": "CoolRisk4022",
                    "body": "Old Kanye maybe, but nobody want anything to do with current Nazi Kanye",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Embarrassed-Dig-0",
            "body": "Why do people keep responding to him with maturity and grace he doesn’t gaf and just uses it as more troll fuel ",
            "score": 1,
            "replies": []
        },
        {
            "author": "smackurself43",
            "body": "cartis album was actual dogshit",
            "score": 1,
            "replies": []
        },
        {
            "author": "thebig3434",
            "body": "iggy.. stfu about \"digital legacy\" you a mom with an onlyfans account 💀 hypocritical af 😭🫱",
            "score": -18,
            "replies": []
        },
        {
            "author": "Zestyclose_Visit4834",
            "body": "I respect her for protecting her kid but I don't really get the point of mentioning his other kids.. like is she suggesting that they should get harassed also? Leave the kids out of it entirely, don't draw any attention to them to get attention off your own kid.",
            "score": -7,
            "replies": [
                {
                    "author": "Ras_Al_Yankovic",
                    "body": "she’s just trying to point out the fact that onyx specifically is being used for clout/attention and not because ye actually cares about his “nephew”. he just knows that onyx is the kid most people know about and associate with carti",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Zestyclose_Visit4834",
                            "body": "I think she could definitely make that point without drawing attention to his other kids and potentially putting them in the firing line, but fair enough",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "QVSUNIVERSE",
            "body": "Everyone vs Ye as it should be, he with god so most will never agree with him. It’s all going as it should be.",
            "score": -8,
            "replies": [
                {
                    "author": "onewithnonumbers",
                    "body": "He’s with god so he’s… praising hitler and selling nazi merch ✅ got it",
                    "score": 13,
                    "replies": [
                        {
                            "author": "QVSUNIVERSE",
                            "body": "Revelation 2:9\nKing James Version\n9 I know thy works, and tribulation, and poverty, (but thou art rich) and I know the blasphemy of them which say they are Jews, and are not, but are the synagogue of Satan.\n\n\nThis is what JESUS says… they’re not the real Jews the real ones are in POVERTY (poor)",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "onewithnonumbers",
                                    "body": "So now explain that verse to me in your own words, then explain to me why many scholars disagree with the interpretation of the verse that’s used to justify antisemitism?\n\n“The believers at Smyrna were under attack not only from Rome but also from militant apostate Jews and from the Devil himself. Jesus called this particular group “a synagogue of Satan.” This reference is very specific; Jesus is not referring to all Jews, or all synagogues, but only to a specific faction which apparently plagued the churches of both Smyrna and Philadelphia”",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "QVSUNIVERSE",
                                            "body": "LUKE 21:24 KJV\n24 And they shall fall by the edge of the sword, and shall be led away captive into all nations: and Jerusalem shall be trodden down of the Gentiles, until the times of the Gentiles be fulfilled.\n\nBiblical prophesy from Christ that the gentiles will over run Jerusalem until their time has met an end. I will just response with the words of Christ himself since you’re a scholar that relies on statements amongst men instead of proving other wrong through your understanding by reading and comprehending.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "fakadee92",
                                                    "body": "Holy shit an IUIC cult member in the wild! Shalom and Praises to the most High, dummy 😂😂",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "QVSUNIVERSE",
                                                            "body": "🤣🤣🤣🤣",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "QVSUNIVERSE",
                                                            "body": "Acts 24:14\nNew Living Translation\n14 “But I admit that I follow the Way, which they call a cult. I worship the God of our ancestors, and I firmly believe the Jewish law and everything written in the prophets.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "raise_the_sails",
                                                                    "body": "No one cares about your stupid bible verses. It’s not even a good book.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "QVSUNIVERSE",
                                                                            "body": "You’re right some books in there aren’t the best huh? That’s why it’s a library with many books and authors in it…",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "onewithnonumbers",
                                                    "body": "You realize part of comprehending is acknowledging and understanding others’ perspectives on the subject matter right?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BuggityBooger",
            "body": "Isn’t she thinking about digital legacy when she’s posting her nasty ass doot all over the internet for her son to see?",
            "score": -13,
            "replies": []
        },
        {
            "author": "Godswife96",
            "body": "She right but this not even her place it’s between the men",
            "score": -13,
            "replies": [
                {
                    "author": "mondayortampa",
                    "body": "lol what?? That’s her son! Gtfo lmao",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Old-Turnip-8919",
            "body": "why she respondin the tweets ❓ lol she wantin some clout",
            "score": -86,
            "replies": [
                {
                    "author": "FlemmyFish1234",
                    "body": "It literally involves her child bruh . She can reply to it if she wants . U sound brain dead bruh",
                    "score": 76,
                    "replies": [
                        {
                            "author": "Old-Turnip-8919",
                            "body": "u brain dead brudda lol😹 literally she respondin like kanye offendin her child or sum like that, instead of js ignoring lol, they would be in peace if they js ignored it lol, llike people do w kanye tweets, instead of js ignoring people keep givin him attention makin he keep goin",
                            "score": -58,
                            "replies": [
                                {
                                    "author": "FlemmyFish1234",
                                    "body": "Bruh stop ur retarted",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "Old-Turnip-8919",
                                            "body": "dawg whatever🤣 ur arguments are offenses nd downvoting? okay lol",
                                            "score": -41,
                                            "replies": [
                                                {
                                                    "author": "FlemmyFish1234",
                                                    "body": "I’m not the only one downvoting u 😂😂😂clearly u actual idiot",
                                                    "score": 24,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Noscope64",
                                                    "body": "I doomscrolled a lot today and you got to be the dumbest mf I've seen",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Aromatic_Assist_3825",
                                                    "body": "We're down voting you because you're a dumbass. We don't know the person you're arguing with, only that you're a dumbass.",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "jp7923902",
                                                    "body": "Bro....wtf if wrong with you",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Rough_Operator",
                                    "body": "You type like a 12 year old",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "timotheesmith",
                                    "body": "Kanye is a mentally ill dude who's excited to have his daughter featured in a song with a child rapist (diddy), I wouldn't want Kanye around my kids either",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "philouza_stein",
                                    "body": "Not only that but she's saying ye's tweets can be used against her son's digital legacy one day. Nevermind her tits and vag all over the internet - future bullies will pick on him bc Kanye said he wanted him on a track 🤡",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "jp7923902",
                                            "body": "I wouldn't want my kid vocals on some fucking racist ass album......fuck that",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "philouza_stein",
                                                    "body": "Nor would I. But she didn't say that. Her logic is fucked if \"digital legacy\" is her reason. Nothing destroys a child's digital legacy like naked mom pics in the hands of everyone.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "jp7923902",
                                                            "body": "It's common sence bro.... what your obviously lacking.  Everyone is going to bring that up when he's older... there going to be like \"why tf did you contribute to a racist,antisemitic psycho\"",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "philouza_stein",
                                                                    "body": "No they're not. They're gonna spam his inbox with his mom's vag.\n\nI can tell you weren't one of the bullies growing up but instead the bullied. You don't understand the psyche.",
                                                                    "score": -5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "isaidwhatisaidok",
                                            "body": "The space where your brain should be is just a gust of wind, isn’t it?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "philouza_stein",
                                                    "body": "Sick internet burn bro",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ambitious-Ad8598",
                    "body": "she did right shut up 🤡",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Square-Pie6282",
                    "body": "stop fucking dickriding ye. actual retards istg",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Old-Turnip-8919",
                            "body": "dickriding ye looollllllllll, where did i defend ye lol? my comment was about Iggy, read all them again nd tell me when did i defend anything kanye did, retarded 🤣",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Square-Pie6282",
                                    "body": "yall got no cognitive ability why would iggy not react to this old nazi ass idiot name dropping her son on a crashout tweet. especially since its pretty clear by now that carti dont give a fuck about his child and this only falls on iggy. stop being retarded. iggy does not need kanye's \"clout\". what \"clout\" are we talking about here? what \"clout\" does ye have? this is about her child and if she wants to react she will. i dont understand why are yall still defending this nigga or trying to find excuses for him when people call him out. actual degenerates",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MondeyMondey",
                    "body": "Cos she doesn’t like having her kid’s name bought up in the middle of Ye’s extended Nazi crash out. Can’t say I wouldn’t feel the same.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Vogt156",
                    "body": "Youre right its just that noone wants to admit that. What these people want to do is hate Ye because thats the bandwagon. The fact that hiphop celebrities are all clowns kills the fun.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Any_Entertainment146",
                    "body": "I completely agree. I wouldn’t have even responded to this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "myheart2008",
                    "body": "🫡",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "myheart2008",
            "body": "fuck iggy",
            "score": -81,
            "replies": [
                {
                    "author": "FlemmyFish1234",
                    "body": "She literally responded politely . Fuck is wrong w u",
                    "score": 60,
                    "replies": [
                        {
                            "author": "myheart2008",
                            "body": "fuck iggy azalea, always.",
                            "score": -72,
                            "replies": [
                                {
                                    "author": "FlemmyFish1234",
                                    "body": "Ok fuck Kanye and his recent half baked rushed albums , always.",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "author": "myheart2008",
                                            "body": "his recent stuff is shit.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "Branjean",
                                                    "body": "You are fucking pathetic loooooool hahahahaa",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "myheart2008",
                                                            "body": "ty ❤️",
                                                            "score": -15,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DelusionalGenius2406",
                                    "body": "you and i both know that if she got naked infront of you youd hit that hard",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "PhysicalGSG",
                                    "body": "Why?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ambitious-Ad8598",
                    "body": "shut up 🤡 and go outside... touch some grass",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "noexcessbaggage",
                    "body": "2008… you got school son get off reddit 😭",
                    "score": 6,
                    "replies": [
                        {
                            "author": "MehrunesDago",
                            "body": "Do you not recognize the scene girl style from the early 2000s in the pfp? Are you a teenager yourself? They're trolling with a gag profile that's like a 2008 emo scene girl or some shit.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "noexcessbaggage",
                                    "body": "1. No, I don’t usually pay attention to people’s pfps \n2. Yes \n3. We’re on r/kanye mate everyone’s got to be trolling at this point",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "myheart2008",
                            "body": "im homeschooled",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "noexcessbaggage",
                                    "body": "That explains a lot",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "myheart2008",
                                            "body": "and i also don't have a father",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "noexcessbaggage",
                                                    "body": "It’s probably your fault tbf",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "myheart2008",
                                                            "body": "yea, i broke his rib and now he hates me",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jp7923902",
                    "body": "Shut the fuck up and just take this down-vote train to hell.... you fucking bozo",
                    "score": 2,
                    "replies": [
                        {
                            "author": "myheart2008",
                            "body": "see u there buddy",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MehrunesDago",
            "body": "I fucked a chick who looks just like Iggy Azalea, also this is bad and stuff",
            "score": -14,
            "replies": []
        }
    ]
}