{
    "title": "Hes beefing with Carti now😭",
    "author": "CoolRisk4022",
    "subreddit": "Kanye",
    "rank": 16,
    "score": 76,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 34,
    "url": "https://i.redd.it/nhcxjjvu4gpe1.jpeg",
    "id": "1je4dk7",
    "selftext": "",
    "comments": [
        {
            "author": "bynobodyspecial",
            "body": "Simultaneously, he’s fighting to have her feature on a Diddy song.",
            "score": 34,
            "replies": []
        },
        {
            "author": "Icy_Selection_2486",
            "body": "The fuck is this dudes problem? ~~He litteraly produced half if not half of i am music, hes even credited as the producer for it~~\n\n(Nvm, turns out he only produced like 2 songs for him)\n\nAlso he acts as if he just didnt say antisemitic shit all day long on twitter, openly loving hitler and try to turn people into skinheads\n\nAs much of a terrible person carti, i dont think he would want to be associated with someone like Ye after what hes done and say openly",
            "score": 23,
            "replies": [
                {
                    "author": "Suspicious_Help2689",
                    "body": "I can’t find any source that states that Kanye produced half of the album, whatyoutalkingboutwillis?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Icy_Selection_2486",
                            "body": "Well he produced 2024 right? So am assuming he maybe produced half of the songs from the album too, but i kight be wrong",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Suspicious_Help2689",
                                    "body": "That’s one track my bro, from everything I’m seeing he had part in “backdoors” and that’s the extent of it. 2024 ain’t even on the album foh",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Icy_Selection_2486",
                                            "body": "Still tho, kinda weird of him for getting mad if he didnt even produced a song that went into the album, but am also gonna say that carti is weird for wanting to drag north into the album that litteraly talks about fucking woman and drugs",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Suspicious_Help2689",
                                                    "body": "THAT’S WHY HE IS MAD. In November Carti said Kanye was exec producer, now he has been , ego maniac couldn’t deal with that it seems. \n\nNorth was on stage during the very first vultures listening party, the first time you hear Kanye’s voice at said listening party he is rapping “one in the pink one in the stink”, he’s arguably a far worse ‘influence’",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Icy_Selection_2486",
                                                            "body": "Its kinda weird to me that kim let her go tot hat listening party tho, like why this dude have to drag her everywhere? If he cared for his kids he shouldnt let her into the listening party where he was singing about sex\n\nBeside i hardly doubt kanye would produce more than maybe few songs for carti, you seen what he done with vultures 2 after he lost motovation for it, imagine what the fuck would he done to Music too, that would be even worse that vultures 2 on relase💀",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "thebig3434",
                                                            "body": "everybody deserved to be released i still glaze that song 😔🔥",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Significant_Delay_87",
                    "body": "He only has production credits on backd00r",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Icy_Selection_2486",
                            "body": "I correct it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Youwontbreakmysoul",
                    "body": "Asking what Kanye’s problem is…I mean how long do you got,really? \nAnytime I think he can’t sink lower he (unfortunately) surprises me. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Icy_Selection_2486",
                            "body": "You right idk why am asking what hes problem is if he creates them himself later or now😭😭",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "izzy21G",
            "body": "\"The man has the first\".... which man? 🤣 loonatic take ur meds!!!!!",
            "score": 10,
            "replies": []
        },
        {
            "author": "Rare-Cockroach-4979",
            "body": "Man take your meds, you ain‘t got nothing to say. Nobody wants to be associated with a Nazi. You‘re just embarrassing your kids.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Old-Turnip-8919",
            "body": "carti cant even defend himself lol💀 kanye literally made wlr",
            "score": 15,
            "replies": [
                {
                    "author": "OkExtension3775",
                    "body": "Nah he executive produced it meaning he just helped carti with the tracklist. He didn’t actually work much on the creative aspects of the album",
                    "score": 10,
                    "replies": [
                        {
                            "author": "MovieRough188",
                            "body": "Yeah I think people get this idea that Kanye is making a lot of these beats. He is not really, he’s more so arranging shit.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Significant_Delay_87",
                    "body": "We need to have a meeting discussing what executive producer really means 😭",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "boreduser127",
                    "body": "Dumbass is trying to defend a nazi by talking bout shit he knows nothing about 🤡🤡🤡",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Minute_Cantaloupe_78",
            "body": "Ye and DDG are tied for complaining on twitter about their babymamas",
            "score": 3,
            "replies": []
        },
        {
            "author": "aquaphoria_by_kelela",
            "body": "Yeah he’s about to learn the hard way that the American legal system does not necessarily think “the man has the first and final say over his kids.”",
            "score": 2,
            "replies": []
        },
        {
            "author": "DefinitelyNotWeasel",
            "body": "Haha Kim said no so now Kanye got walk it back 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "sad_boi890",
            "body": "I DONT A FUCK -Ye",
            "score": 1,
            "replies": []
        },
        {
            "author": "myheart2008",
            "body": "i don't support nazi's, but W Yé",
            "score": -28,
            "replies": [
                {
                    "author": "CoolRisk4022",
                    "body": "WTF??? Iggy responded very maturely. Ye hasn't been sane for a while now.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "myheart2008",
                            "body": "carti's finished vro",
                            "score": -21,
                            "replies": []
                        },
                        {
                            "author": "myheart2008",
                            "body": "and Yé's gonna come back, trust me.\n\nBULLY is gonna be 🔥",
                            "score": -22,
                            "replies": [
                                {
                                    "author": "Fit_Veterinarian_833",
                                    "body": "As a longtime Kanye fan it’s just gonna be racism and ai over pretty good beats. The goat is washed",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "qiic",
                                            "body": "u boutta predict bully like u predicted iam 😭✌️",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Fit_Veterinarian_833",
                                                    "body": "Come back to this when it comes out I tell the truth.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Trevor_Lahey330",
                    "body": "you support Ye, you support nazis.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "NoLimitWally",
            "body": "Ye right on this one sorry",
            "score": -20,
            "replies": [
                {
                    "author": "Hi-Road",
                    "body": "Don’t apologize for being wrong ",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}