{
    "title": "Found out that one of my students killed someone",
    "author": "Winter-Industry-2074",
    "subreddit": "Teachers",
    "rank": 12,
    "score": 1305,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 115,
    "url": "https://www.reddit.com/r/Teachers/comments/1jdu429/found_out_that_one_of_my_students_killed_someone/",
    "id": "1jdu429",
    "selftext": "You read the title right.\n\nNever in a million years would I have ever expected to deal with this situation in teaching.\n\nFound out during an after school staff exam training meeting that a student in my freshman world history class killed someone. I teach at a title 1 urban school in a very poor and dangerous neighborhood. Lots of crime and shady people. \n\nAll I know is that the student was involved in some sort of street fight at like 2-3 in the morning, and then for whatever reason he pulled out a gun and shot someone in the head. \n\nNever saw any red flags or warnings in the kid. Definitely not an angel by any stretch of the imagination, as he was actually one of my more disruptive students, but never in a million years would I have thought that he would be capable of killing someone…\n\nI’m blaming this fight culture that has been engrained in the students and parents of urban communities. All the kids talk about is fighting, and the parents support it. All of our disciplinary issues at this school are dealing with some sort of physical or verbal acceleration between students. \n\nWhen are we going to start holding parents accountable for student violence? \n\nWhy haven’t we created healthy coping mechanisms for children in these communities who are dealing with trauma and suppressed anger? I’m talking supports from preschool from grade 12, because these kids need it. \n\nI cannot wait to leave this district and go suburban or rural. ",
    "comments": [
        {
            "author": "acft29",
            "body": "That’s so crazy! I’m at a middle school and there are fights daily! I’ve had many girls say  they’re going to fight. They’re ready for it. I heard that parents have fought on school grounds too. Absolutely insane!",
            "score": 509,
            "replies": [
                {
                    "author": "Brewmentationator",
                    "body": "I quit teaching last year. Our fights were getting out of hand, and fuck all was being done about it. At one point, we had a mom calling the school demanding that we let her 17 year old daughter fight a 14 year old boy. The mom then came to the school to try and break in, so that she could get her daughter out of class and fight the other kid. When that didn't work, the mom waited until after school. She held the boy down in the parking lot so that her daughter could knock the other kid's teeth out.\n\n\nWe had multiple fights where parents came onto campus and beat up kids.",
                    "score": 92,
                    "replies": [
                        {
                            "author": "acft29",
                            "body": "Whoa that’s nuts!!! So scary!! I don’t blame you for quitting. I’ve had fights happen in my classroom this year. It’s been hell. I’m ready to quit too. Trying to get back to elementary or just leave teaching all together! It’s so stressful. I don’t even want to deal with this crap.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Brewmentationator",
                                    "body": "Last year was actually insane. We also had a girl go off campus, and find a group of young men from a local gang. She got them to try to break onto campus to beat up a girl she was beefing with. We had to go into lockdown for that, and it happened right as school was getting out.\n\n\nSuper fun to be locked in a school while 15 men wearing balaclavas surround your front office screaming about killing someone.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "acft29",
                                            "body": "WTH?!!!",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ponyboycurtis1980",
                    "body": "That has been the crazy part of the last 3 years for me.  Middle school boys have always fought and will always fight.  But recently the most dangerous and contagious fights are the girls.  2 girls will get in a fight and within 3 days we will have a dozen more fights all over the same issue, with friends taking sides.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Pure_Literature2028",
                            "body": "Girl fights a brutal!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "justareadermwb",
            "body": "There's SO much to unpack here. It is really difficult - if not impossible - for me to truly understand the situation that many of these kids are living in.\n\nI was, by NO means, a perfect child. I absolutely did things my parents didn't know about and wouldn't have approved of. I was in places I shouldn't have been and made decisions and engaged in behaviors that I shouldn't have ... but it was NOTHING like this.\n\nI don't understand a world in which it's acceptable for a FOURTEEN year old child to be out on the streets at 2am on \"a school night\". I can't understand thinking that engaging in a physical altercation with a stranger is normal or reasonable. I can't believe a parent thinks that their child carrying a gun is a good idea. I can not grasp thinking that shooting someone in the head is a reasonable response to whatever disagreement they had.  \n\nSomewhere, our society took a really wrong turn. \n\nSadly, this is the reality in the lives of way too many urban youth. If they make it to adulthood, their children (many of whom will grow up in an unstable household, likely not with both of their biological patents) will be raised in similar situations, because it has become their norm. \n\nYour student ... a child ... ended another life last night, and also essentially ended his own. He will likely spend a good amount of time in jail, and the options available to him after that have been drastically reduced, with the quality of his life from here on out negatively impacted in a permanent way.  😟",
            "score": 261,
            "replies": [
                {
                    "author": "yallermysons",
                    "body": ">somewhere, our society took a really wrong turn\n\n…generations of violence is starting to express itself as extreme violence. This is all completely predictable. Give these kids’ parents a universal income and some healthcare, make sure the kids are fed and have enriching places to go to outside of school time, legalize abortion and end societal pressure to couple up and pop out babies for clout, and I bet most of the violence will go away. The kids shooting up their schools are largely white and middle class. They are being NEGLECTED and living through taxing, violent times—they’re not deviants.\n\nWe have a collective responsibility as adults in these kids lives, not just their parents. ***It takes a village*** for all of us, including the adults, and the government that keeps these people’s families and neighborhoods in shambles has absolutely no sense of community.",
                    "score": 260,
                    "replies": [
                        {
                            "author": "bean_zoup",
                            "body": "Yes exactly! This needs to be pinned!",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Senku2",
                            "body": "\"The kids shooting up schools are largely white and middle class\" is highly misleading. This is only true by virtue of the fact that whites make up the majority of the population. If you go by percentage of population, black people are actually slightly overrepresented among school shooters.\n\n[https://www.statista.com/statistics/476456/mass-shootings-in-the-us-by-shooter-s-race/](https://www.statista.com/statistics/476456/mass-shootings-in-the-us-by-shooter-s-race/)",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "hillsfar",
                            "body": "“*Give these kids’ parents a universal income and some healthcare, make sure the kids are fed and have enriching places to go to outside of school time, legalize abortion and end societal pressure to couple up and pop out babies for clout, and I bet most of the violence will go away.*”\n\nMedicaid, WIC, SNAP benefits based on family size and income, USDA free lunch program (that often includes breakfast) on top of SNAP benefits, Section 8, Headstart kindergarten, welfare, cash assistance, government smart phones. Tens of thousands per student per year spent by public school districts. (Portland Public Schools budget divided by students is over $40,000 per student per year. NYC spends over $32,000 per student per year. DC Public Schools spends over $30,000 per student per year.) Millions upon millions given to Planned Parenthood for reproductive care, prophylactics, Plan B, and abortions.\n\nYou can’t solve a crisis in poor, neglectful, lacking parenting that has gone on for generations, and you can’t solve a generational crisis in violent gang-infused, rap and social media-infused street culture, by just throwing money at it. Especially not by throwing money to misguided efforts full of corruption and a deliberate attempt to avoid criticizing the parents themselves (but blame teachers) and to avoid providing hard consequences (but pretend “restorative justice” or “universal income” will solve it).",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "yallermysons",
                                    "body": "Lol—wait 🤣🤣🤣 are you *seriously* suggesting that any of these poorly developed and distributed government programs even begin to scratch the surface of the problems going on in our society? *Have you ever had to use these programs?* Have you seen them in action?? You sound incredibly ignorant as to how they work and naive about their efficacy. I can only assume you’ve not actually had to overcome dozens of barriers to your own health and financial security with government programs.\n\nI was dead broke when I was a student and needed food stamps. It changed my entire life when I got them after graduating college. I couldn’t get them during college because full time students can’t get food stamps. Do you understand what that means for parents seeking higher education? I was making 11k a year at the time and barely qualified. Imagine making more than me, which is easy to do and which MUST be done if you’re gonna take care of yourself and one other child, being dead broke and out of options and you still don’t qualify for these resources? \n\nI watched my single mother of three exhaust all her options my whole upbringing to access these resources. Racist ignorants who have meaningfully interacted with perhaps 2 Black women in their entire life said about my hardworking, dedicated mother what you said in your comment. But I do not know many people who could do what my mother did. I remember when she started making too much money and got cut off. She was making 35k a year, taking care of three kids, and going to college with a mortgage. She never drank or did drugs, my mother worked three jobs at one point and had to put her children in the trust of unsavory people because childcare was too damn high. Her addiction of choice were shitty men, and why would she choose different when everyone else around her is asking her for money, nobody else is showing up for her, and these abusive men are the only people WATCHING her kids and PAYING the bills? Are you gonna go raise these people’s kids, the ones who you say need to get off their ass and parent the kids, the ones who can’t parent their kids because ***they’re trapped in a cycle of poverty???*** I didn’t fucking think so. But plenty of abusive assholes will, unfortunately, and that’s REALITY. Not a list of terms I posted to sound like I know what I’m talking about, but an actual real life story. \n\nYou sound like somebody who has never ever come even close to what I experienced even as a child free singleton in college, listing off a bunch of government benefits that you’ve never had to use or implement and completely ignorant to how they work or when they apply. In the USA, kids learn to neglect their bodies *because* of our shitty healthcare. Parents are working so hard that they neglect their kids—and succumbing to addiction to manage pain stress and violence is HUMAN, it’s a totally normal response and we fix it by addressing the origins of the stress and pain and violence—which is our useless fucking government. If people didn’t have to hustle and make money because employment is rife with ableism and racism and transphobia and nepotism, if people could afford a decent living with blue collar jobs, if kids had reliable out of school time spaces to go to outside of the streets, then they couldn’t even be targeted by adults who exploit them by trafficking them into gang violence. That’s the result of neglect, loneliness, and violent pressure by adults in their lives—NOT some kind of inherent propensity for violence. And if you believe outdated white supremacist bullshit that’s not any of our fault, we can’t force you to read a book and learn shit. \n\nThose are a few examples of *dozens* of barriers that these kids and their families are facing. \n\nI bet you couldn’t even describe what restorative justice is in your own words. And I’m not really interested in seeing whatever definition you come up with after googling it real quick either so please don’t double down. You can spew half-baked ideas about topics you don’t know about and situations you have never experienced. But I want you to know, you only look smart to folks who are brainwashed enough to believe you based on their own uninformed biases, without doing their own research. \n\nThose of us who actually know what the fuck we’re talking about? We can easily identify and recognize the ignorance in your words because ***it’s not true to life***. And shame on you if you’re a teacher, being so willful in your ignorance that you blame victimized CHILDREN for problems they did not create for themselves.",
                                    "score": 55,
                                    "replies": []
                                },
                                {
                                    "author": "Meowth76",
                                    "body": "It's grossly under-funded... these social programs. They live in survival mode all day every day.\nLacking parenting is also due to lacking education and privilege to afford parenting classes, etc. Even some of the teachers believe \"spare the rods, spoil a child\" myth. \nIt's a societal issue by large.",
                                    "score": 29,
                                    "replies": []
                                },
                                {
                                    "author": "amandabang",
                                    "body": "Lol the duct tape \"solutions\" you're listing that fundamentally fail to resolve anything are such bullshit. When you have a society that only values profit at the expense of people's lives, health, and humanity and then expect individuals to bootstrap their way out of the holes created by systemic and multigenerational problems this is what you get. When you tell people that they're a drain on society and don't belong and that they are owed nothing then you can't be surprised when they don't feel like they owe anything to society in return. You can't shit on whole groups of people and act shocked when they don't give a shit about playing by the rules of a society that openly mocks, ridicules, dismisses, and blames them.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pink_hoodie",
                    "body": "Whelp. For much of our history education stopped at age 14.",
                    "score": 30,
                    "replies": []
                }
            ]
        },
        {
            "author": "SonorantPlosive",
            "body": "I worked in a suburban, middle class district. Two of my former students that I had had in elementary plotted to, and participated in, the murder of the one kid's grandfather. I had grown up with this kid's mother. Was by all accounts a happy, loving family. Kids were 15 years old when they decided ending someone's life was worth a few thousand dollars. \n\n\nIt isn't just an urban problem.",
            "score": 91,
            "replies": []
        },
        {
            "author": "JigokuLamia",
            "body": "This isn't just in urban schools. One week this October, we had 6 fights in 5 days; we had none last year. One of my homeroom students threatened to lynch a student of color at their bus stop, so I'm debating whether I want them in my classroom at all.\n\nI think there are ebbs and flows to physical violence at schools, and our current political climate won't help the situation. Do what you can to take care of yourself and know this isn't an unknown in other schools, either.",
            "score": 135,
            "replies": []
        },
        {
            "author": "Direct-Ad-5528",
            "body": "I've noticed that the motivation (especially from the parents) is personal pride. They support their children fighting because in everyone's eyes, letting anything go, big or small, is humiliating and shameful, showing weakness. Parents are also quick to assume their child is the underdog with righteous motivations, when the fight is nine times out of ten over something inconsequential and dumb on both sides.",
            "score": 105,
            "replies": [
                {
                    "author": "oliversurpless",
                    "body": "Fighting is like war, not only nothing heroic or noble about it, but should be called what it is; the breakdown of decorum and proper diplomacy. \n\nConfidence/good leadership would find more ways not to fight…",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "thecooliestone",
                    "body": "When I tell my kids that it's okay to let something slide they look at me like I've grown a second head. \n\nI ask them what they plan to gain from this, and they always say \"I'm not going to just let him try me!\" \n\nI was told as a kid for sure that I wasn't to let anyone put hands on me or my siblings. If someone hit me, I was to fight back. But these kids think that because someone laughed (not at you, but you're a middle schooler who thinks everything is about you so it MUST be laughing at you) you now have to fight them. \n\nIt doesn't help that you only get 2 days ISS for a fight, and nothing at all if all you do is totally disrupt everything by cussing at each other and threatening.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "solomons-mom",
                    "body": "Yep.  Personal pride.   Senient creatures have always ranked themselves into a social staus orders.  The comment describes the wanna-be alphas of the bottom of the social strata.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "YoureNotSpeshul",
                    "body": "> They support their children fighting because in everyone's eyes, letting anything go, big or small, is humiliating and shameful.\n\nI'm gonna get downvoted for this, but I've seen this more in poor communities than rich ones. Does it happen in wealthier communities, too? Absolutely, but it's rare, and it's usually not condoned by the well-off and educated parents. I think it's because they've got other ways to *\"show off\"* and be prideful. The $100,000 car, the mansion, the new addition to the pool house, the new golf cart, etc... Having your kid being the fighting menace in these types of communities isn't something that the parents want since they believe it reflects badly on them/their family, and their kid will be talked about and shunned. However, in communities with systemic poverty, I've noticed that it's much more a problem. God forbid your kid lose a fight or get disrespected, because somehow that reflects badly on themselves and their family *(from what I've experienced)*. They take it as a personal affront to their pride and reputation.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Direct-Ad-5528",
                            "body": "I get that, and I've noticed that too. When you don't have a lot, protecting the intangible things you do have is more important. Of course, this attitude can overall negatively impact a child's future, but if you're already working off the assumption that a child has no future, what does it matter?\n\nParents think they are protecting their kids by giving them license to fight back against perceived slights, but it's really more of a \"crabs in a bucket\" situation where they are encouraging a mentality that will hold them back from success.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TigerBlue6632",
                    "body": "At the beginning of my teaching career, on a daily basis, I had stopped fights and talked to all parties involved. It is almost ridiculous that 80% of the time, these fights on the playground started because someone called another student’s mom ugly. I had to ask if they had seen or met the mom and almost 100% of the time, they said no. Personal pride indeed.\n\nHaving parents in my face yelling that they did not teach their child to do nothing when someone hit them - they get hit and they will hit back - makes it harder to stop fights.\n\nI taught in a metro area elementary school the first ten years of my career. My classroom was right in front of the playground.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "oliversurpless",
                            "body": "Guinea pigs now, *that’s* a problem!\n\nhttps://youtu.be/zvG6kIOiIzI?t=74",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fatesarchitect",
            "body": "One of my students picked a fight in the neighborhood, the other guy followed him home and kicked in the door, then shot and killed his mom.\n\nFoster care. Then a few years later he came back to the neighborhood, and I'm not sure what went down, but he murdered another one of my students and their mutual friend. \n\nI've been following the trial. I've gone to therapy over it. You can't ensure everyone goes to college, but the reality is even darker. I had another kid killed by cops. \n\nI have no advice, just love. Take care of yourself, get therapy, and take your time to grieve the future of the child you saw, and the future of the child who exists now.",
            "score": 67,
            "replies": []
        },
        {
            "author": "divinebongrips",
            "body": "what a terrible thing to weigh on your mind - i am sorry for everyone involved. i am shocked at the reaction parents have to violence. that includes their celebration and encouragement of it. i don’t know how it possible to combat it when a kid’s parent is cheering them on from the sidelines (or trying to get into fights with CHILDREN themselves).",
            "score": 24,
            "replies": []
        },
        {
            "author": "FindtheFunBrother",
            "body": "My first year I had a student who started a fire in his garage because he got in a fight with his mother. It was an attached garage so the house quickly followed and it killed his grandparents who were trapped in their room. \n\nHe was also a thief, but that’s a whole other thing.",
            "score": 27,
            "replies": [
                {
                    "author": "YoureNotSpeshul",
                    "body": "The kid sounds like an absolute delight, I bet he was an angel to teach *(I'm kidding of course)*. Still, how sad that he killed his grandparents. I'm assuming that they were letting the mother and kid live with them, and because of their kindness, they lost their lives. Did the kid go to prison??!??",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Open_Cat7048",
            "body": "I had two kids meet and become friends in my class.  By the next year, one of the boys killed the other guys mom with a baseball bat. It was terrible and so sad. Sorry you're going through this.",
            "score": 22,
            "replies": [
                {
                    "author": "YoureNotSpeshul",
                    "body": "Holy shit, was this the Topeka, KS case??",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Open_Cat7048",
                            "body": "Yeah, it was. :(",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "YoureNotSpeshul",
                                    "body": "My condolences. I'm really sorry.  I hope you're doing better.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TurtleScientific",
                    "body": "Did they ever really find a motive? I remember he claimed it was a prank gone wrong and he panicked, but he pled guilty to premediated first degree (which I always thought was a very hard charge to make stick).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adorable-Event-2752",
            "body": "I had a young man who tried to rob a van driver with another student from the school and was in class the next week with an ankle monitor.  That was in maybe 1995 or 1996 in El Paso, the man was stabbed to death.  I don't remember the trial though.",
            "score": 11,
            "replies": []
        },
        {
            "author": "DiamondDogg_",
            "body": "Good lord that sounds like such a difficult situation. Yeah I definitely see student violence rising. Even two fourth graders I worked with last year got into a fight over a boy. fourth grade. and two either kinder or first graders were shoving at recess and i told them to stop. it was like over a ball or smth. and i just graduated high school last year. my 10th grade year i think we had six fights in one day? and had to go on lockdown one time bc two girls were fighting and then one threatened the other syaing her brother had a knife or smth. My first/second grade class I work in rn is special education but there does seem to be more of a push for mental health/coping mechanisms. both my fourth graders last year and my 1/2 this year both have this emotion color zone chart that theyre taught about and my 1/2 graders have a calming corner (sped so sometimes they have meltdowns and need it) with some breathing/calming techniques and different animal skin/fur textures. [https://m.media-amazon.com/images/I/913hH2Z0HSL.\\_AC\\_SX466\\_.jpg](https://m.media-amazon.com/images/I/913hH2Z0HSL._AC_SX466_.jpg)",
            "score": 18,
            "replies": []
        },
        {
            "author": "friendlytrashmonster",
            "body": "Reminds me of the Johnny Cash song, “Don’t take your guns to town.” These boys think that being a man means being reckless and unafraid, so they arm themselves- having no idea what it means and no real intentions of anything but talk. Then somewhere along the way they get caught up in something and realize far too late the seriousness of what they’ve done. It’s very sad, but I don’t think it’s new. It’s just in a different form.",
            "score": 10,
            "replies": []
        },
        {
            "author": "bean_zoup",
            "body": "I’m from a suburban/rural community and the schools aren’t any better. We still have many fights.",
            "score": 17,
            "replies": []
        },
        {
            "author": "OHarasFifthShell",
            "body": "In most careers, over 30 years, you meet MAYBE a couple hundred people. Teaching (especially at the jr high-high school level), you meet a few thousand. Most crimes are measured in 1/100,000. If murder is a 10/100,000 crime in your area, you'll likely meet a few murderers in your tenure as a teacher. It's wild. But statistics DO work at scale.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Aromakittykat",
            "body": "It’s about survival. We don’t think most people are capable, until they do it. That’s why there’s always someone on the news saying “I never would’ve thought it’d be Johnny that…”",
            "score": 9,
            "replies": []
        },
        {
            "author": "More_Branch_5579",
            "body": "Im sorry. Thats very upsetting snd disruptive to the school community",
            "score": 8,
            "replies": []
        },
        {
            "author": "thecooliestone",
            "body": "It's not even fighting. I'm not allowed to give any real consequences to students constantly saying they're going to \"swiss cheese\" each other, and mimicking firing guns. They talk about sliding on each other, about their 9 or their glock. They constantly talk about guns, and doing gun violence. (And yet when I said I'd fired guns before, they were shocked. They didn't know gun ranges existed where one could practice firing their weapons safely)\n\nWe lost a wrestling championship because instead of helping his opponent up after pinning him, our wrestler pretending to fire a gun at him and made the \"brat, brat!\" sound. He was shocked that anyone had a problem with it because at our school kids do it to each other and to teachers constantly. \n\nThey have been told that shooting people is a normal response to things. They hear guns firing at night, everyone they know has a gun. They have access to guns. And yet the consequences of using those guns is never talked about outside of a few cases of people going to prison. \n\nSo you take kids, soak them in a culture of guns and violence, give them no consequences for violent behavior, and then expect...good things?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Zigglyjiggly",
            "body": "I could comment on a lot here, but shooting someone in the head isn't a part of fight culture. That's something else entirely.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Infamous_Fault8353",
            "body": "I’m not understanding how a person could murder someone and still show up to freshman history. Am I missing something? \n\nI must be very naive about this and am genuinely curious.",
            "score": 13,
            "replies": [
                {
                    "author": "Winter-Industry-2074",
                    "body": "The incident happened on a Friday night and the kid hasn’t been at school since. Likely incarcerated",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "furmama6540",
                    "body": "They literally see no issue with what they are doing.  They have no understanding of how serious their actions are.  This was likely viewed as either “something that just happened” or “something that had to be done” and either way is not as big of a deal as it is to people who aren’t part of drug deals and gang fights from the time they are born.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "sageclynn",
                            "body": "And school doesn’t help with this. The minimal or completely absent consequences for almost anything short of actual murder at school makes kids think the world is going to be like that too. We’re failing to prepare them, with life altering consequences.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "furmama6540",
                                    "body": "But don’t you understand??  We have to be more understanding of *their trauma*.  We *don’t know what their home lives are like*.  They need *grace*.  🙄🙄🙄🙄🙄",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "YoureNotSpeshul",
                            "body": "I know you're most likely correct, but my brain can't fathom that. I developed an eye twitch for like two months from downloading illegal music back in like 1999/2000 from Napster after thinking *(incorrectly)* that the FBI or something was gonna bust in my door and arrest me. Don't ask me why I thought that, I wasn't the brightest, but still - the stress from that got to me. I can't imagine the stress I'd be under knowing I just killed someone. Teenage me probably would've had a heart attack.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "furmama6540",
                                    "body": "You likely were raised in a house that valued at least some type of consequences.  Some of these kids aren’t.  It just a way of life.  My husband recently responded to a young kid shot during a drug deal gone bad.  Who was his get away driver?  Grandpa.  The “adults” raising these kids bring them up in this type of environment and it’s all they know.  \n\nAnd we can say a million time that they need grace and understanding. But that’s bullshit.  They need tough consequences to learn that their actions are wrong.  You can’t “grace” your way out of death if the opposing gangs bullet hits you first.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "YoureNotSpeshul",
                                            "body": "> You likely were raised in a house that valued at least some type of consequences.\n\n\nYep. Pretty much. Also, my parents never believed me. One time, I can't remember when, but my Dad saw something occur and he's like *\"If I didn't see it with my own eyes, I wouldn't believe you had you told me this story.\"* I lied like every other kid, but there were times I got in trouble for telling the honest truth, just because it sounded so insane. My parents didn't let shit slide. I can't imagine anyone in my family being my getaway driver, unless they were taking me to the station to turn my ass in. We weren't beat or anything, my parents weren't physical or violent with us; they'd just take away everything you held dear, every privilege, and you'd be up to your neck in chores after getting home from school and finishing your homework. Then you'd eat dinner, shower, and go to bed. My parents also didn't care if I liked them. I was often told *\"You'll have many friends in life, but you only get two parents. My job is to raise you to be a functioning member of society and I don't really care if you like me or not.\"* \n\n\nThe current generation of parents *(my generation, unfortunately)* seem to be the worst ones yet. It's sad, and they're doing their children a great disservice. Not all of them are bad, of course, I'm generalizing, but the majority of them are failing their kids.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Thing-2222",
            "body": "Middle school teacher here--I live in a peaceful smallish town in KS and have had six former students kill another person--three after they graduated, 3 after middle school. It is shocking when it happens.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SubtracticusFinch",
            "body": "A former student of mine killed a bystander in a botched gang initiation. It was tragic. And the kid, well, they weren't the best, but I never thought they'd actually be willing to take someone's life. It's pretty surreal. These are children and they're making choices that will follow them around for the rest of their lives.",
            "score": 4,
            "replies": []
        },
        {
            "author": "VegetableEmployee224",
            "body": "I worked at a rural highschool with a group of students that had a parole officer come by to check in that they are at school daily. 2 were for theft, one for assault and one for shooting a horse (no really). \n\nNone for killing someone. I'm sorry you have to deal with that. Remember to treat them as human. You can't know the experiences that went into that but you can hope they can live a better life from them on if you show them and others compassion.  \n\nAgain sorry to hear that.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Any_Significance6771",
            "body": "I taught in a rural community that turned into an urban community (urban expansion!). We started having gang fights, and parents and family members showed up on campus to fight high school students. It was ridiculous.  I now have several former students in Angola (Louisiana's state prison). Two who are currently awaiting separate and different trials for 1st-degree murder. One of them who is trying to subvert the system by claiming to be insane (yet when in my class, said he would claim to be insane if caught for murder,  boy was thinking 15 years in advance!). I get depressed when I think of them.\n\nI try to think of the ones who were the success stories. I have students who went to Ivy League schools or out-of-state universities and succeeded in getting degrees. Several return to the area (against my advice) to help their home community. I have to keep them in mind,  when I see on the news another ex-student has been arrested for assault, drug possession with intent to sell, etc.,",
            "score": 8,
            "replies": []
        },
        {
            "author": "One-Humor-7101",
            "body": "I see  the same problem  teaching in Philly. It’s not just that parents don’t care if their kids get into a fight. \n\nThe whole community supports physical altercation and defaults to violence to solve problems. When there’s an argument between two people, they bring multiple family members to meet up and fight each other. \n\nBut then when someone does get seriously hurt it’s all “how could this happen” and candlelight vigils and mom sob stories on the news.  \n\nWhat do you mean how could this happen? I saw her in the park after school stripped down to her sports bras strangling another kid while you (the mom) cheered her on 5 feet away!",
            "score": 6,
            "replies": [
                {
                    "author": "YoureNotSpeshul",
                    "body": "That was my experience in bad areas in NYC as well. Like, you raised them to be this way, why are you surprised?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "bambina821",
            "body": "I taught in a small rural town, and one of my students got arrested for stealing explosives. He planned to blow up the school. Got sent to juvie. While there killed a cop. Sent to prison. Attacked a staffer there. Some years later, another kid murdered 3 people. One of my students was murdered. The crime rate was low. It can happen anywhere.",
            "score": 3,
            "replies": [
                {
                    "author": "knittingandscience",
                    "body": "That’s true; almost 20 years ago I was teaching in a small rural town and a kid ran down a little boy in his car. He persisted in thinking of himself as the true victim, because he lost his license until he was 21. That kid scared me way more than the gang violence in the urban high school I worked at later.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BikerJedi",
            "body": "I have a former student doing life without parole, and another who attempted several murders. Both were teens at he time. Crazy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "sukmacabre",
            "body": "I had two students in the same class who tried to rob a woman who was holding her baby. Witnesses said she struggled with them a bit, as she thought they were trying to take her kid. They shot her in the face and she died onsite.\n\nThey came to class for a couple days till the cops found out who they were. For the most part they were OK guys--I got on to one for talking several times, but neither got any office referrals. Sometimes they turned in work, sometimes they didn't.\n\nI had another boy who shot and killed his mom. That kid was goofy as a shit house rat though, and I wasn't too surprised.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Thellamaking21",
            "body": "I also work in a more urban school and the fight culture is incredible. They are almost always talking about fighting. I don’t think a lot of people like to talk about it because it doesn’t seem pc. But the biggest difference i’ve seen in working in these schools is just the constant fight talk. \n\nI think people hear like constant fighting and then don’t understand it’s literally like  the whole year. If there not fighting their play fighting that turns into real fights. \n\nIt’s almost always parenting it seems like lame conservative propaganda but it’s almost always someone with with one or no parents  who are uninvolved or doesn’t care. \n\nBut it is a small percentage of them 10% of kids causing all the trouble. So people saying the areas is all bad is false it’s 20 kids that make the other 200 look bad.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Goblinspider",
            "body": "Systemic class warfare is the answer to your questions..if they had coping skills they would realize this and fight against it. Public schools (I’m speaking for US) were set up to continue the status quo not help people rise above poverty and violence.",
            "score": 14,
            "replies": [
                {
                    "author": "HomerJThompson23",
                    "body": "I hear this refrain all the time. How exactly were public schools set up to continue the status quo? Who set them up like this?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Spotted_Howl",
                            "body": "When you believe in a philosophy that rejects the complexity of society in favor of analysis of One Single Thing, the \"answers\" are always obvious to you.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "yallermysons",
                            "body": "Have you not read books about the history of education in your country? I’m assuming you’re a teacher and you’ve had to encounter that before.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Goblinspider",
                                    "body": "You don’t have to be a teacher to believe that there is a class warfare going on in the United States that is currently being run by an oligarch and his puppets.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "yallermysons",
                                            "body": "This is the Teachers subreddit",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hillsfar",
                    "body": "So, do you work in a public school?\n\nWhat kind of “class warfare” provides $32,000 per student per year in NY Public Schools? More in spending from K-12 (13 years) than most recipients and their parents combined would EVER pay in all of their taxes in their lifetime?\n\nDC Public Schools: $30,000 per student per year. Portland Public Schools: over $40,000 per student per year if you take the budget and divide by number of students served each year.\n\nAnd think of the ideological indoctrination in our public schools by an administration and faculty that is consistently 90% liberal or left per numerous research surveys, polls, and tracking of political donations over the past 3 decades. Teachers with Pride flags and gender affirming care missions abound. They post about it on TikTok. I’ve been in my kids’ classrooms. Diversity, Equity, Inclusion. How are they really teaching class warfare?!?",
                    "score": -4,
                    "replies": [
                        {
                            "author": "CarnivalOfSorts",
                            "body": "You have visited your kids classrooms but haven’t actually experienced a classroom. Diversity, equity, inclusion are abound because kids need to feel accepted, wanted, needed to learn anything. Now, if you want teachers to exclude any kid, just tell us right now which kids teachers should ignore so that you feel better about education. \n\nAlso, do you think that $30k-$40k goes to the student directly or does it pay for the infrastructure, faculty, activities for each student? Because that part adds up, not to mention the quality of living in those areas in spite of which kids you want to exclude.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "hillsfar",
                                    "body": "I’m not arguing against welcoming students of all races and backgrounds. We neeed children to feel welcome and safe.\n\nI’m arguing that we’re not doing class warfare in our public schools.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Goblinspider",
                            "body": "I never said they are teaching class warfare. Class warfare is what the US was founded on. Public school teaches students to follow orders, directions, and only learn for the test. Yes I teach in public schools. Schools can provide a warm place to spend the day and two hot meals but there’s no focus on their emotional health past elementary school, if at all. Revolution is scrubbed from textbooks and kids are taught to accept their harsh realities. Then when they go home to overworked parents who encourage violence any good coping skills that might have been instilled at school are overwritten by a literal fight for survival.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Goblinspider",
                            "body": "If you went to public schools you’re proving my point by not reading what I wrote and repeating what you’ve heard instead of forming your own opinion.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "iworkbluehard",
            "body": "Crazy shit. First and foremost, what a douche and so sad for the victim.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Via-Kitten",
            "body": "This is horrible, I'm so sorry you have to process this. I can definitely empathize, though I haven't witnessed a death yet. I teach at an alternative school in a rough area. We've had parents literally try to barge into the school to fight students on behalf of their kids before. We've had students jumped just going to their buses before. We've had gang brawls on our buses where a kid got yanked off the bus before he even made it to school. We had a shooting right across the street from the school and a whole math class witness the murder because it was a drive by. I will not be surprised when I hear about a death of one of my students but damn does it make the work even harder when I know we send them home to that kind of environment every day.",
            "score": 2,
            "replies": []
        },
        {
            "author": "funkofanatic99",
            "body": "My first year I noticed a student missing from my homeroom but didn’t think much of it because they notoriously skipped. Found out by the end of the day they had killed their stepdad over the weekend.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Own_Boysenberry_0",
            "body": "All this is one of the reasons they raised the drop out age to 18 and got rid of a suspensions.  It was effort to keep kids off the streets in my state, Maryland.",
            "score": 2,
            "replies": []
        },
        {
            "author": "M_Solent",
            "body": "It’s part of urban culture. You’ll pull your hair out trying to change it. Fighting is how they arbitrate disputes and achieve status. It’s been this way forever. (I attended elementary school in a very mixed income neighborhood in the 70’s, and even then, students who moved in from urban areas fought *a lot*. I taught in that district too, and during my first year I got to witness lockdowns due to fighting throughout the *entire* school, and a 200 person fistfight in the four lane street in front of the school, which is a major thoroughfare. I even taught a sociology class where we examined why young urban people fight, and by the end they convinced me I was wrong. Still, when a kid talks about how her mom will drive her to fights, it gives me pause, but it’s their world, not mine.) I currently teach in an inner city school, and fighting is just part of life. Just be thankful it’s not the neighborhood you have to sleep in. Get out if you can, it will never change.",
            "score": 3,
            "replies": []
        },
        {
            "author": "democritusparadise",
            "body": "This wouldn't have happened if guns weren't everywhere; the availability of them is the driving force behind the slaughter.",
            "score": 2,
            "replies": []
        },
        {
            "author": "deucedeucepewpew",
            "body": "I’m sorry to hear that. I used to work at a school quite like that and one day a similar situation happened. I heard there was a shooting at a fair and i thought to myself “i hope it’s no xxxx” turns out it was him and it devastated me. He told me a week prior how he was getting his life straight and how he wanted to be a truck driver. Ruined his life over beef. I feel for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "teenytinyducks",
            "body": "I had a student in 8th grade in 2017 who was involved with some shady characters (an actual gang that is nationally known), and he became more and more checked out in school and seemed like his ego was growing.  He wouldn't really engage in conversations with teachers or counselors and told us not to worry about it when we expressed concern for his future.\n\nAround Thanksgiving he became a different person.  Our city was rife with gang violence and we even had a sort of voluntary curfew set after several murders (recommendation, not really enforceable, but I stopped walking my dog after dark too far from my apartment).  We found out years later (in 2021) that he killed someone in a drug deal gone wrong that fall.  He was being used by a gang to run drugs and \"proved himself\" to them by killing a woman.  He was encouraged and protected by the older gang members to use more and more violence.  It was so incredibly sad trying to make any sort of difference there and realizing what a strong force I was up against.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far_Neighborhood_488",
            "body": "drove me out several years ago. when all they see are arguments being solved with violence it's only a matter of time before it's happening in your class or worse...and young.  very very young. I was subbing at a school for students who couldn't quite keep up at the regular high school so this is where they went to collect credits, try to graduate, but they had trauma at home and had already been in trouble with the law.  In other words, they were one step away from juvie....last chance.  I'll never forget the day I went in to sub lang. arts and the note said that there had been a fight the day before and so attendance would be down b/c students were showing their allegiance to their friend (whichever side they were on).  OH, ok, I mean, I was used to this and just kinda shrugged.  I was a little nervous about this school but felt safe overall.  Then, and I kid you not, the teacher went on to provide the details of the project the students were working on.  They were researching and reporting on serial killers throughout history.   YYYYYEP.  Manson, Dahmer, Bundy, Son of Sam, Gilgo Beach, etc. etc.They were to research personality profiles of the both the killer and their targeted victims.  You should have seen the intensity of the posters they made, pictures, details, everything.  I just couldn't get over it. Still can't comprehend that teacher's line of thinking.  Glorifying the most evil, to the most susceptible and influenced population of students I've known.  BUT, who am I?  Just a sub coming in for one day............shrug???",
            "score": 1,
            "replies": []
        },
        {
            "author": "bravofan4l",
            "body": "it’s generational trauma :( this is heartbreaking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yallermysons",
            "body": "…okay you teach world history\n\nSo you know that the students in your school come from literal hundreds of years of violence, they’re *still* living in traumatic conditions (so they’re not experiencing post-trauma—they’re currently existing in the trauma).\n\nLike these kids are the vulnerable population who are raised by impoverished parents, addicts, and other obvious results of generational trauma. They are the prime targets of gangs who want to traffic kids into doing dirty work. And that’s not even counting if they’re neglected or raised by abusive or emotionally immature adults. Government intervention barely scrapes the surface of any real resources these people need to thrive. \n\nAnd you wanna blame it on fucking “fight culture”? Maybe what these kids at these schools need is teachers with cultural competency. Who’s the problem, the teenager who doesn’t even have full access to their brain, or the adults who put them in this situation and then SOMEHOW blame victims when they’re a goddamn world history teacher?\n\nI’ve taught in three countries, and I tell you the fuck what. I learned about my students—what they experience in their families, neighborhoods, how they see life, what they go through outside of school, and I think it’s part of my job as a teacher to do that. It’s almost April and you just found this out. That tells me a lot about your relationships with your students and coworkers.\n\nWe’ve got rich white (and white collar), genocidal, sexual deviants who abused any university legacy policy they could to have the money and power they have today, systematically destroying your students’ neighborhoods. Those are the shady criminals. You need to look up “cultural competency” and take it seriously because that’s how we do OUR JOB, as professionals.",
            "score": -1,
            "replies": [
                {
                    "author": "elmexicano24",
                    "body": "She ain’t even trying to get to know the hood. All she did was describe it as a poor neighborhood. Her last comment says everything you need to know. She can’t wait to move to the burbs!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "No-Strength-9461",
                    "body": "Thank you for this! The thread was starting to scare me with all of the kind of out of context answers. There’s a history in this country that creates these environments for certain people! We cannot reduce the issue to parenting!",
                    "score": 0,
                    "replies": [
                        {
                            "author": "yallermysons",
                            "body": "The crazy thing is this is a subreddit for teachers and we’re supposed to know history…",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CucumberDry8646",
                                    "body": "The amount of shockingly racist people as teachers on this sub is astounding. And yet, exactly why education is in shambles bc they learned the buzz words to do performative equity but not actually change anything bc that might make them feel uncomfortable or require hard work.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bean_zoup",
                    "body": "This is so fuckin real! Yesss!",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "bean_zoup",
                    "body": "Do you have any recommendations you can give me as someone who wants to work in education and/or mental health? I just love the way you write- very inspiring!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "CucumberDry8646",
            "body": "This is not the school for you. \n\nI also worked at a title 1 school but rural not urban. I did grow up in a title 1 urban district though. Not that I am diminishing the choices of said student, but I think there is some unconscious bias’ in your school about the students and community. I would be curious about who told you/the group this information, making sure that it was from an administrator who has first hand verified information and not someone spreading a story. I now put on PD around a specific group and had one district where the entire staff held a believe about a group of kids that was based on a lie/story that was passed on for years. \n\nThat said, if this is known information then we can assume the kid did time in juvie or was otherwise dealt with legally. If they’ve been dealt with, please don’t hold a mistake over a 14 yo’s head for the rest of their school career. You didn’t speak to any context about the situation but they’re a kid, keep watering them. You are not going to hold parents accountable for student violence, your administration needs to if it’s happening at school. If it’s not happening at school, why the angst? We can assume your keep using urban as black and brown kids. I would really recommend examining the historical implications and violence that slavery and genocide has left in these communities before blaming the people that were having this violence perpetrated against them. Teach about that in class if you want to show the kids you’re on their side.",
            "score": 1,
            "replies": [
                {
                    "author": "bravofan4l",
                    "body": "All these downvotes are so interesting…what she said is correct! This is generational trauma.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}