{
    "title": "StOp HaRaSsInG mY kId.",
    "author": "i_am_13_otters",
    "subreddit": "Teachers",
    "rank": 13,
    "score": 180,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/Teachers/comments/1je3oax/stop_harassing_my_kid/",
    "id": "1je3oax",
    "selftext": "* 6th grade\n* Nearly illiterate\n* Fs\n\nSent home two emails over the last month. Second time parent calls admin. \n\nAdmin tells me to stop making contact. \n\n8:30 and I wish I was outside collecting carts or something instead.",
    "comments": [
        {
            "author": "ComprehensiveCod3397",
            "body": "Embrace it! You now have a perfect excuse to give whatever grades you feel are relevant and make literally no contact with the parent!",
            "score": 213,
            "replies": []
        },
        {
            "author": "BlackSkull83",
            "body": "Provided its in writing that you are not to contact the parents, don't contact them for anything.\n\nIf they get pissed at the end of the year that the kid is still sitting on an F, point to this issue.\n\nSounds like an opportunity for some good old-fashioned malicious compliance.",
            "score": 137,
            "replies": [
                {
                    "author": "reallifeswanson",
                    "body": "WIN/WIN!",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "Disastrous-Nail-640",
            "body": "I’d simply send an email to admin letting them know that, per their request, you will no longer be contacting the parents regarding their child’s struggles and failing grades. \n\nIt puts it back on them. That way, when mommy dearest comes back later claiming you never reached out and admin questions it, you can point to the email chain.",
            "score": 67,
            "replies": []
        },
        {
            "author": "Ok-Reindeer3333",
            "body": "Parents are the worst part of teaching sometimes.",
            "score": 33,
            "replies": []
        },
        {
            "author": "mells3030",
            "body": "So I tell all my students that they need to pass my class just one semester in order to move up to the next grade.  New rules in my district. Or they have to go to summer school for credit retrieval. I say this to all students because it's my job.  Parent called me to ask why I'm telling her daughter that she won't get moved into the next grade saying that \"she will discipline her daughter and that's not my job\". OK so it's about to be 4th quarter and she has had an F all year and this is what you want to yell at me about.... cool cool cool",
            "score": 28,
            "replies": []
        },
        {
            "author": "SeaCheck3902",
            "body": "\"Stop making contact\"??\n\n  \nYou're living my dream!",
            "score": 21,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 16,
                    "replies": [
                        {
                            "author": "SeaCheck3902",
                            "body": "20 minute bathroom breaks are routine in high school.  My hope is your 6th grader is too young to vape.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "we_gon_ride",
                                    "body": "One of our local elementary schools has caught students in 4th grade vaping.\n\nI’m a middle school teacher (7/8 only) and we have installed vape detectors in all our bathrooms",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Responsible-Bat-5390",
            "body": "Document it and don't have to contact any more. Sounds like a win!",
            "score": 6,
            "replies": []
        },
        {
            "author": "transtitch",
            "body": "Admin put in writing not to contact that parent? Say LESS.",
            "score": 5,
            "replies": []
        }
    ]
}