{
    "title": "A sub just told me to “go to class”",
    "author": "Internal_Lettuce_202",
    "subreddit": "Teachers",
    "rank": 3,
    "score": 1140,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 89,
    "url": "https://www.reddit.com/r/Teachers/comments/1je7y6k/a_sub_just_told_me_to_go_to_class/",
    "id": "1je7y6k",
    "selftext": "It’s my first year teaching at a school where the students can be wildly disrespectful, especially if you don’t already have an established relationship with them. I heard the substitute yelling at the class and felt bad. I knew he was going through it. \n\nHe saw me and I asked him “they giving you a hard time?” He said no angrily, and told me I needed to go to class.\nI’m 22 but I’m a big guy. I just thought it was funny that this man thought I was a middle school student. ",
    "comments": [
        {
            "author": "Majestic_Avocado3231",
            "body": "I was out for a meeting last month, and I popped back into my classroom to get my lunch. I had MY OWN substitute tell me this. I felt bad, because I was so taken aback that I didn’t quite know what to say in the moment and all the kids just started laughing at her.\n\nThe worst part is, I had introduced myself to her that morning😭",
            "score": 807,
            "replies": [
                {
                    "author": "Internal_Lettuce_202",
                    "body": "All of my subs usually quit before I can see them ;-;",
                    "score": 311,
                    "replies": []
                },
                {
                    "author": "TheCzarIV",
                    "body": "Pffft. That’s on the sub for not having their bearings and realizing who’s talking to them. \n\nI learned this lesson in the Marine Corps. when I was not aware of my situation and accidentally smartassed my SSgt. as a Lance. Let me be the first to tell you that was the wrong move, and it was a lifelong lesson.",
                    "score": 170,
                    "replies": [
                        {
                            "author": "Richard_Ovaltine",
                            "body": "What did he do to you?",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "TheCzarIV",
                                    "body": "Nothing life-shattering or anything lol. Homie was a washout Drill Instructor and had a chip on his shoulder about it. I spent the next 6 or so hours getting smacked around and IT’d up and down E-hill like I was back in boot camp.",
                                    "score": 56,
                                    "replies": [
                                        {
                                            "author": "ChapnCrunch",
                                            "body": "Can you please explain that last part in layman’s terms?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ADHTeacher",
            "body": "My second year teaching we were still hiring campus supervisors and a few parents helped out in the interim. One stopped me in the hallway, asked \"student or staff?\" and gave me her best Mom look when I said \"staff.\" She was clearly going to object, so I just said, \"I'm 35 years old\" and unlocked my classroom door in front of her. Felt a little bad about how embarrassed she looked, but also...lol.",
            "score": 352,
            "replies": []
        },
        {
            "author": "stumblewiggins",
            "body": "Once while walking with my class outside during a fire drill, I had a sub question why I was walking amidst all of these students, basically accusing me of being up to no good. \n\nLike Ma'am, 1) we are on a public street in the middle of a city, so even if I weren't affiliated with the school, I have every right to be here and 2) I'm wearing my fucking ID badge on a lanyard around my neck. Who are you again?",
            "score": 166,
            "replies": []
        },
        {
            "author": "SinfullySinless",
            "body": "When I was subbing at 23 years old, I dismissed my middle school class for lunch and turned around to go back in the classroom. An elderly teacher grabbed my shoulder real hard and told me to go to lunch. \n\nI was confused and asked if teachers had to go to lunch too. That’s when she saw my badge and did the ole “they keep getting younger” then walked away. \n\nLiterally had a bruise on my shoulder from her death grab.",
            "score": 291,
            "replies": [
                {
                    "author": "GeneralTurkey1",
                    "body": "Feel bad for the kids in her class.",
                    "score": 132,
                    "replies": []
                },
                {
                    "author": "fluffydonutts",
                    "body": "When she went to school, she probably got a ruler on the knuckles and her ears boxed..",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "anonpidgeon01",
                    "body": "jesus, definitely should have reported that",
                    "score": 100,
                    "replies": []
                },
                {
                    "author": "IrenaeusGSaintonge",
                    "body": "She's lucky you weren't a student. Grabbing hard enough to leave a bruise? Can't see that going well for her if it gets investigated.",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "penguinspie",
            "body": "I teach middle school. I'm a younger teacher (26 in year five) and I do have a pretty round face. I was waiting with one of my students after a tutoring session and I had a PTA mom ask me if I had a ride home/knew where my mom was at to pick me up. \n\nThe look on her face when I said \"ma'am I work here\"...my god if I could bottle that.",
            "score": 137,
            "replies": []
        },
        {
            "author": "OriginalRush3753",
            "body": "I’m 4’11”. I subbed in middle school. The kids were ALL bigger than me. I carried a backpack. I can’t tell you how many times I was asked for a pass, told to go back to class, or threatened with detention until the teachers got to know me. And I dressed nicely (black pants and a top). It was insane. Most found it funny. One was embarrassed and wouldn’t let it go. Good times. 🙄🤷‍♀️",
            "score": 110,
            "replies": [
                {
                    "author": "raebz12",
                    "body": "My gym teacher was 4’11”!  Most of us were taller than her in kindergarten. We were at a district school (kindy-13), and I don’t remember her once having any discipline issues. She was the embodiment of awesome. :-)",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "Auntie_Sissy",
                    "body": "5’1” here and I also work in a middle school. I too carry a backpack (it just fits all my crap!), and I’ve been mistaken for a student several times. Even by other kids, many of whom know me, who just don’t realize there’s an adult there because I am so short.\n\nOne year, I had to cover a RA class during planning and was walking the students back to their hallway afterward. From behind me, I heard a teacher who was notorious for being really tough and strict (but fair) yelling at someone to get back in line, among other things. Like really getting on them yelling. I’m nosey so I turned around to see which kid she was getting onto. Soon as I did, she started laughing and then gave me a hug. Turns out she’d been yelling at me until I turned around and she recognized me. Much as it can be annoying at times, that was one of the times I truly got a kick out of it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "p0rkch0pexpress",
            "body": "One time I was like 30? I had a long beard and a fade (I’m 6’2 and was around 200 lbs at the time) this teacher chased me down yelling I want your id! The whole time I’m looking in front of me for who he’s trying to catch to get the kids attention. He grabs me and demanded my phone and my id.  When he saw staff he was shocked. In my head I’m thinking…I know the kids are large but the beard length , lack of uniform should have tipped him off. He’s fired now for being an asshole and the union couldn’t protect him. Good times lol.",
            "score": 86,
            "replies": []
        },
        {
            "author": "Dullea619",
            "body": "I work at the middle school of a K through 12, and let me tell you, there is a reason I am happy for uniforms. Classroom aides look younger and younger every year.",
            "score": 46,
            "replies": []
        },
        {
            "author": "lilabethlee",
            "body": "Security came running after me as I was walking into campus. They told me I was not allowed to park in the teacher lot and if I didn't move my car it would be towed. I had been at the school for 3 years already",
            "score": 45,
            "replies": [
                {
                    "author": "NWMSioux",
                    "body": "I’m bigger, bearded guy in year 9 / 5 of teaching in a large city high school and still get confused for a: contractor, plumber, electrician, IT guy, copier maintenance, substitute teacher, campus security, exterminator, and “Dad who who didn’t check in.”\n\nNope, sorry, just your friendly neighborhood environmental science teacher. I’ve only been here half a decade. ¯\\_(ツ)_/¯",
                    "score": 22,
                    "replies": [
                        {
                            "author": "lilabethlee",
                            "body": "Believe it or not, I had a kid who was 11th grade, full on bearded lumberjack looking dude. He got confused for a parent all the time",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "NWMSioux",
                                    "body": "I totally believe it. I work our basketball games and have seen kids from many schools where I had to stop and read to program to make sure they weren’t actually a regular dude in their 30s.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Cool-Firefighter2254",
                                    "body": "I once had a kid whose fake ID had him as older than I was. It was completely believable that he was in his late 20s. They grow them big in the mountains!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CJess1276",
            "body": "I’m 41 years old, but I have a bit of a baby face and I’m short.\n\nI dyed my hair once a couple years ago and my own principal tried to kick me out of the staff entrance hallway thinking I was a kid. \n\nBack when I started student teaching at a middle school, an overage eighth grader sidled up beside me as I walked in and tried to flirt with me, “Damn, ma, you new here? You cute a shit. I ain’t seen you in any classes, can I carry your bag for you?”\n\n“Um, sure, I guess you can carry it to the office for me while I check in….”\n\n“Oh, it’s ok, we don’t have to check in, the teachers take attendance first period.”\n\n“*I’m* the teacher first period. I’m getting my visitor badge.”\n\nKid disappeared so fast into the crowd of students, and I never did see him again…..",
            "score": 70,
            "replies": []
        },
        {
            "author": "ArianeEmory",
            "body": "When I started subbing I was just out of college and looked about 16, honestly, looking back Forever had campus supes yell at me to get to class when I subbed middle school. It's part of why I started wearing blazers and dressing up in general. I'm old now, so I no longer have this problem, lol.",
            "score": 25,
            "replies": []
        },
        {
            "author": "7Mamiller",
            "body": "I was in my mid 20s wearing a 3 piece suit and heals and got told to back to class. I was doing hallway duty. With a walkie. Lol",
            "score": 23,
            "replies": []
        },
        {
            "author": "No_Row3404",
            "body": "I got the 'student treatment' multiple times during my first year teaching high school and student teaching. I only got it once when I started at Middle School. The worst one was when I was a student teacher and we had taken the class to the media center for research. I was walking around monitoring students and one of the media techs started getting onto me about my thermos of tea I was drinking. I started apologizing, it had been engrained in me to never eat or drink in a library and it still felt weird to, until I realized she thought I was a student. I think I choked out 'i'm one of the teachers' at her and she switched and apologized. My senior students witnessed all of this and I wanted to die.",
            "score": 25,
            "replies": []
        },
        {
            "author": "KatieAthehuman",
            "body": "My first year teaching high school, I went into the staff lounge and was heating my lunch up and the dean of students walked in. I said \"hello\"and he said \"oh I saw you on the cameras and thought you were a student. Have a nice day.\"",
            "score": 21,
            "replies": []
        },
        {
            "author": "nardlz",
            "body": "As a new teacher at 30, I got screamed at by an older teacher and that forever is etched in my brain as how NOT to talk to anyone, including students!",
            "score": 11,
            "replies": [
                {
                    "author": "Internal_Lettuce_202",
                    "body": "An older teacher got onto me the other day. She knows I’m a teacher. She told me that I need to be quiet when the principal is talking… WE ARE AT LUNCH?!?! THE PRINCIPAL ISNT TALKING TO ME?!?!?!",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "NewHumanStillLearnin",
                    "body": "An older teacher got mad at me for being in the halls thinking I was a student then was embarrassed when they found out I was a teacher which resulted in some sort of personal war they waged against me? I had a difficult class & a student who had a bathroom pass (literally “BATHROOM ONLY *subject room #*” on a piece of wood) decided to go to their friends class & told the teacher I said the student could just go hangout w their friend (ok so normal middle school behavior???). 10 mins go by, I put in our messaging platform that student has been gone from class & needs to return. I kid you not, the next day this teacher starts going off to the principal in front of everyone at a huge important staff meeting that “some people just let the kids wander” etc etc while looking at me the entire time. Principal had seen the message & shut that down immediately. Teacher got mad that this happened & just kept trying to report me for bs or accuse me of petty things like “class is too loud”, hun, it’s my prep so I’m the only one in here (I was grading with a single earbud in).",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jayyy_0113",
            "body": "This is why I’m thankful to have tattoos as a young teacher, there’s no way I’m getting mistaken for a 14 year old 😂",
            "score": 10,
            "replies": [
                {
                    "author": "NWMSioux",
                    "body": "My school has a few 15 and 16 year olds with tattoos. I wish I were joking. By the time they hit 17-18, probably 5% of the kids at school have at least one. The thing is though, these tattoos are *really* good. I’ve got over a dozen and have seen the work and WOW. Apparently there’s a kid in town (like 17 or 18) who does “couch tattoos”, meaning they give him money and he tattoos them while they sit on his couch. This kid’s line work and shading are freaking incredible, plus he’ll “practice” on anyone that wants it. He only does black, and honestly he’s better than most of the artists in town if not near the best.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "jayyy_0113",
                            "body": "That’s impressive! Most high school tattoos I’ve seen aren’t the best quality. I hope that kid goes places",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Esagashi",
                    "body": "I had a 16 year old in class the other day tell me about her tattoos… 😳🙃",
                    "score": 3,
                    "replies": [
                        {
                            "author": "prinsessanna",
                            "body": "I had a 17 year old in class the other day with full sleeve tattoos.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Nature-Asleep",
                                    "body": "I have 2 middle schoolers with tattoos🙂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "prettyokhuman99",
                    "body": "I still got confused for a middle schooler with a leg sleeve multiple times 😭",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TrooperCam",
            "body": "Yes sir and turn right around",
            "score": 26,
            "replies": []
        },
        {
            "author": "TheCzarIV",
            "body": "Welp. Off to my class I go then, good luck sir.",
            "score": 10,
            "replies": []
        },
        {
            "author": "GoldenEarthGirl444",
            "body": "last year, I was helping a kindergarten student who was having a hard time sitting in his seat on the bus after school. the bus driver started driving away because they thought I was a student",
            "score": 9,
            "replies": []
        },
        {
            "author": "BalFighter-7172",
            "body": "When I was student teaching (age 22, not very tall male, in the high school from which I had graduated) I was often mistaken for a student by students, teachers, and the principal.  It didn't help that my younger brother was a sophomore in the school.",
            "score": 8,
            "replies": [
                {
                    "author": "Cool-Firefighter2254",
                    "body": "Do you look alike? Maybe they thought you were your brother.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "12BumblingSnowmen",
            "body": "As a sub, I once almost did that to a principal. I think it’s that when you’re trying to reign in a wild class as a substitute, you just file anyone that’s vaguely “middle schooler shaped” and not where they’re supposed to be as a student that’s screwing around.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Kang-Shifu",
            "body": "Don’t even think about talking back. Show that sub some respect and get to class before  I call your mom",
            "score": 6,
            "replies": []
        },
        {
            "author": "katana1515",
            "body": "As a British teacher I was really confused about this story until I twigged you don't have your kids in uniforms!",
            "score": 14,
            "replies": [
                {
                    "author": "NewHumanStillLearnin",
                    "body": "(US here) It’s funny bc I’ve been told to go to the office/for school ID/etc. at schools with uniforms bc they thought I was a student breaking dress code ._.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MF-ingTeacher",
            "body": "When I coached baseball early in my career I had several umpires tell me to put on a mask as warmed up the pitcher between innings waiting for the catcher to get ready.\n\nThe other coaches thought this was fantastic.",
            "score": 11,
            "replies": []
        },
        {
            "author": "liquidice12345",
            "body": "Every school I’ve worked at for the last ten years has staff ID’s that are supposed to be visible.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Immediate-Plant3444",
            "body": "I yelled at a bus trainee for not listening about filling in the bus from the back to the front during a drill. So embarrassed.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fnelson1978",
            "body": "I am a high school teacher in my later forties and I had someone ask if I was a student or teacher last month.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zyryd",
            "body": "I got some observers this year from the local university. I actually knew one from when I was president of my educational club, but she walked in and I said “oh look at this another new student” and I immediately got red in the face realizing I’m talking to a person I literally know. This job takes mental tolls.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Thats-Not-My-Name-80",
            "body": "My first year as a para I was 38, and I worked at a HS. I got asked to Homecoming. And Prom, although that was a joke because he knew I was a teacher then and no way. Then a student teacher was flirting with me, I had to explain that the age difference was too extreme because I was old enough to be his mom. And he didn’t believe she and I were only one year apart",
            "score": 2,
            "replies": []
        },
        {
            "author": "Majestic_Taro5580",
            "body": "I used to work as a youth advocate for an sa/dv shelter and had set office hours at the local high school. Until the staff got to know me; I was constantly mistaken for a student… 😅",
            "score": 2,
            "replies": []
        },
        {
            "author": "ahappieryear",
            "body": "I've been working as a para for 3 years now in a middle school. STILL kids ask me if I'm a teacher or a student. I've had subs yell at me to sit down, tell me to get out of the team room, and have an entire conversation with me without realizing I'm staff. I'm a 5'1 male but I have a beard. I don't understand.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gullible-Tooth-8478",
            "body": "I was dressed up for meet the parents night. Admittedly I’m very petite (was under 5’ and maybe 110 lbs?) but I was wearing heels, a pencil skirt, and a button down collared shirt so very business casual. Anyway, I helped direct some parents between classes as we’re supposed to since teachers were stationed outside the classrooms between class periods (as were several student ambassadors who were all dressed in their formal school UNIFORMS). Later one of the parents I helped find their way showed up to my classroom as I taught their child. They apologized repeatedly for stopping me for help as they thought I was one of the student ambassadors (again, me in a skirt, button down shirt, heels, while student ambassadors were in a literal school uniform). I was just like 💁‍♀️ \n\nSeveral years later I finally learned to carry my ID more regularly as I was carded at Best Buy trying to buy a video game…I was fucking 27 years old 😂🤣",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nature-Asleep",
            "body": "I got yelled at today by the designated detention teacher for having my phone out in the hallway. I teach middle school and am 25.. she got closer to take it from me and then realized I was a teacher.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BitterHelicopter8",
            "body": "I used to mentor in my oldest son’s middle school, and one day I was out on the basketball court with my mentee. When it came time to switch classes I had a teacher yell at me and tell me to get moving when the tardy bell rang and I was still gathering my stuff. I found it super amusing and a little flattering. But sadly no one mistakes me for a student anymore. 😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "isfashun",
            "body": "I worked at an upper elementary school that only served grades 4-6. Students wore uniforms. I was 28 years old wearing a navy blue shift dress, black tights, and black oxfords. I was heading to my classroom and was told to get back outside and get in line with the other students lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rainbowbrite_87",
            "body": "I'm 37, but quite small with brightly colored hair. This happens all the time! Anyone new to the building, and sometimes even students mistake me for a student. Especially on Fridays if we're dressed down.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdvancedRelative5821",
            "body": "The subs at my school are real fringe of society types.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dangerous_Ad_5806",
            "body": "Im a para. Last year when I was in middle school- I kept getting mistaken by subs as a student.  I'm only 5 foot but I am also 37 so it's a little 🧐",
            "score": 1,
            "replies": []
        },
        {
            "author": "flor_de_pinas",
            "body": "Im 35 and teach middle school and it still happens to me.",
            "score": 1,
            "replies": [
                {
                    "author": "StandardObservations",
                    "body": "Whenever I started subbing, before I started teaching, I was 30. I went into an assignment and they told me to report to the gymnasium, I showed up and they had set a whole bunch of student desk in it, this was during COVID. I got assigned a seat and as I was sitting there it clicked on me.. they thought I was a student even though I had a dress shirt and slacks and my ID badge on.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "prettyokhuman99",
            "body": "I still get asked for a hall pass in elementary & middle school…I’m in my late 20s & have been teaching for oh a handful of years hahaha",
            "score": 1,
            "replies": []
        },
        {
            "author": "lecoopsta",
            "body": "How old was he? I was mistaken for a middle schooler by an 80+ year old sub the other day. He’s a really nice sub. But def thought I was a student. And I’m a 35yo male lol. I think the older you get, the harder it is to discern age ha.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Basic-Nose-7630",
            "body": "I’m 26 and a preschool teacher and a pta member saw me walking in from my lunch and said “hi friend!” Like ma’am? I could pass for maybe a senior in high school (I have an Asian baby face) but I sure as hell could NOT pass for an elementary student 😭😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "Desperate_Owl_594",
            "body": "I told one of the school counselors to sit down but she's a very tiny woman. she was wearing high heels. when i noticed I apologized. I don't think she ever forgave me lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alchemist_Joshua",
            "body": "Wait, middle school? Thats unbelievable.",
            "score": -7,
            "replies": [
                {
                    "author": "Reasonable_Patient92",
                    "body": "On the contrary, it is believable. It happens more than you think.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Internal_Lettuce_202",
                    "body": "I’m 6 foot. But I have students that tower over me.\nI have a mustache and a (horribly patchy— I’m 22) beard. I lowkey felt disrespected the way he said it 😭😭",
                    "score": 7,
                    "replies": []
                }
            ]
        }
    ]
}