{
    "title": "Contract negotiations are going so well",
    "author": "lapuneta",
    "subreddit": "Teachers",
    "rank": 10,
    "score": 34,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 32,
    "url": "https://www.reddit.com/r/Teachers/comments/1jei04n/contract_negotiations_are_going_so_well/",
    "id": "1jei04n",
    "selftext": "At the Union meeting today we were told the district pretty much isn't going to give us a raise. It's been 4 years. We were told we need to give creative non-monetary solutions to get something instead of a raise.   Because that will help when inflation is what it is.   ",
    "comments": [
        {
            "author": "KevlarKoala1",
            "body": "Response: OK here is non-monetary solution. We strike.",
            "score": 47,
            "replies": []
        },
        {
            "author": "NoLuckChuck-",
            "body": "We negotiated shorter school years. Taking 6 days off the school year is at least getting paid more per hour.",
            "score": 36,
            "replies": [
                {
                    "author": "tree-potato",
                    "body": "Exactly. Don’t pay me in money? Then pay me in time. ",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "AleroRatking",
                    "body": "Yeah. That's probably the best solution if they are truly budget blocked.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "masteroguitar",
            "body": "Strike. Once the parents don’t have babysitters fit will hit the shan",
            "score": 29,
            "replies": [
                {
                    "author": "MyBoyBernard",
                    "body": "Yea. All that good will from the Covic lockdowns were gone by like the second month back.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Koto65",
                            "body": "You had good? All it did in my area was cement we were only good for giving them a break from their kids.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AleroRatking",
                    "body": "Depending on state they will just replace them with uncertified teachers for a fraction the cost.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MarionberryWeary4444",
            "body": "Here's a solution - we don't work until you pay us more.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Knights_of_Grey",
            "body": "IDK where you are but my district always starts the negotiation at whatever the state cola increase is. It might be beneficial to know what raise your district is getting.",
            "score": 10,
            "replies": []
        },
        {
            "author": "averageduder",
            "body": "I think Cbas in general are going to be hell over the next few years. We’ve been told we’re almost 10% over budget. \n\nI’d actually consider taking less workable days over a raise. Professional development days are for the most part a waste of time. Not all of them. But we have ten, I’m sure we could have more or less the same with 5.",
            "score": 8,
            "replies": [
                {
                    "author": "Bojefsk",
                    "body": "Probably all the top end admin salary’s.    In 2015 my district had 90 admin at the central office for 45k students.    In 2019 we had 180ish admin. In 2025 we have 315 admin and now only 35k students.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "averageduder",
                            "body": " That's insane. But I don't think that's it. It's more complicated. Rising costs that should be somewhat static like maintenance and heating are part of it, rising insurance costs are a large part of it.  \n\nLess funding from our state (NH) is part of it. Vouchers are part of it. \n\nIt's hard to see how it's all sustainable. I have a colleague, smart guy, Harvard educated, but a bit of a doomer, that thinks our current public education model will be dead before Trump is out of office.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "AleroRatking",
                            "body": "My admin makes less per hour than me.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TeBunNiMoa",
            "body": "Strike strike strike.\n\nMake them remember how important we are. Just a few years ago we were heroes, let's help them remember when thousands of kids are stuck at home.",
            "score": 6,
            "replies": []
        },
        {
            "author": "towehaal",
            "body": "Are you in a state that allows strikes?  If so, strike.  Also consider an overthrow of your union leadership if they are too weak.",
            "score": 5,
            "replies": []
        },
        {
            "author": "sk8nteach",
            "body": "My district has been returning with lower numbers every time the union votes down a raise.  Last number offer was 1%.  But the superintendent gets a 1/4 mill in salary plus 33k in housing, car and phone allowances.  Starting teacher pay is 47k and tops off shy of 90k with 40+ years and a doctorate.",
            "score": 4,
            "replies": []
        },
        {
            "author": "_TeachScience_",
            "body": "More jeans passes! That’ll do it!",
            "score": 4,
            "replies": []
        },
        {
            "author": "uknolickface",
            "body": "4 day school week!",
            "score": 3,
            "replies": [
                {
                    "author": "briman2021",
                    "body": "There are a few districts in my area that do this, and it seems like it’s pretty good for teachers, plus it cuts the amount of bussing miles by 20% which is not insignificant if there is a budget crunch.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AleroRatking",
                    "body": "How does that work with the 180 day rules.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zenzen_1377",
            "body": "Its not the administrators you need to convince to fund the schools and the teachers. They can only do so much with what they have. I would argue most of the time they could be doing a better job of distributing the wealth where it needs to go, but even so, they've only got so much in the tank.\n\nIts the voters. The only way we get more money into the system is through taxes and voter-approved programs at the state and federal level. Which, with the way things are going right now feels really really hard...\n\nI feel like we are trapped in a paradox. In order to raise educated citizens who will vote to support education, we need educated voters to first vote for education... but we don't have the collective willpower to actually put education as the top priority, so the whole system just flounders.",
            "score": 5,
            "replies": [
                {
                    "author": "Bojefsk",
                    "body": "Yeah not with the current president and his cronies. They want to eliminate public education all together.   The DOE Facebook was praising home schooling last month.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "xtnh",
            "body": "\"Our temporal budgets do not allow us to expend the time we would like, and you are going to need to find a way to accomplish all that we did on our own time.\"\n\nWork to contract.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lost_Crab_6025",
            "body": "Never, ever agree to a pay freeze. Our union agreed to a one year freeze in 2008. We were frozen for 6 years. We only got 3 back. Never again. The last time they tried it, we walked. We were on strike for 5 days. We probably settled for too little, but we made our point. They didn’t think we’d go out. We did and the whole town backed us.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JMLKO",
            "body": "More PTO",
            "score": 2,
            "replies": []
        },
        {
            "author": "thecooliestone",
            "body": "You get Wednesday off now. If you're paying me 1/5 less functionally than you did before COVID then I want my day back",
            "score": 2,
            "replies": []
        },
        {
            "author": "coskibum002",
            "body": "Same here.  Union is prepping us for a pay freeze.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Odd-Software-6592",
            "body": "Maybe you can get paid with IOUs. Then take those to the grocery store and spend them if they accept them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Martin_Van-Nostrand",
            "body": "Shorter workdays, less work days (heck just cut PD days in half), more PTO.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KittenKingdom000",
            "body": "Unions aren't what they used to be. After getting absolutely shafted this year with the new contract where we barely get a raise, I'm probably pulling out and keeping my dues because I need the money. \n\nThe biggest thing we asked for was a raise to bring us up to the average in the county, we got 1%. \n\nWe do more PD, don't get paid for covering extras or clubs/giving up prep time, don't get paid for duties, have multiple courses (I have 5), we pay more insurance and to retirement...what the FUCK are they negotiating??? Not a goddamn thing successfully as far as I can tell.",
            "score": 1,
            "replies": []
        }
    ]
}