{
    "title": "How to get [teacher] fired",
    "author": "Senator_Longthaw",
    "subreddit": "Teachers",
    "rank": 4,
    "score": 187,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 53,
    "url": "https://www.reddit.com/r/Teachers/comments/1jeiuqs/how_to_get_teacher_fired/",
    "id": "1jeiuqs",
    "selftext": "Be vigilant - this is where education is now.\n\nApparently, there is a Snapchat or WhatsApp channel for how to fire your teacher. My son showed me screenshots and swears every teacher has one.\n\nI'm currently on leave because a couple of students (all friends, failing my class) have decided to lash out at me. One is making an allegation and the others are corroborating. They are claiming it happened during class and I am hoping that someone will come forward and tell the truth.\n\nEven if they do, this will probably cost me my job. Possibly my career. Obviously this is a nightmare and I'm not the only teacher dealing with this right now.\n\nSo please be vigilant.",
    "comments": [
        {
            "author": "Responsible-Bat-5390",
            "body": "I sure hope you are in a union. And it works out.",
            "score": 124,
            "replies": [
                {
                    "author": "Senator_Longthaw",
                    "body": "Thank you - I am in a union and they’ve been very supportive. They don’t see a lot of options and doubt there’ll be any way to fight. I’m only one of several teachers on leave for a range of reasons. Teaching is in a very bad place right now.",
                    "score": 73,
                    "replies": [
                        {
                            "author": "illinoisteacher123",
                            "body": "That's BS. There's plenty of ways to fight even if you have to go it alone. Call a lawyer tonight to get a letter sent over to the students family. You need to be ready to sue as well, but give them a chance to recant then go nuclear. It's the only way this gets solved.",
                            "score": 42,
                            "replies": []
                        },
                        {
                            "author": "blissfully_happy",
                            "body": "What in the hell are they saying happened?!? Can you give some vague details? You shouldn’t lose your job over an accusation. \n\nI’m so sorry. :(",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Seesaw_2921",
            "body": "Unless I am mistaken, this is libel. Real world consequences need to be brought to bear. Causing someone to lose their job is a big deal and the law should be used. Unions have lawyers. Time for them to earn their pay.",
            "score": 78,
            "replies": [
                {
                    "author": "AleroRatking",
                    "body": "How do you prove it though without them admitting their lying\n\nLibel is super hard to win because you need to prove the individual knowingly lied.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Ok_Seesaw_2921",
                            "body": "Isn’t it written down on Snapchat and WhatsApp? “How to fire…”",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "PhasmaUrbomach",
                            "body": "Do you have other stydent witnesses who would tell the truth?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Mr_McShitty_Esq",
                            "body": "Subpoenas are nasty little tools. Slap a 16-year-old with a subpoena and haul them into court. Have them questioned separately, if possible.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "byzantinedavid",
            "body": "Once the employment shit is sorted (wait until after) get your own lawyer and sue for defamation and libel. Name SnapChat in the suit if you can get proof. The only way this shit stops is if there are REAL consequences for the lies.",
            "score": 85,
            "replies": []
        },
        {
            "author": "AntillesWedgie",
            "body": "I taught in Korea and my classroom had a camera. Anyone came to me about a problem and I would just say “I will happily watch the class with you.” After the first time of me and my admin watching with a parent there were some uncomfortable questions from the admin and me to the parents and then the kid stopped acting out and no more parents wanted to watch a class with me. Most kids behavior didn’t improve, except the one kid, but there were never anymore false allegations.  Parents were absolutely mortified.",
            "score": 39,
            "replies": []
        },
        {
            "author": "garylapointe",
            "body": ">My son showed me screenshots and swears every teacher has one.\n\nEvery teacher has one what?",
            "score": 27,
            "replies": [
                {
                    "author": "Senator_Longthaw",
                    "body": "Every teacher has a Snapchat about them - “how to get [name] fired” or something similar. I’m a high school teacher; surely this isn’t an elementary thing.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "zh4624",
                            "body": "is there a way to search for these? How do people find them?",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "briman2021",
                            "body": "I’m very confused. You’re saying there is a Snapchat out there called “how to get senator_longthaw fired” and every one of your coworkers has one as well, and people could just search for them and fuck you over?  I really don’t understand how that works, and I use Snapchat a fair bit. \n\nI could understand if someone filmed you during class and spread it around, but it sounds like you are talking about something totally different.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "-Akrasiel-",
            "body": "This whole \"rage bait\" fad going through schools is ridiculous.  Students have tried it multiple times on me when I enforce the rules they don't like.  Luckily, my admin sees through it and it's turned into the boy who cried wolf.",
            "score": 26,
            "replies": []
        },
        {
            "author": "misticspear",
            "body": "I mean, isn’t the account kinda evidence of their wrongdoing? I’m so sorry",
            "score": 35,
            "replies": [
                {
                    "author": "mrs-monroe",
                    "body": "Kids are known to be dumb.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ryaninthesky",
            "body": "Get your son to take screenshots if you can, if it’s a group about your school?",
            "score": 20,
            "replies": [
                {
                    "author": "yourgirlsamus",
                    "body": "Whoever owns the account will be able to see if a Snapchat is screenshot. It’s safer to take a photo with a separate device. Otherwise the account that took a screenshot could get blocked and lose access to evidence.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Odd-Software-6592",
            "body": "Hire a lawyer and have that lawyer send all the families who’ve made the false allegations a letter explaining how they’re getting sued for this libel. One of those families is definitely going to squeal and get all this to end.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Equivalent-Life9546",
            "body": "They will likely be texting about it and that will be all the proof that you need to prove your innocence. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "skinnyquis",
            "body": "I’m sorry to hear that. My friend went thru something similar, and even CPS came and did an investigation. TCPS cleared my friend, but our district decided to let them go anyway taking their teaching license as well. Schools/districts will at the end of the day protect themselves and their reputation. Personally, I would start looking for other opportunities :(\n\nOur system is broken af and it would take a revolution to steer it back to where it needs to be.",
            "score": 5,
            "replies": []
        },
        {
            "author": "cosmic_collisions",
            "body": "Cameras in classrooms.",
            "score": 27,
            "replies": [
                {
                    "author": "YoureReadingMyName",
                    "body": "This will harm more than it will help. There will be states/districts where parents will question why they don’t have access to this footage until they get it and someone without a life will pick it apart until they can find something to pull out of context and cause a commotion. In the other districts it will just be admin doing that.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "AleroRatking",
                            "body": "Exactly. It's solving a small problem with a massively bigger one.\n\nLike yes. It would save hundreds of teachers their jobs a year. It would also cost tens of thousands their job.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ScotlandTornado",
                            "body": "I can definitely see some lawyer picking through an audio of like 4th period to piece together different phrases some teacher said throughout the class to make it seem like they said “hell hitler” or some dumb stuff like that",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EelsMac",
                    "body": "Potential FERPA violation. You'd have to have the camera only capture the teacher(s) image and any student voices recorded would need to be done so in a way that prevents reidentification of individual students.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "JazzlikeVictory584",
                            "body": "I don’t believe this is accurate. I was an admin in an alternative school and we had cameras in every classroom. Besides, why would it be ok to have cameras in the hallways, cafeteria, and gymnasium using this logic? Also, most school buses have multiple cameras with audio.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "gd_reinvent",
                            "body": "Wrong. Everywhere has CCtV cameras now.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ProjectGameGlow",
                    "body": "At the very least teachers could consider audio recording the class at all times.  This can be discrete and would be easy to justify as an accommodation for a student IEP. ",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Fibonacci_",
                            "body": "They should also consider that it may be illegal in their state.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "ProjectGameGlow",
                                    "body": "It would more fall under rules for students records requirements. In my state if someone does a public data request.  It might need to be made available.\n\nSecret recordings could possibly be illegal in some states but informing the students/parents  that  class is recorded as an accommodation. Then this would not be a secrete recording.   Get all of this disclaimers out of the way early and everyone will forget.\n\nDon’t ever use the recording for small infractions and save it for emergencies like this. \n\nIt is important how to do this legally and if it violates district policy.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "AleroRatking",
                                            "body": "We would need every parent to sign off on it (like we do for pictures). No way I get all of them",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ProjectGameGlow",
                                                    "body": "So if a student has a hearing problem, Dysgraphia or another disability with accommodation for audio recording how does the signature process play out.\n\nYou disclose the the student’s medical information about their disability to every parent? How do you do this with out a HIPAA violation?\n\nWhat happens when a parent refuses to sign?  The child will be denied their IEP accommodation and forced to transfer to a new school district that doesn’t have your policy?   This sounds terrible.\n\nDoes the policy also apply to transcribing software?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AleroRatking",
                                                            "body": "We'd have to record the lessons separately or write them down. That would be a FERPA violation anyway because if we just recorded the room they could hear other voices which would be a violation.\n\nWith zoom this was easy. Just record your end. In the classroom this would be incredibly difficult.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AleroRatking",
                    "body": "That's great until we get fired for checking our phone or not having a perfect lesson. Being observation level quality 180 days a year is not feasible.\n\nThis is solving a small problem with a much much bigger one",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ScotlandTornado",
                            "body": "Yeah I’m chill with no cameras.  What am i supposed to do if I’m always being watched?  Literally walk around my classroom for 7 hours every single day while my students are doing independent work",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "AleroRatking",
                                    "body": "I cannot imagine having to be observation quality 7 straight hours for 180 days a week. What if my kids earned free time lasts a minute longer than five minutes because I'm finishing writing an IEP or doing a lesson plan. This would be a disaster.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "glacialspicerack1808",
            "body": "I know you probably don't want to get your son involved, but he's got the proof. I'd definitely bring his screenshots into the conversation. Especially since it could happen to other teachers.\n\nI'm not TOO worried about myself, but that's because most of my classes I can count on there to be at least one kid who will tell the truth. Ironically enough we've seen the consequences of not telling the truth when we watched The Crucible this year. But the real reason most classes have at least one kid is because some of these kids I've taught since the start of their freshman year and have formed a bond with me. They'd throw hands with a kid who tried to cost me my job.\n\nMy first job I resigned because they admitted they planned to not renew my contract but hadn't made it official yet. Part of it was likely due to a student who was lying about me or taking things I did/said out of context. Several kids tried to get my job back by texting the girl pretending to be on her side and got her to admit she lied to try and get me fired. They tried to bring the proof to my admin but unfortunately it didn't do much since I had already formally resigned. But I appreciate their efforts. And if that's how kids reacted that had me for ONE year, kids who have had me for 2 or 3 years at this point are probably more willing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Affectionate-Pain74",
            "body": "I hate liars. Young, old, big, small….. I really hate them all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ScotlandTornado",
            "body": "This is why i don’t even bother really yelling at school anymore or getting into kids when they act like idiots in the hallway/during class.  There’s a chance someone will film you and then you get fired even though you literally did nothing wrong.\n\nNow they just run around the hallway and do whatever they want during class change.  I’ll say stop and if they don’t i just shrug my shoulders and walk away.  I’m not getting put on Facebook live by a 15 year old",
            "score": 1,
            "replies": []
        },
        {
            "author": "PugLife000",
            "body": "No idea why anyone would still become a teacher",
            "score": 1,
            "replies": []
        },
        {
            "author": "jeffincredible2021",
            "body": "That’s what’s scary about it! Someone just gotta be in cahoots and corroborate then you’ll be investigated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Street_Arm8462",
            "body": "https://www.reddit.com/r/Teachers/s/W6RJlwZctf\n\nHope this makes ya feel better",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chance_Analyst_4681",
            "body": "Lmao people in my school (teachers/admin) hacked my phone 😨 creepy fucks",
            "score": -1,
            "replies": []
        }
    ]
}