{
    "title": "My friend died",
    "author": "urstandarddane",
    "subreddit": "teenagers",
    "rank": 12,
    "score": 290,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 65,
    "url": "https://www.reddit.com/r/teenagers/comments/1je81xy/my_friend_died/",
    "id": "1je81xy",
    "selftext": "My friend died alongside his parents in a plane crash on their private plane, it was only the three of them, they all died. I don’t know how to feel. We haven’t spoken much since we both changed schools 3 years ago, now he’s dead. Oh Christ have mercy",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been flaired as [Serious]. Please be aware that this marks it as a place for serious discussion only and that any unserious content in this thread will result in a removal, counting towards your [ban tiers](https://www.reddit.com/r/teenagers/wiki/rules#wiki_ban_tiers). If your comment does not contribute to the discussion in a serious manner it will be removed. Please report any comments that do not respect this rule.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teenagers) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Asleep-Meaning-4462",
            "body": "Hey, I’m so sprry. But if it helps, since you said they all died together, just think about how happy and peaceful he is with his family. At least they’re together. ❤️",
            "score": 82,
            "replies": [
                {
                    "author": "L3thalPredator",
                    "body": "This exactly. Even though that sucks and absolutely awful, they all joined each other in the afterlife at the same time.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "urstandarddane",
                    "body": "I keep thinking of that moment they realized they were going to die. How terrifying it must’ve been",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -27,
                    "replies": [
                        {
                            "author": "mousie120010",
                            "body": "Well, I think they are religious based on their last statement and post history",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "pootluv",
                                    "body": "even if they aren’t christian or religious, i think there is comfort in knowing that none of the family members have to go through the pain of mourning one another. they all went together",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Doublefin1",
                                    "body": "Do you know them?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NotConfringo",
                            "body": "If OP is religious, the comment is fine. Even if they’re not, the good intention is clear. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Wooden_External_1156",
                                    "body": "Yeah, true lol. I think I’m just being bitchy",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No_Key_5854",
                    "body": "What a weird comment",
                    "score": -49,
                    "replies": [
                        {
                            "author": "Academia_Of_Pain",
                            "body": "What a weird reply",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Coffee_Addicted_Eric",
                            "body": "What the flip is wrong with sympathizing with other people you muffin",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TryAgain32-32",
            "body": "Oh my god, I am so sorry for you. It's sad you haven't been able to see each other and then this happens. I wish you all the best, may he and his parents rest in peace 🫂",
            "score": 41,
            "replies": [
                {
                    "author": "urstandarddane",
                    "body": "It’s surreal. Don’t know what to think, he’s dead",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "PlaneZestyclose5306",
                    "body": "Downvoted this",
                    "score": -18,
                    "replies": [
                        {
                            "author": "TryAgain32-32",
                            "body": "Why? What else can I do than write a message that'll hopefully make OP feel better? ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Prior_Gur4074",
            "body": "My sincere condolences.\n\n\nIf you don't mind me asking, how did you find out this happened?",
            "score": 10,
            "replies": [
                {
                    "author": "urstandarddane",
                    "body": "Saw an article and recognized the father’s name… Felt surreal",
                    "score": 8,
                    "replies": [
                        {
                            "author": "TryAgain32-32",
                            "body": "😭😭😭. I am actually sorry for you, that's like the worst way to find out. ",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cultural-Feeling1922",
                    "body": "Probably news",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Affectionate-News348",
            "body": "I’m so sorry for your loss 🫶",
            "score": 7,
            "replies": [
                {
                    "author": "urstandarddane",
                    "body": "❤️",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Prudent_File_9726",
            "body": "Jesus, I'm so sorry. Hopefully they're together in a better place, and may they rest in peace ❤",
            "score": 13,
            "replies": [
                {
                    "author": "urstandarddane",
                    "body": "❤️",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Curious_Doctor9750",
            "body": "My condolences, may they rest in peace",
            "score": 3,
            "replies": []
        },
        {
            "author": "Unhappy_pea1903",
            "body": "I'm really sorry for your loss, my friend died four months ago, I hope you will be able to cope with his dead and may he and his family rest in piece ❤️🕊",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cultural-Feeling1922",
            "body": "IS IT this crash:https://abcnews.go.com/International/wireStory/small-plane-headed-denmark-crashed-swiss-alps-3-119902310",
            "score": 2,
            "replies": [
                {
                    "author": "urstandarddane",
                    "body": "It is oh",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Cultural-Feeling1922",
                            "body": "Wasnt hard to find. Looked at your other Post and recognized The language and then just googled",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sad_Pelican7310",
            "body": "Damn, shit sucks😢. I hope for the best\n\nEdit: I just realized some may think I’m joking but I’m being genuine",
            "score": 2,
            "replies": []
        },
        {
            "author": "Doublefin1",
            "body": "I'm so so sorry my friend 😓❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "xX_stay_Xx",
            "body": "My condolences bud",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alzi_101",
            "body": "Nah I feel sorry for your loss are you doing okay?",
            "score": 2,
            "replies": [
                {
                    "author": "urstandarddane",
                    "body": "A bit hard to contemplate still…",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "-Spcy-",
            "body": "my gf is gonna be flying to family in april and im fucking terrified now that i think about it\n\ni remember just how scared i was in the past when someone i knew was flying and i feel like its gonna happen again, fuck",
            "score": 2,
            "replies": [
                {
                    "author": "urstandarddane",
                    "body": "If this can calm you, it is still exceptionally rare. I’m more than sure your girlfriend will be safe during the flight 🙏🏼",
                    "score": 5,
                    "replies": [
                        {
                            "author": "-Spcy-",
                            "body": "i hope so, thank you, i remember one of my friends was showing me how rare it is but its still scary knowing thats its possible yk? that if the off chance happens, the worst might happen\n\nbut im sorry for your loss, losing others is one of the worst things in the world",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mctoast1",
            "body": "Oh my God. I'm so Sorry for you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NeptuneMetro",
            "body": "Condolences, hope you are doing well",
            "score": 3,
            "replies": []
        },
        {
            "author": "Mr_ragethefrogdude",
            "body": "I know you can get through this remember the memories of good they had don’t dwell on the sadness of them being gone ❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "GalaxyGobbler914",
            "body": "Oh god that's terrible, my condolences. I hope you're doing alright..",
            "score": 2,
            "replies": []
        },
        {
            "author": "Slight-Clothes1971",
            "body": "Im really sorry for your loss, bro. Im pretty sure you both had a great relationship and spent fun times together, so cherish those memories. Stay strong dude, I believe in ya🙏🫂",
            "score": 1,
            "replies": []
        },
        {
            "author": "DisasterAccurate3221",
            "body": "I'm so sorry for your loss, dude. Seriously.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SweetHotsauce245",
            "body": "I am so sorry for your lost. The amount of plane crashes on private and commercial planes have risen drastically and it’s very concerning.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Intelligent-Bee-3888",
            "body": "This is so horrible, he and his parents didn’t deserve to die like that. I’m so sorry.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mountain_Economist_8",
            "body": "The first death of a peer hits hard. Mourn them, grieve, and move forward.  Sadly it will happen to everyone you know sooner or later. It’s just the nature of the game.",
            "score": 3,
            "replies": [
                {
                    "author": "xX100dudeXx",
                    "body": "r/mysteriousdownvotes",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "supraboi888888888888",
            "body": "oh my god im sorry...... look i know its hard but God has decided when there time is up and hey look i lost my uncle 2 years ago  and damn it sucked but i learned to always spend as much time as possible with family cuz u dont know when its all gonna change",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tricky-Secretary-251",
            "body": "Many people die and yet the living continues",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Question_8083",
            "body": "Sorry for your loss OP, please talk with a friend about it, it’s better than keeping it to yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pension_Zealousideal",
            "body": "Can't imagine",
            "score": 1,
            "replies": []
        },
        {
            "author": "urstandarddane",
            "body": "Grant them eternal rest, O Lord\nAnd let perpetual light shine upon them \nMay they rest in peace\nAmen",
            "score": 1,
            "replies": []
        },
        {
            "author": "TTV_Anonymous_",
            "body": "Im sorry for your loss, I can understand how you feel now. It might be frustrating that you didn’t talk with him for so long, but then on the other hand… was it a „real“ friendship until now if you didn’t talk for 3 years? This is a question, some might disagree, but worth thinking about. As the others said, you don’t need to see yourself in trouble for this. It happened and you didn’t cause it. Cherish the moments you and your friend had together and maybe he is watching you now? Who knows? May he rest in peace, I hope everything gets better for you. ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "CandygirlDK",
            "body": "A dead can be difficuelt to handle, and guessing you are around the guys age, so hopefully nothing you have experince handling. \n\nMy best advice is to talk about it, start with you parents and maybe reach out to others who also went to school with him.\n\nAnd remember its ok to grive and feel sad its completely natural and part of the grieving process.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sakul_the_one",
            "body": "My condolences 💐.\n\nI hope you will find peace with your innere self",
            "score": 1,
            "replies": []
        },
        {
            "author": "NON_existingpro",
            "body": "Real (Apes together strong)",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrasheonTotallyReal",
            "body": "omg i am so sorry for their loss. may their poor souls rest in peace",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hefty_Society3569",
            "body": "I’m 28, but trained a young lady of 18 at my workplace. She was really feisty but she had incredible drive for success and desire for worth of life. She also had a very challenging home life. Her tenacity was inspiring to me. I don’t have kids, and certainly not teenagers, but I for the first time felt the feeling of being proud like a dad might of her. She was my prodigy. \n\n3 weeks after I resigned she crashed her motorcycle and could not get over her injury’s. I still think of her almost every day. It is important to remember the reasons you loved them. I’m very sorry for your loss. I hope you’ll find the comfort your heart needs 💛",
            "score": 1,
            "replies": []
        },
        {
            "author": "Training-Speed-1263",
            "body": "My condolences bro,\n\nIt must hurt, real bad, to lose someone close like that. It probably sucks that the last time you talked to him was 3 years ago. It really sucks when you can never know when its your final moments talking to somebody",
            "score": 1,
            "replies": []
        },
        {
            "author": "LOR3DGuy10",
            "body": "I am very sorry for your loss.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patient-Bad3616",
            "body": "Whenever I hear about tragedies like this it always hits me so hard, I'm sorry for your loss, and remember to take the proper time to process and mourn, no matter how long that takes, this type of stuff can be so sudden and shocking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -8,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Hildingarios",
                            "body": "I pressed wrong post chill🙏I would not say that",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hour_Worldliness_772",
            "body": "Dang man uhhh I think u have my condolences? My English is not englishing",
            "score": -8,
            "replies": []
        }
    ]
}