{
    "title": "A couple of you asked to see my wall of shame in my last post.  Voila.",
    "author": "I_LOVE_PUPPERS",
    "subreddit": "MechanicalKeyboards",
    "rank": 2,
    "score": 491,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 42,
    "url": "https://www.reddit.com/gallery/1je8f80",
    "id": "1je8f80",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "ANY content that features products, services you sell, your prototypes in progress or items you were sponsored to post MUST use the Promotional flair, with disclosure of who you represent.\n\n*When posting your build, please provide a description* of the build, preferably as a Top Level Comment or Reply to this Comment, with the following information:\n\n*   Your keyboard featured and its layout\n\n*   The Switches, Keycaps, and Other Accessories Featured\n\n*   Any notable mods you performed\n\n*   Other helpful information such as low profile, lesser known firmware, etc.\n\nExample: Unobtanium Southpaw 1800 with DSA Salt with MorningCaps Artisan and Alps Rainbow Switches, modded with Sorbothan Foam on KMK\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MechanicalKeyboards) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "2ndpersona",
            "body": "https://preview.redd.it/59ngl20pjipe1.jpeg?width=1290&format=pjpg&auto=webp&s=1db74ea8e49513453e1c1e3b37fa582308185f97\n\nMy wall of shame (and guilt)",
            "score": 13,
            "replies": [
                {
                    "author": "I_LOVE_PUPPERS",
                    "body": "That is fucking awesome",
                    "score": 2,
                    "replies": [
                        {
                            "author": "2ndpersona",
                            "body": "Yours too",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MichaelJohn920",
                    "body": "And dustproof!",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Square-Jump-1808",
                    "body": "Keebinet spotted, ngl if i had the space i'd have something similar",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_LOVE_PUPPERS",
            "body": "Details are in the last image.  All started with my beat up old WASD Code and grew from there.",
            "score": 20,
            "replies": [
                {
                    "author": "wa__nderlvst",
                    "body": "Null65 looks real nice! Had a Dusk67 that I just rehomed from KBDFans and had considered the Null65, especially since brass weights have released, but wood boards aren’t my aesthetic anymore 🥲",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bright-Efficiency-65",
            "body": "I loved my anne pro 2. Maybe one day I'll replace the bad switches. The WASD keys are worn out",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheeOmegaPi",
            "body": "These keyboards look amazing! Thanks for sharing!!",
            "score": 2,
            "replies": [
                {
                    "author": "I_LOVE_PUPPERS",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CheddarMcFeddars",
            "body": "5 looks cool.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yamizaga",
            "body": "What'd you use for the hooks on the wall, thinking about doing something similiar for my 6 boards haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheElderBasilisk",
            "body": "Dear heavenly god I fear for your accountant",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electronic_Print_628",
            "body": "Your greed sickens me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DidjTerminator",
            "body": "How do you find reaching the shift key on the keebmonkey? Also do you think it'd be possible to use a long right shift key there instead and just bind the other arrow keys to different functions? Still pretty new to keyboards and I've seen those a few times and always wondered why that even exists.",
            "score": 1,
            "replies": [
                {
                    "author": "I_LOVE_PUPPERS",
                    "body": "I don't get on with it very well if I'm honest, I think I was more in love with the idea of an Alice layout than the practicality of getting to grips with it.  It stays on the wall more than most of the others.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pokopf",
                    "body": "So i think the reason for that shift is mainly that right shift is sth that many people never use. If you come from gaming, you will most likely use exclusivy left shit even for typing, as well es left thumb for space. This design makes the arrow keys, which most people do use, closer to the home row. \n\nIf you need right shift, there´s plenty allice models without that arrow key placement. Or you bind the up arrow to right shift when hold as well.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "DidjTerminator",
                            "body": "I see, that makes a bit of sense (though I honestly have no idea how you'd use just the one shift key while touch typing).\n\nSo far the only alice layouts I've found that don't use 1.5u alt keys are the layouts with the weird arrow keys, I've been gawking at cerakeys ever since I've learned of them however they have very limited colours in 1.5u keys so I've always been curious about these alice layouts with the funky arrow keys. I'd defo have to figure out a way to toggle function layers and turn them into arrow keys when I'm not using the right shift to type if I ever got one of these, or just accept that if I ever put cerakeys on an alice layout that the bottom row is going to be all black/white.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BallWaffle",
            "body": "nice collection!",
            "score": 1,
            "replies": []
        },
        {
            "author": "sparkofrebellion",
            "body": "Is the shame in the room with us?   \n  \nI only see a nice wall, although i probably would paint it somehow.",
            "score": 1,
            "replies": [
                {
                    "author": "Vodarac_Prime",
                    "body": "The only shame here comes from others while OP is enjoying his collection!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "trite_panda",
            "body": "You could practically retire off that now.",
            "score": 0,
            "replies": []
        },
        {
            "author": "acapate",
            "body": "I‘m curious since I am in the market for one: How do you feel about the Alice layout and how steep do you consider the learning curve to be? What made you go back to a regular layout?",
            "score": 0,
            "replies": []
        },
        {
            "author": "No-Border-8275",
            "body": "Hello\n\nWhat model is that \"Alice\" keyboard?  \nI want to buy one like this.  \nWhat is better, the Keychron Q13 Max or the Neo Ergo?",
            "score": 0,
            "replies": []
        },
        {
            "author": "WishCow",
            "body": "I can't seem to find the WASD constellation keycap set, is that named correctly? Rightmost column 3rd from the bottom.\n\nAwesome collection.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Cherry-Prior",
            "body": "That's a wall of classics!",
            "score": -1,
            "replies": []
        },
        {
            "author": "Idanlevitski",
            "body": "Looking for keycaps for my keychron q1 (grey). Any suggestions? I'm searching for blue/grey/black theme, not sure 🙃",
            "score": -2,
            "replies": [
                {
                    "author": "I_LOVE_PUPPERS",
                    "body": "I used GMK 80082 Bloo for a grey/black with blue hints",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Idanlevitski",
                            "body": "Do you think it will fit a grey keyboard (it looks like silver)? Anyway gotta find clones for cheaper, it's just my first keyboard 😅",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "I_LOVE_PUPPERS",
                                    "body": "Have a scrounge around on Alibaba, you can get clones of most themes.  It's your board, stamp your own style on it :)\n\nI just make whatever makes me happy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Idanlevitski",
                                            "body": "I found many on aliexpress like apollo, hammerhead, arctic, fisher and so much more but I can't decide 😆 grey isn't a popular color for a board here",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "I_LOVE_PUPPERS",
                                                    "body": "Don't worry about that, if you like it make it",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Idanlevitski",
                                                            "body": "Many of them are looking really good but a. Cant decide b. Cant actually know that it goes well with grey. I see it on black or white. And maybe i can pm you? Dont want to spam the comments 🫠",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "CouchMountain",
                                                                    "body": "Make your own decisions. No one can decide for you",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "linkxzs",
                    "body": "shoko is always the answer",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Idanlevitski",
                            "body": "Haha yeah i hope it will go well with grey",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "linkxzs",
                                    "body": "im sorta in the same boat - i have a q1 (but in white) sitting around somewhere and probably putting my shokos in them !!",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Idanlevitski",
                                            "body": "Do you get the real one or clones? I got budget for 1 or 2 clones 🙃 and i think shoko will go well with white, not sure about the grey lol",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "linkxzs",
                                                    "body": "i got one from a groupbuy at kono back in like 2021\n\nusually i take a screenshot of the keycaps and just put them on top of a photo of my keyboard to visualize it a bit",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Idanlevitski",
                                                            "body": "Oh nice!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}