{
    "title": "Budget-ish build for my wife: Feker Alice75",
    "author": "dj_edit",
    "subreddit": "MechanicalKeyboards",
    "rank": 17,
    "score": 9,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 3,
    "url": "https://i.redd.it/znjqv3b65ipe1.jpeg",
    "id": "1jeec0d",
    "selftext": "This is a Feker Alice75 I bought for my wife for $117 off Aliexpress (search \"feker Alice75\"), and it's actually pretty good.  It comes with Huano Strawberry Latte linear switches which are factory lubed, per-key RGB, metal case, and matching plastic wrist rest.  I also like the layout better than the standard alice because the keys curve to form the angle instead of abruptly \"breaking\" and creating large gaps.  With the GMK Pono keycaps and extra artisans, it brought the price up significantly, but I'm pretty satisfied with how the build came out overall.\n\nA few more pics on my [Instagram](https://www.instagram.com/dj_edit_keys/)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "ANY content that features products, services you sell, your prototypes in progress or items you were sponsored to post MUST use the Promotional flair, with disclosure of who you represent.\n\n*When posting your build, please provide a description* of the build, preferably as a Top Level Comment or Reply to this Comment, with the following information:\n\n*   Your keyboard featured and its layout\n\n*   The Switches, Keycaps, and Other Accessories Featured\n\n*   Any notable mods you performed\n\n*   Other helpful information such as low profile, lesser known firmware, etc.\n\nExample: Unobtanium Southpaw 1800 with DSA Salt with MorningCaps Artisan and Alps Rainbow Switches, modded with Sorbothan Foam on KMK\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MechanicalKeyboards) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "kool-keys",
            "body": "Pono!!   Love this set.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Pangolin1085",
            "body": "Wow looks great wd",
            "score": 1,
            "replies": []
        }
    ]
}