{
    "title": "First Keyboard",
    "author": "charlievelours",
    "subreddit": "MechanicalKeyboards",
    "rank": 5,
    "score": 47,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/gallery/1jeghbw",
    "id": "1jeghbw",
    "selftext": "Swagkeys Knight Stabs, Gateron Melodics, GMK WoB, Keykobo BoW [+Accents], and of course my little blue Penco case for all my lil tools.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "ANY content that features products, services you sell, your prototypes in progress or items you were sponsored to post MUST use the Promotional flair, with disclosure of who you represent.\n\n*When posting your build, please provide a description* of the build, preferably as a Top Level Comment or Reply to this Comment, with the following information:\n\n*   Your keyboard featured and its layout\n\n*   The Switches, Keycaps, and Other Accessories Featured\n\n*   Any notable mods you performed\n\n*   Other helpful information such as low profile, lesser known firmware, etc.\n\nExample: Unobtanium Southpaw 1800 with DSA Salt with MorningCaps Artisan and Alps Rainbow Switches, modded with Sorbothan Foam on KMK\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MechanicalKeyboards) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "charlievelours",
                    "body": "Idobao 80 Crystal",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hukcleberry",
            "body": "What keeb?",
            "score": 2,
            "replies": [
                {
                    "author": "charlievelours",
                    "body": "Idobao 80 Crystal! I love it!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpockIsMyHomeboy",
            "body": "Aw heck yea Idobao Crystal, heck of a first keeb :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "teamwolf69",
            "body": "Beautiful! What keyboard is this? How does it sound?",
            "score": 1,
            "replies": [
                {
                    "author": "teamwolf69",
                    "body": "Oh nevermind, I see you mentioned it’s the Idobao 80 Crystal. Looks really stellar, great job!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "charlievelours",
                    "body": "Thank you!! It's the Idobao 80 Crystal. It has foam + brass plate and acrylic case and there is a very sturdy but elegant sound to it. The Gateron Melodic is fun with it because the clicky sound is pronounced while not too loud.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "teamwolf69",
                            "body": "Oh wow that’s awesome!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LastLiquorice",
            "body": "This is also my first keyboard but I fucked up and lost the gaskets that go between the top and bottom acrylic plates. I've never been so distraught. I hope yours sounds lovely but mine is worse than a dollar store membrane keyboard.",
            "score": 1,
            "replies": []
        }
    ]
}