{
    "title": "How do you actually make a BJ with protection *feel good*?",
    "author": "AngieBellaRose",
    "subreddit": "sex",
    "rank": 3,
    "score": 49,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 38,
    "url": "https://www.reddit.com/r/sex/comments/1jej5t1/how_do_you_actually_make_a_bj_with_protection/",
    "id": "1jej5t1",
    "selftext": "\nSo last night I went out with a guy I just started dating and he said he wanted a BJ. Since I just met the guy, I thought it would be best to ask him to wear a condom.\n\nHe was nice about it but honestly it wasn't great for either of us... it was very uncomfortable for me, mostly cause there was a lot of... friction. And I don't think it was great for him. \n\nHe's older than me and he was nice about it but I got the sense that a more experienced woman would've done better.\n\nAnyway, I want to be safe but I wanna make sure l'm still good at it, you know? Any tips, tricks, or tools to make it better for both of us?\n\nI saw a post elsewhere about the right condoms to use but the thing is that the guy is the one that provided the condom. Not me. So barring that, what else can I do?\n\nCurious what actually works, especially from people who have real experience. Thanks!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thank you for posting in the r/Sex community. To ensure that everyone respects our safe space, we ask that you familiarize yourself with our Forum Rules and Posting Guidelines — which are visible in the forum’s sidebar, and also linked [here](https://www.reddit.com/r/sex/about/rules/).\n\n***\n\nRestricted subjects in r/sex include sex stories (which are permitted in the Weekly Sexual Achievement Thread only), body image and penis-size issues, hookup attempts, common topics which are considered repetitive in our forum, and requests for private chats.\n\nTo cut back on comments that add little value to the conversation, we have instituted a minimum character requirement that will silently remove comments that fall below it.\n\n***\n\nAny attempt to seek private chat or otherwise deviate a conversation away from the main forum, WILL result in a permanent ban. This goes both for OP and for all comments. Guide for blocking DMs can be found [here](https://www.reddit.com/r/sex/wiki/rules/#wiki_blocking_dms_when_making_a_new_post).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "lonelyinbama",
            "body": "It’s not gonna feel good. Hate to tell ya. Not for you and not for him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheReluctantWarrior",
            "body": "A blowjob with a condom on sounds more like a cruel punishment than any kind of fun for either party",
            "score": 1,
            "replies": [
                {
                    "author": "z284pwr",
                    "body": "This. 100/100 times I would just do it myself over getting a condom BJ.   There is just nothing exciting about the thought of getting one of those.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KMeok",
                    "body": "😈 this is giving me sadistic femdom ideas hehe",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rulanik",
            "body": "Impossible. I'd prefer a hand job over a condom BJ. Don't even waste your time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accurate_Hat_8464",
            "body": "Well, well done for using a condom under the circumstances. Wise choice. But your inexperience isn't the problem. Decades of practice still isn't going to make oral with a condom good for either of you. It pretty much defeats the object. So you either make the best of it, or hold off on blow jobs until you've seen clear STI panels. You don't have to go down on someone you just met and why would you if it's not going to be fun for you?",
            "score": 1,
            "replies": []
        },
        {
            "author": "JenInVirginia",
            "body": "That sounds like zero fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SixtyNoine69",
            "body": "You don't/can't (for the most part). Get yourselves tested and do the real thing. Condoms for PIV are one thing but condoms for oral, I can't even imagine. And that goes both ways. I know my way around providing some good oral but I think I'd be lost on how to do it well besides playing with the clit if I had to do it over female contraception.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Iggys1984",
            "body": "Put a little bit of lube inside the tip of the condom. Use flavored lube for you. You can also use dental dams.\n\nPersonally, I prefer a seductive hand job with warm coconut oil. Eye contact, dirty talk, warm your coconut oil in the microwave beforehand so it is body temp and liquid. You can use all kinds of techniques with your hands to make it feel good. Use your breasts as well. There is no fluid interaction with hands and penis, so you don't need a condom (assuming you don't have cuts on your hands - If you do wear vinyl/latex gloves and play up the naughty nurse angle). Moving your hands like a pepper grinder, putting your hands in prayer position with him in between, moaning as you stroke him. It can be super hot.",
            "score": 1,
            "replies": [
                {
                    "author": "AngieBellaRose",
                    "body": "Omg thanks! I wanna be like you when I grow up 🥹",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Yourdreamsareboring",
                    "body": "Definitely lube inside the condom",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SixtyNoine69",
                    "body": "This is a good suggestion.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "peacetoall1969",
                    "body": "And play with the balls!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AntRevolutionary5099",
                    "body": "Genuine question for the guys out there...\n\n34F here. I've always thought that the pepper-grinder move would not be particularly pleasurable... Like even if there's a lot of lube, twisting in opposite directions just does not sound like it would feel all that great to me... However, I don't have a dick, so I can really only guess lol. But I've also never once seen a guy do that move on himself...which leads me to believe I might be onto something..? lol\n\nLike I'm sure that with a lot of lube, it's not **not** pleasurable...but I feel like that's something that could so easily go wrong, if there's suddenly not enough lubrication for whatever reason\n\nThoughts on that one?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ForceGhostMachoMan",
            "body": "It's like wearing a raincoat in a shower",
            "score": 1,
            "replies": []
        },
        {
            "author": "stay_or_go_69",
            "body": "Even professional sex workers have trouble with this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EnderDragon78",
            "body": "For a lot of people, it is not going to be enjoyable by either person involved, experience is most likely not going to make it any better. Sure there are probably a few things that could be done, but probably not worth all the extra steps involved. Set boundaries, and only do what you are comfortable doing, the right guy will not be upset if you say no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FJBP95",
            "body": "You can't. Its like asking how to make eating out feel good when I put a plastic wrap on that coochie.",
            "score": 1,
            "replies": [
                {
                    "author": "violendrette",
                    "body": "Actually, they make panties for this called Lorals, and it feels great! Just gotta lube the inside too. I figure the same is true with condoms - lubing the inside will help.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Goodthrust_8",
            "body": "Take off the protection 🤷‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Morpheushasrisen404",
            "body": "I mean, don’t know if you’re planning on seeing this guy long term. If you are, both get tested and you’ll never have this problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lin2031",
            "body": "It won’t. Ever. The latex or whatever material of the condom makes it so that you feel nothing, especially when getting head. You might be able to get away with using a lamb skin one but even then, you still won’t feel it compared to without a condom. \n\nJust suck his dick without the condom, if you’re worried about diseases go get checked before you have sex. Simple fix",
            "score": 1,
            "replies": []
        },
        {
            "author": "gamahouche",
            "body": "Here are a few things that help with this:\n\n* Look for a condom brand that's recommended for oral sex specifically. Sex journalists and sites often run a product roundup for condoms that work well for blow jobs (search the web for e.g. \"best condoms for oral sex\")\n* Consider putting a few drops (or even more) of lubricant \\_inside\\_ the condom. When you're going down on him, a bit of lube inside the condom will help the condom slide back and forth against his skin and strongly improve the sensation.\n* Practice using your hand! Using your hand to stroke his cock while you're sucking it is always a useful trick, but will be extra helpful when he's wearing a condom.\n\nGood luck! This absolutely can be done in a way that feels good for your fella but may take some practice. It sounds like he's receptive and open to trying different things, so hopefully he'll be up for encouraging you to practice!",
            "score": 1,
            "replies": []
        },
        {
            "author": "That-Still",
            "body": "I don't love sucking on latex, but if you're giving a BJ to someone you just met, it definitely is a good thing to request. You can get throat infections, and in extreme cases throat cancer from sexually transmitted diseases.\n\nIf you're feeling friction... You need more lubricant. Weather it be your spit (since your mouth is already there) or some... Flavoured lubricant or something if you want more?",
            "score": 1,
            "replies": [
                {
                    "author": "cgw22",
                    "body": "Isn’t the HPV vaccine supposed to prevent throat cancer?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "surfershane25",
                            "body": "It doesn’t protect against all types and no vaccine is 100% effective to my knowledge, it’s wayyyy better than not being vaccinated but it’s also not a perfect preventative measure.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pencopolitano",
            "body": "maybe take care of his balls, that could help",
            "score": 1,
            "replies": []
        },
        {
            "author": "tbe37",
            "body": "Use lube & stroke the shaft/head while performing oral on the balls/taint. Not great but the best I got.",
            "score": 1,
            "replies": [
                {
                    "author": "AngieBellaRose",
                    "body": "But is that sort of oral activity STI safe?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "randomgrrl700",
            "body": "Change the game -- don't think of it as a sub-par blowjob because of the condom; think of it as a great blowjob for a latex fetish.\n\nColoured condom to play into the visual. Put it on with your mouth. Get some flavoured lube to mask the latex smell/taste, take a big swig before and then go to town with the sloppy BJ.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cratersag",
            "body": "Tickle balls. Finger in bum",
            "score": 1,
            "replies": []
        },
        {
            "author": "Senior_Type_4056",
            "body": "There are condoms which have flavored lube. My girlfriend really liked the strawberry flavor, but now she just prefers the cum flavor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Hi there /u/AngieBellaRose\n\nTo keep nefarious behaviour at bay, we are saving the contents of your post here\nso that it can always be retrieved by the moderator team after a post has been\nedited or deleted by the posting user.\n\nPost title: How do you actually make a BJ with protection *feel good*?\n\n***\n\n\nSo last night I went out with a guy I just started dating and he said he wanted a BJ. Since I just met the guy, I thought it would be best to ask him to wear a condom.\n\nHe was nice about it but honestly it wasn't great for either of us... it was very uncomfortable for me, mostly cause there was a lot of... friction. And I don't think it was great for him. \n\nHe's older than me and he was nice about it but I got the sense that a more experienced woman would've done better.\n\nAnyway, I want to be safe but I wanna make sure l'm still good at it, you know? Any tips, tricks, or tools to make it better for both of us?\n\nI saw a post elsewhere about the right condoms to use but the thing is that the guy is the one that provided the condom. Not me. So barring that, what else can I do?\n\nCurious what actually works, especially from people who have real experience. Thanks!\n\n***\n\n*AutoSaver v1.0*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}