{
    "title": "Thinking about hiring an escort",
    "author": "AntiqueHeron7088",
    "subreddit": "sex",
    "rank": 18,
    "score": 2,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/sex/comments/1jekf5n/thinking_about_hiring_an_escort/",
    "id": "1jekf5n",
    "selftext": "Posting from an alt account for various reasons. And I apologize if this is not appropriate for this sub (I did read the rules and this does not appear to violate them). If you have suggestions for a better sub, please let me know. \n\n47M here. Married 21 years, but my wife (46F) and I agreed we need to separate about a year ago. We still live together because we have 2 kids and because housing is too expensive for us to afford two separate places. We get along fine, but the intimate and sexual part of our relationship is done. \n\nI have not had sex in 3 years and I’m getting to the point where it’s making me crazy. I have considered having an affair. But I work remotely, and after work and on the weekends I’m busy with family and home stuff so I don’t really have the opportunity to be out and about all that much. And even if I could get out more, I think I’m too awkward and plain to attract a woman, and even if I could, I would have no idea how to navigate the weird limbo state my marriage is in. \n\nSo, as the headline says, I’m thinking of seeing an escort. I have questions for those of you who have done this. \n\n1. How did you feel after you were with the escort? Did you feel satisfied? Relieved? Sad? Something else?\n\n2. During your time with the escort, did you ever feel like you were degrading them, or did it feel enthusiastic and consensual?\n\n3. Did you feel that you got “addicted” to seeing escorts, or did the experience scratch your itch?\n\n4. How did you minimize risk? I’m not worried about my wife finding out. More that I’ll get arrested. I’ve been on Tryst and Eros and The Erotic Review, and it seems like pursuing an escort who presents as more “high quality” and doing my research before booking is a big part of managing risk.\n\nThank you very much for reading and again I’m sorry if this is not the appropriate place for this. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thank you for posting in the r/Sex community. To ensure that everyone respects our safe space, we ask that you familiarize yourself with our Forum Rules and Posting Guidelines — which are visible in the forum’s sidebar, and also linked [here](https://www.reddit.com/r/sex/about/rules/).\n\n***\n\nRestricted subjects in r/sex include sex stories (which are permitted in the Weekly Sexual Achievement Thread only), body image and penis-size issues, hookup attempts, common topics which are considered repetitive in our forum, and requests for private chats.\n\nTo cut back on comments that add little value to the conversation, we have instituted a minimum character requirement that will silently remove comments that fall below it.\n\n***\n\nAny attempt to seek private chat or otherwise deviate a conversation away from the main forum, WILL result in a permanent ban. This goes both for OP and for all comments. Guide for blocking DMs can be found [here](https://www.reddit.com/r/sex/wiki/rules/#wiki_blocking_dms_when_making_a_new_post).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Boatjumble",
            "body": "I read as post a while back about this guy that didn't want wife or kids or girlfriend and instead saw an escort once a month. \n\nI think he said it's been about 8 years of him seeing the same girl every month.\n\nThey're super close now, enjoy each others company and it's still very transactional with no expectation for anything else.\n\nWorks for him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible-Pain-444",
            "body": "I have never hired an escort, but I have 2 thoughts. \n\n1. How is it an affair if you have agreed to separate? Have you explicitly said you are not in a romantic/monogamous relationship anymore? If yes, this is not an affair. If you haven't spoke about ending the romantic relationship and sleeping with others, you need to do that first. \n\n2. I knew a guy who grew up with certain cultural expectations around relationships which he felt he could not meet. So he did not date or seek a gf. So he went to a sex worker regularly- always the same woman. Once a month or so i think. \n\nHe spoke about her with a kind of affectionate respect, without being romantic or too personal. Kind of like the vibe you'd have with a really good mechanic or hairdresser you've been going to for years. Respect for the trade and skill, some kind of personal relationship, a friendliness, while also recognising you're paying for a service that they're good at. It takes time to develop that rapport I guess, but the intent of professional respect can be there from the start. \n\nA risk of arrest is a whole different thing and a different risk to manage depending on your legal context.",
            "score": 1,
            "replies": [
                {
                    "author": "AntiqueHeron7088",
                    "body": "1 - Good question…I guess it would only be an affair in a technical sense, since we are still legally married. When we first talked about it, my wife said she was interested in a co-worker romantically, and I told her I’d have no problem with her pursuing him. We didn’t explicitly talk about me pursuing other women, but I suspect she’d be OK with it. \n\n2 - This is an interesting perspective. I have often doubted that I am truly capable of maintaining a healthy romantic relationship. I definitely have my shortcomings, which is why I am where I am. Maybe I should consider this kind of arrangement for myself. \n\nThank you for the thoughtful response.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "reluctantdonkey",
            "body": "There are a fair number of posts if you search the sub from people who have hired escorts, and the net seems to be, \"Meh, not super worth it.\"\n\nSex is more than just a hole with a heartbeat to put a dick in. (And, I don't mean that in a puritanical, emotional-connection way. I just mean in it in a chemistry-- probably with a sideslice of being wanted and validated for more than having the appropriate amount of cash-- way.)\n\nAlso, you're pretty unlikely to get arrested (at least, if in the US and both people are consenting and you aren't picking trafficked people up off a street corner where there might be a sting that goes FAR higher than whatever you and an autonomous, consenting human decide to do. Also-- good evidence SHE'D be in more of a mess than you.)",
            "score": 1,
            "replies": [
                {
                    "author": "AntiqueHeron7088",
                    "body": "Thanks for the response. Part of my hesitancy to do it revolves around chemistry. I have never had a one night stand and have only been with 3 women in my life so I’m not 100% sure I could even perform. A big part of what I miss about sex is kissing, touching, and physical closeness. It’s not just about the sex act. And I’m not sure how much (if any) of that intimacy I would get from this kind of interaction.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Hi there /u/AntiqueHeron7088\n\nTo keep nefarious behaviour at bay, we are saving the contents of your post here\nso that it can always be retrieved by the moderator team after a post has been\nedited or deleted by the posting user.\n\nPost title: Thinking about hiring an escort\n\n***\n\nPosting from an alt account for various reasons. And I apologize if this is not appropriate for this sub (I did read the rules and this does not appear to violate them). If you have suggestions for a better sub, please let me know. \n\n47M here. Married 21 years, but my wife (46F) and I agreed we need to separate about a year ago. We still live together because we have 2 kids and because housing is too expensive for us to afford two separate places. We get along fine, but the intimate and sexual part of our relationship is done. \n\nI have not had sex in 3 years and I’m getting to the point where it’s making me crazy. I have considered having an affair. But I work remotely, and after work and on the weekends I’m busy with family and home stuff so I don’t really have the opportunity to be out and about all that much. And even if I could get out more, I think I’m too awkward and plain to attract a woman, and even if I could, I would have no idea how to navigate the weird limbo state my marriage is in. \n\nSo, as the headline says, I’m thinking of seeing an escort. I have questions for those of you who have done this. \n\n1. How did you feel after you were with the escort? Did you feel satisfied? Relieved? Sad? Something else?\n\n2. During your time with the escort, did you ever feel like you were degrading them, or did it feel enthusiastic and consensual?\n\n3. Did you feel that you got “addicted” to seeing escorts, or did the experience scratch your itch?\n\n4. How did you minimize risk? I’m not worried about my wife finding out. More that I’ll get arrested. I’ve been on Tryst and Eros and The Erotic Review, and it seems like pursuing an escort who presents as more “high quality” and doing my research before booking is a big part of managing risk.\n\nThank you very much for reading and again I’m sorry if this is not the appropriate place for this. \n\n***\n\n*AutoSaver v1.0*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}