{
    "title": "How can NATO be improved and strengthened?",
    "author": "_SilentGhost_10237",
    "subreddit": "PoliticalDiscussion",
    "rank": 55,
    "score": 7,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1if85r2/how_can_nato_be_improved_and_strengthened/",
    "id": "1if85r2",
    "selftext": "What can the U.S. and other NATO countries do to make the alliance more united and stronger? Many politicians from various NATO countries criticize the alliance, arguing that some member countries bear more responsibility than others and that NATO’s role has become less relevant since the Cold War. For example, Trump criticizes NATO for placing a disproportionate financial burden on the U.S., claiming that many member states fail to meet their defense spending commitments. How can NATO countries work together to address these criticisms? Do you believe NATO is less relevant today than it was in the 20th century? What steps should be taken to strengthen the alliance?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "KoldPurchase",
            "body": "I share the feelings of u/rantingathome about the US.\n\n  \nOther NATO allies need to prepare for war with a strengthened Russia.  The economic sanctions are about to fall, Europe is not as united as it should be.\n\nWe need to invest more in our military, and to do that, we need to strengthen our economic bonds.  Military and economic alliances have often gone hand in hand in the past.\n\nMore investments in military hardware to counter Russia and China, more joint training to better our troops synergy.  We must learn to fight more as one than a bunch a separate allies.  Sharing information, using similar equipment so we can resupply one another, increasing industrial output, etc.\n\n  \nThe US has become a very aggressive nation, similar to Russia, and nearly half the population love the direction their country is taking toward fascism.\n\n  \nUS will be out of the international trade circuits and will be out of NATO within 2 years.  It is something we have to learn to live with.  \n\n\n\nWe relied way too much on the US for military firepower and handled auxiliary tasks, it's time to wake up.  The way it's going, there is going to be a surplus military hardware sale soon as the US goes broke anyway.",
            "score": 8,
            "replies": [
                {
                    "author": "Dietmeister",
                    "body": "Does the non US part of NATO even need to think about China at this point?\n\nWith what is China ever going to reach us and we them? We're no threat to eachother I think. \n\nRussia is the main thing. Manpower wise and airpower wise were strong enough. Now we need to anti air, missile shield, command structure, intelligence, enablers and other fancy stuff the US has loads of and we don't.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KoldPurchase",
                            "body": ">Does the non US part of NATO even need to think about China at this point?\n\nTaiwan and the rest of Asia are under thread, including Australia.\n\nIndia is also threatened by China.\n\nA strong China would be a very destabilizing force for the Occident.  Especially if the invade and annex Taiwan, the supplier of our advanced chips.\n\nThe US understood that before Trump.  It understood that a stable world meant access for their business to do commerce, both ways.  Nvidia, Intel, AMD (among others) buying a chip made in Taiwan and selling the end product in the US and worldwide for profits taxed in the US, with money transiting through the US banking system and financial exchanges being done in US currencies.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Dietmeister",
                                    "body": "Yes I understand all that but if we look at all possible threats I think Asia is just too far and too big for euros to take on. \n\nRussia is a must to counter, us might be an adversary. Well have to let China go man. Its mainly the USs problem",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "KoldPurchase",
                                            "body": "The problem I see is we all don't really have a choice.\n\nHow can we collectively take on Russia if we don't have access to high tech equipment?\n\nWe kinda depend on Australia, India and a number of Asian countries for raw resources too.  If these are threatened by China, we are in trouble.\n\nThe US was a force to reckon with in the Pacific during WWII against Japan, but we can't count of them.  And it's very likely that the next conflict will involve China and/or North Korea along with Russia.\n\nIdeally, we should all attack Russia now to take them out while we still can, before the US turn fully hostile on us.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bl1y",
                            "body": "China already controls Europe's largest port on the Mediterranean.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Princeps_Aurelianus",
            "body": "Given what’s transpired in the last two weeks, NATO will likely either become more Euro-centric or give way to calls for a unified European Army. France is certainly seeing the opportunity from Trump’s continued antagonizing of traditional U.S. allies when it offered the deployment of EU troops to Greenland as a show of strength against Trump.\n\nI don’t think NATO is any less relevant today, but it’s unfortunate that the risk of it tearing apart exists due to the current administration’s actions. The “disproportionate financial burden” is definitely overblown by politicians seeking to depict NATO as a waste of time and money. Only 8 countries remain below the 2% expenditure level but they’re all increasing closer to that requirement as of 2024. Not many people talk about the 20% equipment expenditure requirement where only two members have yet to reach that guideline but are inching closer to that as well. As it pertains to direct funding, Germany pays the same amount into NATO as the United States does.\n\nFor Europe (and especially France), this presents as the time to push away reliance on the U.S. and towards strengthening common defense under the EU.",
            "score": 5,
            "replies": []
        },
        {
            "author": "rantingathome",
            "body": "The USA can't do a damn thing now. Their President just completely dismantled over a century of mutual trust and cooperation. It doesn't even matter if he actually leaves on schedule in 2028, he's actively threatening their closest ally's sovereignty. Nobody in Canada is going to trust the United States anywhere near as much as we did just a decade ago, and anyone else looking at what he is doing and not heeding the warnings that the USA is not a stable partner is not accepting reality.\n\n13 days. He destroyed over a century of work in 13 f\\*\\*\\*ing days.",
            "score": 17,
            "replies": [
                {
                    "author": "Knowledge_is_Bliss",
                    "body": "He'll pull out of NATO within a year. Straight up. So long allies. Sad but true.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Lantis28",
                            "body": "He can’t legally, he needs a 2/3 of each house of congress to do it. Not that that will stop him but still",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Knowledge_is_Bliss",
                                    "body": "Who's going to stop him?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Lantis28",
                                            "body": "The courts right now",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kman17",
                    "body": "NATO was designed to contain the USSR, and it largely accomplished that mission on December 6th, 1991.\n\nWhat is its primary purpose today, and what has it accomplished since?\n\nHonest question, this isn’t a gotcha.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "theequallyunique",
                            "body": "Nowadays the missions focus on regional security and counter terrorism, you may look up full lists online. Basically every standing army only exists to protect trade routes so that resources reliably reach the main land, Nato is no exception. That goes from training soldiers in oil rich countries to fighting piracy. There was a time when companies like the British east India company had larger armies than governments, but politicians didn't like this risk of being chanceless against them, so they decided it would be best if the states are the ones protecting their national capitalists interests at the cost of the tax payers. Win-win.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "JohnObiMikel12",
                            "body": "NATO was designed to defend its member states, which in 1949 had the USSR as their main threat, but not only. This Europe literally right after WWII, and only thirty years after WWI. There was very little trust in many directions. Particularly, smaller states with German occupations fresh in their memory, such as founding members like Denmark, Belgium, Norway, and the Netherlands, were determined that war should never occur again. That required allies and agreements.\n\nNATO still deters attacks on member states. There is a reason why Ukraine is fighting a war, and the Baltic states are not. Immediately after the Cold War, the first response from the newly freed Eastern European countries was to push for NATO membership, despite the USSR not existing anymore.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Kman17",
                                    "body": "> NATO still deters attacks on member states\n\nYou mean the United States deters attacks on European nations?\n\nWhy couldn’t the European Union accomplish this goal now?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "JohnObiMikel12",
                                            "body": "\"You mean the United States deters attacks on European nations?\"\nThe US is by far the most important. And Europe should get its shit together. Europe cannot rely on swing voters in Michigan to bail them out every four years. \n\n\"Why couldn’t the European Union accomplish this goal now?\"\nThis would maintain the exact same primary purpose of NATO. Replacing the US entirely would be a difficult shift of burden. But still based on the principle of collective defense.\n\nNATO is still the framework for collective defense though. NATO has military integration and joint exercises, not the EU. The second largest military expenditures in Europe are from the UK, who are not even a part of the EU. The EU is for now, not a military alliance, but an economic alliance. \n\nIt is perfectly reasonable that the burden shifts towards Europe. But it is also in interests of both Europe and the US to maintain NATO. Whether the US likes it or not, they have massive interests on the continent. Both economic and political. Without European allies, all US efforts globally become more complicated. \n\nNATOs collective defense article has also only been triggered once, to support the US after 9/11 in Afghanistan. If the US-Europe relationship is a neutral one, instead of being close allies, US foreign policy objectives becomes more difficult. An example would be american efforts to contain China, which becomes way more complicated if the US cannot rely on the Europeans anymore.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Kman17",
                                                    "body": "> It is perfectly reasonable that the burden shifts towards Europe. But it is also in interests of both Europe and the US to maintain NATO.\n\nThe purpose of NATO is primarily European defense.\n\nThere is no incentive whatsoever for Europe to assume the cost and responsibility for this shift if it can get it for free from effective US subsidization.\n\n>  Whether the US likes it or not, they have massive interests on the continent\n\nThose interests are decresing though. Europe is not really keeping pace economically.\n\nThe center of the world is moving towards Asia.\n\nThe opprotunity areas for the US are more there and Latin America.\n\n> NATOs collective defense article has also only been triggered once, to support the US after 9/11 in Afghanistan. \n\nThis result in some support from some allies, but the level of that support varied quite a bit.\n\nThe US is 55% of the GDP of the NATO alliance. The rest of the NATO alliance contributed far less than 45% of the cost and support of the Afghan war.\n\nThat is not to detract from those that went above and beyond (UK, Canada notably) but as a whole mainlaned Europe continues to not contribute equally relative to its ability and obligation.\n\n> Without European allies, all US efforts globally become more complicated.\n\nWhy? The combined EU is responsible for about as much global trade with the US as Canada or Mexico are individually. \n\nAsia - Pacific accounts for quite a bit more these days.\n\n> US foreign policy objectives becomes more difficult\n\nWhy do you believe that? What do you think US foreign policy objectives are? I think they can be categorized as the following:\n\n* Contain Chinese influence, maintain technological superiority\n* Prevevent migrant and smuggling flows from central and south america, though both enforcement and investment in partners in those countries\n* Support high opprotunity largely in the Pacific, in service of the frist goal. Tiawan, South Korea, Japan, the Philipenes, Singapore.\n* Similar comment for democracies and countries moving *in the right direction* as it relates to global trade (shipping lanes, energy, etc). This would be inclusive of Israel, support of the UAE / Qatar / Saudi slow moves towards modernization and the west\n* De-risk terrorism and instability threats against the US and its assets & allies, many if not most of which are proxy agents of Iran\n* Contain Russian aggression\n* Address sustainability (population growth, pollution) in the developing world\n* Lower aggregate burden on the US in maintaining the world order\n\nOf those, Russian aggression is primarily a threat to Europe only.\n\nEurope is a non-actor in the majority of those threads. Them not pulling their weight on initiatives they should be leaders on is a drag on overall foreign policy goals of the US.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SylvanDsX",
                    "body": "Oh my goodness How dare the president of the United States point out a situation we’re Canada is literally ripping off its neighbors and undercutting their economy for years because the people of Canada would be so offended after they stole many jobs from the US. We should be offended!",
                    "score": 0,
                    "replies": [
                        {
                            "author": "rantingathome",
                            "body": "You pompous ass.\n\nNobody \"stole\" jobs from the USA. The car industry grew up on both sides of the border over more than a century. The only North American oil that can be refined in the mid-west states is the oil from Alberta. Your country built those on purpose, nobody forced you. By the way, we already sell you that oil at a discount... so technically we're subsidizing you.\n\nIf you don't want to buy our stuff, fine, don't buy it. We'll have some economic hardship, but we'll get over it.\n\nYour criminal President tried to extort us, because being a fucking mobster is the only way he knows to do things. And then he wouldn't tell us what the hell he wanted. Then he threatened the very existence of our country. If someone threatened the USA the way Trump threatened us, that someone would die a horrible and fiery death... you've bombed people for less.\n\nBut whatever. It appears your country is about to go through something pretty ugly. Good luck. A few weeks ago we would have been pulling for you... now not so much.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SurinamPam",
            "body": "Well, after seeing the unprovoked tariff war that the US has started, I’m sure that it has made Is allies re-evaluate their defense reliance on the US. \n\nMy guess is that they will move to beef up their own militaries and evaluate strategies assuming the US cannot be relied upon.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Factory-town",
            "body": "**The most important thing on Earth is to abolish nuclear weapons before nuclear annihilation happens.** NATO and US militarism are completely intertwined and both heavily depend on the US nuclear arsenal. The way that NATO can be improved and strengthened is for it to abolish nuclear weapons. There are no good arguments against my position.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SylvanDsX",
            "body": "I think you are getting ahead of yourself here, Trumps global shake down is just starting and we will 100% be considering leaving nato",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kman17",
            "body": "I think the short answer is just Europe needs to step up. \n\nThe U.S. has, rightly, become frustrated that it continues to bear the load of the alliance - particularly on Europe’s border while the U.S. needs to put more energy into Asia.\n\nThe Ukraine war is the perfect example. The U.S. jumped to Ukraine’s aid immediately; it deployed a ton of military resources.\n\nEurope otoh deliberated and waited 6 months before committing to the conflict, as it first worked to not irk Russia and disrupt its energy supply. Its support has also been primarily financial aid; still disproportionately less military.\n\nThe EU hasn’t taken a leadership position at all; Biden being left holding the bag is one of N reasons that contributed to his defeat.\n\nThe EU finger waving at Israel is similarly unhelpful.\n\nObviously the US has reached the point of frustration, and so the ball is in Europe’s court to step up.",
            "score": -1,
            "replies": [
                {
                    "author": "theequallyunique",
                    "body": "That's just some nonsense honestly, European countries combined spent more than the US and also delivered tons of weapons. [Statista source ](https://www.statista.com/statistics/1303432/total-bilateral-aid-to-ukraine/?__sso_cookie_checker=failed). It only took so long as eu countries wanted to coordinate with the US first to not rush anything on their own, which 100% makes sense. \n\nYet I agree that the EU and other countries are overly dependent on US military, but there has not been much need for investing more. It's been the US geopolitical strategy since ww2 - they deliver military protection, in return the partners swear allegiance and do business only with the US and its allies.\n\nMeanwhile the USA massively overspent on their military, making competition pointless for a long time, but China is catching up. One might say that the US started the arms race by insisting on global dominance instead of power balance.\nBtw most Nato countries fulfill their spending quotas since the Ukraine invasion, but Trump felt like raising his request from 2 to 5% GdP randomly.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "coffeewalnut05",
            "body": "I don’t think NATO is less relevant now than during the Cold War at all. If anything, it’s more relevant. NATO has shown proactiveness: it has increased deterrence on the eastern flank in the wake of the Ukraine invasion; displayed a robust, coordinated approach to supporting Ukraine which has enabled that country to survive whilst maintaining stability in Europe; most members have increased their defence spending and are revamping their militaries; and added added two new allies (Finland, Sweden) with rich defence traditions of their own.\n\nNATO can be further improved by mako and continued investments in European militaries, leveraging each country’s unique geopolitical situation and traditional strengths. For example Finland has a talent in Arctic warfare and activating a total defence model. The U.K., being an island with a hi-tech society, could specialise in cyber, air and naval defence. Poland could continue building defence lines and a large land army to deter ground invasions. Turkey, with its long tradition of conscription and self-confidence as a key geopolitical player, could contribute troops and other capabilities to Eastern Europe. \n\nEurope also needs to invest in European weapons manufacturing. That’s a big weakness that can be worked on. It can also improve transport and logistics across the continent to ensure mobility during times of crisis.  \n\nThere’s already work underway to accomplish all this, and more is to be done.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Charm_quark2",
            "body": "To improve and strengthen NATO? In what function, in what purpose? \n\n\"...NATO, from its origins, was never primarily concerned with aggregating military power. Fielding 100 divisions at its Cold War height, a small fraction of Warsaw Pact manpower, the organization could not be counted on to repel a Soviet invasion and even the continent’s nuclear weapons were under Washington’s control. Rather, it set out to bind Western Europe to a far vaster project of a U.S.-led world order, in which American protection served as a lever to obtain concessions on other issues, like trade and monetary policy. In that mission, it has proved remarkably successful.\" \n\nhttps://archive.ph/2023.07.26-171812/https://www.nytimes.com/2023/07/11/opinion/nato-summit-vilnius-europe.html\n\nPeople posting here are so deeply indoctrinated into the fairytale of Western alliance as a bulwark against the outside Evil, that their understanding of history and reality is on par with that of Trump's. \n\nhttps://americandiplomacy.web.unc.edu/2024/02/the-christmas-gift-that-keeps-giving/",
            "score": 0,
            "replies": []
        },
        {
            "author": "Lauchiger-lachs",
            "body": "My question to your question is: Where do you see the problems?\n\nYou name claims that financing NATO would be unfair. I would say that it is not about the financing, but about the use of the finances of any country for military, because some allies are not really into peace, for example Turkey and the US in the past. What if Erdogan said that Turkey was attacked by terrorists (kurds for example). Should we actually listen to him and help him in defense? Because the kurds are no terrorists for sure, they established a democratic autonomous region in nothern Syria and south-east turkey, where they also imprisioned many actual islamic terrorists from the war in Syria.\n\nMy claim would be that the main problem of NATO and NATO countrys is their hypocracy. What is NATO and the NATO countrys fighting for? You might say human rights, and this is what it should be, but we are far away from that, because it is in the nature of NATO to be reactionary. As long as Trump threats to invade another country (maybe even a NATO country) or threats to use tariffs against his allies NATO will be dead. In conclusion we need a new NATO, but I can tell you right now, that the US wont withdraw from supporting terrorist Israel (I thought a long time if I could call it this way, and yes, just look into the west bank and listen to smotrich and ben gvir) or terrorist Turkey, or terrorists in general that could become threats one day (greetings from Osama Bin Laden). You know NATO should be defensive, but this means that the countrys who belong to the NATO have to ask themselves twice if they should participate in a war in any ways, or if they should tell the party they are supporting \"you may go this far, but not further unless you want us end our support\".\n\nI also would not like to see a WW3 if Putin invaded another NATO country, for example the baltics (he already uses sabotage through his secret service GRU in Europe as a whole).\n\nBut these problems lead to the main problem: Why would you invest in a TO, when you are not sure wether the other countrys invest as well and stay cool in hard times, acting an ethically good way? You cant.\n\nI claim that NATO and Trump would not have to worry about defensive spendings if they had an ethical codex that prohibits countrys from supporting wars you cant support as a good person. NATO-countrys have to stop their striving for power before becoming actual defenders of a morally good world, because othervise you support a world that is not necesarilly as morally good as you might like. This is also the reason why many European people want to establish an european defense. They can rely on each other more or less, while Trump imposes threats to them. They can trust each other. In my opinion supporting NATO is not smart. It missed reforms for a long time and is braindead; Somehow alive, only physically, but not mentally. Maybe it is too late and we need something new. A TO that helps not only in a war, but also in a conflict where GRU uses sabotage of IT safety, safety for infrastructure..... War is a lot more multidimensional, and fighting war means making sure that there is no way to prepare it with sabotage. A strong military and many bombs might be necesarry as a second step if step one does not work (for defending \"friendly countrys\" as long as they are friendly, like Ukraine and in some parts Israel, and if necesarry also the European territory). Europe might have to increase the investments in security, but as I said: NATO is way too braindead to just pump money in its existence, a european defense strategy (so not only money for weapons, but also safe infrastructure) is much more efficient and reasonable.\n\nBut saying: \"Mimimi country X does not spend enough\" is way too undercomplex and does not adress fundamental problems NATO has no answer to. It is not too late to transfer the organs of the braindead body to a new, healthy and useful body.",
            "score": 0,
            "replies": []
        }
    ]
}