{
    "title": "Have Democrats Given Up On Men?",
    "author": "DramaticErraticism",
    "subreddit": "PoliticalDiscussion",
    "rank": 58,
    "score": 0,
    "upvote_ratio": 0.48,
    "num_comments (reported by reddit)": 152,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1ifhlj1/have_democrats_given_up_on_men/",
    "id": "1ifhlj1",
    "selftext": "I was pondering over the results of this election and wondering why so many young men are voting for the conservative party these days.\n\nI came across this article from 2024 and it really made me think Have Democrats Given Up on Men? - The Survey Center on American Life https://www.americansurveycenter.org/newsletter/have-democrats-given-up-on-men/\n\nWhen you look at the Democratic Party home page for 'Who They Serve', they include Women specifically and exclude Men, outside of certain groupings that include them.\n\ndemocrats.org/who-we-are/who-we-serve/\n\nI'm curious what people have to say on this topic and will save my personal opinions for the comment section. Is it a wise thing for Democrats to bank on the morality of a large portion of the population rather than showing direct support, to gain votes?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ramsoid",
            "body": "I feel like the Democrats have lost sight of the average American and are too focused on niche groups. I'm not saying that these groups aren't often forgotten and don't need attention at times, but I do think that as Americans, we all have a tendency to push things to the extreme, even inclusivity. Pushing too far left can alienate people in the middle just as much as pushing too far right.",
            "score": 8,
            "replies": [
                {
                    "author": "lithium256",
                    "body": "Democrats pander to voters who were gonna vote for them anyway. It's the dumbest political strategy of all time.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "illegalmorality",
                    "body": "Every demograph has its own unique issues that they're facing, and there's a lot of negligence on white American issues, such as mental health and suicide rates. Culture is shifting and democrats have done little to address these new social realities.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Foolgazi",
            "body": "Funny, the first time I saw this cooypasta propaganda was way before the election. Looks like someone forgot to update this particular trollbot.\n\nAnyway, this issue has been hashed out 6 ways from Sunday, including the assertions made in the article linked.",
            "score": 43,
            "replies": [
                {
                    "author": "rzelln",
                    "body": "I'm a man. I think that, considering we exist in an imperfect society where the influence of capital makes it hard to enact the best solutions since even though those would help tons of people, they'd cost the elites a small bit of their extreme wealth, the Democrats have policies that would make things significantly better, including for men. \n\n\nThe GOP policies wouldn't. \n\n\nSo they lie and use misleading framing to make people feel resentment of Dems even though the plans of the GOP will hurt people, including men.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Foolgazi",
                            "body": "Manosphere “influencers” are a big part of why Trump won a larger proportion of young men than Biden.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DramaticErraticism",
                    "body": "I'd like to see that copy pasta, as this was an idea I had myself, Googled the article and posted the information here.\n\nThis is not a troll post, if you look at my post history, most of it is about general life, not political angles/debates. \n\nI'm genuinely curious what thoughts people have. \n\nIf it has been hashed six ways from Sunday, what are some of those arguments, as it does not appear self-evident...to me, anyway.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "IfTheG1oveDontFit",
            "body": "Hilarious that you get downvoted and people just refuse to respond to your question. Is this not a forum for political discussion? Even if you disagree with OP maybe give a valid response to your question instead of just plugging your ears.",
            "score": 3,
            "replies": [
                {
                    "author": "DramaticErraticism",
                    "body": "From the reactions, people just hate the question. I think everyone knows that Democrats have failed to pull in new voters and that they need to change...but there is a strong push against doing anything for men, as many men and women think Patriarchy = Men. Just shows how far we have to go and how we have many more years of Conservative control left. People would rather see Trump and people like him in charge vs give men any attention or validation.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "IfTheG1oveDontFit",
                            "body": "There's this odd disconnect, where people just don't want to believe they are doing anything wrong, and all the losses are out of their control. Granted that can be true in many cases, but you can and should critique the democrat party even when you want them to succeed.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "theKGS",
            "body": "I don't think so.\n\nThe thing is if you ask these men who argue the Democrats are not for them what it is about the Democrats that these men don't like, they can never point to something concrete. Some particular policy. They will make insinuations, but cannot make any clear statements.\n\nI think it's all just grievance politics.",
            "score": 17,
            "replies": [
                {
                    "author": "anneoftheisland",
                    "body": "> The thing is if you ask these men who argue the Democrats are not for them what it is about the Democrats that these men don't like, they can never point to something concrete.\n\nThe most common response I see to this question is that they'll answer it by saying something that a person who votes for Democrats did, not something that any actual elected official or platform or ad said. Like, [every time this topic comes up on this sub](https://old.reddit.com/r/PoliticalDiscussion/comments/1fcuw3z/what_strategies_can_democrats_employ_to_address/) it's full of \"Well, women on Twitter are saying they choose the bear, which is how the Democrats are alienating men\" non sequiturs. \n\nA person who votes for the party is not the party. Parties in the US contain tens of millions of voters; they are inevitably going to contain voters who say things that alienate you. But a random 23-year-old on Twitter saying she chooses the bear is not the same thing as Kamala Harris saying she chooses the bear. If the standard you're operating by is that any voter of the party saying anything annoying can alienate you from the party, then the logical endgame of that stance is you aren't going to be able to vote for anybody.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Trump4Prison-2024",
                    "body": "Yes, I know it's anecdotal, but here is one of my experiences at a late September campaign event for a Democratic candidate:\n\nI am a straight white man, and have always supported leftist politics.  I went to a campaign event with the intention of making the maximum donation I could for the candidate (a woman).  When I got there, there was a giant banner that said \"The Future Is Female\", which I found a little off putting, but it wasn't a dealbreaker, we see this kind of female-empowerment-at-the-expense-of-men rhetoric a lot in the party, which always kind of bugged me.\n\nDuring a part of the event where nobody was speaking and everyone was just socializing, a campaign manager came over to my table and was schmoozing with several of the ladies sitting near me, and it seemed to me that she was actively avoiding making eye contact with or even acknowledging the men in our party.  Several men even asked her questions directly or tried to involve themselves in the conversation, and were completely ignored outright.  Then, she dropped the line \"I just love that the Democratic Party is a place that everyone gets an equal voice, regardless of race, gender, economic background, or sexual orientation!  Except straight white men, they can go fuck themselves!\", to which another staffer, right on cue, chimed in and said \"And you just KNOOOOOOW they will!\"  This got a round of snaps and \"Yass Qween\"'s from other ladies nearby, to which point I got up and left without making my donation, along with 4 other men that were nearby, and we wound up chatting outside the venue about how rude that was and how I was probably going to leave that one blank on my ballot now.\n\n  \nThat candidate lost by only 2449 votes.  Makes me wonder how many of those 2448 other ones would have voted for her had her campaign not outright insulted them to their faces.\n\n  \nThis is the problem with the Democratic party, especially with younger male voters.  It's not necessarily specific policies that they are pushing, but more about the general vibe (which is what young voters care far more about than policy).  The dems haven't done anything to even acknowledge men's issues, and are far more likely to tell men, even their own male supporters, that they ARE the issue, even if they haven't done anything wrong at all.  Even if they have consistently come out to support the left, they're constantly under fire in left leaning spaces as absolute monsters that need to atone for the crimes of people that are only connected by the fact that both have a dick.\n\nIf pretty much any of the things regularly said about men on the left were said about ANY other group, the speaker would be raked over, cancelled, humiliated, and doxxed.  But for some reason, it's perfectly fine to spew blatant misandry, and most likely it is celebrated and cheered.\n\nSo yes, Dems have not only given up on men, they have made them their boogieman to blame everything on.  It's openly sexist, and the right isn't stupid because they saw this and gave some basic lip service, and won over, oh, i dunno, about 3%... which was all they needed to win.  With margins this tight, it was the absolute stupidest move they could have made.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "rzelln",
                            "body": "I'm a Democrat and a white man. What you describe would not have bothered me. I mean, I'd have to hear tone and see context, but when I witness my friends talk shit about 'white men,' I assume they don't mean me because what they're actually complaining about is white supremacy and the patriarchy, and I oppose those too. \n\n\nYeah, there's probably some nutsos who are genuinely misandrists, but most of the time I read those sorts of comments as venting about shitty people. As I am not a shitty person - and indeed I feel empathy for the folks who have to deal with shitty misogynist bigots - why would I think their comments indicate they dislike me? \n\n\nAnd if it bothers you, mention it to a woman you have a good rapport with. See if she can serve as an ambassador to her peers to encourage them to be more inclusive in their language.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Waterwoo",
                                    "body": "Honestly I don't understand how anyone could have so little self respect to not be bothered by this, if it is true\n\n>  Then, she dropped the line \"I just love that the Democratic Party is a place that everyone gets an equal voice, regardless of race, gender, economic background, or sexual orientation! Except straight white men, they can go fuck themselves!\", to which another staffer, right on cue, chimed in and said \"And you just KNOOOOOOW they will!\" This got a round of snaps and \"Yass Qween\"'s from other ladies nearby\n\nNo, no amount of considering tone and context makes that ok. You can take it if you want but the vast majority of straight men won't put up with that, rightly so.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "rzelln",
                                            "body": "I'm not in need of validation, I guess?\n\nI've heard people say, \"Nerds are gross and never shower,\" and I've been playing RPGs since 1989, but I shower, and I'm not gross. I can read between the lines to understand that they're using broad language to critique a flaw they see as somewhat prevalent among nerds, but they're not actually hating on all nerds.\n\nYeah, maybe the lack of showering by a few nerds has soured people toward all nerds. In which case, it would behoove me not to get defensive at the critique, but instead to work within my social circle to encourage folks to shower so folks would stop having the unkind impression of nerds.\n\nPeople bluster and exaggerate and go with vibes over nuance. It's just the human experience.\n\nAnd importantly, like, what's the worst that'll happen? The stuff people complain about 'white men' over are things like sexual assault and using political influence to ensure resources go to those who are already prosperous rather than helping whole communities in need. Like, it really hurts people. Do you think men are in danger from women? That white people are in danger from non-white folks?\n\nThe goal is equal treatment in society and under the law. You really ought to cheer that on, and be a hero by aiding the movement. By getting upset, I dunno man, you sound kinda pissy and weak. Which I imagine is the exact opposite of how the average man wants to feel about himself.\n\nNick Offerman is not a soy boy. He's got the respect of tons of women because he respects them. \n\nAndrew Tate might be gym fit, but he's lame and whiny. \n\nI know which man I'd rather aspire to be like.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Waterwoo",
                                                    "body": "There's a difference between not seeking validation, and supporting someone that actively and loudly doesn't like you.\n\nAlso, the rest of what you say is..  not really accurate.  \n\nWorst that can happen? We're already seeing it.  Men are drastically more likely to be homeless and kill themselves, do worse in education at every level from grade 1 through Phds, die younger, etc.  The average man is not doing well, only a small portion of elite men are. The average man IS the community in need, and dems still want to take from them to prioritize other groups. \n\nIt's just just a 'you hurt my feelings with mean words' thing, it's a \"I am a man, and I have a young son, and I have no interest in supporting the party that wants to make his life worse to help every other group.\"",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "rzelln",
                                                            "body": "\\> Worst that can happen? We're already seeing it. Men are drastically more likely to be homeless and kill themselves, do worse in education at every level from grade 1 through Phds, die younger, etc. The average man is not doing well, only a small portion of elite men are. The average man IS the community in need, and dems still want to take from them to prioritize other groups.\n\nThose things **are** bad. But I don't know what reality you've been paying attention to where you think Dems *aren't* trying to provide more services for mental health and to fund better access to education and to - this is key - push back against the somewhat pervasive view that boys and men who aren't doing well are lazy or bad and have brought their plight upon themselves.\n\nI'm trying for a kid right now. Boy or girl, I sure as hell would prefer the sorts of investments Democrats are pushing for and the general framing of social welfare that the left prefers to the \"be tough or die\" vibes the right goes for.\n\nAgain, I don't know the specific individuals from the anecdote of shrill man-hating feminism. But I would imagine that any lefty activist, if you asked them to support more social support for men's physical and mental health and men's education, would be totally on board.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Trump4Prison-2024",
                                    "body": "Sure, it might not bother you, but these margins are so tight that all it takes is 5% of men to take it personally and the election is lost. As we saw in November. Why encourage a losing strategy instead of calling it out? Isn't calling sexist, hateful, generalizing language and behavior out a democratic value? Or does that only work in one direction?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "BluesSuedeClues",
                                            "body": "Yes. Calling out \"sexist, hateful, generalizing language and behavior\" should certainly be objected to and seen as a \"democratic value\". At the same time, should empowering language for women be verboten because of \"5% of men\" who are reactionary assclowns about it?\n\nWe're bumping into the line between being aspirational and morally righteous, and what is effective in real world politics. Today's Republican party is a warning of what can happen when prioritizing winning over ethics goes too far.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Trump4Prison-2024",
                                                    "body": "I guess I just fail to see how language that demonizes men is somehow empowering to women, other than on some sort of Mean Girl bullying level. How does a woman dehumanizing men by picking the bear or saying \"Men are trash\" or \"Kill all men\" help their cause at all, other than make them FEEL a little better because they put someone else down?\n\nThe double standard is astounding.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "BluesSuedeClues",
                                                            "body": "I didn't think we were discussing anything as overtly aggressive as \"Men are trash\" or \"Kill all men\". That's a far cry from a banner reading \"The Future is Women\". You seem to be moving goal posts?\n\nThe whole \"picking the bear\" is a very different argument, and one I think men would be wise to stop and listen to. To consider what is actually being said, before jumping to the conclusion that the discussion is hateful or somehow \"dehumanizing\" of men. The anecdote exposes how vulnerable and targeted women in our society feel. It should be a wake up call for men. But in a culture where more than half of women experience sexual violence in their lifetime, maybe not enough men care to do that.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Trump4Prison-2024",
                                                                    "body": "The comment i originally mentioned was \"Straight white men can go fuck themselves\" during a conversation about who has a voice in the Democratic party, in a thread asking why the Dems have lost men. That's pretty close to \"Men are trash\", so I don't know why you would think I'm moving the goal posts... They're still at the same spot. \n\nAnd no, I'm not going to listen to women that choose the bear because they co-opted Nazi language that is offensive and sexist, and I refuse to engage with Nazi language. Just like I would refuse to engage with a man who said misogynistic things, because bigoted statements should never be entertained or encouraged, regardless of who they are against. And you do realize that vast majority of that crime is committed by a tiny sliver of the male population, as well as a tiny sliver of the female population (which almost always goes uncharged and with zero consequences), but most of the women choosing the bear openly state that they would rather blame all men so that they can keep the narrative that men are bad and women are victims? And that in their minds there is nothing that can change that?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Waterwoo",
                                                                            "body": "It seems worse than men are trash honestly.   It seems crazy enough that I have a bit of difficulty even believing that part of the story, but if BlueSuedeClues actually read that part and thinks that's fine and 'empowering' I mean I don't know what to say about it but that's not a normal reaction.\n\nMost men would and should be rightfully put off by that kind of thing. Not voting for a party like that IS the smart rational response.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "theKGS",
                            "body": "What you are pointing out is a campaign issue. Specifically people who are bad at campaigning and networking. That is communication.\n\nWhat I'm after is something else. I want to know what issues these supposed men are having with concrete Democrat policy.\n\nWant to add that I don't vote in the US, I don't live in the US and I'm not a citizen. I'm commenting as a total outsider. I don't even like particularly like the Dems. I just prefer them over the Reps.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Trump4Prison-2024",
                                    "body": "No. I'm talking about the general VIBE of the current democratic party, which, as I said, matters more than policy to young male voters. You asked for a specific example of how the Democrats are actively turning away men. I gave you a specific example. The margins are really tight, within 2% points, so losing even just a handful of Democratic men because of rampant misandrist language in regular party discourse is enough to lose an election. Which I also cited an example of, and said candidate lost by less than 2%.\n\nI'm not a conservative at all, and the Dems are obviously more favorable, which is why I'm screaming about this problem, which lost a not insignificant number of men, especially young men. I'm shouting this not because I \"hate the Dems\" or that i'm secretly a trumper as so many people on here accuse me of, but because I want the Dems to knock off the identity politics bullshit, take a goddamn good look in the mirror, actually reflect on the shitty, sexist behavior going on ALL OVER the party, stop doing those things, and get back to actually winning elections. \n\nUnfortunately, a lot of the Dems that are doing these things are completely allergic to accountability and recognizing that they are contributing to the problem, so instead of actually fixing it, they're doubling down and going even harder.... Which will inevitably lead to even more losses. Which really sucks because, well, *-gestures grandly to absolutely everything going on right now-*....\n\nPolicy wise, it's not what the Dems are doing, it's what they AREN'T doing. What they should be doing is focusing on the working class instead of focusing on \"smashing the patriarchy\".",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "nodnarb88",
                                            "body": "Ive read your comment thread and totally understand your point. Sorry youre getting so much pushback on your personal experience. I think this thread just highlights part of the issues youre talking about. Mens issues are being ignored, then being dismissed, and then told to get over it because of past advantages which many of us never even experienced.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sunshine_is_hot",
                            "body": "If you’re going to make up anecdotes, at least make them believable",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Trump4Prison-2024",
                                    "body": "FFS this is literally why Kamala lost.  If you honestly think that there's not blatant anti-male rhetoric going on in \"safe\" leftist spaces ALL THE TIME, then you are absolutely lying to yourself.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "sunshine_is_hot",
                                            "body": "Kamala lost because you made up a fake story for internet points….  Right.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "Trump4Prison-2024",
                                                    "body": "No it's this whole attitude. Not specifically because of my story. Nice false equivalency though.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "sunshine_is_hot",
                                                            "body": "Calling out fake stories is why she lost? If we only let trolls post fake shit without any pushback she would have won?",
                                                            "score": -5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DramaticErraticism",
                    "body": "I think if you look at a party and their written list of 'who we serve' and you do not find yourself on that list, that is a pretty big failure of a party that is trying to attract your vote.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "theKGS",
                            "body": "Obviously, but I'm looking for concrete policy proposals, not merely communication issues.\n\nSuppose we make it clear by rewriting all the fluff texts so that they also include men (I actually think we should do this). Now what? No policy has changed, only presentation.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "krisXiii",
                                    "body": "The dems are the ones saying representation and inclusion matters, so what might only seem like presentation  ie. the fluff copy, is part of creating the appeal to all voters. Saying this as a female dem. We are so bent on advancing women and minorities we are not portraying a campaign that feels inclusive for men. Yeah they’ve had advantages for far longer so maybe big policy proclamations centering them is not necessary but social taglines that exclude them with sassy attitudes are not getting the male vote. It comes across as the anti- men party , so they look elsewhere. Hopefully they have enough morals to see the right is just not a viable option and still vote dem. but yeah I see what the male commenter above is saying",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "krisXiii",
                                            "body": "I’d also say the right seems pretty obviously anti-female. & People don’t tend to stay where they’re clearly not wanted. (Barring brainwashing/gaslighting etc)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DramaticErraticism",
                                    "body": "I think it's a start. \n\nThere is a lot that simple representation and awareness can provide. If they added 'Men' to their page and bring full awareness to some of the issues men are struggling with, that would help. You don't start with policy change, you start with awareness and acceptance and build up to that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "theKGS",
                                            "body": "Yes. They really need to work on their messaging.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nodnarb88",
                    "body": "I think it's more about what the right is offering. The right is telling them we're going to go back to the good ol days where men were men and women were women. Men are struggling rn. Because men aren't doing well financially, they're finding it hard to find partners. Women are outpacing men, and women look to men to be providers. Womens acceptable dating pools are shrinking, so theyre struggling as well but not as much. It really boils down to finances and having value in the world we live in. Scott Galloway has been talking about it and makes a lot of strong arguments.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "AM_Bokke",
                    "body": "The democrats need to be leaders. They are not.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "theKGS",
                            "body": "Yeah sure that can be critiqued, but that has nothing to do with whether or not the Democrats cater to men. It's orthogonal to it.\n\nThe question that is never answered by these people is this: Exactly what is it that the Democrats are currently doing that you feel is alienating men, specifically, and that they should stop doing?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "nodnarb88",
                                    "body": "They are ignoring that men are struggling and not offering any support. Men are falling behind, but because theyve always had an advantage no one wants to acknowledge it and help. Young men are having a hard time finding partners and purpose in the modern age. When young men are struggling their parents are suffering and want change to help them. Who shifted to the right? Young men and older parents.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "theKGS",
                                            "body": "Yes this is the argument I have always seen and it's that thing specifically which I mean is vague and difficult to act upon.\n\nThe Republican \"solution\" is to roll back women's right, ban abortion, and make things suck. Is that what Dems should do too?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "nodnarb88",
                                                    "body": "If you think being ignored while struggling is too vague and difficult to act upon, then I don't know what to tell you. I just wrote out how men aren't doing well in modern society, especially financially. If a man can't provide for a family and attract a woman, he loses out on major points of meaning in his life. Men have been taught to be strong, protective, and useful. They aren't having their needs met, and after awhile, theyll follow anything that even remotely promises to do so. I would guess that a lot of men on the right dont want to take rights away and make things suck. They just want things to be better for themselves and when they look to their fathers, it seems like they had it better, so when someone comes in and says lets go back to the old days and offers regressive policies they go along.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "AM_Bokke",
                                    "body": "That is for the democrats to figure out. But by and large, men are simply not identifying with traditional institutions, and that includes the democratic party. \n\nThe democratic party needs to show that it is a relevant institution, then maybe they can gain some market share with men.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Weird-Sea-5022",
            "body": "YES IT WOULD HAVE AN IMPACT to include men in their measaging. People need to be seen and heard. If you are suffering and the person you love doesn't see it, it makes you suffer more! Explicitly say that you have their back. Say out loud the men are included!!\n\nIdk why you democrats are so dense. It's basic human psychology to be seen and heard. Y'all are so stupid sometimes....\n\nJust a little something for young men to let them know \"Boys, we hear you. We understand that there's a lot going on in our lives and we need some help. We will make sure you get the support and help you need. I've needed help before to get through some tough shit, and I'm going to make sure you get the support you need to get through some tough shit together. You are worth it.\"\n\n\"You can't plan for the future when you're stuck in the present. You can't feel strong when ever bill makes you feel weak. You can't built a relationship when you feel like you have nothing to offer. Men you are suffering, we are here to help you get through it.\"\n\nAt least have that to reach out to men. Democrats are doing nothing to win votes, they are always assuming people will vote for them. They are openly letting Republicans recruit young men!!!!!\n\nThe truth is reputation proceeds all else. Democrats, liberals, and progressives are perceived to ignoring men. The online left sucks at messed up the democrat's image on men for decades. Democrats need to actively oppose this to show people that men ARE included in progress to! Don't be afraid to get canceled by terminally online leftists.\n\nWe can have both empathy for men and women. We have space in our hearts for men, women, Palestine, North Carolina, etc. sometimes leftists get too much into a suffering measuring contest.....\n\nStrong men can create great times. But strong men can also create the worsts of time if misguided. It is possible to reach out to men. Y'all are just too stubborn and given up on rehabilitation. For a party that praises empathy and inclusivity, y'all do a good job at leaving young men and men out of it.",
            "score": 3,
            "replies": [
                {
                    "author": "DramaticErraticism",
                    "body": "Totally agree with everything you said.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "asisoid",
            "body": "'White college educated men' is the only group that showed up for Kamala.\n\n\nId worry more about how they completely lost women and minorities.\n\n\nLower educated white men will always vote Republican.",
            "score": 13,
            "replies": [
                {
                    "author": "None",
                    "body": "Black people overwhelmingly voted for Kamala, White folks overwhelmingly voted for this BS.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "asisoid",
                            "body": "Kamala lost ground in every demo except White college educated men...",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "AdmiralSaturyn",
                                    "body": "Did she lose ground with black women? I thought 92% of black women voted for her.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "asisoid",
                                            "body": "She did 2 points worse with black women than Biden did.\n\nEdit: I've seen some that say she picked up a couple points with black women, so you might be right.\n\nhttps://www.cnn.com/interactive/2024/politics/2020-2016-exit-polls-2024-dg/",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "AdmiralSaturyn",
                                                    "body": "You are right though about 20% of black men and 60% (I think?) of latin people.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "asisoid",
                                                            "body": "Latinos and latinas are the wildest swings.\n\nShe lost 35 and 20 points respectively compared to 2020.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Curze98",
                                                                    "body": "The thing with Latino/Latina voters is they are (typically) *extremely* Catholic. Even the younger generations. They have really strong family values and are very against abortion for the most part. I expected Democrats to lose ground with that voterbase, but not that by that much tbh",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "AdmiralSaturyn",
                                                                    "body": "I wonder how many of them are white-passing.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "I know one thing, White college educated men are not a demographic.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AdmiralSaturyn",
                                                                                    "body": "What do you mean?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "anti-torque",
                                                                                            "body": "Pretty sure they're saying demography has given up on men.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "None",
                                                                                            "body": "Apologies, I meant to reply higher.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GotMoFans",
                                    "body": "So basically over 90% of college educated white men voted for Harris?\n\nIf not, you need to put some respeck on Black women’s name.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "asisoid",
                                            "body": "Not saying in total, I'm saying the 2020 v 2024 net change.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "That is not a demographic, that is a subset and also you are trying to make it seem like your group is large when we both know it is smaller than most groups.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Fragrant-Luck-8063",
                                            "body": "There are more college educated white men than there are black men and women combined.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GotMoFans",
                    "body": ">’White college educated men’ is the only group that showed up for Kamala.\n\n*Black women have entered the chat.*",
                    "score": 6,
                    "replies": [
                        {
                            "author": "asisoid",
                            "body": "You're right, she did pick up a few points with black women. Her largest gains were white college educated, though.\n\nhttps://www.cnn.com/interactive/2024/politics/2020-2016-exit-polls-2024-dg/",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheLaughingRhino",
                    "body": "I want to make a distinction. Democrats and the DNC lost \"working class minorities\" \n\nLet's use an example. John Legend and Chrissy Teigen are both technically minorities. But they are famous, wealthy and have access to more of the upper tiers of power in this country by way of their status. Legend and Teigen poured in money to \"bail out\" those who were looting and rioting in some major cities. Who took the brunt of the burning and destruction in 2019 and 2020? Small business owners. Many of them were minority owned. Not just black, but also Asian, Hispanic and across the spectrum. \n\nLegend and Teigen did not face the consequences of that choice in their own neighborhood. Wealthy. Isolated. Gated. Lots of security. Personal bodyguards. The decision makers for the Democrat Party, those like Obama, Clinton, Schumer and Pelosi and others did not have to live with the failures of their bad policy. It was working class America that had to take the full brunt of that. \n\nThe mistake and arrogance that I believe those like Obama, Schumer, Pelosi and others made is they turned \"identity politics\" into a perspective of monoliths. In effect, that all black people should and do think this specific way and do this specific thing. But that's not true. A black young man from poverty, with no family connections and no support system, produced from bad school districts, has more in common with white, Asian and Hispanic young males from that same area than they do their wealthy counterparts elsewhere. Just because you have two young black men, it doesn't mean they automatically align. One could be headed to work at an investment bank and his parents are both college educated and have formal white collar careers. The other might be struggling to make rent while working at a grocery store, desperate to get more hours.\n\nAnd almost every avenue of engagement is insulting. Democrats blame the \"messaging\" ( i.e. we are doing great things for you, you are just too stupid to see it, thus we need to dumb down how we talk for you to \"get it\" ) but a lot of the time it's just shitty policy. Democrats also blame \"disinformation\" ( i.e. again, you are just too stupid not to be fooled, so let's \"educate\" you on what you should do for us, to give us power, so we can fix this all for you, since you are too stupid otherwise)  That goes hand in hand with calling voters as \"deplorable\" or \"garbage\" \n\nAnd, in order to facilitate the \"gaslighting\", what the DNC had to do, with most of the mainstream media being complicit, was to deny the day to day lived experiences of these working class Americans. Those every day people keep shouting that they are struggling to find affordable housing, feel safe on the streets, find good jobs and pay for groceries. For three and a half years, Psaki and Jean Pierre kept saying everything was fine. Nothing was wrong. If you think something is wrong, you must be a cultist. Or a bigot. Or a racist. Until a few months before Election Day, when the situation finally got so desperate that the Democrats admitted a lot was very very wrong. But the problem with that is it was also insulting to voters, as if those voters would magically forget the 42 months before where the gaslighting happened every day. \n\nI think the answer is simple. Democrats in power, the small group, made it clear they don't give a shit about working class people. And more than that, that they despise them. And the veil was lifted, it wasn't hidden anymore. It was made to face real sunlight. Of course people were going to leave the Democrats after that.",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "MisanthropinatorToo",
                    "body": ">Lower educated white men will always vote Republican\n\nThat's who gives them their best job opportunities. Either in the military or in prison.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mspe1960",
            "body": "I have given up on Trump supporters.  If  you like Trump then I have given up on you.  I have not necessarily given up on everyone who voted for Trump.  But if you actively like and support him, you are dead to me.\n\nAnd yea, that is way more than half of the white men in the USA (I am a white man)",
            "score": 8,
            "replies": [
                {
                    "author": "teh_hasay",
                    "body": "That’s all well and good, but up to the point trump officially declares himself king, democrats are still going to need to win elections. And it’s hard to do that if you don’t have a positive message to sell to male voters. \n\nIf our response to every trump victory is to scornfully wag our fingers at the people who voted for him and otherwise change nothing, it’s only going to get worse.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ArcanePariah",
                            "body": "He already is king, what's there to discuss exactly? The only way the Republicans lose power is when they lose their lives in the capital.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DramaticErraticism",
                    "body": "How does that solve anything? There are men in the middle that can be swayed one way or another. If we find a way to reach them and garner their attention and support, that will change the outcome of elections.\n\nIt seems like something...kinda important?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "mspe1960",
                            "body": "I am not positioned to solve anything with them. I think the only answer for them is to become irrelevant when sanity rules again. \n\nI will try to work to support people and ideas who/that support the concepts of our constitution and the democratic republic that had been operating for a long time. \n\nIf they support a vengeful, self centered, childish, fascist wannabee, I think they are outside of any circles where they can be meaningfully reincorporated.  Maybe they can change over time.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Longjumping-Mud-5016",
                                    "body": "Why you hate white male but not white female who also became majority for trump supporters ? You are hypocrite, double standard and misandry.You actually from start even before trump emerge you already hated white male,you hate us without reason.Growp up please",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheLaughingRhino",
                    "body": "This the part that I think many on the left truly don't get. \n\nA LOT of people who vote for Trump actually hate the guy. But they also hate what the Democrats have done to this country even more. \n\nThis new \"narrative\" to blame voters is exhausting. Did you want Trump gone? Then maybe the DNC and Clinton should not have stolen the nomination from Bernie Sanders in 2016. Biden wasn't doing great in the primaries in 2020 and there was a clear strategic drop out to make sure he was the nominee. In 2024, there were no real primaries at all. Harris was chosen in private by a small number of Party \"elites\" after Biden was forced out. The DNC spent big money to try to remove Dean Phillips, RFK and Marianne Williamson off as many state ballots as possible, so there was no other choice. \n\nInstead of blaming voters, why doesn't the DNC take their thumb off the scale for a change? Have a real primary, have real debates, let millions of working class Democrats all over this country have say with their votes on who should be the nominee. And let that process, a real process, \"filter in\" the best possible candidate. \n\nThose on the left simply cannot have it both ways. They cannot keep shouting about the end of democracy but refuse to accept that the DNC has burned down any semblance of a real legitimate process anymore in the primary phase of selecting what should be the best candidate possible. \n\nPlay Stupid Games/Win Stupid Prizes\n\nThe DNC and those like Obama, Clinton and Pelosi play these stupid games to cheat the primary process, but it's all working class Democrat voters who have to get the stupid prize in the end. But somehow this \"in house\" problem for the left is now the responsibility for Republican voters? \n\nIt's an IN HOUSE PROBLEM. Democrats need to clean their own house first. How about starting right there instead.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "DontEatConcrete",
                            "body": "The democratic parties doesn't really care. I mean last election was a catastrophe but the VAST bulk of democrats in house and senate won their seats. They still get to show up and spend a few minutes complaining about appointees for the camera. As long as they still have their seat they don't really care--with rare exception.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "core72I_",
            "body": "not intelligently i dont think, i think the party has drifted away from the common man to instead the educated elite without noticing it. 20/20 hindsight the clues were all there the student debt relief that obviously the educated university goers would support the common man however overwhelmingly was against and kamala constantly saying \"i come from a middle class family\".\ni gotta say no the democratic party did not give up on 'men' they catered (very well) to a part of the electorate and that part of the electorate voted for them. i dont think as far as kamala's campaign itself the democrats did bad the party simply had a lack of awareness the Republicans didnt have",
            "score": 2,
            "replies": []
        },
        {
            "author": "LightSwarm",
            "body": "Democrats should always try to every demographic. We did amazing under Howard Dean’s 50 state strategy. No idea why he was replaced. Need to be competitive with every group.",
            "score": 2,
            "replies": [
                {
                    "author": "DramaticErraticism",
                    "body": "That seems like the right thing, to me. I'm not sure why it elicits such anger to so many other people.\n\nIt's like they believe that mentioning men and paying attention to the problems of men, somehow takes something away from them...when the reality is that it only makes the party stronger and brings more votes.\n\nThere are many millions of male Democratic voters and millions of undecided male voters. Trying to reach them by showing you care about their problems and concerns, seems like a pretty obvious strategy to employ.\n\nFor people who get irrationally angry at the notion of men having problems and deserving attention, you should probably investigate what elicits such a strong reaction. Usually, snap anger like that, is about something else entirely.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "lostwanderer02",
                            "body": "Honestly they don't want to admit this, but women can be just as sexist as men. Ironically they have the same mentality as male sexist that if a political party focuses on the opposite sexes issues it means it takes away from theirs. It doesn't, but there is some genuine hatred there. \n\nThere are many heterosexual women in relationships with men that do not like men and value their female friendships more than their romantic partner. I think another part f it is also a huge lack of empathy from women for male problems and also still blaming the current generation of men for sins of the past (The patriarchy and having little to no rights). \n\nIt's ironic that the Democratic Party is supposed to be inclusive and accepting of all people who are struggling (as long as they aren't bigots) and yet there are many that make fun of or get angry at men that talk about struggling mentally or financially in society. And if you call them out on it they refuse to acknowledge it and say you are opressing them. The fact you have been down voted for trying to have a dialogue about it shows how passionate that male hate is.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DramaticErraticism",
                                    "body": "I think you summed it up perfectly, it's a common thing that happens all the time with groups of people. They think giving agency/attention to another group, takes away from their own group...not realizing that both groups are stronger when both receive the attention and validation needed.\n\nI sometimes ponder the Women Are Wonderful Effect https://en.wikipedia.org/wiki/Women-are-wonderful_effect#:~:text=The%20women%2Dare%2Dwonderful%20effect,women%20as%20a%20general%20case.\n\nIt seems like there is a very real notion in modern day liberal America that women are inherently better than men and that leads to all sorts of consquences.\n\nIt also leads men to start to wonder where they fit in and belong. A lot of young men are going over to the group that validates them and gives them attention, conservatives. \n\nWe're going to have many many years of conservative hell in front of us, if the Democratic party doesn't understand that they simply cannot count on men to vote for them simply because it's the right thing to do. They need to show they care and are offering something to men. \n\nFor the first time in American history, women are beating men in graduation rates and home ownership, when comparing single men to single women. I don't think there was every any consideration of what to do, once the scales were starting to tip the other way. \n\nBeing a victim is an addictive thing. Giving up victimhood is not something most people are willing to do, as there are always ways a group of people are being victimized, regardless of how many improvements are made. \n\nI was reading that true feminism is about destruction of the patriarchy, not the destruction of men. It seems like that is not a commonly understood notion. To many, men = patriarchy and should be treated as such. \n\nI don't honestly believe the Democratic party will ever catch up and understand what they need to do. I have a feeling we're in for a long ride that makes our lives worse, simply because it's preferable to suffer than it is to give any grace to men, because that is how humans are wired.\n\nAs I said, men = patriarchy, patriarchy = evil, men = evil, to many. All the reactionary downvotes just show that people are angered by the very subject. When you are angered immediately after hearing something, often it is something you should analyze within yourself, as to why you feel that way.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JKlerk",
            "body": "The life blood of the Democratic Party is identity politics and having a paternalistic attitude towards voters.    That's off-putting to many men.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SunderedValley",
            "body": "Of course they have. The fact this is downvoted this hard proves you can't even ask the question.",
            "score": 3,
            "replies": [
                {
                    "author": "DramaticErraticism",
                    "body": "Right? Mentioning the simple notion that men have problems and the party should pay attention to those problems, provides such a strong reaction of anger.\n\nWhen you get irrationally angry at a question, you might need to sit and ponder why that is.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Biscuits4u2",
            "body": "Democratic leadership have focused on identity politics instead of class politics, and that pretty much sums it up.",
            "score": 8,
            "replies": [
                {
                    "author": "theKGS",
                    "body": "That's a commonly seen critique, but I'm not seeing it. If you believe that the Democrats are not focusing on class politics and this alienates voters so much they avoid the party, then where are they going? Because it's not like the Republicans are better on the class politics issue.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Biscuits4u2",
                            "body": "Lol Kamala literally had groups set up like \"White Dudes for Harris\", and other demographics, and had a nationally televised town hall meeting with them all.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "NeuroticKnight",
                                            "body": "No then that would be Kamala for white dudes.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Trump4Prison-2024",
                                            "body": "Yeah in a Steve Buscemi \"How do you do, fellow kids?\" meme way that everyone saw through immediately. \n\nOutreach has to be genuine in order to be accepted.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdmiralSaturyn",
                    "body": ">Democratic leadership have focused on identity politics\n\nCite me the instances when Kamala Harris focused on identity politics.\n\n>instead of class politics\n\nYou think Republicans focus on class politics?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Biscuits4u2",
                            "body": "I don't need to cite anything. Find it yourself. It's all out there and easy to locate.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "AdmiralSaturyn",
                                    "body": "Not unless you conflate women's reproductive rights with identity politics.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Biscuits4u2",
                                            "body": "Good lord, fine. Guess you forgot all about this:\n\n[https://www.bbc.com/news/articles/cp0843v200lo](https://www.bbc.com/news/articles/cp0843v200lo)",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "anneoftheisland",
                                                    "body": "This is an example of something that was initiated and run by Harris's supporters, not the campaign. It certainly illustrates an appetite for identity politics among Democratic voters, but I'm failing to see how it's an example of *Harris* focusing on identity politics.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Biscuits4u2",
                                                            "body": "Harris had a choice and she chose to sanction this and other events that embraced identity politics. That didn't seem to help her campaign at all. Even more than that, she didn't embrace change to any significant degree and made no effort whatsoever to differentiate herself from Biden, who whether you like him or not had a poor approval rating.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AdmiralSaturyn",
                                                    "body": "Thank you. I actually did forget about this. However, in Harris' defense, she did touch on class politics. She specifically campaigned on affordable housing and elderly care.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mitchthaman",
                    "body": "Yup. They too work solely for the oligarchs.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "AdmiralSaturyn",
                            "body": "That is a lie. The Democrats appointed Lina Khan. They appointed pro-union supporters to the NLRB. They restricted junk bank fees. They removed medical debt from credit reports. They capped the price of insulin, among many other drugs. They forgave about $200 billion of student loans. They passed the Dodd-Frank act. There are many examples of the Democrats supporting policies which are against the wishes of oligarchs.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "mitchthaman",
                                    "body": "Yup and all those things were codified into law like roe v wade so they weren’t easily over turned. \nThey’re a center right party at best whose lack of back bone is exactly the kind of party the oligarchs need as an ‘opposition party’",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "AdmiralSaturyn",
                                            "body": ">Yup and all those things were codified into law like roe v wade so they weren’t easily over turned.\n\nYou think a codified Roe v. Wade wouldn't have been struck down?\n\n>They’re a center right party at best\n\nThat's because the American electorate is right-leaning. Being center-right is not the same thing as being pro-oligarchy.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "DickNDiaz",
                                            "body": "This sounds like a young man the Dems have lost.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "mitchthaman",
                                                    "body": "Yup. My dad and grandpa both are life long democrats and both served and one still serves in local government. I was blue as could be but you can only watch a party roll over so many times. \nPlus I started reading theory lol",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "DickNDiaz",
                                                            "body": "I understand the disappointment, and I can appreciate the anxiety. But to use a different context: Philadelphia Eagles fans wanted head coach Nick Sirianni fired for losing the Super Bowl a couple of years ago, thought Jalen Hurts and Sirianni should be gone from the team last season, and yet here they are back in the Super Bowl with the huge addition of Saquaon Barkley, and a real shot and defeating the Kansas City Chiefs. \n\nOf course if they lose, they are back to wanting to fire everyone and still hate Santa Claus lol. \n\nI guess what I am saying is: don't be Eagles fan lol.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "mitchthaman",
                                                                    "body": "This isn’t football. Peoples lives are at stake and dems haven’t done anything truly transformative for people’s material issues since the civil rights act.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DickNDiaz",
                                                                            "body": "Well oddly enough, the Super Bowl will still be played. But hold on here, material issues are based on an individual, what material you desire, what material you can purchase, and what material you can develop for trade and to gain income. Would you rather have the state to determine your \"material\" issues? Or did you mean social issues, to which you as an individual can decide on your own what values you have, despite whatever political hegemony? \n\nYou have more power as an individual than say depend on the collective, one thing I have learned is not to depend on government, rather desire to be independent from it. I understand the government has let our youth down, but it's not like I grew up with a stable government (I grew up during Vietnam and Watergate, then everything after that) that also had it's share of economic turmoil, health crisis, and war. This is not new to me, this was expected IMO, and in my middle age, I look at this as extraordinary. This is a time to be wide eyed, courageous, to really learn what freedom means, how we as individuals can determine ourselves in an extraordinary circumstance, and we need to do this together. As dark is it may seem, I find this fascinating. America has become complacent, but it doesn't mean we have to be.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mitchthaman",
                                                                                    "body": "That’s cool some people are dependent on the government and can’t work",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DickNDiaz",
                                                                                            "body": "Which is another reason not to depend on government.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "mitchthaman",
                                                                                                    "body": "Yeah some people don’t have the option to not",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "DickNDiaz",
                                                                                                            "body": "The government giveth, the government can taketh away.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "mitchthaman",
                                                                                                                    "body": "Yup which is why we need a strong national government. To take care of the needs of it citizens.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "DickNDiaz",
                                                                                                                            "body": "Who is going to pay for it?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DontEatConcrete",
            "body": "Yes.\n\nI see your question is unpopular, but yes they have. It's no secret that men don't live as long, have higher rates of suicide, etc. and yet compared to women there is barely anything about this in the news--no health programs, outreach, \"men's health\", etc.\n\nWe're just expected to stfu and mind our privilege.",
            "score": 2,
            "replies": [
                {
                    "author": "DramaticErraticism",
                    "body": "Yes, it does seem that way. You have a subset of men who greatly benefit from the patriarchy and their status as a man. You have the other, larger portion of men, who do not benefit in any tangible way. Yet, as you say, they are expected to vote against their best interests, for a party that ignores them, because it is the 'right' thing to do.\n\nI guess people should start to settle into Trumpism and Conservatism, as they would rather choose this life than give men any sort of attention, validation or support.\n\nIt seems strange to me, but people make many strange choices that seem nonsensical, especially when you're in the middle of living through them.\n\nI imagine a future that looks back on this time and easily points out these problems and the obvious solution.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "nodnarb88",
            "body": "I don't think they've given up on men exactly, but they aren't acknowledging that men are struggling the most rn. Our society has progressed in many ways, but our gender norms haven't as much. Men are still expected to be the breadwinners in relationships. Women are outpacing men in most metrics partly due to the dedicated efforts to increase their progress. We need to help men, but because they've always had an advantage, nobody wants to acknowledge it. Because men are struggling, everyone else is suffering. Men are having a hard time finding partners because women want a man who out performs them or at least equal to, where as men don't consider that as much. When young men aren't doing well, their parents suffer, watching their sons struggle. It's why we've seen young men and older generations swinging to the right. In the end, it really has to do with money. If everyone was doing well financially, you'd see many problems go away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClarkMyWords",
            "body": "In terms of young men, I think it’s a branding issue beyond policy. It’s not what Democratic politicians can counter. There was a viral video of a young man and a girl he’s with getting mugged. The man, quite bizarrely, turns and runs away in an instant while the girl he is with is literally left alone to have her purse snatched and possibly much worse done to her. It’s disturbing to my own values too. But I have no clue if or how he has ever voted. \n\nWhat started to click for me was the slew of comments beneath all agreeing on one theme: *This guy must be a Democrat.*, variations on that abounded: “Guarantee you he voted for Kamala”, or “This is the sort of “men” Democrat-run cities are making”, in reference to the muggers, as well. \n\nOther things added to my understanding, but this was the best example. I can also think of a pink-haired YouTuber who admitted he was hesitant to talk about “male loneliness” because he was scared of backlash (from Left-wing viewers) for just talking about it. And I’m gonna guess this guy *does* vote Democrat, or maybe a Leftist protest vote.\n\nFor a lot of young men, the mental image they have of Democrats has *almost nothing* to do with policy issues that Harris or Bernie Sanders, much less Chuck Schumer and Hakeem Jeffries now wrangle with. Their image of Democrats is based on a batch of online men they see framed as cowardly, effeminate losers. Especially the soyboys, the femboys, trans, what have you — and any angry women who would agree with the phrase: Men don’t have problems. Men *are* the problem. \n\nI don’t agree this represents the median Democratic primary voter who decides on the nominees. I do think the number is sizable enough to give the “manosphere” a lot of content to work with. Like Obama said in 2011-ish, “If the only things I saw about Barack Obama came from Fox News, I wouldn’t vote for me, either.” That alternate universe is now turbocharged 15 years later, on the personal little screen now in each man’s pocket. \n\nAnd at least with Fox covering Obama, it was often tied to *some* policy issue — tan suits and latte salutes were rarer, and omens of what was to come. I think there *is* plenty to assess and criticize on the Left in policy matters. But the point is, *young right-wing men’s perception of, and resentment for, the Left is almost completely divorced from those debates*. The Left is, to them, a parade of shrill women who seek to steal their opportunities and deny them sex — and the cowardly, effeminate losers who submit to those women.",
            "score": 1,
            "replies": [
                {
                    "author": "DramaticErraticism",
                    "body": "A lot of interesting thoughts, I pretty much agree with everything you're saying here.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "InternetPositive6395",
                    "body": "Not just that but many democratic men  that do bad things to women while lecturing there fellow men about how sexist they are. Look at Kamala husband who cheated on first wife or destiny shenanigans.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ClarkMyWords",
                            "body": "Oh, I think bad behavior towards women by Democratic men is much better-covered on right-wing media. (Needless to say, the reverse if true for Republicans and left-wing media). Bill Clinton’s affairs, plural, and his contacts with Epstein remain infamous, Andrew Cuomo, Matt Laurer, Anthony Weiner, Harvey Weinstein, and more I don’t recall off the top of my head. In my own town there’s Patrick Wojahn, a Maryland mayor who is gay and was caught with and imprisoned over child porn. Very few on the Left know the name. But nationally, Right-wing media had a field day.\n\nWhere selective coverage wasn’t so easy with such an array of Hollywood cel bswho got canned over MeToo. Instead, it was a Rorschach test, especially based on how your media diet framed it for you. The Left saw a generic, nonpartisan issue of wealth and power enabling abuse. The Right saw it framed as liberal Hollywood elites finally being outed as perverts.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "boulevardofdef",
            "body": "The philosophy of the Democratic Party's mainstream is that only groups that are disadvantaged or underserved -- either by Democrats or by the country in general -- need special attention. Every group listed on that webpage falls under those categories. \"African Americans\" are there because due to centuries of structural racism, they have significantly worse outcomes than other ethnic groups. \"Democrats Abroad\" are there because they tend to be out of the conversation when the party is making plans. \"Faith community\" is there because as the party most known for defending people *from* religion, the Democrats want you to know they also care about the specific needs of religious people.\n\nThey don't look at \"men\" as having unique needs because, well, men run almost everything. Now, you can agree or disagree with that, and I'm sure you can point to statistics about the suicide rate and such. But the Democrats don't look at the lack of special attention on men as \"giving up on men.\" Their point of view is more like \"of course we're serving men, everybody is serving men. Men are the default group that gets served, so we don't have to say it.\"\n\nIt's very similar to the \"White History Month\" argument you hear every February. Why do we have a Black History Month when we don't have a White History Month? And the answer is that, well, every month including February is White History Month.\n\nNow, given the trendlines in the 2024 election, I would guess that in the next couple of years, Democrats pivot to messaging toward \"men\" in the same way as they mention the \"faith community\" and the \"small business community,\" whom they are also historically viewed as not supporting. But time will tell on that.",
            "score": 1,
            "replies": [
                {
                    "author": "teh_hasay",
                    "body": "I think it’s missing the point to argue whether men *should* get special attention. There needs to be some level of pragmatism there. They’re hemorrhaging male voters because they’ve allowed the Republican Party to be the only one to even make a real pitch to them. If the Republican Party wasn’t so abhorrent it would be even worse. It very well could get worse as trumpian bullshit continues to be normalised.\n\nIt’s not a zero sum game here either. You don’t have to undo or compromise any progress on equality, just do the bare minimum to make men feel welcome in the coalition.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "boulevardofdef",
                            "body": "I mostly agree with this, but I'm not so sure about not having to undo or compromise any progress. In fact, I've been told *exactly that* by Trump voters here on Reddit. One of them explicitly told me that women and minorities have gotten so much focus in this country that white men are now the underprivileged group, and they have to lose some rights so that white men can get theirs back.\n\nDemocrats obviously aren't going to do that, which makes this a problem I'm honestly not sure how to address. Similarly, something that has worried me a lot as a Democrat coming out of the last election is the effectiveness of the Republicans' anti-trans messaging. What can the Democrats possibly do about that? The obvious answer is \"tone down their pro-trans messaging,\" but there *wasn't* any pro-trans messaging from them in 2024. The only real political solution is to render the Republicans' attacks moot by speaking out and legislating against trans people themselves, which isn't going to happen.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "theKGS",
                                    "body": "Yes exactly.\n\nI wonder if it's possible to do anything about the Republican anti-trans messaging strategy. I've even seen idiots in Europe fall for that shit. People arguing that well the Democrats lost because they were too extremely pro-trans, but that's insane because the Dems aren't more pro trans now than they were before, it's just that Republican messaging makes Dems seem look extreme when they're not.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DramaticErraticism",
                    "body": "I think comparing serving men in the Democratic party is akin to a 'White History Month', is a bit unfair.\n\nAnyway, I'm just trying to solve a problem. One side speaks to men and clearly supports them. Men are feeling marginalized and going over to the one party who recognizes them and speaks positively about them.\n\nI don't think it is pandering to men to note the specific issues men are dealing with (very high suicide rates, addiction rates) and note how we need to focus on resolving those problems. \n\nI'm not sure why so many people feel this is undoable or completely unacceptable.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "InternetPositive6395",
                    "body": "Then they need to drop there whole “ we inclusive “ stuff then because apparently they arent",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RealisticForYou",
            "body": "Latest data from the U.S. Banking Industry \\*\\*\\*\n\nYoung women are no longer buying into the conservative mindset of \"marriage and children\". As noted from the U.S. banking industry is that more women are choosing professional careers and are now making more money than men. And it's women who are starting their own business while taking out the majority of business loans.\n\nTodays modern men are the ones falling through the financial cracks of society. And it's those men who blame the government for the bad choices they made in their lives, and decided that voting for a convicted felon will give them wealth.\n\nDid you know that, until the 1960's, women couldn't open a bank account without a husband?\n\nToday...Women make more money then men. Wall Street says that women are better investors than men. Women are choosing to live alone; without men.\n\nFinancially desperate (conservative) men are the ones who voted for Trump. Smarter, educated men voted for Harris.",
            "score": 1,
            "replies": [
                {
                    "author": "DramaticErraticism",
                    "body": "*takes notes* \n\nWhen women succeed from a downtrodden place, it is through their own merits.\n\nWhen men fail, it is due to their own failures, not that of society.\n\nI recommend you take a look at the \"Women Are Wonderful\" Effect\n\nhttps://en.wikipedia.org/wiki/Women-are-wonderful_effect\n\nSomething that is not found in much of Europe. Women aren't inherently better than men, believe it or not. There are many factors at play as to why groups succeed more than others, some of those have to do with how society perceives those groups and how society prioritizes assisting certain groups over others.\n\nWomen get a helping hand in society, so much so, that they are starting to come out on top. Men, get the help that is inherent with being men, something far less tangible and seemingly, not as useful, anymore.\n\nI'm trying to imagine you inserting a race instead of men/women into this argument. You sound a lot like people you would believe you hate and are nothing like. Weird how things like that happen, isn't it? Not to mention, your argument is actually supporting the point I was making, even though you seem to think it points to the innate inferiority of the male species. \n\nIt's weird to see someone argue for the superiority of a specific group of people and the inferiority of another...especially when the person with the argument, has no awareness of the point they are making. It's like some women see them coming out on top and are enjoying that status and are have no desire or willingness to give up that new power and want to push down anyone who may try to. Almost like...they are no better than the groups they used to hate for doing those same things to them. Huh.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "RealisticForYou",
                            "body": "And your Wikipedia reference....just another source of info.\n\nRead my title....My info is from the U.S. banking industry which is pretty much run by men. I believe this info came from Chase Bank, while I've listened to similar data from B of A. (I'm an economics junkie, this info is what I've heard and read). They say women are coming into \"their own\" because they now have more options, period. There is no argument here...It's data.\n\nAnd yes, financially desperate men voted for Trump, while educated men voted for Harris...which is ALSO more data.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "DramaticErraticism",
                                    "body": "Right, there is plenty of data to show how women have been given preferential treatment through legislation, for many years now. \n\nIt's just data mate, so what is the problem with men receiving help now, since things are becoming lopsided? Not to mention you ignored everything else I said, as you have nothing to argue with. Just going to block you as I can tell you're disingenuous and are in love with your privilege so much that you are unwilling to see outside of it. Over a long enough timeline, many people become what they claim to hate.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RealisticForYou",
                            "body": "The Housing Industry \\*\\*\\*\n\nMore data...The U.S. is in a housing shortage for various reasons and the last I heard the U.S. is short 5 million units. I heard on CNBC that men and women aren't \"doubling up\" as they typically would due to the fact that women are \"choosing\" to not marry. And because of this, there is even a greater need for housing since more people are choosing to be single.\n\nAlso, more women have engaged in politics than ever before, too. The AMBITION of women who want to take control over their lives has not been greater than it is today.\n\nI'm a retired techie with a mathematics background and a part-time jeweler. My customers are professional women with expendable cash. From biologists to doctors, to a neuroscientist, to a retired physicist, it thrills me to see how women are seeking the lives they want and are no longer trapped by lives from some outdated set of traditional values.\n\nThe stupidity comes from those who don't understand the nature of the \"exponential curve\". Due to the egregious nature of Trump, the rate that women are taking control of their lives is moving at a very fast clip. \n\nAlso, some of the most respected CEO's in the U.S. are now women.....Love it!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ccmanagement",
            "body": "You are going to be downvoted into obscurity for the questioning the decision making process of the DNC.  Let that be your answer.",
            "score": -2,
            "replies": [
                {
                    "author": "DramaticErraticism",
                    "body": "Evidently, let's continue with these terrible defeats and keep with the same strategies that are not working.\n\nMillions of men will vote Democratic but there are millions of undecided voters who are wondering what Democrats are going to do for them. It's not enough to say 'This is the right thing to do, so you should vote for us.'\n\nBeing able to say that they recognize that men have issues and identify what those issues are (high suicide rates, for instance) and that they want to help, is a great way to show male voters that they actually do care.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "leroy2007",
            "body": "Democrats pandered to women by demonizing men, and had the arrogance to think that would work out just great for them. I’m disgusted by Trump, but currently am even more disgusted with the Democrats. They used our fear of Trump to force a dementia ridden Joe Biden on us against our will, and I will never be able to trust them again to tell the truth and do the right thing.",
            "score": -7,
            "replies": [
                {
                    "author": "Knowledge_is_Bliss",
                    "body": "I'm having trouble making the connection between your first and last sentences. How was running Joe Biden demonizing men?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "RealisticForYou",
                    "body": "Yet, over 30% of women in the U.S. have been sexually assaulted by men. As a female, I've know many young women who have been raped by friends, neighbors and their fathers. Women are \"done\" with sexual assault while being told they have no control over their own bodies. Women demonizing men comes from their experiences with men.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Trump4Prison-2024",
                            "body": ">Yet, over 30% of Aryans in the U.S. have been sexually assaulted by Jews. As an Aryan, I've know many young Aryans who have been raped by Rabbis, Jewish businessmen, and Jewish fathers. Aryans are \"done\" with sexual assault while being told they have no control over their own bodies. Aryans demonizing Jews comes from their experiences with Jews.\n\nDo you see how abhorrent this language is when switching out your despised group with another group? \n\nThis is what we're talking about. Generalizing all people of a group based on experiences with a small number of people in that group is bigotry, plain and simple. Your statement is sexist and misandrist. \n\nIt's no fucking wonder so many men refused to vote for your interests.... Cause why should they? Why should they care about you when you don't care about them?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "washingtonu",
                                    "body": ">It's no fucking wonder so many men refused to vote for your interests.... Cause why should they? Why should they care about you when you don't care about them?\n\n\nJust look at how you react when sexual assault statistics gets brought up. We are used them not caring about us",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "RealisticForYou",
                                    "body": "And who said I don't care about men. I'm married to a great guy who isn't a rapist. Maybe YOU are the sexist, here.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Trump4Prison-2024",
                                            "body": "Calling out sexism is not sexism. What you're doing here is a textbook attempt at deflection: \"I'm not sexist, YOU'RE sexist\". This is a sign that you are either intentionally or subconsciously refusing to look at your own words and reflect upon them. It shows a lack of desire or ability to take accountability when called out for your misandrist language. If you'd like to do better, I'll happily continue this conversation, but if not, good day.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "RealisticForYou",
                                                    "body": "Here's the thing...I really don't care what you think of me, period. I'm here to express why women have given up on men from the women I have spoken too for decades. You cannot take my opinion away from me.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "RealisticForYou",
                                                    "body": "I live on the West Coast where most people are liberal and educated. When I hear smart, educated men tell ME that they are embarrassed they belong to the male specie is something that ALL egregious men should be worried about.\n\nThere are a whole bunch of men who think the way I do. Toxic men need to know when they are toxic men.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "RealisticForYou",
                                                            "body": "And what you are telling me is that my opinion does not matter.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}