{
    "title": "Who Are the Young, Bold, and Electable Candidates Progressives Should Rally Behind for 2026 and Beyond?",
    "author": "muchhuman",
    "subreddit": "PoliticalDiscussion",
    "rank": 18,
    "score": 92,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 172,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1ikuesi/who_are_the_young_bold_and_electable_candidates/",
    "id": "1ikuesi",
    "selftext": "**Progressives need real change, fast.**  \nFor that to happen, they need leaders who are both bold in vision and broadly electable. The goal isn’t just to make noise; it’s to win and actually govern effectively.\n\n**Conservatives came to the table ready to rock in 2025.**  \nThat level of organization and preparedness is something progressives must learn from. Having the right ideas isn’t enough, they need leaders who can execute, communicate, and work together. **They need a Project 2027.**\n\n----  \n\nSo, who are the candidates, local, state, and federal, that strike the right balance? Young, energetic, forward-thinking, and capable of working in unison rather than being fragmented.  \n\n----\n\nAside from the candidates themselves, how do they actually make this happen? What’s the best strategy for:\n\n- Identifying and supporting the right candidates early?  \n- Building a coalition that can work in unison instead of being divided?  \n- Creating a messaging strategy that resonates with the majority, not just the base?  \n- Ensuring grassroots efforts translate into real electoral success?  \n- Learning from past mistakes and building an infrastructure that lasts?  \n\n----\n\nWho are the rising stars that actually get it? Who has the vision, the fire, and the ability to win and govern effectively, without falling into the same divisions of the past?  \n\n**Drop names, key races, and reasons progressives should get behind them!**  \n\n----\n\n**Prompts**: (because I'm not going to lie, I had chatgtp help me put this together due to being dumb)  \n\n- new reddit post, political discussion. the prompt / title something like which candidates should progressives be pushing to the front page, lifting up or just overall supporting for 2026 and the future that are likely to advance progressive (like truly star trek progressive) policies in unison and quickly\n\n- we may need to rethink our post. we want drastic change, young and eager candidates, but we also want candidates that are appealing to the majority\n\n- add a neutral mention that the current party has been, if nothing else, extremely efficient or prepared to implement their policy\n\n- These candidates must also be able to work in unison, not as divided as they have been in the past. softer on 'progressive'\n\n- we need to change the policies into more of a discussion topic, something else to plan\n\n- scrap the policies, replace with a discussion on how to actually implement our plan",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tygonol",
            "body": "Not necessarily 2026, but I see Andy Beshear as a figure worth rallying behind and building the party around. I’d love to see him run in 2028; he’s coming up on year 6 of his gubernatorial tenure and he doesn’t seem to have any intention on running for a senate seat, so we likely won’t see him on the national stage for a bit. \n\nHe has the potential to legitimately bring a sense of unity to our country; checks just about all boxes. I think people underestimate just how different “coastal democrats” & “Appalachian/heartland democrats” can appear in the eyes of voters.",
            "score": 59,
            "replies": []
        },
        {
            "author": "alexis_1031",
            "body": "Andy Beshear brings a new refreshing but progressive prowess to the democratic party. The man has been able to win in bloody red Kentucky not once but twice. He is also the second most popular governor in the USA (behind Governor of Vermont, who is a Republican). The DNC would be dumb to sleep on this man.",
            "score": 24,
            "replies": [
                {
                    "author": "AdmiralSaturyn",
                    "body": "Agreed. With that said, we have to address his weaknesses, such as the fact that he's a nepo baby (his dad was governor), especially if he has to face off against JD Vance.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "alexis_1031",
                            "body": "Very fair. I think a good way to push this aside is to acknowledge his father's legacy and what he's actually done with it to improve the state.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mrcsrnne",
            "body": "After reading the answers in this thread it seems like…nobody! There is none.",
            "score": 57,
            "replies": [
                {
                    "author": "sufficiently_tortuga",
                    "body": "Getting reddit to agree on who is progressive is the first stumbling block lol.\n\nIf there's one thing the election showed its that reddit is hilariously out of touch with the American political zeitgeist. For most americans, Biden is considered a progressive.  Here?  \n\nWe're going to see a lot of no true scotsman arguments against anyone the Dems might pick.  Infighting as if leaders operate by Highlander rules instead of getting weaker the more they are attacked is a recurring theme.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "lalabera",
                            "body": "Most Americans do not consider biden a progressive ",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "IceNein",
                                    "body": "No of course not.  He was selected because he was moderate.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SlowMotionSprint",
                            "body": "> For most americans, Biden is considered a progressive. Here?  \n  \nIn fairness that is because the US doesn't really have a leftist party. We have a conservative party and a...whatever the GOP is.  \n  \nBarack Obamas Chief of Staff was too conservative for the Tories in the UK for example.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "sufficiently_tortuga",
                                    "body": "Politics is relative to the population, and as much fun as it is to compare it to other populations its just not meaningful.  The current GOP would be a lefty party in 1750. To some people Marx would be a fart right fascist.  Who cares?  \n\nFor American voters in American politics, the Democrats are a progressive party.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdmiralSaturyn",
                    "body": "The top two upvoted comments have suggested Andy Bashear.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "IceNein",
                    "body": "AOC is as close as we’ve got.  She seems to be the only progressive that seems to understand that you need to work *with* the party if you hope for political success.  Unfortunately we have seen that Americans will not vote for a woman of color.\n\nRashida Tlaib has shown poor judgement getting swept up in the uncommitted movement.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "WheelyWheelyTired",
            "body": "I think, honestly, that before discussing ANY potential candidates a plan needs to be formulated as to how we will hold republicans accountable for what they’ve done.\n\nIf there’s not any actual accountability and they’re just going to go right back to installing a dictator once they get back in, there’s literally zero point.\n\nThere needs to be a Nuremberg trial equivalent in my opinion. We cannot allow events like the past decade of US politics unfold ever again, or we are cooked.",
            "score": 64,
            "replies": [
                {
                    "author": "AjDuke9749",
                    "body": "That will never happen, not because we shouldn't hold them accountable, but because the MAGA crowd is too far gone at this point and centrists will see holding republicans as a political witch hunt. We had an insurrection at the Capitol building in 2021 and the man who is partially responsible for starting it is back in the White House and now he is a convicted felon. We have the most popular \"news\" channel in the country feeding propaganda to its audience on a daily basis 24 hours a day. It is not only that our country is deeply almost irreparably divided politically, but that one side doesn't accept facts. They will find a boogeyman to blame like Biden or DEI or the Woke Left, then move on to the next culture war. Why would half the country want to hold any of their politicians accountable when they are fighting the demons in charge aka Democrats. We live in unprecedented times, mostly because of the unbridled war on facts by certain demographics as well as the abysmal media literacy and education levels of people who can vote for who is in power.",
                    "score": 61,
                    "replies": [
                        {
                            "author": "WheelyWheelyTired",
                            "body": "Sadly, I don’t disagree with you. For some reason even those I speak to who are normally very reasonable have drawn a line at going after Trump and his supporters. I can’t understand it one bit. The idea that we should in any way be nice to Nazis, given what they are and what they believe, is wild to me.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "AjDuke9749",
                                    "body": "Many people personally I know on the left are not advocating for tolerance. Even more moderate people draw the line at being nice or tolerating MAGAs politics. But there needs to be overwhelming support to hold them accountable. Unfortunately about half of Americans fully support this behavior.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "WheelyWheelyTired",
                                            "body": "I have unfortunately had the opposite experience where most lefty’s I’ve talked to, as you mentioned, would view it as a witch hunt to even say “hey, maybe we should prevent Nazis from participating politically”. While not outright advocating tolerance I suppose, it very much seems to be a “we need the biggest tent possible no matter who is in it” attitude",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "11bulletcatcher",
                                                    "body": "Lefties, or just liberal Democrats?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "WheelyWheelyTired",
                                                            "body": "I have heard it from both people I would consider leftist, and also from liberals",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AjDuke9749",
                                                    "body": "A lot of leftists (mostly those chronically online) think liberals and conservatives are both Nazis. Every democrat I know does not think it’s a political witch hunt to hold politicians accountable. I mean if we look at political scandals, democrats in the last 20 or so years are the pretty much the only political party to actually hold their leaders accountable. Trump is a convicted felon but that doesn’t bother Republicans at all. Harris was the VP during the Gaza war and was treated like she was the sole perpetrator by leftists and some centrists.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Impossible_Pop620",
                                    "body": ">drawn a line at going after Trump and his supporters\n\nThey have done this because of how you talk about it. When someone says something like \"Hey, we have to hold these Nazis to account\" and name checks Nuremberg, people immediately realise that this will not be any kind of trial, but just vengeful public humiliation. It's the same as Trump getting 34x felonies for some kind of accountancy crime and an $800M dollar fine for taking out a loan - no fairness in either of those.\n\nTrump may yet prove me wrong, but *he* hasn't dragged HRC through the courts to try to prove himself correct.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "WheelyWheelyTired",
                                            "body": "Wait, surely you aren’t contending that Nuremberg was some kind of sham trial by saying this, right? Just to be clear, Nuremberg was primarily about holding war criminals and people who committed very real atrocities accountable for what they had caused. The evidence was there.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Impossible_Pop620",
                                                    "body": "I believe the attitude at Nuremberg was not to prosecute the lowly guards or soldiers for 'just following orders'. You'd want the same, right? Although of course this decision was reversed in later years.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "WheelyWheelyTired",
                                                            "body": "Are you sure you know what you’re talking about? The defense at Nuremberg tried to argue that they were just following orders. It was determined not to be a valid defense, although it could sometimes lessen the punishment depending upon the circumstances. Plenty of guards were prosecuted. Hell, I think they somewhat recently prosecuted one who was in his nineties in Germany.\n \nCan you clarify what you mean by “you would want the same, right?”",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "Impossible_Pop620",
                                                                    "body": "Like I said, it got reversed. And to your point, as I wasn't around at the time, I can't speak to how much support there was or wasn't by the German people for the proceedings.\n\nIt speaks more loudly that you consider the current state of the US - and the past actions of Trump and his cronies - to be *worthy* of \"Nuremberg style trials\". Do you really think things are at that level?\n\nEven if you do, most people *don't*. That is why people you talk to, even Leftists, aren't keen on the idea.",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "WheelyWheelyTired",
                                                                            "body": "Are you aware of the recent justice department memorandum reinstating the death penalty for drug related offenses? Do you see where this is so obviously going? Death penalty for cartel association or drugs…immigration…. It’s pretty spelled out, wouldn’t you agree?\n\nhttps://www.justice.gov/ag/media/1388561/dl?inline",
                                                                            "score": 8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Impossible_Pop620",
                                                                                    "body": "Come back and talk to me when Trump has killed 3x million people, fool.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "WheelyWheelyTired",
                                                                                            "body": "So to be clear, you don’t care to stop him from doing the atrocities in the first place?",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Impossible_Pop620",
                                                                                                    "body": "So, to be clear, you want to put him on trial for stuff he hasn't done yet?",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "WheelyWheelyTired",
                                                                                                            "body": "Or, y’know, the hundreds of crimes he’s already committed.\n\nBut actually yes. Conspiracy to commit a crime is still a crime. I would call killing thousands of immigrants over alleged cartel associations and drug offenses a crime. An atrocity even.\n\nI would call allowing the slaughter of Palestinians for beachfront property a crime and an atrocity also.",
                                                                                                            "score": 9,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Impossible_Pop620",
                                                                                                                    "body": "You mentioned Nuremberg style trials, which would - to my mind- require Nazi Germany style crimes. Are you seriously suggesting that is what has taken place?\n\nThis is why people don't agree with you.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "WheelyWheelyTired",
                                                                                                                            "body": "I am suggesting to you that there are disturbing parallels between the two. I am suggesting that, if allowed, he would commit similar atrocities against migrants. As evidence, I have presented you the actual fucking memo that states intent to do that shit. It says it in paragraph 2 of section 2. They are trying to make the death penalty more applicable to illegal immigrants. It is not hard to see what will happen. \n\nNext there will be argument over what should or should not be a capital offense, and it will be pushed, and pushed and pushed. Surely you can see where this is going?",
                                                                                                                            "score": 5,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SlowMotionSprint",
                            "body": "It's not just politics.  \n  \nYou know how people where I am from justify their stance that Climate Change isn't real? By showing off a press release from ExxonMobil saying it's a hoax.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AjDuke9749",
                                    "body": "That’s exactly what I was saying. Not only is it “playing politics” roughly half the country doesn’t believe the same things the other half believe. They are convinced Covid was a hoax, that climate change is a hoax, that vaccines cause illness, etc. It is a lost cause. You cannot have a constructive conversation about real issues when people don’t believe facts.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BugPuzzleheaded958",
                            "body": "Appeasing MAGA in pursuit of the mythical centrist is the same losing pursuit that got us where we are today.\n\nA jury of 12 real-life human beings considered factual evidence and found Trump guilty of 34 felonies. That's the actual litmus test, not whatever is spouted by lunatic fringe extremists (both elected and otherwise) who get outrage-amplified news recognition. The chances that no one on that jury had voted for Trump at least once seem astronomical, and yet ultimately the justice system worked as intended at the level of common citizens.\n\nWhat clearly didn't work is SCOTUS, and any meaningful Dem plan going forward *must* have an answer for how that component of American Democracy will be realigned with the general populus rather than the highest bidder.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "AjDuke9749",
                                    "body": "Yes he was convicted, but was he treated like other people convicted of rape or sexual assault? Cause I don’t think the other felons are able to be elected as president. He faces no real consequence. He might as well not have been convicted cause nothing of substance has changed for him. Your comment has really nothing to do with the substance of my original comment.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ShiftE_80",
                                            "body": "He wasn't criminally convicted of rape or sexual assault. That was a civil trial where the burden of proof is much lower.\n\nHe was convicted of 34 felony counts of falsified business records in the Stormy Daniels hush money trial.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "AjDuke9749",
                                                    "body": "Okay, my point still stands. He hadn’t been treated like other felons.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "theequallyunique",
                    "body": "Also Americans should probably try to fix their damn democracy to keep billionaires out. The whole privately funded election campaign is bs, why is there no state funding for top candidates and harsh oversight of money flow/maximum transparency throughout?\n\nAnd how can it be that one single person gets to have that much power with these presidential orders?\n\nThe US taught Germany how to write a fool proof constitution that keeps dictators out after ww2, but apparently still uses their 200 year old version without changes?\n\nBut I guess I can wait for a long time for the most powerful person of the country to betray his billionaire friends that got him elected and then cut his own power. Hopefully there are better ways than revolting though.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "WheelyWheelyTired",
                            "body": "I definitely don’t disagree with you. However, I’d like to offer some perspective on your point about executive orders.\n\nThe problem is not the executive orders themselves. It’s that what is essentially a perfect storm scenario has been created wherein executive orders that would normally be illegal are now on the table. All because every branch of government is now essentially complicit and supportive of the president being a dictator.\n\nI do not think that the founding fathers envisioned a scenario where all branches are taken over at once and used in this manner. If they did, I’m sure they thought the second amendment would take care of it.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "theequallyunique",
                                    "body": "It's totally understandable that not every loophole has been fixed from the start on, the \"founding fathers\" were no saints either. But that means that improvements will be necessary. Having an incredibly old constitution doesn't make it better. It has even happened in the past already, but this time Trump will really have to mess up for half of Republicans to turn against him.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "WheelyWheelyTired",
                                            "body": "Oh I certainly agree that changes would be necessary if we manage to remove these folks from power. My suggestion, apart from Nuremberg style trials as I said in my original comment, is that we ought create laws similar to those against former confederates holding government positions, except against groups like Nazis. We should also explicitly remove any immunity for any government employee or official.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HazelCheese",
                                    "body": "I think likely it's the kind of situation where the Founding Fathers though \"if they control all branches of government and the highest court then they control the law anyway so what could we even write to stop them?\".\n\nAka, if the people elect dictators to every office, then that must be what the people want, and a piece of paper written by us isn't going to stop them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "getawarrantfedboi",
                            "body": "There is federally available funds for candidates, but if they take it, they can't raise money privately. Generally, they can raise more money through donors, so they refuse the public funds.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Born_Faithlessness_3",
                            "body": ">Also Americans should probably try to fix their damn democracy to keep billionaires out.\n\nThis absolutely should be an integral part of Dems' messaging for 2026/2028.  R'S intent is to gut government institutions (including ones that fund social services) to pay for tax cuts for the wealthy.  If you can't craft a winning message against that you shouldn't be in politics.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Independent-Roof-774",
                            "body": ">Also Americans should probably try to fix their damn democracy to keep billionaires out.\n\nCatch 22.  You first have to kick the billionaires out before you will be able to kick the billionaires out.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pickledplumber",
                    "body": "What have they done? So far they have just voted for a guy who found some of the biggest corruption of our lifetimes or Hitler v2 or nothing\n\nYou want a Nuremberg trial for what?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "141_1337",
                    "body": "And hold them accountable now, not in the future, not tomorrow, not in the afternoon, but now.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "spacegamer2000",
                    "body": "Democrats could try appointing a democrat to the justice department, if there is a next time. Doubt they will though.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WheelyWheelyTired",
                            "body": "I am not optimistic that, under current circumstances, there will even be a next time",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lordgholin",
                    "body": "Yep. We gotta hold the Democrats and Republicans responsible for the hate and division, and for not serving the American people as they should.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "WheelyWheelyTired",
                            "body": "Most certainly, accountability should be had regardless of party affiliation.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "zaoldyeck",
                            "body": "The American public chose hate all for themselves. Trump was always a hateful spiteful cur, and the public decided that's acceptable. \n\nWe get hatred and division as a consequence. It's what the public *wanted*, why should we pretend otherwise?\n\nPoliticians who talk about \"unity\" are far more dishonest. The US is all about animus now.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "lordgholin",
                                    "body": "Yeah. Biden also talked about unity, but he consistently had divisive rhetoric and was dishonest. That is part of why we got what we got, among the other dishonest displays of the Democrat party. It is terrible. The hate goes deeper than just individual politicians though. We are distracted and turned against each other by media and parties, all for power and money.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "neosituation_unknown",
            "body": "Does electable mean pro 2A in rural states and taking seriously border security?\n\nProgressives need to learn a few lessons before an electoral victory is possible.",
            "score": 10,
            "replies": []
        },
        {
            "author": "beggsy909",
            "body": "A progressive candidate can’t win the White House. This country is center-right on nearly every issue. And the issues they are center-left on (workers rights) the democrats inexplicably have ceded ground to the GOP. \n\nThe dems win the WH again with a Bill Clinton type. Any of those around?",
            "score": 35,
            "replies": [
                {
                    "author": "3xploringforever",
                    "body": "> The Dems win the WH again with a Bill Clinton type. Any of those around?\n\nAndy Beshear",
                    "score": 18,
                    "replies": [
                        {
                            "author": "DrMonkeyLove",
                            "body": "I think you might be right on that. If they can get someone who wants to fight for the working class and can avoid all of the identity politics outrage, they would have a good shot.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Og_The_Barbarian",
                    "body": "Could you be more specific about what issues Americans are center-right on? \n\nYou mentioned workers rights as the exception, but that includes unions, wages, parental leave and more. But there's also things like Marijuana legalization, abortion access, housing affordability, etc. that favor the left or center left. Meanwhile GOP policies are incredibly unpopular (despite the party holding a strong edge when it's characterized vaguely as \"the economy\").",
                    "score": 10,
                    "replies": [
                        {
                            "author": "BettisBus",
                            "body": "The border, trans issues, immigration, “woke” messaging.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "JamesDK",
                                    "body": "Add \"crime/policing\" and \"guns\" to that list.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Og_The_Barbarian",
                                            "body": "Again, if you keep it vague, those issues favor the center right. But when you go to specifics policies don't they favor the center left? \n\nIs there reliable polling on pardoning Jan 6 insurrectionist who attacked police? \n\nI know universal background checks have been overwhelmingly popular.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Tw1tcHy",
                                                    "body": "I really don’t see universal background checks worth even mentioning at this juncture. It’s not going to change much tangibly and it just further reinforces the anti-gun stance. Gallup says 56% favor more strict gun sales laws, but I don’t see this as a very pressing issue for the electorate.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Og_The_Barbarian",
                                    "body": "True, opinions on border security favor the right, which is why Kamala and high profile Dems have embraced increasing it. But Trump's mass deportations are already unfavored by the public, and likely to get even more unpopular. His child separation policy was horribly toxic last time. \n https://apnews.com/article/immigration-poll-deportation-trump-border-security-40b2a28e34f8d0c76b4a6589f3db1ba3\n\nThe war on woke is just the latest right wing culture war propaganda. There is no left platform saying \"make America woke\". I'd be curious to see polling on the policies Fox \"News\" calls anti-woke, like banning books, making drag shows illegal, ending diversity, etc.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "BettisBus",
                                            "body": "I wasn’t trying to sound like America’s center-right views on these issues are justified. Just simply stating where America is at. I agree with you that a lot of America’s center-right views flow downstream from Republican messaging on these issues.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "beggsy909",
                            "body": "I think with every election there are tier 1 issues tier 2 tier 3.   Tier 3 don’t really push the needle much.\n\nTier 1- inflation (economy) , immigration , tax/spending, gun control. Crime\n\nTier 2 - wokeness,  abortion, housing affordability \n\nMarijuana is tier 3 and matters very little. \n\nHousing affordability could be tier 1 but the democrats have done nothing on this and I would even argue are losing the issue to the right. The democrats do nothing about Airbnb contributing to the housing shortage. Nothing. So the right wing argument that it’s a shortage caused by democratic policies works for a significant part of the electorate. \n\nAll of those tier 1 and 2 issues the right is winning on except for abortion. Even then the democrats are not clear on abortion. When is the cut off date? They can’t answer. It’s vague “women’s right to control their bodies” stuff. Okay, but if you take that argument to its natural conclusion then there’s no cut off. \n\nI am a one issue voter. Gun control. I won’t ever vote for the GOP because of their position on this. But even gun control (to my dismay) favors the right at the moment.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Tw1tcHy",
                                    "body": "I get it’s your big issue, but I seriously doubt gun control is higher than affordable housing or even abortion in the priorities of the electorate. Agreed Democrats being too cowardly to articulate a cut off is killing them. Activists call limits “stigmatizing”. Democrats need to tell these people to shut the fuck up and propose a federal law where all states have a 12 week minimum and a 24 week maximum. States can decide where they want to be in between.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "xtelosx",
                                    "body": "Harris had some decent plans to increase housing availability and affordability. I wouldn’t say they do nothing but as you pointed out not enough.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Prysorra2",
                    "body": ">The dems win the WH again with a Bill Clinton type.\n\nThis breed of politician is *exactly why Trump won*.  Seems you're never gonna learn.  Time to lose your republic.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "TheEgolessEgotist",
                    "body": "Workers rights is not center left, unionization is directly anti-neoliberal and anti-capitalist. The reasons Democrats have been unsuccessful generally is because they are afraid to run on their own agenda, and disaffected progressives don't vote.\n\nHarris's campaign ran to the right on every issue - unending support for Israel, crackdown on immigration, embracing the endorsement of war criminals like the Cheney's.\n\nThe people who want those things though aren't going to vote for the diet version though, they're gonna support the Republicans who are even more committed to these fascist policies.\n\nThe Democrats have never been so consolidated in their fight against anyone or any agenda like they were against Bernie Sanders who would have swept Trump in either 2016 or 2020 if he was not sabotaged by the DNC in their primaries.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DickNDiaz",
                            "body": "Sanders would had not beaten Trump, he would had cost the Dems more seats because Trump and Bannon in 2016 would had loaded up against him. 2020, he was the oldest candidate in the primaries lol. And he had a heart attack before that.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "TheEgolessEgotist",
                                    "body": "Based on what? We have polling from the time showing way more overlap in Sanders' support and Trump's, because the majority of people aren't super policy informed and look for strong leaders with convictions. The Clinton and Harris campaign were weakened due to being viewed as representatives of elites who didn't care about everyday Americans. Two candidates said that free trade agreements had gutted the American middle class; two candidates said the Iraq war was a mistake; two candidates said we need to prioritize the economic power of American workers: Bernie and Trump.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "DickNDiaz",
                                            "body": "This post here says it better than I had: \n\nhttps://old.reddit.com/r/PoliticalDiscussion/comments/1ikuesi/who_are_the_young_bold_and_electable_candidates/mbsyt36/",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "TheEgolessEgotist",
                                                    "body": "The function of Clinton's \"organizing in key democratic voter bases\", and the function of the DNC overall has been that of a protection racket, intimidating voters from fighting for the policies they actually believe in, telling them real change is impossible so we should accept scraps. There priorities have been to allow incredibly popular rights to abortion and gay marriage to remain vaguely defined by courts rather than codify them into law so that the threat of their undoing could raise more campaign dollars. They have been so successful at convincing people on the left that the best we can hope for is Republicanism light that you're still here trying to tell me the same thing, meanwhile the same voters that secured DeSantis' governorship in his last election also voted for increasing the minimum wage.\n\nThe Democratic National Committee spent their political capital sabotaging Bernie Sanders and enabling Trump because they are more afraid of Bernie than Trump. Because they are corrupt and rely on funding from super PACs for big oil, big pharma, and the state of Israel.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "DickNDiaz",
                                                            "body": "So this is your version of **STOP THE STEAL**.\n\n*Leftist gonna leftist...*",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "TheEgolessEgotist",
                                                                    "body": "No, it's my version of we don't have a robust or fair electoral system in the U.S. because the two major parties act as Mafia style rackets and Citizens United interpreting money as speech allows for the most direct and effective propaganda system in the history of the world; we did not have fair primaries in 2016 or 2020 and we had no primary at all in 2024. As democrats pretended like they care about preserving democracy, they strangled it from within their own party. No wonder they are a lost cause.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DickNDiaz",
                                                                            "body": "It's your version of STOP THE STEAL, and now you're compounding that point even further. \n\nSanders could had always ran as a true Independent 3rd party candidate. Because he is an Independent. Funny how Bernie Bros never hold him to account for that.\n\nEdit: and hey, Trump has a \"concept of a plan\" for health care, Sanders could dust off his old plan for it and hand it to Elon, they can scrub it through the AI to make it more efficient, and propose that to Trump. After all, *Sanders isn't a Democrat*.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TheEgolessEgotist",
                                                                                    "body": "Actually I do criticize him for that. I think his one flaw was trusting the Democrats to be fair. He should have done what Trump did and said he'd run as third party if he lost the primary.\n\nIt's not stop the steal because I do not believe the votes were stolen, I believe the Democratic voter base has been lied to, abused, and demotivated by our leaders for years.\n\nWhich is why we don't have any leaders today, and Bernie remains the most consistently popular person in politics by miles and miles.\n\nYour view appears to me as one of two: the right is just better in the minds of voters and deserves to win elections; or that democracy doesn't work and shouldn't be the system of American politics. You have no perspective on why the Democratic party is so unpopular today, you're just so used to punching left you don't know how to do anything else.\n\nMy view is that unbridled capitalism, and the incorporation of neo liberal capitalism into the democratic party has shaken the foundations of fair democracy in which this nation was built. The cowardice of the Clinton's and their acceptance of Reagan's worldview, carried over by Obama, is why we have Republican & Republican lite parties, and no one representing the working class.\n\nDone with this though, hope you can get your head out of your ass before the next election, if we still have those in three years.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DickNDiaz",
                                                                                            "body": "> It's not stop the steal because I do not believe the votes were stolen, I believe the Democratic voter base has been lied to, abused, and demotivated by our leaders for years.\n\nYou sound more MAGA each reply. Just with a Leftist/Marxist POV, but also blaming Clinton and Obama, which Trump also does. \n\nThe bottom line is: people vote with their wallet, not to have someone like Sanders say they have to play trillions of dollars for his pipe dreams that he knows will never, ever get passed through congress. \n\nEdit: BTW, Sanders is just another rubber stamp for the Dems, that's why they don't run a Dem against him. So I don't know what you're complaining about when it comes to the Dems lol. \nBut again, he can always go the the Republicans with his brand of half baked Socialism. If he can't get the Dems there, maybe he can get JD Vance's New Right bros there.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "TheEgolessEgotist",
                                                                                                    "body": ">people vote with their wallet\n\nAnd Israel votes a lot for not being made up of U.S. citizens.\n\nIt's almost like when the party that is supposed to be going after robber barons and colonial apartheid states is instead taking their money to get elected while promising \"nothing will fundamentally change\" they demotivate their voting base.",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "DickNDiaz",
                                                                                                            "body": "Sanders is pretty much a rubber stamp for the Dems, that's why they don't run another Dem against him (also because Vermont has a Republican gov who crushed a progressive against him that past election), so I don't know why you're complaining about Dems when he's right there with them *as an Independent*. Again, he could had ran as a 3rd party, that would had shaken things up more than try to split a party. It would had been a true anti-establishment campaign, even though he is a career politician and very much ingrained with the establishment.\n\nEdit: Bernie Bros blame the Dems for letting them down over Sanders. Maybe it's Sanders himself who has let you down. By not being Independent.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "TheEgolessEgotist",
                                                                                                                    "body": "So we're in agreement then. The future leaders of the left will have to be MORE progressive than Sanders. Glad you came to my side of things.",
                                                                                                                    "score": 3,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "DickNDiaz",
                                                                                                                            "body": "I think the Sanders type progressives should form their own party, take advantage of Citizens United, and have Ocasio-Cortez lead it. Bring in all the DSA types, Marxists, Trotskyites, all those fringe groups, even resurrect movements like Occupy Wall Street. The reactionaries online are already calling for it, just look at any random comment section at The Daily Kos or BlueSky. They want Ocasio-Cortez, Jasmine Crockett (which I dunno if she would want to join that, but whatever), and David Hogg. \n\nAnd hey, I'm all for it. I wouldn't vote for them, I think they would get crushed and further the New Right in dominance, but you will get yours and the fever dream of MAGA splintering a party because of Bernie Sanders lol.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "BugPuzzleheaded958",
                                                                                    "body": "That is an utterly absurd suggestion in our super-PAC-funded FPTP electoral system.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DickNDiaz",
                                                                                            "body": "A third party can't have Super-PACS?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "beggsy909",
                            "body": "I’m not talking about unionization when I talk about workers rights. Im talking about policies like guaranteed PTO for all workers, FMLA, guaranteed overtime pay. All of these the right is against and all of these are very popular with the electorate. But who was the last candidate to make something like guaranteed PTO part of their platform? \n\nThat’s where we agree. Bernie Sanders. The Democratic Party is still dealing with the disgrace of the 2016 primary. \n\nAnd yes Harris tried moving to the right but it was so laughably obvious it just pointed out how inauthentic she was. And the embrace of the Cheney’s as part of her campaign is even more bonkers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Newscast_Now",
                    "body": "I just got done correcting an apparent progressive. Now time to correct an apparent moderate:\n\nOn issues, Americans tend to be progressive. On candidates, Americans tend to be moderate. We know this based on the fact that Americans repeatedly vote for progressive policies and moderate or even conservative candidates on the same ballot.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "beggsy909",
                            "body": "What issues that matter in national elections are Americans progressive on?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WingerRules",
                    "body": "Gretchen Whitmer\n\nThough I'm guessing the DNC is going to be wary of running another woman for President next time around unless they win through an actual primary process.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "boyyhowdy",
                    "body": "Hillary Clinton and Kamala Harris",
                    "score": -5,
                    "replies": [
                        {
                            "author": "l1qq",
                            "body": "As a straight ticket R voters I 100% fully support either or both of them running. They are both a perfect storm of incompetence and unlikeability.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tlopez14",
            "body": "It should be obvious but someone who’s willing the Buck the Democratic establishment. The most momentum the Dems have had since Obama was Bernie but they shut him down. Throwing out their preferred corporate friendly neoliberal candidate isn’t going to work any more. \n\nI don’t know who that person is. Bernie is definitely too old now. I know that nominating someone like Kamala or Newsome would be exactly what the GOP wants though.",
            "score": 23,
            "replies": [
                {
                    "author": "TheOvy",
                    "body": "> The most momentum the Dems have had since Obama was Bernie but they shut him down\n\nThe reality of Bernie's loss must be confronted: he didn't have the votes. He kind of came out of nowhere in 2010 or 2011, when he did that grandstanding filibuster. That's the first time anyone had really heard of him outside of Vermont. Now, if you're Obama, this once in a generation political talent, that's enough time to build a coalition. But what did Bernie do? He wrote a book and went back to being a curmudgeon in the corner of the Senate. Voters still didn't know who the hell he was five years later when he ran in 2016. \n\nThe reason Bernie lost to Hillary, is actually the same reason why Hillary lost to Obama in 2008: he got absolutely obliterated in the black vote. It is the most loyal Democratic constituency, they are a crucial part of the coalition, and they're well organized when it comes to primaries. When Bernie first started running, none of them knew who he was. But Hillary? They all knew who the fuck Hillary was. They love the shit out of the Clintons, and had done so for decades at that point.\n\nA lot of younger voters won't remember this, but [Bill Clinton was described as the first black president](https://thehill.com/homenews/race-politics/5004618-bill-clinton-first-black-president/) He and Hillary's tenure in Southern politics goes back to the '70s, they've been fighting hard on their behalf for a very long time. When Bill Clinton ran for the presidency in the early '90s, they already knew him pretty well, and he was actively speaking out on issues they cared about. Younger voters today point to those strict crime laws, but black voters actually wanted those laws back in the day (though obviously not the unintended consequences that absolutely demand reform today). Their communities were being ravaged by violence and they wanted more policing. Younger voters gave Hillary shit for using the word super predator back in the '90s, but that's the word communities used back then. They were being shot up, and they wanted help. Bill Clinton promised to deliver on that help, and for a time, it seemed like he did, as crime collapsed over the decade. (Though again, they overshot by incarcerating way too many people, and we are still in need of dire criminal justice reform).\n\nYounger voters like that one photo of Bernie protesting in the name of civil rights back in the '60s in Chicago. However, in the communities of black voters, he had been absent ever since. They didn't know him, they weren't impressed by just the one photo. But what did Hillary do when she got out of law school? [She went down to South Carolina and did pro bono work to help black kids get fair treatment in the juvenile Justice system.](https://www.heraldonline.com/news/state/south-carolina/article92848387.html).  She was there, when Bernie was in Vermont, one of the whitest states in the country. So when The 2016 South Carolina primary came, where most of the Democratic electorate is black, and they had to choose between Hillary, who had a history in that state of helping their communities, and Bernie, who they had never fucking heard of, of course she fucking blew him out by nearly 50 points. Why the hell would you expect a different outcome? \n\nThe only way Hillary was ever losing is if a once in a generation political talent in the form of an equally well-educated black man also ran for president. Incidentally, all the states Bernie lost in the South that have a majority primary electorate? Hillary lost to Obama. But in 2016, she won them. That's the difference.\n\nSo if you want to know why Bernie lost, it's not some grand conspiracy by the DNC. It's because the Clinton machine had been organizing in key Democratic constituencies for decades by the time the year 2016 rolled around. Where was Bernie? He hadn't organized jack shit. Come 2020, Biden beat Bernie even harder than Hillary did. Hillary had an early sign of weakness in Michigan in 2016, where Bernie carried almost every single county. But in 2020, he lost every single county to Biden. In the 4 years between 2016 and 2020, Bernie's organization had only gotten weaker, and despite the overall primary turnout being much higher, he finished almost 4 million votes behind his 2016 total. The only momentum there was going in reverse.\n\nSo when we're arguing over who should be the progressive candidate for 2028, it's not going to be the person whose soundbites  you most often agree with, it's going to be the person's best able to build a winning coalition. Bernie couldn't do it. Here's hoping someone like AOC can - and thus far, in her young career, she has spent far more time doing so than Bernie ever did when he was a younger man in the House. She's got a wide national profile, and she does consistent outreach with great communication. She even won her first election by going door-to-door, wearing out the soles of her shoes multiple times. That's real organizing. That's how you win a goddamn campaign. She's also currently trying to work her way up the ladder in the House leadership, vying for ranked positions on committees. By the time she's 50, she's going to be much better positioned than Bernie has ever been his entire political career. \n\nI am a progressive myself. I voted for Bernie in 2016. But we're not going to win elections if we keep putting our heads in the sand. We only win if we look honestly at why we lose, and blaming the DNC establishment as the sole cause ain't it. Bernie lost by 3 million votes to Hillary Clinton. That's a substantial margin. And Biden beat him even harder: 10 million votes! He was never going to be the hero we needed. He just didn't have the political skill, even as he was saying things we otherwise agree with.\n\nOur future leaders won't just be people who have an occasional viral moment. It's going to be the people who actually organize voters, and get them to show up en masse. And when we talk about the Democratic establishment, we have to understand that it isn't just the elites in the party. It's a large segment of the voter coalition. We live in a center-right Nation, and so part of the essential task of progressivism is to persuade these voters that our policies are in their best interest. We have a lot of work to do. We got a lot of doors to knock on. It's possible, but not with finger pointing.",
                    "score": 54,
                    "replies": [
                        {
                            "author": "bilyl",
                            "body": "As a super left wing person, it doesn’t help when people blame it on conspiracies when your preferred candidate doesn’t win. It’s common now to not take accountability when you lose, and blame it on the other side. The truth is that organization matters and the history of a region matters. It’s also why Trump won against Kamala.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "TheOvy",
                                    "body": "Yep. This is exactly why I wrote my comment. It's also why I push back against people claiming the 2024 election was rigged. If you don't understand why you lost, then you can't fix your mistakes before the next election.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "bilyl",
                                            "body": "Yup, in hindsight, running on “well, inflation is lower now” is a stupid talking point when the thing that people actually care about is not the rate of price increase but the total price change of eggs between 2021 and 2024.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JamUpGuy1989",
                            "body": "The fact we're STILL on this Bernie shit 9 years later tells me two things:\n\n1) People want to keep their head in the sand and bitch about one candidate that didn't get the spotlight in their view.\n\n2) Lots and lots and lots of bots making sure no one can not complain about something from nine years ago.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "CaptWoodrowCall",
                            "body": "Thank you for taking the time to write this out.  Bernie wasn’t robbed. He couldn’t put together the coalition or get the votes he needed to win. And when the time came for him to prove that he could rise up vs Biden in the 2020 primary, he lost. Badly. It was Biden vs Bernie, one on one in Michigan…a critical bellwether the the Dems had to have to win. \n\nBiden didn’t just win, he won every single county in the state. To me, this told\nme everything I needed to know about Bernie’s appeal. A mile deep but only a foot wide. \n\nI don’t dislike the guy, and I’m fine with his views getting a seat at the table in Congress. But there simply isn’t some massive socialist groundswell waiting to happen in this country that would sweep him into the presidency “if it weren’t for those meddling moderates.”",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Adonwen",
                                    "body": "Race was over by super tuesday - MI primary was the week after. This isn’t the gotcha you think this is. The bold politics with the SC primary was the end of Bernie in 2020. That was the “meddling moderates” play.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "11bulletcatcher",
                            "body": "[Bernie could have won](https://static01.nyt.com/images/2019/08/08/us/2020-democratic-fundraising-promo-1564702829775/2020-democratic-fundraising-promo-1564702829775-facebookJumbo.jpg?year=2019&h=549&w=1050&s=7562bf74dbecfc84bb2e0ee0cba5c6d6a78f81d3c3cfee7285ee8376569435e9&k=ZQJBKqZ0VN)\n\n(Democratic small donor heatmap 2020)",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "MundanePomegranate79",
                                    "body": "Small donors is a poor predictor of electoral performance. I’m pretty sure Kamala had far more small donors than Trump and it didn’t matter.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "11bulletcatcher",
                                            "body": "I can't find a similar heat map for Harris yet, however, I think what's important to note is the overlap that Sanders has with red states as well. I'd love to give you a visual comparison of Sanders/Biden/Harris/Trump but it seems there isn't one at the moment for us to go over. My point is not to relitigate  Sanders' presidential run but more to say his message is popular in the entire country, including states Democrats barely campaign in and don't care about, and including states that Trump has won in. I reject the notion that at it's core America is a center-right nation, as I think it's a bit more complex than that, and I think these wild swings of the pendulum are indicative of that. People are looking for big changes, anywhere they can get them. Americans might be center-right on cultural issues, but I think there's a core set of economic and labor interests that are much more universal, which people like Bernie have successfully spoken to. I do agree with you that AOC has been speaking on it and doing a better job coalition building though, but the GOP has identified her as a threat for a while now and I has put a lot of effort into making her out to be the next Hillary bogeywoman.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "DickNDiaz",
                                                    "body": "The GOP doesn't fear Ocasio-Cortez, anyone affiliated with the DSA is going to be ripe fodder for them like it was chum for sharks.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ClockOfTheLongNow",
                                    "body": "Donations don't vote.  Sanders had a wide, shallow coalition.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Adonwen",
                                            "body": "Define wide and shallow. He had a multicultural, multiracial coalition that didn’t turn out?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ClockOfTheLongNow",
                                                    "body": "He had a lot of energetic people who had absolutely no persuasion beyond each other.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Adonwen",
                                                            "body": "That would be deep and narrow. More cult following than lukewarm general appeal.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "ClockOfTheLongNow",
                                                                    "body": "Wouldn't be the first time I've messed up a metaphor.  You nailed it.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "11bulletcatcher",
                                            "body": "I suppose we'll never know how he would have done, since that fight is well over now.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ClockOfTheLongNow",
                                                    "body": "We know how he would have done, he couldn't even get a majority of Democrats to vote for him.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdUpstairs7106",
                    "body": "I don't think Newsome can win a general election with the EC.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Medical-Search4146",
                            "body": "Unless something drastically changes in the next 4 years where majority of the nation comes out thinking \"Yes we need a California Progressive elite\". Something, as a Californian, I find almost impossible.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "AdUpstairs7106",
                                    "body": "I was born in California and have family there. I am getting thumbs down for saying Newsome can't win. \n\nIt is the rules of the game. The EC works against him.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Medical-Search4146",
                                            "body": ">It is the rules of the game. The EC works against him.\n\nThis is probably why you're getting thumbs down. This is a poor argument to why he can't win as it doesn't address the exact reason why the EC works against. For me, he is the epitome of \"California Progressive elite\". Something which has the same negative connotation as if a Texas Republican running for President. They represent the extremes of the status quo. If people want the middle or not the status quo, they aren't going to vote for those individuals.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lr20005",
            "body": "The governor of Kentucky, Andy Beshear, is a good candidate for next president. He’s a moderate Democrat and would be palatable to a wide range of people. Going with a far left candidate is a big mistake imo. People are tired of progressive agendas, and after trump will also be tired of the far right. I think a moderate will win the next election, if we have one.",
            "score": 16,
            "replies": [
                {
                    "author": "ManBearScientist",
                    "body": "Policy is not that important. People don't simply elect the candidate whose views are the most palatable or least offensive to the widest cohort of people. They go to the polls because they are excited.\n\nModerate Democrats that promise mild-mannered bipartisanship and at best incrementalist policy shifts are about as inoffensive as it gets. But that is also a terrible pitch if you are trying to being people to the polls.\n\nWe've seen three run to the middle campaigns against Trump. The only one that worked promised change, change to normal politics from Trumpian politics. Even then, it was extremely narrow. I fear Beshear would run another boring campaign to the middle and fail to generate much excitement. \n\nIn my opinion, the ideal Democratic candidate wouldn't even campaign on policy. They'd drum up the feelings of hope and change without committing to slate of agenda items, letting moderates read moderation and progressives read progressivism into their words.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "11bulletcatcher",
                    "body": "There hasn't been a progressive agenda. Name one progressive project dems have proposed and ran on? The last one was the Green New Deal and the Dems crushed that movement with republican help. Moderates and current dems are offering  nothing to the people and no alternative to Trumpism.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Newscast_Now",
                            "body": "> the Dems crushed that movement\n\nFalse, as some GND managed to pass through the tight 50-50 Senate.\n\n>Moderates and current dems are offering nothing to the people and no alternative to Trumpism.\n\nFalse, as 'both sides same' or 'both sides too alike' is impossible nonsense and cannot be taken seriously.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ClockOfTheLongNow",
            "body": "Most of the problem here is that \"bold\" and \"electable\" are not things that can get progressives into office outside of a few districts.  If Democrats want to win more, they need to field candidates who are where the voters are, not keep pushing toward candidates on the fringe.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Magazine9625",
            "body": "Josh Shapiro and Gretchen Whitmer have to be your top tier candidates, as they are reasonably progressive governors in critical swing states.  You can argue they're too centrist or establishment or whatever, but the reality is, you likely can't win a presidential election with any further to the left.",
            "score": 3,
            "replies": []
        },
        {
            "author": "A1Protocol",
            "body": "You need someone with balls and true convictions.\n\nAlexandria Ocasio-Cortez.",
            "score": 4,
            "replies": [
                {
                    "author": "DrMonkeyLove",
                    "body": "She is completely unelectable in the general. She would give us President Vance.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "A1Protocol",
                            "body": "This reply tells me you’re not familiar with her views and actions.\n\nI correspond with her a few times a year and she’s nothing like the pedophiles and neo-nazis in Trump’s entourage.\n\nNice try though.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "DrMonkeyLove",
                                    "body": "I am familiar with her. Your reply tells me you are out of touch with the average American voter. This is a country where Donald Trump just won the popular vote. AOC would have to overcome that.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "A1Protocol",
                                            "body": "[An estimated 89 million Americans, or about 36% of the country’s voting-eligible population, did not vote in the 2024 general election.](https://www.usnews.com/news/national-news/articles/2024-11-15/how-many-people-didnt-vote-in-the-2024-election)\n\nLearn to seek verifiable data before making an argument.\n\nTrump won on fear-mongering and a cult of personality catering to uneducated voters.\n\n[College-educated and college-aged voters overwhelmingly favored Vice President Kamala Harris in the 2024 presidential election, exit polls show.](https://www.insidehighered.com/news/government/politics-elections/2024/11/08/men-and-white-people-vote-differently-based-education)\n\nIf you’re not equipped for this conversation, don’t start it.\n\nHappy Sunday!",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "DrMonkeyLove",
                                                    "body": "What? Yes,a lot of people didn't vote. Donald Trump won the popular vote. That is a fact. He got more votes than anyone else.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "i_was_a_highwaymann",
                                    "body": "Unfortunately any \"she\" would be unelectable in this country for some time. It doesn't matter who it is specifically, this country hates women on so many levels. They won't elect one for another 100 years",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "aarongamemaster",
            "body": "... you need someone that can get the kingmaker of the Dems behind them, and no it's not the Progressives. It's the African American vote.",
            "score": 3,
            "replies": []
        },
        {
            "author": "alpacinohairline",
            "body": "AOC, Shapiro, Whitmer, Ossof, Jon Stewart and maybe Jack Schlossberg. We need to go big like MAGA did. ",
            "score": 5,
            "replies": [
                {
                    "author": "Og_The_Barbarian",
                    "body": "Most of those are currently in office, there isn't a need to promote them for 2026. Jon Stewart has been floated for a long time, I'd love to see him run - but he lives in New Jersey, so he'd be primarying existing Democratic senators.\n\nI don't have better answers. Partly because the progressive candidates we've heard of who aren't already in office LOST their primaries or elections.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Medical-Search4146",
                            "body": "> Jon Stewart has been floated for a long time\n\nHe's a great critic and lobbyist but he seems like a terrible politician. He doesn't come off as the guy willing to compromise and strategize that is required for a politician.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "GuestCartographer",
                                    "body": "As opposed to the guy currently in office? Compromise is dead. MAGA won’t budge on anything and they’ve fully absorbed the GOP. There is no reason that the Left’s candidate should be held to a different set of standards.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Medical-Search4146",
                                            "body": "My counter-argument is.... do you think Jon Stewart can pull what Trump did? I don't think so. While I respect Jon Stewart, he hasn't shown to be anything outside of a critic and a lobbyist for very specific causes.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "GuestCartographer",
                                                    "body": "I wasn’t talking about Stewart specifically. No, I don’t think he could do what Trump did, but that’s not my point.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WingerRules",
                            "body": "Stewart is good at talking and presenting but if you listen to his Podcast he's far more leftwing than he lets on via his image on the Daily Show. He has so many sound bites they can use against him, like questioning the free market and capitalism. He's also straight up said he has too many skeletons in his closet to run, and I think he was serious.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "leanman82",
                    "body": "Jon Stewart was a massive liberal force in 2000s.... all the viewers who watched him are now old enough to look back at him and want him to be president. I approve of this. But he keeps saying one old guy to another ... yada yada comedy schtick, but man I wish he would channel his energy to frame control Trump on world stage. Troll your heart out.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DickNDiaz",
                    "body": "That's like a murderers row for the anti-Zionists to chew on.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kapuchinski",
            "body": "Obviously AOC has the good looks, nice hair, being attractive, and social media traction to be the only Democrat capable of gaining a donor base who can spend hundreds of millions to exploit media partisanship to twist narratives and full-court press the news cycle into a perceived victory.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Privacy_Is_Important",
            "body": "There are candidates for Working Class values right now!\n\nNational Ground Game \n\nhttps://www.nationalgroundgame.com\n\nThey are looking for volunteers and can help you find a local group. \n\nSome of the elections are this year on April 1st.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Independent-Roof-774",
            "body": "At least you're asking the right question.   It's about candidates, not ideas and policies.  \n\nDemocrats overthink things.   It would be great if we lived on Planet Vulcan and everyone was logical and data-driven.  Democrats can't bring themselves to admit that voting is based on \"vibe\" emotions, gut feel, tribal loyalties, fears and hatreds and other stuff that's not consistent with The Enlightenment's visions of man as a rational utility maximizer.   Democrats would bring Powerpoint slides to a knife fight.\n\nBut the GOP have no trouble embracing that.\n\nThe Democrats need bold and young, yes, but also charismatics and a good talkers.    They also need some leaders who  can organize and lead hard-hitting attacks for example against Trump's tariffs or the Doge, and keep fellow Democrats in line.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bimlouhay83",
            "body": "I really don't want to, but I'd run. I have no real credentials other than living life as a regular person. I don't have enough money to run a campaign. The Democrat party would most likely black ball me since I've never been one to conform or fall in line. I have a sketchy past, but im a good person today. My sketchy past made me, so I'm also not shy to talk about it. I'm just an honest whiskey drinking, gun owning, union laboring, divorced dad that wants to see true reform in the party and the nation that has ideas and is open to honest criticism. But, God damn, I really don't want to do it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "ceccyred",
            "body": "At this point, anyone but a Republican. The garbage man? You bet. The dog catcher? Can't be any worse. The local bartender? Eminently more respectable. I'll never vote for another Republican for as long as I live. They know it and don't care. That's why they're doing everything in their power to subvert Democracy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deathtomollyhale",
            "body": "Ron Wyden in Oregon needs to be replaced; you know how many times that guy should have called me by now??",
            "score": 1,
            "replies": []
        },
        {
            "author": "SunderedValley",
            "body": "Put Kyle Kulinsky from Secular Talk in. Dude loves to yap, knows a lot of people and doesn't have a history of weird bullshit.",
            "score": 1,
            "replies": [
                {
                    "author": "DickNDiaz",
                    "body": "A dude that colors his hair?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SunderedValley",
                            "body": "I mean after all is said and done that's hardly too out there.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "DickNDiaz",
                                    "body": "He seems kind of a kook to me, his YouTube channel pops up on my feed every once in a while, and it takes me all of 2 minutes to find the cringe.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ImprovPortland",
            "body": "For President, I don't think anyone who's already been elected as a Democrat could win. I think once you get outside of hardcore democratic voters, there's simmering rage at the establishment that is going to crush anyone who's seen as being part of the machine. The democrats need an outsider to \"take over the party\" like Trump did. Except, someone who isn't a lunatic. They aren't young, but people like John Stewart or Killer Mike. And they would need to actually care about the working class again, instead of just saying that they do while not helping them.",
            "score": 0,
            "replies": []
        },
        {
            "author": "_Sippy_",
            "body": "There are none, the Democratic Party has been taken over by Neofascist Liberal. Whose only purpose is to serve the donor class.",
            "score": -7,
            "replies": []
        },
        {
            "author": "flexwhine",
            "body": "there are none, the left is dead worldwide. The right has won it's their world now",
            "score": -1,
            "replies": []
        },
        {
            "author": "maybecrf",
            "body": "I will most likely vote for and support whoever Nina Turner endorses, as she seems unlikely to run but still seems to have her finger on the pulse of the progressive movement",
            "score": 0,
            "replies": []
        },
        {
            "author": "hopelessoyster",
            "body": "I don’t know. I was really liking everything Marianne Williamson had to say, and I really wanted to vote for her but didn’t get the chance unfortunately. She isn’t young but she makes a lot of sense and has everything I would want in a candidate from what I’ve seen of her.",
            "score": -14,
            "replies": []
        }
    ]
}