{
    "title": "Why is West Virginia so Trump-Supporting?",
    "author": "NoiseHonest6485",
    "subreddit": "PoliticalDiscussion",
    "rank": 9,
    "score": 324,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 325,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1ilx3sc/why_is_west_virginia_so_trumpsupporting/",
    "id": "1ilx3sc",
    "selftext": "From 1936 to 2000, West Virginia voted democrat reliably. Even until 2016, they voted for a Democratic governor almost every year. They voted for democratic senators  and had at least 1 democratic senator in until 2024. The first time they voted in a republican representative since 1981 was in 2001, and before then, only in 1957. So why are they seen as a very “Trumpy” state? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Da_Vader",
            "body": "WV is coal country and when the science led everyone to abandon it, GOP jumped in to be the savior.",
            "score": 515,
            "replies": [
                {
                    "author": "Raichu10126",
                    "body": "Yeah Al Gore was also a strong advocate for the environment which was counter intuitive to the Coal Mining businesses in WV. After that, the Dems really struggled there.",
                    "score": 161,
                    "replies": [
                        {
                            "author": "jordanpwalsh",
                            "body": "In retrospect - wasn't it going to die anyway? Maybe better off to just let it happen quietly versus making a big deal about it where the wink wink was all the unemployed people.",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "Raichu10126",
                                    "body": "Yeah but imagine, if Gore won WV.. he just needed 3 EVs and WV had 5… I always look at that map aside from Florida and look at other places Gore could have won and WV and NH were two places",
                                    "score": 61,
                                    "replies": [
                                        {
                                            "author": "EJ2600",
                                            "body": "He did win Florida. They just stole it from him",
                                            "score": 24,
                                            "replies": []
                                        },
                                        {
                                            "author": "DeadassYeeted",
                                            "body": "Tennessee too, it was his home state after all",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "lostwanderer02",
                                            "body": "New Hampshire was more winnable for Gore. Had just half of the Ralph Nader voters in that state voted for Gore then Gore would have won New Hampshire's 4 electoral votes and been elected President. Florida would have been irrelevant. A shame that was the one presidential election in the past 30 years that New Hampshire went Republican 😔",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jscummy",
                                    "body": "The problem is the former coal miners prefer hearing \"the evil libs are banning coal and we'll save your mine\" over \"coal is dead regardless and you need to find a new livelihood\"\n\n\nThere were retraining programs to move coal miners into new jobs even and most of them rejected the idea in favor of \"coal is coming back\"",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "BluesSuedeClues",
                                            "body": "It's the same thinking as the people who imagine a manufacturing boom is coming back to the United States. We lose 10 jobs to automation for every job we lose to outsourcing. Those jobs are never coming back.",
                                            "score": 24,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "rainorshinedogs",
                                    "body": "Excuse my ignorance, but what would you use it for other than powering a furnace?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "SkiingAway",
                                            "body": "It's almost entirely used for power generation.\n\nA small (<10%) portion of it is used in steel or chemical production, although that's often of a specialty/higher quality grade.\n\nCoal furnaces for domestic heating are nearly defunct in the US (+ most developed countries) - NPR estimated at <130k households in the US still using it in 2019 - or about 0.1%.",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "wrt_reddit",
                                                    "body": "My grandmother in the UK used it in the 1960s to heat her kitchen and LR (no central heating). Maggie Thatcher came to power in the late 1970s and began closing coal pits nationwide. WV and the GOP (and Manchin) just refused to see the writing on the wall in the US (it was also political expediency). Change is a bitch. But personal economic decimation is potentially an extinction level event. I think Darwin had something to say about that.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "troubleondemand",
                                            "body": "Stocking stuffers for MAGA family members?",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "OsamaBinWhiskers",
                                            "body": "Coal power plants",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "PhishCook",
                                            "body": "electricity generation.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "CliftonForce",
                                            "body": "If we actually do run out of oil before running out of coal, it could be used to make plastics.   But that would be some really expensive plastic.\n\nSimilarly, anything you do with oil *could* be done with coal, but generally at an increased cost and less efficiently.      The process generally goes \"Step one:  Convert coal into oil at great cost....\"\n\nIt's mostly useful for making electricity.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Nekokamiguru",
                                    "body": "That is basically the problem , the democrats wanted to score political points by shutting down mines early when they were still sort of profitable rather than wait for the industry to die a natural death several years later. \n\nAnd the smug comments like \"learn to code\" really sealed the deal and made them lifelong Trump supporters when he promised to bring blue collar jobs to their area that they could actually do.\n\nWith hindsight just converting all the US power plants to natural gas and letting a lack of demand for coal end the industry would have been smarter. But cheap political points had to be scored, so they went with the headline grabbing plan that made them look good to their base.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "GuyInAChair",
                                    "body": "Ya, and in what mines are still producing coal technology is killing jobs just as effectively as anything else. Where once you needed hundreds or thousands of people to operate a mine now it's dozens operating huge machines that do the work of what used to be many human laborers.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "wrt_reddit",
                                    "body": "Haven't you heard, DJT is going to make coal great again.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Identity_X-",
                                    "body": "Depends on which one you care about more - the Great Barrier Reef and the existence of polar bears as a species or winning West Virginia's electoral college points.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ol_dirty_applesauce",
                            "body": "It was his stance on gun control too.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "vsv2021",
                            "body": "Attacks on fracking are partially why Dems are losing a lot of ground in PA. Electorally you simply cannot afford to attack fossil fuel industries",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Ok-Occasion2440",
                            "body": "Why not bring in OTHER jobs for them. I know easier said than done",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "rainorshinedogs",
                            "body": "In other words, they are big fans of the seven dwarves",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "roehnin",
                    "body": "When the Dems realistically said coal is going away offered job re-training, GOP jumped in to say they would save coal jobs, yet coal is not cost-effective and still decreasing anyway despite promises. A few jobs were saved short-term, but long-term it still will vanish.",
                    "score": 113,
                    "replies": [
                        {
                            "author": "Tobar_the_Gypsy",
                            "body": "There are realistically only like 40,000 coal jobs in the entire country ",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "garyflopper",
                                    "body": "Huh, had no idea about that number",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Aureliamnissan",
                                            "body": "Yep. Even back when it was a heyday issue I remember looking it up and finding that Arby’s employed more people than the entire coal industry. \n\nThe real issue is that Dems turned their backs on Unions in the 90s and even though they’re still the only game in town they shot a lot of the goodwill they had gathered up to that point.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "well-that-was-fast",
                                                    "body": "WV isn't a particularly unionized state with less than 9% of workers in unions and the state having passed a right to work law.\n\nGiven that Trump won WV by nearly 40 points, it's unlikely Dems moderating slightly on union support mattered there.",
                                                    "score": 27,
                                                    "replies": [
                                                        {
                                                            "author": "Aureliamnissan",
                                                            "body": "Honestly this was more Reagan than anything, but it used to be as high as 40% as with much of the Midwest\n\n> https://www.npr.org/sections/money/2015/02/23/385843576/50-years-of-shrinking-union-membership-in-one-map",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "well-that-was-fast",
                                                                    "body": "I'd agree and suggest perhaps Dems \"over-interpreted\" Reagan's win over Mondale with respect to what it meant for unions.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "IceNein",
                                                    "body": ">The real issue is that Dems turned their backs on Unions\n\nDo you have examples of this, or are you repeating Republican disinformation?",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "ChebyshevsBeard",
                                                            "body": "The unions soured on Clinton after NAFTA and the inclusion of China in the WTO. These free trade agreements are major contributors to the hollowing out of American manufacturing, and NAFTA probably lost Congress for the Democrats in 1994.\n\nClinton also succeeded somewhat with his promise to \"end welfare as we know it,\" by working with Republicans to give more responsibility to states, add stricter lifetime limits, and introducing work requirements.\n\nAlso shouldn't forget all the deregulation under Clinton. The Telecommunications Act of 1996 paved the way for the massive media consolidation that gave us Fox and Sinclair. The financial deregulation in 1999 also led in a straight line to 2008. Not sure how the Unions actually felt about that, but in hindsight these things also look like a betrayal of the working class.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "Safe_Froyo_411",
                                                                    "body": "This is interesting.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "TreeLooksFamiliar22",
                                                            "body": "So Clinton came from Arkansas, which was very anti-Union.  Obama from Illinois, but he was not going to bleed for any particular issue.  Democrats embraced new-tech, which they saw as intrinsically liberal (see Musk, Leon, for a glimplse of how that turned out), and which is non-union.  Biden was more pro-Union than any Democratic President since FDR (the rest of them all had their issues with organized labor, including Harry Truman and the coal miners), but his sun set on the job.\n\nCulturally, the Democrats became a white collar party, lately of the Zoom or Microsoft Teams class, and those who have to work at a job site, with their hands, have no obvious champions in the current party.\n\nGive me the name of a big time Democrat who actually put time getting callouses on their hands, and who talks like this affected who they are.  You can't.\n\nNow on the GOP side it is all performative, but as performances go, it has been convincing enough.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "my_lucid_nightmare",
                                                                    "body": ">You can’t \n\nFetterman. Tester (though he lost). I’m sure there’s a few more. \n\nThe problem though is while there are lots of Dems at the more local levels in some states that fit this, at the DNC it’s usually the elitist white collar, MSNBC pundit style class. And that’s the problem.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "epistaxis64",
                                                                            "body": "This is nothing but hard right fox news talking points",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "my_lucid_nightmare",
                                                                                    "body": "> This is nothing but hard right fox news talking points\n\n\nSo you're not wrong, but you're completely missing the point.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "TreeLooksFamiliar22",
                                                                            "body": "Fetterman?  The Republican?  LOL\n\n\nWe agree about the top ranks of the DNC being peopled by Ivy League Liberals who would be Republicans if the party had not made itself inhospitable to them.  Such is there aversion to working class culture that they acknowledge it only as an abstraction.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Aureliamnissan",
                                                            "body": "https://en.m.wikipedia.org/wiki/Third_Way",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PedanticPaladin",
                            "body": "It was never about saving coal jobs, it was about preventing coal mine owners from bankruptcy when the value of their land plummets; return-to-office is the same thing but for commercial real estate.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Corellian_Browncoat",
                                    "body": "> return-to-office is the same thing but for commercial real estate.\n\nNo, RTO is about reducing employee counts without directly firing people (and paying severance or unemployment) because the employees \"quit\" or \"abandoned their jobs.\" Commercial real estate is a consideration, but as a side issue.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "anti-torque",
                            "body": "I think everything was fine until the \"job retraining\" turned into either a boondoggle or simply did not become manifest in most parts of the state.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "BeltOk7189",
                                    "body": "Speaking pretty generally here: Once you get above a certain age, many people just stop having any desire to learn new shit. Especially when it's as hard as training for a new career.\n\nI say this as someone who works in public schools. A place that allegedly values learning. We (even teachers) joke a lot that teachers are some of the worst students.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "anti-torque",
                                            "body": "Yeah... that's not what happened in WV.\n\nEven if they were willing, once the election cycle ended, they were mostly forgotten. Some crony private \"educators\" were given access to the displaced labor, and that has turned into the infamous \"learning code\" meme.\n\nUntil about a decade ago, the Dems kept glad-handing the people. Now they just want someone else to do the glad-handing, if only for a change.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "dasunt",
                                                    "body": "There is the very difficult problem that under our system, some areas aren't economically viable in their current form.\n\nThe country is littered with small towns that used to be viable farming communities before efficiency gains and economies of scale made farming not employ as many people.  There's old mining and logging towns that are only shells of what they once were due to changing economic conditions.\n\nAnd there are no easy solutions.",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "Low_Witness5061",
                                                            "body": "There may not be any easy solutions, but there sure are plenty of people selling them. Surely the politicians offering to save everyone will do it this time /s \n\nSadly, promising people that their lives don’t need to change and they don’t need to sacrifice is just too tempting a pipe dream for a lot of people.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "Aureliamnissan",
                                                                    "body": "I mean that’s one way of looking at it.\n\nA lot of people don’t agree that we all need to move to LA or NYC and drive up rents indefinitely while still keeping wages low.  Anything we can offer other than taxing assets owned by the rich I suppose…",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Low_Witness5061",
                                                                            "body": "lol I definitely don’t think everyone should do either of those things. But sadly some industries do die off because they aren’t profitable. \n\nMy point was about how disappointing it is when politicians offer a promise to fix things without providing a plan and people simply trust in it. If they aren’t offering any sort of policy they are usually peddling BS in my experience. I certainly have nothing against anyone living in small towns. The people who take advantage of their wish to keep their way of life can get fucked though. \n\nProbably could have been clearer in my original post but as this message proves they can get too long winded.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "anti-torque",
                                                            "body": ">The country is littered with small towns that used to be viable farming communities before ~~efficiency gains~~ federal subsidies, silly immigration policies, and economies of scale made farming not employ as many people.\n\nfify\n\nThis only applies to WV in the ability to scale. They can peel the top of a mountain off and take the coal, as opposed to digging a mine. And they can do it in Montana, not WV.\n\nWhile you're on the right track for other parts of the country, WV has the added bonus of not being planned around an agrarian society. They are further segmented by a system planned by coal magnates. Labor was intentionally separated from each other and tucked away in their own little cloisters, because when labor got together, bad things tended to happen for ownership. And with innovations like the Company Store, labor was essentially indentured and not at all diverse (in a skill sense... highly diverse in their brotherhood).\n\nSo we have a segmented society with population centers in abnormal geographic placements and a reliance on importing simple essentials.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "sllewgh",
                                    "body": "Job retraining was never the answer, it was a horrible, ignorant, losing strategy.  Coal miners don't need retraining at all, they have valuable skills that are transferable to other industries.  Every time the Dems talked about retraining, it signaled everyone with any actual knowledge of the situation on the ground (e.g. everyone in WV) that the Dems didn't care about their real needs.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "SkiingAway",
                                            "body": "The actual problem is that generally speaking: While people talk about \"jobs\", what they really want is not just a job, but their *place*/\"way of life\" saved.\n\n\"I want my town to continue to be prosperous, the house I live in to continue to be within range of decent jobs that I'm qualified for, etc\".\n\n--------\n\nThat is difficult to accomplish in an area effectively built on a single industry. It's even more so when the only reason it was ever appealing to any industry is because of local natural resources and there's large structural disadvantages to locating basically any other kind of business there.\n\nMost of WV can be very pretty, but the topography is brutal and makes it unlikely that it's ever going to be attractive for siting much of anything else there, especially given the state's other existing disadvantages.\n\n-----\n\nWhich is to say - the economically efficient answer would have been to offer them some subsidies to help cover their relocation costs/losses on their property to somewhere else where they can *use* those skills if there was nowhere within an hour of their current location. In many cases that would likely be out of state.\n\nThis would obviously be extremely politically unpopular, even more so than \"retraining\" is.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "sllewgh",
                                                    "body": "You're still focused on the wrong people.  Miners are paid well and have already been relocating themselves in droves to seek work in other areas.  It's everyone left behind that's in need of assistance- people trapped in these economies with houses no one will buy and no means to relocate.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "SkiingAway",
                                                            "body": "Pretty much everything I've said applies about as equally to the people left behind as the actual miners themselves.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "sllewgh",
                                                                    "body": "No, it absolutely does not. I've already explained why the situations are different.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SkiingAway",
                                                                            "body": "There's a bunch of resentful people left behind, who have no viable economic opportunity where they are.\n\nThere is little hope of creating any local economic opportunity, because it's generally a highly unattractive location for any substantial business operation except the original basis of the community - extracting a natural resource located specifically there.\n\n\"You should all move somewhere with better opportunity\", even with subsidies to help defray their lost property values/equity/costs, is politically, extremely unpopular. Even more so if that location is likely to be out of the state entirely.\n\nPeople who worked in areas other than mining and are now unemployed have effectively the same situation as the miners in many respects. Their skills might be useful somewhere but they aren't useful *here* because the economic driver is gone and can't support their job anymore. \n\n-----\n\nRetraining is probably 90% hopeless, but there's a vague, theoretical possibility that if you can get more of the community connected to the 'outside\" economy that you could come up with more money entering the community to support *some* of the downstream jobs/commerce that previously existed in the community from people living there + having income to spend.\n\nIf it's politically impossible to just pay people to help them move somewhere else, and impractical to figure out a replacement source of economic activity....it's not the *absolute worst* idea.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "sllewgh",
                                                                                    "body": "> \"You should all move somewhere with better opportunity\", even with subsidies to help defray their lost property values/equity/costs, is politically, extremely unpopular.\n\nWas it?  I don't recall any candidate actually proposing this solution, at least not with any specific, actionable promises.  I think you're right, \"just move\" would be justifiably unpopular, but I don't think this idea actually had any mainstream support to begin with.\n\n>People who worked in areas other than mining and are now unemployed have effectively the same situation as the miners in many respects.\n\nExcept for their ability to move, the value of their skills, and the resources they have available, like I mentioned.  You can't just keep drawing the same comparisons like I haven't already explained the difference.\n\n>Retraining is probably 90% hopeless, but there's a vague, theoretical possibility that if you can get more of the community connected to the 'outside\" economy that you could come up with more money entering the community to support some of the downstream jobs/commerce that previously existed in the community from people living there + having income to spend.\n\nRetraining is 100% hopeless because it is unneeded, and would not in any way address the actual problem.  Already explained that.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TecumsehSherman",
                    "body": "Science didn't kill coal. Natural gas did.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "lolexecs",
                            "body": "Like a lot of things in life, things get more interesting the deeper you ... dig.\n\nRemember there are two big \"buckets\" for coal. \n\n* Thermal - the kind used to generate power\n* Metallurgical (\"Met\")- the kind used to make coke, which is an essential element in blast furnace style steelmaking\n\nWest Virginia is a big Met coal producer.  It was traditionally a big supplier to the US Steel industry, but because of changes to how we make steel in the US, most of that coal is now **exported** to places like China, India, Brazil, and Europe. With 'Trump's Tariffpalooza' and retaliatory measures from other countries, WV’s market share is likely to shrink further. After all, the Chinese are back in business with the Aussies and we can expect the Canadians and Europeans to ink deals now that the US is looking irrational.  \n\nAll that aside, the met coal industry is a melting ice cube. The biggest driver is *innovation* in the steelmaking. \n\nHere's what happened. In the US, steelmaking began shifting from blast furnaces to mini-mills (electric arc furnaces) in the 1970s, a transition that accelerated in the 1990s. These mills enabled us to produce steel more cheaply (from scrap) and do not require any met coal to operate. This is not to say demand is zero for met coal, blast furnaces still exist to make technical, high purity steel -- e.g., aerospace, pipelines, electrical components -- but the demand is well off the peak. Worse, for the met coal industry, the demand is shrinking because everyone is moving towards those electric arc furnaces.  In addition, there are pilot projects exploring hydrogen direct reduction, which, if successful, could replace blast furnaces. \n\nNow, on the thermal coal front (largely from places like WY and MT along the powder river basin) natural gas has been a killer. \n\nAs you rightly point out, there's been a shift away from coal towards natural gas for power generation. Natural gas plants are a lot cheaper to build, maintain, and, given the massive amount of gas that's fracked in the US,  cheaper to supply. In addition, they are 'dispatchable' or you can quickly spin or or shut down a natural gas generator. Coal plants are slow to start up and shut down, making them less flexible in modern energy markets. FWIW, Nuke plants have the same issues. \n\nThe reason why dispatchability has become a valued characteristic for generators is because of the market-based reforms that happened in the late 1990s under FERC Order 888. Wholesale power is now *mostly* a free market, so power can move across the grids (except in TX) to satisfy fluctuations in supply and demand. Moreover, as there's been a shift to renewables, natural gas plants have stepped in to address the changing demand and supply patterns.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Blockhead47",
                                    "body": ">most of that coal is now **exported**.....    \n   \nJust to add to your comment:     \n     \n>U.S. coal exports reached a six-year record in June 2024    \n>https://www.eia.gov/todayinenergy/detail.php?id=64464",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "lolexecs",
                                            "body": "The whole tariff thing is just going to fuck coal even more. I guess that’s one way to deal with climate change?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "kenlubin",
                                    "body": "Thank you for the more thorough explanation there. I had not realized the role that electric arc furnaces had played in this transition, although I've been hearing that electric arc furnaces are poised to take on a much larger role in a fully electrified clean energy future.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cp5184",
                            "body": "Mechanization and automation and mountain top removal mining eliminated the mining jobs.\n\nWest Virginia is basically nothing but mountains.  You could have a coal mine working on every one of them, absolute maximum production and it wouldn't significantly change employment numbers.  The jobs they think democrats took from them don't exist anymore, they're never coming back.\n\nIt's like if rail workers wanted to get their job as a caboose brakeman in a train caboose back and blaming democrats...  There are no cabooses anymore and there are no brakemen anymore, the job doesn't exist.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "nope_nic_tesla",
                            "body": "What made natural gas so cheap and competitive? Technological advances in fracking. In other words, science.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Buck_Thorn",
                    "body": "Add to that a strong religious base.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "FuzzyComedian638",
                    "body": "Also, I suspect their only news channel is fox news. ",
                    "score": 37,
                    "replies": [
                        {
                            "author": "YouTac11",
                            "body": "You don't think MSNBC, CNN, ABC, CBS, Broadcast in WV?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "DerelictDonkeyEngine",
                                    "body": "Of course they do, that doesn't mean anyone watches anything other than Fox News tho.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "YouTac11",
                                            "body": "God I love the bigotry from the left.\n\nTell me more about how the only way people won't agree with you is ignorance",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "DerelictDonkeyEngine",
                                                    "body": "> bigotry\n\nI do not think that word means what you think it means.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "YouTac11",
                                                            "body": "Oh I'm guessing the definition will surprise you\n\n* **Bigotry** - stubborn and complete intolerance of any creed, belief, or opinion that differs from one's own.\n\nhttps://www.dictionary.com/browse/bigotry",
                                                            "score": -6,
                                                            "replies": [
                                                                {
                                                                    "author": "DerelictDonkeyEngine",
                                                                    "body": "Cute. After a quick glance at your comment history, I have zero interest in talking to you ever again. \n\nHave a good life.",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "YouTac11",
                                                                            "body": "You think definitions are cute?\n\nBe honest with yourself at least, you didn't know that is what bigotry meant",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DerelictDonkeyEngine",
                                                                                    "body": "I know what a toxic person is. \n\nGo away.",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "YouTac11",
                                                                                            "body": "You might want to look in the mirror.  You have done nothing but push bigotry here",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "BooneDoggle23",
                                                            "body": "Actually, bigotry was appropriately used here. Perhaps you only know the definition provided by MSDNC, so go ahead and look up the real definition and get back to us.\n\nAlso, WV is the lowest income state per-capita in the U.S. If you think the problem is an expensive cable news subscription you're just intellectually dishonest. The reason WV went red is because of terrible liberal policies that led to further economic hardships for its citizens. Period.",
                                                            "score": -4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "pharmamess",
                                                            "body": "They are right, you are wrong. Deal with it.",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dhusk",
                    "body": "Except the GOP didn't save s***, but the conservative media outlets that everyone there has been brainwashed into following told them they did, and the voters somehow believe it despite living in the poorest state in the US.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "kenlubin",
                            "body": "I think this is part of the explanation for the rise of Trump. The coal industry is dying / dead. The community rejected the response offered by the Democratic Party. The Republicans offered miracle cures which didn't pan out. Now Trump is offering revanchism or just trying to turn back the clock, and they're willing to give him a chance.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dhusk",
                                    "body": "Except the responses offered by the Democratic party, which was outright financial assistance and retraining workers for other industries, weren't even tried and were blocked everywhere in the state despite it actually addressing some of the major problems.  But they'll give Trump's idiot, impractical, non-starter BS a chance simply because he has an R after his name.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Flor1daman08",
                    "body": "Coal is part of it, but it’s mostly a cultural shift brought on by the Southern Strategy employed by the GOP and the increased influence the evangelical and religious right wing has in the GOP.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "SlowMotionSprint",
                    "body": "The savior of coal CEOs. They did nothing to help the actual coal miner. Taking away health coverage and workers benefits. Union busting.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ItsTheDogFather",
                    "body": "This ^ my dad was a power plant worker for a coal fire plant. As soon as Biden took over in 2020 his plant got shut down. That’s enough for him and everyone he worked with there to lean right basically forever.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "RU4real13",
                            "body": "That's about the time that the world's largest natural gas power plant went on line.  The thing with coal is that it requires miles and miles of conveyor belts which require constant maintenance which equals labor costs.  There's not that much labor in pipe.  I'd say the displacement was more due to tech and fracking than it was policy.  Still, it didn't equal a cheaper cost to the consumer.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "wha-haa",
                            "body": "Something something voting against their self interest something.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "ItsTheDogFather",
                                    "body": "How so (genuine question)? In their case at least they knew Biden’s victory was a confirmation they’d lose their jobs. I’d say they had about as good of a reason to vote the way they did as anyone.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "wha-haa",
                                            "body": "I don't disagree with you.  Democrats earned their place with the people of WV.  Yet anytime there is an outcome as such, there is always someone here to say people are voting against their own interest, as if the ignorant prick knows what those people interests are.  Anticipating it, I figured I would get ahead of it.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "guamisc",
                                            "body": "Trump isn't going to save or bring those jobs back. The market has \"spoken\" because coal is more expensive than a combo of Nat gas and renewable and other industries are moving on from labor intensive, dirty coal.\n\nActing like petulant children who refuse to learn about how things cost money and they can't have everything they want isn't a good reason to vote for Trump.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "ItsTheDogFather",
                                                    "body": "I’m sorry but that’s a foolish take.\n\nCandidate a: I will definitely cut your jobs\n\nCandidate b: I will save your jobs\n\nEven if candidate b fails, there’s 100% chance candidate a will cause you to lose your job. \n\nThese guys are 30 year career guys trying to save their livelihood and you want to insult them like a child because you think it sounds cool on Reddit. These people voted to try to keep their lives going not because they “are petulant children who refuse to learn that things cost money”\n\nI’m open to all types of conversation except for the immediately hostile, but I’ll forgive you assuming you just don’t have enough life experience yet.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "guamisc",
                                                            "body": "> Candidate a: I will definitely cut your jobs\n\n> Candidate b: I will save your jobs\n\nFact: Your jobs are going away due to market forces that aren't controlled by politicians.\n\nCandidate a: We want to invest in your communities and people because your jobs are being phased out by reality.\n\nCandidate b: I will save your jobs because I can!\n\nThe foolish take is believing candidate b and crucifying anyone telling them otherwise. Learning that the world is changing and changing societal needs and technological capabilities might make change your job prospects is an important part of growing up and being an adult instead of being a child.\n\nI'm open to all types of conversation except for the removing the agency of adults and acting like their ignorance and petulance gives them legitimate reasons to do objectively stupid actions.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "ItsTheDogFather",
                                                                    "body": "“Objectively stupid actions” Right so it’s stupid of them to try to hold on to their jobs. I’m sure you think you sound so smart when you say it but from a logical perspective it makes no sense. \n\nAlso, here’s a fact. Many of those same people were certain if the dems won in 2016 the same would happen. Trump won, and those people ended up keeping their jobs for a few more years. May not be because of him, but they voted based on their historical experience. \n\n“BuT gOoGlE tElLs Me ThE cOaL iNduStRy..” \n\nI lived it. I know exactly why they voted how they did, and it makes sense why they did it. The only child is the one who would sit here and call them foolish for trying to provide for their families. \n\nAnd before you say anything about me: I hate trump. Never voted for the guy. But actually what I hate more than Trump is someone who feels the need to act like they’re so intelligent that they feel the need to try and bully and belittle others. \n\nHave a good night little man.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "guamisc",
                                                                            "body": "No, it doesn't. \n\nSlash and burn agriculture doesn't work forever. It's a dumb decision made by small men. Their jobs are going away and rather than get resources to improve their community to go on, they will slash and burn everything down for the last few morsels. It's objectively stupid.\n\nTheir reaction and voting for Trump is actually the bullying part and you're just participating in one of the largest DARVO operations in all of US history.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DrBucket",
                    "body": "\"savior\" \n\nBasically taking advantage of roadkill",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PreviousAvocado9967",
                    "body": "The thing no one wants to admit: The more diverse the Democrat party has become (major demographic composition changes since the 1992 election of Bill Clinton) the less Democrat blue states with lower educational achievement have become. Whereas red states with higher educational achievement (North Carolina, Virginia, Georgia, certain parts of Texas) have gone from reliably red to swing state purple and even flipped blue in big Democrat years (2008, 2020).\n\nI don't think its the fossil fuels issue in itself but much more that climate change is closely related to level of education. As are vaccines and understanding reproductive complications(ectopic pregnancy,  potter's syndrome). For example in looking at census data recently it was an interesting coincidence that the self reporting of Long Covid cases by the states resulted in the 19 of the top 20 states for most long covid cases were also the 19 least vaccinated states and most of those had the lowest educational achievement K-12.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Reasonable_Ninja5708",
            "body": "West Virginia is heavily reliant on a dying industry (coal). Democrats’ environmentalism was seen as a threat to that industry, while Trump and the GOP promised to bring those jobs back.",
            "score": 146,
            "replies": [
                {
                    "author": "brunnock",
                    "body": "Can't wait for Trump to bring back whale oil.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Off_OuterLimits",
                    "body": "Did they bring coal back? It’s a dying industry. Reminds me of England’s Dickens era. \n\nNo middle class, just very rich or very poor. Horribly poor and uneducated. Watch Catherine Cookson’s or Dickens’ movie adaptations. Who wants that besides rich Republicans? Or Musk?",
                    "score": 77,
                    "replies": [
                        {
                            "author": "brunnock",
                            "body": "Of course England had a thriving middle class. Napoleon called England \"a nation of shopkeepers\".",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "anti-torque",
                                    "body": "Adam Smith lays out the difference between France and England in his [lecture on police](https://www.jstor.org/stable/2139691?seq=1).",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Off_OuterLimits",
                                    "body": "Please read up on your history. Dickens wrote about his era. There was no middle class just rich and poor. It’s a documented fact. Just read any history book. I’m not talking about today. I’m talking about the 1800’s when the poor could not afford food much less coal and there was no middle class. Shop keepers weren’t as poor as others, but they could barely make ends meet.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "brunnock",
                                            "body": ">Please read up on your history...I’m not talking about today. I’m talking about the 1800’s\n\nUh, when do you think Napoleon fought with England?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Off_OuterLimits",
                                                    "body": "Yesterday. Light your candle and read.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "wheelsof_fortune",
                            "body": "This isn’t true. I live in West Virginia, and am middle class/college educated. That’s not to say that poverty isn’t a serious issue in WV, but the middle class does exist here.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Off_OuterLimits",
                                    "body": "Didn’t say there’s no middle class in WV. Response is to why we’re still using coal and have coal mines. The only coal I’ve ever used is charcoal for grilling. We have cleaner energy. There’s no need for coal mines anymore that I know of. They should be extinct since we have cleaner energy that is readily available.\n\nThe 1800’s had NO electricity or gas. That was Dickens’s era.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "brunnock",
                                            "body": "> The 1800’s had NO electricity or gas. \n\nJesus. When do you think Edison invented the light bulb?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Off_OuterLimits",
                                                    "body": "“light bulbs were first developed in the late 1800s” https://lamppicker.com\nLate 1800’s not late 1700’s early 1800’s. Don’t you watch historical movies or read about the discovery of the lightbulb?\nJesus",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GogglesPisano",
                    "body": "Arby’s employs more people than the entire US coal industry.\n\nIt’s uncanny how such a tiny segment of the population has such undeserved and outsized influence on policy for the entire country.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tcspears",
                    "body": "Obama saw a huge boost in places like WV as he was promising to bring coal back, and US manufacturing as well.  \n\nI think a big part of it, is they feel ignored.  Half my family is in the UK in Sunderland, and it’s the same there: all these towns built around coal and steel, and they have been left to rot for a few decades, which breeds a lot of resentment and despair.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Medical-Search4146",
                    "body": "> Democrats’ environmentalism was seen as a threat to that industry, while Trump and the GOP promised to bring those jobs back.\n\nAnd the thinking should be adjusted. Democrats provide no answer with **tangible** results which means they can only be seen as a threat. GOP may give empty promises but at least it provides hope. Whereas Democrats \"promises\" only bring worsening conditions. \n\nMaybe off-tangent. I really wish Democrats stop pushing green technology as the solution for WV. Green technology requires significantly less manpower than a coal mine so it isn't a realistic solution to the issue at hand.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "escapefromelba",
                            "body": "That’s not entirely true. Democratic-led initiatives have created real jobs in West Virginia. The biggest success so far has been mine reclamation, which has provided thousands of jobs cleaning up abandoned mines, thanks to federal funding. Battery manufacturing and rare earth mineral extraction from coal waste are also growing industries with real potential. Both industries benefited from the Inflation Reduction Act as well as Manchin secured federal funding. The Department of Energy selected Form Energy for an award of up to $150 million under Biden's Infrastructure Investment and Jobs Act under the Battery Materials Processing and Battery Manufacturing program in 2024. It’s expected to create 750+ jobs in Weirton.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Flor1daman08",
                            "body": "> And the thinking should be adjusted. Democrats provide no answer with tangible results which means they can only be seen as a threat\n\nThat’s not true in the least, what are you talking about?\n\n> GOP may give empty promises but at least it provides hope. Whereas Democrats \"promises\" only bring worsening conditions.\n\nHillary literally went into her plan to provide education in growing industries in the same speech as the “those jobs aren’t coming back” speech. What are you talking about?\n\n> Maybe off-tangent. I really wish Democrats stop pushing green technology as the solution for WV. Green technology requires significantly less manpower than a coal mine so it isn't a realistic solution to the issue at hand.\n\nCoal mines require a lot less manpower than coal plants did years ago too, and the Dems were literally proposing job training to other growing industries to address the inevitable and **continued** decline of the coal industry. Everything you said was wrong.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "epolonsky",
                                    "body": "What they said was incorrect, but it *felt* right. And in the end, isn’t that what’s really important? \n\nNo, no it’s not. But it *feels* like it is.",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "zenslakr",
                                    "body": "Solar power is labor intensive. New tech, cleaning, storm damage, etc. Wind power also creates a lot of jobs.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "peacoffee",
                                    "body": "Hillary borked democrats with her \"We're going to put a lot of coal miners out of business.\" No one bought her plan after that because no one was listening after that. Dem party needs more Cal Coolidges.. who don't lean over their skiis so much with their talking points. You might have to accept the existence of a few coal mines to achieve your long-term goals.  It was very foolish to loudly promise death to the iconic pride of a people group.  She obviously wasn't listening to Bill when she was running.  He would not have done that.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "Flor1daman08",
                                            "body": "Did you watch the entirety of her speech which that clip came from? Genuine question, because I think you would have had a vastly different opinion if you had seen it.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Time-Ad-3625",
                                                    "body": "No they saw just the propaganda that was spread around",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Flor1daman08",
                                                            "body": "I don’t want to assume but unfortunately I think that’s probably likely.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PROXICADENE",
                    "body": "Why is it just accepted that coal is a dying industry? Coal is still the globe's most common type of power plant and the total coal capacity continues to grow. Additionally, there is a negative feedback system. As people abandon coal the price of coal drops, making it more attractive as a cheap source of energy.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "brunnock",
                            "body": "Well, coal-powered ships, trains, and cars died off. It stands to reason that coal powered power plants will as well.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PROXICADENE",
                                    "body": "I don't think that the reasons for switching away from coal in ships and trains apply to power plants.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "brunnock",
                                            "body": "Coal is a pain in the ass to transport, produces toxic ash, and is less efficient than other fuels. Did I miss anything?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PROXICADENE",
                                                    "body": "Efficiency is a function of the price of coal. Transportation is indeed a problem for ships and trains, but power plants can be located near mines. Pollution is a consideration, but it's not the reason that ships and trains moved away from coal. Both ships and trains had viable alternatives such as diesel. For power plants, coal is cheaper than diesel and its main disadvantages (can't easily turn on or off) don't matter as much.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shadowbreakr",
            "body": "Blue collar union state that’s predominantly rural and white with a dying industry and no big cities to balance it out. It’s basically the perfect demographic for the Republicans message that they’ll “bring back jobs” and play off racial grievances as the reason for all societal ills while simultaneously lacking the big cities that make Pennsylvania and other rust belt states competitive.\n\nThe democrats who were elected were blue dog dems who were conservative and mainly democrats because of union support and the history of the party supporting unions. There’s a perception that democrats don’t support the working class anymore (which for coal miners is actually true democrats don’t want to invest in a dying industry that damages the environment)\n\nJoe Manchin was basically a republican. He toyed with changing parties, running as an independent and generally was a thorn for democrats to deal with even if he was a necessary compromise candidate as literally no other democrat could possibly win his seat.",
            "score": 79,
            "replies": [
                {
                    "author": "Wermys",
                    "body": "It isn't just that.  It is the community aspect for a lot of these jobs.  They aren't looking for handouts what they want is for someone to give them a job for them to live there life and not worry about what happens tomorrow.  Republicans focus on the community aspect and forget to mention anything about the jobs part of the equation except saying we agree bring back manufacturing without the part of bringing back manufacturing.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "instasquid",
                            "body": ">They aren't looking for handouts\n\n\n>what they want is for someone to give them a job",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Wermys",
                                    "body": "I agree.  The videos he did gave me perpspective.  That was my point about the handouts.  They WANT to work.  They WANT what there parents had.  There was a sense of community, the company taking care of them as well as the union.  That is lost to them now and is never coming back for stuff like Coal.  But who is to say it can't come back in manufacturing?  Or other types of mining?  The point I think a lot of progressives miss is that it isn't about education, or being religious.  It is about community, social engagement, and being a part of something.\n\nMy gut tells me this country is at an inflection point in swing back to manufacturing.  But it isn't going to work the way they want it is the problem.   And the only real hope they have is if someone who is more progressive in mind but is for profit comes in and creates business.  Because god knows there is no chance in hell Peter Thiel will do something like that.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "SkiingAway",
                                            "body": "The problem is that people generally want this to happen in *their* current community, not just *any* community.\n\nWV's problem in particular is that it's a structurally bad place to put anything that doesn't have to be there. A coal mine has to be where the coal is, clearly.\n\nThe topography is this endless collection of steep hills and very narrow valleys at risk of severe flood damage. Efficient transportation/infrastructure is difficult.\n\nThere's a reason almost all of WV's (still small) \"cities\" are right at the borders of the state - that's where the terrain gets a *little* less awful to work with.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "gorkt",
                                            "body": "Americans don’t have the mindset to compete with a Chinese workers whose parents were subsistence farmers.  For the typical Chinese worker, the low paying job that a typical American views as drudgery is a step up and a better life.  What you are really competing with is the better lifestyles that American workers used to have.  What American parent is out there telling their kids that when they grow up, they should aspire to be a factory worker?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "lilly_kilgore",
                                                    "body": "In my experience it's pretty common in Appalachia for parents to be proud of their kids for gaining stable employment. There isn't a lot of \"looking down\" on certain industries like what happens in other areas. There is a culture of hard work and having \"just enough.\" And many many folks are content to just have a job they can rely on that pays the bills.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Wermys",
                                                    "body": "Depends on the community honestly.  That is why I wanted point his video to give some context of the people who live there.  This is about West Virginia in particular and what they want and are looking for and why they voted for Trump.  \n\nFor example an company like Tesla would actually do well in West Virginia if a factory was located there.  But the problem is the logistics of it which is why it was never possible in the first place. But right now a lot of West Virginia is in a pretty bad state for those old coal mining communities.  Here watch the video here.  But keep in mind that he is more libertarian bent but by far he is the best person to watch go into these types of communities to give a ground level perspective and isn't boring to watch at least to me.\n\nhttps://www.youtube.com/watch?v=h9lSZlDJAC0&list=PLEyPgwIPkHo5If6xyrkr-s2I6yz23o0av",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GrowFreeFood",
                            "body": "Name one republican policy that focuses on the community.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Wermys",
                                    "body": "To be honest.  They focus on stuff like social issues relating to Religion, Community Charities, Abortion, etc.  The point I am making here is that they PRETEND to do it.  But they really don't give 2 shits at the government level. But a lot of the local communities are really religious so they eat that shit up.   These people hardly ever go outside there communities so they don't really see what happens in other areas of the country.  All they know is that Democratic \"policies\" keep taking jobs away.  Not understanding it is really the fact that its Automation coupled with the rise of Gas that is harming them more.  And Republicans constantly pretty disengenous about it.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "wha-haa",
                            "body": "The democrats tight fit in the ass of the pharmaceutical companies doesn’t help.  They really got screwed there by the pill mills.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Wermys",
                                    "body": "It was bad about 15 years ago.  I actually work at a PBM handling customer inquires and escalations etc.  Honestly I look constantly at Zillow for properties there since it is a state I am considering retiring too.   The places has so much potential to me.  But some much hopelessness at the same time.  Its frustrating that Republicans are liars about what needs to be done and Democrats are clueless on what people in the state actually want.  \n\nManchin hatred really frustrated me because of the lack of understanding of the local populace and assumptions about him in the first place.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "kittenpantzen",
                                            "body": "As someone who used to live in West virginia, make sure the properties you're looking at are near a medical center. Also, if you aren't white, pick somewhere else.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Off_OuterLimits",
                    "body": "Don’t miners end up with black lung disease? And who uses coal anymore?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "gorkt",
                            "body": "Coal is the #2 source of electricity generation in the US behind natural gas.  We use tons of it.  \n\nhttps://www.eia.gov/tools/faqs/faq.php?id=427&t=3",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "frostycakes",
                                    "body": "And Appalachian coal isn't cost competitive with Wyoming coal either, for plants still using it IIRC. It'll always be cheaper to strip mine the plains than to remove the tops of mountains, and I think Western coal has less sulfur in it (so less polluting in the non-CO2 sense).\n\nWV coal industry was on its deathbed even without environmental regulations. Why they thought they were exempt from the boom bust cycle of extractive industry, unlike every other mining region in history, is beyond me.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "gorkt",
                                            "body": "Every once in a while I will see some video with a black faced coal miner who is crying about “preserving his way of life”, and I feel just bewildered.  Can he not imagine a life where he and his kids might not have to do backbreaking physical labor that will leave him bedridden in his old age?  I get it in a way, it’s all he knows, but I can’t think of many other jobs as difficult where people fight so hard to keep doing them.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "frostycakes",
                                                    "body": "The hilarious part is, it's so regional. My step dad's father was a coal miner here in Colorado, and he was absolutely insistent that none of his children or grandchildren would deliberately work in the mines absent job loss or the like. This was a common attitude in his coal mining area, that your kids would get educations, learn a trade, or even just move to a place where there were more job opportunities than just the mine. Colorado and WV were much more similar states a century ago (there's a reason the coal based labor wars happened in both states specifically), yet we've embraced education, tourism, and industrial diversification, while they've just doubled and tripled down on mining and not much else.\n\nThe end results speak for themselves. I can't imagine not wanting your kids to aspire to more than the mines.",
                                                    "score": 19,
                                                    "replies": [
                                                        {
                                                            "author": "CoherentPanda",
                                                            "body": "If you watch some Youtube videos of coal miner stories in the Appalachians, almost all of them will tell you they don't want their children or grandchildren to work in the mines.  The few that are pro-mine are definitely rare, and have deeply drank the Fox News kool-aid.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "dickpierce69",
                                                    "body": "It’s not so much that way now, but when I was growing up there was pride in how hard WVians worked. If you went off and took a job in an office as a bean counter making a bunch of money, you were abandoning your family and your community. It was lazy work and therefore not honorable. There was a definite shift in that in the 90’s/2000’s, but it’s always very much been an us (poor) vs them (rich) state. By upgrading your life you were viewed as being “too good for us”. \n\nI still deal with this a bit from my family. I went to college and grad school and left for the big city. I “abandoned” my family and community by leaving instead of staying to give back to those who helped raise me.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "gorkt",
                                                            "body": "I can see this, in fact I have experienced it indirectly through my dad.  My parents were from Ohio and West Virginia, farmers mostly.  I remember taking a visit to the old family farm one summer with my dad, who had left the area to get a college degree.  He definitely got a cold shoulder from a few of his cousins who seemed to think my dad had turned their back on his family.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "gmb92",
                                    "body": "You're misreading that. That #2 ranking is just among fossil fuels.\n\nNatural gas: 43.1%.\n\nCoal: 16.2%\n\nNuclear: 18.6%\n\nWind: 10.2% \n\nRenewables now combine for more than coal at 21.4% from that 2023 data. It's increased since.\n\nCoal has also been steadily declining and that continued through the Trump Administration. He didn't really do anything to save it but he mislead voters about it.\n\n[https://www.eia.gov/totalenergy/data/monthly/pdf/sec7\\_5.pdf](https://www.eia.gov/totalenergy/data/monthly/pdf/sec7_5.pdf)",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "kenlubin",
                                    "body": "\\#3, and it's been declining since 2007.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Medical-Search4146",
                            "body": "Both points aren't really relevant. The answer WV residents are seeking is what can replace coal and give them a working economy again. I guarantee many WV residents would welcome black lung disease if it meant they had a working economy again.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Wermys",
                                    "body": "definitely.  Frankly the only way to help West Virginia is either resource extraction of other minerals or a wide scale infrastructure spending to encourage manufacturing centers.  With a strong emphasis on community for the companies who are there.  As I pointed out Tesla would be something they would jump on if a plant was there.  But it isn't practical.  At least not until more steel mills are in place like Pittsburgh etc which isn't likely.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cbarrister",
            "body": "1) Trump lies to them and says coal is somehow magically going to make a big comeback, even when energy needs have largely moved on.\n\n2) Low higher education rates = more support for Trump.",
            "score": 15,
            "replies": []
        },
        {
            "author": "GoldenInfrared",
            "body": "Rural states are very conservative, Democrats used to be more conservative, and it took a long time for Democrats to both be *consistently* more liberal than the Republicans and for WV voters to realize it.\n\nIt’s the same story with every southern state for the most part",
            "score": 83,
            "replies": [
                {
                    "author": "TheOvy",
                    "body": "Yeah, voters under the age of 45 or so may be surprised to find that the political parties were ideologically diverse once upon a time. There was a political realignment that was the collapse of the New Deal coalition. The civil rights movement, the rise of Reaganism, and the popularity of \"limited government\" principles, started to really shake things up after 1980. By the time Obama was elected, the left/right divide became starker than ever, and with that 2010 midterm, most rural Democrats still left in Congress lost their seats. \n\ntl;dr version: The collapse of the New Deal coalition saw all the progressives moving into the Democratic party, and the backlash to civil rights moving into the Republican party. For anyone who's shocked that there were progressives in the Republican party, look up [Rockefeller Republicans](https://en.wikipedia.org/wiki/Rockefeller_Republican). They literally supported universal healthcare!",
                    "score": 52,
                    "replies": [
                        {
                            "author": "bilyl",
                            "body": "I think what you’re talking about can also be described as increasing partisanship and nationalization of political parties. In many states you can see this happening, where Democrats and Republicans are becoming pretty uniform across the country. This didn’t use to be the case, as like you said Southern and Midwestern Democrats were very different from one another. But with the nationalization of US politics, the variance of policy opinions of candidates of the same party is getting smaller and smaller. \n\nUnfortunately for Democrats, this makes their job a lot harder for them. They have to provide a national message that also resonates with local issues. What ends up happening is they end up with a laundry list of talking points where at any given district people would only care about a few of them. \n\nThere are some exceptions though. In states where one party has entirely dominated you’ll see people run as DINOs or RINOs because registering as the other party would be a non-starter.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "ColossusOfChoads",
                                    "body": "That's basically California.  Progressives vs. DINOs.  Very many of the latter would have been the mildest of suburban RINOs not but 15 years ago.\n\nThen you have the GOP off to the side.  The post-Arnold California Republican Party is its own worst enemy.  They could win if they emulated their counterparts in Massachussetts, but instead they want to be Montana.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "toadofsteel",
                                            "body": "California GOP is a lot like Florida Democrats. Can't get out of their own way.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Flor1daman08",
                                                    "body": "God our democrats here are useless. And all that means is that our GOP acts even worse.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ScyllaGeek",
                            "body": "The rise of the evangelical right cannot be understated in this transition too, Jerry Falwell and the like were a big reason religion became largely affixed to right-wing politics",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "Wermys",
                            "body": "I miss my Rockerfeller Republicans.  Gov Arnie Carlson of Minnesota is still looked at as a great governor 30 years after he was in office.   Part of what is funny about Minnesota is that Democrats here are not all that progressive overall.  Sure there is Ilhan Omar but mostly they are center left or right.  And governance is a priority at the state level in the house and senate.  Republicans REALLY screwed up in the late 2000's with the bridge collapse and putting off infastructure spending.  Which is why they struggle with state wide officers.  No one frankly trusts them as long as the Governor is a centrist on the Democratic side.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "LogoffWorkout",
                                    "body": "People seem to love Walz, and he's probably the most progressive governor in the country.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dnd3edm1",
                    "body": "I have no idea why people think Democrats \"used to be more conservative.\"  Democrats are the only ones with any fiscally responsible principles these days.  They are the only ones who value established constitutional principles.  Things \"conservatives\" in theory are supposed to like.  If anything Democrats have run away screaming from FDR-style left wing policy, leading to a lot of people who value the left wing feeling lost and without a home (almost including me if Republicans weren't, like, insane).\n\nI have no idea why Republicans still think they are conservative.   Conservatism is dying with the Democratic party.  It's all just strongman politics and hysteria over niche cultural issues now.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "anti-torque",
                            "body": ">I have no idea why people think Democrats \"used to be more conservative.\"\n\nBecause people conflate the culture war with rational governance. It's more important that others thousands of miles away don't get to be themselves... or even secure, than it is to vote in your own best financial interest.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "GoldenInfrared",
                            "body": "I don’t mean conservative in the “disagreement about good government” sense I mean the bigoted, incendiary, undereducated George Wallace voter types who care more about putting people down than lifting people up.\n\nUnfortunately, southern people are usually the later type",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Ryan_Jonathan_Martin",
                                    "body": "This is no longer conservatism it's right-wing populism. Populists are always far far more radical than conservatives",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "GoldenInfrared",
                                            "body": "\"Conservatism consists of exactly one proposition, to wit: There must be in-groups whom the law protects but does not bind, alongside out-groups whom the law binds but does not protect.\" - Frank Wilhoit\n\nIt's very much conservatism, just with shifted in-groups and outgroups",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "anti-torque",
                                                    "body": "You just quoted a blog comment from 2018.\n\nYour appeal to authority (Francis Wilhoit... who died in 2010) has failed.\n\nThat's pretty funny.",
                                                    "score": -2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Ryan_Jonathan_Martin",
                                                    "body": "Conservatism prioritises the maintenance of a current system, with small improvements if necessary. The American neoconservatives of the 80s and 90s wanted less government spending and less government oversight, whilst also championing economic liberalism (as in, very little government control over the local market and more economic power for business owners).\n\nI disagree with a lot of neoconservative policies, as I think most of them are applied stupidly and end up causing more problems than they solve, and economic liberalism simply doesn't reflect the current reality of the world (the world's economies are growing less connected and more protectionist).\n\nThese Republicans are not neoconservatives. In fact, they hate neocons. These Tea Party Republicans basically overthrew the neocons after the disastrous end to the Dubya presidency. They want to fundamentally change how the US operates as a society. They want more oversight over Americans' social lives and more protectionism.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "EcstaticAd8179",
                                                            "body": "Actually no conservatism is what the above quote is about, not what you said",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Ryan_Jonathan_Martin",
                                                                    "body": "Go look up what happened to Senators like John Boehner, John McCain, Mitt Romney, and of course the Cheney family. They were all ousted by the Tea Party guys. They galvanised an incredible campaign of propaganda and informal political pressure to get the neocons to \"retire\". The ones who stayed like Mitch McConnell, Lindsey Graham, Chris Christie and the like had to basically suck up to Trump to have any chance of retaining their political positions. Christie and McConnell seemingly have had enough of Trump I guess, but as for Lindsey Graham... well you know what he's doing right now.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "EcstaticAd8179",
                                                                            "body": "Actually no conservatism is what the above quote is about, and you don't know what you're talking about",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "chaosmagick1981",
                                    "body": "wv is not a southern state in culture or geography. Just saying, but I get you.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "anti-torque",
                                    "body": "That has zero to do with conservatism.\n\nThat's just bigotry.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "krajowastan",
                            "body": "I would disagree in part. The modern left is like the modern Democratic Party still a product of the baby boomer revolt against a collectivist state that essentially dominated American politics until 2008. This is true both that in the 60s and 70s there was a move a way from direct state intervention to alleviate poverty and racism but also in the sense that liberals before the 70s generally supported American nationalism and a society with prescribed and somewhat socially conservative values. Circumstances have slowly conspired to force the left to re-embrace the state as a tool but unlike early liberals not really as a legitimate cultural entity. That is to say the modern left is closer in social values to the 90s and 00s Democratic Party than the 50s and 60s. We are very much not an \"ask not what your country can do for you but what you can do for country\" type of collectivist society",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SlyReference",
                            "body": "In addition to what u/GoldenInfrared said, there used to be more politicians who were anti-abortion in the Democratic Party, which is the reason laws to protect abortion under Obama were a non-starter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AshleyMyers44",
                                    "body": "And there used to be pro-choice members of the Republican Party.\n\n\n\n5 of the 7 justices that made the majority opinion in *Roe* were republican appointees.\n\n\nGerald Ford was more pro-choice than Carter.\n\n\n\nHW Bush was once a Planned Parenthood supporter.\n\n\nAre there any prominent pro-choice federal Republicans left?\n\nMaybe Susan Collins, but not really.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gmb92",
                            "body": "This. Compare projected budget deficits of every president's first year. Since Reagan, deficits have skyrocketed under Republican presidents and fallen under Democratic presidents. Republicans cut taxes weighted toward the wealthy and increase spending. Big initiatives from Democrats other than during emergencies tend to be close to deficit neutral. Now half of our deficit is debt interest brought on by all of those choices of the past. Democrats are far more the fiscally conservative party. It's all the theatrics, including debt ceiling threats during a Democratic presidency, that gets media to portray Republicans as conservative.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "2rio2",
                    "body": "Yup, younger voters won't remember this but Blue Dog Democrats were a real power in Congress for most of my lifetime (1980s-2010s). Manchin seemed so out of step to this younger generation, but I always saw him as the last visage of this politician type - Democrat, from rural district/state, socially conservative, economically more left leaning, white, older, usually men, applied constant pressure on their own party. They're a big reason the Democratic party so was so slow to evolve with modern young voters. The party was full of them until they were gobbled up one by one by the GOP.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "anti-torque",
                    "body": "Dems didn't \"used to be more conservative.\"\n\nThe introduction of the Third Way tied them much more closely to corporate interests. After a decade of that, they decided to turn into a party supporting war... and corporate interests. \n\nBack in 2005, it was clear that [\"clean energy\"](https://grist.org/article/hillary-clinton/) advocates were really just natural gas advocates. Joe Biden, always mugging for CSPAN back in the day, famously led these right wing dems who basically controlled the party in joining with the GOP in their 15 year plan for using natural gas as a \"bridge fuel\" to a green future--arguing that renewable tech was still cost prohibitive.\n\nThis is how we ended up with the Halliburton Rule... and videos of Biden saying \"bridge fuel\" a lot... and W's famous \"switch grass\" pitch, which led to ethanol production/subsidies.\n\nYes, the Green New Deal is the GOP climate plan from 2005.\n\nThat's how \"used to be conservative\" the Dem Party was.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "kenlubin",
                            "body": "Wind, solar, batteries, and EVs were still fantasy in 2005. The only proven clean energy source was nuclear, which Obama and Merkel were pursuing until Fukushima. The rapid rise of solar, especially, has continually blown away anyone's predictions or expectations.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "anti-torque",
                                    "body": "Wind was in high demand. It's only issue would have been ramping up supply--something GE was more than willing to do. It had made a run of cost reductions in the decade prior to 2005, and the only issue would have been the need to restructure the grid to take advantage of the plains states having the most abundant land sources for production.\n\nThe decision to subsidize corn and NG halted all that advancement, and wind costs actually rose for a couple years.\n\nThis was all discussed on Congress in open debate. I watched it all on CSPAN (worked graveyard at the time). Joe Biden saying, \"bridge fuel,\" over and over will forever be imprinted on me.\n\nAnd knowing someone associated with NuScale, I was hopeful SMR tech would make nuclear (or nukeeler, as our two most recent GOP Presidents like to say) less cost prohibitive. It hasn't. It is by far the most expensive power source and takes by far the most time to implement.\n\nBut you're correct about solar and energy storage solutions (other than hydro). It wasn't until China essentially bought the German solar industry and shipped production to China (literally taking the factories apart and shipping them to China--a fascinating process, if you've seen it) that it started being more price-friendly.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "-ReadingBug-",
                    "body": "Correct. Other answers, nah.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "fearlessfeminist623",
            "body": "Education plays a large part in this as well.  I grew up in WV. Our schools were severely underfunded in the 90s even.  It sounds awful to say, but a lot of people don't have the education or know how to think critically.  Education is often not made a priority since families are so poor you need to immediately find work. It's sad honestly.  Most of us who do figure out how to think critically leave. It's wild how awful thr disconnect is.  My own mother for instance is praisng Trump for dismantling the government and saving us money.  She's a teacher for Head Start.  I tried to explain that she will likely be put of a job and she just said \"that's fake news.  You need to learn to think for yourself and quit listening to all the woke crap.\"   Even showing her evidence she wouldn't budge.",
            "score": 16,
            "replies": [
                {
                    "author": "Safe_Froyo_411",
                    "body": "Get back to us when Trump has had a chance to fulfill his threats - or not. He’s been more noise than action. I sincerely hope your Mom is okay longer term.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "fearlessfeminist623",
                            "body": "It sounds callus, but I don't truly care what happens to her at this point. They disowned me 5 years ago ehen I refused to cowtow to their belief that covid wasn't deadly. Oh and before that they barely spoke to me because I dared to leave WV for a blue state. Haha.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PickleManAtl",
            "body": "I grew up in West Virginia. Left in the 80s along with many kids in my high school class who were tired of the ignorance, and not looking forward to a life in a coal mine or working in a chemical factory. I really can’t explain why people there continue to believe the lies that they get from the politicians. but generation after generation, they fall for the promises that things will be better if someone is elected, and it has not improved at all. West Virginia is still one of the poorest states, has really bad healthcare, the least job diversity, poor infrastructure, and an ongoing opioid crisis.\n\nEven though Joe Manchin claims to be a Democrat, he’s far from it. He’s been in politics since I was a kid growing up there literally for decades. He has held several different elected positions. Other than getting a few roads fixed, the state is in no better shape now as it was then . However, he and his wife and children have all become millionaires. But yet people would keep voting for him. 😑. \n\nThere are two groups of people who are from there. The smaller percentage who wise up and leave the state. The larger percentage who continue to sit in their single wide thinking that things are going to change soon. 10, 20, years later they are still sitting in the single wide, thinking the same thing. Again, I can’t find a reason for it other than a complete lack of common sense and observational skills.",
            "score": 25,
            "replies": [
                {
                    "author": "jpd2979",
                    "body": "Joe Manchin was definitely more liberal than the people they have running West Virginia though...",
                    "score": 10,
                    "replies": [
                        {
                            "author": "PickleManAtl",
                            "body": "Only a little. I mean he kept getting reelected with Republican voters.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "jpd2979",
                                    "body": "He certainly was pro choice and gave us Ketanji what's her face. And a very green anti coal infrastructure and inflation bill... He was just really adamant about not getting rid of the filibuster and didn't seem to really care about the Dobbs decision negatively impacting women in red states. His logic was probably if you want to get an abortion just go to Pennsylvania and come back to work on Monday",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Impossible_Ad9324",
            "body": "The culture is very individualistic and fatalistic. The best paying jobs are in mining, but those jobs kill you—either fast in a mine collapse or you’ll eventually suffocate when your lungs are ruined. Coal mining companies will spend every spare cent they have fighting union progress and black lung lawsuits and compensation. \n\nAnd yet, working in coal mining is a badge of honor—a sort of ‘fuck you’ to anyone who might suggest the work that kept your daddy and granddaddy in a house and able to support a family isn’t praise-worthy. \n\nWhen I lived there I met seniors living in literal shacks who were the proudest (if not the smartest) people I’d ever met. They didn’t have much but goddamn it was theirs. \n\nBut that’s not all of WV. There are respectable academic institutions, some of the cultural enclaves are the most vibrant I’ve seen in any state, and the state itself is in the top three most beautiful I’ve lived/visited and that’s compared to big mountain states out west. \n\nWhy do they vote republican? Misinformation. At this point it’s pretty much why anyone votes that way. They may be particularly vulnerable to it, with their already fatalistic way of viewing the world.",
            "score": 11,
            "replies": [
                {
                    "author": "Corellian_Browncoat",
                    "body": "> They didn’t have much but goddamn it was theirs.\n\nI have no data behind this, but I suspect there's a good deal of the \"it's mine, god dammit\" comes out of the legacy of the coal wars. Mine companies owned the very housing miners lived in, and only paid workers in company scrip so they could only buy food and goods from company stores (at outrageously inflated prices). Union men struck against the companies and fought, bled, and died against deputies, Pinkertons and other \"private detective\" outfits, state police, and even the US military for rights that included things as simple as being able to be paid in actual money and buy a home with cash that was actually theirs. Blair Mountain (Logan County, WV) was just over 100 years ago, only a few generations and well within oral family history range. Somebody who is retired (or \"seniors\") may well have grown up hearing stories of the coal wars from participants or the children of participants, carrying on the perspective of \"mining built this town and bought this house.\" I think you're spot on about mining being a badge of honor, and the whole \"if it was good enough for your grandpappy and great-grandpappy, it's good enough for you\" kind of mentality. It's the same kind of thing you see in lots of rural areas with large employers.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Impossible_Ad9324",
                            "body": "Insightful perspective and I think you’re likely correct. \n\nI wish that history were better documented and was a stronger influence in modern day politics.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Corellian_Browncoat",
                                    "body": "I don't think things like that will ever really be taught. One of the few things the political class agrees on is the need to keep the working class in their place. There's no percentage for the right-wing racists, the 'just call the cops' limousine liberals, or the authoritarians on both sides to teach about armed resistance. A romanticized version of the American Revolution is about all we get taught, to advance the [American civil religion](https://en.wikipedia.org/wiki/American_civil_religion), but even that focuses on the \"taxation\" part of the \"no taxation without representation\" rallying cry, when it was really about political representation and at a higher level a sense of colonists not being afforded their due rights under English law (one of the articles of the Magna Carta of 1215 specified that scutage, an early form of taxation, could only be levied by consent of the realm - that is, the crown could only tax the knights and peers if the peerage agreed it was necessary that it was good for the realm, so Parliament couldn't tax the colonists if the colonists weren't represented. See also the Constitutional prohibition on direct taxes in Article I Section 9, as an extension of that same theory - the states could tax *people* but the Federal Government couldn't. We had to ratify the XVI Amendment in 1913 to enable that).",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bizarre_Protuberance",
            "body": "When you drive through West Virginia, you cannot help but notice that there are a ridiculously large number of churches there.  Seriously, drive through some of these towns and I swear every third building on the main drag is a church.\n\nThe evangelical movement has gone all-in for Trump, and any place with more churches than schools is going to be all-in for Trump too.\n\nChurches have leaned right for a long time, but what we've seen in the last twenty years is more than just leaning right.  They're full-blown right-wing propaganda networks now.",
            "score": 15,
            "replies": [
                {
                    "author": "wha-haa",
                    "body": "Those churches are not new.  They are many because each community has a couple to accommodate the various denominations. That coupled with the terrain creating such isolated communities. That leads to numerous small churches.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bizarre_Protuberance",
                            "body": "So why doesn't EVERY small town look like that?  No, rural WV has an unusual number of churches.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Beard_of_Valor",
                                    "body": "Because there's no network between WV Town A and WV Town B and WV Town C so that only one has to have the big church. The hills and rivers make it hell to lay roads, and so roads kind of spaghetti around more than, say, Oklahoma.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "dickpierce69",
                                    "body": "While WV is incredibly white, its European influence is fairly diverse. It was a place where laborers could settle and make a living. That with it brought a lot of cultural and religious influence. Many of them were used to their small, community based churches. Where there may only be 20-30 people there on Sundays. That still sort of exists today. I grew up in a city of ~5000 people. There are probably 50 churches in town. No church gets overly big because it’s viewed negatively. Mega churches are viewed to be more about money than god. People\nWant a small, tight knit community within their denomination so that the church’s relationship with god is closer.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "UnfoldedHeart",
            "body": "I don't know how reliably Democrat West Virginia was, historically. The last time they voted for a Democrat was Bill Clinton in 1996, and if Ross Perot wasn't running in 92/26, it probably would have been a pretty close battle. (Clinton got 51.5% of the vote in 96, and if Ross Perot voters had sided with the Republican in 92, Clinton would have lost.) \n\nWV went with Dukakis in 88 for some reason, and they liked Carter before that, and went with Nixon in 72. Generally, the blue margins in WA (when they happened) were typically not crushing.\n\nI don't know much about WV culture in the 80s and 90s but when you add all of that up, it signals to me that there were some more situational factors at play. You might be able to chalk 92/96 up to the fact that there was a strong and somewhat viable third party option that took votes away from Republicans, for example. \n\nIf you want to dig into the issue a little deeper, I'd recommend pulling up some exit polls and looking at them side by side. It will give you a much better, data-based answer than the usual response which is something like \"WV is full of dumb people.\"",
            "score": 4,
            "replies": [
                {
                    "author": "Beard_of_Valor",
                    "body": ">dig a little deeper\n\nOr just look at other politicians than presidents. Like [Byrd](https://en.wikipedia.org/wiki/Robert_Byrd) who served as a democratic senator for fifty damn years and brought home allllllll the pork barrel spending.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Minute_Car_7294",
                            "body": "I'm beginning to think that pork barrel spending was a good thing after all. We got away from bipartisanship when it was banned. We also see less connection between government and our lives by not having direct investments from pork barrel spending that our representatives brought home.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Beard_of_Valor",
                                    "body": "It certainly lubed the ol' machine. I'm not sure I'd want to go back, but I'm not sure I'd put up a fuss either.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lr20005",
            "body": "It’s due to coal mining, which Republicans are more supportive of at this point. Peter Santenello’s Appalachia videos on YouTube do a very good job of showing the economic situation in WV…they’re totally dependent on coal mining, and they talk about the politics in one of the videos.",
            "score": 7,
            "replies": [
                {
                    "author": "polishprince76",
                    "body": "There's an episode of Anthony Bourdain's show where he goes to West Virginia as well and does a decent job of talking to folks. Its the same story. Coal. Always coal. Guns and religion as well, but it's mostly coal. People dont want job training. They yearn for the mines. You're not changing that mentality.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "wha-haa",
                    "body": "Those are some great videos that do well at providing a peek inside.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mspence-Reddit",
            "body": "WV is culturally conservative. We don't have much in the way of resources these days except for tourism. After the 1980s or so WV was a remnant of the \"Solid South\" when the South was mostly Democratic.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ratpH1nk",
            "body": "It starts here...\n\n[https://www.britannica.com/topic/Southern-strategy](https://www.britannica.com/topic/Southern-strategy)",
            "score": 3,
            "replies": []
        },
        {
            "author": "sardine_succotash",
            "body": "Basically, WV still had a lot of backwards knuckle-dragging ass Democrats going into the 90s. Same thing in states like Arkansas. Conservatives defecting to the Republican party after the civil rights movement was a movement that some were slow to join. Some just didn't switch.\n\nThis would also, at least in party, explain why Democrats are so accommodating of regressive scumbags. They never really countered the Southern Strategy they just kind of let it happen to them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LifeExpConnoisseur",
            "body": "Copy pasted from another post. I think they explained it well. \n\n\nA warning from an America who understand America and Americans.\n\nI live in rural America, a place where roughly 80% of the population in the 2024 election voted for Trump.  I know dozens and dozens of Trump voters.  My father-in-law is an evangelical Christian.  I’ve been to church our here on several occasions.  Being a white man, other white men out here just assume I think like them and say things openly and comfortably.  I have an exceptionally good read on them and their mindset.  \n\nSKIP BELOW IF YOU WANT TO GET TO THE MAIN POINT  \nTo prove this, I am going to tell a quick story, you can skip below if you don’t care to read it.  Christmas of 2020 I was at my parents house out of state, and politics came up.  My family is a working-class family, and they watch various news sources but mostly Fox News.  We talked about a lot of stuff and my Mom and Dad didn’t believe what I was saying about Trump voters. In the moment, I said to my parents: “Mom, Dad, I’m telling you right now, that between now and January 20th they will try to overthrow the federal government.  Roughly 1.5 weeks later I got a phone call from my Mom “I can’t believe it, you were right”.  Her and I watched the Jan. 6 insurrection on TV and talked about it over the phone.   \n\nMy prediction, which I was 100% confident in, is based on what I saw as the convergence of a handful of things.  1. Economic misfortune.  2. Religious ressentiment towards an increasingly secular culture. 3. What I describe as the industrial economy hitting the information age like a sports car hitting a brick wall.  4. Increasing reliance on alternative news sources promoting far-right ideology.  5. the conversion of churches into pseudo-political organizations. 6. breakdown of traditional gender norms. 7. Failure of the education system to teach philosophy, ethics, and civics. 8. online self-segregation of political discourse, i.e. bubbles.  In my view of things from living out here, talking to people, seeing the yard signs, seeing poverty like I’ve never seen before, and routine engagement in conservative online spaces, my view was that while America had seen many of the above before, this time in history is unique because they were all coming together at the same time.  Each of those things listed above are self-reinforcing, and frankly they’re too complex for government to figure out all at once.    \n  \nMAIN POINT  \nYou’re in trouble, and you need to prepare yourself.  Most of the people around me are not capable of abstract or analytical thought processing.  I can’t fully explain it, but I’m telling you they’re not.  At the same time, they believe several things that are important: 1. they’ve been screwed over, personally, by liberals. 2. they’ve been screwed over collectively by other nations. 3. They’ve been conditioned over a lifetime not to question authority, with church being the main driver of that. 4. They believe their government has literally been stolen from them.  5. Same goes for culture. 6. They believe that liberals are literally evil. 7. They believe they are on the side of God.  8. (IMPORTANT) They believe that Donald Trump was sent by God to right the world. \n\nI’m telling you right now, if Donald Trump says invade, they will do it.  If the U.S. Military refuses due to congress not declaring war, which in the U.S. Constitution requires, then many of these people will form unregulated militias and it might take more time, but they will eventually organize to invade.  I’m not trying to cause panic for your country. Growing up I lived just across the border from Canada, my family visited often, and one year I even ended up dating a Canadian girl and spending the entire summer up there.  So, I say from a place of great admiration and respect for your country and your people, the situation is very serious.  I don’t know exactly what types of programs and systems your military has, but I would highly advise all people of age learn how to use a firearm.  Likewise, I would highly suggest that you all quickly learn about combat tactics and basic military strategy.   \n  \nI am locked into American politics.  And over the past 8 years I have watched time after time after time after time, 1000 times people say “Trump would never do that” and “that’s just how he is”.  And time and time again I’ve watched him do all the things people said he wouldn’t do.  It gets worse, and worse, and worse and no matter how bad the last thing was and how much you think he will stop at this or that  line in the sand, he goes past it. Worse, time and time again we’ve said to ourselves “congress would never allow that”, “Republicans won’t let it get to that point”, the corporate lobby will reign him in, the courts will bring an end to this, and so on, and guess what? It hasn’t happened.  And it’s not going to happen.  \n\nI say this with complete sincerity, Donald Trump is untouchable.  And I’m also saying, that at this very moment there is not a single lever/force of power or opposition in the United States of America that is capable of reigning him in. At this very moment, the only thing between him being the President of a constitutional republic and him being a dictator with complete control is him declaring himself as such, and if he did there is nobody left here to stop him.  It’s the unspoken reality of the situation.  Right now, despite appearances, if Donald Trump were to say “The constitution is suspended”, we will immediately be in a “Law of the Streets” situation.    \n  \nYOU’RE NOT CRAZY.  The situation for Canada is as serious as it seems.   \n  \nI’m extremely sorry that we have failed in our efforts to resist his rise here.",
            "score": 4,
            "replies": [
                {
                    "author": "santaclaws_",
                    "body": "This is, unfortunately, the most accurate description of our situation in the USA that I've read so far.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tag8833",
            "body": "They hate their neighbors.  Watch any interview of an average person from WV and they will tell you all of their neighbors are drug addicted freeloading welfare queens.  Their little circle of friends are the last good ones doing things right while everyone they don't know personally is awful and deserves to suffer.  \n\nTrump will bring suffering to WV by cutting off government aid.  It is what they want.",
            "score": 9,
            "replies": []
        },
        {
            "author": "None",
            "body": "Black guy here. My family always told me to avoid that State and I am nearly 50.",
            "score": 7,
            "replies": [
                {
                    "author": "Beard_of_Valor",
                    "body": "White guy here. Especially [Boone County](https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Map_of_West_Virginia_highlighting_Boone_County.svg/1344px-Map_of_West_Virginia_highlighting_Boone_County.svg.png).",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "DavyJonesCousinsDog",
            "body": "A fun mixture of gerrymandering, systematic dismantling of the public education system, nonstop propaganda, and a few generous helpings of straight up cheating. Though the Democrats willfully failing to recognize that the bulk of their historic base was working class white men (who may or may not be a teensy bit racist/sexist) didnt help.",
            "score": 5,
            "replies": []
        },
        {
            "author": "NerdimusSupreme",
            "body": "They are poor and not economically diverse. Trump says coal every once in a while.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RobotAlbertross",
            "body": "Folks from those hills just hate the US government. \n  Trump managed to convince them he is a good alternative. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "chaosmagick1981",
            "body": "Where I live in WV its not really wv culturally. It is more western PA and the town i live in is VERY liberal. I grew up in Baltimore and lived in Oregon for a couple years. I see less racism and shit like that here than in the cities Ive lived in. The racist things Ive heard here have always come from outsiders here for college. Especially from the Jersey kids here which there is A LOT of. Here it is more about the class war than the race war when it comes to the actual residents who live here and not the college kids.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jake0024",
            "body": "General white grievance politics, a specific anti-environmental angle (\"coal country\"), and the lowest rate of college education in the US (including Puerto Rico)",
            "score": 1,
            "replies": []
        },
        {
            "author": "RyloKloon",
            "body": "Because we live in a topsy-turvy clown world that seems to have come into existence for the sole purpose of allowing Donald J. Trump to do whatever he wants all the time with impunity even if it makes not a tiny modicum of sense. He has somehow been granted a cheat code to the very fabric of space and time and if he said the sky was made of dildos,  two-thirds of the entire universe would agree it was so.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Wermys",
            "body": "Peter Santinello who definitely slants right but actually does a good job providing background and context to locals in areas that are run down highlights partly what they are frustrated about.  What these people are looking for is a community and for a company to come in and take care of them and there communities.  They want to work but they also want someone to take care of them.  They don't want handouts but they do want someone who provides guidance and a job for them that is stable.  Part of the desire for a lot of populists is not charity handouts but a sense of community and desire to work towards something.  Democrats focus on assistance in particular progressives.  But they miss the boat that isn't really what they want.  What they want no longer exists and they are not voting for Democrats until someone comes along and gives them what they want or they die and become a part of history.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nice-Sandwich-9338",
            "body": "WV voters are very illiterate in political policies.  In the last 20 plus years they voted the Manchins, father and son, Governor and Senate.  In those years WV rank. In all metrics, wages, employment, education, job creation, poverty, health coverage, tax credits were 50th to 46th in states rankings.  Never  any improvamts for the peoples quality of life.  Manchins became millionaires in promoting coal, fossil fuels and nothing else.  Joe lives a grssstclife owning several mansions, lands and a yaut.  He gave his son fake ownership of his coal reclamation company while Joe was a Senator.  Joe recieved $500,000 every year from his son on profits in dirty coal residue that hey sell.  Manchin never considered helping his WV voters as his record is coastal clear, stand up for his coal mine and employees to make him rich.  Voters just didn't understand political policy and as a con man Manchins capitalized on their trust and conned them for all those yesrs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Greyachilles6363",
            "body": "I'm my opinion, it is because people who have been poorly educated and a highly indoctrinated are both naturally fearful and angry and as a result do exactly what they are told by any authority figure that crosses their path. They cannot and will not think for themselves. They are the definition of sheep and since the GOP is far more aggressive when it comes to fear-mongering they got the people to listen to them",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sassafrazzlin",
            "body": "West VA is mostly rural, white and poor. More uneducated are poor and uneducated white people love Trump in larger numbers.  Trump speaks confidently with slogans and 5th grade language that they can understand.",
            "score": 1,
            "replies": []
        },
        {
            "author": "someinternetdude19",
            "body": "As a state with lower rates of higher education, and more of the state being manual labor working class, they are best represented by the GOP. It’s well known that the democrats no longer want to attract the working class. They are the party of the elite.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dickpierce69",
            "body": "There are many factors that contribute, but the easiest way the simplify it is there is a poor bs Rich mentality. \n\nGrowing up it was always the democrats support the poor and republicans support the rich. That mindset started flipping around Al Gore’s emergence. Talking about the environment as justification for putting hard working people out of jobs didn’t sit well with many. That’s when there started to be a shift towards believing Democrats didn’t support the poor any longer. The GOP stepping in and lying about things to be their savior completely flipped the narrative and suddenly it was the GOP is for the poor and the Democrats are for the wealthy elites.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrosenkranzKeef",
            "body": "Anti-union sentiment combined with dying coal industry. It’s a really weird thing happening there. They elected Manchin to the Senate multiple times as a Democrat despite the state being red, and Manchin basically voted like a Republican especially in his later years serving.\n\nCurrently they’re basically screwing themselves; they’ve become both anti-union AND are trying to prop up an industry on life support.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YogurtclosetOwn4786",
            "body": "Demographics. It’s white working class. Those voters have shifted Republican. Even before Trump, WV had become quite red.  But it has accelerated with Trump",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlobiusHole",
            "body": "Guns and religion. Not Christianity though. They believe trump is their savior.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikedorty",
            "body": "Have you ever met anyone from West Virginia?  I was in the army with a bunch. Now, im sure the best and brightest aren't enlisting, but holy shit the ones that i was around were spectacularly dim.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MonarchLawyer",
            "body": "WV is the most authleft state of any in the Union.  They love worker's rights (even unions) and conservative culture wars.  Trump \"delivers\" here.  \n\nFirst, we have to talk about how depressed WV is.  It was coal country and developed its entire economy based on white working class coal workers but the modern age has devalued their labor significantly.  Regulations, competition from natural gas and renewable energy, and fracking have really depleted the amount of workers needed.  They are a rural state but with the mountains they just don't have the geography to get into any agribusiness.  Further, they don't have any major cities to develop a white collar economy.  Tourism brings in some money but that industry cannot prop up a whole economy.  Trump comes in and is against free trade and for white working class rights.  You can debate whether he is effective (I don't think he is) but those former WV coal miners love him and believe he will put them back to work mostly by gutting their international and renewable competition.  I think they're wrong and Trump's not going to stop automation and natural gas which is their main competition.  \n\nSecond, they are culturally conservative.  They are white rural undereducated Christians.  They love all that Fox News culture war stuff.  They also have an aging population as younger people tend to leave the state for employment.  \n\nThese factors mean it is Trump country by a wide margin.  \n\nIt *used* to be democrat because the democratic party used to be the one that was authleft.  Strong worker's rights but culturally conservative (i.e. pro Jim Crow).  That started to change when LBJ signed the Civil Rights Act and Voting Rights Act.  WV like the South, went red.",
            "score": 1,
            "replies": [
                {
                    "author": "Beard_of_Valor",
                    "body": "Don't get me wrong, Dupont took giant shits in the river, but conservation of waterways and similar efforts are also much stronger in WV than I think most people realize. Go lay that pipeline down, Stan, but if you don't remediate that mountain top and keep it from sloughing off into the river turning it red-brown we'll fuck you right up.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MonarchLawyer",
                            "body": "I feel like that's mostly a reaction to the companies laying waste to the state.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Beard_of_Valor",
                                    "body": "yeah I'm not saying it's shared ideology",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LowerEast7401",
            "body": "Democrats hate poor whites and call them white trash and hillbillies and mock them for not going to expensive colleges like they did. \n\nWhy would a state full of “trailer trash” vote for them?",
            "score": 1,
            "replies": []
        },
        {
            "author": "chmcgrath1988",
            "body": "West Virginia seems like it's been a red state forever, but Clinton won it twice (and Dukakis before that). Granted 25-30 years definitely feels like forever ago, in the political world but it sure doesn't seem like WV has been a blue state in my lifetime, given how hard red they've been since the 2010s.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hyperbole_is_great",
            "body": "West Virginia has always struggled economically.   Democrats used to at least pretend they cared.  But they did nothing.   Add in the war on coal and why should West Virginians vote blue?   The democratic shift away from working class issues to identity politics has caused serious political repercussions.   First it was West Virginia.    If Dems don’t course correct I can definitely see the rust belt following suit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "alphex",
            "body": " They’re idiots.   I mean that literally.   They’re ignorant of facts and have no logical comprehension of political consequences and are responding to sound bites and empty promises from a man who lies to everyone.    Their inability to do research and learn about the way things work leaves them as prey to right wing media.",
            "score": 1,
            "replies": []
        },
        {
            "author": "discourse_friendly",
            "body": "People change, parties change. \n\nGOP was talking about immigration and the taxpayer funded hand outs they were getting. \n\nDems talked about how they were not the GOP. \n\nFor west Virginia the GOP messaging was wildly more popular.  \n\n\n\nIts one thing for your state to take a big economic hit when we shift away from Coal.  its an other to see that happen, and watch someone else get handouts.  and see one party will continue that as the statue quo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrumblyData3684",
            "body": "They are probably the best example of the cognitive dissonance and the effects of uneducated electorate. WV has the highest percentage of population on Social Security Disability (8%) and one of the highest medicaid enrollments (28%). \n\nThe wealth and power in the state has chosen a course of pining for bygone days and using it rouse the citizens - while they actively vote against bringing new industry to the state. \n\nEssentially, they want to vote for a time machine - BUT, if the average West Virginian had to work as hard as when coal was king, they'd be gone in a heartbeat. Appalachia has great people - but they also have an ingrained mythos that the work they do in that region is somehow harder than everywhere else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaineHippo83",
            "body": "The southern strategy and party realignment, while this swapped the parties, there were many older people who stuck to their party despite being conservative.  So the blue-dog democrats. Similarly New England republicans were the counterpart to this. Both Bluedogs and NE Republicans are a dying breed.\n\nWith fewer conservative democrats in WV it has become Republican.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComprehensiveHold382",
            "body": "[https://www.nationhoodlab.org/](https://www.nationhoodlab.org/)\n\n[https://www.nationhoodlab.org/](https://www.nationhoodlab.org/)\n\nAppalachia. \n\nThe people of Appalachia see Trump as another Andrew Jackson. And Culturally Appalachia likes that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dr_CleanBones",
            "body": "There aren’t any jobs in West Virginia, because the natural resources extraction industries don’t want to build a place to live, they just want a place to exploit. They extract the wealth from the ground and take it away to where it can be used - a place where people do live.  Since there are no jobs, especially jobs for educated people, the kids who,leave to go to college end up never coming back. That means the population skews older, less educated, and poorer. They started voting Republican about fifteen years ago; all of the government has been Republican for years. Every year, the situation gets worse, and every year they vote for even more Republicans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Akantis",
            "body": "The real reason is the severe brain drain and aging population. All the children and grandchildren of the people who fought in the mine wars and who understood what unions meant worked hard and ended up having to leave the state for other opportunities. People forgot that WV is very centrally located on the East Coast/MidWest with a lot larger cities, schools, and population areas. That gives people a lot more places to go that aren't that far away from their family.\n\nTLDR - forty years of the hard working left-leaning populace got jobs and left, while the powers-that-be in the state deliberately tanked most economic opportunities being developed because they would rather consolidate their power and influence and have a population they can control.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Malaix",
            "body": "Coal. WV is like if you took a coal mining town and stretched it out to be a state. Their whole identity is coal. Al Gore's correct warnings about global warming pissed them off. WV voters would basically rather boil the earth to death to keep its coal identity propped up than move on. And last I heard the industry isn't even really sustainable anyway. So basically they want the GOP to subsidize their failing dangerous and polluting mining industry because that is their identity and there really isn't a lot else going on there.\n\nThey basically want a magic solution to turn back the clock and avoid the fate of all mining towns eventually. Falling into irrelevance and becoming depopulated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShoNuf427",
            "body": "This is easy. 1st, remember, you must keep them uneducated. 2nd, make them believe that the only way to success is by way of being white. Then sprinkle in drug use and other illnesses and they'll belong to the GOP for years.\n\nNo amount of black lung will make someone turn away from what their daddy and grandaddy did when they have little education and no desire to gain more. When they believe the hype that higher-ed and science are the real evils and everything they need to know, they learned by kindergarten, it's really hard to save that person. You can never overestimate the power of stupid.\n\nNow add addiction, lack of health care because of the lack of employment, and you've piled misery on top of stupid. And because the state is about 90% white, there aren't enough people with a different mindset or focus to help them see things differently. They just continue to be brainwashed by Fox News because this is the way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chaosmagick1981",
            "body": "Where I live in WV its not really wv culturally. It is more western PA and the town i live in is VERY liberal. I grew up in Baltimore and lived in Oregon for a couple years. I see less racism and shit like that here than in the cities Ive lived in. The racist things Ive heard here have always come from outsiders here for college. Especially from the Jersey kids here which there is A LOT of. Here it is more about the class war than the race war when it comes to the actual residents who live here and not the college kids.",
            "score": 1,
            "replies": []
        },
        {
            "author": "harryandtimmygirl",
            "body": "my whole one side of my family is from wv and there used to be a long running joke that wv would vote for a dog before voting for a republican",
            "score": 1,
            "replies": []
        },
        {
            "author": "adeveloper2",
            "body": "People whose livelihoods are dependent on non-environmentally-friendly practices are much more prone to anti-environmentalism, which is one of the corner stones of conservatism.\n\nAlso doesn't help that natural resource industries constantly promote conservative propaganda",
            "score": 1,
            "replies": []
        },
        {
            "author": "Latter-Leg4035",
            "body": "Because they are largely white and uneducated.  Their fentanyl and other hard core drug usage is among the highest in the nation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SorryToPopYourBubble",
            "body": "Why are any of them Trumpy states? He told them that every dumb thing they believed was not only okay but true, riled that into anger, and then pointed that anger at everyone outside of the Republican Party. \n\n  \nNow. I'm not saying the Democrat Party hasn't had its failings but the simple fact remains that the whole damn Republican platform is built on massive amounts of lies and fearmongering to control people that don't want to take the time to think about anything outside the little bubble that is their day-to-day life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dinosaurkiller",
            "body": "This is true of many States including Texas and Oklahoma. There is no coal in Texas or Oklahoma. FDR built a massive loyal coalition and sealed it with victory in WWII. It was not at all the Democratic Party we have today, they were Progressives, but FDR put the Japanese in internment camps and while he was no Nazi you could see some white nationalism in his version of the Democratic Party. It was a very working class party with huge unions and a broad base of support. The Republicans spent decades chipping away at that coalition and it support of Democrats and frankly the Democrats helped them. “When they go low, we go high!” basically means instead of meeting voters where they are Democrats thought they could lecture voters over right and wrong and shame voters into voting the way the Democrats want. Meanwhile Republicans built a multibillion dollar propaganda network that flat out lies to those same working class voters and very effectively sways their votes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "judge_mercer",
            "body": "* In 2024, West Virginia ranked 46th out of 51 states for school systems. \n* In 2022, 85% of eighth graders and 78% of fourth graders were not proficient in math and reading, respectively. \n* In 2023, 42.5% of students were proficient in English language arts (ELA) and 37.4% were proficient in math.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BobAndy004",
            "body": "It’s pretty simple concept, very poor, labor unions demolished thanks to republicans then comes this goon talking about bringing back American jobs and shit, like coal gas steel jobs, that’s West Virginia bread and butter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Final_Meeting2568",
            "body": "Because there is an inverse relationship between religiosity and poverty/suffering.. the more suffering the more religiosity. Without suffering and uncertainty the only appeal of religion would be social which is available other places.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tcspears",
            "body": "Obama and Trump both campaigned on populist themes that directly speaks to the sentiment in these areas: “the system is rigged”, “illegal immigration is keeping wages stagnant”, “globalization is hurting the rural classes”, “we need change”.\n\nWest Virginia had all their eggs in the coal basket, and coal went bust.  Everyone with higher skills and education, moved out of the state to find work.  The people that stayed are left with homes that lost most of their value, a crumbling education system, no real job prospects, and a loss of hope.  They voted for Obama twice, but while Obama did improve things in the wealthy urban areas, many of the collapsing rural areas like WV didn’t see any change.  After 2 terms of Obama, there was another populist promising change: Trump.  He had many of the same talking points as Obama (bring back coal, the elites are against you, et cetera).\n\nWe saw this play out again in the 2024 election, where democrat voters are increasingly wealthy, educated, and getting more white.  The democrat party has become the party of big business, corporations, and the wealthy.\n\nMeanwhile, the Republican Party (especially under Trump’s brand of economic populism) has become younger, more racially diverse, and more working class.  This is because the working classes, like in West Virginia, have seen all their opportunity, money, and jobs going to the coastal cities, and have felt ignored.  This shift has been happening for decades, but both Obama and Trump accelerated the shifts we see now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leather-Map-8138",
            "body": "The more educated a population, the more liberal their voters. This doesn’t have to be true, but it happens to be true.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pinkydoodle2",
            "body": "I see a lot of people skipping over an obvious point. West Virginia is top two whitest states in the country and there are a lot of people there who are VERY into white identity politics and white supremacy.\n\nAlso, the state has lost a ton of population over the last 50 years or so so it's sort of a self selecting group in a lot of ways.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Todayphew5725",
            "body": "Because over the past decade the Democratic Party has become super elitist, judgemental, full of hate, etc. Liberals are incredibly vocal about hating white people. Well guess what? That kind of rhetoric isn’t going to get you votes in West Virginia.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdamJMonroe",
            "body": "The Democrat Party relies on its name and has stopped actually supporting democracy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SrAjmh",
            "body": "West Virginia on the whole fits perfectly into an old Obama quote:\n\n\"*You go into these small towns in Pennsylvania and, like a lot of small towns in the Midwest, the jobs have been gone now for 25 years and nothing's replaced them. And they fell through the Clinton administration, and the Bush administration, and each successive administration has said that somehow these communities are gonna regenerate, and they have not. And it's not surprising then they get bitter, and they cling to guns or religion or antipathy toward people who aren't like them or anti-immigrant sentiment or anti-trade sentiment as a way to explain their frustrations.\"*\n\nThe truth is a lot of these areas are getting left behind and are subject to at best apathy from the larger population and at worst condescension from democratic voters.  That makes them more susceptible to someone like Trump coming in and promising the revitalize their towns. It doesn't matter if it turned out he's lying, they're desperate and these people have essentially been left for dead economically and socially speaking since the 90s.  \n\nI think WV is a good example of what some people are trying to say when they mention the status quo elements of our government are what facilitated the rise of someone like Trump. The country hasn't \"worked\" for this people for decades.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thedisciple516",
            "body": "This is a pretty good video trying to explain it\n\nhttps://www.youtube.com/watch?v=eqceHviNBC4",
            "score": 1,
            "replies": []
        },
        {
            "author": "HayleyCzCT",
            "body": "Trump said in 2016, he'd bring coal mining and it's been 9-years and they're still hoping against hope that the coal mines come back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Solo-Firm-Attorney",
            "body": "The shift largely comes down to the decline of coal unions and changing party alignments. WV's Democratic roots were deeply tied to strong labor unions and New Deal policies that supported coal workers, but as unions weakened and the Democratic Party's environmental policies increasingly targeted coal, many West Virginians felt abandoned. Meanwhile, Republicans effectively capitalized on cultural issues (guns, religion, traditional values) and promised to revive the coal industry - Trump's \"bring back coal\" message particularly resonated here. It's less that WV suddenly became super conservative (it was always socially conservative), and more that the Democratic Party's priorities shifted away from the economic populism that once attracted rural, working-class voters in coal country. The state's high poverty rates and economic struggles also made Trump's anti-establishment message especially appealing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sapriste",
            "body": "They believe that the Government can force people to buy their coal.  This is a failure of the Democrats playing chess with only the white pieces.  When you observe disruptive technology you don't smother it but you do have to draw the logical conclusions and figure out what to do with the people impacted by those after effects.  This is why we should have kept investing in space seriously.  I believe that the desire to gather resources from asteroids, the moon and maybe Mars would generate both technology and human resource heavy industry.  You also have to shut the door on the industry and stop people from preparing to enter job categories that are now legacy.  Same for steel workers, same for clerks, same for secretaries.  The idea that a virtual jump ball could be tossed up and displaced workers would randomly come down with new careers was short sighted and the natural outcome of only listening to MBAs when you create policy.  Every leadership team should have a Blue/Red approach.  Folks trying to do it and folks trying to prove that it just won't work.",
            "score": 1,
            "replies": [
                {
                    "author": "wha-haa",
                    "body": "As AI gets integrated, self driving vehicles become common and automation continues, many more will get the chance to hear “learn to code.”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YouTac11",
            "body": "The GOP at least says they care and want to help\n\nThe DNC does little but look down on the people of WV.  Be honest with yourself, what do you think of the people of WV",
            "score": 1,
            "replies": []
        },
        {
            "author": "jmsy1",
            "body": "They have been convinced to fight a culture war rather than a class war. This favors republicans in a very religious state. \n\nAdditionally, telling coal workers to retrain themselves to code software doesn't go over well (stupid Hilary and DNC messaging)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ABN1985",
            "body": "DEMS are to blame for trump being elected thier policy sucks the people the DNC force down your throat suck",
            "score": 1,
            "replies": []
        },
        {
            "author": "hjablowme919",
            "body": "Ever been to West Virginia? Arguably some of the dumbest people in America in that state. Been voting against their best interest for decades.",
            "score": 1,
            "replies": [
                {
                    "author": "SevTheNiceGuy",
                    "body": "pretty much this... \n\nIf WV operated as an independent country it would be viewed as essentially a third world country.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "I405CA",
            "body": "The Democrats were previously the party of slavery, then Jim Crow segregation.  They had a firm lock on the Southern white vote.\n\nThe Democrats began to lose the white South when Truman desegregated the military.  This process was accelerated when LBJ supported the Civil Rights Act and War on Poverty.\n\nBy the mid 90s, much of the white South had moved to the GOP.  West Virginia was among the last of the Dixiecrat holdouts.  It didn't quite have the internal racial tensions of other Southern states, as it is almost entirely white.  Still, it has a lot of the same attitudes, so it was a matter of time before it followed other Southern states.\n\nThe \"solid South\" used to be very Democratic.  It has completely flipped.  Same attitudes, different party.\n\nThere are still some Dixiecrats in Kentucky.  They will vote for Democrats in local races, but for Republicans in the federal ones.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Longjumping-Layer210",
            "body": "Well, I think that Clinton’s 1996 Personal Responsibility and Work Opportunity Reconciliation Act,  NAFTA, and the opioid epidemic during Obama really killed democratic support.\n\nAlso, Joe Manchin is a master communicator, despite being a real snake.  He sounds so reasonable even though he really waters down any fundamental  change. But given that the DNC really doesn’t give a flying shit about WV, I don’t blame people for voting for him. Opioids really destroyed many families in the rust belt.",
            "score": -1,
            "replies": []
        },
        {
            "author": "CptPatches",
            "body": "The Democrats have an uncanny ability to recognize a problem (the danger, lack of efficiency, and environmental impact of coal) and provide no alternative. Why vote in a party that posed a threat to your livelihood? I'm far from a conservative, but if I was a West Virginian, I'd probably see no hope for my state in their hands either. \n\nThe reason they had a Democratic senator for so long was because that senator was Tim Manchin, a senator so conservative it's a mystery why he didn't just switch party affiliation.",
            "score": -1,
            "replies": []
        },
        {
            "author": "cleric3648",
            "body": "Coal and racism. I’ll expand since the comment is too short, but the quick version is coal is the biggest economic driver in WV, even though Whole Foods employs more people than the coal industry. And having known quite a few West Virginians in my time, they hated Obama simply because he was black. They were the only state that flipped blue to red in 2008 and they’ve been solid red ever since. Maybe if it wasn’t all rural and 90% white there’d be a chance of flipping it in 20 years but it’s gone for a generation. \n\nSource: I’m from Western PA and spent a lot of time in and near WV.",
            "score": -1,
            "replies": [
                {
                    "author": "dickpierce69",
                    "body": "I disagree on the racism part. Not that racism does t exist there, it definitely does, but the shift started occurring before Obama. Al Gore and his push for environmentalism put a sour taste in a lot of people’s mouths. That was the main catalyst for people viewing the Dems as elitists. “Oh look, they think trees are more important than people” type of situation.\n\nSource: I’m from WV.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Assistant-8876",
            "body": "West Virginians are hopeless. So many of them are in abject poverty, yet they always vote for the party that suppresses them. It’s 100% a self inflicted wound. They never learn. That’s why I have no sympathy for anyone in the state who’s struggling, yet votes republican regardless. They’re getting exactly what they voted for",
            "score": -1,
            "replies": [
                {
                    "author": "Beard_of_Valor",
                    "body": "Way to punch down, leftie. When I worked in WV most of my coworkers came up to my elbows because they didn't have food security. Tell me more about how the people at the bottom deserve their lot.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Ok-Assistant-8876",
                            "body": "How am I punching down? I made it clear that my scorn was only towards those who keep voting republican against their self interests. It’s a self inflicted wound. They did it to themselves. Hard to feel sorry for anyone that constantly chooses to vote for people that will hurt them. Not very bright",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Beard_of_Valor",
                                    "body": "Imagine growing up not knowing where your next meal is coming from. I can't find stats quickly on what this was like when today's voters were still young, but here's some [current figures](https://scitechpolicy.wvu.edu/files/d/7fb596c1-288f-47e6-bb23-c138e05cfa20/food-deserts-and-food-insecurity-in-west-virginia.pdf). Overall literacy is poor, education is poor, health is poor (one of the better heart hospitals, though, if you happen to live near there). Parents unlikely to be educated or affluent. Virtually no one transplants *into* WV, so there's very little exposure to outside views. How is someone living that life going to come to the conclusion that Elizabeth Warren has got his back? To be clear, she does, and the CFPB has stopped a lot of malfeasance seeking rents from the poorest Americans, but it's not accessible information to someone who came up with next to nothing.\n\nNo one's bitching about Hatians voting for authoritarians.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "baxterstate",
            "body": "According to Democrats, no one should support Trump. He's trying to stop USAID, which spent:\n\n  \n$50 million to [fund condoms in Gaza](https://thenationaldesk.com/news/americas-news-now/doge-halts-50-million-payment-for-condoms-in-gaza-white-house-says-hamas-israel-trump-administration-government-efficiency-karoline-leavitt#)\n\n* $1.5 million to advance DEI in Serbia's workplaces\n* $70,000 for the production of a DEI musical in Ireland\n* $47,000 on a transgender opera in Colombia\n* $32,000 for a transgender comic in Peru\n* $37 million to the World Health Organization\n* $16 million in funding for [institutional contractors in gender development offices](https://x.com/statedeptspox/status/1884404541820657938) \n* Hey, you wouldn't want Democrats to think you're transphobic or DEIphobic, right? Some things are more important than whatever the needs of West Virginians are!",
            "score": -1,
            "replies": []
        },
        {
            "author": "Medical-Search4146",
            "body": "It helps that Democrats were the segregationist Party for much of  1936-2000. Democrats of the past were much more alike the Republicans today.",
            "score": -2,
            "replies": []
        }
    ]
}