{
    "title": "Did Globalization Just Make the Free Market Too Efficient for Its Own Good?",
    "author": "mrcsrnne",
    "subreddit": "PoliticalDiscussion",
    "rank": 8,
    "score": 4,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1imvave/did_globalization_just_make_the_free_market_too/",
    "id": "1imvave",
    "selftext": "Ah, globalization! That grand economic experiment where we were told that free markets would lift all boats, make us all richer, and turn the world into one big happy trading family. At first, it worked. Trade flourished, economies grew, and capitalists popped champagne. But here’s where things get tricky.\n\nWhat tends to happen next is less of a fairy tale and more of a thriller. Once firms grow large enough to wield the magic wand of global supply chains, they begin an efficiency quest. Labour, once a stable and locally anchored force, becomes a game of arbitrage—moving from high-wage economies to lower-cost regions. At first, this boosts corporate profits and consumer purchasing power (who doesn’t love cheap gadgets?). But soon enough, it triggers a paradox: the same workers who benefited from cheaper goods suddenly find themselves out of a job because their own wages are now “too expensive” compared to, say, a factory in Vietnam or a call center in the Philippines.\n\nThis isn’t a novel observation. Dani Rodrik, in *The Globalization Paradox*, argues that nations must choose two out of three: **democracy, national sovereignty, and hyper-globalization**—but never all three at once. When companies chase cheap labour worldwide, it weakens the social contract at home, destabilizing domestic politics. Karl Polanyi, way back in *The Great Transformation*, predicted that unregulated markets would eventually provoke a political backlash. Sound familiar?\n\nAs globalization speeds up, firms consolidate. Economies of scale mean that once an industry starts outsourcing, the biggest players outgrow competition at an alarming rate. What we’re left with isn’t the efficient free market of Adam Smith’s dreams, but rather a handful of corporate behemoths who shape industries, dictate wages, and set the rules. It’s not capitalism eating itself—it’s capitalism evolving into oligopoly.\n\nAnd here’s where things get dark. Economic distress fuels political instability. Laid-off workers, unable to transition fast enough to new jobs, don’t stay quietly unemployed. They get angry. They vote. And not for centrists promising nuanced economic policy—no, they turn to populists, strongmen, and “disruptors” who promise to break the system that failed them. Protectionism rises, economic nationalism takes over, and before you know it, the world is no longer discussing trade deals but trade wars. Worse still, history suggests economic dislocation is one of the key ingredients for actual wars (see: the 1930s).\n\nSo here’s my question to you, fellow Redditors and armchair economists: **Is there a way for economics to self-correct before it spirals into geopolitical disaster? Can we design policies that maintain competitive markets while preventing the economic distortions that lead to instability and war?**\n\nWould love to hear your thoughts—before the next financial crisis or world conflict proves the theory right.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lauchiger-lachs",
            "body": "First of all Adam Smith lived in a time when he could not even imagine what free trade on a global market would mean; It rather was trade between some communities or one country, not to mention that there was no huge industry back then. However trade will always be a thing, because one community has more products and resources of a, the other might have more resources and products b and working together always maximizes the general wealth. This has two problems: One side could strive for power, one side could be more developed after a few years... long story short: You need regulation, because othervise it is no fair competition.\n\nHowever you rather describe production, not trade, while gloablization means both and more (at least from my perception). You write that companies will go abroad because it is cheaper to produce there due to lower wages. This might be true, but firstly the production costs are not only wages, but also energy prices, logistical costs, resources and secondly the competition, because in a lower developed country there is no industry yet, so you are extremely powerful and influential, you could even influence the governments. So in a country your investment as a billionair is, even when it is only a little bit, a significant amount of investment relatively, and thus there is a higher possible groth.\n\nThis is only a little part of the relevant problems our world is facing right now; It is not necesarilly because of globalization itself, but how it works right now. The idea of a communal or national economy, that works the same as a global economy is just wrong. I already wrote the reason for this: Right now one side is more developed than the other side and the regulation are not the same, so the competition itself does not work. This is my major critizism of globalization and capitalism. It is not wrong itself, the idea is great, but it only works as long as there is no leader who strives for power, no matter why; May it be nationalism, egoism, neocolonialism, dogmatism or because the person just follows the idea of stability. From that point, where on person acts unfair or perceives that another person acts unfair it will be unfair, so in the end the situation will always be: \"The other person acts immorally, so we have to decide how to answer this\". It will always end in any kind of irrational conflict. Capitalist competitional globalization will never work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Solo-Firm-Attorney",
            "body": "The solution likely lies in strengthening local economic resilience while maintaining global trade benefits. Countries should invest heavily in education and retraining programs, implement stronger anti-trust regulations to prevent corporate consolidation, and establish better social safety nets funded by corporate taxes on outsourcing. Nordic countries have shown this balanced approach can work - they remain globally competitive while protecting workers through active labor market policies and universal basic services. Key is not to abandon globalization entirely, but to manage it through smart policy that ensures its benefits are more evenly distributed. Think less \"build walls\" and more \"build bridges with guardrails.\" Ultimately, we need a new social contract that acknowledges both the inevitability of global trade and the necessity of domestic economic security.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdhesivenessCivil581",
            "body": "The free trade push started in the 1980's 45 years ago. That's long enough to lose two generations of skilled workers who did not pass their lifetime of skills on the the next generation. It's hard to come back from that",
            "score": 1,
            "replies": [
                {
                    "author": "MissingBothCufflinks",
                    "body": "1980s?  Peel rang to ask if the repeal of the Corn Laws is a joke to you?!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MissingBothCufflinks",
            "body": "Free trade / Globalisation worked and works fantastically well for the average global citizen.\n\nIt just sucked for many of the developed economies and their industries and workforce.  It also rendered many geopolitical policy choices taken at a national level moot.   Sure your energy policy is super Green, but you've moved all your energy intensive industry to India which is decidedly not (giving it a massive cost advantage over domestic producers).\n\nBasically free trade and globalisation only makes sense if you are an economist looking at things on a global scale and working out the most efficient allocation of capital.    To achieve any other goal (environmental, workers rights, food security, supply chain resilience) it is a disaster.\n\nAll countries should have strong but fully rational border taxation based on the delta in producer costs from complying with that country's rules, cost of energy, minimum wage etc..   This shouldnt be used in a tit-for-tat or antagonistic way, just to price back in the benefit of foreign companies of not having to comply with domestic regulation and endure domestic economic conditions.   \n\nThat would actually be a more efficient system overall, in technical terms.",
            "score": 1,
            "replies": [
                {
                    "author": "Lauchiger-lachs",
                    "body": "Seems like you view it from the original developed country POV. Globalization only works for a few rich people, and the progress is not necesarilly a result of the globalisation, but rather the natural progress in a country, where high technology meets nothing; Of course the progress will increase traumendously. But using \"the averag\" never works, because \"the average\" will always be the one who pays more than thy get. Normally it works like this:\n\n\\- Rich man with his company sees \"Oh, there is a market, a country with many resources and low industry, so if I invested with only a little I will get A LOT\", so the person starts producing the industrial goods there\n\n\\- Rich man will try to make it more efficient; It already works with low income workers that start to demand more things, this is when other rich men come and satisfy it with their companys. This goes on and on, only a few workers will get more, then try to start their own buisness, most of the times not in the industry, because it is impossible to win against the big companys from abroad, but in another specific place.\n\n\\- The country will gain infrastructure, there are more things to buy, what is nice at first, but the people have to work hard for many hours a day, the environment will fall apart, the resources will be gone one day and the government will be highly dependent on the rich men. There will be only a little elite.\n\nAn example for this is south africa, Chile, some Asian countrys. Some countrys established stong leaders (dictators) while developing, those established protectionism, used the own resources and built their own industry; The government works like the rich men there. You see this in south corea, Japan, China, singapore. You can tell by the suicide rates that even though it might seem highly developed life is not necesarilly better there, that the countrys missed the point where they turn to a social/ socialist welfare economy. So in quantity the numbers might have grown, but the quality is not nearly as good as it could, and most importantly: Globalisation sucessfully created another unsustainable-aristocrat/oligarch-capitalist economy where you have to work full time to be able to pay your rent while you see that other things might screw humanity while you cant do anything about it, because the wealth is not shared fairly and your vote is the only little democratic right.\n\nSo yes, in the end it sucks for the developed country, because they implemented the unsustainable economy that works the same and is a rival to your national economy. Well done. You are incredibly wealthy on the paper, but you wont get anything in real life. But please dont cry about the bad people from abroad that steal your job and wealth, they wont have a good life since they have to work 12 hours a day 6 days, and their kids will have the same problems like you in your developed country, because this was their goal, their capitalist dream. Dont hate the player, hate the system.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spankety-wank",
            "body": "Market liberalisation and globalisation needs to be paired with a safety net for the losers. Once huge inequalities exist, political power can be bought  by oligarchs and it gets locked in. The idea is to redistribute before that happens, it feels like in many places we are right on the edge.",
            "score": 1,
            "replies": []
        }
    ]
}