{
    "title": "[Request] What (if any) regular day items, objects, structures or animals would start floating if this happened today?",
    "author": "GainPotential",
    "subreddit": "theydidthemath",
    "rank": 2,
    "score": 104,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 65,
    "url": "https://i.redd.it/x5xswcji1ape1.jpeg",
    "id": "1je4ed8",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "###General Discussion Thread\n\n---\n\nThis is a [Request] post. If you would like to submit a comment that does not either attempt to answer the question, ask for clarification, or explain why it would be infeasible to answer, you *must* post your comment as a reply to this one. Top level (directly replying to the OP) comments that do not do one of those things will be removed.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/theydidthemath) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "BluetoothXIII",
            "body": "nothing would float suddenly. as floating in any medium is dependent on their relative density the density wouldn't change air density might even decrease.\n\nwaterparks would be a lot mor splashy.",
            "score": 223,
            "replies": [
                {
                    "author": "No-Tension6133",
                    "body": "I’ve never thought of the implications of water parks in lower gravity but it sounds awesome",
                    "score": 56,
                    "replies": [
                        {
                            "author": "BluetoothXIII",
                            "body": "[Moon park](https://www.youtube.com/watch?v=aIIBBj6KR-Y) would be fun",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "BigBlueMan118",
                                    "body": "Very cool, thanks for that!",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PosiedonsSaltyAnus",
                            "body": "https://what-if.xkcd.com/124/\nSwimming on the moon",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "BigBlueMan118",
                                    "body": "Very cool",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "_uwu_moe",
                    "body": "To add to this, almost all the non aquatic life will be wiped out within a few days. Humanity will survive but population will be cut down by a few orders of magnitude.\n\n\"air density might even decrease\" was mentioned casually but it *will* decrease and by a *significant* amount. Various bad things will happen due to that, including but not limited to people not getting enough oxygen when breathing normally and injuries opening up. Worldwide panic, quick construction of pressurisers and pressurized homes, sealed suits mass production for people leaving pressurized rooms, etc. At lucky places that is, where some people who others would listen to understand what's going on in time. Lack of oxygen also lowers one's thinking capacity.\n\nGPS and all satellite stuff will instantly be hit by the change in gravity, whether it is scaled down or made permanently 5m/s² everywhere. The latter would be disastrous as moon will get closer causing tidal forces to increase in magnitude, but that's a much longer timescale compared to life wiping out in a few days\n\nWell, a lot would happen",
                    "score": 14,
                    "replies": [
                        {
                            "author": "GainPotential",
                            "body": "So satellites would be thrown into higher orbits, what would happen with the moon?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "_uwu_moe",
                                    "body": "Your question can be interpreted in multiple ways.\n\nOne: gravity is scaled down such that it's 5m/s² on the surface but still follows the inverse square law.\n\nTwo: gravity becomes constant at 5m/s² radially with earth's COM as the centre.\n\nThe moon part of my reply was meant for interpretation Two. That would increase the gravity at which moon is pulled and thus put it into a strongly skewed elliptic orbit closing in on earth",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Runiat",
                                            "body": ">Two: gravity becomes constant at 5m/s² radially with earth's COM as the centre.\n\n>The moon part of my reply was meant for interpretation Two. That would increase the gravity at which moon is pulled and thus put it into a strongly skewed elliptic orbit closing in on earth\n\nNot elliptic. Elliptic orbits are elliptical *because* gravity increases as you get closer. Constant acceleration would be some kind of weird slightly-curved-star-pattern effect. \n\nAnd also the Moon would be the least of our concerns, as I don't think we'd survive the Sun falling past us.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "_uwu_moe",
                                                    "body": "Oh shit you're right, forgot that. Thanks for pointing it out.\n\nThe fact still stands that the time scale for that is much longer than the immediate issues",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Runiat",
                                                            "body": "I'm not sure it would be. \n\nIt'd take t=sqrt(2d/g)=sqrt( 2×385000000m / 5m/s^2 ) = 3.44 hours to fall 385000km, in which time the Moon would've gone *at least* about an Earth diameter sideways (if angular momentum is conserved it'd go a lot further than that, but I don't feel like calculating how much faster it'd make the Earth spin). \n\nNow, 4000 times higher tides certainly sounds terrifying, but the weird thing about tides is that contrary to popular belief they're only *powered* by the Moon (and Sun) - what *causes* them to reach a certain height is almost entirely resonance. In the spots those resonant waves travel around, tides are almost entirely absent. \n\nIt'd still suck to live near the sea on the side of the Earth the Moon passes by, but it'd be closer to a storm surge than the sort of continent-sweeping tsunami you were probably imagining. \n\nSince the Sun would be swinging by within less than 3 days, I doubt new resonances could build up faster than the oceans would boil off.\n\nEdit to add: let me just repeat that: the Sun would only take about 20 times longer to reach us than the Moon, despite starting almost 400 times further away. Constant acceleration gets *stupid fast* at interplanetary distances.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "OfficialIslu",
                                                                    "body": "Can i genuinely ask why the earth would \"fall\" on the sun?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Runiat",
                                                                            "body": "The Earth is currently falling towards the Sun at an acceleration of ~0.00006m/s^2 (and missing due to going sideways really fast). \n\nThis comment thread is about the (entirely absurd) assumption that Earth's gravitational acceleration would suddenly be 5m/s^2 *everywhere, regardless of distance*. \n\nSo it wouldn't be Earth falling towards the Sun any longer, but rather the Sun falling towards the Earth *much too fast* to keep the distance between them constant. \n\nEdit to add: by the time the Sun passes us by, we'd have moved about 1% of our orbit (a bit less, but this is too absurd to use precise numbers), so roughly 0.0628 AU or 10 million km, putting us 5 times closer to the Sun - giving us 25 times more sunlight - than Mercury.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "VirtualMachine0",
                            "body": "[An AskScience Post on this topic](https://www.reddit.com/r/askscience/comments/o6927z/comment/h2vcr2b/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n50% gravity would at least hold onto the atmosphere, but we'd certainly lose more light gases.\n\nEdit: the below is incorrect. Pressure at the Earth's surface WOULD fall by half, but I'm convinced that the \"pressure loss by altitude\" would also fall off, meaning the atmosphere would stretch out vertically. My mistake is equivocating mass and weight. Derp.\n\nI disagree that pressure would change, though, unless we are allowing change in the volume of the Earth. The amount of atmosphere per surface area would stay close enough to the same that the surface would experience nearly the same \"weight of air above\" as current values. Those lightest gases escaping would lower the pressure a smidge, but considering astronauts do fine at 1/3rd Earth pressure, a <10% change in pressure isn't going to spell doom, and O2 concentrations shouldn't change drastically, as O2 is heavier than N2. I would assume atmospheric mixing might make O2 actually have breathable concentrations at *higher* altitudes, meaning summitting Everest would be a LOT easier (but probably still quite hard!).",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Feuerroesti",
                                    "body": "50% gravity means 50% less pressure. The formula for hydrostatic pressure is rho×g×h",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Feuerroesti",
                                            "body": "I just remembered that this is only accurate for non compressable fluids, but still I think compression effects would not cancel out the gravity decrease, so it would still be roughtly 50% less pressure",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "VirtualMachine0",
                                                    "body": "EDIT: leaving this up for my mistake; my logic here is circular. I assumed that p=p₀ below. Changing that exponential g in the equations just means that the falloff of pressure is going to be gentler with altitude than in a higher g scenario. AKA air will be fluffier.  \n  \nI'm trying to think of what assumptions that pressure equation has that aren't working out....because ultimately, pressure is \"the weight of everything above divided by the area it's affecting,\" and if you've got 98% of the atmosphere, you'd have 98% of the weight, and that paper convinces me we aren't losing half the atmosphere.\n\nWhat occurs to me is that I think the pressure formula is assuming uniform gravity, rather than radial gravity, so rather than a cylinder of gas above the test area, we would be looking at a spherical section, which gets larger at the top than a cylinder, permitting more weight than a cylinder does.\n\n(Off to Wikipedia)\n\n[https://en.wikipedia.org/wiki/Density\\_of\\_air#Variation\\_with\\_altitude](https://en.wikipedia.org/wiki/Density_of_air#Variation_with_altitude)\n\nis what we want to read. It looks like the pressure at altitude equation breaks when h=0, as it simplifies to p=p₀\\*1\\^(g\\*C) and becomes invariant with g. (C just being a set of constants lumped together).\n\nThe air density equation does a similar thing; it simplifies to being the exact same at altitude 0 regardless of how you change g.\n\nWhat is hard for me to really comprehend well is how the vertical mass distribution changes. My intuition suggests that, like a relaxed spring, the atmosphere will be able to ascend to higher levels. But, since pressure and density are related to temperature, and the temperature gradient between space and the Earth would decrease with a wider buffer between the surface and space, I would expect pressure and density to change less drastically as the atmosphere relaxed...making it less responsive on the whole to the loss of thermal conductivity between dense and less dense shells of air, and suggesting to me that it would relax even further than my 1st order guess would suggest.\n\nBut, I'm leery, this is coming from someone with 3 years of collegiate physics, I'm not an atmospheric physics expert, so I'm not sure which \"constants\" are real and which ones are \"observed constants of convenience\" to simplify the real system into a linear approximation and allow for better predictability.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Runiat",
                                    "body": ">The amount of atmosphere per surface area would stay close enough to the same that the surface would experience nearly the same \"weight of air above\" as current values.\n\nThe weight of a given mass is that mass times acceleration. \n\nHalf the acceleration of the same mass means half the weight.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "VirtualMachine0",
                                            "body": "Oh hell. Well, that's embarrassing. So, pressure would be halved, roughly.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bear-Necessities-",
            "body": "Here's another question. How would engineering design change and how much higher could we build, using current materials with half earth's current gravity",
            "score": 30,
            "replies": [
                {
                    "author": "GainPotential",
                    "body": "And how would it affect the structural integrity of concrete?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "4x4_LUMENS",
                            "body": "It would increase the integrity, everything would be technically stronger by virtue of having less force applied to it. But then things that are supported by guy wires and cantilever structures might fail as the tension forces exceed what is needed to hold things in place and could potentially lift and buckle things like bridges.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "KingZarkon",
                                    "body": "Why would things supported by guy wires and cantilever structures fail? What would cause the tension forces to increase? Shouldn't they decrease since gravity is less and they're effectively supporting less weight?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Runiat",
                                            "body": "There might be a bit of a bounce when the gravity first drops, but yeah, I don't see why this would cause anything to fail (or be exclusive to tension).",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GainPotential",
                                    "body": "But isn't concrete strengthened by having a force push down on it?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "4x4_LUMENS",
                                            "body": "No. Maybe you're confusing the fact it has more compression strength vs tensile strength?",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Butterpye",
                    "body": "Well the biggest change besides \"buildings would be cheaper because we can use thinner steel beams\" would be that a space elevator is now suddenly a much more attractive option. We wouldn't need carbon nanotubes, we could build it out of more conventional materials. Not sure if something like Kevlar or Zylon is strong enough, but it would definitely be close.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "VirtualMachine0",
            "body": "So, the Earth suddenly drops 48% of its mass into another dimension while holding onto its size. Bam, the average density of the planet is now 2.8 g/cc and yeah, a lot is going to change. Here's some notable things that occur to me for this scenario:\n\nAll orbital radii for everything orbiting the Earth must double, so the moon will transition to a radius twice as far away...but it has a lot of inertia, and that change doesn't come instantly unless the magic moment says so, so the moon ends up in a new, very elliptical orbit that *averages* to twice the radius, but is going to ascend higher and then dip back down to 1 lunar orbit radius on a monthly cycle.\n\nThis, plus the reduced forces holding the ocean in place might make the tides go crazy low, relaxing more than they currently do. I think *high tide* would be similar, though, when the moon reaches perigee.\n\nFinely balanced human structures could rupture as tension forces suddenly aren't in equilibrium with weight, BUT I think big bridges would often survive, as they have a safety factor high enough to handle halving their weight.\n\nA lot of buildings that are barely holding together would suddenly be safe for dwelling again.\n\nNew construction would be cheaper, requiring less material, less energy to transport material.\n\nSome earthquakes would occur as rock rebounds near mountain ranges, glacial sheets, the Amazon River and other large \"heavy things pressing down\" on continental crust.\n\nEDIT: MORE earthquakes would appear as the entire Earth rings like a steel gong, having a [similar bulk modulus to steel](https://scholarworks.uni.edu/cgi/viewcontent.cgi?article=6080&context=pias) releasing something like 10¹⁷ Joules of energy as a very loose ballpark...but spread over every square meter of earth, I don't think this contributes much to structural collapse. It would, however, create a sound that would rumble around for something like a week.\n\nGetting to space would be 75% cheaper per unit mass, except for all the new crazy elliptical orbits of our satellites causing years of recalculating safe orbital spaces (and that would be expensive to do).\n\nSpeed limits for automobiles would need to be lowered, as weight is linked to traction; you would be in a tough spot going around corners and skidding, because your tires are suddenly only half as \"sticky\" as they were.\n\nWhen you walk, you'd have to lean farther forward.\n\nAir travel would be cheaper, the current airplanes would fly just fine, but electric aircraft would soon replace them, as range would increase quite nicely (weight is correlated with drag, so lowered weight means lowered drag means energy goes further).\n\nHuman health \\*could\\* improve, but our hearts are calibrated quite closely to 9.8 m/s/s. The offset in heaviness could help the obese, but heart arrythmia could escalate in folks in lower BMI ranges.  We could see a lot more Radon in the lower atmosphere, as it would have an easier time getting jostled higher into the air.  Climate change would be pretty substantial, too, as while the atmosphere stretches vertically, a lot of that density change would cause the atmosphere to suck up more water vapor, which is a greenhouse gas. We'd have bigger storms, more vigorous thermal mixing, while at the same time probably growing the ice caps.\n\nDepending on what you did with the Earth's core, our magnetic field and thus radiation belts would change, and thus harmful radiation from the Sun probably goes up.\n\nEarth's gravitationally affected asteroids would fall toward the Sun, which *sounds* nice, but would mean they pick up speed and enter more of an elliptical orbit, so you might actually see more potential asteroid collisions due to an increased rate of crossing Earth's orbit. I doubt this effect would be huge, but certainly, we'd have to run all asteroid calculations again to reassess the new risks.\n\nSo...it's not all positive, but there are a lot of \"maybe not so bad\" outcomes.",
            "score": 6,
            "replies": [
                {
                    "author": "VirtualMachine0",
                    "body": "Oh, another climactic change: the gravitational pull of the Earth on the Sun would halve, and that would make the Sun develop, similar to the moon, an Earth-respective oscillation, and that in turn would induce an orbital oscillation for the Earth. Solar energy would average the same but become more variable. Since the Sun is 330,000 times more massive than the Earth, and the current Sun-Earth perturbation period is roughly 6 months, Earth's orbital radius might vary by by .0003% (up to a ±0.06% radiation change) and the frequency would roughly double, as our initial change put us roughly 1/4 further around our orbit in effect.\n\nFunny enough, this ought to be about the same size of an effect as the current Milankovitch cycles. That could potentially drastically reduce them, or roughly double the frequency, and it's impossible to know without more information.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Runiat",
                    "body": ">This, plus the reduced forces holding the ocean in place might make the tides go crazy low, relaxing more than they currently do. I think *high tide* would be similar, though, when the moon reaches perigee.\n\nYou seem to be making some incorrect assumptions about how tides work: \n\nFirst off, they're caused by the Earth. Sure, how we interact with the Moon and Sun is involved, but the reason most places get two tidal cycles a day rather than two a month (or year) is because it's the Earth's rotation that swishes them around, so to speak. \n\nSecond, both high and low tides are extremes, with mean sea level being what pushing the Moon further away would result in. \n\nThird, the Sun is also involved. Right now, the Sun's influence on tides is about half that of the Moon (or less roughly, it's a 69/31 split). If the Moon entirely disappeared, we'd still get the 31% tides caused by the Sun - which is barely any less than the neap tides we get when the Sun's tides destructively interfere with the Moon's tides. \n\nFourth, depending on exactly where the Moon's perigee ended up, it might end up either cancelling out or reinforcing the tides caused by the Sun in the same way the Sun currently (partly) cancels out or reinforces the Moon's tides. \n\n>Getting to space would be 75% cheaper per unit mass, except for all the new crazy elliptical orbits of our satellites causing years of recalculating safe orbital spaces (and that would be expensive to do).\n\nThat, and space would be twice as far away. \n\nThat is, unless you also remove 48% of the atmosphere's mass, in which case we'd all die of hypoxia making the rest of your comment rather irrelevant. Or reduce the average temperature of the atmosphere to 130 kelvin, in which case we'd all die of hypothermia, making the rest of your comment rather irrelevant. \n\n>the current airplanes would fly just fine,\n\nWhile technically true, they'd no longer be able to take off from or land at most airports until we lengthened the runways by a lot. \n\n>Earth's gravitationally affected asteroids would fall toward the Sun,\n\nI have no idea where this idea comes from. Could you explain further?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "VirtualMachine0",
                            "body": "So, good points on my oversights, I geeked out and didn't dive as deeply as I might have on the tides! Also a great point on decreased lift and thrust at takeoff for airplanes.\n\nAs for the asteroids, I was thinking about first, asteroids at the Earth-Sun LaGrangian points. The Earth's gravity is responsible for how \"flat\" that part of space is, gravitationally speaking, and if you suddenly drop the Earth's mass by 48%, it's akin to one side of a tug-of-war letting go. When that happens the body will accelerate sunward, gain speed, and thus increase its eccentricity. This will be enough to get it away from L4 and L5, and cause it to become an Earth-Crossing asteroid.\n\nI realized after that that this effect would really affect all of Earth's quasi-satellites, so they are all going to gain some speed and eccentricity, and the new gravitational equilibrium will try to reset them (a bit) and offer some gravitational friction, aka \"acceleration toward the Earth.\"\n\nAs to the timescale of this sort of thing, I'd have to defer to the astrophysicists.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Significant_Fail_984",
            "body": "Nothing would float ... If you have read anything about bouyant force and pressure you would know.. that the floating of an object is irrelevant of gravity",
            "score": 22,
            "replies": [
                {
                    "author": "MuckRaker83",
                    "body": "#YOU MUST CONSTRUCT ADDITIONAL PYLONS",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Bright-Historian-216",
                    "body": "Fa = pgV  \nF = mg  \n\nfloating: pgV > mg  \nthus pV > m; does not depend on g  \n\ni tried to comment \"well how does it not depend if the g is right in the formula?\" and i completely forgot about weight",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Significant_Fail_984",
                            "body": "Haha yeah.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "migukau",
                    "body": "Holy fucking reddit comment. Go outside and talk to people. Get off the internet for a while.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Significant_Fail_984",
                            "body": "I knew it ... Someone dumb would surely be here",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GainPotential",
                    "body": "Yeah, I get it. I think I was thinking more like if you jumped would you die of the impact, or would helium balloons start lifting people up into the air, or would concrete structures start to crumble since less gravity is applied on them etc. Thanks for the info though :)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DarkArcher__",
                            "body": "The only thing that changes is that everything weighs about half of what it did before. Every object still has *some* weight, and the relative weights between objects remain the same, so anything related to buoancy does not change. Helium balloons wont lift people, and nothing that doesn't already float will start floating.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "GainPotential",
                                    "body": "Would it be correct to assume you jump twice the height? Also, *would* concrete structures crumble or not? Edit: And more importantly, would jumping this new height be lethal?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "mooremo",
                                            "body": "If gravity were cut in half, you could jump higher because gravity is what pulls you back down. With less gravity, there’s less force pulling on you, so the same amount of effort in your legs would launch you much higher than before. However, even though you’d fall from a greater height, you wouldn’t hit the ground as hard. Since the impact depends on how fast you're moving when you land, and gravity determines how fast you accelerate while falling. So you’d jump higher, but you wouldn’t be in more danger when you came back down.\n\nIt's also easy to think about as simple conservation of energy. You impart a certain amount of kinetic energy to your body when you jump. At the top of your jump, regardless of what gravity is and how high you actually go, all of that kinetic energy is now gravitational potential energy (ignoring losses to air resistance). On the way back down, all of that energy becomes kinetic energy again (ignoring losses to air resistance). The amount of energy is the same in both scenarios irrespective of gravity.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Significant_Fail_984",
                                            "body": "Yes you would be able to jump higher but won't be able to run as fast or most people won't be able to walk properly as half the weight means half the friction and half the force you can apply to the ground and guns will give you double recoil most cars would skid and many things. Just thing of half the friction",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Conscious-Ball8373",
                                            "body": "Yes.  When you jump, you achieve a particular velocity just as you leave the ground and then you accelerate downwards due to gravity.  The first bit of this acceleration is you slowing down as you rise, the second bit is speeding up as you fall but it is all just constant acceleration downwards.\n\nSuppose you achieve a velocity `v`, we can calculate how long you spend going up before gravity overcomes your initial velocity and you start to fall again, and how high you rise in that time.\n\nAt a given value of `g` (the acceleration due to gravity) you will travel up for `t = v / g`.  So halving `g` will double the **time** that you rise for.\n\nThe distance you travel in that time is s = v * t - 0.5 * g * t^2`.  Substituting in t = v / g you get s = v^2 / g - 0.5 * g * v^2 / g^2 = v^2 / g - 0.5 * v^2 / g = 0.5 * v ^ 2 / g.\n\nThe distance you travel is inversely proportional to `g`.  If you halve `g`, you will jump twice as high.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DarkArcher__",
                                            "body": "It's impossible for you to jump high enough to hurt yourself (on level ground, assuming you land on your feet), regardless of the gravity, because the velocity with which you leave the ground is the same as the velocity with which you impact it again on the way down. That is, the force you put into the jump is the same force you have to put to brace yourself on landing, just in the opposite direction.\n\nWhen you consider that we can land safely from significantly higher heights than we can jump to, you see why you could never hurt yourself jumping, unless you didn't land correctly.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WanderingFlumph",
                            "body": "Well without doing any math the moon's gravity is 1/6 and the astronauts didn't die from jumping on the moon. Unlikely that 1/2 gravity would",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tuckkeys",
            "body": "My question with this is how much weaker would humans be? Our muscles would never have developed as much so using the same materials we use now may be significantly more difficult, right?\n\nEdit: I’m a dummy, all those things would be lighter as well, I’m gonna think before commenting next time I promise",
            "score": 2,
            "replies": [
                {
                    "author": "SuperBatzen",
                    "body": "Also, beeing weaker ist really an issue. Suppose we all evolved on a planet with more or less gravity then earths, our bodies would still be made for that enviroment. (Maybe on planets with far more gravity we would evolve to be 6-limbed, 2 arms make sense but having to additional legs would make the job of carrieng the body easier)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "tuckkeys",
                            "body": "Yeah that’s exactly my original point but then I was like, even though we’d have less muscle mass given the environment we evolved in, all the materials like stone or whatever that are heavy that I was referring to would be lighter so our bodies would likely be able to handle it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RandomAssPhilosopher",
                    "body": "idk about being weak but we would be slightly taller on average",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blahblurbblub",
            "body": "It would be a lot harder to breathe and you would probably pass out and die from hypoxia. The moon a would exit its orbit, the oceans would go nearly flat. Airplanes would likely fall out the sky. But hey, you could jump twice as high before you pass out.",
            "score": 3,
            "replies": []
        },
        {
            "author": "carlfox1983",
            "body": "I would worry that the answer would be, our atmosphere. Smaller planets don't have the atmospheric density. Reducing gravity would lead towards our deaths.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Long-Rub-2841",
            "body": "As others have highlighted things would not randomly float.\n\nAssuming this change to ‘g’ is caused by change in big ‘G’, things on earth at least would be totalled f*cked, including:\n- A sun that is 8 times dinner, leading to -100 degree average temperatures.\n- An surface level air pressure that is half its current amount (would be similar to trying to live on the tallest mountain currently)\n- The elemental composition of the earth would be completely different, might struggle to get the building blocks of live\n\nThings would certainly not be a utopia!",
            "score": 1,
            "replies": []
        },
        {
            "author": "T555s",
            "body": "Nothing. The density of objects relative to each other wouldn't change. Planes and rockets would be way easier to build though. Asuming we don't die because our atmosphere flies of into space making us all sufficate while meteors and radiation kill those with oxygen masks.",
            "score": 1,
            "replies": []
        }
    ]
}