{
    "title": "Annual Survey Results 2024",
    "author": "PassionateAsSin",
    "subreddit": "TaylorSwift",
    "rank": 0,
    "score": 1194,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 149,
    "url": "https://www.reddit.com/gallery/1ix3fo8",
    "id": "1ix3fo8",
    "selftext": "",
    "comments": [
        {
            "author": "PassionateAsSin",
            "body": "After eliminating some obvious trolls, we had 3,692 responses to this year's survey. This survey will be added to our wiki page, in the sidebar, and at the top of the subreddit.\n\nOpen the images in a new tab for the best viewing experience!\n\n**A few notable items:**\n\n* Our average age increased to 29 this year. We have been steadily increasing over the last few years.\n* We have two new entries into our Top 10 songs, cowboy like me and exile, both of which were just outside the Top 10 in 2023. Cruel Summer and Champagne Problems dropped out of the Top 10 this year\n* The top songs on TTPD have shuffled around quite a bit from the original TTPD survey, however the bottom songs remained pretty consistent.\n\n**One question missing from the graphics is tour outfits/costumes, so I'll provide you some info here!**\n\n* Eras themed outfits were the most common to wear to the Eras Tour. Lover, reputation, evermore, Midnights, and TTPD were the most popular eras.\n* Many people also wore costumes based on past tours or Eras Tour costumes. The most popular were the Red T-shirts, Lover Bodysuits, Midnights Bodysuits, and 1989 Tour outfits!\n* Some of the most unique outfits: A traffic light, The Black Dog, The Catnip Bottle from Cats, Lime Green Dog, and a Kimono painted for all the eras\n\n**For everyone who wanted the albums in a stacked bar chart -**  \n*(I also don't like the Taylor's Versions broken out)*\n\nhttps://preview.redd.it/2isofbakp7le1.png?width=1250&format=png&auto=webp&s=cbef062156ddcb694afe001baaf90b35a9dbd5ef\n\nLet us know your thoughts!",
            "score": 1,
            "replies": [
                {
                    "author": "bubblecuffer13",
                    "body": "Thank you for putting all this together! Y'all are the best! ![img](emote|t5_2rlwe|1072)",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "disinfected",
                    "body": "Absolutely love all this delicious data. Thank you so much for all the hard work!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "m4llycat",
            "body": "I couldn't get tickets to the eras tour, but I hope someday, somehow, I'll be able to see the reputation set live. I'd kill for that experience!",
            "score": 50,
            "replies": [
                {
                    "author": "Retrograde-Planet",
                    "body": "Manifesting tickets for you ✨",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "costryme",
            "body": "80% women responding to the survey feels crazy, I remember when it was 80% men back in like 2014 (it was also only like 10K members though lol).",
            "score": 137,
            "replies": [
                {
                    "author": "Alternatively_Listed",
                    "body": "Definitely more about how Reddit demographics have changed than Taylor Swift fan demographics ",
                    "score": 183,
                    "replies": [
                        {
                            "author": "costryme",
                            "body": "Yeah, Reddit went more mainstream which meant that female fans also found this sub (I'm sure plenty ended up discovering Reddit through the sub, considering how big it is now).  \n\nNgl I do kind of miss the chill vibes of this sub back then though, when subs get big, you lose a lot of the community aspect.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "mermaidthebanshee",
                                    "body": "I had used reddit maybe 1 time before finding this sub, now I use it every day, haha. I was shocked to find out I had an account already.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "tsabin_naberrie",
                            "body": "Also a reflection of moderation changes. When the sub was largely men, it was also… more of a pictures subreddit than a discussion subreddit, so you can guess why men were flocking here. The population shifted when the subreddit became less ogling Taylor and more about enjoying her actual artistry.",
                            "score": 63,
                            "replies": [
                                {
                                    "author": "costryme",
                                    "body": "There was definitely more pictures, that said I do not remember it being a massive issue then (it basically added some discussion whenever there was a lull and I don't remember being it crass or anything - I remember a lot of actual music discussion).\n\nAnd honestly I think the population shifted more because on the evolution of Reddit - it was basically unknown back then, especially outside the US compared to FB/Twitter/Tumblr/IG. I think Reddit itself used to be 80/20, whereas now it's like 60/40 or even 55/45.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "MatchesLit",
                                            "body": "Looked into it: it's 64/35 (via https://explodingtopics.com/blog/reddit-users). I assume the missing 1% is non-binary and/or unknown. It doesn't really feel like it on the Taylor sub, but the male majority is obvious when I go to other subs lol.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "IhateTaylorSwift13",
                                            "body": "I used to lurk here on this subreddit like a year or so before the Midnights Migration. I vaguely remember people here being shocked that 40-50% of us swifties at this sub at that time are men. I don't know if I am remembering that correctly, so take that with a grain of salt.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rozsunbeam",
                    "body": "As someone came from Tumblr (miss the time Taylor lurking there) few years ago, this sub is a safe place on the internet tbh",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "IconXR",
                    "body": "This has been a thing since 2014??",
                    "score": 3,
                    "replies": [
                        {
                            "author": "costryme",
                            "body": "The survey ? Yes !",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "IconXR",
                                    "body": "That's impressive",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "BallerinasGrace",
                                    "body": "Do you have the link for the first survey?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "costryme",
                                            "body": "Yup, the 2014 survey results are here : https://docs.google.com/forms/d/19Re3D33lPhhbevqk2LlJDko5JDZnURNMn0SQngbxgvY/viewanalytics \n\nAnd here you have 2018 and the link to the 2015, 2016 and 2017 results at the bottom of the post : https://www.reddit.com/r/TaylorSwift/comments/7rn14v/2018_rtaylorswift_survey_results/",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "BallerinasGrace",
                                                    "body": "Thank you. I see 2018 was when it shifted to majority female.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "costryme",
                                                            "body": "Yep, big shift between 2017 and 2018 ! I'm guessing it had to do with Rep.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cultural-Party1876",
            "body": "It warms my heart seeing everyone’s favorite era performance set by far was Reputation!!",
            "score": 195,
            "replies": [
                {
                    "author": "Impossible-Hawk709",
                    "body": "When the snake hissed majority of the people in the arena went crazy, and also WHEN IS REP TV TAYLOR??!! (jk take your time Taylor ily)",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "lizziexo",
                    "body": "Right! Production wise the sets for TTPD are my total fave, but nothing tops the electricity for the rep set 😭",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "tsabin_naberrie",
            "body": "I’m curious about the “favorite album” separating OG from TV as separate entries, and how different the data would look if they were combined. Like, nearly 10% said some version of *1989*, which makes it competitive with TTPD, but looking at the way the data is split, it makes it seem as though the former pales to the latter.\n\nIt is also interesting how, for her first several albums, it’s a pretty low percentage even when you combine the original and rerelease. For all but *1989*, it’d still be between 2% and 7%. Only *1989* would be competitive with her more recent releases, and it is still sizably losing to *reputation*, *folklore*, and *evermore*. I’m wondering if that’s just a vague bias toward listening to more recent work and disinterest in earlier material, or if it’s, like, genuinely her newer stuff is better when paired against her earlier work.\n\n(Yes, I am speaking as someone who’s #1 has been *Speak Now* for a decade.)",
            "score": 86,
            "replies": [
                {
                    "author": "PlatinumTheHitgirl",
                    "body": "As someone who's #1 has been Red for over a decade, this stuck out to me too. I thought that perhaps it was mostly newer fans responding, but the majority of the responders became fans before Lover. For Midnights and TTPD it's likely recency bias. What surprised me was Rep. I knew it was a popular album, but I wonder if it maybe got so many votes because of the anticipation for RepTV's release? The survey demographic skews younger and many of the responders are international, so that could also explain why her older country sound might not be as popular.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "tsabin_naberrie",
                            "body": "> the majority of responders became fans before Lover\n\nYeah, that section honestly shatters some illusions for me. This is definitely a survey of the *subreddit community* and can’t be totally extrapolated to reflect the fandom at large, but I would’ve assumed that the post-*Lover* albums would have drawn in a lot more people—I’m not surprised *Midnights* has such a large chunk, but I thought *folklore* and the first wave of TVs had a bigger impact as well. It’s shocking to see the largest slice be fans from Debut, at fully a fifth of respondents.",
                            "score": 27,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "april5115",
                    "body": "justice for my baby girl 1989",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "SgtPopNFresh_",
            "body": "19 DEBUT STANS RISE UP",
            "score": 41,
            "replies": [
                {
                    "author": "debut_army_general54",
                    "body": "It’s nice to know that there are at least 18 others like me! 😊💚🦋",
                    "score": 5,
                    "replies": [
                        {
                            "author": "SgtPopNFresh_",
                            "body": "I’m fighting for my life out here",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "afterlevi",
            "body": "COWBOY LIKE ME STANS RISE",
            "score": 40,
            "replies": [
                {
                    "author": "PixelPixell",
                    "body": "I KNOW RIGHT. I had no idea there were so many of us!!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "lizziexo",
                    "body": "🤜🤛 yeehaw 🤠",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PlatinumTheHitgirl",
            "body": "Chloe or Sam, I look in people's windows, imgonnagetyouback so low.... some of you deserve prison but you won't get time 😔",
            "score": 374,
            "replies": [
                {
                    "author": "svenson_26",
                    "body": "It's criminal that Cassandra was ranked so low.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "dreaming_in_yellow",
                            "body": "I’m embarrassed that I used to skip it. 🫣",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "toritxtornado",
                    "body": "the tortured poets department being so low is personally offending me",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Born___Pink",
                    "body": "Chloe et al is criminally underrated! It's so good, one of my faves on the whole album",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "jordy_d04",
                    "body": "Fr these are my fav songs on ttpd",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "mermaidthebanshee",
                    "body": "Seriously. Chloe et al is on my \"speed dial\" menu on YT music haha",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Infinite_Warning9457",
                    "body": "the thank you aimee slander is insane",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "luvufor10000years",
                    "body": "exactly my thoughts... like HOW",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "insidetheold",
            "body": "I think it would make more sense if the original albums and their taylor’s versions were combined in the favourite album chart, as I was initially surprised at the results then realized why. Maybe that’s just me though. It’s cool to see the stats and what people here think.",
            "score": 78,
            "replies": [
                {
                    "author": "PassionateAsSin",
                    "body": "I gotchu\n\nhttps://preview.redd.it/l889ox9op7le1.png?width=1250&format=png&auto=webp&s=118e2fe0de6e00bdb0c5573cbe51d9c31fca77d5",
                    "score": 12,
                    "replies": [
                        {
                            "author": "insidetheold",
                            "body": "Thank you!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "tsabin_naberrie",
                            "body": "Oooh, glad I returned to this thread and saw this: a lot easier to visualize the perspectives this way.\n\nInteresting how, for pretty much all of the albums with re-releases, they are *roughly* even between those who preferred the original and those who preferred the TV. Curious how that happens.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ichthyos",
                    "body": "yeah, can have stacked bars for original vs TV",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "ArgumentBored",
                    "body": "Agree",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "UnhingedBeluga",
                    "body": "Yeah, I was shocked 1989 was so low but it was divided between the two versions",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "emmyemmusic",
            "body": "So Long London getting her flowers!! We love to see it ❤️‍🩹",
            "score": 28,
            "replies": []
        },
        {
            "author": "anneofavonleaa",
            "body": "These graphics are so well made!! Nice job!",
            "score": 43,
            "replies": []
        },
        {
            "author": "nessa_gigglebox",
            "body": "I’m sad that you all dislike “I can fix him, no really I can” it’s such an underrated bop. That last line hits my funny bone! It’s sooooo good! I hope one day it’ll get its moment to shine",
            "score": 123,
            "replies": [
                {
                    "author": "romanticheart",
                    "body": "I agree!! It’s probably in my top ten on TTPD. I’m honestly surprised so many people don’t like it. Y’all have really never tried to fix a “bad boy” and relate to this song at all??",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Future_Pin_403",
                            "body": "Can’t say I relate to it at all lol. It’s not my least favorite though",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CollectingAThings",
                    "body": "I was so surprised to see it being that much disliked. I love this song so much. The background sounds scratch my brain in the most pleasant way. It’s like the score to a cowboy movie. It sounds so different and yet so familiar",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "Mountain_Band_2732",
                    "body": "Really. I have no idea how someone can place it last. I fucking love that song.\n\n(But then again, I have some takes I would be burned alive for so I understand.)",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "svenson_26",
                    "body": "For me, it was a great song. Very powerful.  \nBut it doesn't have a whole lot of relistenability.  I feel like if you've heard it a few times, then you've got everything you're going to get from it.  \n \nThat's just me though.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "alternativeedge7",
                    "body": "As a lover of both, someday we all need to have a chat about how this is the case when Cowboy Like Me (rightfully, IMO) made the Top 10 all time list. They’re so sonically and vocally similar!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "sashayaweey",
                    "body": "I’m obsessed with this song, it’s one of my very few NEVER skips! Her low register just does it for me ugh. It’s so sultry",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "rabbit014",
                    "body": "This is one of my favorite songs on the album. My brain cannot compute how it is so unliked.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "EightyHM",
                    "body": "Some of my favorite songs are in the top of the least favorites for both albums 😅",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "misscami",
                    "body": "same, it’s my absolute favorite from ttpd!!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "gaarali",
            "body": "People picking cowboy like me and ivy as their favorites gagged me, I'm so proud of us the evermore stans😭🤎",
            "score": 18,
            "replies": []
        },
        {
            "author": "distant_diamond_sky",
            "body": "Love seeing this data, but seriously cannot fathom why people don't like Fresh Out the Slammer. It was my top song last year. The delivery of the verses are *chefs kiss*",
            "score": 52,
            "replies": [
                {
                    "author": "Future_Pin_403",
                    "body": "The outro takes me out of it honestly",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "sarahelizaf",
                    "body": "The switch-up at the end brings it significantly down for me, unfortunately.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "aimformyheart",
                    "body": "It has constantly been in my top 5 most listened to songs each month since it came out (except for April '24) and most of those months, it has been my #1 😫",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Quick-Time",
            "body": "I love seeing that So Long London ended up ranking #1 on TTPD ❤️ My favourite from the album, and one of my favourites ever. It’s shaping up to become my #1 song of her’s.",
            "score": 16,
            "replies": [
                {
                    "author": "-Silver-Moonlight-",
                    "body": "It's such a good song! It's one of my faves as well.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "songacronymbot",
                    "body": "- TTPD could mean \"The Tortured Poets Department\", a track from *THE TORTURED POETS DEPARTMENT* (2024) by Taylor Swift.\n\n---\n\n^[/u/Quick-Time](/u/Quick-Time) ^(can reply with \"delete\" to remove comment. |) ^[/r/songacronymbot](/r/songacronymbot) ^(for feedback.)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "podsavepundit",
            "body": "Thank you for putting in all the work to do this survey and share the results!! This is so interesting.",
            "score": 12,
            "replies": []
        },
        {
            "author": "falldiewakefly",
            "body": "I Can Fix Him (No Really I Can) getting done dirty smh y'all just don't appreciate gunslinger country and tongue in cheek humor\n\nHot take but thanK you aIMee is underappreciated, too. Yes, it's petty. Sometimes you gotta be petty. (I've had my high school bullies who drove me to a breakdown try to act like we were all pals and it was just a little light-hearted teasing between friends years ago hahaha and you know what fuck you Aimee)\n\nGlad to see So Long London getting her flowers, she deserves",
            "score": 27,
            "replies": []
        },
        {
            "author": "teeraph32",
            "body": "Justice for Peter",
            "score": 20,
            "replies": []
        },
        {
            "author": "macdgman",
            "body": "Wtf is wrong with all of you disliking robin and I can fix him???",
            "score": 8,
            "replies": []
        },
        {
            "author": "Hufflepuff_PC",
            "body": "thanK you aImee coming so low is ruining my life",
            "score": 29,
            "replies": [
                {
                    "author": "PixelPixell",
                    "body": "It's a great anti-bullying song but the explicit callout to Kim in the title is a bit over the top. Taylor isn't the underdog anymore. I understand it's hard to move on but she doesn't have to keep throwing punches publicly.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Hufflepuff_PC",
                    "body": "u/IPixelPixell understand but Kim was worse and she deserves it.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "svenson_26",
                    "body": "Yeah, I really wanted that song to become a big radio hit.  It would have been so funny.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "amantae",
                    "body": "Hahah yes the slander 🫠",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "yuripa87",
            "body": "I feel like The Alchemy is going to be one of those songs that people look back on and realize they were sleeping on it.",
            "score": 8,
            "replies": []
        },
        {
            "author": "iguessda",
            "body": "Fresh out the slammer is one of my favorites!",
            "score": 24,
            "replies": []
        },
        {
            "author": "Myrtle_is_hungry",
            "body": "Im never feeling unique again when I say evermore is my nr 1 album again. You know what??? Yall fake af. Where were all you evermore stans in 2020????? \n\n>!jk!<",
            "score": 8,
            "replies": [
                {
                    "author": "MatchesLit",
                    "body": "Drowned out by the folklore (read: overrated album) fans.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "aboatoutontheocean",
            "body": "Honestly I’m shocked that 10% of this sub hasn’t watched the Eras Tour movie! What are you waiting for?!",
            "score": 8,
            "replies": [
                {
                    "author": "-Silver-Moonlight-",
                    "body": "Personally, enough time to pass. I wanted to see the tour live first and save the movie for later. But it really hit me emotionally when my Vienna show was canceled.\n\n\nI couldn't even interact with anything tour related for some time. It was only reminding me of what I wasn't able to experience and it made me sad. I'm  better now but I still don't feel ready to watch the movie. I feel like it would still make me think of everything that could have been.\n\n\nI will watch it eventually, but I don't think the right time has come yet.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "elaineberaldo",
                    "body": "Honestly, I'm still so sad that I didn't get tickets to The Eras Tour, that I can't watch",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shadesofwrong13",
            "body": "If she did not capitalize the title of Thank You Aimee, it would have been more appreciated. ",
            "score": 33,
            "replies": []
        },
        {
            "author": "CheesyDelphoxThe2nd",
            "body": "justice for i can fix him",
            "score": 14,
            "replies": []
        },
        {
            "author": "LL7272",
            "body": "In the region breakdown, is Latin America the same as South America?",
            "score": 5,
            "replies": []
        },
        {
            "author": "ChrisAqua",
            "body": "It’s crazy that the majority of the people who took this quiz were fans since debut",
            "score": 5,
            "replies": [
                {
                    "author": "Sym-Mercy",
                    "body": "The easy solution to that crazy statistic is that people are lying about that. I see it so often on Twitter too. 20-25 year olds saying they’ve been Swifties since 2006. \n\nI just put it down to people wanting to feel like an OG given the fact she is the most famous person in the world and Swifties are the largest fandom.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Clean_Lettuce9321",
            "body": "I just want to say thank you for all this amazing work. I don't know what you are in real life, but I'm pretty sure you're running a small country somewhere.",
            "score": 5,
            "replies": []
        },
        {
            "author": "MatchesLit",
            "body": "I think the Prophecy is so overrated and this confirms my suspicions. How is ranked higher than How Did It End, loml, and even Down Bad? Mind boggling. My favorites are at the bottom so maybe it's just me lol",
            "score": 4,
            "replies": [
                {
                    "author": "elaineberaldo",
                    "body": "Because it's super relatable",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SuperHoneyBunny",
            "body": "Noooo…how did the title song of TTPD rank so low?!?! It’s a banger and one of my faves off the album. I always have to crank up the volume for that one!\n\n*cries as a TTPD title track stan*",
            "score": 10,
            "replies": []
        },
        {
            "author": "takethemoment13",
            "body": "Thank you mods for all your work on this! Could you guys create charts of how some of these annual answers have changed over time, particularly age and gender?",
            "score": 4,
            "replies": []
        },
        {
            "author": "heliandin",
            "body": "Chloe and I look in people's windows being so low was really surprising to me. I also love Robin and I was sad to see it low but I was expecting it.\n\nthe difference between the albums that have a Taylor's Version splits the votes and I don't think it's a gap that's \"solvable\", especially going forward to albums that won't have a TV.\n\nthe data surrounding the era in which the members became fans was really interesting to see, I was surprised to see that the majority of people became fans during Debut. it was Fearless up until last year I think. I laughed a little at the evermore & Fearless TV numbers being so low since their eras lasted 2 seconds lol\n\n\nI was really pleased to see champagne problems dropping out of the top 5, finally! especially in favour of ivy",
            "score": 10,
            "replies": []
        },
        {
            "author": "Windstorm_",
            "body": "Fresh Out The Slammer & I Can Fix Him are production highlights. These people are going to pay Debut (TV) dust.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Ludibrious1",
            "body": "I Can Fix Him ( No Really I Can) is entirely too low. Y’all just don’t like westerns I guess. \n\nAlso, Fresh Out The Slammer is criminally underrated.",
            "score": 7,
            "replies": []
        },
        {
            "author": "good_god_lemon1",
            "body": "I love this! Thank you for putting it together!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Square_Piccolo6650",
            "body": "This is so fun!  It’s interesting that the favorite songs  don’t seem to equate to actual streams though.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MrSloppyPants",
            "body": "I find it incredible that there are over 50 Thirteen-year-olds on here regularly enough to participate in the survey. Would have liked to see Median age in addition to average, I think it would have been insightful",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sufficient-Pickle749",
            "body": "I was at the show when Travis came on stage. I was hoping for Florence. And for that not to be an option is crazy. \n\nFor those who saw Taylor + Florence do Florida!!! Just know I am eternally envious.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Squash_Safe",
            "body": "Seeing thanK you aIMee at the bottom of the ranking is genuinely hurtful",
            "score": 3,
            "replies": []
        },
        {
            "author": "Styleitoff",
            "body": "First thank you for the creative way of presenting the results. So much work must have been put into it. \n\n\nI loved reading the data and I think the one thing that stood out to me the most is how favorable the rating reputation got !! A few years ago, in this sub it was rated average to low. I guess the performances may have helped increasing its rank. Strangely, Lover who was also very divisive a few years ago doesn't seem to have its ranking changed that much 🤔 You'd think Cruel Summer at least would impact its position. But then again reputation seems at least to have cohesion and less number of songs over Lover who still get criticized for its wild tracklisting and length (TTPD laughs in the corner). \n\n\nAnyways, I wonder how much these answers will change once all the re-recordings will be out and one day when TS12 will be released. It's so interesting because I've been a fan of Taylor for almost 15 years now and the opinions of the fan base have continuously changed over time. Although, one thing that has managed to remain consistent is All Too Well. It's safe to say that song has cemented its place and probably will never be taken from it. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "mannymd90",
            "body": "imgonnagetyouback at 21 has me shook. That song is amazing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Heavy-Artichoke3583",
            "body": "Why do you guys dislike I Can Fix Him??? 😓 It was immediately one of my favorites!",
            "score": 3,
            "replies": []
        },
        {
            "author": "MotherofOtters25",
            "body": "Interesting that everyone’s least favorites and lowest rankings are my highest. And everyone’s favorites are my lowest lol 😂",
            "score": 7,
            "replies": []
        },
        {
            "author": "craftaleislife",
            "body": "Justice for 1989",
            "score": 2,
            "replies": []
        },
        {
            "author": "-Silver-Moonlight-",
            "body": "Yess! So happy to see So Long, London at #1!\n\n\nJustice for The Alchemy and The Albatross, though!",
            "score": 2,
            "replies": []
        },
        {
            "author": "DaraGoodie",
            "body": "Yall stay sleeping on Robin for reasons unknown 😤",
            "score": 2,
            "replies": []
        },
        {
            "author": "parkersb",
            "body": "did anyone else sell their tickets because it was borderline irresponsible for you to give up that much money for a concert? i don’t regret it but still wish i went",
            "score": 2,
            "replies": []
        },
        {
            "author": "deep-fried-fuck",
            "body": "Imgonnagetyouback is criminally underrated",
            "score": 2,
            "replies": []
        },
        {
            "author": "AMwishes",
            "body": "The alchemy is such a good song!! Why is it so poorly regarded? 🥲",
            "score": 2,
            "replies": []
        },
        {
            "author": "abombSFCA",
            "body": "Wow i didn’t realize I wasn’t the only one with right where you left me in top 10.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Petal170816",
            "body": "Thank you for your work on this! Fascinating seeing the results. As a “senior” swiftie I was surprised the age skewed so young. Guess im just one of the cool kids 💅🏻",
            "score": 2,
            "replies": []
        },
        {
            "author": "Last_Slide",
            "body": "I can’t believe Slammer rated so low! It’s one of my favs and I hope y’all will eventually get it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "disinfected",
            "body": "I'm sounding like a broken record at this point, but I just cannot BELIEVE the anti Robin feelings! I have listened to it on repeat - it even made it into my 2024 Top 5 songs of the year on Spotify. It's so special to me.\n\nBut, as an Amy, I'm really happy to see thank you aimee at the very bottom. It's the one song I would delete from the catalogue. I skip every time!",
            "score": 2,
            "replies": []
        },
        {
            "author": "uselesssociologygirl",
            "body": "Wait I missed a survey?",
            "score": 2,
            "replies": []
        },
        {
            "author": "LinkSond",
            "body": "Where was this survey announced? About 0,1% of the total number of people in this subreddit responded and I think that’s cause of a lack of knowing about it\n(I myself had no idea about it until now)",
            "score": 2,
            "replies": []
        },
        {
            "author": "oOWalkingOnAirOo",
            "body": "reputation stage forevermore ♾️ \n\nIt really was something spectacular",
            "score": 4,
            "replies": []
        },
        {
            "author": "nieuweschoenen",
            "body": "Poor robin is unfairly maligned 😢 put in the same category as thank you Aimee!!! I can’t believe it",
            "score": 3,
            "replies": [
                {
                    "author": "disinfected",
                    "body": "Exactly, thank you! TYA is my least favourite and Robin is my favourite!!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kalily53",
            "body": "Personally pretty surprised by\n1) TTPD rated so highly\n2) fresh out the slammer rated so poorly\n3) so many saying they became swifties during debut?? Some people are lying 🤨",
            "score": 3,
            "replies": [
                {
                    "author": "SgtPopNFresh_",
                    "body": "The majority of the sub polled in at over 25, with the highest percentage around 30. It’s not that far fetched to think they became fans as kids. She was marketed to kids at the beginning.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "TeylaSwift",
                            "body": "Us in our late 20's early 30's were in middle school/ early highschool when she released debut, doesn't surprise me either! She was very popular in the country scene ",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Sym-Mercy",
                                    "body": "Basically everyone I’ve seen who claims to be a TS-era Swiftie, on Twitter for example, never ever talk about country music or her country albums. I don’t know how someone is a country fan enough to listen to a new artist, stick with them for three more country albums, and then engage with no country music afterwards. Some people are just plain lying.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "TeylaSwift",
                                            "body": "Fair point! It annoys me too that her county albums are ignored and looked down upon by many. \n\n\nI grew up in an urban area where country music was not popular but I did get many of my friends into Taylor Swift in her debut and Fearless eras who otherwise aren't big fans of the genre ",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MatchesLit",
                    "body": "I think people conflate Swiftie with fan, so there's nuance there. I've liked Taylor since Debut as someone near her age. But I became a SWIFTIE during 1989 lol. Some people consider casual fan and Swiftie as one in the same and others see a difference between them, so I think that's what's going on.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "laurahirshy",
            "body": "thank you for putting this together! I always love seeing this type of data. one small note - it should be rate on the second slide, not rank. rank implies positioning it among others, rate means giving it a number rating.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GobletMist",
            "body": "My poor The Alchemy heart 😔",
            "score": 2,
            "replies": []
        },
        {
            "author": "Own-Artist-6283",
            "body": "chloe or sam or sophia or marcus so low hurts",
            "score": 2,
            "replies": []
        },
        {
            "author": "SuperRapidash",
            "body": "justice for fresh out the slammer",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sophia_B10",
            "body": "Poor Robin😞😞😞 Yall don't get her like I do",
            "score": 1,
            "replies": []
        },
        {
            "author": "toritxtornado",
            "body": "how could someone choose speak now as their favorite set?????",
            "score": 1,
            "replies": []
        },
        {
            "author": "toritxtornado",
            "body": "love ivy and cowboy like me getting so much love 💕",
            "score": 1,
            "replies": []
        },
        {
            "author": "mch251",
            "body": "I missed the vote, but the Black Dog is one of my favorites. Y’all have taste 🤌🏾I hate it here is not getting enough hate for me though",
            "score": 1,
            "replies": []
        },
        {
            "author": "jewelsforjules",
            "body": "I hate I missed the survey! Next year!! 😊\n\nWhoever the other 49 year old is. HI!!!! 🙋🏻‍♀️😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rebegga",
            "body": "As a 29 year old straight european woman I endorse this hahaha ![img](emote|t5_2rlwe|1072)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sym-Mercy",
            "body": "My conclusion here is that A LOT of people on here lie about when they became a Swiftie. I’ve noticed it on Twitter too. It seems that every other person you meet has been a Swiftie since 2006… when she was minuscule compared to the heights she reached even a few years later and most of us were either in diapers or at least too young to make music consumption choices. \n\nWhy do so many people feel the need to lie about this?? Taylor is now almost two decades into her career, there’s no shame in being a new Swiftie or even a Swiftie of 10~ years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "azizk96",
            "body": "3 of the favourite songs being evermore songs 😍",
            "score": 1,
            "replies": []
        },
        {
            "author": "jeanravenclaw",
            "body": "Speak Now is underrated :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "dmnaf",
            "body": "Ok the 10.97% who did not watch the eras tour movie must be trolling. You mean to tell me you’re big enough of a fan to be on her subreddit, but watching her movie is too much? lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Outside-Bowler6174",
            "body": "Ok the individual ttpd song ratings are criminal what's up with the thank you aimee hate",
            "score": 1,
            "replies": []
        }
    ]
}