{
    "title": "TIL that before Breaking Bad, Giancarlo Esposito faced bankruptcy after his divorce and he considered suicide by arranging his own murder to provide insurance money for his children. A realization about missing their lives stopped him. He persevered and found success as Gus Fring.",
    "author": "skidSurya",
    "subreddit": "todayilearned",
    "rank": 2,
    "score": 8035,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 261,
    "url": "https://www.hollywoodreporter.com/tv/tv-news/giancarlo-esposito-broke-considered-planning-own-murder-1235877300/",
    "id": "1je1b8f",
    "selftext": "",
    "comments": [
        {
            "author": "trueum26",
            "body": "It’s crazy considering after Breaking Bad, he basically became typecast as a villain and got a bunch of roles for that",
            "score": 2330,
            "replies": [
                {
                    "author": "KennaSweetXO",
                    "body": "His portrayal as Gus Fring is iconic, but he has so much range as an actor.",
                    "score": 1163,
                    "replies": [
                        {
                            "author": "UselessWisdomMachine",
                            "body": "Buggin' Out in Do the Right Thing is such a stellar performance.",
                            "score": 331,
                            "replies": [
                                {
                                    "author": "spikelike",
                                    "body": "i’m convinced Do The Right Thing needs another life as a stage play. ",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "moderatorrater",
                                            "body": "It's still so relevant today, it just looks like a super cheaply made movie. A stage play would be a great way to bring it to the present. Just don't make it a jukebox musical.",
                                            "score": 13,
                                            "replies": []
                                        },
                                        {
                                            "author": "_Vaudeville_",
                                            "body": "Why? It’s one of the greatest films ever, people should just go and watch that",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "spikelike",
                                                    "body": "I would love to see how it translates to a stage format. Maybe Spike Lee could cross into EGOT territory ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Sick0fThisShit",
                                    "body": "Martin Luther *KING*! Malcolm *X*! Michael *JOR-DAN*!",
                                    "score": 80,
                                    "replies": [
                                        {
                                            "author": "TheMaveCan",
                                            "body": "Who told you to buy a brownstone on my block, in my neighborhood, on my side of the street?? Yo what you wanna live in a black neighborhood for anyways, man? Motherfuck gentrification!",
                                            "score": 44,
                                            "replies": [
                                                {
                                                    "author": "RawAttitudePodcast",
                                                    "body": "“I was born in Brooklyn!”\n\n[everyone shouts in disbelief]",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TheBritishGent",
                                                    "body": "Never realised that was him!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TheMaveCan",
                                                            "body": "It's definitely a far cry from the reserved composure he's known for now",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "CelestialDreamss",
                                    "body": "THAT'S HIM?!?!?!",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Don_old_dump",
                                            "body": "He's also the guy that says yo mamma in Maximum Overdrive and gets zapped by an arcade game.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "UselessWisdomMachine",
                                            "body": "It's ok. I had the same reaction when I first found out.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "JohnTDouche",
                                            "body": "The dude was on screen constantly in the 90s. There was even cop show where he was the main guy. I can't really remember it well but I think it only lasted a season.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "UselessWisdomMachine",
                                                    "body": "Homicide: Life in the Streets?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "JohnTDouche",
                                                            "body": "No that wasn't it. It was a bit more light hearted than that. All I can remember is that he and his wife moved to a town and that's the premise. I'll just go look it up.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "JohnTDouche",
                                                            "body": "Alight I'm 99% certain it was [Bakersfield PD](https://www.youtube.com/watch?v=InhzbeNliCM). 94-95 apparently, that's a lot earlier than I thought. Though it probably aired where I am later than that.\n\nLooking over his wikipedia, dude did have a lot of solid TV work in the 90s. Kinda petered off into just one off episodes in the 2000s though. Until Breaking bad of course. \n\nAlways liked him as an actor though.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "nkleszcz",
                                            "body": "I still like his brief performance as a street vendor in Desperately Seeking Susan.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Tankisfreemason",
                                    "body": "Esteban in Fresh was a solid performance as well ",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "BRUISE_WILLIS",
                                    "body": "Holy shit that WAS him!",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "BSB8728",
                                    "body": "He also played one of the young kids in jail with Billy Ray Valentine (Eddie Murphy) in *Trading Places.*",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TakeThatOut",
                            "body": "Eye range in just one character. The change of his eyes from being the nice empathic guy to completely scary one were in a different level. Not to mention he doesn't need to act big or enlarge his eyes to look scary.",
                            "score": 65,
                            "replies": []
                        },
                        {
                            "author": "Pawneewafflesarelife",
                            "body": "Once Upon a Time is basically a soap opera with a fantasy theme, but he knocks it out of the park as the evil queen's magic mirror - it's a great role for him because he's kinda a villain, but more so her lackey, so there's this quietly desperate, trapped neediness for approval as his mental health erodes that he portrays so well.\n\nHe makes a cameo in a later season after being locked away in solitary confinement for a few years (eg doing bigger roles elsewhere) and he steals every scene he's in.",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "TTBurger88",
                            "body": "From a friendly owner of a chicken joint one moment to murderous drug kingpin the next.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "chux4w",
                            "body": "And yet I only ever see him playing Gus Fring.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "creggieb",
                            "body": "Hopefully better than the mandalorian. Never mind that every plot was just a plagiarized shoeborning of stsr wars into an old movie/trope, but Darth Gus didn't seem very unique either.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "orielbean",
                                    "body": "They didn’t give him much to do beyond seethe",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "creggieb",
                                            "body": "Assuming that's a title of an episode, I agree. But it didn't change the fact that his character could have been called Gus, and that nothing about the character they wrote for him, and the way it was acted was different\n\n\nWhen Jonny depp is in a role, for example,he disappears. When watching blow, or Edward scissor hands or Piratesz or anything else, I don't see piratejonny, or Edward Jonny, the way I see spaceGus, and nothing but gus when I tried watching mandalorian",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "YeylorSwift",
                                                    "body": "I see Johnny the pissdrunk quirky semi loveable weirdo in every role he plays now. Dudes washed.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Witchycurls",
                                                            "body": "I think we're gonna go down, but I agree. He used to be almost my idol in the earlier years, up to about the first Pirates, but he's gone down a very steep & slippery slope in my eyes. He can fuck right off now.",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "yarash",
                                    "body": "Star Wars is built on a foundation of old movie tropes and plagiarism.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "tanfj",
                                            "body": "> Star Wars is built on a foundation of old movie tropes and plagiarism.\n\nIt truly is and that's what makes it great. The  entire idea of Star Wars is \"It's an Adventure Serial but in SPACE!!\" Star Wars works best when it remembers that.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "JohnTDouche",
                                            "body": "Only the good ones though. We all know what happened when Lucas tried to be original.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "creggieb",
                                            "body": "Star wars is based on. Mandalorian just replaces character names and locations. Did anyone else give even the smallest fuck about the Mexican village that the bad guys would obliterate, without the help of a plucky band of misfits? Was anyone entertained that the love interest not only had a child, but that whichever character falls for her might be interestedbin staying? Did anyone even need to watch that episode to write the script themselves? Was anyone in doubt of exactly what would happen? Of course not. Ai could have written, directed and filmed that movie just by replacing a few words.\n\nSame way AI could have written \"wolves of the  CallA\" \n\nLiterally the exact same story, and it was old hat more than 2 decades ago when Stephen King put in effort to differentiate it from all those that came before\n\n\n\n\n Based on is a bit more than replacing Mexico, and gangsters with alien planet and stormtroopers",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Goondragon1",
                                                    "body": "The fact that this is the edited version of your comment is astounding.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "creggieb",
                                                            "body": "I changed a few typos that touchscreen causes. So others could understand better. Disagreeing, with the downvote button is very much not unexpected.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GattsUnfinished",
                            "body": "What range? Every role of his I've seen has been the same",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "trailofturds",
                    "body": "Being typecast may not be the worst thing honestly, at least you'll be among the first names for consideration based on reputation alone",
                    "score": 270,
                    "replies": [
                        {
                            "author": "everybodyiskungfu",
                            "body": "I'd imagine being typecast is an A-lister concern, the vast majority of actors is probably happy to be working.",
                            "score": 206,
                            "replies": [
                                {
                                    "author": "trailofturds",
                                    "body": "Yeah exactly. Also villains can be extremely complex and diverse characters, it isn't a one size fits all so he can still use his range. They aren't the cookie cutter types that Michelle Rodriguez is stuck playing, for example (badass woman who can fight and has the occasional one-liner)",
                                    "score": 106,
                                    "replies": [
                                        {
                                            "author": "gasman245",
                                            "body": "You forgot the tank top. I think having her arms bare must be part of her usual contract.",
                                            "score": 60,
                                            "replies": [
                                                {
                                                    "author": "Compulsory_Lunacy",
                                                    "body": "And the dying. She dies a lot",
                                                    "score": 33,
                                                    "replies": [
                                                        {
                                                            "author": "Ketzer_Jefe",
                                                            "body": "I never noticed before, but now that you mention it, she does die a lot.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "BreezyRyder",
                                                                    "body": "Her little raspy whisper voice and grimace face are perfect for a dramatic action movie death. Just act normal Michelle",
                                                                    "score": 7,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "HalobenderFWT",
                                                                    "body": "Come to think of it - I don’t think I’ve ever seen her and Sean Bean in the same room….",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "pheonixblade9",
                                                            "body": "she can't be in the entire movie, gotta chug through them roles",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AliensAteMyAMC",
                                            "body": "I’m pretty sure she straight up just takes those roles now. She tried playing a role in a movie where she wasn’t a badass went “this FUCKING SUCKS” and is perfectly happy with being the badass woman.",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Square-Singer",
                                    "body": "Being typecast can be good or bad depending on the type. \"Villan\" is a nice, varied type with tons of job opportunities. Christopher Lee for example spent quite some time in that niche.\n\nBeing typecast as \"Science Fiction Starship Chief Engineer\" on the other hand is such an incredibly narrow type that it can kill your carreer, no matter if you are popular or not.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wloak",
                            "body": "Mark Strong is a good example of this. He plays the menacing British bad guy well and gets regular work for it.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "0xffaa00",
                                    "body": "Ralph Fienness is the ultimate British bad guy",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "teems",
                                            "body": "He's the new M.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "teems",
                                            "body": "He's the new M.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "chux4w",
                                    "body": "Mark Strong? Oh, you mean that guy with the face.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "thermal_shock",
                            "body": "seann william scott, one of my favorite actors, got typecast after Stiffler and found it hard to get \"real\" roles. sucks, cause i think he's funny as hell especially with the deadpan jokes.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "SayNoToStim",
                                    "body": "SWS isnt an A-lister though.\n\nThe Rock is typecast and makes more money than most countries at this point.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "thermal_shock",
                                            "body": "i didn't know we were only doing a-listers, i was just talking in general about typecast actors.\n\nmorgan freeman, samuel l jackson, alot of great actors may only be great because of being typecast. bruce willis, also one of my favorites, VERY typecast. typecast so much, he was still a cop in 16 Blocks, just a drunk one lol.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "BreezyRyder",
                                                    "body": "NO I'M NOT YELLING,  THAT'S JUST HOW I TALK! HAVEN'T YOU SEEN ANY OF MY MOOOVIES?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "the_bob_of_marley",
                                                            "body": " “They ate me! A fucking shark ate me!”",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Spade9ja",
                                                    "body": "Most famous actors are typecast to a degree. \n\nLike pretty much all of them.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bicyclingdonkey",
                                    "body": "Do you consider his role in Its Always Sunny In Philadelphia a typecast role? I haven't seen him in much other than that and American Pie. Thought he was great as Country Mac",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "thermal_shock",
                                            "body": "not for that one role, but comedy in general, always the \"jokester\" roles.\n\ni also think a lot of the movies he's in are cult classics, like dude wheres my car, but failed by critics, which means fuck all to me, [siskel and ebert rated one of my favorite movies Tommy Boy as 1/4 stars and i quote \"No one is funny in “Tommy Boy.”](https://www.rogerebert.com/reviews/tommy-boy-1995) There are no memorable lines.\" LMAO, they can get fucked, that movie is top tier for me.\n\nhere is a quick opinion piece on what happened to SWS - https://www.youtube.com/watch?v=gaVtx2wfTcE\n\ni think he just gets shoved aside as an immature teenager and not taken seriously, but i think he can be hilarious as hell.\n\nhe was kinda serious in Evolution, at least had ambition to be a firefighter.\n\nhe was a racist neo nazi group leader in Wrath of Becky, serious role.\n\nkind of serious role in Role Models.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Dr_Dust",
                                                    "body": "Fuck man, how are they gonna do Tommy Boy dirty like that?  1/4 stars is BS.  Makes me wonder if they even actually watched the movie.  I still quote lines 30 years later.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "montague68",
                            "body": "Depends on the typecasting. Some actors get typecast for a singular role, and then lose work because execs think the audience will see that character instead of the new one. William Shatner as Kirk, George Reeves as Superman, and Adam West as Batman are the most notorious examples. Nowadays it isn't so pronounced but some actors spend years struggling to get top-tier work after playing certain roles. Hayden Christensen and Daisy Ridley more recently come to mind.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Kaiserhawk",
                            "body": "fr, considering you're so poor you're contemplating killing yourself for life insurance, I'm sure he's happy he's getting gigs, even in a typecast role.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TPO_Ava",
                    "body": "To be honest I feel like the reason he was such a great villain was because he pulled off the duality of the character so well. Yes, he was a ruthless and cunning drug kingpin, but he wasn't just that. He was shown interacting with members of the community, being kind to his employees and even having a bit of a tragic backstory of his own.\n\nWhat I'm saying is, it feels wrong that he's been typecast for mostly villain roles when I feel like he could pull off other roles quite well too.",
                    "score": 92,
                    "replies": [
                        {
                            "author": "Caleth",
                            "body": "The curse of doing your job to well. You get marked as irreplaceable and don't get to spread your wings.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "moal09",
                    "body": "He seems grateful regardless.  Considering his previous financial situation, I think he's just happy to have the work.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "ShadowXJ",
                    "body": "It’s clear he’s leaning into that, but I don’t blame him have to strike while the iron is hot.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "dont_shoot_jr",
                    "body": "I’d wager he became one of the go-to villains in Hollywood",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "295DVRKSS",
                    "body": "I loved his performance in better call Saul",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Corgi_Koala",
                    "body": "Yeah he's been super prolific lately. \n\nAnd he's a damn good actor too.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "saltporksuit",
                    "body": "He was so good in The Boys though, typecast or not. The bad product line was so dispassionately cold.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Kaiserhawk",
                    "body": "After the title, I'm sure he's happy getting paid.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mikeymovies",
                    "body": "Don't forget he also carried over into video games and portrayed the antagonist in Far Cry 6",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheDevilishFrenchfry",
                    "body": "I imagine his backstory probaly played into what made him such a iconic actor, usually extremely good actors like that are almost not even playing a character, but more so just channeling emotions they already had that were there",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "android9091",
            "body": "A heartbreaking story. Glad he stayed. The world is better with him in it",
            "score": 716,
            "replies": [
                {
                    "author": "tequilachop",
                    "body": "Knowing how high spirited he is irl makes this sad.",
                    "score": 228,
                    "replies": [
                        {
                            "author": "CapableLocation5873",
                            "body": "Same thing with Owen Wilson,I’m glad he is still with us.",
                            "score": 78,
                            "replies": [
                                {
                                    "author": "_nedyah",
                                    "body": "I wouldn't compare the two. By all accounts, Owen Wilson is an asshole and Giancarlo is absolutely not.",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "kelsobjammin",
                                            "body": "Ooh tea?",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "author": "_nedyah",
                                                    "body": "Just search his name on Reddit. You'll come across various comments about him in \"Has a celebrity ever been rude to you\" posts.  \n\nAlso, the guy has a daughter that I believe is 6 now that he has never met and wants nothing to do with and it's all because he doesn't like the girls mom.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "OscarGrey",
                                                            "body": "\"Doesn't like the girl's mom\" is an oversimplification. She tricked him into getting her pregnant. I still think that he's an asshole for being stubborn about keeping zero contact with his daughter, but you shouldn't leave this detail out since it's important.",
                                                            "score": 127,
                                                            "replies": [
                                                                {
                                                                    "author": "moonsdulcet",
                                                                    "body": "Oh that sounds like rape… unconsented/tricked/forced pregnancy is one of the worst things to ever happen to anyone. I don’t blame him for going no-contact even if it sucks for the kid. I believe it can be a traumatic experience, would not want to be reminded of that.",
                                                                    "score": 68,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Etheo",
                                                                    "body": "I don't think one should be considered an asshole for wanting nothing to do with a kid he never wanted and was forced upon him.  Imagine someone gifting you a puppy and you don't even like dogs... And expect you to care for it for ~~it's~~ its whole life.\n\nI feel bad for the girl but if the circumstances is true I can understand his choices.  He could be better to her but I don't think it should be pressured upon him.",
                                                                    "score": 51,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ferelar",
                                                                            "body": "100% agreed, it is not the kid's fault and it's quite sad, but it is ALSO not Owen's fault and it'd be just as unfair if not moreso to force him to interact and take on such a huge responsibility he actively didn't seek or know he was getting into.",
                                                                            "score": 11,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "TheRealStevo2",
                                                                    "body": "If she tricked him into getting her pregnant and he REALLY didn’t want a kid it’s probably just better he’s not there. An absent father is better than a present father who does not like you or want you.",
                                                                    "score": 22,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "kelsobjammin",
                                                                    "body": "I don’t consider him an asshole for this especially being child free myself",
                                                                    "score": 12,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "chux4w",
                                                            "body": "...wow.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Duke_Cheech",
                                                            "body": "Wes Anderson's cast of regulars generally sound like very unlikable people. Being on set with Bill Murray, Owen Wilson, and Adrien Brody sounds exhausting",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No-Sprinkles-9066",
                    "body": "I worked with him on a short film before Breaking Bad aired. What a lovely, warm and friendly person he is. I couldn’t be happier for his success :)",
                    "score": 45,
                    "replies": [
                        {
                            "author": "rtb001",
                            "body": "I mean most people who met Gus would also describe him as lovely, warm and friendly!\n\nJust sayin...",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mathis_mbz",
            "body": "His lines as Gus Fring hit even harder after this.\n\n\"A man PROVIDES for his family\"",
            "score": 411,
            "replies": [
                {
                    "author": "johor",
                    "body": "When a man has intercourse with a prostitute and he covers his organ with protection, so that he won't catch her wretchedness, he is acting in the name of his family so that he won't take it home to his wife.",
                    "score": 94,
                    "replies": [
                        {
                            "author": "h3rald_hermes",
                            "body": "Where is that in the Bible?",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "johor",
                                    "body": "Uncle Excelsior.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Fuckoffassholes",
                            "body": "God would actually prefer that he should impregnate the prostitute.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ocarina-of-Lime",
                    "body": "I mean he said that to manipulate Walter lol it wasn’t sincere",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "roominating237",
            "body": "Trivia: He was in a couple of episodes on NYPD Blue, played a heroine addict, \n Anna Gunn played a call girl, Dean Norris played a priest in two eps the very first season. \n\nFriday Night Lights had a slew of future BB actors.",
            "score": 96,
            "replies": [
                {
                    "author": "Dillweed999",
                    "body": "I wonder how much of this was just a location thing?  Obviously lead actors will audition and move around for roles but I've noticed reoccurring and supporting actors tend to stay put.  You end up with \"islands\" in cities where lots of TV gets made (LA, New York, Atlanta, Vancouver etc) which then results in a lot of the same faces showing up together in projects.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "sambadaemon",
                            "body": "I always get a kick out of the Vancouver crew showing up in every single Syfy show from the early 2000s.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Presently_Absent",
                            "body": "well sure - actors are people with families just like everyone else. And the *vast majority* of actors are doing it as more of a grind than as a \"get a lead role in a big project once every two years\" type of thing - just think of how many supporting characters there are in all of the tv and film that you see, relative to lead roles. \n\nso, since it's \"a job\", they may have a family and friends and a life in a given city, and unless they have a single-minded focus about being \"a star\" they likely won't uproot their family just for one role, they'd rather stick around home.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "rtb001",
                            "body": "I'm still trying to figure out how half the Star Trek TNG cast all ended up on Gargoyles of all shows.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "553l8008",
                    "body": "And Brian Cranston played a dentist named Tim watley",
                    "score": 18,
                    "replies": [
                        {
                            "author": "SayNoToStim",
                            "body": "What are you, some sort of anti dentite?",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jlanger23",
                    "body": "I believe X Files had its fair share of future Breaking Bad actors as well. Then again, most tv actors from that era had a role in X Files at some point.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Sigseg",
                            "body": "Rewatch S3E13 and you'll spot a baby-faced Ryan Reynolds.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Darmok47",
                            "body": "That's probably because Vince Gilligan was a writer on The X-Files before going on to create Breaking Bad.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Darmok47",
                            "body": "That's probably because Vince Gilligan was a writer on The X-Files before going on to create Breaking Bad.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bbbermooo",
                    "body": "He was also in Homicide, played Chief in the later years.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "firstfloor27",
                            "body": "Giardello's son.  Great role.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Realistic_Mode_3120",
                    "body": "He was also in The Usual Suspects and Fresh",
                    "score": 5,
                    "replies": [
                        {
                            "author": "err-no_please",
                            "body": "Amazed that his appearance in the Usual Suspects isn't more prominent in this chat",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "leeharveyteabag669",
                            "body": "He was also in King of New York. Artie pissing on his shoes.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thenewnapoleon",
                    "body": "He was also in a few episodes of Miami Vice.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "lobroblaw",
                    "body": "A Night On Earth is a decent movie. He has a good part in that",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "HAK_HAK_HAK",
                    "body": "A very babyfaced Aaron Paul is also in an NYPD Blue episode as a hoodlum that gets wrongly pinched as a suspect and ends up giving info on the real criminals.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "roominating237",
                            "body": "\nCan't believe I missed that! I rewatched the whole series last year. S9 E12 Oh, Mama.\nKudos on you.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PussyStapler",
            "body": "What does a man do, Walter? A man provides for his family. And a man, a man provides. And he does it even when he's not appreciated, or respected, or even loved. He simply bears up and he does it. Because he's a man.",
            "score": 72,
            "replies": []
        },
        {
            "author": "Nafeels",
            "body": "I remember his interview about becoming Moff Gideon in the Mandalorian series. One of his favourite part of playing the character was that he could playfully tease his daughter by threatening to “squeeze” Grogu. Such a dad joke right there.",
            "score": 212,
            "replies": [
                {
                    "author": "Sparrowsabre7",
                    "body": "I believe the exact quote was \"I'm going to squash that little big-eared bastard\" 😂",
                    "score": 95,
                    "replies": [
                        {
                            "author": "Nafeels",
                            "body": "YES EXACTLY! I can already picture the devilish grin while he says that. \n\nI swear, the entire cast of Breaking Bad (and Better Call Saul) have this ability to switch to different characters on a whim. Solid production from everyone.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "DaMonkfish",
                                    "body": "Casting Bob Odenkirk as the protagonist in Nobody was fucking inspired; such an enormous change from Saul Goodman in BB/BCS, and he absolutely nailed it.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "LeftHandedFapper",
                                            "body": "Rewatching BCS and I was just thinking about how talented Odenkirk is. He's amazing in that I Think you Should Leave sketch. My wife also showed me The Birthday Boys and ho boy, that comedy really gets me!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlertThinker",
            "body": "He will always be Major Tom Neville to me.",
            "score": 26,
            "replies": [
                {
                    "author": "Heikks",
                    "body": "I remember his as the magic mirror from once upon a time",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Halgy",
            "body": "A lot of actors have these types of stories. Maybe most of them. I'm glad they found success, but it makes me thing of the 90% of actors and aspiring actors who never catch their break at the right time. For all of their talent, so much of success depends on timing and luck.",
            "score": 23,
            "replies": [
                {
                    "author": "Every-Incident7659",
                    "body": "John Krasinski had a similar thing where he moved to NYC after college to try and be an actor and after a few years he called his mom and said he was giving up and coming home. She told him to just give it a few more weeks and then he can come home and like a week later he auditioned for the office",
                    "score": 15,
                    "replies": [
                        {
                            "author": "8483",
                            "body": "And married Emily Blunt. Wild how his life would have looked like.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Every-Incident7659",
                                    "body": "Like winning the lottery but way more unlikely. Makes you wonder how many random decisions you've made that could've led you down wildly different paths for better or for worse",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Every-Incident7659",
                                    "body": "Like winning the lottery but way more unlikely. Makes you wonder how many random decisions you've made that could've led you down wildly different paths for better or for worse",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Halgy",
                            "body": "His was one of the stories I was thinking of when I posted. Another was Alan Ritchson (star of Reacher, and a shitload of other stuff now) who was sexually assaulted and considered suicide while he was breaking in.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "stockwell1993",
                    "body": "99.9%*",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Certain-Rise7859",
                    "body": "It’s not exactly an actor thing. Suicide is a top cause of death for 18-45 year olds.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 297,
            "replies": [
                {
                    "author": "426763",
                    "body": "What's even crazier was Gus wasn't even supposed to be the main villain, it should've been Tuco. But Ryamond Cruz wanted to quit at the time and Vince and co \"rearranged\" the story to make Gus the big bad.",
                    "score": 69,
                    "replies": [
                        {
                            "author": "FiveDozenWhales",
                            "body": "Apparently playing Tuco was just too exhausting, and I can see why.\n\nAnd Jesse was supposed to die in season 1.  Breaking Bad might've been just another cheap crime show instead of the fantastic display of pathos it became.",
                            "score": 79,
                            "replies": [
                                {
                                    "author": "426763",
                                    "body": "It's crazy how this show was basically built on practically last minute changes. Hell, Mike wouldn't have existed if Odenkirk wasn't busy working on How I Met Your Mother.",
                                    "score": 71,
                                    "replies": [
                                        {
                                            "author": "sybrwookie",
                                            "body": "And in the last season, that flash-forward to Walt having that giant gun in the trunk of a random car was something they threw in there because it looked cool, and figured they'll decide how to get there later.\n\nThat show was really proof you don't need everything worked out from the start, you just need a rough idea of where you're going and people who are really good at writing to get you there.",
                                            "score": 17,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Witchycurls",
                                    "body": "Jesse Pinkman, my absolute fave BB character. For such a young man, Aaron Paul played almost the gamut of roles as Jesse and did them all stunningly well.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AKraiderfan",
                    "body": "WTF is this AI generated slop? This shit isn't even in the article.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "explicitlarynx",
                    "body": "AI generated",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Presently_Absent",
                    "body": "it's also a testament to how hard the acting business is. There are SO MANY truly talented actors who may never make it just because they don't audition for the right role at the right time, or the right role just never comes along for their particular look or unique traits. So much of a prominent role like Gus Fring is down to the \"look\" of the actor, and not necessarily the acting chops, because so much of \"the character\" comes from the director's direction. many times the casting director picks the better look over the acting chops, because of this.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "iama_computer_person",
                    "body": "This is the way. ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Just_tryna_get_going",
                            "body": "Clever clever clever comment!!!",
                            "score": -10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ILL_Show_Myself_Out",
                    "body": "Yknow but most people ALSO don't kill themselves for insurance money",
                    "score": -25,
                    "replies": []
                }
            ]
        },
        {
            "author": "gudanawiri",
            "body": "Can you stop just regurgitating r/damnthatsinteresting content please?",
            "score": 108,
            "replies": [
                {
                    "author": "Akrylkali",
                    "body": "Just block accounts like this. You won't be missing out on anything.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "MuricasOneBrainCell",
                            "body": "Or just un sub one of the two. Got tired of the double posting. You can post gif replies on this one, so I decided to drop r/DamnThatsInteresting",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Kaellian",
                            "body": "It's like junk food in school cafeteria. Sure, you can pack your own lunch, but you still know its bad for everyone else, and that is in itself irritating.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mapletables",
                    "body": "how else will I get my fake internet points?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Romnonaldao",
            "body": "He played the camp councilor in the Sesame Street story arc where Big Bird goes to summer camp. Seeing a young version of him playing a character who is happy and energetic is wild.",
            "score": 5,
            "replies": []
        },
        {
            "author": "CommonerChaos",
            "body": "Divorce should never cause someone to go bankrupt and nearly kill themselves. Divorce laws are outdated and need to be changed.",
            "score": 5,
            "replies": [
                {
                    "author": "Turbulent-Poetry-679",
                    "body": "Facts. Scrolled way too far to find this comment.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lirio2u",
            "body": "I’m so glad that he made it",
            "score": 7,
            "replies": []
        },
        {
            "author": "mcpickledick",
            "body": "A winner is just a loser who tried one more time",
            "score": 7,
            "replies": [
                {
                    "author": "oboshoe",
                    "body": "Ironically.\n\nA loser is also a loser who tried one more time.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Elrond_Cupboard_",
            "body": "God knows its why I'm still here.",
            "score": 3,
            "replies": []
        },
        {
            "author": "neotheseventh",
            "body": "May be this is a digression, but now-a-days don't most insurance companies consider suicide as a valid death, as in, you don't forfeit your insurance even if you have committed suicide. I know this is at least true in my country (India).\n\nThere are caveats like waiting period of 1 or 2 years to make sure you are not rigging the system, but otherwise mental health death should not prohibit your family from getting insurance money.",
            "score": 3,
            "replies": []
        },
        {
            "author": "taitaofgallala",
            "body": "I really recommend watching his performance in Do The Right Thing closely. It's an amazing performance, but there's a darkness in there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Salivating_Zombie",
            "body": "Side note: he's Italian and is fluent in the language.",
            "score": 6,
            "replies": [
                {
                    "author": "Cyrus_114",
                    "body": "Which is shocking, because his Spanish is atrocious.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "DiamondTippedDriller",
                    "body": "His Italian is not good.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "1morgondag1",
            "body": "That's such a Breaking Bad style plan.\n\nHe was great in the part but I still found it annoying he was talking Spanish with a strong US accent. I wish they had rewritten the part to not make him a Chilean immigrant as that background wasn't really crucial to the character.",
            "score": 6,
            "replies": [
                {
                    "author": "sybrwookie",
                    "body": "It's more a Bulworth-style plan",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PM_ME_UR_ROUND_ASS",
                    "body": "His accent makes sense when you consider he's actually Danish-born with Italian and African-American parents, not a native spanish speaker.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZombieDracula",
            "body": "Never give up, never give in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "The-PageMaster",
            "body": "He persevered and became a millionaire...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Visible-Fun4400",
            "body": "His story sounds just like mine, you never know the mental load that people are carrying even when they appear happy. This is why being kind is imperative to society because if you choose to be kind, it might give those who are struggling hope. The only reason I didn’t kill myself when I was depressed was because I wanted to wait to see my kids grow up and be self sufficient without me, Now I’m in a better place but my kids were the only reason why I held on to life.",
            "score": 2,
            "replies": [
                {
                    "author": "TaibhseSD",
                    "body": "For the record, I'm glad you're still here and able to tell your story. I know your loved ones feel the same, as well. \n\nAlways remember: You're loved; you matter. The rest will sort itself out. \n\nTake care, bud! Sending hugs your way from Utah!!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rahnamatta",
            "body": "Amazing acting in Breaking Bad....\n\n.... until he spoke in Spanish. That was BEYOND lame.\n\nI had to read the English subtitles and Spanish is my first language",
            "score": 2,
            "replies": []
        },
        {
            "author": "machiniganeer",
            "body": "Just saw him in the Usual Suspects the other night, great actor..  \n\n\"They tell me you got the cripple from New York in there. He mention Keyser Soze?\".",
            "score": 2,
            "replies": []
        },
        {
            "author": "duckrollin",
            "body": "How do you get bankrupt through a divorce? Surely it's a 50/50 split or roughly that?",
            "score": 2,
            "replies": []
        },
        {
            "author": "urbanlocalnomad",
            "body": "The one story that keeps me off the ledge in the worst of times.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DarkObby",
            "body": "Makes ya wonder how much of that iconic deadpan expression is really just *him*.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Thucydidestrap989",
            "body": "I only know him from \"The Boys\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "NCHouse",
            "body": "Jesus...thank god for Breaking Bad",
            "score": 2,
            "replies": []
        },
        {
            "author": "Capnducki",
            "body": "Am I crazy or was this reposted like 4 fucking times today?",
            "score": 2,
            "replies": []
        },
        {
            "author": "ammar96",
            "body": "Holy crap just how many times do I have to see this in a day. Can you like find other topic.",
            "score": -1,
            "replies": [
                {
                    "author": "VanusGM",
                    "body": "First I've seen it, I'm glad it was posted. ",
                    "score": 0,
                    "replies": [
                        {
                            "author": "firstfloor27",
                            "body": "https://xkcd.com/1053/",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ice-cold-baby",
                            "body": "Me too\n\nThis is so inspiring \n\nI too at one time thought of ending my life cos I felt so low during the early pandemic days",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fzkiz",
            "body": "Can I post this tomorrow and next Sunday?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrPrimeTobias",
            "body": "He will always be Gee's son to me, before Gus.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nik_Sloter",
            "body": "And has been playing Gus Fring ever since, no matter what movie, show, or game he's in...   \nJoking aside, I honestly believe that some things should stay private. We really don't know everything about everyone.   \n99% people who are bankrupt or close cannot really relate to him or other celebrities in similar circumstances since all actors need is one big break to turn their life completely around, whereas for ordinary people, climbing out of that kind of trouble is an exercise in endurance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Throwaway_09298",
            "body": "I wonder if Spike Lee knew about his situation",
            "score": 1,
            "replies": []
        },
        {
            "author": "yeah_nahhhhhhh",
            "body": "Dude's premiums would have sky rocketed after saying that",
            "score": 1,
            "replies": []
        },
        {
            "author": "snowcroc",
            "body": "I actually first knew him through Chupacabra lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "OccludedFug",
            "body": "I loved him in ***Nothing to Lose***",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turicus",
            "body": "Seems weird the only two options were a breakthrough as a an actor or death. Getting a job like everyone else was out of the question?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jamesbrownscrackpipe",
            "body": "His kid's name? Finger...",
            "score": 1,
            "replies": []
        },
        {
            "author": "artguy55",
            "body": "mental health can be such a fragile thing",
            "score": 1,
            "replies": []
        },
        {
            "author": "BiteyMax22",
            "body": "One of BiteyMax's dumb moments in life was watching Breaking Bad and not putting together that Gus Fring was the guy that used to come into the Ice Cream shop I worked at and chit chat with us about acting.\n\nOne of my co-workers that I still talk too was super late to watch Breaking Bad and texted me \"WTF, you didn't tell me that our boy Giancarlo that used to come in and talk to us at (Ice Cream Store) had a huge freaking role it!\".\n\nDid not realize it was the same guy....",
            "score": 1,
            "replies": []
        },
        {
            "author": "AmericanUpheaval357",
            "body": "Geez",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hydra57",
            "body": "I remember seeing him in a few shows before his breaking bad role, it’s sad to hear he was struggling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VelveetaVoldemort",
            "body": "It must be that day for karma farmers. The harvest is ready.",
            "score": 1,
            "replies": []
        },
        {
            "author": "retrodanny",
            "body": "So... The plot of \"It's a Wonderful Life\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "sageleader",
            "body": "Wow that is shocking. If you ever hear him speak in an interview it's an absolutely religious experience. And I'm an atheist. Seeing him live on stage at Star Wars Celebration left me with so much hope for humanity. The guy is genuinely so positive and uplifting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "funtex666",
            "body": "Seems fitting he always plays a villain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Orikazu",
            "body": "Crazy. He's got chops. If he's in something I know at least he's going to nail it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "releasethedogs",
            "body": "How do you even arrange your own murder?",
            "score": 1,
            "replies": []
        },
        {
            "author": "psychcaptain",
            "body": "I liked his role in Community best.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Taggart451",
            "body": "Fun fact! I went to a con to get his autograph and I ended up standing next to him at the urinal.\n\nNo I did not say anything to him while we were standing there.\n\nI waited until we were washing hands. I said \"Your episode of [Ask Me Another](https://www.npr.org/programs/ask-me-another/1006282912/-hacks-giancarlo-esposito-donwill-bethany-van-delft) on NPR just aired this week and I listened to it before coming here!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrFrode",
            "body": "Kids need a dad who loves them far more than money. As a Dad, if you off yourself you abandon your post and leave your children to a colder world.",
            "score": 1,
            "replies": []
        },
        {
            "author": "four_ethers2024",
            "body": "That's such a dramatic way to go out 😭😩",
            "score": 1,
            "replies": []
        },
        {
            "author": "johnsmithjohnsonson",
            "body": "This is the dumbest thing I've ever heard no way this is real",
            "score": 1,
            "replies": []
        },
        {
            "author": "withbellson",
            "body": "I may be the only person who remembers Bakersfield P.D.  When Esposito showed up on Homicide I was like hey! it's the guy from Bakersfield P.D.!  (It also had Ron Eldard, Tony Plana, Chris Mulkey, and Brian Doyle-Murray and was canceled after one season.)",
            "score": 1,
            "replies": []
        },
        {
            "author": "brooklynrockz",
            "body": "Mr Esposito used to be a waiter at my favorite n y theatre hang out Curtain Up",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kayge",
            "body": "I'll always remember him from Do.the Right Thing.  \n\n\n[Why don't you go back to Massachusetts!](https://youtu.be/jc6_XgtOQgI?si=5jcRmRg7y1PNoqFx)",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlappinLips",
            "body": "Saw a movie recently where he played a character volunteering for a suicide game show. The movie was ass but it made me think of that story",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hulk_Crowgan",
            "body": "Dude is an all time great villain",
            "score": 1,
            "replies": []
        },
        {
            "author": "zobotrombie",
            "body": "Honestly, he would’ve been an amazing Prof X. Way to waste him in Captain America Brave New World, Marvel.",
            "score": 1,
            "replies": []
        },
        {
            "author": "antsaidthat",
            "body": "Adam Clayton Powell Jr in Godfather of Harlem, too. Another solid role.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nick_Hammer96",
            "body": "It's crazy that this gets posted once a damn month",
            "score": 1,
            "replies": []
        },
        {
            "author": "TryToHelpPeople",
            "body": "It’s amazing how acceptable we find that divorce bankrupted him and almost drove him to suicide.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kinda_Constipated",
            "body": "Just another reason not to get married. Sure you could have a bulletproof prenup but either way, you cannot trust a traditional marriage anymore. Probably why fewer people are getting married and more people are stuck in ongoing situationships. There's simply too much risk to get married.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Helldiver_of_Mars",
            "body": "Women kill.  Is what I got from this.  Run!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Schifty",
            "body": "afaik, life insurance covers suicide - this is a common misconception based on movie tropes",
            "score": 1,
            "replies": [
                {
                    "author": "Platypus-Man",
                    "body": "Guess that can vary by company, location and potential clauses.  \nChecked my insurance provider and another one (in Norway), both of them say that if the suicide is within one year of signing the insurance policy, there's either no payout or smaller payout than if it had been more than one year since signing.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Clevererer",
                            "body": "Unrelated, but I'm curious, how common is life insurance in Norway? \n\nI'd kind of assumed it was a particularly American layer of hell, but then I do forget how successful we are at exporting our layers of hell.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Clevererer",
                    "body": "Let's not pretend anything with insurance is universal, or that contracts aren't written with grey areas that only the highest paid lawyers can navigate.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "xX609s-hartXx",
            "body": "And then he got his face blown off in a drug war...",
            "score": 1,
            "replies": [
                {
                    "author": "noelg1998",
                    "body": "HOAHHH!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hannibaalism",
            "body": "glad he held through. my wife still references gus fring whenever she sees anything with half if it’s face blown off or missing lol",
            "score": 1,
            "replies": [
                {
                    "author": "firstfloor27",
                    "body": "Does that happen a lot?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "k0jir0_",
            "body": "And a man, a man provides. And he does it even when he's not appreciated, or respected, or even loved. He simply bears up and he does it. Because he's a man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dagglin",
            "body": "Did you know Steve buscemi was a firefighter at 9/11",
            "score": 1,
            "replies": []
        },
        {
            "author": "C_a_f_e",
            "body": "Here's your weekly reminder that Giancarlo Esposito were going bankrupt and considering suicide",
            "score": 0,
            "replies": []
        },
        {
            "author": "ProperPerspective571",
            "body": "Seriously though, have you seen many celebrities without a back story that either hits home or rattles you. It’s called marketing yourself.",
            "score": -1,
            "replies": [
                {
                    "author": "supermitsuba",
                    "body": "Could also be if you don't make it as an actor, you could starve.  Doesn't make it any less true.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CCLB43",
            "body": "Quit getting married fellas, that’s the lesson here.",
            "score": -4,
            "replies": []
        },
        {
            "author": "ItsSignalsJerry_",
            "body": "Why would you admit this",
            "score": -36,
            "replies": [
                {
                    "author": "Strawhaterza",
                    "body": "Probably to give hope to folks who might find themselves in a similarly dark position.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "ItsSignalsJerry_",
                            "body": "Perhaps. But I wouldn't put my family through the knowledge of it",
                            "score": -18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ninja6911",
                    "body": "admitting something like this makes them stronger and gives hope to other human beings",
                    "score": 12,
                    "replies": [
                        {
                            "author": "ItsSignalsJerry_",
                            "body": "Unless they don't have the same luck.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "MechaNerd",
                                    "body": "You seem to have missed the reason he overcame his suicidal thoughts. Its not because he became successful, it's because he gained clarity.\n\nI have had suicidal thoughts myself, and a big part of the thoughts were \"how can i get my family financiall stability\". I have gotten better *because i talked about my struggles*. \n\nMy family and i am still struggling with money, and i have bad days. In all likelihood I wouldn't be here if the stigma around mental health and suicide made people keep it to themselves. Talking about it is hard, not talking about it kills.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "ItsSignalsJerry_",
                                            "body": "That's what psychologists are for.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "MechaNerd",
                                                    "body": "Funny, it's psychologists that encourage speaking to loved ones about things like this.\nBut you're probably right, let's isolate us selves from our loved ones and shame people for speaking about their experiences",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "ItsSignalsJerry_",
                                                            "body": "Yes, that's exactly what I'm advocating.",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "MechaNerd",
                                                                    "body": "Certainly seems so from your other comments. You don't seem to spare an ounce of empathy or thought before needing to have your opinion known, so I'm leaving this conversation.\n\nHave the day you make for yourself.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ItsSignalsJerry_",
                                                                            "body": "You're exactly the same. Just fyi.",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MechaNerd",
                                                                                    "body": "Really gonna pull the cliché [villain](https://youtu.be/20B4Dvk_9cY?si=CCf9yqoQMqP4aRIU) line?",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ItsSignalsJerry_",
                                                                                            "body": "I thought you were done.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mooch_the_cat",
                    "body": "Why not? It’s the exact same reason I quit drinking. I realized that if I didn’t stop I wouldn’t see my kids grow up. There‘s no shame in admitting to having despair or an addiction.   Good for him for handling it and sharing his story",
                    "score": 17,
                    "replies": [
                        {
                            "author": "ItsSignalsJerry_",
                            "body": "Dude, he was planning suicide. What if things didn't turn around (as it might not for others), would he have done it? Is that a moral message? Would I want my children to know about that?\n\nIt's not the morality tale you think just because you like the guy.",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "mooch_the_cat",
                                    "body": "Actually, I don't know the guy and have never watched Breaking Bad. I only recognize him from the \"We are not the same\" meme.  And if I considered suicide and overcame my struggle, I would definitely want my children to know that even in the darkest times, there is hope for a better future.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "ice-cold-baby",
                                            "body": "I think this guy is projecting his insecurities",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "ItsSignalsJerry_",
                                            "body": "Did you plan to have yourself killed to collect insurance money for them?\n\nWould you tell them that?",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "OzoneTrip",
                                                    "body": "As far as I can tell, he didn’t plan to kill himself because he wanted to collect insurance money for his kids. He wanted to kill himself due to other reasons and also make sure his kids are taken care of via the insurance payout.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "ItsSignalsJerry_",
                                                            "body": "Just going by the title",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}