{
    "title": "TIL that it is unclear where Wallace Fard Muhammad; founder of the Nation Of Islam is from, when he was born, what his ethnicity was, or where he disappeared to in 1934.",
    "author": "MajesticBread9147",
    "subreddit": "todayilearned",
    "rank": 17,
    "score": 352,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 48,
    "url": "https://en.wikipedia.org/wiki/Wallace_Fard_Muhammad",
    "id": "1je3wzu",
    "selftext": "",
    "comments": [
        {
            "author": "Mama_Skip",
            "body": "Surprised that the founder of the nation of Islam looked far more white than black and was probably of Indo-Euro descent. \n\nAren't they vehemently racist toward even other POC nowadays? Because NOI teaches that Shabazz led the true race into Africa to become ubermensch? Or something",
            "score": 100,
            "replies": [
                {
                    "author": "puppies_and_rainbowq",
                    "body": "Nah, their stance is everyone who isn't white is great, and everyone who is white is evil. They used to be black only, but changed their stance in the 60's or 70's. They thought about allowing white people in maybe 10 or 20 years ago, but then changed their minds and went back I think.\n\nhttps://en.m.wikipedia.org/wiki/Nation_of_Islam",
                    "score": 52,
                    "replies": [
                        {
                            "author": "Fight-Me-In-Unreal",
                            "body": "iirc, the only white people they're cool with nowadays are Scientologists.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Traditional-Ride-824",
                            "body": "They did Diskuss of letting white people in?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "scsnse",
                    "body": "It’s my understanding that while there technically is a hierarchy (essentially, African/black people are the only non inbred/mutated humans), they see especially Arabs and Asians as slightly altered people, while white people are of course infamously the result of generations of genetic modification by the outcast Yakub.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AgentDoty",
            "body": "Just so everyone is clear Nation of Islam has nothing to do with Islam or Muslims. These guys are black supremacist racists who believe the white man was created by a black scientist named Yakub 6000 years ago.",
            "score": 180,
            "replies": [
                {
                    "author": "KimJongUnusual",
                    "body": "IIRC Malcolm X went on his hajj to Mecca, and the response from other Muslims about his theology was “dude what the hell are you talking about”",
                    "score": 87,
                    "replies": [
                        {
                            "author": "AgentDoty",
                            "body": "That’s right Malcolm X became a real Muslim.\n\n\n——\n\n\nShortly after my arrival in Jeddah, I was met by Prince Muhammed Faisal who informed me that his illustrious father, his Excellency Crowned Prince Faisal had decreed that I be that I The ruler of Arabia be his Guest. What has happened since then would take several books to described, but through the ***** of his Excellency I have since stayed in ***** hotels in Jeddah, Mecca, Mina – with a private car, a driver, a religious guide, and many servants at my disposal.\n\nNever have I been so highly honored and never had such honor and respect made me feel more humble and unworthy. Who would believe that such blessing could be heaped upon an American Negro!!! (But) in the Muslim World, when one accepts Islam and ceases to be white or Negro, Islam recognizes all men as Men because the people here in Arabia believe that God is One, they believe that all people are also One, and that all our brothers and sisters is One Human Family.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "DevelopmentSad2303",
                                    "body": "Yeah, his separation from the NOI is supposedly why they killed him. Assuming you don't believe in any sort of power structure having a motive to kill a black nationalist at the time",
                                    "score": 23,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Feed_Your_Curiosity",
                    "body": "Yeah, the name of this group is unfortunate. They do not represent the bigger religion AT ALL. Feels more like a Scientology type group than an offshoot of a major religion.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "ThurloWeed",
                            "body": "they've been taking auditing classes recently",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "georgito555",
                            "body": "Tbf it's not like the religion has a good image anyways",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HardPass404",
                    "body": "Can Yakub try again? I think his design was faulty. My white back hurts too often.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "italrose",
                            "body": "What do you expect an evil back to do? Bring you pleasure? Yakub ain't about that engineering.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "SulaimanWar",
                            "body": "Can’t do, he blew up the moon along with his lab on it",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "valkyrjuk",
                            "body": "Your posture is too good. Try hunching more. Works wonders.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FoxMcLOUD420",
                    "body": "The picture of Yakub on Wikipedia tells you all you need to know about these cuckoo people. If I’m not mistaken they are somehow tied to Black Hebrew Israelites right? Another group of model citizens",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "SchillMcGuffin",
                    "body": "But distinct from the Black Hebrew Israelites, who also match that rough description.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "Turicus",
                    "body": "So somebody could genetically engineer people 6000 years ago, but then we all just forgot about it? Lol",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Peligineyes",
                            "body": "He supposedly did it the old fashioned way via inbreeding. But he also lived for centuries so it's all bullshit anyway.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tanfj",
                    "body": "> Just so everyone is clear Nation of Islam has nothing to do with Islam or Muslims. These guys are black supremacist racists who believe the white men was created by a black scientist named Yakub 6000 years ago.\n\nPut them in the same mental box as Scientology. They're a Dopey Semi-Religious Cult, that you do not wish to join...",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Kaiserhawk",
                    "body": "So Mormonism for Black people?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SulaimanWar",
                            "body": "More like Scientology",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Takashi_malibu",
                    "body": "aaaaah🫥",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "heilhortler420",
                    "body": "Saying you're a member of NOI will most likely get you executed in an Islamic country that executes for heresy like Saudi or Iran",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "s-mores",
                    "body": ">These guys are black supremacist racists who believe the white man was created by a black scientist named Yakub 6000 years ago.\n\n\nThey make a compelling case.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Greene_Mr",
            "body": "He might be Maori; he might be from Afghanistan -- we don't KNOW! \n\nHe's like Cliff Curtis!",
            "score": 13,
            "replies": []
        },
        {
            "author": "bookworm1398",
            "body": "He was a bot?",
            "score": 16,
            "replies": []
        },
        {
            "author": "Jaded_Customer_8058",
            "body": "That would be a good documentary",
            "score": 9,
            "replies": []
        },
        {
            "author": "bdog556",
            "body": "Portrayed well in Jeffrey Eugenides’ book Middlesex.",
            "score": 2,
            "replies": [
                {
                    "author": "italrose",
                    "body": "I've read the book but don't remember him in it. Great book though.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "agreeingstorm9",
            "body": "Those mug shots on the article don't even resemble each other IMO.",
            "score": 2,
            "replies": [
                {
                    "author": "aeemmmoor",
                    "body": "He went by multiple pseudonyms, and some of the mugshots are only suspected to be of him. I went on a deep dive the other day, he was turbo-weird at the very least, and lots of the records of his life were contradictory or incomplete. So it makes sense that the mugshots would be odd as well.\n\nEdit: fwiw though, I think all the mugshots currently available are of the same guy. The lip and ear shape are super similar.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Greene_Mr",
                    "body": "No, they do; his hair is just different lengths.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "agreeingstorm9",
                            "body": "His facial shape seems very different.  Maybe he's just thinner in the second picture.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Greene_Mr",
                                    "body": "The *\"Nation of Islam-approved\"* one is the one that looks the most different, to me.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bebopbrain",
            "body": "I thought he was a Fuller Brush salesman.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Matman161",
            "body": "[sigh ](https://youtu.be/nIGceyJICwo?si=LK0kDp43H4aippHM)",
            "score": 1,
            "replies": []
        },
        {
            "author": "AgreeableAnus",
            "body": "Thanks for inventing this useless crap",
            "score": -7,
            "replies": []
        },
        {
            "author": "Abhi_Jaman_92",
            "body": "Should've called him Cotton-Eyed Joe.  \nEDIT: Shoot, didn't know the song had a racist connotation. Totally not my intention.",
            "score": -15,
            "replies": [
                {
                    "author": "k40z473",
                    "body": "Its racist? TIL",
                    "score": 0,
                    "replies": [
                        {
                            "author": "STK__",
                            "body": "It’s about the effects of methanol from moonshine on the eye ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "k40z473",
                                    "body": "Ok cool thanks",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Hvarfa-Bragi",
                                    "body": "..is that a racial thing?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SoyMurcielago",
                                            "body": "Only if you’d been married a long time ago\n\nBut where did you come from where did you go?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheDarthWarlock",
                    "body": "Coulda swore it was about getting std testing ",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}