{
    "title": "Vapor barrier when finishing an attic",
    "author": "LeDeau",
    "subreddit": "DIY",
    "rank": 7,
    "score": 149,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/gallery/1jdix3j",
    "id": "1jdix3j",
    "selftext": "Hello all, I'm in the middle of finishing my attic, approximately 250 sq ft as framed. \n\nI'm in the Chicago land area and I'm thinking about the need for a vapor barrier between the insulation and the drywall. The exposed area below the angled walls (left 4 ft, right 3ft) is insulated, but will not be drywalled. We have vent chutes in every bay between the soffit and the upper unfinished part (\"new attic\") and the roof is well ventilated.\n\nIf needed, why and what's the best way given the layout?",
    "comments": [
        {
            "author": "Square-Tangerine-784",
            "body": "I either use vapor barrier and unfaced insulation or I use faced insulation and install it over the framing edge so it’s a vapor barrier. Why go inside the bays? You lose a lot of heat by not covering the framing",
            "score": 40,
            "replies": [
                {
                    "author": "fandk",
                    "body": "I never seen this faced insulation before and sort of got the same thought as you. Feels weird to not put the beams behind the vapor barrier, but also Im not from the US and not really familiar with climate or code/ regulations.\n\nIn Sweden the go-to is to put unfaced insulation in the bays, vapor barriers that covers everything and overlaps 15cm with taped seams. And then some 45x45mm wood across where you run your wires and also add 45mm more insulation.\n\nHere you dont put vapor barrier at all and have clean beams for drywall or sheets. \n\nWith the added benifit that you dont puncture the barrier when hanging stuff on the wall!",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "unibox",
                    "body": "I am guessing so you don't loose any more headroom or it is a moderate climate.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Square-Tangerine-784",
                            "body": "Headroom? I’m talking about the insulation paper. Maybe a 1/16”?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "FingernailToothpicks",
                                    "body": "Technically I think that's how it's supposed to be installed but many install inside the bay to allow use of glue for drywall.  Had a contractor get annoyed at me for tracking insulation of the paper to the leading edge. Told them to deal with it.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Square-Tangerine-784",
                                            "body": "Yes, I’m in New England and have never glued drywall. The only time we have that option is when the insulation is spray foam and the framing is clean. The way this insulation is done is leaving a cold air space to the drywall and exposing the framing/sheathing to moisture from the living space.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "LeDeau",
                                            "body": "Not planning to glue, but purposefully installed this way because it's \"the right way\" from what I know and always been told from manufacturer and also preferred by drywallers",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "FingernailToothpicks",
                                                    "body": "Eh. Likely depends on area and product. Reno is looking great so far! Wish you luck!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "unibox",
                                    "body": "Haha. I clearly misunderstood.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Square-Tangerine-784",
                                            "body": "No problem:)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "maxwithrobothair",
            "body": "[Everything you need to know is in here](https://insulationinstitute.org/im-a-building-or-facility-professional/residential/installation-guidance-2/moisture-management/vapor-retarders/)",
            "score": 26,
            "replies": [
                {
                    "author": "Imatros",
                    "body": "This. It's region dependent.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "idownvoteanimalpics",
            "body": "It's a major award!",
            "score": 35,
            "replies": [
                {
                    "author": "TheHumanoidTyphoon69",
                    "body": "Fra-gille must be Italian",
                    "score": 17,
                    "replies": [
                        {
                            "author": "karmannsport",
                            "body": "I think that says fragile, honey.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tdbg22",
            "body": "I always understood the purpose of the vapor barrier was to keep water vapor out of the walls. Why? So it doesn’t condense in there when it’s cold outside. Hopefully the vents remove any that does make it through. I would cover the entire envelope with plastic, sealing around outlets and perforations. I hope the flat part at the top is getting insulation too!",
            "score": 4,
            "replies": []
        },
        {
            "author": "ItsGermany",
            "body": "Vapor barrier is cheap, tack it up all over the insulation, you do not want mold behind your drywall. Everywhere there is a warm to cold transition you will want it, I prefer the white papery kind that has a breathability factor compared to plastic. In a roof environment plastic becomes brittle and cracks over the years during heat cold cycles.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Miyuki22",
            "body": "Just remember that the moisture needs somewhere to go else you are ensuring mold growth.\n\nAirflow is the reason why so many wooden structures last centuries in Asia, compared to shoddy western buildings that fail after 20 years.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Jakson_7",
            "body": "Use baffles between insulation and roof sheathing.",
            "score": 6,
            "replies": [
                {
                    "author": "unibox",
                    "body": "Isnt that only true if you have access to the soffit so the air can flow from top > bottom/bottom >top?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "_boogiesaurus",
                            "body": "https://buildingscience.com/sites/default/files/2010_Straube_Vented_Unvented_Roofs.pdf",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeDeau",
                    "body": "Correct, confirming they are installed on each bay",
                    "score": 2,
                    "replies": [
                        {
                            "author": "StretchConverse",
                            "body": "The next part of that is to make sure there is an equal amount of exhaust to pull the air in from the soffit. Think either 50/50 exhaust/intake or 49 exhaust/51 intake. Never more exhaust than intake, but you should plug up those can vents and put in a ridge vent",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pilot_on_autopilot",
            "body": "What's going on with that pony wall? Two studs nailed into blocking?",
            "score": 2,
            "replies": [
                {
                    "author": "LeDeau",
                    "body": "Not sure what or where you are referring to",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LeDeau",
            "body": "For additional info, the area behind and underneath the pony wall line is intended to be used for storage purposes and there will be sliding doors, which makes this a bit more challenging, I think. \n\nIf I'm understanding most, it seems the consensus is to start the vapor barrier there at the floor level, come up and outside the pony wall, up the angled wall, across the ceiling, and the the same thing down the other side? \n\nThen cut holes in the ceiling and walls for outlets, lighting, HVAC, ceiling fan, etc.?",
            "score": 2,
            "replies": [
                {
                    "author": "Wartburg13",
                    "body": "We are having the exact same thing done to our attic in Chicago and had rafter vents put in before the insulation between every rafter to vent into the space at the peak of the roof.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LeDeau",
            "body": "In case anyone is curious where we started from, see below: \n\nhttps://www.reddit.com/r/DIY/s/6uGzPSsnYL",
            "score": 1,
            "replies": [
                {
                    "author": "qdtk",
                    "body": "Did you end up getting the structure checked out? There are some big red flags with the ability for that structure to act as a floor.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LeDeau",
                            "body": "Thank you. Yes, checked multiple times from the original drawings, structural engineer, and multiple experienced professionals (e.g., GC, roofers, framers) and we determined that there were two I beams to support the weight in the walls underneath (garage) and spanningthe floor, one you could see in the original. We added collar ties on each rafter to support the top and 3/4 OSB to tie the bottom together to prevent the walls from bowing out, which was the main concern that I heard. The pony wall also adds additional support. \n\nAlso a big part of the original feedback was folks thought they were seeing 2x4 when they were looking at 2x8 and 2x10. We ripped the 2x4 to bring the 2x8 to 2x10 levels and put OSB on top\n\nWhat are you seeing that's concerning you?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "qdtk",
                                    "body": "Nicely done. If you did all that, you’ve gone much deeper than what could be seen in the photos. I was only talking about red flags in the older photos. New stuff looks good! Enjoy your new space!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "quazmang",
            "body": "Is that a Christmas Story lamp?",
            "score": 1,
            "replies": [
                {
                    "author": "LeDeau",
                    "body": "Yep!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "JrNichols5",
            "body": "Dumb question here, but do you not have a ridge vent? And or soffit vents? Are those two turtle vents the only ventilation you have on that ceiling? If so, I’d suggest you re-evaluate your insulation plan by either spray foaming the entire ceiling deck or installing more ventilation. This is gonna mold like crazy if you don’t. \n\nEither way, I’d definitely suggest a smart vapor barrier like an Intello or Siga to help mitigate vapor issues.",
            "score": 1,
            "replies": []
        }
    ]
}