{
    "title": "Underlayment for vinyl flooring.",
    "author": "IoveYouBaby",
    "subreddit": "DIY",
    "rank": 14,
    "score": 4,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/DIY/comments/1je02dv/underlayment_for_vinyl_flooring/",
    "id": "1je02dv",
    "selftext": "Hello everyone, my entire house has a plywood subfloor. I was wondering if I should install underlayment if I am using lifeproof vinyl flooring. The floor has imperfections and has seen its better days. Or should I just install the vinyl flooring over the plywood.",
    "comments": [
        {
            "author": "BourbonJester",
            "body": "usually at least a vapor barrier\n\nI'd be more concerned with getting the subfloor flat, if there's humps and dips the lvp won't lay correctly. it's more important the cheaper product you use cause the joints are thinner and more prone to coming apart or snapping under repeated fatigue from hollows underneath\n\nit's worth the effort sanding out high spots and filling dips more than 1/8\" over 6', which is really flat. you'll want a 6-8' level to check flatness, longer the better \n\na good prep job is the floor job, might take twice the time of the finish floor installation if your subfloor is really out of whack",
            "score": 2,
            "replies": []
        },
        {
            "author": "piedpipershoodie",
            "body": "You know, flooring is such a pain in the neck that it's worth doing it right the first time if you can. You can put LVT (or LVP, I guess?) straight over some types of floor, like rollout vinyl, but with plain plywood, you'll want to even out the floor as best you can and then add underlayment for moisture protection and to minimize up and down motion. Floating floors have lots of benefits, but one thing that's SUPER annoying about them is the way they can buckle and wobble and move when you walk on them if the floor isn't even. Like the other commenter said, that's really worth doing first.\n\n(Also, heads up about that flooring: lots of it is fine. There is a particular LVT I've used that feels very plasticky with tons of pinhole indentations, like one of those old holographic bookmarks. Do not get that. It looks like a white marble style, I don't know if the brand is lifeproof, but any brand could probably make it. It's a nightmare to clean. The wood style stuff is probs totally fine.)",
            "score": 1,
            "replies": []
        }
    ]
}