{
    "title": "Remove Rust From Steel in Shower and Seal for Future",
    "author": "ScottyKAllTheWay",
    "subreddit": "DIY",
    "rank": 18,
    "score": 0,
    "upvote_ratio": 0.33,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/DIY/comments/1je6jl4/remove_rust_from_steel_in_shower_and_seal_for/",
    "id": "1je6jl4",
    "selftext": "\nI have a slate bench in my shower that is supported by 3 steel “L” bars about 1/2” thick. They’ve begun to rust pretty bad, and drip brown water onto the shower floor with some small rust shards. I want to clean off the existing rust and then somehow seal the bars to prevent from re-occurring.  The bars are not visible so the finished product doesn’t need to be pretty, just effective. Ideas?",
    "comments": [
        {
            "author": "mcarterphoto",
            "body": "I'd remove them if possible, use an orbital sander to smooth them out, and then several coats of one of the Rustoleum rust-converter sprays in a can. Prep is a big deal, clean them well and wipe down with alcohol.\n\nI have steel lintels over all of my windows (1930's brick house), and wire-brushing them followed by Rustoleum and then exterior house paint has held up for close to 2 decades.",
            "score": 2,
            "replies": [
                {
                    "author": "ScottyKAllTheWay",
                    "body": "Thanks!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShanghaiNick",
            "body": "Clean the best you can then spray it with Ospho, let dry then clear coat it with appliance epoxy or a decent clear coat paint from automotive.",
            "score": 2,
            "replies": [
                {
                    "author": "ScottyKAllTheWay",
                    "body": "Thanks!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Antique_Grapefruit_5",
            "body": "Barkeepers friend is absolutely amazing for removing rust!",
            "score": 1,
            "replies": [
                {
                    "author": "mcarterphoto",
                    "body": "But the rust is just gonna come back...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ScottyKAllTheWay",
                    "body": "@mcarterphoto, what if the steel\nbrackets were treated with something after the rust removed with Barkeepers?  @SanhaiNick suggests Ospho above.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ScottyKAllTheWay",
                    "body": "Thanks!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Taro-Minute",
            "body": "Hi, tbh it may be quicker and easier to replace them or have ones fabricated. Stainless steel bar isn't too expensive these days and you can copy the dimensions, screw holes etc off one of the existing brackets...",
            "score": 1,
            "replies": [
                {
                    "author": "ScottyKAllTheWay",
                    "body": "Thanks. But these are screwed into additional studs placed when the shower was framed for the exclusive purpose of securing the bench. The wall side of the steel bracket was then covered with green board and tile. So replacing the steel bars would be a pretty major project.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "the-cake-is-no-lie",
            "body": "Yeah, remove them and have them replicated in aluminum or, depending on how much load they're carrying, some sorta plastic..",
            "score": 1,
            "replies": []
        }
    ]
}