{
    "title": "Aww poor thing",
    "author": "waffleste",
    "subreddit": "tumblr",
    "rank": 16,
    "score": 7463,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 52,
    "url": "https://i.redd.it/f2kx4izkrboe1.jpeg",
    "id": "1j9v00a",
    "selftext": "",
    "comments": [
        {
            "author": "kodakowl",
            "body": "Humans will pack bond with ANYTHING",
            "score": 497,
            "replies": []
        },
        {
            "author": "DemonFromtheNorthSea",
            "body": "As a kid, I always assumed bottleflies were weird green bees because flies have no buisness being that big.",
            "score": 201,
            "replies": [
                {
                    "author": "AshuraSpeakman",
                    "body": "They've been hitting the bottle so hard they have a beer thorax.",
                    "score": 71,
                    "replies": []
                }
            ]
        },
        {
            "author": "Camillafan1",
            "body": "Do things like that really happen or is that a gimmick blog",
            "score": 632,
            "replies": [
                {
                    "author": "Zaiburo",
                    "body": "Some degenerates are really out there touching grass. I see them from my window.",
                    "score": 851,
                    "replies": [
                        {
                            "author": "Camillafan1",
                            "body": "No I mean I get that but like hearing one singular bug? That's like ..??? Idk can't imagine that",
                            "score": 164,
                            "replies": [
                                {
                                    "author": "Zaiburo",
                                    "body": "I can't speak for the OOP but my town was built on a drained swamp, from time to time you hear some primeval bug that sounds and looks like Mothra angry cousin.",
                                    "score": 390,
                                    "replies": [
                                        {
                                            "author": "SassyTheSkydragon",
                                            "body": "I think OOP is involved in some entomologist stuff. I remember them posting about research on different rarer fairy shrimp, if my memory doesn't deceive me\n\nEdit: Oop is indeed an Entomologist: https://mossworm.tumblr.com",
                                            "score": 125,
                                            "replies": []
                                        },
                                        {
                                            "author": "Camillafan1",
                                            "body": "Ok noo German wildlife is a bit more tame haha, the biggest think of off the top of my head would be a cicada I guess, hornets are also nasty but like ... Yeah",
                                            "score": 47,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "mediocreguydude",
                                    "body": "Bugs wings can be really really loud\n\nYou ever hear a singular cicada? Them fuckers are LOUD",
                                    "score": 77,
                                    "replies": []
                                },
                                {
                                    "author": "No-Atmosphere-1566",
                                    "body": "Big bugs with big wings like dragonflies, horse flies, wasps, and botflys have very audible buzzing sounds.  Especially if they're freaking out.\n\nSomeone's never had a wasp dive their head smh",
                                    "score": 49,
                                    "replies": []
                                },
                                {
                                    "author": "Puzzled-You",
                                    "body": "Have you never heard a single cicada? They are pretty loud on their own",
                                    "score": 57,
                                    "replies": [
                                        {
                                            "author": "Camillafan1",
                                            "body": "Yeah I know cicadas but they don't count, that sound is rather distinct I think. I don't know what a bottlefly is tho, Google just shows pics of regular flies so idk",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "elanhilation",
                                                    "body": "they’re just like houseflies but a little bit larger. regular house flies can already buzz surprisingly loudly, so a somewhat larger one being audible to someone with decent hearing isn’t entirely implausible \n\ninternet’s got a lot of liars, though",
                                                    "score": 20,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Nalwyn603",
                                    "body": "Bottleflies can get pretty big and are very noisy; I've had a couple get stuck in my house and I could hear them from across the room",
                                    "score": 27,
                                    "replies": []
                                },
                                {
                                    "author": "sweetTartKenHart2",
                                    "body": "If the surrounding area is quiet enough and you’re not near like a super busy street or anything that’s totally easily plausible",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "producktivegeese",
                                    "body": "I can. I don't even have to imagine. Just depends on the bug and the noise level of the area. At night one mosquito is loud enough to keep me up, they're not even that big here. (Easy fix is running a fan, blow the suckers away and the sound from it is at least consistent)",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "TheArmoredKitten",
                                    "body": "People don't want to talk about this, but basically everybody who lives in an urban environment has some degree of hearing damage. Modern life is loud as fuck.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Key-Week-7189",
                                    "body": "Have you heard a bottlefly in distress?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mint_lawn",
                    "body": "This person is a big bug fan, so yeah, likely happened. You'd be surprised though, insects can be pretty loud.\n\nEdit: I honestly think you shouldn't be downvoted, it's a valid question. No one is born knowing these things.",
                    "score": 119,
                    "replies": [
                        {
                            "author": "Camillafan1",
                            "body": "But one bug can't be that loud and distinct right ??? Like don't get me wrong I'm not a hater or anything, I just figured that when walking by a field or something that that noise must be made by HELL of a lot of bugs, is it not???I probably figured like maybe more than 100? Maybe a thousand idk bugs???And I'm just thinking hearing one singular distressed bug in there ??",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "waffleste",
                                    "body": "Oh no they can be distinct, you wouldn't say the buzzing of a bee and the buzzing of the fly is the exact same.",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "Camillafan1",
                                            "body": "Ahhh I get what u mean, ok yeah I see",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Eriiya",
                                    "body": "I feel like u have never been outside before lol",
                                    "score": 54,
                                    "replies": [
                                        {
                                            "author": "Camillafan1",
                                            "body": "But I'm even a boyscout !! clueless and high most times, yes, but ...???huh?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "jasminUwU6",
                                                    "body": "It's probably just that there aren't many loud bugs in your local area",
                                                    "score": 20,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "mint_lawn",
                                    "body": "We get small cicadas where I live, around the size of a fingernail, that are just as loud as normal ones. I could find an individual one pretty easy. Centipedes get large here too, and on the right material you can hear their legs moving. Tarantula hawk wasps are pretty loud too, mabe about the level of a drone. \n\nMaybe you live in an area where insects aren't particularly loud?",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "PikaBooSquirrel",
                                    "body": "Once, this bee had a beef with me over the summer and EVERY morning at like, 7 am, it would start buzzing and slamming into my window screen thing to the point it would **wake** me up. It wouldn't leave after doing this for 5+ minutes, so I had to get a spray bottle and hose it down. This basically became our routine for the summer.\n\nAnother time, IDK if it was a queen ant or a carpenter ant, but it was a LARGE ant about an inch in length. It was crawling on a chair inside my house. I started recording it. This little shit lost its grip and fell to the ground and made an audible thud sound that my phone picked up (I was a good 6+ feet away).\n\nBugs have a greater exertion over the physical world than I would like considering the size of their bodies.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cantaloupelion",
                    "body": "i rescued a bee from a old spider web today. bee was like ;~; and had two legs caught up.\n\nus bug rescuers are out here 😤😤😤\n\n(also i was at work, so it beat actually doing my job)",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Camillafan1",
                            "body": "Omg random bug rescue missions are my favorite at work too! In my case it's often spiders (I know spider arnt bugs I know )",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Camillafan1",
                            "body": "Omg random bug rescue missions are my favorite at work too! In my case it's often spiders (I know spider arnt bugs I know )",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "runetrantor",
            "body": "Maybe the one time in history someone heard buzzing and wanted it to be a wasp.",
            "score": 12,
            "replies": [
                {
                    "author": "Bicc_boye",
                    "body": "*Bottle*fly",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Seys-Rex",
            "body": "Nothing in the world could convince me to save a botfly.",
            "score": 132,
            "replies": [
                {
                    "author": "DashingDoggo",
                    "body": "Bottleflies are different from botflies",
                    "score": 231,
                    "replies": [
                        {
                            "author": "Seys-Rex",
                            "body": "I see now I have misread the post",
                            "score": 122,
                            "replies": [
                                {
                                    "author": "OutAndDown27",
                                    "body": "I had the exact same reaction because I misread it in the exact same way",
                                    "score": 61,
                                    "replies": []
                                },
                                {
                                    "author": "DashingDoggo",
                                    "body": "Np lol",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "beaverhacker",
                            "body": "botflies are the ones that lay eggs under your skin right?",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "DashingDoggo",
                                    "body": "Yeah, that's what they are know for",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "beaverhacker",
                                            "body": "As a strayan, I'm more afraid of those than any spiders down under",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "61114311536123511",
                                                    "body": "understandable. at least most of the scary shit you have will just cause pain or kill you dead. but laying fucking EGGS?? In my SKIN?? No. Fucking. Thank. You.",
                                                    "score": 18,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "McAllisterFawkes",
            "body": "how does one remove something from a fly's wing without damaging the wing",
            "score": 8,
            "replies": [
                {
                    "author": "Force_Glad",
                    "body": "Very carefully",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Existing-Antelope-13",
            "body": "I thought this was a pokemon thing at first 🧍‍♀️🤦‍♀️",
            "score": 2,
            "replies": []
        },
        {
            "author": "AmbulatoryPeas",
            "body": "This subreddit is always and has always been exactly my speed. \n\n…I almost wish I understood how to use real tumblr",
            "score": 2,
            "replies": [
                {
                    "author": "sanzako4",
                    "body": "It's really easy to setup. The difficult part is to get the content you want, because it's not ordered in any recognizable way, and searching for specific stuff can be really challenging.\n\n\nYour best chance is to find a blog that you can vibe with, and follow it. Do it a dozen times and maybe your dashboard will have everything you want and more. ",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}