{
    "title": "AITA for refusing to stop speaking Hindi in my own home after my husband's ex-wife asked me to?",
    "author": "Real-Garlic5819",
    "subreddit": "AITAH",
    "rank": 3,
    "score": 1600,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 362,
    "url": "https://www.reddit.com/r/AITAH/comments/1je3ux8/aita_for_refusing_to_stop_speaking_hindi_in_my/",
    "id": "1je3ux8",
    "selftext": "So I (32,M)  living in London and currently married to my husband (33,M) for 5 years now. He had been married to a woman Erica before me and they have a daughter together, Sophie (8 f). Sophie lives with us because  of the custody arrangement. Something of importance here is that I am of indian descent,  And in 2022 my husband and I , we welcomed twin boys through IVF, so I teach my children Hindi and talk to them in Hindi, because it's important to me. I am raising them to be bilingual. But since Sophie lives with us, she also picked up on my Hindi words. Last week Erica had come for dinner during which Sophie said some random words in Hindi. I didn't even know she had picked up on it. Anyway, after we put the kids to bed, Erica said to me, \"I would appreciate it if you don't teach the kids that language Sophie was speaking at dinner.\" So I said, \"I am not teaching Sophie anything, I talk to my kids in Hindi because I want to raise them to be Bilingual and it was important to me.\" Then Erica said, \"But Sophie is there too, so maybe limit it or talk to the boys in Hindi when she is not around.\" I said, \" I don't want to be treated like a prisoner in my own house and I am not doing anything wrong. It's my culture and I want to pass it down. And if you have a problem, then you should take full custody of Sophie.\" Then Erica started crying and left. Now my husband is mad at me because he thinks that Erica will take Sophie away from him. He wants me to apologise, but I don't think I am wrong. So, AITA?\n\nEdit: hi I read some comments and i think that my full custody thing is being misinterpreted because of the way I wrote it. What I meant was that if she had a problem with it she should take more responsibility of Sophie because she usually bails on Sophie even on days she agrees and stuff and I apologised to her for saying it like that and clarified it. But she wants me to not talk to the kids in Hindi because she doesn't want her daughter learning \"that\" language. She had also said a lot of other racist stuff that I missed \n\nUpdate 1: Hi so I read a few comments and I do understand that what I said about custody was out of hand and makes me the ah, but I had realised it the moment I said it and clarified my stance and apologised. About why Erica was at dinner, we usually have a dinner together ever since the Boys were born bec she would be a part of Sophie's life and inadvertently my boys too, so that's why we agreed for dinner twice a month. I was not even talking in Hindi at the dinner table, we were talking about something and Sophie said, \"Offo\" (which is Hindi for oof! And that is what Erica noticed. But I think most of you are right, I should talk to Erica. And my husband did defend me but I think he got upset only when the custody thing was being questioned. \n\nUpdate 2: most of you seem to think I am a woman but I am a man. My husband and I are a gay couple. He is bi",
    "comments": [
        {
            "author": "Dismal-Detective-737",
            "body": "No. Bilingual is one of the greatest gifts you can give to someone and it's infinitely easier when they're young. No reason Sophie can't be bilingual too.",
            "score": 2034,
            "replies": [
                {
                    "author": "clipsje",
                    "body": "Absolutely this. I'm raised bilingual because of the location where I live, border with Germany, and it's so easy to switch if I'm in Germany. There is nothing wrong with learning more than one language, and I even have wished I could learn more languages. \n\nOk, I'm multilingual now, because I learned English in school. But I would have loved to learn more.   \nSo be proud that you can give Sophie the chance to learn Hindi. Her mother should be happy she is learning instead of being a \\*ss.",
                    "score": 453,
                    "replies": [
                        {
                            "author": "rabbithole-xyz",
                            "body": "NL/D?",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "clipsje",
                                    "body": "Jep :-)",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "rabbithole-xyz",
                                            "body": "I used to just over the border from Venlo. I understand a lot of Nederlands, but can't really speak it. But I've had perfectly nice conversations with people speaking dutch, and me speaking german or english.",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "clipsje",
                                                    "body": "Ich bin ein Nordlicht ;-)   \nTranslation for the rest, I'm from the north of the Netherlands.   \nA lot of Germans here also understand Dutch, but don't speak it. Dutch is a difficult language. I don't mind, I just switch hahaha.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "rabbithole-xyz",
                                                            "body": "Aaah, ich hab in NRW gelebt, bin britin. I wish I had a third or fourth language. \n\nDich könnte ich wenigstens verstehen, im Gegensatz zu vieler meiner jetzigen österreichischen Mitbürger, lol.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pristine_Job_7677",
                    "body": "Right? I lament all the time not learning Polish from my grandmother.  I would be thrilled if my kids learned a second language- any language. Huge benefit to growing brain and further education/employment opportunities.",
                    "score": 94,
                    "replies": []
                },
                {
                    "author": "Old_news123456",
                    "body": "why wouldn't Sophie want to speak her brothers' language? It seems cruel to refuse to teach her and keep her ignorant.  she's clearly interested and smart enough to pick it up without instruction.\n\nlearning multiple languages at a young age makes you smarter. It does wonders for the brain. that woman should be grateful that you provide a stable, loving home where the tepmom doesn't exclude Sophie.\n\n  \nthe problem isn't learning a Language....its racism. Sophie has the right to be included if she wants to. not excluded because she has a selfish mom.\n\n  \nNTA!",
                    "score": 142,
                    "replies": [
                        {
                            "author": "sadcrocodile",
                            "body": "I'd be fucking stoked if my hypothetical kid somehow managed to learn Hindi. Even if it doesn't directly relate to their future academic or business life a huge chunk of the world speaks Hindi, it's useful to know multiple languages.",
                            "score": 70,
                            "replies": [
                                {
                                    "author": "Old_news123456",
                                    "body": "Right?! I'd also be super stoked if I wasn't able to look after my child properly that another woman was lovingly doing so....\n\n\nEvil step moms are out there and there's way worse issues than a stepmom sharing her culture and language. \n\n\nSophie's mom sounds like a POS. Selfish and irrespective. Doesn't provide care for her child and doesn't show up when she's supposed to. Has demands about keeping her ignorant...like WTF. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Vaaliindraa",
                            "body": "Because Indians are looked down upon in English culture and yes totally racist.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Old_news123456",
                                    "body": "Yup!\n\n\nI'm thinking here with a blended family that Indian culture is now part of Sophie's culture because it's part of her blended family...bio mom is like NOPE! We're not having any of \"that\". ",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cynical-mage",
                    "body": "Absolutely. I had the reverse problem; my egg donor wanted to keep German all to herself. It was her language, I was banned from speaking it. And yet, she shipped me there every chance she got, stupid woman. So every holiday I started from scratch yet again, and then screamed at when I returned.",
                    "score": 72,
                    "replies": [
                        {
                            "author": "IJustWantADragon21",
                            "body": "My grandpa was half raised  by his polish speaking grandparents. He never spoke it but he still understands a lot of it to this day. His mother and her sisters didn’t want him to learn the language and would use it amongst themselves when they didn’t want him to hear them. Apparently he didn’t let on he’d heard anything until he was a teenager and he caught them talking shit about him, and he called them out by responding to what they’d said in English. His mother reportedly went ballistic but it was way too late to do anything about it 😂",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Armyman125",
                    "body": "I agree. I'm from Louisiana and while my grandparents were bilingual - French and English- French was forbidden at school when my parents went. I would have loved to be bilingual. I learned my first foreign language at 20 and it worked have been easier if I was bilingual.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "rjtnrva",
                            "body": "That's crazy!  With such a huge French Creole/Cajun population, I'm shocked French was banned!",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "SweatyAnimator6189",
                                    "body": "You kinda hit on the reason why it was banned. It was an assimilation tactic aimed at different groups that primarily spoke French.\n\nhttps://www.theguardian.com/us-news/2024/feb/14/louisiana-school-indigenous-cajun-languages-community-impact#:~:text=For%20decades%2C%20French%20was%20banned,elder%20and%20fisher%20Earl%20Billiot.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "Hefty-Analysis-4856",
                                    "body": "Racism is the American way. The death of languages isolates communities, just like what they did with Native American languages, too.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "RuthBourbon",
                                            "body": "I lived in Texas and had a coworker who was a naturalized citizen. He grew up speaking Spanish and once told me he was yelled at if he didn't speak English in school. This would have been in the 1980s, it wasn't that long ago.\n\nThere's a large population of Latino people in South Texas who don't speak Spanish very well for this exact reason, including Congressman Joaquin Castro and his brother Julian. Their mother wasn't allowed to speak Spanish as a child so they never learned it.\n\nI took Spanish classes as an adult at community college when I lived there and more than half the class were Latino people who hadn't learned as children for the exact same reason.\n\nAlso OP is NTA for speaking Hindi at home but is TA for saying mom should take full custody, especially if Sophie was within earshot.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "meat_tunnel",
                                                    "body": "Happened to my grandparents in New Mexico and to my mom in Utah, this would have been in the 40s and 60s respectively.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "gobsmacked247",
                                            "body": "Imagine how horrific it was for slaves to  not only be enslaved but to be forbidden to speak their native tongues and to be beaten and chained when they did.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Hefty-Analysis-4856",
                                                    "body": "You’re saying this like it ended, it absolutely still exists.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Obrina98",
                                    "body": "Cajuns/ Creoles were looked down on. Their French dialects weren’t seen as high-class enough.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "InitialSection3637",
                            "body": "Similar here. I'm from Nola and grew up partially in a German speaking country. Generally I have a pretty thick Garden District accent with a bit of a yat affect, but at home I slip in and out of that, Cajun French and German like some Belgian cronenberg monster.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Moonpenny",
                    "body": "A man came in to get some travel accessories for his daughters in a previous life of mine working retail. These two girls were ... six and ten years old, I think? He mentioned that he was Mexican, his wife was American, and they were moving to Canada for his work for a Chinese company.\n\nThe two girls seemed happy and were demonstrably conversant in English, French, Spanish, and Chinese. They were all very well dressed and the kids well behaved but making multilingual puns and jokes I only barely understood, since I knew fewer languages than the kids.\n\nI never wanted to be someone else so badly before in my life.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Kojere",
                            "body": "Woah. I mean I understand being someone so badly. Four languages at that age. Impressing!!",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KorneliaOjaio",
                    "body": "Seriously. What a gift bilingualism is! Sophie is lucky to be exposed to another language.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "fuckyourcanoes",
                    "body": "And Hindi is a lovely language that can be useful for Sophie growing up in London. It will enrich her life to be exposed to more of OP's culture!",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Its_panda_paradox",
                    "body": "I’d absolutely kill to speak any variant of Hindi. It’s so beautiful! I worked as a server at a local Indian restaurant, and I was always finding myself hypnotized by hearing my bosses speak to each other in Hindi. I couldn’t pick it up much in 2.5 years, but I’m insanely jealous of your boys! Don’t stop, and tell Erica to get fucked.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "_karamazov_",
                    "body": "Completely. Erica is a bigot. OP should teach Sophie some good Hindi words for the douche who's her mother.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "1RainbowUnicorn",
                    "body": "This, you are giving her child a gift! Why wouldn't she want her child to be able to speak a second language? This will open opportunities for her in the future.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lazy-Instruction-600",
                    "body": "Exactly. Being bilingual can only help you as the world becomes more globalized. Erica is just showing herself to be a racist. NTA. OP can speak however they want in their own home.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tandel21",
                    "body": "The only reasons a person wouldn’t want their kid to learn another language is either they don’t want their kid speaking stuff they don’t understand (but she could’ve easily learned the language too) or because they don’t see the language as something worth learning, which is highly xenophobic",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dismal-Detective-737",
                            "body": "I'm only 3nd Generation American. Town near where I grew up had 3 German news papers at one time.  It was shamed out a lot of people post WWI and WWII.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "QuietCelery7850",
                    "body": "It’s ridiculous to tell someone what language they can speak in their own home.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Boeing367-80",
                    "body": "NTA on the language issue.\n\nYYA for commenting on the custody issue. Unnecessary and unhelpful.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "bdjct3336",
                    "body": "The mom is probably 1) feeling left out and 2) wondering if they’re talking about her in Hindi. Tell her to start taking language lessons and then she can join in on the fun. NTA",
                    "score": -11,
                    "replies": [
                        {
                            "author": "bluepanda159",
                            "body": "Uh, sounds like she is just incredibly racist. They were not talking hindi in front of her. Her daughter said one word",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Hefty-Analysis-4856",
                            "body": "It’s racism, not FOMO.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Icy_Butterscotch3139",
            "body": "NTA. You shouldn't have said \"take full custody\" although in your edit it sounds like maybe you didn't say it exactly like that, but still. That said, this woman is a Racist and why the heck is she having dinner in your home and insulting you to your face. Time to set some boundaries about inviting racists to dinner. ",
            "score": 107,
            "replies": []
        },
        {
            "author": "deanomac29",
            "body": "Nah fuck this. Her child is inadvertantly learning a langauge that may well help her later in life with employment, travelling, making friends etc... and this bitch A) doesn't like it and B) tries to tell you what to do in your own home.\n\n  \nI don't think you should have said \"And if you have a problem, then you should take full custody of Sophie.\" it's a very infalamtory thing to say to a parent. But she also is being very immature.",
            "score": 536,
            "replies": [
                {
                    "author": "lorn33",
                    "body": "It’s also awful if Sophie heard and thought he didn’t want her! He could have just said “if you don’t like it, ask her not to speak what she has learned around her or something”",
                    "score": 111,
                    "replies": [
                        {
                            "author": "Regular-Situation-33",
                            "body": "She should have said something super vulgar in Hindi. \n\n\nIf you don't like it ...",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "deanomac29",
                            "body": "Yeah definitely, and the thing is I get the anger that OP must have felt, especially with the inferrence that this could be motivated by race. But it's a very harmful thing to say that could have big consequences.",
                            "score": 43,
                            "replies": []
                        },
                        {
                            "author": "Who_Am_I_1978",
                            "body": "NTA for teaching your children to speak Hindi.  But you are TA for not also intentionally teaching Sophie! She is your daughter as well, she lives with, when you married your husband, you agreed to be her father as well. Stop separating the children as your children and Sophia…that poor girl.   You also TA for the custody comment…which I’m going to assume you said in front of Sophia? If I was your husband, I would be pissed at you at you as well! It’s is obvious that her mother isn’t a very nice person, do you want your husband to have to go back to court for full custody again because of your comment?   Stop bickering with Sophie’s mother… stop making it more difficult for her and your husband. It’s your job to protect all three of your children and to treat them all equally. Step up.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "lindadonaldson1021",
                            "body": "NO! you cannot ask a child to lie like that! The whole purpose of adulting is to teach respect and good values and you want her to lie to her mother? A mother who is not a very good one to begin with?",
                            "score": -25,
                            "replies": [
                                {
                                    "author": "lorn33",
                                    "body": "No not lie, I don’t agree with asking a child to lie at all! I agree that’s horrendous, I meant the mother can ask her own daughter not to speak it if she has a problem",
                                    "score": 23,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GlitterDoomsday",
                    "body": "Also Sophie is 8, she still getting plenty of benefits from learning a second language young, your brain literally develops differently when you do so.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "NotAgainHel15",
            "body": "I mean, I cannot imagine why anyone would not want their child to be bilingual. It's one of the biggest gifts, and I'm regretful I didn't learn any additional languages until my teens as I don't think I will ever have the levels of fluency that I could have had if I'd learnt more as a child. Honestly my first thought is she is being racist. I wonder if she would feel the same way if her daughter picked up a little French or Spanish or something. \n\n\nThat said, telling her to take custody is extreme and probably scared your husband. I would apologise NOT for speaking Hindi but to your husband for snapping like that, and see what you can do to help her understand that this isn't a bad thing. ",
            "score": 153,
            "replies": [
                {
                    "author": "notasandpiper",
                    "body": "\\>I mean, I cannot imagine why anyone would not want their child to be bilingual.\n\nI mean, I can imagine one common reason a parent would be against it. It rhymes with shmaycism.",
                    "score": 80,
                    "replies": [
                        {
                            "author": "NotAgainHel15",
                            "body": "Read it again lol I definitely mentioned that I think it's racist. ",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "tyereliusprime",
                                    "body": "Then I guess you can imagine why!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pristine_Job_7677",
                    "body": "A normal mom would encourage it. I would have asked if step would not  mind speaking MORE  Hindi to my kid.",
                    "score": 28,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tasty_Doughnut_9226",
            "body": "Nta but I would have turned around to both her and your husband and asked why would they want to stifle their child's potential??\n\nShe's jealous at the end of the day and feels that Sophie learning Hindi is pushing her out. She wants you to show her that she's not important to her.\n\nAlso your husband should be telling her where to go or is he embarrassed by your culture??",
            "score": 140,
            "replies": [
                {
                    "author": "Notte_di_nerezza",
                    "body": "If ex-wife is still mad about being an ex, she may also feel like hearing her daughter speak the \"new wife's\" language is a slap in the face. Ex may feel like she's being replaced, from who Sophie lives with to how she even speaks.  And instead of stepping up to spend more time with her daughter, she puts the blame on the easiest target.\n\nWhether it's this, \"just\" jealousy, or \"pure\" racism, ex isn't seeing this as an opportunity for her daughter or even just part of a healthy blended family. It's all about the ex, and what the ex is and isn't comfortable with, and enabling her will only make that situation unhealthier.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "mortstheonlyboyineed",
                            "body": "OP is a man!",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "According-Tap-9874",
            "body": "Maybe stop inviting the ex to dinner lol.",
            "score": 50,
            "replies": [
                {
                    "author": "Hefty-Analysis-4856",
                    "body": "They have a kid together, though, and the way she helicopters around this poor baby I’m sure she’d get mad if she was uninvited. I’m sure she doesn’t like to eat That Kind of Food too.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FairyFartDaydreams",
            "body": "NTA Sophie will benefit from learning more than one language. Your husband needs to write down every time  (dates/times/activity they were supposed to do) his ex flakes on her daughter and if they have to go to court he has evidence that she is not the best parent for Sophie.",
            "score": 31,
            "replies": []
        },
        {
            "author": "thequiethunter",
            "body": "Speak Hindi. Share your language. Please. NTA.",
            "score": 24,
            "replies": []
        },
        {
            "author": "Famous_Account272",
            "body": "NTA - learning languages from a young age is a blessing, it's so much easier than trying to learn in later life! \n\nAlso does Sophies Mum not take issue with the fact Sophie learns a second language at school? Modern or Ancient foreign language is part of the UK curriculum from KS2 (so year 3 onwards).",
            "score": 12,
            "replies": []
        },
        {
            "author": "StarsBear75063",
            "body": "I'll have \"Obviously NTA\" for $1200 please, Alex.",
            "score": 31,
            "replies": [
                {
                    "author": "KBPredditQueen",
                    "body": "RIP Alex 🙏.  You'll be asking ken now",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Top-Spite-1288",
            "body": "NTA - Hubby's ex is a racist cunt! On top of it she sounds miserable, and she deserves it! You do everything right and who is she to police you in your own home. And husband needs to have your back in this. Does he really want you to apologise to his racist ex?",
            "score": 18,
            "replies": []
        },
        {
            "author": "Turbulent-Arm-8592",
            "body": "NTA for how you feel and for having a very human reaction but talk with your husband about a resolution. Absolutely do not stop speaking Hindi and teaching it to your children. Erica is a racist AH.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Electronic-Struggle8",
            "body": "You shouldn't have made that comment about Sophie's custody because you made her sound expendable to you, which she shouldn't be. Sophie is important to your husband and should, therefore, be important to you.\n\nYour husband needs to be a united front with you regarding your sons and respecting your culture. He (presumably) knew your cultural heritage when he willingly (I assume) married you. He shouldn't expect you to forfeit your culture to appease your stepdaughter's racist stepmother.\n\nYou two need to have a talk to make sure you're on the same page. If you can't see Sophie as family and he wants to whitewash you, you should go your separate ways.",
            "score": 22,
            "replies": []
        },
        {
            "author": "Junkateriass",
            "body": "I don’t understand why people are saying that they don’t understand why bio-mom would do this. It’s clearly either racism or distaste for op, personally, neither of which is an acceptable reason to withhold a learning experience from a child. Husband should actually ask op to actively teach his kid, along with her siblings",
            "score": 14,
            "replies": []
        },
        {
            "author": "Abbhrsn",
            "body": "That's crazy, she's getting free lessons for her daughter to learn a new language and is complaining?  NTA",
            "score": 6,
            "replies": []
        },
        {
            "author": "LadyNael",
            "body": "So the ex is racist. Got it. NTA obviously.",
            "score": 6,
            "replies": []
        },
        {
            "author": "CABJ_Riquelme",
            "body": "Nah, teach you kids to be bilingual. The only Assholes in this story are your husband and his ex wife.",
            "score": 10,
            "replies": []
        },
        {
            "author": "HarryInd2023",
            "body": "You are right in teaching and talking to your children in Hindi.  However, you shouldn't have said that she should take full custody of her daughter.",
            "score": 15,
            "replies": []
        },
        {
            "author": "catchyouontheflipsid",
            "body": "... you aren't wrong for speaking the language but why did you have to tell Erica to take full custody? I would be mad at you for just that part if I were your husband. That's not something to just throw out casually.",
            "score": 10,
            "replies": []
        },
        {
            "author": "facinationstreet",
            "body": "The easiest answer is to not invite Erica into your home going forward. If she can't respect you and your family, she is not welcome to step foot in the door. NTA",
            "score": 5,
            "replies": []
        },
        {
            "author": "Twacey84",
            "body": "NTA and you are well within your rights to speak any language in your own home whether Sophie is there or not. \n\nMaybe the comment on taking full custody was a little too far. You should have just said no! And left it at that. \n\nWhat kind of AH parent wants to limit their child’s education anyway? Sophie also learning Hindi is a fantastic opportunity and hugely beneficial for her. What would she say if her school was teaching her this language or about other cultures?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Foxfire_vixen",
            "body": "NTA, obviously Sophie is interested in learning what you’re teaching your twins. You aren’t pressuring her to learn it. Obviously her mom’s racist to those of Indian descent or she’s jealous that you’re married to your ex and able to give Sophie a loving environment where she can flourish and learn.",
            "score": 4,
            "replies": []
        },
        {
            "author": "BefuddledPolydactyls",
            "body": "NTA. She's racist. She has no right to even offer an opinion on what language you use at home. Sophie will be better off for being bilingual (and being primarily raised by you and your husband, won't be racist).\n\nToo bad for Erica, she can only control what happens in her own home.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Only_Music_2640",
            "body": "“That language”?   So bio mom is racist?  Sweet.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Draigdwi",
            "body": "Erica is so blinded by her racism and hatred towards her ex being happy that she is ready to ruin a perfect opportunity for her daughter to be fluent in a language that’s so very different from her first language. Which is a great asset in any professional setting. My daughter knows just scraps of several different languages and headhunters are after her all the time.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DastardlyCreepy",
            "body": "Oh no the child will be able to speak another language...... the horror /s",
            "score": 6,
            "replies": []
        },
        {
            "author": "Jen0507",
            "body": "Soft, very soft ESH and yours is only because you instantly went nuclear and said she should just take custody. \n\nYou are completely correct and gifting your children a wonderful experience being bilingual but it was an overreaction to tell mom to take custody away from your hubs. I understand why you reacted that way but you hurt him too.",
            "score": 49,
            "replies": [
                {
                    "author": "GabrielleArcha",
                    "body": "Um no!!! If someone is being racist towards you (because this is clearly what that was - come on \"THAT\" language), especially in 👏 your 👏 home 👏 you go nuclear!!! Why is it OK that Sophie's mom gets to demand that OP doesn't speak her own language in her own home? The answer is, because she doesn't want Sophie to learn the language, the next logical suggestion would be \"then remove Sophie from my home\". Granted, the way that OP said it was inflammatory, but that happens when you are put in a position where you have to defend yourself in your own home. NTA",
                    "score": 25,
                    "replies": [
                        {
                            "author": "lupercalpainting",
                            "body": "> “then remove Sophie from my home”\n\nPresumably Sophie’s dad doesn’t want that, and it’d probably be pretty demoralizing for Sophie to hear that her stepmom does want that.\n\nIf someone calls me a spic that doesn’t suddenly give me a free pass to say whatever I want to them.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "quagsi",
                                    "body": "stepdad but yeah",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "GabrielleArcha",
                                    "body": "Sophie's dad should've stepped up to protect his wife against an unreasonable request but since he didn't OP had to stand up for herself. \n\nAlso, if someone calls you a racial slur whether or not you respond to is up to you. Sophie's mom asking OP not to speak her language around Sophie was a call to action where a response at the very least was expected.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "lupercalpainting",
                                            "body": "> Sophie's dad should've stepped up to protect his wife against an unreasonable request but since he didn't OP had to stand up for herself.\n\nWas he there?\n\n> Also, if someone calls you a racial slur whether or not you respond to is up to you. \n\nOf course it's up to you, but it's still subject to moral condemnation. If a black person calls me a spic you'd say I'm justified in calling them the n-word? I wouldn't, I don't think anything justifies calling anyone a racial slur.\n\n> where a response at the very least was expected.\n\nThat doesn't mean *any* response is beyond reproach. You're trying to paint it as the choice is either \"say nothing\" or \"say an 8yo girl is unwanted\" when in fact there's an infinite range of responses between those two.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Attentions_Bright12",
                    "body": "Exactly. To toss out the issue of custody of the child on her own, without having talked to her husband first, was just about the biggest imaginable escalation imaginable here. I feel like we started going that way with \"prisoner in my own home\" and then it got immediately much worse.\n\nWe never even asked the obvious questions, here, that I can tell. What was behind the negative reaction to \"that language\"? Did Sophie's mother feel shut out of a means of communication with her daughter? That's totally understandable, whether we're excited about the idea of multilingual children or not. You have to create space to talk about things like that, rather than jumping to the ramparts.",
                    "score": -14,
                    "replies": [
                        {
                            "author": "Always_on_top_77",
                            "body": "Nah, Sophie isn’t actively being taught, her moms just racist.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Attentions_Bright12",
                                    "body": "You apparently can read minds just as well as our OP. Congratulations on that. \n\nWhich would you rather have?\n\n1. A conversation where you ask the biological mother \"What exactly bothered you?\"... and we could then see clearly that she's having a racially-charged reaction, or whatever it is -- which would *in its way blunt any racist reaction* by exposing it for what it is;   \n  \nor\n\n2. An immediate blow-up in which your own \"prisoner in my own home! you should take custody!\" reaction has driven a wedge between you and your spouse, and seemingly also shown that you personally don't want to have little Sophie around? \n\nI think the second option is needlessly confrontational, at the very least.",
                                    "score": -17,
                                    "replies": [
                                        {
                                            "author": "Always_on_top_77",
                                            "body": "No safe space for racists here. Not sorry.",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "quagsi",
                                            "body": "she heard her daughter say a few random Hindi words and got mad that she's learning \"that language\" in what world could that be anything other than bigotry",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "StructureKey2739",
            "body": "Why on earth is your husbands ex coming to dinner at your house.  She also seems to be flexing her muscles at you, demanding what you should speak in your own home.  Your husband should have your back, not worrying about his ex's poor little feelings.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Neat_Leadership_8391",
            "body": "I’ve read that it is easier to learn another language when kids are young because a different part of the brain is used versus when we are adults. The article also said that the two languages are learned as one language.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MmaRamotsweOS",
            "body": "NTA She's very jealous of you. Ex wives have no say in how or in what language the current wife speaks, outside OR inside her own house. Pay her no mind.",
            "score": 3,
            "replies": []
        },
        {
            "author": "deux-peches",
            "body": "Why in the world wouldn't any parent want their child to pick up another language? That is the most narrowminded approach to raising a child. The fact that Sophie is picking words up without you even trying to teach her, suggests that she has an intellectual curiosity and perhaps even a gift for languages. Good for her! Her mom should be ashamed of herself.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ella8888",
            "body": "Those children are lucky to have you.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LauraLethal",
            "body": "I wish my own country was better at bilingual education. NTA. She is just being racist.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hana_ivy",
            "body": "What’s your husband’s stand… did he speak to his ex how out of line she was in saying such things…?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Consistent-Primary41",
            "body": "No wonder she lost custody.\n\nWhat an ignorant fool.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sakiri1955",
            "body": "NTA.  The ex is a racist, possibly jealous, bag.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Influence-Lower",
            "body": "She sounds racists and unreasonable. Who wouldn't want their child to learn another language? It's great for development. NTA, I don't even care that you hurt her feelings. Sounds like she needs to step up more as a parent then if she wants more say.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MiladyRogue",
            "body": "NTA no judge is going to give an irresponsible and inconsistent parent custody because she doesn't want her kid learning a second language.  Your husband is immature and needs to grow up and stop being childish.  He is supposed to support you, not have a temper tantrum because his ex is a racist and he is willing to be silent rather than rock the boat.  I think it is great that she is interested enough to pay attention and try to learn even though you aren't directly teaching her, and her FATHER should be proud of her too.  Instead, he is chewing his nails and fretting like an old lady.  Ugh, is he always like that, or is this new because I'd have never married him if this was his normal way of dealing with conflict.  My ex-fiance was teaching my 9 year old, at the time she is 21 now, Arabic, and I thought it was great. I'm relearning French, Duolingo, and my grandson is really into sitting with me through my lessons.  Being bi or tri or whatever lingual is a blessing, and I wish when I was a kid, it was seen as important.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DuckGold6768",
            "body": "Sounds like you got set straight by people about the custody thing, but I just want to point out that Sophie is probably picking up the Hindi and speaking it around you to feel included. I hope her mother's possessiveness and racism doesn't make you feel like you need to keep her at arm's distance. She would probably love it if you spoke Hindi to her like you do for her brothers and maybe teach her more about your culture. Great way to save her from picking up her mom's attitude.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LilBoo2019TR",
            "body": "NTA. I'm gonna assume his ex is mad he is in a good relationship or she is homophobic/racist. It's a good thing for children to be bilingual and research shows there are so many other benefits when teaching children more than one language. She cannot dictate what happens in someone else's home. You don't need to do what she says. Continue on as you have.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NomadicWhirlwind",
            "body": "NTA at all. Sophie's watching you teach the boys and would love to learn with you too. She's still young enough to pick it up. Bio-mom is just being racist and hateful, because she knows Sophie loves you.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Old_Cheek1076",
            "body": "You were N T A until you threw out the line, “…then you should take full custody of Sophie.” That was completely inappropriate. YTA.",
            "score": 17,
            "replies": []
        },
        {
            "author": "repthe732",
            "body": "You’re not wrong about the speaking Hindi part of your story but you definitely do yourself any favors telling the ex she should take full custody. I get it’s not what you meant but most people would take tit the same way your husband did",
            "score": 6,
            "replies": []
        },
        {
            "author": "StandEast5464",
            "body": "YTA not for speaking Hindi, but for telling her to take full custody",
            "score": 21,
            "replies": [
                {
                    "author": "izthatso",
                    "body": "What? Did I miss something? The husband stated he’s worried that Erica will take the kid. OP didn’t do anything wrong.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Shadow4summer",
                            "body": "And if husband already has full custody, what judge in their right mind would change that arrangement because new wife is teaching them another language?  If your husband was there, he should have shut that down immediately.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "lindadonaldson1021",
                            "body": "She spoke in anger and should not have said what she did to to Sophie's mother, who is not a good person.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "BulbasaurRanch",
                            "body": "She literally told the ex wife she should take full custody of Sophie then.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "izthatso",
                                    "body": "Ha, my bad. I’m a speed reader and skipped over her saying Erica should take the kid. I need to slow down. And put my readers on.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Crimsonfangknight",
                            "body": "She encouraged the ex to pursue full custody\n\nBasically saying take the step child away from her bio dad and leave hubby to op and the new kids.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Bluewaveempress",
                                    "body": "He",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "BoredofBin",
                                    "body": "Now OP is saying that he was misinterpreted. He didn't mean Erica should take full custody, he meant that Erica should take on more parental responsibilities and not bail out on the days she has with her daughter.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "yesimreadytorumble",
                                            "body": "there is no she. before making an argument make sure you correctly read the post.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "BoredofBin",
                                                    "body": "They clarified that later in the update. Their identification wasn't mentioned when I made that comment.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "yesimreadytorumble",
                                                            "body": "it always said (m) in the post indicating they’re male.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "thegeniuswhore",
                                    "body": "he* OP is a dude as is the husband. this is a gay relationship.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Nta. Ex wife is racist ! Kids learning multiple languages is good. British took 45 trillion from indians and forced their language on whole world. Atleast you are only teaching hindi and not looting their money lol.\n\nAlthough that custody comment was uncalled for. Sophie is your husband's first child and you have to accept that fact.",
            "score": 6,
            "replies": [
                {
                    "author": "Beautiful-Peak399",
                    "body": "I agree. What's wrong with learning Hindi?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Regular-Situation-33",
            "body": "OP you should now ONLY speak Hindi in Erica's presence. Make her racist ears bleed with the sound of your language.\n\n\nNTA",
            "score": 5,
            "replies": []
        },
        {
            "author": "Large_Effective_812",
            "body": "NTA, but if you’re husband is upset that a racist woman yelled at you and you defended yourself you have a husband problem and tell him he needs to find his spine. ",
            "score": 5,
            "replies": []
        },
        {
            "author": "prettyIady",
            "body": "NTA. Imagine being mad that a kid is learning a second language for free. Sophie’s future résumé just got better, and Erica’s out here acting like it’s a crime. Bilingualism is a gift, not a threat—tell Erica to take it up with Duolingo.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ConfusedAt63",
            "body": "NTA, offer to teach the ex the language, it might be fun to be the teacher of your husband’s ex, you could really have some fun with this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ZCT808",
            "body": "Being multi-lingual is a gift.  It is also incredibly easy for most children below a certain age.  \n\nI knew a guy who took a government contracting job that paid substantially more because he was fluent in two languages beyond English, thanks to his grandparents teaching him at a young age.  \n\nIt’s a bit insane to be against a child learning language.  Of course you’re doing nothing wrong.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Frankifile",
            "body": "I’d be speaking more Hindi and teaching Sophie it as well as your boys. \n\nI don’t have time for pandering to racists. She sounds like a total deadbeat too boot.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BuilderCautious4669",
            "body": "NTA. Damn I wish my stepparent had bothered to teach me her language (Thai)! Even if Sophie is learning Hindi inadvertently, hopefully she will continue to learn more. What a gift!",
            "score": 2,
            "replies": []
        },
        {
            "author": "turgottherealbro",
            "body": "I actually think you should be making an effort to teach Sophie Hindi too, not just having her pick up on it indirectly. Don’t you think she’ll feel left out OP when you and the boys are fluent?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Klutzy_Gurl2594",
            "body": "She’s just being racist. Plain and simple. \nBut you shouldn’t have asked her to take full custody without consulting your husband. It was really not your place to say that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SwampGobblin",
            "body": "NTA\n\nI think teaching a second language is beautiful.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JingleKitty",
            "body": "Sounds like she’s a racist. I would be overjoyed if my kid picked up a new language, any language! It’s your home, she has no right to tell you what to do, let alone what language to speak. NTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "winterworld561",
            "body": "Why the hell is Erica living with you? No ex should be living with their ex and new spouse. Don't you think it's time she got her own place? She cannot dictate what you can and cannot teach your children. You are doing a wonderful job teaching them. She is clearly offended by your country's language. She needs to move out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "minimirth",
            "body": "There are tons of Indians who speak English and other European languages, either for work or as hobbies. There is no detriment to be able to speak and connect with more people. Hindi is one of the most widely spoken languages in the world. Also you never know when a language can help someone. I know an Indian girl who learnt Arabic and now works as a translator.\n\nSo NTA.\n\nBTW, I'm from India and can speak French and Japanese (although poorly). Hasn't really led to the end of Indian civilization.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LawfulnessMajor3517",
            "body": "I am incredibly baffled by this whole situation. Like if somebody was teaching my kids another language, I would be thrilled. Even though it wasn’t your intention, if I was Sofie’s mother I would be thanking you for teaching her Hindi. Or any other language.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ELISHIAerrmahhgawdd",
            "body": "Update 2 was definitely an enjoyable plot twist",
            "score": 2,
            "replies": []
        },
        {
            "author": "JHawk444",
            "body": "I understand why you made the custody remark to Erica, and I don't think you meant it in a meanspirited way. Her request was unreasonable.",
            "score": 2,
            "replies": [
                {
                    "author": "thegeniuswhore",
                    "body": "but i do get why his husband is scared of losing his daughter and if that happens this will be considered the inciting incident, even tho erica's racism should've been",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Amaranthim",
            "body": "I would double down, lol. Being multi-lingual is a blessing! I am a native Spanish speaker, I am learning German, Italian and Haitian Creole at this time with looking forward to Korean some where down the line. I am also in my 60's btw.  You keep doing what you are doing, and your husband better fall in line and have your back. You owe that racist cretin nothing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "urkulAa",
            "body": "Nta\n\nThe way you husband blamed you for being home at YOUR HOME. Very concerning behaviour",
            "score": 2,
            "replies": []
        },
        {
            "author": "kcpirana",
            "body": "NTA. Erica has no say in what you teach your children and if Sophie is interested and picks up on some of it, that’s understandable and not in any way harming her. It might spark an interest in languages even! Erica can go cry a river.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MaryEFriendly",
            "body": "Keep teaching your boys and teach your stepdaughter too. Her mom is a racist. She can die mad about it. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bovario2021",
            "body": "NTA and I don’t need to read all of it\n\nTeaching your children to speak multiple languages is a massive advantage in life, and something to be encouraged.  The ex is just being spiteful, and ignorant to boot.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Homeboat199",
            "body": "NTA.  You would think a mother would WANT her child to learn as many languages as possible.  Just think of the job opportunities it opens.  How weird.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Responsible-Kale-904",
            "body": "Y'all might need a lawyer to defend you from ex-wife and custody problems etc\n\n\nYour husband should be defending YOU and Sophie \n\n\nYou and Sophie and the/your boys are:\n\n\nN\nT\nA",
            "score": 2,
            "replies": []
        },
        {
            "author": "wmnoe",
            "body": "Nah fuck that it's your house, you speak whatever language you want around YOUR kids!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sweet-Salt-1630",
            "body": "NTA obviously, my cousin is married to a gorgeous French woman, they have an adorable 3 year, the child knows French as the mother talks to the child in that language, my cousin speaks Hindi and as child is in pre-school they also speak English. When Mum's French relatives come over, the child can converse with them perfectly and likewise with the Inidan family. \nKids are sponges at this age, and it's a wonderful skill to have.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RedHolly",
            "body": "Would love to hear the judge’s reply when the mom says she wants full custody because the bio dad’s home is trying to teach her child a second language. I would stop inviting her racist butt over to dinner. You don’t want any of your three kids exposed to that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gennevieve1",
            "body": "NTA. You may have been a little too harsh with the custody comment but you were absolutely right about being free to speak how you want in your own home. It's only good for Sophie if she learns other language. \n\nIn your shoes I would just make the conversation really uncomfortable for her mom. Next time try the \"why\" game. \"Why shouldn't I speak my own language in my own home?\" *'Because I don't want Sophie to learn it' \"*But why don't you want her to learn it?\" etc.  This will push her to truly say out loud that she's a racist. See how long she lasts in the conversation. She won't be able to give you any valid reason. And you will be able to present many arguments why it's a good thing. And because of that this conversation will be over and done with and I just bet that she won't start it again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shazaaym",
            "body": "Sophie learning Hindi will be really useful to her as she grows up. Teach all your kids as many languages as possible while they're young and just soak that stuff up!\n\nThe ex is letting her racism show. Simple as that.\n\nNTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "juanredshirt",
            "body": "NTA.  The ex can learn if she wants.",
            "score": 2,
            "replies": []
        },
        {
            "author": "geekylace",
            "body": "I’d be tempted to mention it’s wise Sophie knows the basics so her brothers can’t talk shit about her when they get older. \n\nNTA good for you for acknowledging part of what you said required an apology but still standing firm on your principles. It’s your home and you can teach the children your language. Anyone who has a problem is probably racist.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DianeDesRivieres",
            "body": "NTA - being bilingual is a good asset.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BarRegular2684",
            "body": "My kid has grown up exposed to English, Greek, Spanish, Russian, and French. I wouldn’t say they’re fluent in anything but English, but it’s been helpful in a lot of situations. \n\nThe funniest way it’s been helpful is on the ice. They come up to an opponent and growl something in a menacing tone in Greek, scare the other kid and skate off with the puck. All they did was call the other kid a watermelon. \n\nIn all seriousness though Erica is a racist. No quarter for racists. Teach Sophie more Hindi. It’s a beautiful language.",
            "score": 2,
            "replies": []
        },
        {
            "author": "borncheeky",
            "body": "I'm a Brooklyn girl all grown up. I learned 6 or 7 languages by eavesdropping. Now I can only speak 2 or 3. I wish I was able to speak more. As long as your daughter knows what you are saying, keep it up!  But don't speak it because you don't want her to know what you're saying. Doesn't work. That's how I learned yiddish and Russian...",
            "score": 2,
            "replies": []
        },
        {
            "author": "dcgirl17",
            "body": "Why are you not teaching Sophie too? I’m sorry but it seems like you have an issue with her (plus her mother but also with the kid).",
            "score": 7,
            "replies": [
                {
                    "author": "Impressive-Flight766",
                    "body": "How did you gather from what she said that she doesn’t like Sophie? Nothing of the sort was implied or directly stated.\n\n> Why are you not teaching Sophie too?\n\nIt’s pretty clear that that would be a bigger problem if she had actually intended to teach Sophie Hindi. I mean Sophie picking up the language indirectly has already caused quite a stir.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "somerday",
                    "body": "She is teaching Sophie and in the best way possible - by using Hindi in normal conversation. My 9 yo grandson told us he is learning to speak Spanish by talking in Spanish to the little Latina girl who sits next to him at school.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Homework_7621",
            "body": "YTA for the custody comment, no matter how you meant it.\n\nBut start documenting the racism, if you're not already.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Rage-Parrot",
            "body": "NTA - honestly being multilingual opens up so many different avenues in life. I would be happy if someone was teaching  my kid a second language for free.",
            "score": 3,
            "replies": []
        },
        {
            "author": "alpha-9909",
            "body": "Your not wrong but at the same time, calm tf down, no needed to go nuclear, your husband is catching strays for no reason.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Interesting_Order_82",
            "body": "YTA for suggesting full custody. Your reaction would seem to suggest you want a major rift between your husband and his ex.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Longjumping-Tie-6638",
            "body": "YTA for telling her to take full custody. So because you have two kids your husband doesn't need his oldest anymore? awful",
            "score": 3,
            "replies": []
        },
        {
            "author": "NoGuarantee3961",
            "body": "Maybe I am weird, but I would ask that you spend some time helping my daughter learn more Hindi.\n\nI remember trying to learn some from my friend Prashant in undergrad",
            "score": 2,
            "replies": []
        },
        {
            "author": "CampSpiritual3808",
            "body": "NTA for refusing to stop speaking Hindu. Ex wife sounds like an idiot, she should be thankful for your teaching another language but racists are not known with their intelligence. But YTA for saying that she should have custody. Whatever the reason you have doesn’t matter, your husband has every right to be angry at you. It sounds like you don’t care if Sophie lives with you or not. It won’t only affect you it will affect your husband and Sophie. This is really shitty and selfish thing to say.",
            "score": 2,
            "replies": [
                {
                    "author": "BoredofBin",
                    "body": "This could be a typing error but the language is known as *Hindi* . People who follow hinduism are called *Hindu*.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CampSpiritual3808",
                            "body": "Thank you so much. English is my second language and I’m trying to improve I didn’t realize the mistake while writing.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "laurenj1992",
            "body": "You say you’re male and that Sophie is 8months. Are these typos?",
            "score": 2,
            "replies": []
        },
        {
            "author": "BoredofBin",
            "body": "Even after the edit - this is leaning towards ESH. You are NTA for wanting your children to learn Hindi. It's a great asset. Raising your kids to know about your culture and your language is always a plus.\n\nHowever the way you and Erica handled this issue is wrong. You throwing the custody arrangements in her face and her being racist about how you raise your kids is not how you should have handled the situation.\n\nYou should have asked your husband to talk to Erica about establishing boundaries about what you can do in your own home and how she cannot point a finger at you or him for it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HungryHumor1335",
            "body": "She's jealous she cant give her daughter what you and her dad can. Keep doing you, this will all be better in the end. \n\nYou're doing an amazing job as a mother!",
            "score": 2,
            "replies": [
                {
                    "author": "Dull-Geologist-8204",
                    "body": "I don't know why but she was left for a man and lost her daughter also. Pretty sure it's a lot more than she is just jealous. \n\nOP shouldn't stop speaking Hindi in the house but also a little compassion for the women wouldn't hurt either.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "HungryHumor1335",
                            "body": "First thing I see is she doesn't have sole custody for a reason. Either is her decision or the courts. I am thinking she's jealous bc she's a single parent who, like i said, cant give her daughter what they can, two parent household. Its hard to watch your ex crate a new family. Jealously is sometimes unavoidable .. I think OP should stick to her own and do her.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "beyondbliss",
                            "body": "Where does it say she was left for a man? It doesn’t say why their marriage ended or how soon after he met and married OP. Is there a comment I’m missing because it isn’t in the post.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dull-Geologist-8204",
                                    "body": "Read it again",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Beautiful-Peak399",
            "body": "You're assuming a lot here about stuff that wasn't mentioned in the original post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MyChoiceNotYours",
            "body": "NTA bilingual is a huge asset and you tell that ex that you won't have a racist in your house ever again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bluewaveempress",
            "body": "Nta. The mom is intolerant.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Due-Echidna-9016",
            "body": " NTA. His Ex has no right to come into your home & ask such a thing. By the way why wouldn’t you want your children to learn another language. I love that. Your husband is wrong as well. If anything his EX owes you an apology.",
            "score": 1,
            "replies": []
        },
        {
            "author": "somerday",
            "body": "Is Sophie 8 months or 8 years?",
            "score": 1,
            "replies": []
        },
        {
            "author": "yxme05",
            "body": "Sophie's gonna learn some real good cuss words",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pepsilover12",
            "body": "NTA do not stop teaching your children Hindi it is part of who you are and the kids are as well. Should you tell Erica to not speak in English because you don’t want your kids learning “that” language? She is just jealous that while with you her daughter is learning an invaluable skill in being bilingual and it’s not like you have them sitting at desks learning you are speaking to them and if she’s picking it up she obviously enjoys it too",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capable-Limit5249",
            "body": "Tell the ex to ask Sophie what Sophie wants. \n\nYou should all grab this chance to teach her a second language…huge benefits to intelligence, future job/career prospects.\n\nNTA. Carry on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "everyonecousin",
            "body": "Sophie’s mom sucks. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "imamage_fightme",
            "body": "Fuck no NTA. The ex sounds racist, end of. Early childhood is the best time for kids to learn new languages, they pick it up like a sponge, and being bilingual is only a positive for any person! This could literally give all the kids opportunities in life they wouldn't otherwise have.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AgonistPhD",
            "body": "NTA. Why was your husband married to a racist, anyway?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mfruitfly",
            "body": "NTA. \n\nHonestly, you are doing all the kids a huge favor by making them bilingual. I wish I had learned another language while young and as an adult have not been able to really grasp learning one. They will have better job opportunities, ability to travel and communicate with a wider world, and a lot of research shows it helps them excel in general learning and education. \n\nThe ex can have a say in health and safety, but she doesn't get to restrict how you communicate in your own home. So not only is learning another language a good thing, even if it wasn't, it certainly isn't bad, so the ex can just keep her opinions to herself, in her own home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nin_miawj",
            "body": "Nta she sounds like she has her own issues and really doesn’t like you \nProbably low key racist too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bakecrazy",
            "body": "absolutely not. don't apologize.",
            "score": 1,
            "replies": []
        },
        {
            "author": "emjkr",
            "body": "NTA \n\nErica sounds like a t**t. \n\nUpdateme!",
            "score": 1,
            "replies": []
        },
        {
            "author": "k23_k23",
            "body": "NTA\n\n  \nWell done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RikkeJane",
            "body": "NTA!! It’s your home and your children you are teaching, that Sophie is learning the language too shouldn’t be a problem. The ex is trying to lay some rules in your home and that’s inappropriate! \n\nDid your husband at least back you up?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loud_Reference1880",
            "body": "NTA but why is your husband not worried about her being racist to you and in turn potentially passing these beliefs onto her daughter? He needs to stick up for you and all of your children as it's not healthy for the her or the boys to hear these comments.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crimsonraiden",
            "body": "NTA\n\nIt is impossible to not speak in hindi around her daughter when she lives with you. Why does it bother her so much?",
            "score": 1,
            "replies": []
        },
        {
            "author": "sanglar03",
            "body": "Should've asked Sophie if she wanted to partake in it from the beginning tbh. Of course a kid will pick what happens in the house.\n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jakeofheart",
            "body": "Respectfully, Erica can go duck herself.\n\nIt’s your house, so you get to speak whichever language you want. Sophie will actually have an easier job at learning new language with the second hand training that she gets from you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kyra_Heiker",
            "body": "Never pander to racist cunts like her, you have every right to speak your native language in your own home and she can fuck right off. Pardon my language but this really upsets me. \n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "oldfartpen",
            "body": "No NTA...\n\nHaving a bilingual home is always viewed as a plus.. And would never be a reason for custody to be changed.\n\nYou ARE an AH for your custody comment though and your husband is certainly right to be upset with you.\n\nIf you cannot treat your stepdaughter like one of your own and love them as such you should have had a serious conversation with your husband before you married him",
            "score": 1,
            "replies": []
        },
        {
            "author": "1568314",
            "body": "Even upper class assholes realize it's a good thing their kid has picked up a second language from the woman who actually takes care of them. \n\nShe is insecure, and you shouldn't feel defensive about her comments. They are just an expression of her shortcomings. I'm sure your step daughter will be grateful to have people in her life who don't treat her like she is a commodity to be argued over and instead an individual with interests of her own, like learning a new language.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FeistyCanuck",
            "body": "Being bilingual as a kid optimizes your brain to be multilingual.  \n\nYou could make the point that you intend for the kids to also learn Spanish / French / other languages and that what you are doing now is enrichment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "akelita",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "bumbling_through",
            "body": "NTA. But you have a husband problem. Why is he getting up in arms about ex crying? He should know that she's a manipulator. Also is he endorsing her racism? Time to tell hubby to grow a spine and be your partner or get out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "19gweri75",
            "body": "Nta. I wish I had someone to teach me another language as a child. It should be counted on as a positive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Most_283",
            "body": "Absolutely NTA.  It’s your home.  If you want to have your breasts surgically put on your back it’s no one’s business but yours.  Not saying that’s the case but you get my point lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Teeth_Of_The_Hydra97",
            "body": "My kids are all bilingual, and it's amazing for their brain development and connection to others in the world. You're definitely NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Equal-Brilliant2640",
            "body": "I wish I spoke a second language, I had to take French in school, hated it and have never had the chance to use it even if my brain remembered anything beyond the like five words everyone knows\n\nErica is being racist, plain and simple and your husband should be talking with his lawyer and going before a judge if possible to get this dealt with\n\nAnd if she becomes fluent, or pretty close, it’ll help her getting work in the long run\n\nTell your husband “your ex is a racist and is weaponizing her ‘white woman’ tears. Don’t fall for that bullshit, otherwise you’re as bad as her”\n\nWhite woman tears can be the most dangerous thing out there. Or they can be used for good. She is using them for evil (I’m a white woman by the way, and I’ve seen it happen way to often)\n\nTell your husband he needs to have a “come to Jesus” talk with his ex. About how her behaviour will not be tolerated and if there is anymore racist behaviour from her, she can explain herself to a judge",
            "score": 1,
            "replies": []
        },
        {
            "author": "SomeRandomFrenchie",
            "body": "NTA,\n\nThat is just racist bullshit, why would you not want your kid to learn another language if given the chance ? That is an opportunity for the child, not a bad thing, wtf.",
            "score": 1,
            "replies": []
        },
        {
            "author": "taytrapDerehw",
            "body": "Bet if you were French or any other more western, mainstream ethnicity, she wouldn't have a problem with Sophie learning *that* language.",
            "score": 1,
            "replies": []
        },
        {
            "author": "abritinthebay",
            "body": "Next time keep it short and sweet “fuck off Erica, you racist cunt”",
            "score": 1,
            "replies": []
        },
        {
            "author": "brittmeister_",
            "body": "Being bilingual is a blessing. Not to mention a huge highlight in their future resumes. I only speak English and I’m from a Hispanic family where none of us, starting in my dad’s generation, learned Spanish bc my gramma is white and it “ embarrassed her”. I take such pride in my heritage and culture but often get looked down on bc “ what Mexican can’t speak Spanish, etc “ \nI don’t think you are wrong at all. Good job as a matter of fact, for standing up for yourself and beliefs",
            "score": 1,
            "replies": []
        },
        {
            "author": "SweetBekki",
            "body": "NTA - Sophie obviously shows an interest in learning another language and the ex is probably jealous that her daughter will have that bond with you like a secret language. \n\nDo you and your husband have Sophie most of the time? Ever considered having it official?\nYou don't want that girl to be too influenced by her mother's racism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lapsteelguitar",
            "body": "1) Short of abuse, what you do in your house is none of Erica's business.\n\n2) Learning a second language is always a gift.  The earlier in life, the better.  Perhaps it's time to include Sophie in the lessons, rather than letting her over hear your lessons.\n\n3) Erica can go suck a lemon.\n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kristmaus",
            "body": "NTA.\n\nShe shouldn't dictate what language you speak in your own house to be a better mom herself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tigerz0973",
            "body": "NTA\n\nHow messed up do you have to be to stop your child learning another language that could lead to amazing outcomes for her future? \nPlease please teach Sophie along with your sons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Daswiftone22",
            "body": "Imagine coming into someone's house and telling them what language they can and cannot speak to their own children, in their own home. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "emryldmyst",
            "body": "Nta",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kaleis25",
            "body": "NTA. It's so nice to learn different languages. Don't apologize you did nothing wrong. Continue to teach your sons your native language. ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "dontdoitliz",
            "body": "Considering how many Indians there are and how often you will end up encountering and working with their diaspora, speaking Hindi from childhood would be a very handy skill to have. The ex is just a short-sighted, racist idiot who is not realizing her kid is getting a free language expansion. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "mortstheonlyboyineed",
            "body": "OP, did you ask her why? Let her tangle herself up in knots, trying to explain her racist beliefs rather than going nuclear. NTA, but it wasn't the smartest thing you could do throwing the custody at her when that's between your husband and her, not you. Poor Sophie may have heard that too and think you don't want her as well as having a shite mother. She'd feel unwanted by both of you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzled_Put_7168",
            "body": "NTA. The fact of the matter is that Sophie’s step mum is Indian. That will make an impact on Sophie’s life and if Sophie’s dad doesn’t want that, then he should have thought about it before he married you. You shouldn’t have to dim yourself and hide parts of yourself from your family. What kind of precedent does that set for Sophie and your bio kids?",
            "score": 1,
            "replies": []
        },
        {
            "author": "stuckinnowhereville",
            "body": "NTA but your husband is being one. Let her learn. Erika is an entitled immature woman- likely why she doesn’t have custody.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imnotawerewolf",
            "body": "It's just racism and racism should never be entertained. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Careless-Ability-748",
            "body": "nta you can speak to your sons however you want. And if Sophie learns too, all the better!",
            "score": 1,
            "replies": []
        },
        {
            "author": "loricomments",
            "body": "NTA. You did just fine. There's no need to mince words with a racist. Your husband is wrong, she won't take the child away, she can't manage having her even part time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweaty-Power4937",
            "body": "NTA, any new language is always a plus.\n\nHaving said that, how is Sophie only 8 months old and you have boys with your husband since 2022?\n\nAlso, how is an 8 month old picking up on a new language?\n\nI'm just trying to understand unless I understood this incorrectly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old-Man-of-the-Sea",
            "body": "NTA. The ex is the AH for not wanting better opportunities for her own child. However, where is the dad in this. He has a say and should speak up",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pretty_Goblin11",
            "body": "NTA.    Erica can raise her own kid or shut her racist ass up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Potato-6250",
            "body": "NTA. She doesn't make the rules in your house. Remind her of that. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patient_Space_7532",
            "body": "NTA! Bilingual is a great advantage everywhere! Sophie is getting the same opportunity as your twins. I think Erica is just jealous because she has her own guilt to deal with and it's not her teaching her daughter better things in life!",
            "score": 1,
            "replies": []
        },
        {
            "author": "mad2109",
            "body": "The woman is an idiot, and even worse, from what you have written, it sounds like she is a racist idiot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RainGirl11",
            "body": "Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "kerfuffli",
            "body": "NTA. But I would consider talking to your husband about how Sophie fits into your family. As a child, I’d find it weird/rejecting if you actively taught your children another language, like I’m not part of the family. Or like it’s two families and not one",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeginningBluejay3511",
            "body": "This is awesome for your kids. Wish I was bilingual!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FeuRougeManor",
            "body": "Nta. She probably doesn’t even know what language you are speaking and that’s why she wants you to stop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative_Wolf_643",
            "body": "NTA her child has a free chance at a bilingual education from a foundational age and she wants to DENY her this opportunity??? What next, burning money? Throwing freshly purchased groceries down a sewer drain? Good parents would kill for an opportunity like that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kitkat-ninja78",
            "body": "I am actually surprised, being Bilingual is a great skill to have, and it will only benefit the children in the long run.  Maybe your husband can talk to his ex-wife and explain the benefits (especially financial - access to jobs that require it, etc), maybe even getting her involved.  Is that not an option???",
            "score": 1,
            "replies": []
        },
        {
            "author": "Careless-Mammoth-944",
            "body": "She wouldn’t have had that issue if it was a white man’s language like French. NTA. Does she also have an issue with her ex being bi?",
            "score": 1,
            "replies": []
        },
        {
            "author": "tenaji9",
            "body": "Your home , your rules . You can tell ma about Google translate as she may feel left out .",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flimsy-Call-3996",
            "body": "Offo…Also, the Ex can GTFO! Husband needs a spine. The more multi lingual people there are, the better we are as humans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zvaksthegreat",
            "body": "But why are you having threesomes...? ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lulubelle__007",
            "body": "ESH. You were an asshole for saying about custody. Your husband’s role in his child’s life shouldn’t be threatened by you. \n\n\nShe was wrong for talking to you about this language thing, she should have spoken to her ex if she has concerns about their child. \n\n\nI think her issue isn’t the language, it’s that her partner left her for a man and now that man is teaching her daughter his language and playing happy families.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Worldly-Computer-962",
            "body": "Erica's racist, full stop. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoysenberryAncient54",
            "body": "NTA - except that Sophie clearly wants to learn, so you should maybe have a conversation with her about that and include her more.\nHer mother doesn't have the right to prevent her from learning another language or being fully included in her own family, that's absurd.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lonestarlady_66",
            "body": "NTA, there is nothing wrong with you teaching your children to be bilingual at all I think it's wonderful & children as you've seen pick up new languages faster & easier than adults. My niece & nephew learned Spanish from Dora the Explorer. \n\nShe's overreacting to this and she's being childish & rude to tell you how to raise your children & like it or now Sophie is also your child. She's going to pick up what ever language is spoken in front of her. She's jealous of you & your relationship with your husband is what is at the root of this issue. It's not the language or Sophie learning it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Ratio-7038",
            "body": "Nta. She's showing her jealousy and racism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SchwaebischeSeele",
            "body": "NTA, nothing wrong with growing up bilingual and equally great for a child to pick up parts of another language as well!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-Interaction-9006",
            "body": "NTA, your culture means a lot to you. It’s your right to pass it down your generations. You might have come out a lil harsh but it’s ok.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrsSEM84",
            "body": "NTA. \n\nShe’s being racist & ridiculous. She has absolutely no right to dictate how you speak in your own home. Her request was beyond rude & your husband should have immediately kicked her the hell out of your home!\n\nShe could try taking this to court all she likes, no judge is going to take your husband’s custody away just because you are a bilingual household & the racist ex is throwing a tantrum over it. \n\nStop the dinners. In fact stop allowing Erica to ever step foot inside your house! There is no need for it. She can collect Sophie at the door. \n\nI understand you and your husband were trying to have a good relationship with her for Sophie’s sake but Erica has made that impossible. \n\nShe doesn’t need to be around your boys ever again, they are nothing to do with her. And you know she’s racist so why would you expose them to that? \n\nYou can also go completely no contact with Erica yourself. Your husband can and should take charge of all communication around Sophie & the hand overs. \n\nIf you don’t already, start keeping records of every time Erica misses her custody time, breaks promises to Sophie & every nasty, racist, or backhanded comment. Just in case she does try to take this to court, be ready to fight back. \n\nAlso, start including Sophie in the Hindi lessons properly. She obviously wants to learn the language & it’ll be good for her. Those babies are her siblings and it’ll be great for her to share both languages with them. If your husband doesn’t already speak it get him involved too, it’ll be a lovely family activity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "snowflakes__",
            "body": "I would actually go full speed the other direction…teach Sophie Hindi fully. She’s obviously interested and half her family speaks it. She’s at a great age to start learning it now. Hell I’d even sign her up for lessons",
            "score": 1,
            "replies": []
        },
        {
            "author": "CuriousPenguinSocks",
            "body": "NTA for not allowing her to set rules in your home but YTA for the custody comment.\n\nNext time just say \"you can't make rules in our home. I'm not doing anything wrong and please drop this or speak to your ex about it\".\n\nTheir arrangement needs to be handled between them, including any issues that come up. Sure, your husband should talk to you about them and consider you but that is his issue to deal with, not yours to step in on.\n\nAlso, document these things when they happen. Get as much detail on them as you can. Document when she doesn't hold up her end with the daughter, like when she bails on previously set plans. That way, if she does take your husband to court, he will have a lot of ammo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "soumwise",
            "body": "NTA, but your husband and his ex-wife sure are.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrsgip",
            "body": "No Erica is a racist B. You could have been more tactful, sure. But you have every right to speak what your own language at home and pass it on to your kids. Sophie’s brothers will speak Hindi so why can’t she pick it up too? What’s wrong with learning another language? She will forever speak English. I think the best way to handle this is simply say “no.” And leave it at that. No comments. No justifications. You don’t owe it to her. NTA in my book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WildBlue2525Potato",
            "body": "If Sophie can also grow up bilingual, that will serve her well in the future. Also, growing up bilingual will make learning additional languages much easier. Most polyglots grew up bilingual. \n\nAlso, it's your home and your kids so someone who doesn't live there, pay rent, or any other expenses is pretty entitled to try to dictate to you what you can and cannot do 8n your own freaking house. Seriously??\n\nYou did the right thing by apologizing. But it would appear that there are some thorny issues with Erica being biased, if not actually racist. So, please tread carefully but also be alert to possible negativity.\n\nI do have a question though. 🤔 How are you and your spouse going to respond if/when Sophie requests to learn Hindi? You and your spouse need to discuss that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DuckGold6768",
            "body": "Sounds like you got set straight by people about the custody thing, but I just want to point out that Sophie is probably picking up the Hindi and speaking it around you to feel included. I hope her mother's possessiveness and racism doesn't make you feel like you need to keep her at arm's distance. She would probably love it if you spoke Hindi to her like you do for her brothers and maybe teach her more about your culture. Great way to save her from picking up her mom's attitude.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scragglymonk",
            "body": "Figured the gay thing within a few lines\nMaybe get all the kids to be bilingual ?\nNTA ",
            "score": 1,
            "replies": []
        },
        {
            "author": "mongotongo",
            "body": "NTA : You are doing that girl a favor (even if it is just a few words).  The ex wife is being a bad mom.  She should be grateful that her child is learning.  Not trying to prevent it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExtraLengthiness5551",
            "body": "Tell both your husband and his racist ex wife to pound rocks!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Contemplating_Prison",
            "body": "#NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational-Signal47",
            "body": "What about asking Sophie not to use Hindi around her mom, since mom doesn't understand it? Eight is old enough to have this conversation. You are NTA. Why not realize that Sophie speaking Hindi makes her mom feel left out? You are an adult.  Try to find a path that works for everyone, including Sophie's mom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Obrina98",
            "body": "Erica’s an idiot. Learning Hindi will in no way harm Sophie and may even giver her an edge in some jobs markets. \n\nBesides, Erica cannot police your language choices in your own home. She’s way out of line, especially for an inconsistent mother.",
            "score": 1,
            "replies": []
        },
        {
            "author": "millimolli14",
            "body": "NTA in any way! Erica is an absolute ass though, your house she has no rights to comment!",
            "score": 1,
            "replies": []
        },
        {
            "author": "sparkly____sloth",
            "body": "INFO \n\nYou didn't know Sophie had picked up any Hindi. So were you talking to your children in a language you thought she doesn't understand and excluding her?",
            "score": 1,
            "replies": []
        },
        {
            "author": "___Moony___",
            "body": "INFO: Is Sophie somehow missing out on communication or socialization because she isn't directly being taught Hindi?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Equivalent_March3225",
            "body": "I would be very happy if my daughter started picking up another language regardless of what language it was. Regardless of my personal beliefs (I'm an Atheist) I believe you should be respectful and open  to learning about other cultures, religions and customs/beliefs even if there are things you do not believe or agree with yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MuppetManiac",
            "body": "NTA. You either get to decide how your child is raised or you get to make someone else do it. Not both.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medusa_7898",
            "body": "Your house, your rules.  I doubt a judge would have a problem with you teaching  the children in the home to be bilingual.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AeroMysticss",
            "body": "NTA. It’s your right to speak your language in your home, especially when it’s part of your culture. Erica overstepped by asking you to limit your use of Hindi, and it’s understandable why you’d stand your ground. Apologizing for the custody comment was a good move, but you shouldn’t have to apologize for speaking your language or passing on your culture to your kids",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sissy_lover80",
            "body": "Erica needs to get off her high horse. So what if Sophie learns Hindu? My guess is that Erica would feel weird not speaking a language her daughter knows and feeling like she's not on the same level. Too bad. My 2nd oldest (stepson, but MY boy) is fluent in English, Spanish, and ASL. Is doing pretty good with French and Japanese. And teaching himself Russian and German. He could cuss at me in multiple languages, and I'd have 0 idea, especially if he's smiling. It doesn't bother me at all. Erica needs to accept this gift and be happy for her daughter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheTinyHandsofTRex",
            "body": "INFO: are you close with your stepchild? Do you actively include her in your lives? \n\nBecause Jesus Christ, that's was an awful thing to say about her taking custody, especially with your husband right there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "13artC",
            "body": "Mostly NTA. It's your home & your children, Erica has no place saying anything. She was completely out of line.  She doesn't deserve an apology.\n\nHowever, you were out of line pulling your step daughter  custody into it. You had no right to do that & your husband should be mad at you. He loves his daughter & wants to keep her with his sons. That's a good father in action. You seem to have observed that you were in the wrong on this matter. Good for you. \n\nApologise for the custody comment only, but reiterate that you will continue yo speak hindo in your home to your children,  & that Erica has no place making racist comments about your language.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpaceCephalopods",
            "body": "NTA - you are doing a great thing by teaching them all Hindi. (Happy (belated) Holi!)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElectricShadeess",
            "body": "NTA, your house, your language! Honestly, Erica should be more worried about Sophie picking up 'Offo' than about your bilingual goals. Maybe next time, just teach Sophie some Hindi swear words to really throw her for a loop!",
            "score": 1,
            "replies": []
        },
        {
            "author": "mcindy28",
            "body": "NTA speaking more than one language is so useful and beneficial for their future.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fzooey78",
            "body": "She’s racist. It’s as simple as that.\n\nIf it was French you were speaking, I doubt that this would be the same sort of issue. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ontario_lives",
            "body": "Teach Sophie some smart-ass remarks in Hindi that she can use on her Mom.  If her Mom wants to know what she said, some white lies are in order.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrettyLyttlePsycho",
            "body": "Nta\n\nWhat's mom's plan when she learns her daughters learning new languages in school? Hearing it spoken while out in public?\n\nTo create an issue out of someone speaking a different language is pointless and frankly ridiculous..",
            "score": 1,
            "replies": []
        },
        {
            "author": "HunterGreenLeaves",
            "body": "ESH - Sophie can only benefit from the opportunity to pick up Hindi.  Requesting that she not learn a language in a household where it's one of the ones spoken was unreasonable.\n\nYou should NEVER have suggested that Erica take Sophie.  Your edit tries to backtrack on that but comes across as making excuses.  *How dare you.*  Erica, Sophie and your husband have reason to be angry and/or hurt by that.  \n\nYour husband and Sophie are the only ones that aren't a\\*holes in this situation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pebble-Curious",
            "body": "Every other language a child learns is great! My grandchildren, born in a multicultural family, speak fluently 3 languages. Their Mom and the other part of the family speak with them in French. My son and we always speak with them in our own language, and when we are all together, we all speak English. No one makes a fuss about that, and the kids are teaching us French. My grandaughter's caregiver was Farsi native speaker and my DIL actually encoraged her to use it when communicating with the child - the more languages the children are exposed to, the more easily they learn new ones. One has to be really narrow-minded to begrudge a child learning another language!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MinasMorgul317",
            "body": "The custody comment was a bit out of line i think, but it also sounds like tensions were high at that point and you said it more out of emotion than actually meaning that, and you clarified it with her and apologised. It sounds to me like Erica has some racism she needs to work on, and it was out of line for her to request you not speak your mother language in your own home",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clevernickname1001",
            "body": "NTA- it’s your house if you want to speak another language in your house it’s really none of her business.",
            "score": 1,
            "replies": []
        },
        {
            "author": "opusrif",
            "body": "NTA.  The ex needs to learn that other people exist.  I think that Sophie is picking up words in another language is awesome and will likely help her in later life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LadyFoxfire",
            "body": "Why is she mad that her daughter knows Hindi words? NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MansikkaFI",
            "body": "I speak close to 10 languages (have 2 mother tongues on mother tongue level, in reality 3 but didnt learn my third to mother tongue level which is my own fault), of which 6 fluently, and the rest some better some worse, still improving.  \nIts always great to be able to switch and as a student made a lot of extra money easily as I did translation/interpreter work plus met interesting people, etc (worked at a theatre festival once for example and at one Eurovision as well as a student helper for some bands).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lizardgirl25",
            "body": " NTA maybe the comment was out of line but it sounds like she is letting down her own daughter all the time. You need to sit down a speak seriously with your husband and the fact that her daughter your step daughter is being let down by her mother. That it is only fair she can speak a second language if she wants to learn Hindi with her brothers and possible sisters if you two have more kids too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Roadgoddess",
            "body": "NTA- for speaking Hindi in your own home. But definitely a soft a H for the way you talk to Erika. At the end of the day, kids are going to pick up on things when they’re in their home. And you’re giving her a great gift of being bilingual. There’s so many pluses that are shown to brain development for children that speak more than one language, I say keep it going",
            "score": 1,
            "replies": []
        },
        {
            "author": "alicat777777",
            "body": "You are ridiculous for immediately acting like Sophie is fully expendable and the ex is welcome to take her away. \n\nShe is equally out of line telling you not to speak your language in your own home. It would be great for all of the kids to be bilingual anyway. \n\nBut you are still YTA for saying that. Your husband’s first child is no more expendable and optional than your kids.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Debt9785",
            "body": "NTA! Sophie should be allowed to learn any language she likes. Knowledge is power!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Midnight-Rants",
            "body": "NTA at all!",
            "score": 1,
            "replies": []
        },
        {
            "author": "AMP121212",
            "body": "Being bilingual is a superpower. You should teach her more Hindi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comfortable_Ad_4530",
            "body": "If she doesn’t want to parent her kid, she doesn’t get a say in how someone else does. 🤷🏾",
            "score": 1,
            "replies": []
        },
        {
            "author": "KeikoKaizen",
            "body": "NTA, it‘s your house, your choice of education. Erika is allowed to be against Sophie learning it though, but than she should forbid Sophie to speak it, not you. Nonetheless, speaking multiple languages is a beautiful thing, hope this turns around positively for all parties.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Panda_official2713",
            "body": "Tell her that if she doesn't want her child speaking Hindi, then she should seek full custody. She doesn't get to dictate the languages spoken in your home, and it's racist of her to not want her child to be fluent in another language for no reason. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "paprikahoernchen",
            "body": "Ohh, your kids will be bilingual, just as your husband, as you wrote that he's bi? :) \n\n  \n(Lmao I'm sorry)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Resident-Ad-7771",
            "body": "You were human and expressed yourself in a way that could be misinterpreted if the listener so desires. What she is asking is ridiculous. I would love for her to complain to the court that her child is picking up a few words in a second language. What a gift in todays world to know Hindi. There is an AH here but it’s not you. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Who_Am_I_1978",
            "body": "NTA for teaching your children to speak Hindi.\n\nBut you are TA for not also intentionally teaching Sophie! She is your daughter as well, she lives with, when you married your husband, you agreed to be her father as well. Stop separating the children as your children and Sophia…that poor girl. \n\nYou also TA for the custody comment…which I’m going to assume you said in front of Sophia? If I was your husband, I would be pissed at you at you as well! It’s is obvious that her mother isn’t a very nice person, do you want your husband to have to go back to court for full custody again because of your comment? \n\nStop bickering with Sophie’s mother… stop making it more difficult for her and your husband. It’s your job to protect all three of your children and to treat them all equally. Step up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Who_Am_I_1978",
            "body": "NTA for teaching your children to speak Hindi.\n\nBut you are TA for not also intentionally teaching Sophie! She is your daughter as well, she lives with, when you married your husband, you agreed to be her father as well. Stop separating the children as your children and Sophia…that poor girl. \n\nYou also TA for the custody comment…which I’m going to assume you said in front of Sophia? If I was your husband, I would be pissed at you at you as well! It’s is obvious that her mother isn’t a very nice person, do you want your husband to have to go back to court for full custody again because of your comment? \n\nStop bickering with Sophie’s mother… stop making it more difficult for her and your husband. It’s your job to protect all three of your children and to treat them all equally. Step up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vicious133",
            "body": "NTA. Your home you speak whatever language you want and teach your kids any language you want. I wouldn’t allow my husbands ex to attempt to dictate anything to me in my home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bibliophilewitch",
            "body": "NTA and Sophie would benefit from learning a new language (which she obviously wants to do).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bibliophilewitch",
            "body": "NTA and Sophie would benefit from learning a new language (which she obviously wants to do).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bibliophilewitch",
            "body": "NTA and Sophie would benefit from learning a new language (which she obviously wants to do).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweet_Vanilla46",
            "body": "NTA your house, your rules. She has zero rights to limit your cultural freedom in your own home. If she doesn’t like it, she can stay out of your home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clean-Fisherman-4601",
            "body": "NTA. I don't understand why the ex doesn't want her child to learn another language. Is she a bigot? \nI wish I had learned one as a child. \n\nApparently the child is intelligent enough to learn and information is always an asset.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lane_of_london",
            "body": "Being able to talk 2 languages is great, but not if your stepdaughter is left being unable to communicate. It's isolating, and by the way you speak, maybe you like isolating the girl  I think maybe your not that nice of a person",
            "score": 1,
            "replies": []
        },
        {
            "author": "ML_1190",
            "body": "NTA. I never understood why people have a problem with a child learning multiple languages. Limiting languages is just stupid. The more languages a person speaks the more doors are open for them. Keep at it, she should be happy her daughter is getting a \"free\" language from het other parents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thekroganqueen",
            "body": "I can’t imagine complaining that my child was learning a language. Possibly could have handled the custody/responsibility conversation better, but definitely NTA. Your husband should be backing you. How wonderful that Sophie has the opportunity to learn Hindi and share that with her brothers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GingerHeSlut",
            "body": "In my line of work, and in several areas tangentially related to my line of work, Hindi speakers are rapidly increasing in population. I would love to be able to interact more freely with them in their own language. Even if it's only accidentally, you are giving her a great gift that can open her world up in the future. Other than being a bigoted AH, I'm not sure what Erica's problem is. Trying to inhibit this learning is quite literally stealing opportunity from her own daughter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thesheeplookup",
            "body": "Don't stop speaking Hindi! Maybe your hubby should have the conversation with his ex.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Orsombre",
            "body": "It is great that Sophie picks up a bit of Hindi, even if it is not her ethnic culture. Being raised with you and with her siblings means that Hindi is now part of her own culture. Bilinguism is such a richness, Sophie and your kids are lucky.\n\nAs her mother is obviously racist, I'll call it karma.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DesperateToNotDream",
            "body": "Ask her why she wants her daughter to be less educated",
            "score": 1,
            "replies": []
        },
        {
            "author": "tossit_4794",
            "body": "I wish I was raised bilingual but my parents thought it would result in me having an accent.  We now know this not to be true.  I’m terrible at it from trying to learn it in college and the dialect taught in school makes my actual family just shut down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hari_Is_Dave",
            "body": "so youre trans? who is their by birth parent",
            "score": 1,
            "replies": []
        },
        {
            "author": "CalyxTeren",
            "body": "Good for you. She should be ecstatic that her daughter is getting free immersion language training! I would LOVE to have learned Hindi, or any other language, in the home. Your response was *chef’s kiss* perfect. Get your husband on side.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loud-Performer-1986",
            "body": "No way. Sophie learning Hindi will allow her to talk to her little brothers bilingually and even if she never uses it for anything else, it will allow her to communicate with her brothers in two languages and gives the kids connection.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Swiss_Miss_77",
            "body": "NTA. Just tell Erica \"NO. You get no say in what happens in this household.\" And stop inviting the ex into your home if she wants to be racist trash.",
            "score": 1,
            "replies": []
        },
        {
            "author": "digitalreaper_666",
            "body": "Teach sophie all the hindi you can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mama_Milfy_San",
            "body": "NTA and your comment isn’t out of hand. She has a lot of nerve telling you do anything in your own home when she doesn’t even have control of hers, let alone being racist while doing it. Oof,  the audacity!",
            "score": 1,
            "replies": []
        },
        {
            "author": "H_Lunulata",
            "body": "NTA and the ex can go commit a self-serving sex act for even making the request.\n\nit's your house, speak whatever language you like.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thesheeplookup",
            "body": "Don't stop speaking Hindi! Maybe your hubby should have the conversation with his ex.",
            "score": 1,
            "replies": []
        },
        {
            "author": "maccrogenoff",
            "body": "NTA This is a hill you should die on. \n\nTwo of the greatest gifts you can give a child are teaching them about their culture and teaching them multiple languages.\n\nYour stepdaughter’s mother should be thanking you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chxrryxbombx",
            "body": "As a brown person, I bet Erica would have been totally fine with Sophie picking up another language if it wasn't an Indian language.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Print-Over",
            "body": "I would love for my children to learn a language that is spoken in a country that is the biggest democracy in the world.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quix66",
            "body": "Tell ex to f-off. If anything learning second languages improve over all learning,  and learning a new language even late in life can help stave off dementia. Furthermore, SD could have more career opportunities as a bilingual speaker. \n\nMost of all, it's your house so how dare she tell you how to behave in it!?! You're not abuxing SD or anything do she definitely has no say how and when you teach _your_ kids. \n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DisembarkEmbargo",
            "body": "I can't give a great vote so I'm going with ESH. Erica is an asshole for being a racist and getting upset that Sophie knows random Hindi words. Erica is also an asshole for skipping out on hanging with Sophie. \n\n\nYou are an asshole for just saying that she should get more custody without your husband's input. Especially since she bails on her kid alot she probably has some cognitive dissassonce going on and thinks she can handle Sophie alot more. \n\n\nLastly, not a judgement but advice: you should teach Sophie more Hindi. You said Sophie is only saying random words - why not teach her some sentence structure? Or common phrases? They can only help in the future. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mbt_Omega",
            "body": "ESH. I was on your side until the end, but YTA for encouraging Erica to take full custody, potentially setting off a costly and disruptive custody battle so you could be petty. That was remarkably stupid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Efficient-Tailor7223",
            "body": "NTA bilingual is advantageous in the world. \n\nHis ex wife is over stepping. But, ya know, colonizers gunna colonize. 🤷‍♀️  classic English behavior",
            "score": 1,
            "replies": []
        },
        {
            "author": "redbeardedlumberjack",
            "body": "Erica is TA. Your husband is TA too, he should have backed you up. The request from Erica is unreasonable and while subjective the request disadvantages her child when it could become an advantage to her.\n\nYou could have been less confrontational in your response (I’m saying could, not should), but Erica started and escalated things, NTA for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maleficent_Theory818",
            "body": "You could have been a teeny tiny AH for the comment about the custody, but in your edit, you said you apologized.  \n\nI would talk to your husband and discuss the situation with him.  You don’t say what nationality your husband and ex are.  You need to let him know that if you were speaking any language found in Europe she wouldn’t have made that comment.  It is because it is Hindi.  This is racism.  Let him know about the other comments.  \n\nIt is your home, teach your boys to appreciate their culture and language.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ghostoftommyknocker",
            "body": ">And if you have a problem, then you should take full custody of Sophie.\"\n\nThat is an awful thing to say, and I hope Sophie didn't hear that.\n\nYou are 100% right to defend your right to raise your children speaking whatever languages you want them to speak. But do not ever weaponise Sophie's custody arrangements. Not only could that leave Sophie feeling like she's not welcome or that she's a burden, but it could backfire on your husband's custody arrangements of his own daughter. It's understandably anxiety-inducing for your husband.\n\nYou need to apologise to your husband and her for that comment alone, but not for defending your right to speak the languages of your choice in your own home. Absolutely do not apologise for that and feel free to make that distinction very clear.\n\nIf Sophie overheard the custody comment, you should apologise to her, too.\n\nOne hundred per cent defend your rights, but please be careful about how you defend them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JohnnyKarateOfficial",
            "body": "> And if you have a problem, then you should take full custody of Sophie.\n\nGets reamed out and then lies and says he a realized it was wrong, repeats it here with no mention of apology until said reaming. \n\nSo you’re an asshole and a liar?",
            "score": 1,
            "replies": []
        },
        {
            "author": "spongebobwagglepants",
            "body": "You would be doing Sophie a favor by teaching her Hindi too.  No one would give her mum full custody over that issue, so I don’t see that your husband has anything to worry about.  In fact, her mum trying to stifle her education would be a bigger problem.  Why is your husband backing her up though?  That is a problem!",
            "score": 1,
            "replies": []
        },
        {
            "author": "That_Old_Cat",
            "body": "YTA, for what you said about custody of Sophie.  Indirectly or directly teaching Sophie Hindi is a great way for the two of you to connect and for her to bond with her siblings.  \n\nEx-wife is pretty arrogant trying to rule on what language you may use in your house.  Frankly, that's bigoted, and Sophie might benefit later in life from learning Hindi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_Dont_Like_Rice",
            "body": "When you threaten to simply throw away your husband's child when she becomes inconvenient to you, yeah, that makes you a giant AH. You chose to make the decision all on your own without even talking to your husband. And that's his daughter you're threatening and weaponizing. OMG. YTA\n\nThis is a divorcable offense, imo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accomplished_Fig3903",
            "body": "Maybe u could have asked her why it bothered her. But yeh step to far and u owe her an apology",
            "score": -9,
            "replies": [
                {
                    "author": "notasandpiper",
                    "body": "After the ex apologizes for making inappropriate requests about how OP should raise the kids in her own home?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "KaetzenOrkester",
                            "body": "His",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professional_Sky5261",
            "body": "NTA for speaking your natuve language in your home.\n\n\nBut.\n\n\nYTA for discussing your HUSBAND'S custody arrangement with the mother of his daughter. You stepped way out of bounds. \n\n\nYTA for something else, and I'm gonna get downvoted, but as proud as people are to speak their native language, there is a thing about not excluding people. I am a polyglot (4 fluent, 2 proficient). When I am in a group of people, in my home or outside my home, I speak the common language of the group. I don't speak to my children in a language my husband doesn't understand while my husband is there. It's rude. Your husband's ex wife, regardless of your disdain for her or hers for you, was your guest, and you sat there in front of your guest and had a conversation in a language you knew your guest didn't understand. I'm guessing this happens in front of your step daughter a lot, and kids are awesome at picking things up, but have you ever tried to teach her directly so she can join you, or at least not feel excluded in HER home (because she lives there too)? \n\n\nI'm not saying AT ALL to not speak your language in your home, nor that you should always include everyone in your conversations, but while you're teaching your sons, your language, teach them courtesy and manners, as well.",
            "score": -3,
            "replies": [
                {
                    "author": "msplace225",
                    "body": "She’s not a guest, she lives in the home.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crimsonfangknight",
            "body": "Yta because your pretty clear in your intention to cause tension and strife in your husbands co parenting relationship with his ex.\n\nWhy she fumbled the topic its clear the ex brought it up because its kind of annoying to have a kid talking in a language that isnt spoken in your home. \n\n\nAlso being bi lingual is awesome……its in poor taste to primarily use a language you know your guest doesnt speak around them. Its rude behavior.\n\n\nIf you only spoke\nHindi its one thing but your clearly fluent in english and your kids will speak both.\n\n\nIf your all switching to hindi your doing it so she cant understand you and thats rude af",
            "score": -13,
            "replies": [
                {
                    "author": "msplace225",
                    "body": ">Yta because your pretty clear in your intention to cause tension and strife in your husbands co parenting relationship with his ex.\n\nThats not clear at all\n\n>Why she fumbled the topic its clear the ex brought it up because its kind of annoying to have a kid talking in a language that isnt spoken in your home. \n\nIt is spoken in her home, as she lived with OP. \n\n>Also being bi lingual is awesome……it’s in poor taste to primarily use a language you know your guest doesnt speak around them. It’s rude behavior.\n\nWho said anything about it being the primary language? Even so, the ex is not a guest, she lives with OP. She doesn’t get to dictate what language OP speaks in his own home. \n\n>If you only spoke Hindi it’s one thing but you’re clearly fluent in english and your kids will speak both.\n\nYes, which is exactly what the ex has an issue with. \n\n>If your all switching to hindi your doing it so she cant understand you and thats rude af\n\nNothing about this post suggests that’s what happening",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adventurous-Term5062",
            "body": "NTA. Sophie’s mom sounds racist. Who cares if she speaks another language? It is a valuable skill.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Secret_Double_9239",
            "body": "NTA his ex seem ignorant and if he’s okay with that then he’s part of the problem as well.",
            "score": 0,
            "replies": []
        },
        {
            "author": "universalrefuse",
            "body": "NTA - Stay the course! Multilingual parenting is a huge challenge and your kids will be so advantaged by knowing a second language in the future. Plus, it will be a fun way for the boys and Sophie to communicate with each other as they get older.",
            "score": 0,
            "replies": []
        },
        {
            "author": "TinyHavoc",
            "body": "Definitely NTA, like you said in your edit if she has such a problem with it then she should take more responsibility of her, and if she got upset it's because she knows that she is wrong. Don't let Erica's racist thoughts rub off on Sophie and praise her for picking up on the language like that! Learning multiple languages broadens your horizons and knowledge of the world.",
            "score": 0,
            "replies": []
        },
        {
            "author": "queenlegolas",
            "body": "Erica sucks and your husband sucks too. She's being racist and he's being complacent. NTAH",
            "score": 0,
            "replies": []
        },
        {
            "author": "JaneAustinAstronaut",
            "body": "NTA.  OMG Sophie would benefit soooo much from learning another language, even if it wasn't her culture!\n\nIf as she grows up she comes across other Hindis and speaks it with them, they will adopt her and feed her.  She will get all the invites to all the cookouts!\n\nAt this point, you'd be doing her a disservice if you exclude her!",
            "score": 0,
            "replies": []
        },
        {
            "author": "roppunzel",
            "body": "You should ignore what she's saying and actually you should make a conservative effort to speak to her in Hindi also. That way she won't feel left out and she will feel left out if you don't.",
            "score": 0,
            "replies": []
        },
        {
            "author": "dreadwitch",
            "body": "NTA. If she doesn't want her kid to have the pleasure of being bilingual then she's not the best parent. I'd be more than happy if someone had taught my kids another language.\nShe sounds jealous that she can't look after her kid properly and you're doing a better job of it.\n\nIgnore her, tell your husband to grow up and support you rather than his ex and carry on... Personally I'd make sure to teach the kid Hindu properly alongside the twins.",
            "score": 0,
            "replies": []
        },
        {
            "author": "thegeniuswhore",
            "body": "NTA for wanting to speak YOUR first language in YOUR home. YTA for that custody comment. best hope sophie hadn't heard you or else you're the second dad who doesn't want sophie either. and in front of your husband?? good job OP.",
            "score": 0,
            "replies": [
                {
                    "author": "thecdiary",
                    "body": "he rectified his mistake as soon as he said it though.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "thegeniuswhore",
                            "body": "you still can't un-say things. it was an asshole comment. OP was justified to be upset and snap back but it doesn't make him not the AH. especially since we don't know how sophie is handling the divorce and remarrying. why give her a possible second father figure that seems to not want her?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "thecdiary",
                                    "body": "eh, i dont think he meant it in that way at all. clearly he meant that sophie's mother isn't around much to order him around like that. even then, an apology was in order and he apologised quickly. \n\ni personally think the racism is a bigger problem but oh well.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "thegeniuswhore",
                                            "body": "i think the racism is a massive issue but that is a whole separate conversation. i agree mom is entirely the creator of this problem and idk why OP isn't pushing to get her to leave. but saying essentially \"leave and take the kid with you\" in front of the bio dad on top of it all is still pointing some of this anger toward an 8 year old",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BillyShears991",
            "body": "Yta. You’re the step parent that throws away your partners kid after you have your own.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Pristine_Frame_2066",
            "body": "Nope.  She does not have a choice.  She had a child who is picking up a language when she is with her dad, and she should be grateful.  Multilingual kids turn on extra brain power.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Who_Am_I_1978",
            "body": "NTA for teaching your children to speak Hindi.\n\nBut you are TA for not also intentionally teaching Sophie! She is your daughter as well, she lives with, when you married your husband, you agreed to be her father as well. Stop separating the children as your children and Sophia…that poor girl. \n\nYou also TA for the custody comment…which I’m going to assume you said in front of Sophia? If I was your husband, I would be pissed at you at you as well! It’s is obvious that her mother isn’t a very nice person, do you want your husband to have to go back to court for full custody again because of your comment? \n\nStop bickering with Sophie’s mother… stop making it more difficult for her and your husband. It’s your job to protect all three of your children and to treat them all equally. Step up.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Affectionate_Tip6601",
            "body": "All this mess can obviously be a 'curse' on you, going against 'nature', and there will be many more coming in your way as you get older.  If you go against 'nature', you'll be revenged by nature today or tomorrow. It is true like tomorrow's sun!\n\nI wonder why Erica is insane to keep her daughter between two weird males sick to the core in their minds, even though one happens to be the father of poor Sophie!   \n\nHow shamelessly the second update has been added to this nauseating story.  It would be better to chop off your pecker and feed the fish with it!",
            "score": -1,
            "replies": []
        },
        {
            "author": "korverx26",
            "body": "Yta",
            "score": -1,
            "replies": []
        },
        {
            "author": "heyelander",
            "body": "Honestly, I think you're TA for speaking Hindi around her and not making more of an effort to teach her. That's seems very ostracizing.",
            "score": -2,
            "replies": []
        }
    ]
}