{
    "title": "AITAH for not helping my friend pay for her engagement ring after she asked me to pitch in?",
    "author": "FrostyShinyWhisperq",
    "subreddit": "AITAH",
    "rank": 17,
    "score": 359,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 260,
    "url": "https://www.reddit.com/r/AITAH/comments/1je5sps/aitah_for_not_helping_my_friend_pay_for_her/",
    "id": "1je5sps",
    "selftext": "I (24F) have a friend Olivia (25F) who recently got engaged. She’s been with her fiancé for a while, and when she told me the news, I was genuinely happy for her.\n\nA few weeks later, Olivia came to me and said that the ring her fiancé gave her was too small for her taste and that she was thinking of getting it upgraded. I assumed it would just be something minor—maybe resizing or adding a different band. But then she asked me if I could help pay for the upgrade.\n\nShe explained that she didn’t have enough savings to cover the cost of a new, bigger ring, and that she didn’t want to ask her fiancé to foot the bill because she didn’t want him to think she was ungrateful. She said she knew I had some extra money saved from my recent job and was wondering if I could “just pitch in.”\n\nAt first, I was shocked, then I politely explained that while I totally understand her wanting a ring she loves, I didn’t feel comfortable paying for a part of her engagement ring. I told her I could offer support by listening, or even help with other wedding-related things, but when it came to spending thousands of dollars on a ring, I wasn’t comfortable putting that kind of financial strain on myself.\n\nShe wasn’t happy with my response and called me “selfish” for not being more supportive of her happiness. She said that since I was doing well financially, it would be a nice gesture to help her out and that it wasn’t like I would miss the money.\n\nNow she’s been distant, and I’ve gotten some odd looks from other friends, who say I should have helped because “it’s just a ring.” But I still feel like it’s not my responsibility to pay for someone else’s engagement ring, no matter how much I care about them.\n\nAITAH for refusing to help her pay for her ring?",
    "comments": [
        {
            "author": "None",
            "body": "Life lesson. Money and friendships don't go hand in hand. I used to be generous with my frnds and never got the money back.  Unless it is very big medical emergency or anything. I will never give it to any frnd. Nta and stay firm",
            "score": 206,
            "replies": [
                {
                    "author": "GabrielleArcha",
                    "body": "Also, it's probably best that she distanced herself from OP because judging from this entirely bizarre request, wedding planning request might've reached outer space levels of ridiculousness.",
                    "score": 89,
                    "replies": [
                        {
                            "author": "RaspberryLittleBaby",
                            "body": "It’s not your responsibility to pay for someone else’s engagement ring no matter how close you are",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "MikeBristol1",
                                    "body": "Olivia is being unreasonable by expecting her friend to pay for the ring upgrade. It's not selfish to set boundaries, especially with something so personal and costly.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Apprehensive_Skin150",
                                            "body": "She is unreasonable for wanting to upgrade the ring.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SpringBabyFlower",
                            "body": "It’s not fair to blame you for her choices though",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Usual-Canary-7764",
                    "body": "The friends who say she should have helped can donate their money to that lost cause.\n\nStay clear...stay far and let Olivia's craziness implode around her. NTA",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "mca2021",
                    "body": "Another life lesson, keep your finances to yourself.  It;s no one's business what you make, how much you save etc.\n\nIt's beyond ridiculous for anyone to expect a friend to help pay for a ring upgrade.  All these friends who are saying \"it's just ring\" can pitch in.  \n\nHow much additional money did she want?  I just can't believe the gall of some people\n\nNTA",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Accomplished_Tea9445",
                            "body": "Get her friends to put their money were there mouth is and pitch in she's a ungrateful cow",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "5footfilly",
                    "body": "Telltale signs of a fake post-\n\nThe word distant.\n\nNegative reactions from third parties when the OP is clearly not in the wrong.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Chewbuddy13",
                            "body": "Yes, this is just like all these other bullshit posts. \"My husband ran a train on my mom, sister, brother, and best friend, in my bed while I was away at Bible study. I was mad, but my friends said I'm overreacting and it's no big deal, AITA?\"",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "FlakyAddendum742",
                            "body": "This. This right here. Y’all are super gullible.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "half_way_by_accident",
                            "body": "And overuse of quotation marks.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rude_Vermicelli2268",
                    "body": "This 100%. Stop discussing your finances with friends and family. For many the knowledge that you have a nest egg just makes them dream up ways to spend it for you. \n\nTell any “concerned” friend that you aren’t a party to their relationship and have no responsibility for the ring size. Frankly I would be rethinking my relationship with such entitled idiots.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Valuable-Series-2843",
            "body": "This can’t be real",
            "score": 128,
            "replies": [
                {
                    "author": "CinnamonBlue",
                    "body": "Too stupid to be real.",
                    "score": 70,
                    "replies": [
                        {
                            "author": "James-181901",
                            "body": "So stupid.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Material_Assumption",
                                    "body": "The reasons is the tell tale for me.\n\nHuman: no I'm not going to dip into my savings for you to buy a bigger ring, I need it for house/retirement/kids blah blah blah\n\nAI: although i can't help you financially with your ring. I can offer you alternative support by listening and providing constructive criticism.... blah blah blah",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "Shadow4summer",
                                    "body": "Stupid enough to be real. The overentitled are taking over it seems. Plus, what’s her fiance going to think when she shows up with a bigger/fancier ring?  It’s really going to hurt him.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "grouchykitten1517",
                                            "body": "I'd buy it if she didn't end with a bunch of people agreeing.  Ill buy one entitled friend, even a crazy supporter of entitled friend, i won't buy a significant number of people thinking this is reasonable.  Nope.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Shadow4summer",
                                                    "body": "It’s amazing the number of people that would say this is okay. But they are like the ones that always say be the bigger person. It’s easy to say when it’s not them.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "HeyPrettyLadyMaam",
                                    "body": "Thank you. Its beyond stupid. No one asks a friend to help \"upgrade\" an engagement ring. AI isn't even trying to make it plausible.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Zardozin",
                            "body": "It has the classic “just a” quote, this is the chatbots new favorite phrase, it replaced “\n family helps family. “",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Martha90815",
                                    "body": "This part right here.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Far-Season-695",
                            "body": "It’s always telling when friends or family can’t believe how unreasonable an OP is for not going with some insane request",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jttechie",
                    "body": "The way it's written suggests it's AI",
                    "score": 24,
                    "replies": [
                        {
                            "author": "ReadyAd5385",
                            "body": "They never think to clean it up, too. It's always copy and paste 🙄",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "half_way_by_accident",
                                    "body": "Seriously! It would be so easy!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Alternative-Golf8281",
                    "body": "Has a bunch of AI red flags. I'm with you",
                    "score": 7,
                    "replies": [
                        {
                            "author": "roadfood",
                            "body": "Em dash.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nitricx",
                    "body": "Honestly I can’t trust shit anymore on Reddit, this has to be fake. Because it’s so stupid if it were real it wouldn’t need a post. Cmon man! \nIf half these posts are real this world is doomed.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Empty_Antelope_6039",
                            "body": "Yeah, it's quite bothersome that so many posts in /AITAH are obviously bullshit and fake.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aggravating-Pie-5565",
                    "body": "Right?! Like it's such a ridiculous thing to ask a friend to pay for your engagement ring?! Who would do that?! Like I know there are shameless people out there but this is next level shit...😂",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "DoNotKnowItAll",
                    "body": "100% fake. I haven’t heard an adult call another adult “Selfish” in the wild for 20 years.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "RaspberryLittleBaby",
                    "body": "If she wants a bigger ring she should discuss it with her fiancé not ask her friends to pitch in",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "tall-not-small",
                    "body": "It's not.  It's ai",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "DynkoFromTheNorth",
                    "body": "No. Because if you don't want the partner to pitch in not to hurt his feelings, how will he never notice the upgrade?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Saint_Blaise",
                    "body": "It's not. There are multiple accounts posting similarly outrageous stories as 24Fs.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GGLSpidermonkey",
                    "body": "Written same way as most AI garbage here",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "roadfood",
                    "body": "Chatgpt crap on a new account.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "germanium66",
                    "body": "It's not, identical story posted here a while ago.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "InnocentlyInnocent",
                    "body": "I thought this was from r/amitheangel 😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lostpassword100000",
                    "body": "It’s not. It’s the same format used on many in this thread.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "welestgw",
                    "body": "Has to be made up, no one is that brazen.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Illustrious-End4657",
                    "body": "It’s not",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SpringBabyFlower",
                    "body": "You did the right thing by standing your ground it’s a big financial commitment and it’s not your responsibility",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sitnquiet",
            "body": "The weirdest part about these AITAH posts is that last paragraph, where somehow the OP is facing multiple mutual friends (or sometimes family) supporting the ridiculous demand. \n\nIt just breaks the willing suspension of disbelief that this kind of situation - a new fiancée going behind her future hubby's back to ask a friend to spend thousands of saved dollars so she can upgrade her engagement ring - could ever happen in the entire timeline of the universe.",
            "score": 49,
            "replies": [
                {
                    "author": "CinnamonBlue",
                    "body": "Too unbelievable to be believable.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "SunshineInDetroit",
                    "body": "900% of these read like AI in the bottom third of the story. it's just stupid.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "grouchykitten1517",
                    "body": "That's why it misses me off so much.  You get into the story, assuming sure it's probably fake but hey we're entertained, then bam it's so unrealistic you can't enjoy it anymore.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pabloshooman",
            "body": "This cannot be real.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Full_Pace7666",
            "body": "NTA at all. That was kind of a strange ask to begin with.",
            "score": 30,
            "replies": [
                {
                    "author": "lexi_Xo31",
                    "body": "Very strange honestly",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mdthomas",
            "body": "EDIT:  this is too obvious of a judgment to be real. \n\nYTA",
            "score": 18,
            "replies": []
        },
        {
            "author": "Metalheadzaid",
            "body": "More AI stories for the bucket.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Odd_Task8211",
            "body": "YTA - No way this is real.",
            "score": 7,
            "replies": []
        },
        {
            "author": "nuwildcatfan",
            "body": "YTA for an obviously fake story.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Kushbeast666",
            "body": "These writing essays aren't even fuckin trying anymore",
            "score": 5,
            "replies": []
        },
        {
            "author": "Beachboy442",
            "body": "NTA................moocher is trying to use you.  NOt a friend",
            "score": 7,
            "replies": []
        },
        {
            "author": "Tu4dFurges0n",
            "body": "Lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "Significant_Topic297",
            "body": "If this is a genuine post, I really don't see how you didn't break out in laughter.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Due-Contact-366",
            "body": "This isn’t real. But if it is, you need new friends all around. Drop her.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mikeyflyguy",
            "body": "Tell the fiancé. This dude better run. He’s in for a life of financial shitstorms on the regular.",
            "score": 3,
            "replies": []
        },
        {
            "author": "acoubt",
            "body": "These fake stories always end on \"some friends/family say I'm in the wrong because it's just (insert item/action)\". \n\nEverytime 😂",
            "score": 3,
            "replies": []
        },
        {
            "author": "MagicCarpet5846",
            "body": "Is there anything at all that you’ve done with, for or around her that you think made her think it was appropriate to ask you to pitch in? Do you have a history of giving people money? Otherwise, WTF?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Tall-Poem-6808",
            "body": "Either all these posts are AI BS, or y'all really have shitty friends!!\n\nNTA, obviously.",
            "score": 2,
            "replies": []
        },
        {
            "author": "you-did-ask",
            "body": "You did just one wrong thing - you should have laughed out loud when she suggested ‘upgrading’ her engagement ring. \n\nAs for anyone else thinking you should help … they’ll be coming to you next. \n\nPity the poor sod who thinks he has a future with her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "suiseki63",
            "body": "What is the fiancé gonna think about her getting a bigger ring on her own?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Salt-Ad1282",
            "body": "Warn her fiance to get out of that while they can, and no, don’t give her any cash.",
            "score": 2,
            "replies": []
        },
        {
            "author": "starinmyownmind",
            "body": "NTA don't you love when people call you selfish for not giving in to their selfish wants. This is not a need or something she will die over she's just a selfish entitled person who isn't satisfied with what she has and instead of working hard and getting what she wants for herself she'd rather beg and guilt trip others into doing what she wants right now. I would shame this thing in front of everyone any chance I got but I'm petty like that. So no your not wrong at all and maybe reconsider this friendship who needs this kind of person in their lives",
            "score": 2,
            "replies": []
        },
        {
            "author": "theskyalreadyfell217",
            "body": "That’s crazy. I would say you shouldn’t help because it is just a ring.  Why didn’t they all pitch in on it.  \n\nYou have a terrible friend group.",
            "score": 2,
            "replies": []
        },
        {
            "author": "speckatacular",
            "body": "YTA because this is an AI-generated post.\n\n* OP's \"age\" is 24\n* Brand-new account\n* M-dashes make an appearance\n* Obvious NTA situation but asks AITA, yet\n* \"Friends\" say OP should have paid",
            "score": 2,
            "replies": [
                {
                    "author": "Fiend_Nixxx",
                    "body": "What do you mean M-dashes? Like the 'minor-maybe'? Is that a dead giveaway it's AI?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lastunicorn76",
            "body": "Who are these people saying you should have helped. Tell them to open their wallets and chip in. One of the most ridiculous asks from a “friend” I would call this a weird and dealbreaker who asks someone to pay for their engagement ring. Tell the fiancé he did a piss poor job and upgrade his ungrateful and materialistic fiancé. This is a former friend now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "half_way_by_accident",
            "body": "YTA for posting an ai-written story.\nGet a better hobby.",
            "score": 2,
            "replies": []
        },
        {
            "author": "aj_alva",
            "body": "NTA.  What a strange question and response. How is it selfish of **you** to not pay for an upgrade of a ring she was **gifted**.  I honestly feel really bad for her fiancé.",
            "score": 2,
            "replies": []
        },
        {
            "author": "redelectro7",
            "body": "AI is not trying very hard with rage bait is it?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sea-Ad9057",
            "body": "Nta warn her fiancee about this he should know who he married",
            "score": 2,
            "replies": []
        },
        {
            "author": "Skibert0857",
            "body": "Definitely NTA.  With friends like her, who needs enemies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chemosh_tz",
            "body": "My wife wears a rubber ring now due to work stuff. I still love her the same as I did before. Tell this woman's fiance to run",
            "score": 1,
            "replies": []
        },
        {
            "author": "Legal-Lingonberry577",
            "body": "Where are all these \"friends\" who always agree that others should chip in for all the stupid sh\\*t people ask for?  The immediate response to them should be, \"how much are you contributing?\"\n\nNTA - she's certainly one for calling you selfish because you won't give her money for jewelry.  FFS\n\nFind new friends.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Western_Fuzzy",
            "body": "NTA. \n\nEveryone wins here. \n\nYou find out that Olivia isn’t your friend or much a decent human being, which means you get to skip out on the most tedious wedding party of all time. Think of the time, energy, and money you’ll save not being maid of honour/bridesmaid. \n\nAs for her? She doesn’t lose out either because of your friends that are saying “it’s just a ring,” seem more than willing to cover the cost of the upgrade!",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdAffectionate1766",
            "body": "NTA you aren’t marrying her and if her fiancé is smart he wouldn’t either.  She should communicate her dislike to her fiancé it is between them.  Her asking you to pay for upgrade is entitled and bizarre.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HUNGWHITEBOI25",
            "body": "What kind of question is this…?\n\n“Hey my ring is too small, help buy me a new one”\n\n…who are these friends of yours that think this is a reasonable request…\n\nNTA Op but mayybe get better friends",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChaoticCrashy",
            "body": "Whoa. This can’t be a real post. If it is, then your friend is delusional. \n\nAbsolutely NTA. You need better friends, not a selfish entitled jerk like this one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LaniBloommLS",
            "body": "Girl, what?? Since when do engagement rings come with a crowdfunding option? If she wants a bigger rock, that’s between her and her fiancé, not your wallet. ‘It’s just a ring’—exactly, so why is she expecting you to finance it? Stay strong, your savings aren’t a wedding registry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "booksandcats4life",
            "body": "NTA. If she's asking for money to expand the ring, she would have asked for money to expand the wedding. Best to stop that sort of thing at the start.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crashin70",
            "body": "Never tell your friends or family when you come into or manage to save any money! No you are not the a-hole for this person thinking you should give them your money because she didn't like the size of the Ring someone else bought her!",
            "score": 1,
            "replies": []
        },
        {
            "author": "CocoaAlmondsRock",
            "body": "Good Lord, how entitled can people be? NTA. It's not \"just a ring.\" It's YOUR MONEY. I don't care if it was $5 for bus fare. You don't owe it to her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WatermelonRindPickle",
            "body": "NTA. What a ridiculous thing to ask someone! Difficult to believe someone would be that socially inept to even think of such a thing. If this is real, you need better friends.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snackinpenguin",
            "body": "She’s asking you to help her pay for an upgrade to her engagement ring. That’s a piece of jewelry that’s supposed to be between her and him. \n\nShe’s the selfish one that actually isn’t happy with what she got.  She can find a way to fund the upgrade herself.  NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dglsfrsr",
            "body": "Are you going to chip in to help her have the wedding reception she wants, as well?\n\nHow about her honeymoon? She'll want to go somewhere really nice.\n\nAnd that house they were looking at, well, it fits their budget, but doesn't really fit her desired lifestyle.\n\nAnd now that they got that house, their old car doesn't really fit the scene, if you know what I mean.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wakemeup3000",
            "body": "NTA. She doesn't want to appear ungrateful but that's exactly what she is. A ring is a promise of marriage. Her deciding its too small should be a HUGE issue with her fiance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KrevinHLocke",
            "body": "NTA. Your friend is a weirdo and needs to rethink her priorities.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MisaOEB",
            "body": "Omg she wants your money and not as a loan? Run!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SignificantMatter771",
            "body": "Lets live outside our means and get mad when others wont foot the bill. Shes doing you a favor??    And for the record... the dudes gonna notice and personally I'd feel all kinds of things about that and none of them good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ketjak",
            "body": "NTA\n\nShe's truly a piece of work.\n\nLending/borrowing from people rarely works out. \"Neither a borrower nor a lender be.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "shockfuzz",
            "body": "This is a bizarre and entitled request on the part of OP's 'friend'.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Head-Gold624",
            "body": "The freaking audacity!!!!\nHe lovingly picked out a ring and it’s not big enough and wants her friend to share the cost?  I am gobsmacked!!!!  Unbelievable!!!  How is he going to feel about it?\n\nMy ex gave his mistress a 2 or 3 carat stone (she then could design her ring.  She made him take it back - too small!!  So she now wears an 8 carat with a visible flaw!!\nHe had the audacity to go to one of my close friends to get the stone.  He hated the woman said she was awful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wpnsc",
            "body": "Wouldn't the fiance be very disappointed and hurt that she traded rings?",
            "score": 1,
            "replies": []
        },
        {
            "author": "PoppyStaff",
            "body": "Tell those friends to help her. NTA. Also, she’s not your friend and probably hasn’t been for a while.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JenAshTuck",
            "body": "These friendship stories I’ve read lately are just so wild, they have to be fake right?! At least I hope so…if they are legit then I, along with most everyone I know, should get friendship of the year award.\n\nAlso, what happened to shame? Maybe it’s my generation, but I’d be way too embarrassed to act this way, especially to this degree.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Head-Gold624",
            "body": "PS:  there is no such thing as  “extra” money.  It’s an investment for your future!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "laydeefly",
            "body": "This isn’t real.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shinyRedButton",
            "body": "This has to be a fake “outrage bait”post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd_Welcome7940",
            "body": "She has a ring, she didn't pay for. You don't. \n\nTell that greedy wench to buy you a ring and support your happiness. \n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wabbit-127",
            "body": "OMG. The entitlement. If her friends think she should get help buying her ring - they should pay for it and leave you alone. She’s not a true friend. Stand your ground.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AwkwardImpression72",
            "body": "You'd think with the workout ChatGPT gets, it would have learned and improved how to make fake stories seem more real. Is AI not learning from all the crap people feed it...?",
            "score": 1,
            "replies": []
        },
        {
            "author": "dacaur",
            "body": "My God these fake posts get crazier and crazier.... Zero of your \"friends\" have said you should have given your friend money to upgrade her engagement ring \n\nYTA for posting fake shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DominicABQ",
            "body": "No, you are not responsible for \"Upgrading\" her ring. If she is to broke to do it or her fiance is too broke or cheap then I doubt they have funds to get married. Your savings are for you and shouldn't put you in financial trouble. I doubt this friend would pawn the ring to help you out of a jam. If the friendship goes away so be it. You will forever only be a bank account to her in the future. She wants a bigger ring because she wants people to think she is better off than she is, buy seriously on your dime.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bluewaveempress",
            "body": "Nta.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neither_Loan6419",
            "body": "LOL! Forget about it! You didn't propose to her, her fiance did, and she should be happy with the ring he gave her. Don't be stupid. You saved that money for a reason. Stick to the plan. In the future, be more careful who you tell about your nest egg. \n\nOne good thing has come of this. You can now see how much actual personal value that there is in this so-called friendship. A friend would never ask what she asked of you, and certainly wouldn't hold it against you if you did not see fit to turn over your savings or any part thereof, to her. Anybody who places a price on friendship, and expects you to help financially because you had the foresight to save while the \"friend\" did not, isn't really much of a friend. Don't be nasty, but stand your ground, and you should probably gradually disassociate yourself from her. \n\nMost people have only one or two REAL friends, if that. A false friend is worse than an enemy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chillicothe1",
            "body": "This has to be fake.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BackgroundGate3",
            "body": "Of course you're NTA. Honestly, she sounds awful. Her fiancé bought her a ring. If it's not to her taste then maybe she shouldn't be getting married at all because marriage isn't about the ring, it's about the relationship. I pity the poor guy. He's looking forward to a lifetime of falling short",
            "score": 1,
            "replies": []
        },
        {
            "author": "kikivee612",
            "body": "NTA\n\nThis is something she needs to address with her fiancé. \n\nThe thing is, it’s very inappropriate for her to be paying for her own ring in the first place. If she’s not comfortable talking to her fiancé about this, she’s not ready to get married. There’s going to be things that are actually important that she will need to communicate about. How will she handle those issues? \n\nAlso, how does her fiancé feel about her not liking the ring? Does she think she can just get a different ring and he won’t notice?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HallAccomplished5000",
            "body": "NTA. Tell her fiance that what she has said to you and how she is making other people interact with you because you won't fork out thousands for a ring.\n\n\nTell him she's ungrateful and spoilt and this is his get out now before she turns into a bridezilla and he has the divorce from hell.\n\n\nShe's no friend to you. Time to cut the cord. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotSorry2019",
            "body": "NTA. This has to be fake because the lack of self awareness to ask for such a thing is off the charts. Let her be distant - you can buy better friends for less money than a ring upgrade would cost.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImColdandImTired",
            "body": "Don’t you just love it when other people believe they’re entitled to your money?  NTA, of course.",
            "score": 1,
            "replies": []
        },
        {
            "author": "londomollaribab5",
            "body": "Any of those friends who are giving you odd looks can open their pocket books and hand money over to Olivia who I’m pretty sure was brought up in a barn. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "somethin_grim13",
            "body": "Who are these people who ask friends for large amounts of cash for frivolous items? Where do they come from? Do they really exist?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key_Bluebird_6104",
            "body": "To stupid to be real is right",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sufficient_Feed5443",
            "body": "BS from your friends, NTA, she seems pretty shallow.  She doesn’t want to ask her fiancé & hurt him, does she not think he’ll notice a new ring & still be hurt?\n\nLet those friends pool their money & help her upgrade her ring.  It will be a “community engagement/proposal”",
            "score": 1,
            "replies": []
        },
        {
            "author": "bippityboppitynope",
            "body": "NTA \"If it is just a ring then she should be fine with one she got\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Early_Apple_4142",
            "body": "Poor dude. Gonna marry that sort of crazy and vanity. NTA she's insane.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kyra_Heiker",
            "body": "This is one of the craziest questions I have ever seen on this subreddit. That is an overinflated sense of entitlement that actually makes me wonder whether she is mentally all there because her behavior is delusional.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Short-pitched",
            "body": "So would there be rotation on the ring like she wears it month 1,3,5,7 and you wear it month 2,4,6,8?\nWould finance be shared? You know, like time share where you both schedules and don’t actually own the finance but own use of finance?\nI think this thing can take off if it were an app where people can chip in with engagement rings and get fractional time share or fiancés",
            "score": 1,
            "replies": []
        },
        {
            "author": "SayWhaaatAgain",
            "body": "Life observations have taught me anyone this concerned about the size of a ring....is in a doomed relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mad2109",
            "body": "Why don't the friends help pay? She has some brass neck even asking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TaxiLady69",
            "body": "No fucking way. Your friends think you should pay, is just bullshit. Nobody is telling their friends that they need to pay for other friends' engagement rings. WTF? You are an asshole for making shit up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nikka_Ask4274",
            "body": "What's even happening!? This is ridiculous.  No, you're NTA. Tell your friend to get over herself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PmMeAnnaKendrick",
            "body": "boy these artificial intelligent am I the asshole poster getting smarter and smarter \n\n  \nbecause this seems so realistic in everyday life. \n\n  \nGTFO with this",
            "score": 1,
            "replies": []
        },
        {
            "author": "inkslingerben",
            "body": "NTA \"Because you have a lot of money, you should give me some.\" It is time to get a friend who isn't a leech.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VirtualPanda89",
            "body": "That is completely unreasonable for her to ask. \nEngagement and wedding finances have nothing to do with anyone but the people getting married and their parents if they’re inclined to. \nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Son_of_Leatherneck",
            "body": "Couple of things: 1) I hope that her finance (yes, I said finance, not fiancée) finds out what kind of a selfish, superficial bitch she is and runs for the hills. He’s signing up for a life of misery. 2) she was just plain trash for asking her friends to chip in. 3) she’s a disgusting scumbag for treating you differently because you wouldn’t help her in her narcissistic quest and 4) you are absolutely not the asshole. You are so much better being shed of that toxic person in your life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rude-Moment-3970",
            "body": "She’s nuts! She did you a favor, let her keep her distance. She is ungrateful for what her fiancée was able to give her and if she wants something better, she can pay for it. Never allow someone to make their problems YOUR problems. She sounds like a selfish and self centered person.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jennyelf",
            "body": "Ayuh, this is fake.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Usual-Significance-9",
            "body": "this is how  you becoming her ATM starts",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeadOil5581",
            "body": "If you’re not marrying her, you are under no obligation to pay for anything but a moderately priced wedding gift on her registry. I feel bad for whoever she’s marrying.  She’s special.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mb1zzle",
            "body": "Did you ask if those friends chipped in for her vanity ring?\n\nChrist, her fiance picked that ring out of love (I assume), shouldn't she be grateful?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drazilou",
            "body": "NTA. For next time: Never pledge a blank check. \n\nSure, I'll help! I can spare up to *$x,xx*, it's yours if you want it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrHuggiebear1",
            "body": "She is very ungrateful.  If I was him, if she did that I would call it off and leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "Potential_Ad_1397",
            "body": "She doesn't want to tell her fiance as she doesn't want to be ungrateful.  .. which is....\n\nBut she thinks he won't notice? He will and then this will blow up between them\n\nNTA\n\nAnd I will just distance myself as I don't want to be in this hot mess",
            "score": 1,
            "replies": []
        },
        {
            "author": "BdsmBartender",
            "body": "Some people.will call you.selfish the moment you.dont tive them yourbhard earned money. She doesnt see you as a friend. She sees you as an account to make withdrawels from because you've \"got the extra money laying around\"\n\nDitch her. Your life will be better without that kind of friend in it. Get friends rhat valuebyou for you instead of your money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iamadirtyrockstar",
            "body": "In situations like this, I keep my thoughts to myself, and simply say the word \"No\". No is a complete sentence as well as a complete answer, and requires no other justification on your part. It makes your stance clear, and if the other person has a problem with it, then that's what it is, their problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Proud-Contract-8551",
            "body": "How do you people become friends with such crappy people?? I guess this is why I have like one friend but she is worth 1 million friends when I read all these crazy stories lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "curiousity60",
            "body": "NTA\n\nAfter she applied social pressure to force you to sacrifice your savings so she can both deceive her fiance and buy jewelry she can't afford, I'd tell fiance. Ask him to deal with her going behind his back while using the \"disappointing\" engagement ring to bully you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top_Philosopher1809",
            "body": "NTAH!  Since when is a friend supposed to help buy an engagement ring.  She doesn’t want fiancé to think she is ungfateful but she wants an upgrade that others are supposed to pay for.  She is delusional.  Keep your money and if you lose a friend oh well.   She wasn’t a true friend to begin with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TickityTickityBoom",
            "body": "Set up a go fund me account and share it with those friends, see how much they contribute. Make sure it’s shared with the fiancé who proposed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrawberrySpare774",
            "body": "I’m sorry your friend is shallow and materialistic! I hope her fiancé figures it out before they get married.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Efficient-Tailor7223",
            "body": "Ditch the 'friend' \n\nWhat an absurd request",
            "score": 1,
            "replies": []
        },
        {
            "author": "hudd1966",
            "body": "She's marrying for the ring, and the provider, not the meaning behind the ring. She doesn't value your friendship either, just your bank account.",
            "score": 1,
            "replies": []
        },
        {
            "author": "New-Bird-8705",
            "body": "Tell the friends who say you have helped to put their money where their mouth is and give her the $.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jimmyb1982",
            "body": "NTA\n\nUpdateMe",
            "score": 1,
            "replies": []
        },
        {
            "author": "AssignmentSecret",
            "body": "None of my friends ever ask me for money and I never ask them for money. Why do people think to ask friends for money they know they can’t pay back? Disgusting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mammoth_One2989",
            "body": "You should tell her fiancé…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redd1tmadesignup",
            "body": "You were kinder than I would’ve been. I would’ve asked her if she was fucking high? Because I would not be paying for her wants, and she could speak to her intended. And any “friends” who said you should pitch in because it’s just a ring should be putting their money where their mouth is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThinkPath1999",
            "body": "Bot alert.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mtngrl60",
            "body": "What the actual hell? Who asks friends to pay for her engagement ring? That’s supposed to be a symbol of the love between her and her fiancé. Not her and her friends.\n\nWhen people treat you like this, they’re telling you who they are. They’re showing you who they are. Believe them.\n\nYou need to look these people in the eye go… Yeah, I have some money saved. For me. Not for your engagement ring. If you can’t afford a bigger engagement ring, then you don’t get one right now.\n\nAnd this is when you put people who do this shit on blast on your social media. You first let Olivia know that she’s asking something unreasonable. You don’t say I’m sorry, because you have nothing to be sorry for.\n\nIn the immediate moment, you literally look at them and ask them… Are you crazy? I worked very hard for my savings because I have plans for it. And my plans are not so you can get engaged on my dime.\n\nAnd if they don’t immediately back off and go… Yeah, you’re right. It was a stupid idea, then you know they’re not your friend. And when they double down and start to involve other people, that’s when you go to social media.\n\nYou nip this shit in the bud. You post something along the lines of… Oh, and be sure to tag her… Because it’s not gonna matter because that friendship is done…\n\n“Hey friends and family! I recently had someone I thought was my friend come to me. Her boyfriend asked her to marry him and got her a lovely ring. But it is not big enough for her.\n\nInstead of letting him know that she would like a different ring, she doesn’t want to embarrass him. So she thought it would be OK to come to me and literally ask me to GIVE her my savings that I have worked incredibly hard for so that she could go buy a bigger ring without embarrassing her boyfriend.\n\nI don’t know how she thought her boyfriend wouldn’t notice a change in the ring that he picked out for her. That part doesn’t even make sense.\n\nAs I explained to her, I did work hard for my savings. It has taken me a long time to have some, and I do have plans for my own money. Which do not include buying other people engagement rings.\n\nI was told, in spite of me offering to help with the wedding in other ways, that I am a bad friend. And now I am getting funny looks from my entire friend group. So I don’t know what the story is that’s going around, but that’s what happened.\n\nSo no, Olivia. I won’t be helping you with your wedding. I won’t be attending your wedding. I won’t be sending you a gift. It was incredibly rude and entitled of you to even ask somebody else to buy you an engagement. That’s between you and your fiancé.\n\nI just wanted to set the record straight. Hopefully my other “friends” will stop giving me funny looks. And if they feel so strongly that I should give up MY money, they should just start a go fund me for Olivia’s engagement ring since apparently her fiancé is too poor to get her the size ring she feels she deserves. \n\nFirst world problems. 🙄”\n\n\nAnd just to be clear, OP, I’m not joking about this. When people act like assholes, they deserve to be called out. When they start involving friend groups and family members, they doubly deserve to be called out.\n\nQuite frankly, Olivia‘s fiancé deserves to know how she really feels about the ring that he got her. Because it is one thing to love your fiancé and really not like the ring they picked because it is just not your STYLE.\n\nIt is a very different thing altogether to not like your ring because the diamond is too small… Even though that’s what is affordable at this point in their lives. That’s entitled and greedy. And if you are that kind of a person, your fiancé deserves to know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "serjsomi",
            "body": "Bot",
            "score": 1,
            "replies": []
        },
        {
            "author": "perpetuallyxhausted",
            "body": ">She wasn’t happy with my response and called me “selfish” for not being more supportive of her happiness.\n\nYour God damn right im gonna be \"selfish\" and prioritise my savings over your materialistic need to get the biggest ring you can't afford!\n\n>other friends, who say I should have helped because “it’s just a ring.”\n\nIf it's \"just a ring\" then she shouldn't need your savings to get it. Or if it's \"just a ring\" then they can pitch in and pay the difference.\n\nYou have not proposed to this woman you do NOT need to be spending significant amounts of money on Rings for her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HungryFoodie1997",
            "body": "Where and how do people get to this level of entitlement?!?! This is beyond crazy…. Why would one think that asking your FRIEND to pitch in for your engagement ring is normal??? Wow \n\nDefinitely NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Verbenaplant",
            "body": "So she can sell the old one and save for a bigger one if it’s sooooooo bad.\n\n  \nyour not marrying her!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cat1832",
            "body": "If it's just a ring, she can pay for an \"upgrade\" herself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Effective-Gift6223",
            "body": "If she buys a different ring for herself, that's going to be a huge slap in the face to her fiance. I can't imagine that going well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ghodsgift",
            "body": "NTA but kinda off-topic, it amazes me the amount of people getting married in their early 20s here.\n\nMad young to be getting married, evidenced when you see childish behaviour like from the OP's friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Any_Calendar_3600",
            "body": "NTA. Your friend is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClemFandangle",
            "body": "Geezus.     One thing I've learned from this sub is that people have very selfish, entitled, ignorant friends.     What kind of dipstick would ask a friend to do this, and then have the nerve to call you 'selfish'.\n\nDump that crazy b.tch as soon as possible.   She's f.cking insane",
            "score": 1,
            "replies": []
        },
        {
            "author": "purpleygreyk",
            "body": "This can’t be real. And if it is, you need new friends.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deeoh01",
            "body": "Your friend is toxic. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "RichKiernan",
            "body": "You need new friends",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSadSadist",
            "body": "Shit posting asshole. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "SandSpecialist2523",
            "body": "NTA she should start a go fund me to get the big rock she wants.",
            "score": 1,
            "replies": []
        },
        {
            "author": "who_even_cares35",
            "body": "Break up with this person",
            "score": 1,
            "replies": []
        },
        {
            "author": "ihatethissite25",
            "body": "People are hilarious. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dice_mogwai",
            "body": "This is so fucking ridiculous it’s clearly fake. This would never happen in real life",
            "score": 1,
            "replies": []
        },
        {
            "author": "JeevestheGinger",
            "body": "ChatGPT. REALLY??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sassy-Peanut",
            "body": "Your 'friend' is ungrateful, and grasping, and deceitful - upgrading an engagement ring is a red flag for any man - a pity the ginger t\\*\\*t didn't spot that at the time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YouSickenMe67",
            "body": "Good riddance to your \"friend.\"\n* ungrateful for the ring she got\n* a coward unable to speak to her fiancé, maybe they could save up\n* rude to ask you, just because you have some \"extra cash\"\n* can't take a polite no for an answer\n* doesn't understand how out of line she is. \n* doesn't care how fiancé will feel when she replaces the ring s/he bought her without a word",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigmouse458",
            "body": "Id tell her fiancé to run for the hills and I’d slowly just recuse  yourself from interacting with her. This is extremely tacky and won’t stop with this…cue incoming bridezilla.",
            "score": 1,
            "replies": []
        },
        {
            "author": "grouchykitten1517",
            "body": "I call fake.  I can buy one entitled friend but you reached too far at the end.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dull-Crew1428",
            "body": "jewlery stores will finance the ring  for her",
            "score": 1,
            "replies": []
        },
        {
            "author": "germanium66",
            "body": "Identical story posted here a few weeks ago. Just a karma farmer, no real story here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConfusedAt63",
            "body": "NTA, but IMO, you should discuss this with her fiancé.  She is going behind his back asking for money from people to replace the ring he gave her.  He needs to know that she is unhappy, ungrateful, trying to get someone else to foot the bill for his failure (her opinion), her lack of openness and honesty with him about the ring in the first place.  He deserves to k ow just who he is marrying, don’t you think?  The friendship with her is over, she ended it when she shared, gossiped and complained about your lack of generosity to others instead of being honest with him and accepting your refusal with grace and maturity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jeff998g",
            "body": "She did you a favor by showing who she is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_abcdefeet",
            "body": "shes the selfish one! she should be happy with the ring her fiancé proposed with or communicate with him like an adult so THEY can find a solution that works for them.",
            "score": 1,
            "replies": [
                {
                    "author": "_abcdefeet",
                    "body": "NTA",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Full_Prune7491",
            "body": "Is this a throuple because why on earth are you responsible for paying for her engagement ring?  She probably would have expected you to “chip in” on the wedding too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Conscious-Reserve-48",
            "body": "Another fake ChatGPT story. “Strange looks” from other’s indeed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hoganpaul",
            "body": "I refuse to believe this is real.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweet_Pay1971",
            "body": "Who asked a question like that 🤔",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nedstarkclash",
            "body": "This is your mind on AI.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent-Price-39",
            "body": "NTA and OP, this drama started because you shared your financial information with your mooching (hopefully ex) friend. Do not do this again, ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sirZofSwagger",
            "body": "It doesn't sound like she or they were ever your friends. Let them go, they arent worth the trouble",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jetro-2023",
            "body": "NTA- in the end this should be a conversation between her and fiancé period. Sooo no do not help her buying an upgrade not your place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Upper_Rent_176",
            "body": "This can't be real. They didn't say \"it's just a ring\". The it's just a X is the new family helps family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gothicel",
            "body": "The most appropriate answer to being asked to pitching in to pay for someone's engagement ring, who is not your fiancé, is to laugh REALLY HARD AT THEM, in THEIR FACE, then say \"Anyway.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top-Car-808",
            "body": "this has got to be Ai.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pineapple71710",
            "body": "NTA, if this story is even true 🤔",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperDave2018",
            "body": "Ehhhh, what? What world does she live in? Why would you need to pay for her ring upgrade just because you can? I am very confused.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chaoticgood790",
            "body": "this isnt real bc no friend group would shame someone for not upgrading a ring for a friend",
            "score": 1,
            "replies": []
        },
        {
            "author": "winterworld561",
            "body": "Tell the ungrateful bitch to go fuck herself. I hope her fiancé knows what he's about to marry. Tel him she has been hounding you to pay for a bigger ring because she doesn't like the one he gave her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Waj",
            "body": " Is this even real life. People are idiots",
            "score": 1,
            "replies": []
        },
        {
            "author": "seaturtle541",
            "body": "NTA\nYour friends request was extremely inappropriate and entitled. Anyone that thinks you’re an asshole for declining to pay for someone else’s engagement ring is crazy.\n\nIt’s a good thing that she is distancing herself from you because the request will just get more ridiculous as time goes on. She has shown you who she truly is. You should believe her and let this relationship end.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Plus_Ad_9181",
            "body": "Why would you pay for some woman’s engagement ring when you’re not the man she’s engaged to?\n\nBroke boy should be buying it. These are getting fucking ridiculous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nothingoutthere3467",
            "body": "Why don’t you tell the fiancé what she’s been telling you let it blow up in her face she’s not entitled to a bigger ring. She got what her fiancé wanted her to have OR could afford\nNTA but she IS!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Realistic-Animator-3",
            "body": "NTA. I bet she has given zero thought to how her fiancé is going to feel after she upgrades to a bigger, fancier ring because the ring he bought her isn’t good enough. He will notice the change in the ring…and most likely will feel she is ungrateful…but that is between them.\nAsking friends to chip in on an engagement ring? Unbelievable.\nIf she has no problem asking you to chip in on the ring she wants, she will have even less apprehension asking you to chip in or outright pay for a myriad of other things leading up to and including her wedding. \nDraw, no chisel a line in concrete now. I’d refuse to be in her wedding if she asks…it’s bound to be a headache of astronomical proportions for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arminlegout1",
            "body": "Entitlement off the scale. Cut loose move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fargoLEVY13",
            "body": "Olivia isn’t your friend. She’s a fucking leech. NTA. Don’t give her one fucking cent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Consistent-Ad3191",
            "body": "It's funny how it's selfish when you say no but she's the selfish one and ungrateful for the ring she has just because she wants something more elaborate if she has an issue with the ring she needs to talk to the person that bought the ring you're not her fiancé And it's not your responsibility and it's not like it's an emergency. She can eventually upgrade when she can afford it",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnknownLinux",
            "body": "`She explained that she didn’t have enough savings to cover the cost of a new, bigger ring, and that she didn’t want to ask her fiancé to foot the bill because she didn’t want him to think she was ungrateful.`\n\nwell she IS ungrateful. Materialistic things obviously matter more to her then her fiancé. If i were the fiancé and found out about this I honestly don't know how I'd react. Id probably debating calling off the whole engagement if this is how she felt. Very shallow.\n\n`She wasn’t happy with my response and called me “selfish” for not being more supportive of her happiness`\n\nThe pot calling the kettle black. gotta love it.\n\n  \nThat being said this is clearly AI generated and a fake story.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LilBoo2019TR",
            "body": "NTA. The audacity! I would have laughed in her face. If she wants a bigger ring then that's on her to get one. It's not the world's responsibility to pay for her wants. Who will pay for the wedding? Is she expecting all of her guests to pitch in monetarily? She is not a friend. She is a user.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-Yellow-6576",
            "body": "She’s entitled af! No way should you even be asked to pitch in for HER engagement ring because she feels she deserves a bigger one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Main_Laugh_1679",
            "body": "Why would you???",
            "score": 1,
            "replies": []
        },
        {
            "author": "GibsonGirl55",
            "body": "If your friend doesn't like the ring she was given, she needs to talk to her fiancé, not you. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strange_Emotion_2646",
            "body": "How come her other friends can’t pay for it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad-Page-2460",
            "body": "Unfortunately it seems you don't have a friend. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Public-Reputation-89",
            "body": "Your friend is an ahole",
            "score": 1,
            "replies": []
        },
        {
            "author": "longndfat",
            "body": "My only reaction would have been \"are you crazy ???\" \n\nWho the hell asks friends to spend money for a bigger ring they themselves could not afford ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emeraldus999",
            "body": "Anytime anyone says \"it's just a <insert random thing>\" then you gotta turn it around on them. If it's not that big of a deal, then they don't really need it, right, since it's not a big deal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sammagee33",
            "body": "What a shitty friend.\n\nDitch her. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hour_Type_5506",
            "body": "This concept you have of what a friendship really is doesn’t seem to fit with how that other person defines the same thing. Given that you two aren’t of the same mind when it comes to friendship and trivial things such as jewelry, perhaps you should reconsider whether that person has earned the right to be your friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "urbanexplorer816",
            "body": "She's a selfish fish. Tell her fiance and then distance yourself because she isn't a friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infabug7",
            "body": "babe, if *you're* buying the ring, that's your wife now. ask her if she'd say yes and if not, there's you're answer. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blackstar1401",
            "body": "NTA You are not marrying her. I'm 100% sure she is telling everyone else a different story.",
            "score": 1,
            "replies": []
        },
        {
            "author": "good-luck-23",
            "body": "She doesn't seem like much of a friend, or perhaps this is out of character. She sounds like she is a grifter or out of touch with reality. Neither bodes well for her or you as far as having a friendship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jolly-Machine-1153",
            "body": "How is this even up for discussion?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amaranthim",
            "body": "I am going to hope this is yet another AI post- there have been so many today! If it were true, she is ungrateful. And no way would someone that was asked this would think they could possibly be in the wrong.\n\n  \nSo - my determination as the Self-Imposed Judge Judy of this sub, I declare the above utter fable. Whether human written or AI, it is still garbage. Please go back and dress it up a bit. The premise itself is garbage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dramatic_Paramedic79",
            "body": "With friends like that, who needs enemies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zestyclose_Public_47",
            "body": "You have friends telling you to help pay for someone else's engagement ring? Yeah okay",
            "score": 1,
            "replies": []
        },
        {
            "author": "oldtimehawkey",
            "body": "Why doesn’t she suck it up and deal with a smaller ring if it’s “just a ring”?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remote-Obligation145",
            "body": "Shit that never happened for $200, Alex.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lipp79",
            "body": "\"she didn’t want him to think she was ungrateful.\"\n\nWhat the fuck is he going to think when she's got a ring twice the size of what he bought her???",
            "score": 1,
            "replies": []
        },
        {
            "author": "-something_original-",
            "body": "Fuck her. That’s no friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Inner_Pipe6540",
            "body": "NTA unless your into a three way I’d say F off have her friends chip in then",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frosty-Implement4584",
            "body": "By the time the wedding rolls around, she will be super fun to deal with..",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeatSix",
            "body": "NTA.  What kind of ask is that?  That is crazy.\n\nAnd were I the giver of the ring and I heard this happening, I would seriously be reconsidering the marriage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GolfballDM",
            "body": "NTA.\n\nWhile it would be a nice gesture if you did contribute, it's not a contribution you have to make.  After all, she's not your significant other.\n\nI could provide some more pungent comparisons, but I think the above statement fits without being crude.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArtsyButWashed",
            "body": "Nobody thinks her fiancée is going to be a little pissed if she just goes on her own and upgrades her ring? And then he finds out that she got help paying for it from others? I don’t know what other opinions are, but this screams materialism to me. She should be working this out with him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Common_Anxiety_177",
            "body": "What the actual fuck did I just read. I would tell my friend’s fiancé because she’s making him look like a chump. Imagine he sees the different ring and is like ??? wtf???? Who bought that for you???",
            "score": 1,
            "replies": []
        },
        {
            "author": "mildlysceptical22",
            "body": "Uh, no, and she and the people on her side are not true friends. \n\nBut would it be possible for you to help me upgrade my car? It’s a bit older and I need a better ride. \n\nAnd my house? It’s gotten a little small for us so would you mind sending us some money for an addition? \n\nHow has it become a recurring problem with people just asking other people for money and then getting angry when they’re told no. Who raised these idiots?",
            "score": 1,
            "replies": []
        },
        {
            "author": "yetzhragog",
            "body": "NTA  \n  \nHow is this even a question?\n\n>...she didn’t want to ask her fiancé to foot the bill because she didn’t want him to think she was ~~ungrateful~~ a gold-digger.\n\nThere, fixed it for her. Do your friend's fiance a favour and tell him to run and run fast!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Illustrious-End4657",
            "body": "None of that happened.",
            "score": 1,
            "replies": []
        },
        {
            "author": "6poundpuppy",
            "body": "NTAH.   Any “friend” that would toss out an ask like that so flippantly is definitely NOT a real friend.  Take the hint and distance yourself to the point where you won’t even want to attend the wedding she’d be expecting you to “pitch in” for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Born-Finish2461",
            "body": "She did you a favor.  No real friend would make such a ridiculous request.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MildLittlRain",
            "body": "Your friend is extreamly materialistic and doesn't really deserve the first ring. NTA!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wild-Strike-3522",
            "body": "This has to be a bs story. Nobody is stupid enough to ask for such a thing. Does Reddit pay money for posting bs like this ? I may want to get a piece of that action if they do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quiet_Village_1425",
            "body": "Dump her she’s not your friend!!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "yakkerswasneverhere",
            "body": "That's ridiculous!  Her entitlement does not become your burden.  Tell her to be happy with what she's been given and grow up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Twig-Hahn",
            "body": "Selfish and wouldn't miss the money? Is she looking in the mirror? She ain't your friend. Shalom you're loved 💔",
            "score": 1,
            "replies": []
        },
        {
            "author": "Trippygirl13",
            "body": "NTA \n\nTo all those \"friends\" who are saying \"it's just a ring\", send the following \"I personally do not think that it is my responsibility to bear the cost of other people's engagement rings, but if you truly feel that this is an appropriate request, I will  be happy to let the engaged friend know that you and others are willing to pitch in. That's really big of you! Have a nice day!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "MombieZ3",
            "body": "My friend/significant other/sibling demanded a huge investment on my part. I said no because it is my property (rightly so). Now my friend group/distant relatives/the rest of my family say I should have just gone along with it to keep the peace. AITAH?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Effective-Bicycle140",
            "body": "You don’t need friends like that.  She’s tacky and self absorbed",
            "score": 1,
            "replies": []
        },
        {
            "author": "forgetregret1day",
            "body": "Wow. She doesn’t want to seem ungrateful to her fiancé, which she is, but then expects you to pay for her vanity ring upgrade making her completely self absorbed, selfish and arrogant to think she is entitled to your money because she wants a bigger, shinier toy?  Why are you friends with this person?  If her happiness can only be achieved by extorting money from you, she’s nothing more than a demanding beggar who expects everyone to cater to her. Rethink this friendship immediately. There’s nothing here for you but being her personal ATM. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HODOR00",
            "body": "Bahahahaha.  Holy shit how do people like this exist? This is awful on more levels than I can comprehend.\n\nAsking your fiance to alter a ring to meet your expectations is crazy to me.  Asking a friend to pay for alterations without telling her fiance is so batshit insane.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shesavillain",
            "body": "Tell her fiancé that she’s unhappy with the ring and that it’s too big and she wants a more simpler, modest ring.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "author": "Full_Pace7666",
                    "body": "Sounds like OP is probably the wealthiest person in the friend group, therefore friends feel entitled to her money. Been through that before.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TeaMistress",
            "body": "This post is AI-generated. Common signs of AI posts include:\n\n* The OP leaves the first comment immediately after the main post, adding context that should have been edited into the main post or offering \"anticipatory\" explanations for questions that haven't even been asked yet.\n* No OP engagement in the comments section.\n* Frequent use of words and phrases in quotation marks throughout the post.\n* Using the phrases \"family helps family\", \"fast forward to now\", \"blowing up my phone\", \"my family/friends/coworkers are divided\"\n* Using em dashes to connect words.\n* Overly formal or stilted phrasing. Doesn't \"sound\" like a modern person wrote it.\n\nPlease downvote and report.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Empty_Antelope_6039",
            "body": "Yeah you are selfish. Give her  money for her engagement ring, wedding and whatever else she needs. Consider it simply a friendship tax.",
            "score": 0,
            "replies": []
        }
    ]
}