{
    "title": "AITAH for making my friend walk home after she purposely ditched me at a concert?",
    "author": "MysticalGoldenWhisp",
    "subreddit": "AITAH",
    "rank": 8,
    "score": 887,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 98,
    "url": "https://www.reddit.com/r/AITAH/comments/1je5kk5/aitah_for_making_my_friend_walk_home_after_she/",
    "id": "1je5kk5",
    "selftext": "I (24F) went to a concert last weekend with my friend Jess (24F). We were both super excited since it was one of our favorite artists, and I was the one who got the tickets. I even drove us there, which was about an hour away.\n\nThe plan was simple: stick together, have fun, and go home together.\n\nWell, Jess had other ideas.\n\nAs soon as we got inside, she spotted a group of random people she knew from college. She immediately ditched me to go hang with them. I figured she’d just say hi and come back, but no—she fully disappeared for over an hour.\n\nI texted her multiple times asking where she was, and she kept replying, “I’m with friends! You should come find us!” Which… no. We came together, and she just left me alone in a crowded venue.\n\nBy the time the concert ended, I still hadn’t seen her. I texted her, “Meet me at the car, I’m leaving soon.” She took forever to reply and finally said, “Omg I’m still with my friends, can we get a ride with you?”\n\nAt this point, I was pissed. She ignored me the whole night, treated me like her personal chauffeur, and expected me to wait for her and her random friends?\n\nSo I said no. I told her she could find her own way home. She freaked out and started blowing up my phone, saying I was being “petty” and “immature” over something “so small.” She ended up having to get an Uber, which cost her almost $60.\n\nNow she and some mutual friends are saying I was too harsh and that I should have “just been the bigger person” since I had driven anyway. But I don’t think it’s fair to be used as a ride when she couldn’t even spend time with me for one night.\n\nAITAH?",
    "comments": [
        {
            "author": "Worldly-Computer-962",
            "body": "Damn, how her friends get there then? She can ask for a ride from them.\n\nNTA, she used you and ditched you.",
            "score": 438,
            "replies": [
                {
                    "author": "GreerBerries",
                    "body": "She clearly prioritized her new friends over you. Total NTA move on your part.",
                    "score": 39,
                    "replies": []
                }
            ]
        },
        {
            "author": "LongConsideration380",
            "body": "NTA fuck that bigger person shit. Bigger person = doormat",
            "score": 172,
            "replies": [
                {
                    "author": "jackishere",
                    "body": "Treat people how they treat YOU!",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "SuddenFlamingo100",
                    "body": "This! Exactly this!\nSomebody else can be the bigger person because I’m not doing that. Ever.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 151,
            "replies": [
                {
                    "author": "mileyxmrax",
                    "body": "You've done nothing wrong, you made plans to go with her she saw some friends and left you at the first opportunity for the whole night knowing you were alone, you told her you were leaving too but she still didn't care, she was TAH here and you did the right thing by letting her stay with her other friends since they were more important the whole night anyway",
                    "score": 77,
                    "replies": []
                },
                {
                    "author": "Sonicsgirl",
                    "body": "OP should ask for the cost of the ticket back too since a girls night for them turned into a solo night for OP.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "theDagman",
                            "body": "And an extra $60 for \"Ubering\" her to the concert.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RileyStoorm",
                    "body": "Exactly! It wasn’t about the ride—it was about the way she treated him all night If she had at least checked in or included him I wouldn’t have cared. But she ignored me until she needed something and that’s not cool",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Fudge_Stock",
                            "body": "They are both women she Left her friend another woman alone in a crowded place where she didn't know anyone that is dangerous as well.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fair_Connection_8346",
                    "body": "Agree with this. Your friend ditched you at the concert and then expected a ride home? You did the right thing, leaving her to find her own way home.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Homework_7621",
            "body": "Why couldn't she have been the bigger person and not ditched you? Something could have happened, she put you at risk.",
            "score": 74,
            "replies": []
        },
        {
            "author": "ImaBitchCaroleBaskin",
            "body": "Well, since you didn't leave her on the street by herself in a strange town, I'm gonna go NTA. Did she pay you for her ticket?",
            "score": 51,
            "replies": []
        },
        {
            "author": "messi20086441",
            "body": "NTA. Jess ditched you all night and expected you to wait around as her personal driver. That’s not cool. You gave her plenty of chances to meet up, and she ignored you. She made her choice, and now she can deal with the consequences. You’re not her chauffeur, she was being selfish, and you stood your ground. Good for you.",
            "score": 49,
            "replies": []
        },
        {
            "author": "JellicoAlpha_3_1",
            "body": "*With all due respect, I don't give a single shit about your opinion.  She made plans with me to go to a concert TOGETHER.  I bought her ticket.  We rode together.  Then she ditched me as soon as we got there, ignored me the entire concert, and then wanted me to drive her actual friends around like I'm a god damned Taxi Service*\n\n*She's a shitty friend...and you're a shitty friend for defending what she did.  Don't like me saying that, there's the fucking door.  We don't have to be friends moving forward if you think what she did was ok.*",
            "score": 46,
            "replies": [
                {
                    "author": "CurrentlyUnderMyBed",
                    "body": "Please OP, give this answer to that bunch of idiots",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "EngineeringOk1885",
            "body": "Why is it that when someone is an asshole they want you to be the bigger person. Fuck her , she’s not your friend.",
            "score": 38,
            "replies": []
        },
        {
            "author": "redditlurker1981",
            "body": "NTA you’re friend is just being an inconsiderate prick",
            "score": 21,
            "replies": [
                {
                    "author": "SomeKindOfOnionMummy",
                    "body": "\"Friend\"",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cerberus_Aus",
            "body": "I’ll give you credit, this is a more unique story that the usual fake stories, but there are still some of the usual fake story markers.",
            "score": 24,
            "replies": [
                {
                    "author": "Savings_Season2291",
                    "body": "Yeah I don't even read posts yet until I scan it and look for obvious ChatGPT tells. If I don't see any thing I read it. I saw at least two on this one. Didn't read it.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Comfortable-Pay-1442",
                            "body": "How can you tell? I just assume it's all AI by this point.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Savings_Season2291",
                                    "body": ">come back, but no—she fully disappeared\n\nOnly AI uses dashes like this\n\n>“Meet me at the car, I’m leaving soon.”\n\nChatGPT makes the quote marks curved, but if I type it out \" it's not.\n\nLikewise lots of recycled cliche Reddit phrases: \"Started blowing up my phone\", \"some mutual friends are saying\"\n\nLastly, AI posts always have the paragraphs spaced almost perfectly where they're one to three sentences long. Look at any human written Redditor post and they're all over the place with their paragraphs. ChatGPT (or any other AI) is just too neat in the way the post is structured.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Comfortable-Pay-1442",
                                            "body": "I've recognised the phrases, but not the text structure. Appreciate this!",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "zaerya",
                                            "body": "I'm not saying this isn't AI or anything, but I use emdashes all the time. It's not hard. \n\nIt's alt+0151.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Savings_Season2291",
                                                    "body": "Yes, but it's a collection of markers, not just the one. If it were just that, then I'd not rush to assume.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "LilyOrchids",
                                                    "body": "Yes! My emdashes will be pried out of my cold, dead hands lol.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "brittmeister_",
            "body": "Sounds like she used you to go to a concert. Babe that’s not your friend",
            "score": 11,
            "replies": []
        },
        {
            "author": "Visible_Canary_718",
            "body": "When will people start recognising this AI bullshit",
            "score": 10,
            "replies": [
                {
                    "author": "Due-Anteater-4794",
                    "body": "Especially ones that start \"I (24F)\" and has a Whisp in their name",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Visible_Canary_718",
                            "body": "I know man. \"Blowing up my phone\" straight giveaway",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Cerberus_Aus",
                                    "body": "“Some mutual friends” was the other one. Plus the few days old account with no comments, and the “three word account name” are all typical markers.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Region-8207",
            "body": "No she was inconsiderate when you made it clear you didn't want to go and hang with her college friends she should of come back to you so it's her own fault she got stranded.",
            "score": 8,
            "replies": []
        },
        {
            "author": "aparish67",
            "body": "NTA",
            "score": 6,
            "replies": []
        },
        {
            "author": "Fearless_Garlic_8286",
            "body": "I give you a B+ for this creative writing attempt. The story was interesting, even if is a little derivative.",
            "score": 5,
            "replies": []
        },
        {
            "author": "blueXwho",
            "body": "YTA for making up a story for karma farming",
            "score": 6,
            "replies": []
        },
        {
            "author": "Living_Leading565",
            "body": "Your friend is not your friend.",
            "score": 3,
            "replies": []
        },
        {
            "author": "avid-learner-bot",
            "body": "The OP was right to stand their ground. Friendships should be built on mutual respect and consideration, not just one person doing all the heavy lifting. It's frustrating when someone takes advantage of your kindness without giving anything back, isn't it? The OP invested time and resources into supporting Jess's concert plans only for her to ditch them at the last minute... that's a clear sign something needs to change\n\nYou deserve a friend who values your companionship as much as you value theirs. Setting boundaries is important because friendships are about give-and-take, not just one person giving all the time. By making it clear that such behavior isn't acceptable, the OP sent an important message: respect and reciprocity matter in any relationship\n\nSo yes, NTA for standing up for yourself",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beachboy442",
            "body": "NTA...................",
            "score": 2,
            "replies": []
        },
        {
            "author": "TerrorAlpaca",
            "body": "\"Be the bigger person, is said to people that are expected to always give in for selfish and entitled people. So no. i should not have done that. Frankly speaking Friend just showed me where i stood so i thank her for that because she taught me a lesson.\"\n\nthen strike her from the friend register.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok_Risk_3271",
            "body": "Never, ever be the bigger person or take the high road.",
            "score": 2,
            "replies": []
        },
        {
            "author": "nuwildcatfan",
            "body": "YTA for the fake story, bot.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Strange_Emotion_2646",
            "body": "No I am pretty sure you got this one right - she wanted a chauffeur.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ha1rBall",
            "body": ">I even drove us there, which was about an hour away.\n\n>She ended up having to get an Uber, which cost her almost $60.\n\nAI, this is where you messed up.  It would have cost a lot more than that.  A 20 minute drive from me costs around $40 last time I checked.  That wasn't even near anywhere busy, like say a concert.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ReporterFar5534",
            "body": "All the stories say the same thing now: \"over something 'so small'\". Is that ChatGPT's favorite phrase?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cultural-Choice-4245",
            "body": "The friend wasn't nice and very thoughtful in this situation, she should have ask you if you wanted to spend the night with the group of friends before going with them. But I wonder if you clearly said to her that it was pissing you off and you wanted to spend the night just the two of you. I agree that it seems pretty obvious, but maybe she had another view on the situation and didn't understand why you didn't wanted to spend the night with the group. I think there's a lack of communication between the two of you. But still, she wasn't very thoughtful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SunMachiavelliTzu",
            "body": "Interesting how being the 'bigger person' always entails having to bow down and take shit from others who don't intend to be flexible themselves or take shit from you...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Super_Reading2048",
            "body": "NTA and she is not your friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mEmotep",
            "body": "NTA. She was with friends. She'd have been fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lt_girth",
            "body": "I'm not volunteering to drive her college friends home either after she ditched me for them the entire night.\n\nNTA, you're not a taxi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rgw_fun",
            "body": "You don’t leave the driver unless you wanna find your own way. NTA but sounds like you need new friends. Mature people hold each other accountable for their behavior. These girls blowing up your phone will hold you back from being your best self. Let them go. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "winterworld561",
            "body": "NTA. She used you and ditched you the moment you arrived. She left you alone the whole time then had the audacity to ask you to drive her and her friends around. She is not a friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooCats8451",
            "body": "She ditched you at a concert that’s a total scumbag move on her part and you paid for the tickets….i say fuck her…she sounds like a shitty friend",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuddenFlamingo100",
            "body": "NTA and good on you for not being a doormat. I don’t make life decisions by committee and the mutual friends can kiss my ass. You need better friends who understand give and take rather than take take and take some more. You told her that you were leaving. You left. I don’t see anything wrong here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TiptoeSecrets",
            "body": "She’s def the ahole and I’m giving you a NTA EXCEPT that leaving anyone without a ride a night can lead to some very scary things. She was lucky she could afford an Uber but if she wasn’t able to, she would’ve been stuck in the middle of the night. Totally understand you were frustrated in the moment but maybe next time make sure your fellow lady has a separate ride before cutting contact.\n\nI’m so sorry you got treated this way, no one deserves that.",
            "score": 0,
            "replies": []
        },
        {
            "author": "veemar1977",
            "body": "Why can't she be the bigger person and stick to the agreement made? NTA",
            "score": 0,
            "replies": []
        },
        {
            "author": "Diligent-Syllabub898",
            "body": "NTA.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ok-Nefariousness5440",
            "body": "All on her bro, maybe next time she goes somewhere with someone she won't ditch them.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Square-Minimum-6042",
            "body": "NTA. I especially like the way she assumed you'd not mind driving all the randoms home. Good job OP.",
            "score": 0,
            "replies": []
        },
        {
            "author": "CodTrumpsMackrel",
            "body": "NTA, you done right.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Amazing_Newspaper_41",
            "body": "NTA - your reaction is very understandable ",
            "score": 0,
            "replies": []
        },
        {
            "author": "VampiresKitten",
            "body": "I would laugh and say, I do not owe her a ride since she ditched me for friends. She could have asked one of \"her friends\" for a ride, since she was no longer my friend anymore.",
            "score": 0,
            "replies": []
        },
        {
            "author": "HUNGWHITEBOI25",
            "body": "Wait so hang on lemme see if i got this straight:\n\n-YOU bought the tickets for you and your friend to see this concert\n\n-Your friend ditched you all night to hang with other friends\n\n-After ditching you all night she has the nerve to ask you to drive all of her friends home (on your own dime i’m guessing, i doubt anyone would throw some gas $ your way\n\nAnd your “friend” somehow thinks YOU are the bad guy here…\n\nNo Op NTA",
            "score": 0,
            "replies": []
        },
        {
            "author": "Financial_Weekend_73",
            "body": "You had me until she said come find them…",
            "score": 0,
            "replies": []
        },
        {
            "author": "Training-Parsley6171",
            "body": "Die on this fkkn hill. I've been in almost the exact same situation n its an AWFUL feeling",
            "score": 0,
            "replies": []
        },
        {
            "author": "Nay-Nay385",
            "body": "NTA and she’s not your friend!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Goth_Muppet",
            "body": "NTA-- others telling you that you 'should've been the bigger person' is a red flag to me because that says more that they don't respect your feelings and are gonna walk all over you when you're a convenience to them. The one friend already demonstrated it. I wouldn't be surprised if she had already previously connected with those people online or through text to meet with them and use you for the ride.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Hogarahodor",
            "body": "Seems like she planned to link up with her friends at the show. Fuck what she and mutual friends say. Stop fucking with that whole lot and find better people to hang with.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Corodix",
            "body": "NTA. You and your friend should take note of all the mutual friends whom are saying that you should have been the bigger person, because they're offering to drive their friends around for free whenever they need a ride. How generous of them.",
            "score": 0,
            "replies": []
        },
        {
            "author": "lantana98",
            "body": "Well she did show how she didn’t need you by abandoning you first",
            "score": 0,
            "replies": []
        },
        {
            "author": "YVRJ",
            "body": "Just tell her she was being a shitty friend to you. \n\nYou’re not her chaperone, waiting till\nShe’s done partying to take everyone home.\nFuck that. You wanted to have fun with a friend, not with random people you don’t know. \n\nI hope you learned your lesson OP. NTA…but pick your friends wisely.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ShowMeYourPapers",
            "body": "\"You used me\" is all you need to say.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Imnotawerewolf",
            "body": "NTA. I'm so tired of people using \"be the bigger person\" to mean \"stop rocking the boat and be quietly mistreated. \n\n\nBeing the bigger person means not snapping back with an insult because you know the other person doesn't mean it. \n\n\nIt's not being treated poorly, and then doing favors for the people who treated you poorly. ",
            "score": 0,
            "replies": []
        },
        {
            "author": "11Cassiel999",
            "body": "These are the people that we call \"friends\".",
            "score": 0,
            "replies": []
        },
        {
            "author": "Enough_Ad1308",
            "body": "Should charge her $60 for the ride there",
            "score": 0,
            "replies": []
        },
        {
            "author": "RandomSupDevGuy",
            "body": "If people are telling you to be the bigger person then they know the other person is in the wrong and is easier to ask you to apologise than get the other person to.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BlueCollarElectro",
            "body": "First time? meme",
            "score": 0,
            "replies": []
        },
        {
            "author": "SuspiciousInternet57",
            "body": "your friend is extremely inconsiderate. NTA",
            "score": 0,
            "replies": []
        },
        {
            "author": "HallAccomplished5000",
            "body": "She was rude and used you. I wouldn't even put it past her to have preplanned this.\n\n\nChalk it up to one for the dusty old memory box. Leave her in there too. She is no friend to you.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Esahh_Doo",
            "body": "Her leaving for other friends and not coming back is wack, but is there any reason you couldn't have also joined that friend group? \"Which… no\" seems like an odd response to meeting other people who also like the same artist.\n\n  \nWhen she realized you were not coming to meet her friends, she should have 100% come back to get you at least. That was the plan. Asking for a ride back with those friends is WILD and makes her an even shittier person. \n\n  \nIn the future, you might want to open yourself up to meeting people who like the same artist. You can make great friends that way, even if Jess is a shitty one.",
            "score": 0,
            "replies": []
        },
        {
            "author": "RealLychee3700",
            "body": "ESH. Your friend was an asshole for ditching you at the concert, you were an asshole for not waiting a few minutes to give her a lift home. She assed first, but you assed last",
            "score": -8,
            "replies": []
        },
        {
            "author": "TheSadSadist",
            "body": "You know the answer asshole. ",
            "score": -4,
            "replies": []
        },
        {
            "author": "2npac",
            "body": "$60 for a 1+hr Uber ride after a concert? Sounds unbelievable",
            "score": -11,
            "replies": [
                {
                    "author": "jxyvld",
                    "body": "i've had to pay $40 bucks jsut for a 30 min ride so yes i do believe the $60 for an 1hr plus if you use uber you would know that the prices are insane at times",
                    "score": 9,
                    "replies": [
                        {
                            "author": "2npac",
                            "body": "Prices usually increase during events such as a concert",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "jxyvld",
                                    "body": "still almost $60 bucks seems pretty accurate for an almost hour a way drive and yes that's true but everywhere is different for uber prices.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MomInOTown",
                    "body": "Surge pricing after a concert makes this totally believable. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "blueXwho",
                            "body": "I think they're saying it's unbelievably low",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "MomInOTown",
                                    "body": "Thank you! I thought it was high! ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "2npac",
                            "body": "I'm saying 60 bucks is cheap",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Suspicious-Spinach-9",
            "body": "I’m a big believer in if you take someone somewhere you have to bring them back. Didn’t have a good time don’t take them anywhere again. This “hang out with me or I won’t give you a ride back” attitude makes you an AH.",
            "score": -7,
            "replies": [
                {
                    "author": "nlaak",
                    "body": "> I’m a big believer in if you take someone somewhere you have to bring them back.\n\nI'm a big believe that if you make plans with someone you stick to those plans, unless both agree to change them.  \n\nIf someone is your ride, you're beholden to them, so it's on in your best interests to accept that. Especially since OP was the one who got the tickets.\n\n> This “hang out with me or I won’t give you a ride back” attitude makes you an AH.\n\nThey had a plan, OPs 'friend' broke that plan, so she doesn't get to whine when she looses out on the rest of it.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Suspicious-Spinach-9",
                            "body": "Just my opinion.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thegeniuswhore",
            "body": "INFO: did she pay for her ticket? and did you agree to take her home? \n\ni've ran into people at concerts that i haven't seen before. i'm gonna go against the grain and say she tried to include you and you also chose to not go over. it was wrong of her to not prioritize your night together, but leaving her stranded wasn't much better. \n\nESH",
            "score": -6,
            "replies": [
                {
                    "author": "nlaak",
                    "body": "> did you agree to take her home? \n\nDoesn't matter after the 'friend' ditched OP for her other 'friends' in clear violation of their agreed on plan.\n\n> it was wrong of her to not prioritize your night together, but leaving her stranded wasn't much better. \n\nOne led to the other. When you ride with someone you're beholden to their choices.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "thegeniuswhore",
                            "body": "idk once you claim responsibility for someone's safe transport i think that's bigger than feelings or a friend fight. \n\nhowever, the friend should have immediately went to find OP after the show and the friend was wrong entirely in how cavalier she was about this",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "nlaak",
                                    "body": "> idk once you claim responsibility for someone's safe transport i think that's bigger than feelings or a friend fight. \n\nOnce you claim you're sticking with someone, I think that's bigger than spending an evening with other friends. The woman just used OP.\n\nShe had safe transport.\n\n> the friend should have immediately went to find OP after the show \n\nThe woman wanted OP to give a ride to her other friends. How did those friends get there in the first place? Seems like the friend used OP with the expectation of meeting the others there, who probably came via Uber, and that OP would foot the effort for getting everyone home.\n\nNo, the woman torpedoed herself and showed OP she's not a friend, or at best, a flake.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}