{
    "title": "AITAH for humiliating my sister’s fiancé at a family gathering after what he did to her?",
    "author": "MiaDawnx",
    "subreddit": "AITAH",
    "rank": 1,
    "score": 3600,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 537,
    "url": "https://www.reddit.com/r/AITAH/comments/1je6juw/aitah_for_humiliating_my_sisters_fiancé_at_a/",
    "id": "1je6juw",
    "selftext": "My sister (28F) has been with her fiancé (32M) for three years. She’s always been the more reserved, quiet type, while he’s loud, extroverted, and sometimes a little over-the-top. We tolerated him, but recently, he crossed a serious line.\n\nA few weeks ago, my sister came to me in tears because her fiancé had \"pranked\" her in front of his friends by pretending to propose in an elaborate setup, only to laugh in her face and say, \"Just kidding, babe! You really thought I was serious?\" His friends all laughed while she stood there, humiliated.\n\nShe didn’t break up with him (which I think she should have), but she was heartbroken. He later gave her some half-hearted excuse about how he actually had a proposal planned soon and this was just a joke gone wrong.\n\nFast forward to this past weekend at our parents' house. We were having a big family dinner, and he was there, acting like nothing happened. While chatting, someone asked when they were getting married, and before my sister could answer, he smirked and said, \"Guess she’ll just have to wait and see, huh?\"\n\nThat was it for me. I smiled sweetly and said, \"Oh, is this like how she had to wait for that hilarious fake proposal in front of all your friends? That was so funny, right? Let’s all have a good laugh about it now.\"\n\nThe table went dead silent. My sister looked mortified, but my parents looked pissed at him. He stammered something about it being a joke, but my dad straight-up told him, \"That’s not a joke. That’s cruelty.\"\n\nHe left shortly after, and now my sister is mad at me for \"embarrassing him and making things worse.\" I told her he embarrassed her first and deserved to be called out. My parents are backing me, but my sister says I’ve ruined things for her.\n\nAITAH?",
    "comments": [
        {
            "author": "EngineeringOk1885",
            "body": "She should not marry this asshole even if he asks. He is cruel and a very small man to do that to her. Your sister needs to know she can do so much better.",
            "score": 3512,
            "replies": [
                {
                    "author": "MiaDawnx",
                    "body": "Facts. Dude is a walking red flag. If this is how he treats her before marriage, imagine how bad it’ll be later. She deserves way better than a guy who thinks humiliating her is comedy.",
                    "score": 2053,
                    "replies": [
                        {
                            "author": "MaryKath55",
                            "body": "If she marries this a-hole she is doing it with eyes wide open, he will abuse her for his entertainment and it will get worse. You will likely go no contact because she will complain but not do anything about it. I’m sorry she thinks so little of herself that she puts up with this idiot and I’m sorry for your family as it will split you up.",
                            "score": 591,
                            "replies": [
                                {
                                    "author": "That-Wonder6802",
                                    "body": "Agree. By staying with him, your sister is, in effect, condoning his behavior.",
                                    "score": 174,
                                    "replies": [
                                        {
                                            "author": "Agreeable_Team6263",
                                            "body": "Agree. Victims of abuse often become trapped in a cycle of abuse, where they make excuses for their abuser and hope things will change :(",
                                            "score": 76,
                                            "replies": [
                                                {
                                                    "author": "Obrina98",
                                                    "body": "It’s a psych trap",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "wutok",
                                                    "body": "So, he’s her “fiance,” but this post is all about how his proposal was fake? OK…",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "petiteCChics",
                                            "body": "NTA. The relationship between OP’s sister and her sister’s fiancé seems a bit like that between an NPD (narcissistic personality disorder) person and their “blood bag.” They need to see a doctor for intervention, otherwise their married life will be a complete mess.",
                                            "score": 37,
                                            "replies": [
                                                {
                                                    "author": "FunnyStylist",
                                                    "body": "NTA. Your sister's fiancé sounds like a toxic and immature person. You did the right thing by standing up for her and calling him out on his cruelty. Hopefully, this will make him think twice about his actions in the future. Your sister may be mad now, but she'll thank you in the long run.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "VelvetIsoldeMoon",
                                            "body": " A real partner doesn’t humiliate you for laughs, he’s showing who he really is, and it’s not good",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "newtonnewlan",
                                    "body": "He embarrassed her first. You just held up a mirror. If he can dish it out, he should be able to take it.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "sjcadlaw456",
                                    "body": "I doubt if she'd make the great mistake of marrying such an a-hole. That dude sucks, big time.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Obrina98",
                                            "body": "She probably will. She’s already stuck in his head games. If she wouldn’t marry him anyway she’d have had the self respect to dump him already. Preferably in front of his friends.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "olivnoe",
                            "body": "Buy your lovely sister a copy of \"Men who hate Women\" by Laura Bates and hopefully she will realise that man actually hates her and probably all women.\n\nOh and you are 100% NTA",
                            "score": 158,
                            "replies": [
                                {
                                    "author": "Niodia",
                                    "body": "Also \"Why Does He Do That?\" by Jane Lundy\n\nEdit to fix my spelling mistake on author's name.",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "author": "olivnoe",
                                            "body": "I've not read that one, worth a trip to my library?",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Niodia",
                                                    "body": "Can DL a PDF for free if you want.\n\n[https://archive.org/details/LundyWhyDoesHeDoThat](https://archive.org/details/LundyWhyDoesHeDoThat)",
                                                    "score": 24,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "alemus2024",
                                                    "body": "It's worth reading.  Very eye opening.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "woolfchick75",
                                            "body": "Lundy Bancroft is the author.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "anacluephone",
                                            "body": "Lundy Bancroft is the author's name.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Impossible_Balance11",
                                            "body": "If I may just...it's Lundy Bancroft.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "pinkLLovelys",
                                    "body": "NTA. Great advice. From my perspective, OP’s sister’s fiancé doesn’t love OP’s sister at all; he’s just using her. The sooner OP’s sister realizes this, the better. Cutting her losses in time is the best option.",
                                    "score": 20,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LimitlessMegan",
                            "body": "Better yet, if this is how he’s treating her in public, imagine how he treats her in private. Which should give you pause when she tells you that you pointing it out and humiliating him has made things worse - maybe she’s not just talking about a potential proposal. \n\nNTA. But it might be time to start setting up for her to talk to you about what’s going on in private, or to know if she needs to escape him she’ll always have you.",
                            "score": 64,
                            "replies": [
                                {
                                    "author": "MikeBristol1",
                                    "body": "You did the right thing. He was cruel, and your sister needed someone to stand up for her.",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SailSweet9929",
                            "body": "He is pushing her to say that or behave like that to you \n\nShe's being manipulated and abused I do recommend to talk to someone she does trust right now and explain it and have her. Him talk to her",
                            "score": 50,
                            "replies": []
                        },
                        {
                            "author": "Thedonkeyforcer",
                            "body": "He needs to go. I have a cruelty streak in me, it's a flaw in my personality and we all have flaws. What makes the difference is how we approach them.\n\nBefore I realised it I loved paying compliments in a way that sounded negative at first and then, when they went over what I just said, they'd realise I'd complimented them and they'd go from hurt/insecure to happy. I realise how abusive and manipulative this is and haven't done it since. \n\nInstead I'm being very clear in my language now when I pay compliments, which I do a lot and honestly because I NEVER ever want ppl I like to feel insecure and unsafe with me. That's work I figured out on my own and did on my own. \n\nThis is worse. He's not only being cruel and playing with her desire to have a life with him, he's also surrounded by ppl who are the same. Not one of his friends stopped this and said \"hey, this is a shitty way to treat someone you love\". He's not just a douche, he's surrounded by similar douches and they'll make him spiral worse than if he had good ppl around him.\n\nI'd dump him so fast, have to say. And your dad was spot on. It's not bullying to call out cruelty when you see it.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "Curious-One4595",
                                    "body": "Yeah, it’s telling that when the topic of marriage came up at the party, just a few weeks after he had humiliated her and saw that she was devastated, he didn’t act humble or tactful or embarrassed, he just made another dig at her.  Dude's an asshole and he’s not relationship material, let alone marriage material. NTA.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "myglasswasbigger",
                            "body": "Your sister has the same mindset as women who are being beat by their husbands but refuse to press charges. It will take something outrageous before she leaves him. All you can do is be there to help pick up the pieces of her life and hope she doesn't have children with him.",
                            "score": 31,
                            "replies": []
                        },
                        {
                            "author": "HilMickaelson",
                            "body": "Your sister should not marry that man-child. Your father is right—what that guy did isn't a joke; it's just cruel. He keeps playing with her feelings and making her wait for a proposal that might never come. If he wanted to marry her, he would have already proposed. And if he truly cared about her, he wouldn’t humiliate her or use her weakness (waiting for a proposal for over three years) against her.\n\nSomething tells me that, besides being a man-child, he has been emotionally abusing her. That might be why she doesn’t fight back—because he has been damaging her self-worth and self-esteem, making her believe she won’t find someone better than him and should be thankful for having him.\n\nBe a good simbling and give her the book 'Why Does He Do That? Inside the Minds of Angry and Controlling Men' by Lundy Bancroft. Read it with her. Hopefully, it will open her eyes to the red flags she has been dismissing.\n\nIf he was capable of doing something that cruel, I don’t even want to imagine what’s coming next. Will he push her head at their wedding or ruin their first child’s gender reveal party just to get laughs from his shitty friends?",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "SpringBabyFlower",
                            "body": "It’s tough to see someone you care about being mistreated but you did the right thing",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "OriginalDogeStar",
                            "body": "Mate, ask her exactly how she is being treated, because dude is sounding like he may be doing a bunch of verbal aggressive manipulations on her",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "NoSummer1345",
                            "body": "I hope your sister develops a shiny spine but we can’t always save loved ones from their own poor choices. 😕",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Patient_Space_7532",
                                    "body": "True. Sometimes, we don't even know it was a poor choice until it's too late. I went through that with my ex.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "No_South7313",
                            "body": "NTA she should say yes and then say I was kidding like I’d marry you",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Party-Pangolin-2359",
                                    "body": "Won't happen, but perfect response.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PuffinScores",
                            "body": "He's a walking red flag, and your sister is a walking doormat. What is she thinking staying with this guy? No one - literally no one - makes fake proposals to an actual gf as a joke.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Hpobjoy",
                            "body": "I am confused. How is he her fiance if he (or she) hasn't proposed?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Brilliant-Swing4874",
                            "body": "Tell your sister to dump this loser, only gonna get worse from here.\nHe's dispicable and deserved to get a few punches from your dad.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "UpDoc69",
                            "body": "You're a good sibling. She has someone solid in you. Someone who will have her back the next time he craps on her, and it definitely will happen.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Important-Coast-5585",
                            "body": "I imagine a Biff type guy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Patient_Space_7532",
                            "body": "His behavior will get worse, especially if she does marry him!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "regular6drunk7",
                            "body": "You said he was her fiance? Doesn’t that mean they’re already engaged?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "NotTheBadOne",
                            "body": "I HOPE for her sake you did ruin things for her…\n\nIt will be a blessing for her if he leaves her because it doesn’t seem like she’s going to leave him no matter what he does. \nAnd it will just get worse as time goes on.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SuperCulture9114",
                            "body": "How is he her fiance if he didn't propose for real?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "2squirrelpeople",
                            "body": "This was my father. He will treat their children this way as well. I speak from lots of unfortunate experience.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Snowybird60",
                            "body": "Let's all hope and pray that your sister was right and you ruined it for her. The best thing that could ever happen to her is for that loser to leave her.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Probllamadrama",
                            "body": "This can go so bad for her. I suggest you setup an email then you write each other in the drafts so she can ask for help when the time comes. I would also start setting aside money for an escape plan. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Frequent_Couple5498",
                            "body": "And it will get worse. NTA. They want to hide all his red flags from your parents. Don't let them. If your sister has to hide things about him or things he has done from your parents then she knows damn well he is not a good person. NTA.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "selphiestix",
                            "body": "She has to realize that. I would straight up tell her if she thinks that’s the kind of treatment she deserves, then stay with the guy and don’t complain when he keeps doing hurtful shit.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Ema630",
                            "body": "He ENJOYS hurting and humiliating her...and he's TRAINING her to accept being treated horribly as normal and all that she deserves.\n\n\nShe has a serious self esteem issue, and that AH has been chipping away at her for three years. She needs therapy. If that fake proposal doesn't wake her up to the fact that he and his friends enjoy hurting her, I'm not sure what will.\n\n\nThe BF will now probably work to alienate her from you and your parents. He will twist everything so she cuts you all, her actual support system, out. Is he controlling?\n\n\nI don't know, take her on an extended sibling vacation to get her away from him, lose her phone so she can get out from under his thumb enough to breath and think. This is pretty heartbreaking. I hope she wakes up and leaves him.\n\n\nEdit to add, here is a link for free PDF of Lundy's book \"Why Does He Do That?\" It's excellent. \n\n\nhttps://freebooksmania.com/2021/01/why-does-he-do-that-pdf-free-download-by-lundy-bancroft.html",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sweetmusic_",
                            "body": "Guys who pull stuff like that aren't fit to lick poop off the sole of her shoes. Tell her to grow a spine some self respect and have a good long think if she wants that to be the rest of her life",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sweetmusic_",
                            "body": "Guys who pull stuff like that aren't fit to lick poop off the sole of her shoes. Tell her to grow a spine some self respect and have a good long think if she wants that to be the rest of her life",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sweetmusic_",
                            "body": "Guys who pull stuff like that aren't fit to lick poop off the sole of her shoes. Tell her to grow a spine some self respect and have a good long think if she wants that to be the rest of her life",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "holystuff28",
                            "body": "I'm confused how he's her fiance if he hasn't actually proposed?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "gmnitsua",
                            "body": "Just to be clear, you have referred to him as her fiancee. But they're not engaged?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Big_Albatross_3050",
                            "body": "When you have rose tinted glasses on, even red flags look like normal flags",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Lokipupper456",
                            "body": "God help her if she has a kid with him!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "INFP4life",
                            "body": "But has he really proposed? You keep calling him her fiancé",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "corgi-king",
                            "body": "Did he gaslighting your sister in the back? Why she is still defending him. I think you or your mom should look into it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "kittylovesmiIk",
                            "body": "Maybe give her some time to process everything",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CherryNest",
                    "body": "Absolutely. A “prank” like that isn’t just immature. it’s straight-up emotional cruelty. If he thinks humiliating the person he claims to love is funny, what else is he capable of? She deserves someone who actually respects her, not someone who treats her like a punchline.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "ProdigiousBeets",
                            "body": "Right? He used his GF as a prop and punked her solely for the entertainment of himself and his friends. This level of unashamed selfishness is alarming as hell. It makes you wonder how bad things can get if he felt this was benign comedy.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sammalone1960",
                    "body": "How is it her fiancé if he has not proposed. This is long term dating.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "sweetvioletapril",
                            "body": "Yes, this. An engagement is a declaration of intended marriage to come. He is just a boyfriend.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Sammalone1960",
                                    "body": "Hoepfulky she runs. He will never grow up and is destined to mistreat whoever he is with due to his own insecurities.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "sweetvioletapril",
                                            "body": "Yes, she will not have a happy life with such a man.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Patient_Space_7532",
                                    "body": "A cruel boyfriend.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RaspberryLittleBaby",
                    "body": "It’s not your fault he can’t take a taste of his own medicine",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "DaisyRaaee",
                    "body": "not the asshole he had no problem embarrassing your sister so why should he get a pass you didn’t ruin anything he did that himself if anything you just made sure everyone saw him for what he really is your sister deserves better and deep down she probably knows it",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "LunaPerry1980",
                    "body": "No kidding. She may think the only reason she's with him is that there is no one else. She needs to know that is not true. She's not with a man! She's with a bloody coward who gets his kicks off by humiliating her. OP, you need to be there for her when she falls, so she'll find the strength to get back up and find a real man!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "steamedumpling-0712",
                    "body": "You and I know that your sister can do so much better, but she can't see that yet. Instead of approaching it head-on, I would suggest do a softer approach, and help her take off the rose-coloured glasses. Good luck to you and your sis!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Turbulent-Fan-320",
                    "body": "And instead of apologizing profusely at the table and saying ‘you know what I have no idea why I let the joke go in that direction and I regret it and wish it never happened. I am so sorry and you’re absolutely right.’ He LEAVES. Bc his ego is more important than taking accountability.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fair_Okra7540",
                    "body": "💯 if that was the case. But there is alternative post.related to incident .intersected with that tone .state that the lady supposed married. But she use to on off the ring . Where a guy  was just inquiring if she truly engaged or no . Despite that lady being sometimes little over-the-top  in pvt with that guy . As someone single . however at other pvt instances there was again an engagement ring but in the “mid finger”. Shifting maybe . Ultimately a friend of friend drop a bomb by a recent story where she announced that all of her friends married and had babies now .  things messy and require a scrunity check. However not ITAH. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Niodia",
                    "body": "I guarantee he has been tearing her down piece by piece and has her convinced he's the only one that will ever love or accept her. He's not only the best she will get, but the ONLY one who would even want her around.\n\nWatch for him trying to use this to isolate her from you and the family. You've just given him the ammo to do so.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TomieXK",
            "body": "NTA. That guy is a fucking asshole. Not only are you not the asshole, I think he provides a target rich environment. Open fire.\n\nBe uncomfortable. Make the tension unbearable. If she marries him, he’ll destroy her entire life. \n\nBasically, happy hunting.",
            "score": 428,
            "replies": [
                {
                    "author": "RaspberryLittleBaby",
                    "body": "If he thinks it’s okay to humiliate your sister he should be prepared for backlash",
                    "score": 93,
                    "replies": []
                },
                {
                    "author": "SpringBabyFlower",
                    "body": "You were standing up for her when she couldn’t if he’s truly sorry he’ll understand why you said what you did",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "mogley19922",
                    "body": "This is the way. \n\n\nYou want to act like an asshole, i can act like a dick, get what's about to happen?\n\nEdit: i think team america has influenced me more than i realised. It just occured to me after posting that this is a bad version of that speech.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "MysticRoseRadiance",
                    "body": "If he thinks humiliation is so funny, why is he the one running away when it happens to him? Weird how that works.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "inplightmovie",
            "body": "Why are you calling him her fiancé? The proposal was fake. They’re not engaged. Should make it easy for her to dump him.",
            "score": 144,
            "replies": [
                {
                    "author": "blueXwho",
                    "body": "Because that's what ChatGPT said",
                    "score": 89,
                    "replies": [
                        {
                            "author": "Nohero08",
                            "body": "Weird how all the posts on these style sub reddits share the exact same grammar, the same story structure, same general length, same rage bait style title, same vocabulary and small inconsistencies that don’t make sense if you think about it.\n\nEvery day people come on here and engage with ChatGPT as if it’s a real person or scenario. It’s like that fake social media app with ai users except it’s every social media platform and it’s all ai generated slop all the way down.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Spoedi-Probes",
            "body": "NTA\n\nA joke is not funny if it has to be explained. \n\nAsk him how his Prank was funny. To explain in detail where your sister was supposed to laugh. Repeatedly ask him to explain his prank at every opportunity, especially around his family.\n\nA Prank is not funny if it is not funny for everyone involved, then it is called abuse.",
            "score": 176,
            "replies": []
        },
        {
            "author": "Obi-Juan_Valdez",
            "body": "So, he’s her “fiance,” but this post is all about how his proposal was fake? OK…",
            "score": 156,
            "replies": [
                {
                    "author": "TXFrenchtoast",
                    "body": "Yeah, I caught that, too...",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "DynkoFromTheNorth",
                    "body": "Glad I'm not the only one. This is fake as fuck.",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "TobblyWobbly",
                    "body": "I know. First thing I thought of. I guess AI doesn't understand the difference between fiancé and boyfriend.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "ThunderingSloth",
                    "body": "I'm so tired of the fake AI bullshit on this subreddit.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "AggressiveGifttoyou",
                    "body": "Yeah that makes no sense",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Worldly-Computer-962",
            "body": "Huge red flag that she's defending his behavior, he has her wrapped around his finger and that's awful.\n\nNTA, get her out, for her own sake.",
            "score": 19,
            "replies": []
        },
        {
            "author": "IAmTAAlways",
            "body": "NTA, unfortunately it sounds like your sister is still willing to be with him. If she wants to continue being with this jerk, you won't be able to do anything about it.",
            "score": 15,
            "replies": [
                {
                    "author": "MiaDawnx",
                    "body": "Yeah, that’s the frustrating part. She’s still choosing to stay, and there’s only so much I can do. At the end of the day, it’s her life, but I’m not gonna sit around and play nice with a dude who treats her like a joke. Just hoping she sees the red flag before it’s too late.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "zombie_goast",
                            "body": "That is literally one of the most frustrating situations in existence. I ended up losing contact with a good friend over a similar situation; i couldn't stand to watch her take her absolute POS boyfriend back over and over again. Here's hoping your sister proves smarter and more self-respecting in the end than my friend.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lucky-Individual460",
            "body": "I would have told him that my sister has cancer and has six months to live. She is too devastated to tell him herself. Then…just kidding!  Hilarious, huh?!  NTA.",
            "score": 14,
            "replies": []
        },
        {
            "author": "bippityboppitynope",
            "body": "NTA, she is in an abusive relationship",
            "score": 10,
            "replies": []
        },
        {
            "author": "AussieLady01",
            "body": "I’m confused. Why did you call him her fiancée if there has only been a fake,proposal?  But why in earth did she say yes if he proposed again after that?",
            "score": 9,
            "replies": [
                {
                    "author": "bonkdonkers",
                    "body": "because it didnt happen and AI gets confused about these things",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "PJ1883",
            "body": "I’m not sure you know what a fiancé is.",
            "score": 6,
            "replies": [
                {
                    "author": "blueXwho",
                    "body": "ChatGPT got confused",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kimbot272",
            "body": "Don’t you need to be proposed to to become someone’s fiancé? Fake",
            "score": 6,
            "replies": []
        },
        {
            "author": "FairyFartDaydreams",
            "body": "NTA tell her you are not going to let his toxicity pass and you don't know why her bar for his behavior is on the floor. She deserves so much better but she is going to have to raise the bar with the next boyfriend",
            "score": 4,
            "replies": [
                {
                    "author": "PatieS13",
                    "body": "I would even take it a step further and tell her that if she does stay with this guy, she can count on you to publicly call out everything he does that you feel is abusive or even just humiliating to others. And if she thinks that that means you're going to be calling him out all the time, that will be very telling and hopefully the wake-up call she needs.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "IllustriousBit_",
                            "body": "I would absolutely not recommend this at all. If the sister is being bullied or manipulated by her bf, this is just going to make her stop sharing things with OOP. It will only heighten the isolation and secretiveness that come with this kind of abuse.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SweetNSpicyBae_",
            "body": "Nah you’re not the asshole. Dude *humiliated* your sister in front of his boys but now she’s mad at *you* for embarrassing *him* That’s wild He played a cruel joke at her expense and all you did was hold up a mirror to his behavior If he can’t handle a taste of his own medicine maybe he shouldn’t be dishing it out in the first place\n\nYour sister’s probably just upset and trying to keep the peace but honestly you did her a favor If she stays with this guy she needs to see exactly what kind of person he is before she’s in too deep Your parents backing you up just proves you weren’t out of line he was",
            "score": 4,
            "replies": []
        },
        {
            "author": "JustAMouthyCockroach",
            "body": "It’s gross how he acts as if HE has all the control and the proposal is completely and utterly dependent on him.  F*ck that guy!",
            "score": 4,
            "replies": []
        },
        {
            "author": "lovenorwich",
            "body": "He's not a fiancé, he's a boyfriend and a shitty one at that.  If he loves her and is excited to marry her he wouldn't treat her this way.  He doesn't want to marry her.",
            "score": 5,
            "replies": []
        },
        {
            "author": "dafurbs88",
            "body": "NAH. The guy is an AH with a twisted sense of humor (to put it kindly). The fact that your sister is introverted only seems to embolden him more. There are serious red flags here. If he was 20, I could maybe see how it was an immature joke in poor taste. But he’s in his 30s. He should know better. And if he truly cares about your sister, he would not hang some future proposal over her head and make jokes about it that are hurtful to her. It’s just plain mean.",
            "score": 22,
            "replies": [
                {
                    "author": "MiaDawnx",
                    "body": "Exactly! Dude is pushing 33, not 13, he knows what he’s doing. This ain’t ‘humor,’ it’s straight-up disrespect. And the fact that he keeps pulling this on my quiet, introverted sister? Nah, that’s calculated. If this is how he acts before marriage, I don’t even wanna think about after.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "dafurbs88",
                            "body": "Without knowing anything more about him or their relationship, his behavior shows signs of someone who might be trying to push the boundaries of what behavior his partner will tolerate. I would worry that long term, he could start emotionally abusing her. Your sister was embarrassed when you called him out, but maybe this will also help open her eyes to the fact that she deserves better in a partner. My husband would never purposefully embarrass me in front of strangers, let alone friends/family. I’d also recommend your sister consider some therapy to help her find her voice and have a neutral person help assess her relationship.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "icrossedtheroad",
                            "body": "Her fiancé? Hasn't proposed, yet?  Hmmmm.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "RaspberryLittleBaby",
                            "body": "It’s good that you called him out even if it made things uncomfortable sometimes the truth hurts",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Sixforsilver7for",
                            "body": "I think you're right to think he's a prick and to want to embarrass him but you might want to apologise to your sister because the way you did it left her embarrassed all over again. Absolutely don't apologise to him but tyou described your sister as mortified after what you said.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "PACCBETA",
                                    "body": "People who are bullied into silence are often quite mortified when the truth is candidly spoken with impunity directly to that bully in their presence; especially when feeling trapped in the moment with no ability to flee, such as sitting at the dinner table with extended family.\n\nThat doesn’t mean we do not continue to speak out in the light of the truth. It means we help those too afraid to do so themselves until they are no longer scared of their own truth.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Sixforsilver7for",
                                            "body": "Exactly, she's been embarrassed twice now by people she loves. I think OOPs heart was at least in the right place but it'd be nice for her to get an apology for being put on the spot.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mca2021",
                            "body": "Has he pulled anything else that shows disrespect?  Maybe she views it as a one time event.  He seems like a dick to me since what he did wasn't funny in any way.\n\nNTA and good for you for having your sister's back, even if she doesn't appreciate it",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ImmediateShallot7245",
                            "body": "This will be her life if she marries him!!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "N-Squared-N",
                            "body": "How is he your sister's fiance if he hasn't proposed yet? Lol fuckin fake shit , such a loser",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RandomSupDevGuy",
            "body": "\"You really thought I was serious?\" that is the worst line possible, whether a prank or not saying that after \"proposing\" is basically saying \"do you think I actually would propose to you.\"",
            "score": 7,
            "replies": []
        },
        {
            "author": "WhatsInAName1117",
            "body": "NTA even a little bit! You did the right thing by sticking up for your sister because she won’t stick up for herself. Others are saying it’s going to push her away and it might but it won’t last long. It’s only a matter of time until she wakes up and realizes that this guy is trash. If there’s one thing I can’t stand is people walking on eggshells to “keep the peace,” whether it’s family or friends.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Moontoya",
            "body": "NTA\n\ndickhead had that and MUCH more coming, sis is blinded by rose tinted \"twue wuv\" glasses and isnt seeing how badly he's mis-using the oxygen trees put out.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JanetInSpain",
            "body": "Your sister is love-blind. Ask her what she would tell you to do if your boyfriend treated you like that. She seriously needs to dump his ass to the curb. \"Just a joke\" is the rallying cry of every bully on the planet. He isn't her boyfriend. HE IS HER BULLY. She just refuses to see that.\n\nupdateme!",
            "score": 3,
            "replies": []
        },
        {
            "author": "bronwyn19594236",
            "body": "NTA, your dad is right that the fiance was cruel to your sister.  I think your sister was, perhaps, embarrassed a bit again when her boyfriend was called out for his behavior. \n\nI hope she doesn’t marry this jerk. You and your dad are heroes!",
            "score": 3,
            "replies": []
        },
        {
            "author": "TootsNYC",
            "body": "why are you calling this guy her fiancé?\n\nHe's not.",
            "score": 3,
            "replies": []
        },
        {
            "author": "iamadirtyrockstar",
            "body": "So, you say fiancé, but he hasn't actually proposed to her yet, so he would still be just a boyfriend. I don't understand why people refer to people by titles that absolutely aren't deserved or warranted.\n\nShe should dump her boyfriend and move on before the relationship becomes serious and she mistakenly accepts a proposal from the guy to actually make him her fiancé.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Key-Pay-8572",
            "body": "NTA.  Your sister needs therapy to figure out why she can be humiliated by someone and think she needs him.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Any_Calendar_3600",
            "body": "NTA. Your sister should decline the proposal and promptly leave.",
            "score": 3,
            "replies": []
        },
        {
            "author": "undercoverhippie",
            "body": "This guy is a disrespectful tool and should be dropped like a hot rock.  He's gotta know the family hates him now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "sometimesfamilysucks",
            "body": "Why would your sister stay with such a douche bag? She must have really low self esteem. Just because she’s reserved doesn’t mean she should tolerate mental abuse.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Nenoshka",
            "body": "Why is he referred to as a fiance if he hasn't proposed?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Otherwise_Degree_729",
            "body": "If you actually ruined things for her she should be glad. That not a relationship worth being in.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kaedemi011",
            "body": "Your sister needs to wake up and dump this garbage.",
            "score": 3,
            "replies": []
        },
        {
            "author": "nuffaholes33",
            "body": "If calling him out on a cruel joke makes things worse for her then she needs to reevaluate her relationship. Her response screams victim of abuse. Whether physical or emotional, it's still abuse.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ApparentlyaKaren",
            "body": "I admire your fafo attitude but be weary because we’ve all heard this story before.\n\nSister/bestfriend whoever speaks out about the red flags — girl refuses to hear it and stays with him. Girl then isolates themselves from friends and family because no one understands ‘their love’ \n\nI wouldn’t keep my mouth shut either. More people need to be publicly shamed for the audacity of their behaviour. But be prepared for this scenario to get worst before it ever gets better. 100% guarantee without even knowing y’all your sister will marry him. I wouldn’t even be surprised if she invited you and then uninvited you for your ‘lack of support’. \n\nGood luck!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Back_In_St_Olaf_",
            "body": "NTA. I think your sister is defensive because deep down she knows this guy treats her like shit but she hasn't mustered up the courage to leave him. You're a good sister, please continue to offer support and try to build up her self-esteem as much as possible. Steer her towards therapy if you can. I say this as someone who put up with a series of loser boyfriends in my 20s, it took encouragement from friends, family and a therapist to gain a sense of self-worth. I hope your sister finds a partner who values her.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Remarkable_Junket902",
            "body": "I was married to an asshole like this. He didn’t start until after marriage but his favorite form of entertainment was insulting me in front of his friends. The more he could humiliate me and make me look stupid the better he liked it. I stayed way longer than I should have. After I left him, I met a wonderful man who treats me like an angel. We’ve been together 30 years now. \nYour sister will regret staying with this man cuz it will only get worse. She can do so much better.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Trudgemonster",
            "body": "I’m old school and not politically correct. I would have beat the piss out of him. Disrespect like that deserves a smack in the mouth. He’s a POS !!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Impossible_Balance11",
            "body": "We're all hoping you have, in fact, ruined things for her--by opening her eyes wide to that horrible man's true character. \n\nNTA",
            "score": 3,
            "replies": []
        },
        {
            "author": "emmetdontpullout",
            "body": "hes an asshole and your sister is a dumbass. i hope she takes off the blinders soon.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Quick_Connection6818",
            "body": "Please help your sister leave this abuser. Your NTA but he definitely is a fake proposal is not funny but damn cruel",
            "score": 3,
            "replies": []
        },
        {
            "author": "IdolatryofCalvin",
            "body": "NTA\n\nThat was not a prank “gone wrong.” The entire design and intent of the prank is pure cruelty. He 100% needed to be called out and humiliated for it. I can only hope he may have learned a lesson from it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TinyHavoc",
            "body": "Nope, nope, nope definitely not! He is but not you.\n\nWhat he did was downright cruel and it served him right to only experience only a sliver of what your sister did, and as far as you \"ruining things\" he did it not you.  She is probably still feeling very raw from the fake proposal so it being brought up with still to fresh for her, but go to her and have a very honest chat... I mean does she really want to have this type of man as a husband? Who thinks it's okay to publicly embarrass her?",
            "score": 2,
            "replies": []
        },
        {
            "author": "LawComprehensive2142",
            "body": "NtA. I see some people said it isn't your battle. Your sister seems to be showing signs of being a victim of abuse. Bringing it into the light is good but you need to make sure you can help protect her. I'm not necessarily saying physical abuse but definitely mental and emotional. Unfortunately when abusers are confronted publicly they take it out on their victim privately. My recommendation is to research or talk to someone who can help you understand the cycle and position yourself to help your sister as much as possible without putting more stress or abuse on her (from him).",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdGreedy8386",
            "body": "NTA.  Your sister needs higher standards for herself.  \n\nRight now she's set the bar so low that she's actually tripping over it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mudwoman",
            "body": "🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩\n\nThis is abuse. It would only escalate if she marries him, undoubtedly to physical abuse. Good for your dad for dressing him down.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dawg1959",
            "body": "NTA. She may not accept this situation now, but at some point she’ll thank you. Let EVERYONE in your family’s orbit know about this guy. He’s walking trouble.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Every_Guard",
            "body": "Imagine being 32 and still doing stupid ass pranks.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Free-Place-3930",
            "body": "NTA. She needs to wise up and have some self care.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MiloCPT",
            "body": "NTA - but you need to have a proper heart to heart with her and maybe your mom (or dad if they are closer together) to tell her that she deserves better and that time wasted with her current bf could be stopping her from meeting someone who would truly care for her",
            "score": 2,
            "replies": []
        },
        {
            "author": "GimmeUrNachos",
            "body": "Nope, NTA.  She needs to hear from MORE people that he is a horrible person.  Good for you for letting your parents in on his shenanigans.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BraveWarrior-55",
            "body": "Why on earth is your sister lowering herself to dog-like level, grovelling at this man's feet waiting for crumbs?? He is cruel, heartless and enjoys making her feel like sh\\*t and I cannot imagine how she can tolerate this treatment. You have NOT ruined anything for your sister, in fact, maybe she will grow a spine and leave this abusing man. Why would anyone who cares for  your sister want her to remain with a man who would humiliate her in public? Imagine what he says to her in private. NTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "GrouchyBear_99",
            "body": "NTA\n\nNext time she comes to you \"heartbroken\" and in tears, encourage your doormat of a sister to seek therapy before she gets legally tied (and worse: has kids) with this guy.\n\nSadly, her response as a nearly 30 year old adult tells me she'll put him before family.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Specific_Anxiety_343",
            "body": "NTA. Why are you referring to this cloud as your sister’s fiancé?",
            "score": 2,
            "replies": []
        },
        {
            "author": "pursaplera444",
            "body": "May your sister pick up her self respect and leave this horrid human. NTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "redleg2001",
            "body": "You did the right thing. What was he doing a humiliation ritual to your sister? Something is off about this boy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GuidanceSignal5587",
            "body": "Your dad is right, this guy seems like a ahole, your sister would be better off without him",
            "score": 2,
            "replies": []
        },
        {
            "author": "incospicuous_echoes",
            "body": "How much worse does she it need to get for her to find her spine and leave the jerk? Your family needs to run an intervention on your sister and remind her she is love and supported and doesn’t need that guy. NTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "MissPusteblum",
            "body": "The reaction of your sister is concerning.\nShe is in an abusive relationship, help her get away from him.\nnta",
            "score": 2,
            "replies": []
        },
        {
            "author": "AJourneyer",
            "body": "She really needs to get rid of this guy.  He's cruel, selfish, and sending up all sorts of red flags.\n\nHe's a dick - plain and simple.\n\nNTA, I hope everyone is furious with him, and I hope she drops his ass like a boiling potato.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Responsible-Kale-904",
            "body": "Your dad and you are TOTALLY:\n\n\nN\nT\nA\n\n\n\nN\nT\nA",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shichimi88",
            "body": "Nta. She shouldn’t be marrying him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Playful_Jello_1162",
            "body": "Something is wrong with your sister.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Common_Lavishness153",
            "body": "Your sister is being emotionally abused and she can't see it because she's inside the mess and toxicity. She's not herself right now. You're NTA. Your sister needs an intervention and therapy. And the guy needs a punch in the face.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Curve_Worldly",
            "body": "You’re NTA, but that was red flag for me. \nIs she safe in this relationship? \n\nIt sounds abusive.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Upbeat_Selection357",
            "body": "If he's embarrassed by other people learning what he did, that means at some level he understands that what he did was not funny and just cruel.  If it was an honest joke gone wrong, it would be something that everybody could look back on with a laugh.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cautious_View_9248",
            "body": "NTA- She really needs to drop that dude- he is horrible",
            "score": 2,
            "replies": []
        },
        {
            "author": "Old_Leadership_5000",
            "body": "He humiliated himself (and set himself up for failure  here:\n\n>While chatting, someone asked when they were getting married, and before my sister could answer, he smirked and said, \"Guess she’ll just have to wait and see, huh?\"\n\n...after humiliating her in front of his friends.   She shouldn't even be with him, because he doesn't respect her.  And you're NTA.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Altruistic_Isopod_11",
            "body": "Ruined things for her??? Does your sister have no self respect?? Or self worth? Her boyfriend is at much the A-H. Ugh. \n\nNTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "Imnotawerewolf",
            "body": "NTA she came to you upset and what you said was nothing but the absolute truth. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok_Mention_3308",
            "body": "You are the sister that everyone needs! In time, she will realize how you stuck up for her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Few-Tone-9339",
            "body": "Ruined things for her? He sounds like an asshole.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Just-Lab-1842",
            "body": "You’re sister is waiting for a proposal from a man who is emotionally abusing her. You’re not the A, he is. Your sister needs to run away from this man.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gaza_Queen",
            "body": "How is he considered her fiance if he hasn't even proposed yet? \n\nAt this point, he's a boyfriend. And not a good one at that.\n\nEdit for judgment: NTA, shouldav said more tbh.",
            "score": 2,
            "replies": []
        },
        {
            "author": "K_A_irony",
            "body": "So one point.   This is NOT your sister's fiance.   They are not engaged.   I am very sorry your sister doesn't have the self esteem and self respect to tell this guy to take a hike.   \n\nI would on the side apologize for putting her in a tough spot.   You might ask her what she is doing to build a great career / financial plan totally independent ot this guy.  Say he might be great, they might get engaged, but it is always best to have your own independence so if something becomes unacceptable to you, you can just walk.  \n\n  \nNTA.",
            "score": 2,
            "replies": []
        },
        {
            "author": "floridaeng",
            "body": "He ruined it for your sister, OP just made sure everyone had a chance to tell him what they think about what he did. If he was humiliated when people talk about something he planned and did, then it's his fault and it shows he's more concerned about how he looks than about your sister.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HospitalAutomatic",
            "body": "Unfortunately your sister has low self esteem and deserves better. You did the right thing and he deserves to be called out. \n\nEven more, now he knows she’s got people in her corner and will think twice about treating her like that again (until she finds the courage to divorce him)",
            "score": 2,
            "replies": []
        },
        {
            "author": "joe-lefty500",
            "body": "NTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "StressSuspicious5013",
            "body": "Your sister needs to value herself more, her being more upset with you for defending her than she was with him for humiliating her is not a good sign. Your parents should try to talk to her about it. Suggest therapy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mountain_Stress5909",
            "body": "Your sister's a doormat, she should be glad you were willing to stand up for her, and if he's embarrassed about it, then he shouldn't have done it, which of course he shouldn't have because it's a total asshole move.  I mean what kind of friends does tis guy have that would find that funny?  Sounds like a pretty messed up group of people.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nice_War_4262",
            "body": "Wow sister is asking for a life of verbal abuse and “jokes” hope she sees the light before committing to the ah more, better alone than miserable with that jerk",
            "score": 2,
            "replies": []
        },
        {
            "author": "adn00033",
            "body": "NTA! You are a saint! Good for you standing up for your sister!!!! I’d done the same thing!!! While also spewing a few choice words!!! Your sister may not see it now but she will thank you later! It’s hard to watch your sibling allow a man to mistreat them! Especially the road their headed down, you did the right thing! Because if she does ever marry this man her life will be full of disrespect from him! Who plans a fake proposal?!?! An asshole that’s who!! But he only did it knowing that your sister would just accept it! Men like him get off on treating women like your sister bad because it strokes their ego that she will accept the mistreatment with a smile!!!! Sad situation! I hope she realizes she deserves better!",
            "score": 2,
            "replies": []
        },
        {
            "author": "____Light_____",
            "body": "Your sister is confused. I do think you acted right. Nobody deserves someone that plays w ur feelings for others entertainment. It's not too late for her to find someone else.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bleu5EJ",
            "body": "When the kids come along . . . \n\nSomebody wake her up!",
            "score": 2,
            "replies": []
        },
        {
            "author": "pinkflower200",
            "body": "It sounds like he doesn't plan on marrying OP's sister anyway. Let's hope not. NTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "MajorYou9692",
            "body": "He has to be sick to do something like that ,humiliating her for laughs. He's pondlife as far as I'm concerned and needs putting in the rear view mirror.",
            "score": 2,
            "replies": []
        },
        {
            "author": "denitra1984",
            "body": "Apparently to sis, a bad boyfriend is better than no boyfriend at all. \nPoor girl. Hopefully she sees the light. \nNTA for standing up against a dick of a bf.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cthulhu_Knits",
            "body": "NTA. She needs to wake up and dump him",
            "score": 2,
            "replies": []
        },
        {
            "author": "hello_reddit1234",
            "body": "I get that she’s upset but she needs to understand that if what he did was acceptable, then there wouldn’t be any embarrassment for him. \n\nWhilst I understand your actions, what you need to understand is that you too have embarrassed your sister in public. Do you think she wanted that public call out? Or further attention on her lack of engagement? You did it because YOU wanted to embarrass HIM and her hurt was just collateral damage. \n\nIt doesn’t matter how many people (your parents) support you. You are all ignoring that you hurt your sister. \n\nYou owe her an apology. I would suggest that you treat her to some therapy so she can understand why she tolerates this behaviour from her bf. I do agree that he’s an ah and she deserves better (but she also deserved better from you)",
            "score": 2,
            "replies": []
        },
        {
            "author": "N0b0dy-Imp0rtant",
            "body": "He sounds like a tool that needs to be recycled to me.  Your sister is willing to put up with a lot from him and he doesn’t seem able or willing to deal with much of anything done to him in return.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bernardfarquart",
            "body": "If you \"ruined things\" for her with this a-hole then count that as a win",
            "score": 2,
            "replies": []
        },
        {
            "author": "Obrina98",
            "body": "He’s an abuser. It’s just starting.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ElectricShadeess",
            "body": "NTA. Honestly, the only thing he should be proposing is an apology. Maybe next time, he’ll learn that ‘pranks’ aren’t funny when they come at someone’s emotional expense. At least now he knows that you’ve got a real *killer* sense of humor",
            "score": 2,
            "replies": []
        },
        {
            "author": "redbeardedlumberjack",
            "body": "What a fucking asshole. \n\nAside from the potential criminal charges, and potentially upsetting my daughter, if I was her dad I’d have a hard time not throwing his ass out of my house face first and making clear my daughter deserved far better than the man-boy asshole currently with her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RageBeast82",
            "body": "She should definitely stay with him... at least until he actually proposes. Then laugh in his face and turn him down on the spot.  Maybe add something about never willing to marry a micropenis.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MikeyFX",
            "body": "NTA 100% on your side with this one and I guarantee your sister came to you about the prank originally, because if she had told your parents what happened, they would have told her exactly what she didn’t want to hear. She never thought you would call him out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hot-Restaurant4598",
            "body": "NTA.  You may have ruined an illusion… but not reality",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dense_Dress_1287",
            "body": "\"it's just a joke\"\n\nStandard first response of every bully on the planet. It's like their first commandment.\n\nHe's a bully, she should dump him. Anyone who says it's just a joke, when you aren't the one laughing, you should run from.\n\nAsk him what was funny about it? Embarrass him right in the moment.\n\nIf I was your sister, if he pulled a fake proposal to get laughs at my expense, that would be the last time I ever spoke to that person",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unhappy_Wedding_8457",
            "body": "NTA, he deserved that and even though your sister doesn't agree, I think you made a point to this guy, that you're watching him. and that you're ready to protect your sister. And maybe she'll need that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tellamya",
            "body": "Honestly, he deserved to be called out. What he did to your sister wasn’t a joke—it was humiliating. If he can dish it out, he should be able to take it, and it sounds like he needed a reality check. Your sister may be upset now, but sometimes we need someone to step up when we’re too hurt or afraid to speak up for ourselves.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alternative-Golf8281",
            "body": "Fake post written by AI. Look at how the post is written compared to the very few responses are worded.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Paper_Cut2U",
            "body": "Why are you saying sisters fiancé if he hasn’t proposed?",
            "score": 2,
            "replies": [
                {
                    "author": "BobbieClough",
                    "body": "Because the AI got confused when coming up with this post.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Trishlovesdolphins",
            "body": "Sounds like your sister is abused. Not all abuse is bruises. I don't know any woman who wouldn't have left an asshole after that, the fact that she's still with him and twisting this back on you screams partner abuse. He's got her thinking what he is doing is normal and ok, it is not. Best advice I can give you is to hold on to your sister. When he tries to isolate her make sure she understands you're always willing to help her, even if things get nasty, \n\nAs for what you did? I'd say you're 100% right and on point. Her family needs to know what he did, maybe everyone knowing will help her have a support system.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mac_Jomes",
            "body": "NTA \n\n\nThere are some very crucial things you don't joke about in a relationship and proposing is one of those things. It just shows you don't take the relationship seriously. \n\n\n\"Oh you thought I wanted to spend the rest of my life with you? Sike!\" \n\n\nWhat a dog shit thing to do to a person. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Necessary_Status_521",
            "body": "ESH, except her. You knew she was embarrassed by what he did and you embarrassed her all over by bringing it up. If you really cared about her well being, you would discuss it privately and seriously. You don't care about your sister, you just really hate her shitty partner. He sucks but so do you. Maybe your family is part of why your sister thinks this behavior is tolerable and acceptable from her partner. But either way, you've only managed to alienate her from people who should be supporting her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NovaPrime1988",
            "body": "To be honest, you embarrassed your sister with that comment. The guy is negligible because he sounds like an ass. But you were mad at him for embarrassing her oublicly, then turned round and did the exact same thing to her yourself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Away-Research4299",
            "body": "NTA. Your sister has self-esteem issues, possibly because he has, I would guess, slowly been chipping away at it over the years.",
            "score": 2,
            "replies": []
        },
        {
            "author": "leash_e",
            "body": "You should have your sister read the responses to your post. Maybe she will wake the eff up and leave him. She is not in a healthy relationship.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tinkerpro",
            "body": "Your sister is in an abusive relationship.  She doesn’t see that and it will be hard to convince her of it",
            "score": 2,
            "replies": []
        },
        {
            "author": "neri2b",
            "body": "NTAIH, and she should wake up and dump his ass soon...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Korekobs",
            "body": "My aunt's now ex-husband did this before they were officially engaged, and did it in front of her parents. \n\nHe had a habit of carrying a thing of Tabasco sauce whenever they went to restaurants. They had gone to a fancy restaurant for his birthday, and in the middle of dinner he gets her attention and says \"I know you've been waiting for this for awhile.\" Gets on one knee. He got the attention of her parents and a good portion of the other people in the restaurant, only to pull put the Tabasco sauce and laugh. \n\nHe now is a over 40 year old man who is divorced, in debt, and living in a rv in his parents driveway. \n\nNTA These kind of guys never learn.",
            "score": 2,
            "replies": []
        },
        {
            "author": "_no7",
            "body": "NTA. Maybe your sister has Stockholm Syndrome or Sunk Cost Fallacy?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Blk_rbbt",
            "body": "NTA We should all have a sibling like you who is willing to stick up for us.  You and your parents are right.  Hopefully she sees the light soon.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Few-Faithlessness448",
            "body": "Is your sisters name PICKMESHA? Jesus Christ she needs some spine and dignity",
            "score": 2,
            "replies": []
        },
        {
            "author": "Training-Parsley6171",
            "body": "good job. fk that cunt",
            "score": 5,
            "replies": []
        },
        {
            "author": "Upper_Rent_176",
            "body": "YTA it's not your place to share this information",
            "score": 4,
            "replies": []
        },
        {
            "author": "Dlraetz1",
            "body": "NTA-the next step is for your family to have a long talk with your sister about self worth",
            "score": 4,
            "replies": []
        },
        {
            "author": "Beneficial-Ball8375",
            "body": "I can't be the only one who read your post and at the beginning thought:\n'OMG, she's so gonna prank him back by telling him, their parents have won the fucking lottery'\nActually what you did wasn't even revenge. It was simply spitting facts when this pos (rightfully, unfortunately) thought, your sister would shy away from adressing what he did.\n\n\nDefinitely NTA",
            "score": 3,
            "replies": []
        },
        {
            "author": "HarveySnake",
            "body": ">That’s not a joke. That’s cruelty\n\nThank you dad!\n\nNTA",
            "score": 3,
            "replies": []
        },
        {
            "author": "ramblingpariah",
            "body": "YTA, but he's a bigger asshole, if that makes you feel better. Did he deserve to be embarrassed like that? Absolutely. Your sister, on the other hand, did not, but you were so eager to get at him you didn't really think of her.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gatsby520",
            "body": "Your sister was mortified by the “prank” and then again by your repeating of it. \n\nI’m sure it made YOU feel good to embarrass her dumbass boyfriend (he’s not her fiancé until he proposes). But this is about your sister’s relationship and your sister’s feelings. \n\nSorry, and I know you meant well, but you were just as cruel and unfeeling to your sister as her dumbass boyfriend was when he pranked her. That makes *two* people whom she felt she could depend on who have betrayed her.",
            "score": 4,
            "replies": [
                {
                    "author": "VERO2020",
                    "body": "OK, if the sister ever marries this jerk, he's gonna be part of the family. Personally, I feel that this was a message to the rest of the family about this guy. \n\nIf I was their Dad, after this came to light, I'd take the POS aside & threaten to castrate him if he ever hurt his daughter again.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 3,
            "replies": [
                {
                    "author": "MiaDawnx",
                    "body": "I get what you’re saying, but my sister was too stuck in her feelings to clap back, so I did. Dude publicly humiliated her, but I’m the bad guy for returning the energy?",
                    "score": 43,
                    "replies": [
                        {
                            "author": "GickySama",
                            "body": "You didn’t even return the energy; you calmly called him out on his crap, which is even better (because then he can’t try to wave his arms and call you crazy). You sound too mature to match that level of f*ery. \n\nI can’t even say I’d have the self-control you did to collar him so cleanly.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "ProdigiousBeets",
                            "body": "The risky part here is if this somehow makes a wedge between you and her. This is a good opportunity to talk to her about what you did - because while it was embarrassing for her BF it was also embarrassing for her too - you can get two birds stoned at the same time by apologizing to her and emphasizing to her just how terrible his joke truly was. You're not the bad guy for returning his energy, and if anything he needed this moment, but it did have a cost for your sister, no matter how marginal.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "hiquaa",
                            "body": "Not doing anything and not standing up for her isnt right either, If she wasn't aware of how fucked up that was then it needed to be done, kinda like a wake up call because her BF seems like an asshole",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Waddy_bosh",
                    "body": "That’s a brothers job? You’d just let your sister get humiliated and stay tight lipped?",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "GickySama",
                    "body": "I agree it wasn’t OP’s fight to fight, but lordt. I love hey standing up for her sister. Let this clown know that the family has his woman’s back, and won’t let him get away with nonsense. \n\nI particularly love the dad saying straight-up that the “prank” was cruelty. I hope the sister sees it for herself, too. \n\nI also want to know about this dude’s friends. \nWhy on earth would ANYONE feel okay taking part in a scheme like that!?",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "BillyShears991",
            "body": "Yta. Both of you sound like cunts.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kah43",
            "body": "YTA completely. You didn't just humiliate him you humiliated her all over again this time in front if your parents. If your sister wanted them to know she would have told them.  She told you because she thought she could trust you, and you instead betrayed her trust.  In taking a shot at him in front of everyone all you showed her was she couldn't trust you to vent too anymore.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheOfficialKramer",
            "body": "ESH - Boyfriend is a complete douchebag and should be single. Your sister is ok woth him and still wants to be with him. You can't mind your own business. \n\nYour sister can choose to date or marry whoever she wants and doesn't need your approval. Yes, it may be a huge mistake and hurt her, but that is her mistake to make. You can dislike him, be whatever to him, but she's going to be pissed at you as well. Maybe she sees enough good in him to overlook his obnoxious behavior and doesn't feel the same as you. Mind your own beeswax.",
            "score": 2,
            "replies": [
                {
                    "author": "VERO2020",
                    "body": "Nope, this is family business. You make noises like this cruel \"prank\" was OK. It was not. That idiot needed to be slapped down.\n\nAlso, IMO Kramer was the worst person on Seinfeld. You don't sound any better.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheOfficialKramer",
                            "body": "What he did was stupid. Still, the sister is a big girl and is in control of her own life. Now that the sister is mad about everyone butting in, does that make it better? I think the sister would agree with me and she's the one affected.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MateoMraz",
            "body": "He sounds awful. Your sister probably feels stuck and doesn’t know how to get out of it without more drama. You definitely made things awkward but maybe it needed to happen",
            "score": 1,
            "replies": []
        },
        {
            "author": "yakkerswasneverhere",
            "body": "Your sister won't be the first to back an asshole bf and she won't be the last.  But if he hasn't proposed, why are you calling him her fiancé?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Well-Done22",
            "body": "NTA. Your sister can choose to marry a prick if she wants. She can’t choose how people react to said prick. If she stays with him, she’s in for a long life if people thinking her partner sucks. It’s not their responsibility to placate her poor choice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WorriedSwordfish2506",
            "body": "NTA, the truth is better when applied duplomatically, but when the receiver is an asshole, two barrels of truth straigjt to the face in public....totally fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "catladyclub",
            "body": "So it was ok to embarrass and humiliate her and that was so funny.  But you talking about what he did is not ok?   He is a huge asshole and she will be miserable if she stays with him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specific-Quick",
            "body": "Someone who could do something like that and treat her that way in front of her dad especially is absolutely abusive at home and while I agree with what you did and think it was well deserved, I wouldn’t do it again because you could push her to believe she can’t come to you About how he’s treating her and you want to be a safe space for when/if she decides to leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmoothAssasin420",
            "body": "NTA\n\nyou cant control how your sister feels and acts on those feelings.   \nobviously she´s blinded by him/his attitude (i dont get why obvious assholes like that get such supportive partners), but she's almost 30 years old and therefore an adult.  \n  \nYou can tell how you/your parents feel but its up to her to change anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "prpslydistracted",
            "body": "NTA. Ten years from now she will thank you profusely. He never had or does have any intention of marrying her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CharmingDepth4938",
            "body": "NTAH. He deserves it and your family should be prepared to rescue her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "401Nailhead",
            "body": "NTA.  That was very cruel of him.  What another dumb ass Tik Tok video opportunity at your sister expense?   You sister stays with the person for what reason?  IMO, the asking to marry question is not coming.  This guy is stringing your sister along.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TatianaSpark",
            "body": "NTA. That jerk humiliated your sister with his cruel prank, and you just gave him a taste of his own medicine at the perfect moment!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Endora529",
            "body": "NTA. Your sister’s boyfriend is a douchebag. She needs to get out while she can. That guy isn’t good for anyone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CosmoKkgirl",
            "body": "How is he her fiancé if he hasn’t actually proposed yet? Are you counting the fake proposal or is this made up?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Federal_Tank_5044",
            "body": "Tell your sister when this happens again, don't let her come crying to you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jacce76",
            "body": "Your title is wrong. He is not her fiance. He is her boyfriend and a horrible one at that. NTA. He got what he deserved.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KaligirlinDe",
            "body": "NTA and your poor sister. If he really does pop the question she should say yes and then say \"ha gotcha, just joking!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaryVonDerInsel",
            "body": "For all we know you are a soul of a brother for having her back while she isn’t able to stand up for herself - at not now. He is a red flag and I hope she sees this soon enough. Somebody who loves her wouldn’t play such a cruel “prank”. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Des1225",
            "body": "Big sis knows what’s up. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CocoaAlmondsRock",
            "body": "Honestly, you might have ruined things for her, but he's a manbaby, and she deserves better. That doesn't mean she'll see it that way, though -- at least not for a long time.\n\nRemember, she had to go home with him, and she has to live with his tantrum.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aneilanated",
            "body": "I don't even know you and I'm proud of you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snorrikisa",
            "body": "He will never propose to her. He will just string her along until he gets bored.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mileyxmrax",
            "body": "You guys all did the right thing, this guys and AH and a bully he doesn't truly care about your sister if he did he wouldn't do such a thing and then continue to play it off as a joke when he knows how heartbroken he made her feel, she deserves better",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiserableOcelot4282",
            "body": "That guy is a complete turd who deserves to die alone in a ditch. NTA even remotely. Playing with someones basic emotions like that deserved infinitely worse. She needs to run until he's not even on the same continent as her",
            "score": 1,
            "replies": []
        },
        {
            "author": "hecknono",
            "body": "have her read: [https://dn790007.ca.archive.org/0/items/LundyWhyDoesHeDoThat/Lundy\\_Why-does-he-do-that.pdf](https://dn790007.ca.archive.org/0/items/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf)\n\nalso, make sure her birth control is locked down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moist-Release-9227",
            "body": "Nta but don't call him her fiance when he clearly is not.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sensitive_Pattern341",
            "body": "Good on ya!!  Assholes can't stand having their flaws brought out im the bright light to be scrutinized.  You did great!! Hope your sister wakes up and dumps the loser.  And be sure to bring it up AT EVERY OCCASION. and I mean EVERY ONE.",
            "score": 1,
            "replies": []
        },
        {
            "author": "njgunlord",
            "body": "if it was my sister, he/we would have had a nice chat \"out back\". not sure it would end well for him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nikki_mc314",
            "body": "The best would be him asking and her saying no",
            "score": 1,
            "replies": []
        },
        {
            "author": "empathy10",
            "body": "YTA. I understand your ire for this fool but it wasn't your place to do that and your actions probably caused your sister more discomfort than him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ornery-Wasabi-473",
            "body": "NTA. \n\nHe's not your sister's fiance if he hasn't proposed, and he should never be her fiance because he's a mean-spirited AH. She should dump his ass. She can do much better than the likes of him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TwoBionicknees",
            "body": "Why are you calling him her fiance, if they aren't infact engaged at all?",
            "score": 1,
            "replies": []
        },
        {
            "author": "shesavillain",
            "body": "Well maybe change the part where you refer to him as her fiancé..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chaoticgood790",
            "body": "NTA your sister should wake tf up and dump the loser",
            "score": 1,
            "replies": []
        },
        {
            "author": "TrixIx",
            "body": "Your sis is dating an emotionally/mentally abusive twerp who disguises it as \"pranks\".  She will need to make the choice to leave the toxic soup herself or she will just keep going back for more and worse abuse from him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redleg2001",
            "body": "Wait, he is 32 years old? That makes it worse. I was thinking he was 20 or something and immature. Thos man is 32, and him and his friends are extremely emotionally immature and emotionally abusive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MissMurderpants",
            "body": "Gee sis, I can only imagine how he will ‘prank’ you while you are giving birth. \n\nAre you that insecure that you think this asshat I’d good for you?  I love you sis and I hope beyond all hope that if I was with Such an asshat you’d  tell me. Please listen. He is not a good guy. It sounds like he laughed at you with his friends not with you. That’s not a prank. \n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Proud-Contract-8551",
            "body": "NTA. I'm glad you stood up for her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Coop654321",
            "body": "What exactly was \"ruined\"? He's a horrible person & it's sad your sister feels like that's all she's worth. 😟",
            "score": 1,
            "replies": []
        },
        {
            "author": "Appropriate__account",
            "body": "NTA I’m hoping she leaves him and can see you were trying to help 🥺",
            "score": 1,
            "replies": []
        },
        {
            "author": "jcatleather",
            "body": "Calling him a walking red flag is exactly spot on. I think maybe your sister needs some education on how to spot an emotionally abusive relationship. An a****** intervention if you will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Historical_Leek_4341",
            "body": "NTA. If that \"ruined\" things for her but the fake proposal didn't, your sister needs therapy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top_Philosopher1809",
            "body": "NTA. The only AH is the boyfriend.  Sister needs to cut the jerk loose.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LSBurningLips",
            "body": "Bro played stupid games and won the grand prize: public humiliation. You just served him his own medicine, and he couldn’t handle the taste. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "awakiwi1",
            "body": "You broke your sister's trust by your action. YTA\n\nHe's an AH  to, and I hope she finds the strength to leave him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maria_Dragon",
            "body": "So he deserved it but you do need to listen to your sister's feelings also.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cali_Holly",
            "body": "NTA\n\nAsk her if this is how she wants to live the rest of her life? What other jokes will he make at her expense?  \n\nI suggest that YOU find here on Reddit all the posts by women who have experienced this type of behavior from their SO.  OR, you make a post and ask for stories from others who have experienced being the butt of their SO’s “jokes.” And how many more did they put up with before calling it quits.  Summarize the story before posting. \n\nThen print the responses and give them to her. Tell her you are doing this with love in your heart. And that you want to make sure that she understands that she does not have to put up with this. And that attitude and behavior from him is emotional abuse. And just because he’s not leaving bruises on her skin doesn’t make what he’s doing any less painful. Ask her how long she’s going to put up with being treated like this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Temporary_Nebula_295",
            "body": "It's good he knows her family won't tolerate his shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Common_Anxiety_177",
            "body": "If she thinks what he did was ok, then why is she embarrassed? If she doesn’t think it’s okay, why is she mad he’s being called out? It sounds like her fiancé is probably borderline emotionally abusive and she puts up with it because she wants to get married and be able to claim she has the perfect life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mbt_Omega",
            "body": "Scanned in as 100% AI. YTA for pushing more of this shit onto the feed. There’s no sister, no bf/fiance, no prank.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TravisBravo",
            "body": "Wasn’t your business.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Christine4000",
            "body": "I can’t believe she didn’t leave him after he humiliated her like that. The sooner their relationship ends the better. I wouldn’t be surprised if he is constantly belittling her in little ways all the time chipping away at her sense of self-worth. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuller1017",
            "body": "Your sister doesn’t need to be so desperate. She can find better and you did right. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NapQueenBean",
            "body": "Thank you for trying to make sure your sister is the equivalent to a doormat. She needs to wake up and smell the flowers. She deserves so much better, and she should not be upset at you in this situation. If he was so happy and proud of his joke, why not bring the whole family in on it? I mean it was such a funny joke that was worth humiliating your sister for. \n\nUltimately, plan a moment with him, your sister, and his friends. Roast the living hell out of him, and talk nonstop about horribly embarrassing things that \"your sister told you about him\". \"He sobs right after he cums.\" \"His penis is so small even when it is erect, that they discussed needing a turkey baster should they ever choose to start a family because he couldn't even manage to penetrate her.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Confident_Trick9242",
            "body": "She needs to wait until he proposes to her, and when he does, she should say, \"YES!\" Then start laughing and add.\"Just kidding, babe, you thought I was serious?\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mediocre_Device308",
            "body": "\"Pranking\" is one of the cringiest things an adult human can do IMO. It's so stupid. Grow up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Material_Assumption",
            "body": "When they break up, and she does better for herself, she will thank you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DragonsLogic",
            "body": "NTA....you are looking out for her and she's blinded by this guy. You stood up for your sister because she clearly doesn't stand up against this dude. She'll understand, if not now, in the long run that you did it out of love for her. \n\nHe also now knows her family won't take his shiat. So hopefully he show more respect. Or better yet, they break up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoNotKnowItAll",
            "body": "NTA. Your sister is a prisoner at this point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jimmyb1982",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vegoia2",
            "body": "poor sis, no self esteem, back bone or any sense of herself. dont know how you can help that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cosmic_belle108",
            "body": "I feel sorry for whoever this guy ends up marrying. Hopefully, it's not your sister, OP. What a douche. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "chicas411",
            "body": "She doesn't want to accept the reality that his prank was pretty much his cowardly way of telling her he isn't going to marry her and she doesn't want to accept it she's holding on to a dream that won't happen. If by chance it does it won't be until much later by then she will regret wasting time. I got married on my 40s to a man I love more than anything in the world but I will also say I hate that we didn't marry until I was in my 40s my body and looks were starting to show my age. I didn't order any of our wedding pics because of that. Tell her she needs to stop wasting time and if she ever gets pregnant he will spend rest of their lives together telling everybody she trapped him into marriage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Haztlen",
            "body": "NTA\n\nYour poor sister is being so dumb here. Don't get me wrong, most of us have been there.\n\nI do hope she wakes up soon...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible_Fox1231",
            "body": "You should apologize to your sister for upsetting her, but that doesn't mean what you did was wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AllergicToGravity",
            "body": "Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aiyokusama",
            "body": "NTA. And point out that YOU aren't part of their lives and YOU can't ruin anything for two grown adults who are responsible for their own choices.",
            "score": 1,
            "replies": []
        },
        {
            "author": "matchagirl123",
            "body": "3 years and still hasn’t married her? He sounds like he isn’t ready to settle down and probably just keeping her there because he knows he can get away with his asshole behavior with her, and no else will tolerate him. \n\nYour sister has to leave him but the more you pressure someone who’s in a relationship like this the more they back away.  You’ll have to get your parents together and have a sit down with her and tell her how her future will look like if she marries this jerk. \n\n\nI told my cousin 2 years ago to break up and leave her controlling boyfriend— he once was texting me back pretending to be her and whenever we would go out he would blow up her phone with texts and calls and when she didn’t answer him he would call to yell at her and she would defend him and say it’s “anxiety” \n\nAnd now she’s married to him and we don’t talk or hang out anymore, but sometimes I see her because we live in the same building and when she does see me she’s very happy but that doesn’t matter.\n\n\nPoint is at least you have others on your side who can help your sister see she’s making a huge mistake. I’m glad you humiliated him because he does it to your sister.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tough_Ad1553",
            "body": "I would say you are the A-hole, but for a good cause.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TWAndrewz",
            "body": "This is an abusive marriage waiting to happen. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DominaStar",
            "body": "When he is still playing juvenile pranks like this he is not ready to get married and if he is so willing to hurt your sister it will only get worse in marriage. \nSo no NtAh for humiliating him in front of family. Your family is her support and it sounds like she will need it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "loveaddictblissfool",
            "body": "I don’t think you’re an asshole. I think your anger about that dude is totally rational. I was gonna say that it wasn’t something you should’ve done, could have been more skillful, could’ve talked to him in private and let them know exactly what you think, but I’ve changed my mind. Humiliating him in front of everybody was exactly what you should’ve done. This is a guy who says he’s gonna propose but he hasn’t and you just know he’s not going to. Fucking boyfriends. To me he sounds seem like he’s conflicted. He wants to love your sister, he wants to want to marry her but he doesn’t and he doesn’t have the strength to let her go so he’s just gonna hang on but he can’t hide his true feelings and he doesn’t mind hurting her. Fuck this guy. This man will make your sister cry,  not just once. He will hurt her again and again. He won’t know why. If he does love your sister and does wanna marry her and does wanna be a member of your family he’s gonna have to figure out that being a cunt is not how you show love.",
            "score": 1,
            "replies": []
        },
        {
            "author": "haroldmorris24",
            "body": "I guess y’all have no brothers or men in the family as a brother I would have a discussion with him to point out his wrong doing and show him the love of a brother for his sister",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otherwise_Mix_3305",
            "body": "NTA. Your sister needs to leave this guy. Your dad nailed it on the head.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Badbunny42",
            "body": "NTA for embarrassing him, YTA for embarrassing her",
            "score": 1,
            "replies": []
        },
        {
            "author": "InformationTop3437",
            "body": "So he's not her fiance, right? You refer him as fiance but it was a fake proposal, so he's just and asshole boyfriend. Should be ex boyfriend by now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "avid-learner-bot",
            "body": "The fiancé's actions were really inappropriate and hurtful. OP, it's super important for your sister to set some clear boundaries with him right now, letting this kind of disrespect slide could have serious long-term effects on her mental well-being. She needs someone who respects and values her feelings, you know? Encourage the family to keep supporting her by making sure she feels heard and respected... it's all about creating a safe space for her. Honestly, this situation is definitely a YTA because his behavior shows he lacks empathy and doesn't care how it affects others. Maybe suggest she talks to some trusted friends or even professionals who can help her figure out what to do next",
            "score": 1,
            "replies": []
        },
        {
            "author": "Livvysgma",
            "body": "Why do you refer to him as her fiancé if they’re not engaged? NTA. What you did wasn’t a big deal, especially compared to what he did to your sister. You called out his bs, and he didn’t like it. He’s a thin skinned a-hole who can dish it, but can’t take it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Laughingfoxcreates",
            "body": "NTA. Your dad is right. Hopefully he can talk sense into her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Joking have a threshold. Dont spit it out if u can't take it out. I have very low threshold and I make sure I don't cross my limits either. Nta. Ur sister need to get her act together and find someone better",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mewsiex",
            "body": "NTAH but your sister is deep in the fog. Why is she defending this man and holding on to him? He's cruel to her and gets off on humiliating her in public. How does she think her life will be once he's got her trapped in a marriage? Does she think she will never find another man? \n\nShe might need to be sat down and set straight by you and your family as a united front.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_Path_3166",
            "body": "You and your dad are heroes. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ghostoftommyknocker",
            "body": "If calling him out has made things even worse for her instead of making him realise just how utterly wrong his behaviour is, then she definitely needs to get out of this relationship. \n\nHe's already abusive and this will only get worse.\n\nThe \"prank\" was already a relationship dealbreaker all by itself, but what more proof does she need that he is utterly remorseless?\n\nHis next step is going to be to isolate her from her family and support network. She needs to wake up and get out of there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SandSpecialist2523",
            "body": "NTA you might have saved your sister from a shitty bf.",
            "score": 1,
            "replies": []
        },
        {
            "author": "queenlegolas",
            "body": "NTAH",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wingbow7",
            "body": "If she stays with this idiot she deserves him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agile-Wait-7571",
            "body": "You’re being a good sister.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Personal_Valuable_31",
            "body": "NTA.  I have a BIL like that.  He is not allowed in my house for any reason.  Cruelty should never be part of a relationship,  and he knew he was being a dick doing what he did.  Hurting her for a laugh is just the beginning.  He knew it, or he wouldn't have been embarrassed in front of your parents.  He will hurt and demean her, and then \"it's a joke - she can't take a joke.  She blows everything out of proportion.\"  He can't do that so easily now that his \"joke\" has been seen for what it is.  He also will have more trouble isolating her with you and your dad supporting her.   Hopefully, this will be the end of the relationship.   She deserves better than a cruel blowhard who will hurt her for his own amusement. Please update.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WindyWillow1326",
            "body": "I absolutely LOVE that you spoke up! He is a dick and your sister deserves better. You are a fantastic sister!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capable-Upstairs7728",
            "body": "NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Secret_Squirrel89",
            "body": "NTA and your sister needs a serious reality check she definitely needs to drop this sorry excuse of a man child. She deserves better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Organic_Garage7406",
            "body": "Your sister is ruining her life for this POS, you are NTA for having her back. Hopefully one day she wii understand that",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moaibeal",
            "body": "NTA she might remain pissed but imo you did the right thing. What a loser",
            "score": 1,
            "replies": []
        },
        {
            "author": "repthe732",
            "body": "NTA\n\nIf your comment made it so your sisters BF won’t propose then he was never planning to propose at all",
            "score": 1,
            "replies": []
        },
        {
            "author": "xchellelynnx",
            "body": "NTA. Sometimes we need to speak up for those we love if they don't do it themselves. Your parents deserve to know what kind of AH he is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaliStormborn",
            "body": "Every GPT AITA post ends in a nearly identical paragraph.\n\nNow xyz is mad at me for \"insert ridiculous quote here\". I said blah blah, but xyz thinks blah blah. So and so it's supporting me, but xyz says I'm an asshole.\n\n\nHow are people not clocking onto this?? Just downvote and move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConfusedAt63",
            "body": "NTA,  maybe suggest to your sister if she wants the truth about his intentions to come to light, she should do a public proposal of her own at a family gathering and see his reaction, she will have all the information she needs to make an informed decision about this guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few_Conversation1296",
            "body": "So, you blurted out something that your Sister finds super embarassing in front of the entire family for the sake of a zinger to her Boyfriend you don't like and you actually need to ask if you're an asshole? Yes. You are. And since this seems to be a point of misunderstanding, whether you are or aren't doesn't have anything to do with whether the Boyfriend is or not, it's perfectly possible for both of you to be boarish assholes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FutureOk6751",
            "body": "NTA. Tell you sister that if he cant take humiliations that he shouldn't dish it out. If he thinks it was so funny to do that in front of his friends than he should be fine with your family knowing about it since it was SOOOOO funny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far-Towel1045",
            "body": "ntah",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad-Limit-8709",
            "body": "Hopefully she leaves this loser ....",
            "score": 1,
            "replies": []
        },
        {
            "author": "pepperpat64",
            "body": "Someone has to stand up for your sister since she won't do it herself. Hopefully she'll understand that one day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tinybaby999",
            "body": "I truly wish you were my sister. My opinion he does not love your sister and is a cruel person.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HekateEnalia",
            "body": "Nta. That man is trash. He also hates women and your sister.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mcindy28",
            "body": "NTA he deserved to be called out. I'm sorry your sister doesn't see that she deserves better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mcindy28",
            "body": "NTA he deserved to be called out. I'm sorry your sister doesn't see that she deserves better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lindensorry",
            "body": "Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElectronicWerewolf99",
            "body": "NTA, your sister needs to grow a back bone. And good on your dad for calling him out as well",
            "score": 1,
            "replies": []
        },
        {
            "author": "WillLoveCoffee4Ever1",
            "body": "NTA! Your sister is a doormat and acting pathetic. I'm so glad your parents are on your side and not his and I'm especially happy that you and your dad set him straight. What he did WAS downright cruel and your sister is just sitting there with constant hope. If he had any intention of proposing, he soured it greatly for her, because if I was your sister, I would think that the next time would be another fake out. Thank goodness you aren't like your sister and it's good to see you're standing up for her, but she needs to stand up for herself. Tell your sister, he's getting a taste of his own medicine and he didn't like it. \n\nWhat a small pathetic jerk of a person, her bf is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Heathen-Punk",
            "body": "NTA\n\nProps to Dad for calling it like it is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lastunicorn76",
            "body": "She needs to leave that asshole",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strange_Emotion_2646",
            "body": "I love your dad!  NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dembowthennow",
            "body": "NTA. You did her a favor. He's a douchebag and now everyone knows - including him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry_Ask5493",
            "body": "NTA. If your sister can’t see how “ruining things for her” with this asshole is a good thing, then that tells me that she needs some serious therapy to build her self-esteem/respect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "winterworld561",
            "body": "NTA. He needed to be called out for his cruel behaviour. One day your sister will understand that you were just looking out for her and HE was the one that ruined things by being a total prick.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EarthBelcher",
            "body": "NTA. You are just making sure that the entire family knows what kind of man he is. If she can't see it, then at least you have warned her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "burningringof-fire",
            "body": "Will you be my sister?  You are straight up a hero! And eloquent at that!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScottFenstermacher",
            "body": "NTA. That dude is lucky Dad didn't take him to the woodshed for how he treated his daughter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rgw_fun",
            "body": "Sounds like you bottled your feelings up and lashed out in an unhelpful way. Don’t you think this could have been more effective as a planned conversation between your family and your sister? Telling her how being humiliated like that isn’t okay? ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Historical_Agent9426",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "VictoryShaft",
            "body": "Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExtraLengthiness5551",
            "body": "Yeah in 5 years your sister will be thanking your ass for showing everyone everyone how little respect her boyfriend has for her.  If she allows herself to be treated this way as a gf.  NTA…Try to actively break them up.  Your sister is in love = idiot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ACM915",
            "body": "NTA- but why would your sister stay with such an AH is beyond me.  She needs to dump him like a hot rock.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Homeboat199",
            "body": "NTA  Your sister is being abused and is too dumb to see it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LivreiradeSevilha",
            "body": "You did good, friend. Now the asshole knows that his sister has a family that defends her. And you will think twice before trying to humiliate her again 👍",
            "score": 1,
            "replies": []
        },
        {
            "author": "KelsarLabs",
            "body": "Your sister is weak. \n\nGood luck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Important-Coast-5585",
            "body": "NTA but I would have ripped him a new one and take my sister on a sister trip AND get her in therapy to figure out why she’s such a doormat to this chud. Plenty of better, emotionally mature fish in the sea my friend. \nI have an unusually honest relationship with my sisters. I have told them the unvarnished truth my entire life so I couldn’t have just sat there. \n\nHe sounds like a manipulative little boy in a man’s body. She deserves better. You’re nicer than I would be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CarsonJX",
            "body": "He's like this because your sister and millions of girls like her respond to it. Your sister wants him because of the way that he is. If you don't tolerate your sister bringing him into your life in a way that makes dating him relentlessly embarrassing to her, to the point that she realizes that nobody much cares for her company or respects her, then you will make dating a giant asshole too big of a burden for her to bear. The appeal of being with someone who belittles her will be diminished, and she might just make better choices. Make her pay for being an idiot now, so he can't make her pay for it later.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bizzygal77",
            "body": "u/BurbNBougie",
            "score": 1,
            "replies": []
        },
        {
            "author": "Senator_Bink",
            "body": "NTA.  He deserved it.  If Sis is determined to double down and stay with him, that's on her.  But at least the family knows what he is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patient_Space_7532",
            "body": "NTA! She should have left him the first time he humiliated her in front of all of his friends and found it HILARIOUS! All of them are assholes. His behavior will only get worse, especially if she marries him. Please help her see this, and support her going in the right direction! ✨️✨️✨️",
            "score": 1,
            "replies": []
        },
        {
            "author": "SensitiveReindeer856",
            "body": "NTA\nBut i feel like you and your family should focus more on your sister. You sticking up for your sister is a good thing but can cause a lot of damage. Your sister has low self esteem and you “attacking” her boyfriend can and maybe will push her away. When I encounter people with low self esteem problems it’s extremely important that they feel that their social environment provides a safety net. If you continue to stick up for her it will probably have the opposite effect meaning she’ll feel hurt or whatever and shut you out. \nI truly hope she’ll leave that AH as soon as possible but she would need a good support system and a lot of encouragement.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SelousX",
            "body": "The fiance is an ass. Your sister' best view of him is in her rear-view mirror. \n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkStrength5245",
            "body": "Breaking up would be the best case scenario here.\n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "CatmoCatmo",
            "body": "NTA. YOU DIDN’T RUIN A DAMNED THING. \n\nYou said nothing but facts. It’s all fun and games when his friends know all of the facts about what he did, but when your parents know, suddenly it isn’t so funny anymore is it?!  If the truth about your actions makes you look bad, the issue isn’t with the truth, it’s with your actions. \n\nAnd the gall of this asshole to double down on it being a “joke”.  Your dad is my hero. Good on him for calling her bf out.  \n\nYour sister needs to realize that if this jerk had one ounce of respect for her, he wouldn’t have humiliated her in the first place - and definitely not publicly. But even then, he wouldn’t have dismissed her feelings, treated her so inconsiderately, and turned it around on her for being “sensitive” and “unable to take a joke”. No, she CAN take a joke, but this wasn’t a joke. \n\nAt this point, she’s just his punching bag - available for him to use her and abuse her, so he can get a few laughs. I don’t know them, obviously, but based on this, I’m questioning if he even likes her, let alone loves her. He sure as hell doesn’t respect her, nor does he give a damn about her feelings. Is that who she wants as a “partner”?  Someone who doesn’t care how she feels?  And who will do whatever they want at her expense solely because he wants to?  \n\nI wouldn’t treat a stranger like that.  And most definitely would treat someone I supposedly love, care about, and respect, like that. Ask her: Would she tolerate you, or anyone else being so disrespectful and humiliating her?  Then why does he get a free pass?",
            "score": 1,
            "replies": []
        },
        {
            "author": "GibsonGirl55",
            "body": "She may not realize it now, but you did her a favor. I hope she dumps this guy. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JellicoAlpha_3_1",
            "body": "*Sister, I am going to rip your boyfriend a new asshole for the rest of his life for that fake proposal.  If you want to stay with him and put up with his bullshit, I will support you in that.  But I will never stop giving him shit for how he treats you.  Not now. Not ever.  I will always have your back.*\n\nNTAH",
            "score": 1,
            "replies": []
        },
        {
            "author": "tedleem15",
            "body": "NTA. She’s gonna be thanking you for this in 10 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kmardil",
            "body": "NTA and you sister is ignoring, explaining away, and justifying his behavior.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hana_ivy",
            "body": "Love is blind… your sister is proving so..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cami_glitter",
            "body": "I have never liked pranks.  I feel like calling a cruel act a \"prank\" is  just a way to get around the fact that the person pulling the prank is probably a bully.  \n\nI give you credit for your restraint.  \n\nSo not the ahole.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ronniedasaint",
            "body": "NTA. Period. He can’t hack it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "grouchykitten1517",
            "body": "Esh except your sister.  You didnt just embarrassed him, you aired your sister's shit and embarrassed her too.  You should have talked to him privately if you had shit to get off your chest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dremik2663",
            "body": "Nta family forgives when your heart is in the right place. You would’ve regretted not saying anything and hopefully this situation makes her dodge a bullet. Total D move on his part",
            "score": 1,
            "replies": []
        },
        {
            "author": "ButterscotchFluffy59",
            "body": "Yes your sister is embarrassed and you need to make up with her.  You're on her side and she might feel isolated and alone.  Definitely not the reaction you want right,?\n\nBut if she's not laughing at his joke and humiliated, it's open season on him.  And it takes someone like your father to call it what it is.  Cruelty.  He and your sister needed to hear that.  \n\nYour sister needs a friend and if she's mad at you, do what it takes to let her know you're on her side.  Maybe that will be enough for her to stick up for herself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1cilldude",
            "body": "The guys a dick. Your sister needs to run.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DogLover-777",
            "body": "NTA Your sister needs to grow a backbone. I agree with your dad - it WAS cruel. And not funny. Anyone that could be this heartless is NOT someone you want to spend the rest of your life with. I love how this asshole found it fine to embarass your sister, but couldn't be a man and take it when he got called out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AeroMysticss",
            "body": "NTA. Your sister was humiliated, and it’s understandable why you would call him out. His behavior was cruel, and it’s important to hold people accountable for treating loved ones badly, especially in public. You didn’t humiliate him; he embarrassed your sister first. You were just standing up for her",
            "score": 1,
            "replies": []
        },
        {
            "author": "PictureConsistent261",
            "body": "I don’t understand how he can be considered her fiancé if he hasn’t proposed.  No proposal & no ring is just a bf or a fwb. \nSo it’s ok if he humiliates your sister but can’t take it himself in return.  This guy has too many red flags.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Awingso",
            "body": "You were right. Your sister's angry, but eventually she'll open her eyes to see that you've been on her side. Your parents had a good reaction, the fiancé is completely stupid. A fake marriage proposal, who makes  laugh seriously ? 🙄\n\n I wish your sister would quickly regain her mind that she's not being respected in this relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EnfysMae",
            "body": "NTA\n\nIf she’s staying with him after this “joke”, what’s he going to do if they have kids? \n\nWhat “jokes” and “pranks” will he pull on them? Especially when they’re too young to understand about what is supposed to be “funny”? \n\nHe’s cruel to her, for his and his friend’s entertainment now. He’ll be cruel to any future kids for the same thing. Hell, he may film it and plaster it all over the internet, because it’s a “joke” right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "DowntownMonitor3524",
            "body": "Fuck him. Your sister can do much better. He’s abusive. .",
            "score": 1,
            "replies": []
        },
        {
            "author": "GetOffMyLawn_",
            "body": "Your sister has Stockholm syndrome. No doubt he is abusive in other ways too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bonkdonkers",
            "body": "nice AI slop 🥱",
            "score": 1,
            "replies": []
        },
        {
            "author": "Proper_Strategy_6663",
            "body": "NTA but you might have given him ammunition to isolate her, but yeah.. only one ruining things for her is herself for not valuing herself better. Loving someone isn't enough they have to love and respect back and clearly he doesn't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OliveRyan428",
            "body": "NTA.  You had your sister’s back.  The boyfriend did it to himself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yeoldladyhidro",
            "body": "So wait...is it her fiance or her boyfriend? Because if he fake proposed...that isn't her fiance.\n\nEither way, bro is a giant diaper load.\n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NisshokuNoKo",
            "body": "NTA. If you can make him hate your family so he never proposes you're doing your sister a solid, she just doesn't know it yet",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bakkie",
            "body": "My sister (28F) has been with her fiancé (32M)\n\nFiance means that there has been a marriage proposal which has been accepted. What am I missing here?",
            "score": 1,
            "replies": []
        },
        {
            "author": "conte360",
            "body": "Why does every single story on this subreddit sounds so stupid and made up?  oh never mind it's the quacks like a duck thing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Automatic-Set-1167",
            "body": "NTA  \nbtw how long r they together for/?",
            "score": 1,
            "replies": []
        },
        {
            "author": "JohnExcrement",
            "body": "Why do you refer to him as her fiancé? He’s bot and, one hopes, never will be. \n\nI wish your sister had some self respect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "akawendals",
            "body": "\"Making things worse\" \n\nWorse than what? Just the shit proposal thing or lots of other things he does that are shit... \n\nThings is plural.... So there's more than one thing 😔\n\nUpdateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "amun08",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "CatherineConstance",
            "body": "NTA but also I'm confused why you are calling him her fiancé when apparently he hasn't actually ever proposed...? Regardless, your sister needs to (respectfully) grow a pair and dump him. Her being worried about you guys pissing him off is stupid, he's a jerk and she needs to walk away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Many-Yard9056",
            "body": "Ehhhh borderline if not YTA. Your sister was clearly embarrassed by it as well. It wasn't your story to tell. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "chxrryxbombx",
            "body": "thank god he showed his true colors before she actually married him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kooky-Situation3059",
            "body": "NTA, but...\n\nI want to say you ultimately have saved your sister from a bad marriage if she moves on from him, but you also kind of took that choice away from her too.  I am stuck on the idea therapists say, for a problem to be solved we truly must face it, but if we let others solve our problems, are we truly learning the correct thing from that negative situation?\n\nAgain I love what you did for your sister, I am just a little concerned she was hesitant to call him on his despicable actions",
            "score": 1,
            "replies": []
        },
        {
            "author": "RadaghasztII",
            "body": "Your sister reminds me of my punch bag",
            "score": 1,
            "replies": [
                {
                    "author": "RadaghasztII",
                    "body": "And NTA. you go sibling! ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Amaranthim",
            "body": "Please Updateme! update us- please let us know she dumped his sorry ass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jackrabbits4ever",
            "body": "NTA, Anyone who purposely humiliates a loved one deserves humiliation in return.  Kuddos for you.  Your sister loves the ass, hopefully she realizes she can do better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Calm-Capital-3054",
            "body": "Not at all. He's a rude ass. Your poor sister. That's awful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WildlyDivine",
            "body": "NTA. I think you forgot the word *fake* in front of fiancé, considering that's what his proposal was.\n\nBut of course, your sister's mad, it's her life to mess up, not yours to defend /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "Huge-Personality-737",
            "body": "NTA - however your sister is the AH for doing this to herself.  Your sister needs to grow a spine or get therapy or both.  Then she needs to broom that douche wagon.  Good on you for standing up for her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Purple_Accordion",
            "body": "Maybe this has already been said, but, sorta YTA. I get where you're were coming from,l. He definitely deserved the call out, and your sister should not marry this pos, there are plenty guys out there who think these stupid trends are funny. However, you basically renewed her embarrassment about this situation all over again, and right in front her family members. You should have cleared it with her before putting her back on the spot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Equivalent-Oven-7005",
            "body": "Does he wear his cap backwards and ask to borrow everything twice?",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_Dont_Like_Rice",
            "body": "Your sister has aspirations of becoming a doormat and she's mad you don't want to be one, too. This guy is a dud and a loser. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "steamedumpling-0712",
            "body": "NTA. What he did to her was cruel and uncalled for - unfortunately your sister still has the rose-coloured glasses on. Give your sister a bit of a space to process, and see if you can talk to her down the road 1-1. I would give her the floor and let her talk about her feelings on the fake proposal, and maybe you can approach it after by clarifying why you did what you did, and help her see that what he did was crossing a BIG line. I would've done the same thing if my sister was dating a jerk like that (I'm also an older sister, might be why the protective instincts kicked in). Good luck!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ptprn11",
            "body": "Your sister thinks that she can’t get anybody better than this, probably because she’s fairly shy. So she’s hanging on to the gnome rather than trying to find somebody better. I think it’s for the best that this guy is exposed for the cruel person that he isand so she can take a harder look at if she’s willing to be with somebody who treats her so terribly. It’s still her choice in the long run, but she needs to have her eyes wide open in this relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scherzophrenia",
            "body": "Ai slop",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thrashman666812",
            "body": "NTA, he’s a douchebag and deserved to be embarrassed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoxyTEM",
            "body": "Sounds like your sister is a doormat and I feel like she’s never gonna leave him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Owenashi",
            "body": "NTA. I get she has feelings for him but he humiliated her with a fake proposal for his friends' amusement. 'Ruining' things between them would actually be a positive development in this case.",
            "score": 1,
            "replies": []
        },
        {
            "author": "good_dean",
            "body": "Gather round, kids. It's fake story time!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_IsLand",
            "body": "do you really need us to tell you that was the right call?  your sis needs to dump that sack of potatoes and move on - she'll see the truth of it when the fog lifts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChibiSailorMercury",
            "body": "I see what you were trying to do, but I'll have to give you a \"soft YTAH-ish\". You did humiliate your sister's bf but you also humiliated her. Your parents did not know because she didn't tell them because she was humiliated by the prank. You made her have to relive it.\n\nNow, I know it's tough love to wake him up to his awfulness and wake her up to his awfulness, but it seems that your sister is hell bent on marrying the guy. Maybe his qualities compensate for his assholery. Maybe she fell for the sunk cost fallacy and she wants to be married so bad, she'll marry him because she's been with him for a long time and she does not want to restart the whole process, having to go on first dates, building a rapport, etc.\n\nWho knows. \n\nIt just wasn't the right way to go about it. But you really had good intentions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SportySue60",
            "body": "NTA - I am sorry to say that you sister is chasing a ghost of a relationship. What he did was in way shape or form funny and your Dad was right it was cruel. Your sister has to want to fight this battle and it’s easier for her to be a doormat to this guy than to walk away. It is also easier for her to blame you than to take any accountability….",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mach5Driver",
            "body": "Any SANE person would realize that they had only themselves to blame for doing that and deserved to be called out on it. If he can't see that, then sister is WAY better off without that prick.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Current-Anybody9331",
            "body": "He's abusive. I'd ask your sister why her self-esteem is so low she believes his behavior is acceptable?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BernieTheDachshund",
            "body": "INFO how is he her fiancé if he hasn't really proposed yet?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SheLovesStocks",
            "body": "I’m confused why the title says my sister fiancé but no one is engaged..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Obvious-Weakness-218",
            "body": "A joke is only funny if both parties are laughing.  \n\nShe needs to realize that moment where she was heart broken is what the rest of her life will look like if she stays with this man.\n\nI hope she realizes that she deserves better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkExternal7904",
            "body": "I love this for your sister. Her bf has been put on notice about stupid jokes and exhibition style humiliation.\n\nNTA! You're her hero. She doesn't know it yet. ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "goingpostal-easypeas",
            "body": "😒😒😒😒😒😒😒😒😒😒\n\n\n\n\nYou're a good sister because You wouldn't let her be the butt of the joke \n\n\n\n\nbut she's ready to be more upset at you for calling him out about his act ****than being upset at him for doing it****** she cray cray 🥲\n\n\n\n🤣🤣🤣🤣🤣 she can grow up and either keep being his punching bag for \"jokes\" \n\n\n\n\"I just called you fat it's just a joke\" \n\n\n\n\"I just called you a dumbass it's just a joke\" \n\n\n\n\"I just stomped out your hopes of marrying me it's just  a joke chill\" 😒😒😒😒😒😒😒",
            "score": 1,
            "replies": []
        },
        {
            "author": "Midnight-Rants",
            "body": "NTA!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Foolforchocolate",
            "body": "NTA, your poor sister needs to realize a good man would never humiliate or prank someone he loves in this manner. That was beyond cruel. She deserves a partner who treats her with love and respect, not this juvenile who is stuck in high school mode.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mermaidtoo",
            "body": "The bf absolutely deserved being roasted and to be made uncomfortable. Most people (including myself) would have reacted similarly. \n\nBut you really didn’t accomplish anything positive other than getting that temporary satisfaction. Your sister is still with this guy despite his cruel and sadistic behavior. Only now she’s likely being blamed for your actions and may not trust or confide in you in the future.  \n\nYou aren’t an AH for telling your parents about what the bf did. But doing it in front of the bf wasn’t the most strategic choice. Don’t let the bf isolate or further harm your sister.",
            "score": 1,
            "replies": []
        },
        {
            "author": "piehore",
            "body": "He’s broken her self esteem with emotional abuse/manipulation.  My SIL married a dude just like him.  He doesn’t come to any family gatherings because no one likes him and tried isolating her.  It took therapy for her to accept that he’s not a good person but she’s still married to him.  Your sister should look at individual therapy.   Signs of emotional abuse \n\nhumiliating you in front of others;\ncalling you insulting names, such as “stupid,” “disgusting,” or “worthless”;\ngetting angry in a way that is frightening to you;\nthreatening to hurt you, people you care about, or pets;\nthe abuser threatening to harm him/herself when upset with you;\nsaying things like, “If I can’t have you, then no one can;”\ndeciding things for you that you should decide, like what you wear or eat;\nacting jealous, including constantly accusing you of cheating;\ncontinually pretending to not to understand what you are saying, making you feel stupid, or refusing to listen to your thoughts and opinions;\nquestioning your memory of events or denying that an event happened the way you said it did, even when the abuser knows that you are right;\nchanging the subject whenever you try to start conversations with the abuser and others and questioning your thoughts in a way that makes you feel unworthy; and\nmaking your needs or feelings seem unimportant or less important than those of the abuser.  \n\nhttps://www.womenslaw.org/about-abuse/forms-abuse/emotional-and-psychological-abuse",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoGame212",
            "body": "NTA This is what happens when insecure women can’t be without a man.  They latch on to whoever will have them and stay when it goes bad.  If you’re not enough without them, you’ll never be enough with them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whatupmygliplops",
            "body": "\\> She’s always been the more reserved, quiet type, while he’s loud, extroverted, and sometimes a little over-the-top. We tolerated him\n\n  \nShe doesnt \"tolerate\" him. She CHOSE him out of every other guy on the planet. She likes him.  Is it a bad choice? Probably But its not your business. \n\n  \nNTA but also back off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theEx30",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Natatatcat22",
            "body": "I can understand a little where your sister is coming from. You spoke about something she shared with you, the she might have expected you to keep private. On top of that, you spoke about it at dinner in front of the entire family. She should have told you “this stays between us.” She will now have to decide what she trusts to share with you.\n\nAs for you, you are your own person and you do not have to stand by as others disrespect the people that you love. That is your choice. And no one can force you to speak or stay silent. I would not have stood by silently either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jmhotioli1234",
            "body": "NTA\n\nHow old are you? You don’t say in your post and you seem more emotionally mature than either of them. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emergency_Toe_7982",
            "body": "Why are you calling him her fiancé if the proposal was fake??",
            "score": 1,
            "replies": []
        },
        {
            "author": "jellybelly41913",
            "body": "So is it her boyfriend or fiance? If the proposal wasn't real then it would still be her boyfriend right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Late-Ad4964",
            "body": "And with a dude like that, you’ve probably consigned your sister to even more degrading treatment when she gets back to his place. You’re NTA, but defo uninformed.\n\nI suggest you maybe seek some domestic abuse support for your sister and research legitimate ways to support her in what appears to be somewhat of an abusive relationship.\n\nALWAYS be there for her, regardless of whether she makes poor choices when it comes to men; she may need you to literally save her life one day 🫶🏽",
            "score": 1,
            "replies": []
        },
        {
            "author": "SilverDryad",
            "body": "This is a difficult situation. Do you want to be right or do you want your sister? Your sister is not willing to see this guy for the shallow, cruel manipulator he is. The more you persist in trying to open her eyes, the more she will defend him. You have your role wrong. You don't want to be the one who forces her to alienate herself, for him. You want to be the one who can remain unbiased and supportive of her. So that when she does open her eyes you can receive her with the warmth of love and understanding, rather than the icy blade of I told you so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OneTwoWee000",
            "body": "INFO\n\nHow is he her fiancé if he joked proposed? Did he backtrack and actually propose later?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Global_College9159",
            "body": "NTA. Your sister has some life lessons to learn about self-esteem, boundaries, and the fact it’s less awful to be alone than be in a marriage where you’re treated poorly.\n\nIf/when she brings this up again, just reiterate that you won’t tolerate someone treating her with disrespect. If her fiancé is embarrassed, then he needs to look at his own behavior and DO BETTER. If he mistreats her, he’ll do the same to other people, his own children, pets, etc.; he has a lot of growing up to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CVSaporito",
            "body": "Never ever heard of someone pranking a person they love like that, she needs to dump his ass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mindolix",
            "body": "Leave him. If she tolerates his behaviour now, he's gonna think that its okay to behave like this forever. She'll have to tolerate him for the rest of her life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_acvf",
            "body": "I really hope you ruined what would be an awful marriage for her! You are an awesome sister, NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PhoneRings2024",
            "body": "NTA.  Your sister was already humiliated by the fake proposal.  Can't go much lower than that.  Sounds like she has no self esteem. And your family was right to call him out.  Hopefully he'll break up with her.  He's ruined any chances he had to have a good relationship with your family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Skwonkie_",
            "body": "You did your sister a service, one day she’ll realize it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zoomerang93",
            "body": "I see no issues with this AH meeting a consequence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleepystaff",
            "body": "NTA.  \n\nThe bigger issue is, your sister settling for this guy and importantly, what is wrong with her self esteem & thinking process & self worth?",
            "score": 1,
            "replies": []
        },
        {
            "author": "firstlordshuza",
            "body": "YTA. It's your sister's life, not yours. It's up to her to do something about that",
            "score": 1,
            "replies": []
        },
        {
            "author": "mladyhawke",
            "body": "Your sister doesn't have any self worth and she thinks this is the best she can do, try to change her mind, she's worth more than that jerk",
            "score": 1,
            "replies": []
        },
        {
            "author": "Canadasaver",
            "body": "Sister needs counselling for being so desperate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "somerday",
            "body": "\nI hope and pray your sister dumps this AH.  ASAP!!!!!!! He is cruel and mean. He loves only himself, and he’ll only get worse. I’m glad you had the guts to speak up. If I were her parents……",
            "score": 1,
            "replies": []
        },
        {
            "author": "green_eyed_mister",
            "body": "The dad spoke the truth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "anewlookav",
            "body": "I've never done this with a family member, but I'm in a group of friends that have been getting together about twice a year since high school 20 years ago.  One of the women in the group married a guy no one likes.  She's still invited.  He's simply not welcome.  She still comes to the get-togethers, and even brings her kids.  He doesn't come.\n\nYour family might be headed that way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MorphologicStandard",
            "body": "\"We tolerated him, but recently, he crossed a serious line\" -- (paragraph separation)\n\n\nthis is AI methinks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silvara71",
            "body": "NTA. Your sister, unfortunately, isn't ready to leave him for whatever reason. You can support her, but hiding his actions only benefits him. I would try to help her understand what her insecurities are about leaving him. Hopefully, once she understands that, she can find the strength to leave.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sundrenchedpavement",
            "body": "You're right: he did deserve to be called out. If he's embarrassed by his own actions getting brought up in front other people, that's a good indication that it was a mean thing to do. Fuck that guy I hope she leaves him",
            "score": 1,
            "replies": []
        },
        {
            "author": "General-Monk-1315",
            "body": "I think regardless of what was done to her, you didn't do this for your sister. If it was an act for your sister you would've involved her or talked to her about hitting him up at the very least.\nThis act kinda seems like it was only done to make yourself feel better, and has had that effect. Your parents, sister and her partner are all unhappy but hey, at least you got 1 up on him right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CommunicationGlad299",
            "body": "NTA Your family needs to do an intervention with your sister.  Her bf is a complete jerk and your dad is 100% right.  Does your sister think she can't do any better?  Is she so lonely that she would put up with any behavior, no matter how bad, just to be with somebody?  Maybe some therapy will help her to understand that being with someone cruel is not better than being alone.\n\nAs far as what you did, if her bf thinks it's hilarious to humiliate someone in front of a bunch of people, why wasn't he laughing when he was on the shit end of the stick.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Smoke__Frog",
            "body": "Dude I’m going to give you some honest advice.\n\nYou’re NTA for standing up for your sister, but you need to accept she’s gonna be one of those loser woman who stays with a jerk forever and lives a shell of a life.\n\nYou’re going to give yourself heartburn caring about her relationship. She has made it clear he can embarrass her, humiliate her and probably cheat on her, and she’s going no where. The sooner you accept that, the sooner you can let your frustration go.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NinjaSpiderman89",
            "body": "If what you're saying is true, then your sister is making a big mistake by marrying him. However, if she decides to marry him, then she'll have to live with the consequences.",
            "score": 1,
            "replies": []
        },
        {
            "author": "carlotta3121",
            "body": "NTA, your sister is being blind to the cruelty and it will only get worse if she stays with him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cryptooptimist77",
            "body": "NTA- I’d want to punch that smug cunt right in the mouth. What an asshole. Your dad is right; it’s just plain cruel what he did..",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComfortableAbject416",
            "body": "NTA \n\nPlease don’t let her marry that a-hole. Make sure he doesn’t start trying to isolate her from you all",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComfortableAbject416",
            "body": "NTA \n\nPlease don’t let her marry that a-hole. Make sure he doesn’t start trying to isolate her from you all",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComfortableAbject416",
            "body": "NTA \n\nPlease don’t let her marry that a-hole. Make sure he doesn’t start trying to isolate her from you all",
            "score": 1,
            "replies": []
        },
        {
            "author": "TransportationBig710",
            "body": "NTA. What this guy did was cruel, and you called him out. You sis needs to think about why she would stick around after someone treated her that way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TransportationBig710",
            "body": "NTA. What this guy did was cruel, and you called him out. You sis needs to think about why she would stick around after someone treated her that way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooCats8451",
            "body": "NTA he sounds like an immature prick that I’d probably end up punching in the teeth within 5mins of meeting him",
            "score": 1,
            "replies": []
        },
        {
            "author": "allisone88",
            "body": "This guy is permanent bachelor material. NTA and sis needs to grow a backbone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WearyYogurtcloset589",
            "body": "NTA!  \nBut she really shouldn't marry this moron.  \nHe's a full on crimson flag.\n\nupdateme!",
            "score": 1,
            "replies": []
        },
        {
            "author": "sezit",
            "body": "I only *hope* things are ruined between your sis and her fiance. \n\nHe's pure garbage. His friends, too. \n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WearyYogurtcloset589",
            "body": "NTA!  \nBut she really shouldn't marry this moron.  \nHe's a full on crimson flag.\n\nupdateme!",
            "score": 1,
            "replies": []
        },
        {
            "author": "allisone88",
            "body": "This guy is permanent bachelor material. NTA and sis needs to grow a backbone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "allisone88",
            "body": "This guy is permanent bachelor material. NTA and sis needs to grow a backbone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MildLittlRain",
            "body": "My god, your sister needs a reality check, she can do better than that dou**bag. He got what he deserved.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Miliean",
            "body": "So like, I get what you're trying to do.  It's just that it's not going to work and is more likely to have the opposite effect to what you want. \n\nHe's an asshole and your sister should dump his ass.  The core problem here is that she didn't, and docent look like she will.  The best way to get her to do that is to talk to her privately and persuade her, as well as let her know that she is supported and loved regardless of what she chooses. \n\nInstead of doing that, what you have done is created a situation where he hates you, and he's going to make this a \"me or him\" situation.  If she's not ready to leave her abusive relationship, she's going to choose him.  That means that you are not \"there for her\" in the event that she actually wants to leave him.  It means that you're cut out.\n\nLets be clear, this is an abusive relationship and those have some special dynamics that tend to be at play.  When well meaning family members create \"them or me\" situations they do in fact just make things worse, never better.  The person who's being abused feels more alone, not less.  They do not feel incentivized or empowered, they feel further beaten down. \n\nSo to look at your actions and ask, what was it you hoped to accomplish and did those actions accomplish that?  The answer I feel is that those actions pushes you further away from your goal, not closer to it.\n\nI don't think you're an asshole, I just think that you've not had to deal with a truly abusive person before and so you might not know what happens.  They WANT to isolate their partners, and what you did pushes her towards being isolated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrLazyLion",
            "body": "\"...my sister says I’ve ruined things for her.\"\n\nHopefully!\n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bootslol",
            "body": "Unfortunate your sister can't see things were already ruined and you just helped her.\n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Singing_Sword",
            "body": "NTA. Sounds like your statement was pretty tame given how hurt your sister had been. Of course she's upset with you though - you rocked the boat and it sounds like she'd rather sweep it under the rug. That's on her though if she's willing to up with his mistreatment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bibiloafmonster",
            "body": "Planning an elaborate fake proposal is psychotic behavior and I’m really glad ur pops said something. I hope what he said sticks with your sister. You may have ruined things for her, but it’s for the best. Do not let her marry this boy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Singing_Sword",
            "body": "NTA. Sounds like your statement was pretty tame given how hurt your sister had been. Of course she's upset with you though - you rocked the boat and it sounds like she'd rather sweep it under the rug. That's on her though if she's willing to up with his mistreatment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "conleyshane25",
            "body": "You did her a favor even if she doesn't know it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "conleyshane25",
            "body": "You did her a favor even if she doesn't know it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "murillokb",
            "body": "NTA love your dad’s reaction",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sickofusernamez",
            "body": "NTA\nBut your sister is. He's not even slick about the abuse and she is staying with him while making it your problem, If he makes her cry or embarrasses her again, let her sink and really feel it.  Tell her if you don't want to help/stand up yourself don't come crying to me when people hurt you.  \n\n\nBecause a lot of people see the red flags and ignore the advice/warnings of people who were good to and loved them before they had a partner and now their people are doing too much and their people are the devil because some random ass said so?   Adults got to be held accountable for being willfully stupid and ignorant in relationships.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Available-Toe-1010",
            "body": "Nope 👎",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic-Tea7709",
            "body": "Nta. Your parents didn’t know and it’s better to bring it out in the open so he can’t hide it from the people closest to her. His behaviour was beyond awful, perhaps the perspective of others will help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoanALissa32",
            "body": "He’s the AH you were just defending your sister who doesn’t see her worth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Terrible_Kiwi_776",
            "body": "NTA  You sister needs therapy. I don't say that to be mean, but your father is right. She is with a cruel and mean-spirited person. This should not be something she embraces.",
            "score": 1,
            "replies": []
        },
        {
            "author": "guy_blows_horn",
            "body": "If she goes to him she'll be forever unhappy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bleezy79",
            "body": "NTA - That was a dick move and he sounds really immature to even be thinking about marriage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Disastrous-Panda5530",
            "body": "NTA. I hope your sister comes to her senses about this guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "D2fmk",
            "body": "Sounds like the kinda guy that wouldn't even ask her father.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gloomy_girly",
            "body": "Your sister's fiancé is a total jerk! That prank was beyond cruel, and you did the right thing calling him out. Your sister needs to wake up and see how toxic he is. Hell no, you didn’t ruin anything; he did that himself...",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExtremeJujoo",
            "body": "NTA\nBut your sister is for staying with that turd. She needs to grow a spine and learn a little self love.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gmnitsua",
            "body": "So he's not her fiancé at all?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BobbieClough",
            "body": "So Mia, what type of porn are you going to be posting on this account in the future once the AI has gained you enough karma?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imalwayshungry420",
            "body": "NTAH but your sister is really desperate. Not seeing how he humilated her but now going at you for defending her. Idk maybe they deserve each other",
            "score": 1,
            "replies": []
        },
        {
            "author": "rellv",
            "body": "I saw my friends marry men who made them the butt of their jokes. Both are now divorced not even a few years in. She will forgive you. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bootslol",
            "body": "Unfortunate your sister can't see things were already ruined and you just helped her.\n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xenamom",
            "body": "NTA \nI think you are a hero.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChefCrowbane",
            "body": "Good for you and your dad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crazy-kas",
            "body": "Is he even a fiancé if he hasn’t proposed formally?  But NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Squirmme",
            "body": "Nta. He should be grateful you gave him this opportunity to reflect on his shitty decisions",
            "score": 1,
            "replies": [
                {
                    "author": "Agreeable_Skill_1599",
                    "body": "In the past, I've seen a few comments requesting to add JA (Justified A$$hole) to the acronyms here. I happen to agree with the sentiment.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheDecoyOctopus",
            "body": "Sometimes it's completely justified to be an asshole. This is one of those cases. Well done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Talithathinks",
            "body": "He doesn’t love her and what he did is more about cruelty than love. \nI hope that she begins to feel good about herself to leave him and not look back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReserveNo5557",
            "body": "This has to be a bot account just look at the profile they’re everywhere",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Wise-Weasel",
            "body": "any guy that purposely embarasses you and belittles you in front of his friends,  is an absolute clueless MORON........ and deserves every bit of revenge humilation you can dish out.    Yeah, SUCKS to be embarassed in public, doesn't it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electronic-Ear-3718",
            "body": "Regardless of what the fiance deserves for his thoughtlessness, you embarrassed your sister and divided the family. It's so funny to me how self-righteous and meddlesome people can be on Reddit and be acclaimed for it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lokipupper456",
            "body": "NTA.  Tell her that you hope she is right and that you “ruined” things for her with this guy because the worst possible outcome would be for her to end out with him.  And that if she had any sense at all, she’d be doing her level best to “ruin” things with him by dumping his nasty ass!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lokipupper456",
            "body": "UpdateMe!",
            "score": 1,
            "replies": []
        },
        {
            "author": "bramblefish",
            "body": "NTA but also overstepped. sounds like your sister chooses to be a door mat, and her limiting herself in lifes options are not really any one elses fight.\n\nIt is really unfortunate when people can not advocate for themselves, but when others do it, it can be soul crushing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AffectionatePaper924",
            "body": "She should Run.  He sounds truly awful.   I don't mean to split hairs, but it doesn't sound like he officially asked her to marry him to begin with.  Why is he being called her fiance'?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Initial_Dish6682",
            "body": "Uour sister is still hanging on to ghis guy who took a shit on her,still didn't propose and your sister thinks you're the bad guy?her self esteem is in hell if she still puts up with him.nta",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReidGirly93",
            "body": "NTA. He sounds like a cruel AH and your sister deserves better than a heartless red flag. You were right by exposing him to your family",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mad-Dog20-20",
            "body": "If she wants more of the same then Sis can stick around...I'm not\n\nnta",
            "score": 1,
            "replies": []
        },
        {
            "author": "Full_Pace7666",
            "body": "I’m torn.\n\nHe is absolutely an asshole, that prank was cruel. And generally one is never an asshole for calling out that behavior.\n\nThat being said, your sister does not want you and the family getting too involved and I think you need to respect that. Ultimately it’s on the two of them to work through. \n\nSupport her as much as you can, but I’d dial back on the comments to him at gatherings.",
            "score": -3,
            "replies": []
        },
        {
            "author": "MiaDawnx",
            "body": "I get you, but nah, I ain’t about to sit back while this dude clowns my sister and acts like it’s all good. If he can dish it, he can take it. If me calling out his BS ‘made things worse,’ then the real issue ain’t me, it’s her being stuck with a walking red flag.",
            "score": 30,
            "replies": []
        },
        {
            "author": "puzzledpizza393",
            "body": "💯. You handled this perfectly. You gave him something to think about. He knows he deserved that.",
            "score": 8,
            "replies": []
        },
        {
            "author": "bustakita",
            "body": "You did the right thing because you love her and want to see the best for her. Not to mention that y'all's parents didn't even know yo  cause she never told them. Them hearing it from you for the first time shouldn't have even happened. You are NTA but your sister's BF is. And I do wonder what else he is doing and how he has treating her behind closed doors. At least your sister knows you are there for her and will be there for her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SignalKey5774",
            "body": "The real issue here is that there is a fine line for pricks like him between cruel pranks and jokes and abuse. He is likely angry at your sister for telling you about the situation. Think of how that could affect her later on in private with him. You need to tread carefully between letting your sister know you've got her back and making it so that she is scared to reach out to you because she fears his reaction. His cruel \"joke\" doesn't absolutely mean he is or will be abusive but I feel like it's a pretty good indication of that eventuality. So just consider that when you're calling him out and standing up for her. You want her to come to you when she is ready.",
            "score": -2,
            "replies": []
        },
        {
            "author": "TheOfficialKramer",
            "body": "This statement makes YTA.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Beneficial-Way-8742",
            "body": "NTA, but why are you calling him her fiance?  If neither have proposed and has it accepted by the other, he's just a boyfriend ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Upset-Restaurant-890",
            "body": "Careful.  Your sister is being manipulated by this guy.  Don’t put her in a situation that he can use to isolate her from you.  \n\nHe’s going to use this as a reason for them to stop coming around as often while he fills her head with garbage about your family.  Probably all teary eyed “They’re so mean to me and make me feel unwelcome.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Important_Abalone_15",
            "body": "Never stand up for your sister again she’s one of those who tend to defend their abusers",
            "score": 1,
            "replies": []
        },
        {
            "author": "jekkah79",
            "body": "This is a justifiable AH moment. So, technically, but not really",
            "score": -1,
            "replies": []
        },
        {
            "author": "Due-Koala125",
            "body": "How exactly does a fiancé do a prank proposal to someone they are already engaged to?",
            "score": -1,
            "replies": []
        },
        {
            "author": "anabolicnatural",
            "body": "Not your place to say anything. Your both assholes, you both should apologize to your sister.",
            "score": -1,
            "replies": []
        },
        {
            "author": "arstin",
            "body": "Unilaterally sabotaging your adult sister's relationship rather than voicing your concerns to her like a grown up? Yes, YTA.",
            "score": -4,
            "replies": []
        }
    ]
}