{
    "title": "Increased Christianity in schools opens the door to Satanic Temple education programs",
    "author": "zsreport",
    "subreddit": "politics",
    "rank": 3,
    "score": 1935,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 119,
    "url": "https://thehill.com/homenews/education/5033111-satanic-temple-education-programs-ohio-texas-louisiana-oklahoma/",
    "id": "1hbrvh8",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bulky_Ad4472",
            "body": "Here's a wild idea: Keep religion out of schools.",
            "score": 1,
            "replies": [
                {
                    "author": "FootlongDonut",
                    "body": "That's generally what the Satanic Temple are trying to achieve here.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AlexRyang",
                            "body": "Florida is reportedly trying to write laws deeming the Satanic Temple a political organization and not a religion.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "XShadowborneX",
                                    "body": "Well seeing as churches are endorsing political candidates perhaps Christianity should be seen as a political organization",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "_DCtheTall_",
                                            "body": "We honestly should. Imo the only reason we do not is because Christianity dominates our politics and our culture in ways we are so used to we barely even notice unless you're not Christian and actively thinking about it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kerelsk",
                                                    "body": "My old boss used to complain about how few Christians there were in this country. Dude really wanted to feel oppressed.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Major_Magazine8597",
                                            "body": "That's a tax-exempt bingo!",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ZLUCremisi",
                                            "body": "Thats why you report them ti the IRS",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RedBeardsCurse",
                                    "body": "*In floats the Flying Spaghetti Monster.*   \n\n\nThere will always be another religion to do the same thing. Short of naming Christianity the state religion they will be writing new laws until the end of time.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ivy61",
                                            "body": "I don’t think we even need a new religion. Just start pushing for the  Quran. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "valeyard89",
                                                    "body": "Shakira law",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "nibbles200",
                                                            "body": "And the lord said, “those hips don’t lie”",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "guzhogi",
                                                    "body": "If they call Satanism a political organization, they’ll just label Islam a terrorist organization",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AlexRyang",
                                            "body": "> In floats the Flying Spaghetti Monster\n\nRamen.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jvlpdillon",
                                    "body": "Insert meme of Pam saying they are the same picture.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Inevitable-Tone-8595",
                                    "body": "The State shouldn’t get to decide what religions are true or legitimate, how would that also not violate the first amendment? It would literally fit the letter of “establishment of religion.”",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "kc_______",
                                    "body": "I would elect them president if the Christian nut jobs want religion in schools, I mean, the current president elect is basically the anti-Christ anyway.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Bulky_Ad4472",
                            "body": "Believe me, I get it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Timely_Arm_3481",
                                    "body": "But MAGA doesn't.\n\nSadly, I think the answer is that the country as a whole is much more misogynist and racist than I thought it could be. And the Republican messaging made it clear that they would hold the line against any attempts to make things fair.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "walrusdoom",
                            "body": "Yes, that’s our general strategy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Bioceramic",
                            "body": "I honestly would not be surprised if the Republicans were able to pass a Constitutional amendment carving out an exception to the 1st amendment, just for this.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JakeTravel27",
                    "body": "I would love for that to happen.  Sadly shit hole red states like Oklahoma, 49th in education BTW, are forcing bibles in every school.  Signed bibles by adultery don, of course.    I certainly hope every teacher takes the time to teach what adultery is, and why it makes adultery don such a shitty, disgusting, vile POS.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Distinct-Classic8302",
                            "body": "They need to create a Satanic Bible and force that into the schools too.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DrGoblinator",
                                    "body": "There is a Satanic Bible.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Legion_of_ferret",
                                            "body": "The satanic Bible is for the church of Satan which is *not* the Satanic Temple.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Same_Structure9581",
                            "body": "not just any bible, the trump bible\n\nedit: i see what you’re saying",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Logical_Parameters",
                            "body": "\"If you aren't pregnant by 16, you don't get a free Bible!\" --Oklahoma",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "an_agreeing_dothraki",
                            "body": "they don't actually care about those Bibles though, it was a money laundering scheme. Which is somehow worse.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "snugthepig",
                    "body": "even Jesus said “give to Ceaser what is Ceaser’s, give to God what is God’s”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SmoothSire",
                    "body": "Grooming is only bad when it's the Gays, but good when it's Christians.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DocFreudstein",
                    "body": "Or if you mention other religions, do it in a more secular fashion. \n\nI live in rural CT, and our town has a massive Indian population due to H1B visas and our insurance companies. My stepson’s elementary school is a whopping 30% Asian because of this, and naturally he learns about some Indian traditions due to his peer group. I’m all for him learning about Diwali and any other holidays in a cultural sense, as it helps us learn about each other. \n\nTeaching Christian ideals as if that’s the ONLY path is wrong.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zsreport",
                    "body": "I 100% fucking agree with this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "allthatweidner",
                    "body": "That’s the whole point of the Satanic temple. They are a protest religion, only existing to show the double standard and preference Christianity tends to get in our system.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SekhWork",
                            "body": "Eh. There's a decent number of us who are both down to help show the double standard towards Christianity *but also* significantly invested in the tenents of TST and how it can improve your life if you follow it. I mean, it was originally written basically to be an example of how to do \"commandments\" right so that makes sense. There's a LOT of TST members who joined just for the vibes beyond being anti-religion in school.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bakerfredricka",
                    "body": "During the time I was in eighth grade there was a section of social studies that taught us the key beliefs of the world's major religions. This kind of thing IMO is perfectly fine so long as it is taught in the most neutral and non-judgmental way I had it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Aware_Material_9985",
                    "body": "Certainly feels like this should be an all or nothing thing. Either study them all in the proper context or have none.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LaMelgoatBall",
                    "body": "And politics",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EeryRain1",
                            "body": "…how the hell can you teach about the history leading into every major event in history without mentioning the politics that caused the events?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DogEatChiliDog",
            "body": "Except not really because Christians don't give a fuck about equality and will just cheat.",
            "score": 1,
            "replies": [
                {
                    "author": "EliteEinhorn",
                    "body": "As someone raised Christian, I feel like cheating should be frowned upon.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ban-Circumcision-Now",
                            "body": "By the religious? No they seem fine with “rules for thee, but not for me “",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cocoon_eclosion_moth",
                                    "body": "They’re God’s good little boys and girls, and with God on their side, they can do anything they want, because they’re on the side of righteousness.  Religion is the same as cancer",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jwright4105",
                                            "body": "Except that more and more we are finding ways to cure cancer.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DogEatChiliDog",
                            "body": "As someone raised in a Christian household but who rejected it from my earliest age, one of the main reasons I constantly rejected it was because of the ceaseless and brutal hypocrisy.\n\nMy relatives truly believed they were the Blessed people better than everyone else in the world and therefore they could treat those subhumans however they wanted.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Logical_Parameters",
                            "body": "like the good book of Christian Hypocrisy says (apparently, judging by the behaviors of its devotees), \"it only matters when the *other* families are caught.\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DeliberatelyDrifting",
                            "body": "Nah, it's fine as long as you feel a little bad about it later.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "notagoodsniper",
                            "body": "Obviously you’re not a true Christian",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "mokomi",
                            "body": "I can only speak from my family. \n\nIt's frowned upon when you do it, but when my family does it.  It's for good reasons.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "escapefromelba",
                    "body": "Hell they don't even have equality among different Christian denominations.  ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gazebo-fan",
                    "body": "DeSantis said this himself lmao",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Moist_When_It_Counts",
                    "body": "Yep. That’s why they’re not calling it religious education. No no, Bible is required in Oklahoma schools because it’s a “pillar of Western civilization and literature and thought”. \n\nThis rather conveniently excludes ToS, islam, etc.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RoamingDrunk",
            "body": "Churches are free. You want religious instruction, do it on your own time. Not somewhere my tax dollars pay for your kids to learn math.",
            "score": 1,
            "replies": [
                {
                    "author": "Logical_Parameters",
                    "body": "That's the part that irks me the most. The religious aren't content to pay for or crowdfund their faith-based educations, no, they want it subsidized by the rest of us from our incomes. *Who asked us for permission?? Nobody.*",
                    "score": 1,
                    "replies": [
                        {
                            "author": "illegible",
                            "body": "Stop oppressing us! /s",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyDyingRequest",
                    "body": "Arizona currently uses tax dollars to pay for private and religious tuition via “school choice” vouchers. It’s out of control",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zsreport",
            "body": "A bit from the article:\n\n> \n> The Satanic Temple is increasing its work in schools across the country, trying to combat a rise in religious teachings.  \n> \n> The group, launched in 2013 to battle the “intrusion of Christian values on American politics,” recently began a religious release program in an Ohio school district and plans to expand to a district in Tennessee soon.\n> \n> . . . \n> \n> “Our goal is never to aggressively grow our programs. Our goal is to just be there as an alternative for the people that want us there,” she said, adding the group does not go into schools without a Christian presence.\n> \n> And the number of such schools is rising.\n> \n> In Oklahoma, schools have been ordered to place a Bible in every classroom and to incorporate the Bible into lesson plans. That mandate has been challenged in the court system.\n> \n> In Texas last month, the State Board of Education voted to allow lessons about the Bible to be incorporated into public school curricula.\n> \n> And in Louisiana, in another move facing legal challenges, a law signed this year orders posters of the Ten Commandments to be hung in every public school classroom.\n> \n> “If they want to hang the Ten Commandments up and we have somebody who wants to push for the seven tenants to be hung up,” the The Satanic Temple would fight for that, Everett said.",
            "score": 1,
            "replies": [
                {
                    "author": "reddog323",
                    "body": "I grew up Catholic. Never in my life did I ever think I’d be up plotting the efforts of the satanic temple. \n\nMy guess is these guys are going to have a big fat target painted on their back, like the ACLU, EarthFirst, and anyone else who tries to interfere with the new administration. If they can’t do it legally, they’ll sic Elon on them.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "terrasig314",
            "body": "Christianity oversaturating everything in my childhood drove my friends and I permanently away from religion.",
            "score": 1,
            "replies": [
                {
                    "author": "MoonOut_StarsInvite",
                    "body": "Ding ding ding! None of my friends I went to catholic school with are catholic anymore.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LaMelgoatBall",
                            "body": "My grandparents were both raised by Catholic families and stopped as soon as they were old enough to leave home. They said it felt like a cult and it just wasn’t based in reality. Glad I was never raised on religion",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "joshbudde",
                                    "body": "My grandmother was raised by a very Catholic mother in the early 20th century in rural Michigan. She wouldn't have anything to do with the church after the church had nothing to say after her mom eventually died after many beatings by her father and a long sickness. She's in her 90s now and still as fiery as ever and will tell you about how much the church is worth at the slightest provocation. The church was happy to take her tithes and effort but neither the church nor the churchgoers had anything to contribute when her mother needed them the most.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Upset_Anteater_3611",
            "body": "Satanic Temple schools? Sign me up!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_Locke",
            "body": "Hail Satan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LunaMagicc",
            "body": "Religion in schools is a dumb idea.\n\nThere should be separation  between any public school/ even goverment and religion groups.\n\nMany countries in Eu done that and there is no problems.",
            "score": 1,
            "replies": [
                {
                    "author": "Interesting-End6344",
                    "body": "That used to be the norm in the US as well, however extreme christian groups like evangelical churches have been pushing the idea that the US was founded as a christian nation (it wasn't) and that *their* religion should be mandatory study in schools because some schools used to have children read from bibles, but all that came to an end in 1962 with the case *Engel v. Vitale* being argued before the Supreme Court, which argued that children having to say some sort of nondenominational prayer right after the Pledge of Allegience was a violation of the Establishment Clause of the Constitution.\n\nLately, churches have been pushing for states to ignore this ruling, hence the situation we're in now.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "currentmadman",
                            "body": "And it’s going to end the same way it did the first time, except even bloodier. People forget it wasn’t just atheists that didn’t like school prayer, a lot of Christians fucking hated it too. \n\nTurns out non denominational isn’t really a thing when it comes to mandatory state sponsored religious propaganda. Who could have guessed that different Christian churches are largely incompatible with each other? Other than anyone with a basic understanding of history, I mean.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "SniffUmaMuffins",
                    "body": "Adding source: https://thesatanictemple.com/blogs/the-satanic-temple-tenets/there-are-seven-fundamental-tenets\n\nThey are 100% the good guys, they’re fighting against religious fascism.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Patteyeson28",
                            "body": "Thank you for adding the source!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KingOfBerders",
                    "body": "Better than ANY of the 10 commandments",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "helenarriaza",
            "body": "I do have to say I love the masterful trolling from the satanic temple, it's just \\*chef's kiss\\*",
            "score": 1,
            "replies": []
        },
        {
            "author": "R1CHARDCRANIUM",
            "body": "Feeding America (Kansas chapter), The ACLU, and the Satanic Temple are the only organizations I donate to on a regular basis. Food security and freedom for and from religion are fundamental human rights.\n\nIf Church wants to be involved in public education and politics, pay your fucking taxes.",
            "score": 1,
            "replies": [
                {
                    "author": "Lucifugous_Rex",
                    "body": "Omg this!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "aluminumdisc",
            "body": "The satanic temple has read the establishment clause",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oldfolksboogie",
            "body": "Love it. \n\nI can't recommend their [documentary](https://youtu.be/z_i6hRw4zR8?si=9jPGlgrxL0Sq_f-C) strongly enough.  Talk about making good trouble, they're awesome!\n\n*We're supposed to be a nation that doesn't allow the government to dictate what is appropriate religious expression.*\n\nEdit: it's free, with commercial interruption, on Tubi",
            "score": 1,
            "replies": [
                {
                    "author": "Not_High_Maintenance",
                    "body": "I’m going to watch it tonight. Thanks for the info!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Oldfolksboogie",
                            "body": "Love to get your feedback. \n\nI watched it in a theater when it first came out, and have been recommending it ever since. \n\nENJOY!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Distinct-Classic8302",
            "body": "Good",
            "score": 1,
            "replies": []
        },
        {
            "author": "Styx_Renegade",
            "body": "If we’re gonna stupidly have religion in school, allow all religions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Quackening",
            "body": "I bet the satanic temple would actually run a pretty decent school.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deJuice_sc",
            "body": "Christianity is just another ugly MAGA tool being used to program hate and sew division in America's children... here's an idea, keep religious ideologies out of schools.",
            "score": 1,
            "replies": []
        },
        {
            "author": "certifiedkavorkian",
            "body": "The only way for Christianity to be taught in schools in perpetuity is for the Supreme Court to rule it legal for all religions to be taught in school and then over time figure out ways to suppress and persecute all other religions - perhaps violently if necessary. \n\nAnd please don’t think it’s beyond the realm of possibility for the current Supreme Court to figure out a way to abandon the separation of church and state. If they are willing to turn the presidency into a monarchy then they’re prepared to do just about anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lokisHelFenrir",
            "body": "Time to grow the greatest religion there ever was, Pastafarianism.",
            "score": 1,
            "replies": [
                {
                    "author": "mexicandiaper",
                    "body": "may his noodly appendages keep you warm this winter. :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thatdood87",
            "body": "My daughters elementary school has started a Bible after school program, I couldn't believe it when I seen it. I didn't sign her up but her mom didn't think it was a big deal. I told her if she wants to go to Bible school there is a place for that. Sunday morning at CHURCH.",
            "score": 1,
            "replies": [
                {
                    "author": "WJack37",
                    "body": "At least if it is an after school program, it is not mandatory - it still allows kids to have that opportunity to explore faith within the comfort of their surrounding environment, but does not enforce that relationship potentially against their wishes and (in the event that they do actively pursue faith) they have another local network they can grow with.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "randomcanyon",
                    "body": "When back in the antediluvian age when I was in grade school, on Saturday morning, the nuns appeared from somewhere and taught us Roman Catholic instruction at the same public school I attended.\n\nI suppose there was some kind of rent involved and we had a lot of R.C. Children.  Not much controversy at the time.\n\nMorning \"Lord's Prayer\" was also allowed in the secular school  1957 New England. Not after",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mexicandiaper",
            "body": "I could have used a Buddhist education program or anything that encouraged relaxation and quiet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lastburn138",
            "body": "This is why I donate to TST. Keep YOUR religion out of OUR government!",
            "score": 1,
            "replies": []
        },
        {
            "author": "an-interest-of-mine",
            "body": "I want nothing to do with religion or anyone who purports to be religious in any way.\n\nIf your only claim to morality is the teachings your imaginary sky daddy (that you mostly ignore anyway), you’re just a shit person I’m better off not knowing. \n\nAll religion should be abolished. Period. It is one of the most depraved and violent concepts ever conceived.",
            "score": 1,
            "replies": [
                {
                    "author": "WJack37",
                    "body": "Your problem is with people who weaponise their faith, not faith itself. I assure you, but know I will likely fail to convince you, not all people who believe in God are like this. Perhaps, at the very least, just hear me out on these few small comments. \n\nPersonally, the impression I get is that people who bind their religion and politics the way it has been seen to happen in America very often neglect some of the most fundamental aspects of the faith, including to love one another and that ultimately (at least on my understanding) it is not up for us to judge one another, because it is not our place. \n\nPutting one’s faith in an idol, as opposed to God, is also literally one of the very first of the Ten Commandments - that seems to have been completely forgotten about by this crowd who claim to staunchly defend faith and rally behind their politics. \n\nFinally, ultimately, whether an individual chooses to pursue faith is their call - that’s why God leaves it to us to chase him, rather than forcing people into a relationship with Him. To enforce people into a relationship in the education system with Him undermines the entire premise of religion; a synonym for “faith” is “trust”, and the way I see it this is not an instance where individuals learn to develop a genuine trust in God. I also think the interaction between politics and religion is problematic in and of itself, but I’ll leave this comment at that. Hopefully I’ve at least given you a few things to mull over and, if not, all the best.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Don-Pickles",
            "body": "Religious influence in politics got us this in Alberta Canada:\n\n[pro-child abuse group applauds Alberta’s new opt-in sex education mandate](https://www.reddit.com/r/medicinehat/comments/1harliq/child_abuse_groups_react_to_albertas_bill_27/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)",
            "score": 1,
            "replies": []
        },
        {
            "author": "3rn3stb0rg9",
            "body": "The prospect of Satan in schools will lend some much needed checks and balances against Christian extremism",
            "score": 1,
            "replies": [
                {
                    "author": "DogEatChiliDog",
                    "body": "Or it will just leave the people abusing their power now to abusing their power in ways that get rid of the Satanists",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Styx_Renegade",
                    "body": "Satanic Temple isn’t about Satanism",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EeryRain1",
                            "body": "We know that, but most Christians I’ve met do not seem to understand that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "R1CHARDCRANIUM",
                    "body": "They are doing [Gods work](https://www.thepitchkc.com/high-school-satan-club-launches-at-olathe-northwest-high-school/) around here",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zelpst",
                    "body": "Except under MAGA rule they just won’t allow the Satanic Temple a foot in the door while allowing Christian groups in. The guardrails are gone people. They’re just words on paper subject to the collective whims of those in power. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "danielfrances",
            "body": "I grew up Catholic. I've spent years around family and others who feel strongly about their faith. I'm happy for them if it gives them meaning and makes them happy, but I will never understand this constant push to force their beliefs everywhere. I hated it when it was all about \"intelligent design\", and I hate it even more now that they are just straight up trying to force it into public schools.\n\nBelieve whatever you want at whatever church you want, that is your right. But it becomes a major problem the second any religious group thinks they can force it on others, especially if it involves meddling with the public education of young people. If you want to brainwash people, you got plenty of kids at private schools to try that on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Another_Road",
            "body": "\nSatanic Temple education programs sound awesome. I’m all for it. You just know they’ll be going all in to show up the religious people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mn25dNx77B",
            "body": "That would be funny if Christianity said fuck it we'd rather have church in the schools and we'll just put up with it. And the satanic temple got really big and was no longer a joke organization and had millions of members and were out there feeding the homeless and shit lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "burn_it_all-down",
            "body": "Ha! I bet you’re basing that comment on the rule of law. You should stop doing that before you are forced to stop. Laws are a thing of our past now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SchoolIguana",
            "body": "*Lemon v Kurtzman*  was presented to the US Supreme Court in 1971 and asked the question: Do statutes that provide state funding for non-public, non-secular schools violate the Establishment Clause of the First Amendment?\n\nTo settle *Lemon v Kurtzman* the justices under Chief Burger created a three prong “test.” For a law to be considered constitutional under the Establishment Clause of the First Amendment, the law must\n\n(1) have a legitimate secular purpose\n\n(2) not have the primary effect of either advancing or inhibiting religion, and \n\n(3) not result in an excessive entanglement of government and religion. \n\nIf any prong is violated, the law is unconstitutional. \n\n*Lemon* was ultimately decided for the plaintiffs, as the government funding and the necessary financial and curriculum oversight of these religious institutions would result in “excessive entanglement” with religion. \n\n________________________\n\nIn 1980, Kentucky imposed a statute that required the posting of a copy of the Ten Commandments, purchased with private contributions, on the wall of each public classroom in the State. Under Burger’s court, the 5-4 majority ruled this unconstitutional. \n\nThe majority opinion is resolute: “This is not a case in which the Ten Commandments are integrated into the school curriculum, where the Bible may constitutionally be used in an appropriate study of history, civilization, ethics, comparative religion, or the like. Posting of religious texts on the wall serves no such educational function. If the posted copies of the Ten Commandments are to have any effect at all, it will be to induce the schoolchildren to read, meditate upon, perhaps to venerate and obey, the Commandments. However desirable this might be as a matter of private devotion, it is not a permissible state objective under the Establishment Clause of the Constitution.”\n\nIn 2018, *The American Legion v. American Humanist Association* was presented before the Roberts Court. The case involved the display and maintenance of a large cross on public land (a cemetery) in Maryland. In a 7-2 decision under Roberts, the court determined the Bladensburg Cross does not violate the Establishment clause. The majority opinion, written by Alito, states that although the cross originated as a Christian symbol, it has also taken on a secular meaning. The court further stated that when the *Lemon Test* is applied to religious symbols or monuments, the presumption should be that they are constitutional. The cross and other religious symbols and monuments therefore can be permitted if they serve a secular purpose through their historical importance beyond their admitted Christian origins. This was a new approach to evaluating establishment clause violations and is the start of our trouble. \n\nIn 2021 during the 87th Legislature, Texas passed SB 797, requiring public schools to display donated signs stating “In God We Trust.” The bill (written by the same senator that crafted Texas’s abortion bounty bill- SB8) is careful to point out the historical significance of the phrase, echoing language used in the *American Leigion* opinion.\n\nThe precedents the courts had previously used to evaluate violations of the Establishment clause  were crumbling and then a football coach in Washington knelt in prayer and subsequently brought it to its knees. \n\nSetting aside the fact that *Kennedy* appeared to be decided on a murky (or possibly disingenuous) understanding of the fact pattern, the 6-3 court majority took inspiration from *American Leigion* and determined whether  government action violated the establishment clause “by reference to historical practices and understandings.”\n\nIt is worth noting that Gorsuch was careful to soften the impact of *Kennedy* in his majority opinion- it did not use the words “overturn” or “overrule.” Instead, the use of  historical practices and understandings as the standard was specified to be “in place of Lemon and the endorsement test.” This word-choice surely reflects the influence of Chief Justice Roberts, who joined the majority as he prefers to overturn precedent without saying so too directly. \n\nAll that to say this-\n\nThese school prayer/10 Commandment/chaplain/religious curriculum advocacy aims to cement that “historical significance” precedent, opening the door for the conservative majority court to allow any and all kind of religious iconography, provided it has a historical practice and significance. \n\nOf course, other minority religions that are practiced but do not enjoy a “historical significance” in American culture will not be given this same treatment. There is only one religion that will be given preferential regard for inclusion in public buildings and forums. \n\nThe Satanic Temple is renowned for challenging laws that violate the free expression and  establishment clauses by requiring equal treatment under the law, but the “historical significance” approach will prevent them from being granted the same leeway. **As there is no “historical significance or understanding” of any other religion in the US to the same extent that Christianity experienced, this approach singles out Christianity as the only religion being permitted.**",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gokdencircle",
            "body": "TST tenets show relatiegeschenken rationality and common sense.",
            "score": 1,
            "replies": []
        },
        {
            "author": "arthuriurilli",
            "body": "Good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "overbarking",
            "body": "Hah. I hope they do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sparemethebull",
            "body": "Finally, religion in schools!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "VGAPixel",
            "body": "I figure I can create some stupid religion now too! Its just fan fiction of how reality works. Make some stupid shit up and convince a bunch of people its true. Next thing you know, messiah. It sure would be a problem if people came up with some kind of system to disprove the bullshit I will be spewing. Lets make sure what nonsense I come up with is taught to children.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tennismadman",
            "body": "Keep that garbage out of public schools just like the founders intended.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dark_descendant",
            "body": "I, for one, welcome our new Satanic Temple overlords. /s\n\n  \nBut seriously, no religion in schools, period.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UncleGrover666",
            "body": "Let’s invite the devil into our pubic schools!",
            "score": 1,
            "replies": [
                {
                    "author": "RgKTiamat",
                    "body": "That's not who this is, but also that is an equally protected religious establishment, so even if they did, they are still protected",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IUsedToBeACave",
                    "body": "They are already inviting the Abrahamic god who is a known child murderer. Maybe worry about that instead of the devil...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TigerITdriver11",
                    "body": "All the Devil does is punish those God deems \"wicked\". Why don't we just keep God out of pub(l)ic schools?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lucifugous_Rex",
                    "body": "Hail satan, hail thyself.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SilentSidhe30",
            "body": "Feels like a slippery slope in the classroom debate",
            "score": 1,
            "replies": []
        }
    ]
}