{
    "title": "The Onion's purchase of Alex Jones's Infowars rejected by judge",
    "author": "maxxspeed57",
    "subreddit": "politics",
    "rank": 4,
    "score": 937,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 216,
    "url": "https://www.bbc.com/news/articles/c20w1qnewjjo",
    "id": "1hbsuhp",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TabbyTuxedo06",
            "body": "When the onion got it, I was so happy. Apparently the families even chose the onion. Where does this judge get off?",
            "score": 1,
            "replies": [
                {
                    "author": "SimTheWorld",
                    "body": "The “Justice” system is now only defending institutions with the most influence. Citizens voted their voice away.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "maxxspeed57",
                            "body": "Dollars are all that matter any more and whoever has more gets a louder megaphone.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Knightwing1047",
                                    "body": "Doesn't hurt that he has connections to Trump and the MAGAts",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "dew7950",
                                            "body": "That’s what we are saying. Trump has always been for the rich.  Both cabinets chock full of millionaires and billionaires.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "cheezeyballz",
                                    "body": "WE outnumber them greatly.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WhoStoleMyBicycle",
                                            "body": "They’ve done a masterful job of dividing us. We SHOULD outnumber them, but we’re split into two different factions when we should all realize we have way more in common with each other than we do them.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SimplyRocketSurgery",
                                                    "body": "To a point. I have nothing in common with a klansman or a nazi. They don't deserve a voice in the revolution.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Agile_District_8794",
                                                            "body": "They'll be the loudest, though...",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SimplyRocketSurgery",
                                                                    "body": "And that's when you beat them physically. \n\n\"Violence, naked force, has settled more issues than has any other factor.\" -Heinlein, Starship Troopers",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sanebyday",
                                                                            "body": "Would you like to know more?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "thandrend",
                                                                            "body": "I am a history teacher and I do say, regularly, that violence can solve problems.  It shouldn't be the first choice, but if the reason of men can't be appealed to, maybe the violent side is the only one that'll work.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SimplyRocketSurgery",
                                                                                    "body": "Nonviolence lead to decades of oppression in India. Pacifists tend to die for their beliefs.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "thandrend",
                                                                                            "body": "Absolutely.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "cwk415",
                                                                            "body": "You do know the \"starship troopers\" are based on Nazis right?\n\nGoogle AI overview:\n>Starship Troopers is a satirical film that criticizes fascism and authoritarianism. The film's director, Paul Verhoeven, intended the film to be ironic and to mock fascism.\n\n>Verhoeven wanted to show how easy it is to be manipulated by fascism. He also wanted to criticize the military industrial complex, US foreign policy, and the film's society, which values violence over sensitivity",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SimplyRocketSurgery",
                                                                                    "body": "I do. But it doesn't make the statement any less true.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Richfor3",
                                                    "body": "Yeah I get what you're saying but I'll pass.  As I am not a rapist, pedophile, racist, bigot, or traitor,  I have no common ground with tRump supporters and have no interest in uniting with those types of people regardless of the issue.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "jardex22",
                                                    "body": "We should be fighting *up*, not across.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Richfor3",
                                                            "body": "But I'm not really fighting across.  I'm fighting up and down.  My own socio-economic group largely has the same values and votes the way I do.  It's the working class and extremely wealthy that are on the other side.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Antonio1025",
                                                    "body": "But but but we voted for them so they obviously have a personal relationship with everyone that votes for them! /s",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Solidsnake00901",
                                                    "body": "Too many Americans are worried about dumb shit that barely affects their lives",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Lucky-Earther",
                                                    "body": "> They’ve done a masterful job of dividing us. We SHOULD outnumber them, but we’re split into two different factions when we should all realize we have way more in common with each other than we do them.\n\nIt's kind of wild that the murder of an Insurance CEO has been one of the more unifying events I have seen.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "USNCCitizen",
                                            "body": "But our dollars don’t.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "terrasig314",
                                            "body": "Okay, do something.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "johnsciarrino",
                                                    "body": "That’s exactly why Luigi is a folk hero right now. Seems like it’s only a matter of time before others step up. \n\nSpeaking of; what ever happened to Anonymous? Seems like it’s time for those guys to shine.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "rbarbour",
                                                            "body": "Anonymous was single handedly moving the overton window to the left. I kind of miss that. I assume what they were doing either no longer became profitable or wasn't sustainable long-term.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "jagaloonz",
                                                            "body": "It's so fucking phony.\n\nEveryone's excited because a dude killed a billionaire CEO they'd never even heard of, but then also elected a billionaire CEO that we ALL KNOW is guilty of really heinous shit, but that makes sense, right? And now the richest man in the world is palling along with the President because, those billionaires are good, right? But the dude who's name I can't remember, and was replaced instantly with someone who doubled down on what UHC does, is dead, so we good, fam.\n\nRings real fucking hollow.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "abritinthebay",
                                                            "body": "They were only ever a bunch of cowardly 4Chan users, mostly posturing & creating fan fiction about how scary they wanted to look.\n\nThey also were not organized, or even particularly skilled. Don’t expect anything from that lot.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "bloody_ell",
                                                            "body": "1 of the main people got caught and shopped quite a few others, the ones left were the posers and posturers.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SkollFenrirson",
                                            "body": "And yet....",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lastburn138",
                                    "body": "It's all that ever mattered in the first place.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kgwalter",
                            "body": "When the courts rule money equals speech we all lost a say because some people have billions of speech and most people have no speech leftover after their bills. Also since the courts ruled corporations are people they became people with a legal obligation to maximize profits and a hole fuck ton of speech.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ALargePianist",
                            "body": "but they get to say they are a part of something bigger than themselves \\~\\*\\~\\*\\~",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "brightblueson",
                            "body": "Please, it's always been this way.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "lastburn138",
                            "body": "The United States of Popularity Contests.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SeeMarkFly",
                            "body": "People getting shot at get no justice...until yesterday.\n\nSomething has changed.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "thedudedylan",
                            "body": "Yeah, people don't realize that the war was lost 30 years ago when we decided labor was not as important as shareholders, and now they hold all the cards and every seat of power. \n\nHell, we just voted in a billionaire with a cabinet full of billionaires to fix the system that made them billionaires. We deserve everything that is happening to us.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wrath_Ascending",
                    "body": "Elon Musk heard about it and now wants to buy it so he can gift it back to Alex Jones.\n\nJudge is pro-Trump.\n\nThis lets him shut down progressives and signal to Trump simultaneously.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "noble_peace_prize",
                            "body": "I don’t even know why it’s a right left thing. Alex harmed these families. He owes them money. This is his asset he can use to pay them. \n\nThe fundamental concept of justice is broken here. They are not trying to make the family whole.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Wrath_Ascending",
                                    "body": "Because the Onion planned to use the site to advocate for gun control measures. It's not just the money going to the Sandy Hook families now or in revenue sharing; that's a big part of why they favoured that bid.\n\nThis has enraged the right, large segments of which believes Sandy Hook was a false flag operation and all of which opposes gun control.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "noble_peace_prize",
                                            "body": "It’s an asset he should no longer possess because he owes people money. I don’t get to quibble about what my creditors do if I lose my house. \n\nMake the victims whole. The court has failed to do that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Wrath_Ascending",
                                                    "body": "Yeah, but now the judge can shut down the effort to promote gun control and allow Elon to gift the site back to Alex Jones, which is what MAGA and Musk want, all while using the money as a fig leaf to justify re-running the auction.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GaryBuseyWithRabies",
                                    "body": "The judiciary is broken because they are put in by politicians that were bought by companies.\n\nIf this country has any hope, it's from a clean slate.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kingtz",
                            "body": "This act is the judge’s Supreme Court application ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "doctorlongghost",
                            "body": "Even if that happens, the family (presumably) benefits from a higher sales price. \n\nFrom a legal standpoint it makes sense since the judge’s role as trustee is to ensure the most value from the assets possible. So even if Musk ends up buying it and gifting it back, the families would benefit from getting a larger portion of the judgment. \n\nFurther, I don’t think it could be gifted back outright since the judgment is presumably not entirely satisfied by the sale and additional amounts are still outstanding. So it would just be seized again. \n\nWhile the families wishes on letting the sale go through would ideally count for something, I don’t think it matters legally since the judge is tasked to maximize the value of assets for the benefit of BOTH parties. And if they felt it was undervalued, it was the right thing to do from that standpoint. \n\nSo as long as it doesn’t subsequently sell for less, the judge at least wasn’t completely and totally mistaken in wanting a second auction.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AnotherSlowMoon",
                                    "body": "> Even if that happens, the family (presumably) benefits from a higher sales price. \n\nI imagine that for these families its also priceless for the Onion to use the brand to argue for gun control.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kc_______",
                            "body": "America for the next 4 years (if lucky, possibly a few decades in reality).",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Aliensinmypants",
                            "body": "Source for anything you're saying? Not mentioned in the article at all",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Wrath_Ascending",
                                    "body": "\"I haven't followed this case at all, I just wanna name-call.\"\n\nPlease. If you're actually interested, this stuff is tragically easy to find as it's been reported on multiple times.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Aliensinmypants",
                                            "body": "I didn't call you any names first off. I just asked for more information and that the article posted the judge claims the bankruptcy auction judge made a good faith error and you came in with a bunch of claims that weren't mentioned. \n\nBut sure, try to attack anyone trying to learn more or asks for sources, that isn't similar to what Alex Jones did at all",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "7ddlysuns",
                    "body": "Elon be bribin",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OrangeVoxel",
                    "body": "Destroying liberal news sources is one of the major goals of project 2025, GOP, heritage foundation, and AIPAC. \n\nTwitter and CNN were bought. Reddit now privatized. They’re doing everything they can to control the media.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "romanticynicist",
                            "body": "Reddit is very much not privatized. You can buy stock in Reddit as of March.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ickyflow",
                            "body": "You forgot Tiktok being banned, which is a lot of people's way to learn things unfortunately but also an easy way for people to group up",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "the_trump",
                                    "body": "I mean that was signed into law by Biden and the ban is just on Chine owning it. People should be concerned about all their data being harvested by a foreign government… it should only be done by our own…",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "platinumarks",
                    "body": "Bankruptcy trustees are supposed to accept the highest bid that provides the largest monetary gain to all creditors. There was a substantially-higher bid that was rejected for unclear reasons, and that's what the judge decided was the problem. Unfortunately, bankruptcy law basically required him to come to this decision, especially since it was questionable whether any money even changed hands with The Onion's purchase or whether it was all on paper.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Omnio89",
                            "body": "The reason I heard the families rejected the larger offer was because it was just a collection of Alex Jones’s friends who intended to give the company back to Alex and the family cared less about money than not allowing him to have Infowars back.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "The_Countess",
                                    "body": "It's slightly more complicated then that, though what you said is absolutely true for one set of families\n\nBut there are 2 sets of families, one set that's been awarded over a billion dollars, and another set that got a far smaller number.\n\nSo of any accepted bid, only a very small portion would go the second set.\n\nThe winning bid was the one put up by the onion with the support of the families that got a billion awarded where they gave the other familie a far larger share of the money then they would have gotten from the larger bid.\n\nSo yes there was a larger offer, but the payout for the second set of families was far bigger with the smaller offer, which is why that was accepted.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Arzalis",
                            "body": "It was rejected because the families (who own the largest debt iirc) offered a better deal that wasn't just straight cash, but gave the best benefit, all things included.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DJKGinHD",
                            "body": "[Legal Eagle has a video](https://youtu.be/GmDNz7irGgw) on why TheOnion's deal was a better deal for the families. It was all laid out to the judge. The judge had alterior motives.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Curiel",
                            "body": "Didn't the onion offer some type of % from continuous revenue?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BMEngie",
                            "body": "“Substantially higher” in terms of cash. What’s not mentioned is the accepted offer reduced the total debt owed by Alex by more than what the “cash” would have, since significant portions of the bid were the literal debt Alex owed to the largest creditors. \n\nAlso that isn’t why the judge ruled the way he did. He seems to think Infowars is worth significantly more than what _either_ of the blind bids offered, and thinks that a non-blind auction would have ended up with a higher purchase price. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Recipe_Freak",
                                    "body": ">Also that isn’t why the judge ruled the way he did. He seems to think Infowars is worth significantly more than what *either* of the blind bids offered, and thinks that a non-blind auction would have ended up with a higher purchase price.\n\nWho *cares*?! It's an auction. and InfoWars was auctioned, dammit.\n\nI can't wait to live in the American version of Russia.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "PopuluxePete",
                                    "body": "Yes and...he doesn't want another auction.  He just wants the custodian to figure it out.  Basically saying \"not like this\" and \"let's wrap this up to my satisfaction\".  As much as everyone was waffling on Lopez being stupid vs. corrupt, I think stupid is basically out the window at this point.  Jones shopped around for this judge, it's Texas, and the Onion was going to turn infowars into a gun control platform.  \n\nI'm not sure where a federally appointed bankruptcy court judge thinks their career goes after this, but Judge Lopez is clearly looking out for #1.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "arthurdentxxxxii",
                            "body": "The higher bid was just Elon Musk coming in to save Infowars.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "InfamousUnderpants",
                            "body": "Well, that's nonsense. \n\n\"The trustee, Christopher Murray, chose The Onion, saying its proposal was better for creditors because they would receive more money. The Onion valued the bid, with the Sandy Hook families’ offer, at $7 million, because that amount was equal to a purchase price that would provide the same amount of money to the other creditors.\n\nTanenbaum testified that he agreed with the $7 million valuation and believed The Onion’s bid conformed to the auction rules.\n\nA lawyer for Jones, Ben Broocks, asked Tanenbaum how it was possible that the Sandy Hook families’ offer boosted The Onion’s offer to such a high amount.\n\n“It means the purchase price value has gone up because another purchase price would have to be higher than that value in order to provide the same net benefit to that group of creditors,” Tanenbaum said\"\n\nThere is a deal in place between The Onion and the Sandy Hook families that increases the amount of money the creditors receive. The lawsuit is just a bunch of rightwing grifters crying because they can't get their own way and have to answer for their behaviour.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MetaPhysicalMarzipan",
                            "body": "The reason the trustee is able to take the Onion bid, is because the families were willing to reduce and rearrange the values of their awarded amounts. By doing this the trustee has valid reasoning to say by choosing the Onion bid the creditors are “more likely” to be made whole.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "FennelFern",
                            "body": "> There was a substantially-higher bid that was rejected for unclear reasons\n\nIt was not unclear. It was _complex_ but the families who owned 80% of the debt of Alex Jones said they would give the Texas families more money than other creditors, to offset the lower total payout.\n\nThe end result is that the large debt holders made less money, but _every other creditor_ made substantially more, thus resulting in more equitable payout. This deal was only extended to The Onion, but it's within the rights of the main debt holder to do this.\n\nThe other entity bidding on Jones company was made aware of this, and did not counter. \n\nAll of this was clearly communicated to all parties at every step.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Set_the_Mighty",
                    "body": "Remember, it's now a tip not a bribe when you pay a judge for a desirable outcome.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ChiquitaBananaKush",
                    "body": "Vacations provided by the rich *obviously*",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "milkgoddaidan",
                    "body": "I think the idea is that the bidding process was closed earlier than it should have been.\n\nThe auctioneer preemptively asked for a final offer from the Onion when the other company involved (not infowars) should have had an opportunity to respond with another bid",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Special_Sea_4813",
                    "body": "On a picture of Donald J. Trump. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "afoley947",
                    "body": "Probably in his chambers",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "overbarking",
                    "body": "Because it's the Fifth Circuit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jabdnuit",
                    "body": "The intent was for the sale of Infowars to raise as much money as possible to compensate the families Alex defamed. Highest monetary bidder wins. \n\nInstead, the Onion ‘won’ the ‘auction’ as part of a negotiated deal, that resulted in significantly less money going to the families. \n\nInfowars should be liquidated, but the judge made the right call on this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fettpett1",
                    "body": "It was rejected because it was completely illegal \"bid\". The bidding was supposed to be open and interactive for those who were approved (there's a whole process where the Gov looks at the books to make sure that they can afford the bidding process). At the last minute the bidding was changed to a closed bid with only ONE submission by like 3 different groups and the person in charge of the auction choosing whichever bid they wanted to. The Onion wasn't even the highest bidder. \n\nThe judge \"gets off\" by following the LAW.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lucky-Earther",
                            "body": "> It was rejected because it was completely illegal \"bid\". \n\nNo, that wasn't the reason for the rejection.  The reason is within the first three paragraphs of the article here if you care to read it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "i4ndy",
                            "body": "Are you a writer for the onion?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SatiricLoki",
            "body": "So the judge stopped the sale because Jones’ magic pill company didn’t get enough of a chance to bid on it again? JFC.",
            "score": 1,
            "replies": [
                {
                    "author": "Foreign_Muffin_3566",
                    "body": "That might be the official story but the real reason is Elon Musk wants to buy it. He is going to buy info wars and keep Alex Jones on and give him a huge permanent platform on x",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Just_Campaign_9833",
                            "body": "I'd hate to see what Alex Jones is like when he knows he can't be touched and can say whatever he wants...",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "armeliman",
                                    "body": "Then he needs to be touched another way.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Foreign_Muffin_3566",
                                            "body": "I think we would benefit from Musk also being touched",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "project48v",
                                            "body": "You mean like a certain healthcare CEO?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JyuVioleGrace95",
                            "body": "I thought that Elon hated Jones",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ai2Foom",
                                    "body": "You are wrong, apartheid Leon loves Alex jones and the two have been licking each others assholes for the better part of 2 years now  \n\nElon is a full blown Nazi, of course jones is an asset he will utilize to misinform the public with Alex’s 24/7/365 nonstop lies and manipulations",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Moist-Tangerine-7888",
                                    "body": "It’s all a big love fest on the far right.   \n\n\n Trump, The Uniter, is able to bring evil people from all walks of life together in their quest for wealth and adulation. ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Flipnotics_",
                                    "body": "Money wins",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "cheezeyballz",
                                            "body": "we outnumber them. 🤷",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fieldsofgreen",
                            "body": "I thought I couldn’t hate Elon any more than I already do, but here we fucking are again.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Global_Ant_9380",
                                    "body": "He spends so much money to be liked",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Global_Ant_9380",
                            "body": "I want to believe that Luigi was wrong and that violence truly isn't the answer",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "xwsrx",
            "body": "Mustn't have the grifter class held accountable by its victims.",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JediDroid",
                                    "body": "That’s if Luigi did it. \n\nVoluntary false confessions occur for several reasons. One reason is a “morbid desire for notoriety,” that is, a pathological need to become infamous and to enhance self-esteem, even if it entails the prospect of imprisonment. \n\n(Sourced from False Confessions\nMichael McGrath, in\nForensic Victimology (Second Edition)\n, 2014) https://www.sciencedirect.com/topics/psychology/false-confession#:~:text=Voluntary%20false%20confessions%20are%20given,confessions%20occur%20for%20several%20reasons.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "inquisitive_guy_0_1",
                                            "body": "I mean, has he even confessed? I thought he was pleading \"not guilty\"?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Equivalent-Piano-605",
                                                    "body": "He hasn’t, and there’s weird stuff on his YouTube channel about the truth setting him free set to post after he was arrested. I’m not saying it’s likely, but there’s a non-zero chance he’s intentionally attracting attention away from the actual shooter and he has a bullet proof alibi.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bubbasass",
                                    "body": "Calling on Mario and Waluigi",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "xwsrx",
                            "body": "Not sure what you mean. If Mangione says the massive amount of evidence stacked against him is a hoax, a witch hunt, fake news etc then presumably he's innocent, right?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TintedApostle",
            "body": "This is the first time I have ever seen this happen.",
            "score": 1,
            "replies": [
                {
                    "author": "TheForeverUnbanned",
                    "body": "Against the wishes of the families of the dead children the judge did this. \n\nWhat an absolute piece of scum sucking shit. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "2HDFloppyDisk",
                            "body": "Goes to show you can buy anything with money.... an attorney general, a judge, a federal judge, a supreme court, a president. The entire country is for sale to the highest bidder.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "kkeut",
                                    "body": "a luigi ain't for sale",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "_Nychthemeron",
                                            "body": "Gotta get us a Mario now",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LostAbstract",
                                    "body": "George Carlin is laughing in his grave right now. Probably has been since 2015.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mattjb",
                                            "body": "Carlin didn't laugh at the injustice and cruelty of politicians. He was disgusted by them and turned that disgust into a powerful vehicle that stands the test of time.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "deJuice_sc",
            "body": "Judge López's appointment was made by Fifth Circuit judges with connections to both the Federalist Society and Trump.  In today's America, that's just a little too convenient.",
            "score": 1,
            "replies": [
                {
                    "author": "stainedgreenberet",
                    "body": "There it is. I was waiting to read that he was appointed at the behest of trump cronies",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "patchgrabber",
                    "body": "That's partly why they went gangbusters to find this guy, pulling out all the stops and tech. They wanted the public to see that you'll be caught quickly if you do something like this.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "panopticon31",
                            "body": "Yeah they certainly don't put that much effort into searching for the killer of a innocent victim of a drive by shooting.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "quaalude_dispenser",
                            "body": "I can't wait for the day the public realizes that we outnumber them.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ALargePianist",
                    "body": "\"something something its a bad precedent\" - the elite class walking around the streets",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "likelywitch",
            "body": "The grift that keeps on grifting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "santaclaws_",
            "body": "In other words, the bidding will be re-opened so a conservative billionaire can buy it, pay off the families with literal chump change, and keep the site open as is.\n\nWant to bet this was done by a Trump judge?",
            "score": 1,
            "replies": [
                {
                    "author": "ResultsVary",
                    "body": "It was confirmed above that it was in fact a trump judge.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dtm182",
            "body": "> After a two-day hearing, Judge Christopher Lopez ruled that an auction for Infowars did not result in the best bids possible.\n\n> However, he rejected Jones’ claims that the auction was plagued by “collusion.”\n\n> …Judge Lopez said the court-appointed bankruptcy trustee who ran the auction made “a good-faith error”.\n\n> Instead of quickly asking for final offers in the auction they should have encouraged more bidding between The Onion and **_a company affiliated with Jones’ supplement-selling businesses_**, he said.\n\n> “This should have been opened back up, and it should have been opened back up for everybody,” Judge Lopez said.\n\nWHAT IN THE ABSOLUTE FUCK",
            "score": 1,
            "replies": []
        },
        {
            "author": "veggeble",
            "body": "I hope The Onion does crowdfunding to raise more money for the auction, kind of like how Cards Against Humanity has done in the past. I know I'd chip in.",
            "score": 1,
            "replies": [
                {
                    "author": "DomoOreoGato",
                    "body": "They should team up",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sugah560",
            "body": "Remember when Elon tweeted that “he could do the funniest thing ever” when it was announced infowars was going up for auction?\n\nNo, he legitimately stopped the funniest thing ever from happening. The funniest thing happened, and he said no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlueNoMatterWho69",
            "body": "Totally BS.  Denying something good under the disguise that not good enough.",
            "score": 1,
            "replies": []
        },
        {
            "author": "teddytwelvetoes",
            "body": "oh yeah, gotta protect the most purposefully awful people ever. whole country run by and for wealthy sociopaths",
            "score": 1,
            "replies": []
        },
        {
            "author": "MysteriousTrain",
            "body": "Looks like Judge Christopher Lopez was bought off by Elon Musk",
            "score": 1,
            "replies": [
                {
                    "author": "Mad_OW",
                    "body": "If this is Elon, why didn't he just outright bid for it.. seems like the offers are pretty low in comparison to his wealth.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BuckDoom",
            "body": "just a shameful decision, hope this judge rots",
            "score": 1,
            "replies": []
        },
        {
            "author": "BusGo_Screech26",
            "body": "Oh cool, the one silver lining I had to this shit-cloud of a year was the Onion buying InfoWars. But of course we can't have that. No we have to give Elmo and other right-wing shitasses an extra chance to scoop it up instead because that makes it *fair* somehow. Oh You thought something *good* or *enjoyable* would happen this year??  Hahaha! Noo, this is 2024! And happiness died in 2016, with Harambe! Haha so good! What a good time! I hate it here...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aware_Material_9985",
            "body": "Can’t have the misinformation mouthpieces losing their megaphones. Not with daddy orange coming back to make America regret again",
            "score": 1,
            "replies": []
        },
        {
            "author": "tomatoeberries",
            "body": "Pussies",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dontuselogic",
            "body": "Comrade Elon said no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "10centjimmy",
            "body": "What's to stop The Onion from making a $364 billion bid, that the victims' families then waive?",
            "score": 1,
            "replies": [
                {
                    "author": "andythetwig",
                    "body": "Because the families aren't the only creditors, there's the right wing shareholders who will fight the families tooth and nail on every letter in the agreement.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BMEngie",
                            "body": "Nearly all of those “debtors” are Alex Jones through various shell companies. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheBlindCat",
                    "body": "The lack of handing an envelope to the judge would be a barrier.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HamManBad",
                    "body": "It's not just for the families, it's for Jones' creditors",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shadrap",
            "body": "And the bad timeline re-imposes itself...",
            "score": 1,
            "replies": []
        },
        {
            "author": "aehsonairb",
            "body": "i thought this was a free market exchange? no?",
            "score": 1,
            "replies": []
        },
        {
            "author": "lazy_phoenix",
            "body": "The judge only cares about making sure Alex Jones' friends, like Roger Stone, can buy Infowars so that Alex Jones can stay on the air. The Onion didn't have the lowest bid, their bid was involved the lowest INITIAL money. The Onion offered the Sandy Hook families a percentage of the future revenues. Oversimplified for idiots: While Roger Stone bid $100 to buy Infowars, The Onion offered $75 AND 20% of future revenues.",
            "score": 1,
            "replies": [
                {
                    "author": "ArmadilloBandito",
                    "body": "For a little more understanding. There are two lawsuits involved. One is a single family that filed in Texas. The other is a group of families that filed in PA. The PA group was getting 97% of the buyout. They made the deal you mentioned with the onion in exchange that the Texas family got 25% of the buyout. The onions deal would have given the Texas family $100K more than the other offer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sneezeatsage",
            "body": "Are there ways to deal with judges like this?",
            "score": 1,
            "replies": [
                {
                    "author": "Didsterchap11",
                    "body": "Mario’s younger brother has provided one potential answer.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DCtheBREAKER",
                            "body": "I agree with Luigi more and more each day.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "glacierfanclub",
            "body": "Elon Musk is a sandy hook denier",
            "score": 1,
            "replies": []
        },
        {
            "author": "Apprehensive-Call568",
            "body": "How much money did elno spend for this to happen?",
            "score": 1,
            "replies": []
        },
        {
            "author": "adfuel",
            "body": "Musk wants to buy it and give it back to him .",
            "score": 1,
            "replies": []
        },
        {
            "author": "ManOnShire",
            "body": "I fucking hate this country. Someone check this judge's financial records.",
            "score": 1,
            "replies": []
        },
        {
            "author": "suprise_oklahomas",
            "body": "This country is a fucking joke",
            "score": 1,
            "replies": []
        },
        {
            "author": "Affectionate_Arm_245",
            "body": "A last fuck you to the families. Evil always wins. They don’t have to play by the rules and they don’t care about regulations.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baruch05",
            "body": "Dang it. I had a hunch this was gonna happen. What a joke.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeepSubmerge",
            "body": "Why is Musk allowed to meddle in our country’s affairs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "dwittherford69",
            "body": "Elon bought off the judge.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blue_Checkers",
            "body": "Where's Luigi when you need him?",
            "score": 1,
            "replies": []
        },
        {
            "author": "andr50",
            "body": "> Instead of quickly asking for final offers in the auction they should have encouraged more bidding between The Onion and a company affiliated with Jones' supplement-selling businesses, he said.\n\nWhat exactly is the legal standing here that was violated? \n\nLike are they required by law to ask \"Are you sure you don't want to bid again\" a certain amount of times before they are allowed to close the sale?",
            "score": 1,
            "replies": []
        },
        {
            "author": "proscriptus",
            "body": "The bid was rejected to, not the purchase. The Onion has to resubmit a better bid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TelescopiumHerscheli",
            "body": "It's pretty clear that the headline \"The Onion's purchase of Alex Jones's Infowars rejected by judge\" is somewhat misleading. In fact, the judge is not rejecting any potential purpose, he is simply saying that the bankruptcy trustee made a \"good-faith error\" in selling the Infowars website so quickly. The trustee should have run a longer auction process before the website was sold.\n\nThe bankruptcy trustee's error is understandable: they wanted to raise as much money from the liquidation of Jones' assets as possible, so sought a quick sale, likely on the ground that the value of a website declines quickly if it is not regularly updated. The bankruptcy judge took the view that more money could be raised from the sale of this particular asset if a longer auction was held; in effect, he took the view that by running a longer and broader auction a higher final sale price for the asset could be realised, with the gains from the higher sale price outweighing the declining value of the asset over the period of the auction.\n\nThis is a technical issue arising from the legal requirement typically imposed on liquidators to get the highest possible sale price for all of a bankrupt's assets. The judge is not rejecting the possibility of the Onion buying Infowars, he's just requiring that the government get the best possible cash outcome from Alex Jones' bankruptcy, as mandated by law.",
            "score": 1,
            "replies": [
                {
                    "author": "hookisacrankycrook",
                    "body": "He's opening the door for Elon to buy it after Twitter lawyers stepped in. Crazy that Elon had no interest until The Onion was able to win the auction. This is all shenanigans. the families will get screwed and Alex Jones will continue doing what he does all thanks to co president and rising oligarch Musk.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CowboyKarate13",
                            "body": "Depending on how far the the victims wish to take this, they can make sure that either The Onion gets it or Elon has to pay the entire 1.5 billion dollar judgement...\n\nThe families can offer \"debt offset\" of any value they choose as part of the offer to purchase (this is what they did with The Onion originally.)\n\nSo if they offer to offset the entire amount, less actual cash The Onion is putting up, it would require Musk to beat that offer. Not saying Musk can't afford it, but that's a lot of liquid that is very hard to come up with.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hookisacrankycrook",
                                    "body": "Elon added tens of billions to his wealth when Trump was elected. Plus he'll just tie it up in court and have a Trump judge overrule the whole thing and make it disappear. The families will never see a dime and Alex Jones will go right back to defaming them.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ThrowAwayGarbage82",
                                            "body": "This is exactly what'll happen. Tie up the whole thing and have a trump judge overturn it so jones can continue demonizing and endangering the families.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Zaphod392",
                                            "body": "Elon could have been Batman but he chose to be The Penguin instead....",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Stahlregen",
                                                    "body": "Nah, as despicable as he is even the penguin has some redeeming qualities.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Zaphod392",
                                                            "body": "Sorry, I didnt mean to demean The Penguin  :D",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "RevolutionNumber5",
                                                                    "body": "RIP Victor.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "CowboyKarate13",
                                            "body": "Not really how that works. There is nothing to \"tie up.\" If the victims wish to push they can force the sale to The Onion using debt reduction or force Elon to come up with 1.5 billion in liquid cash to beat the offer.\n\nThat's what it comes down too. There is no \"making this go away.\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "hookisacrankycrook",
                                                    "body": "When you have money and lawyers like Elon does the legal system works however you want it to work.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "2much2Jung",
                                                            "body": "Except when trying to get out of buying Twitter...",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "kkeut",
                                    "body": "rules don't really exist anymore. if they really want it to happen, they will find a way to make it happen",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Oliviaruth",
                            "body": "Maybe silver lining is the price will go higher?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TelescopiumHerscheli",
                            "body": "> He's opening the door for Elon to buy it\n\nQuite possibly. I doubt the judge has any specific political outcome in mind, though: it looks to me as if he's just doing his job, as he is required to do.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hookisacrankycrook",
                                    "body": "Given the families were happy with the original outcome there was really no reason to step in and stop the sale. This is all going to end with Alex Jones  back to what he's always done instead of facing any punishment at all and Elon laughing at America's systems of justice.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "phiwong",
                                            "body": "The receiver's duty is prescribed by law and the families (in this case) will be the beneficiaries of the outcome. Unfortunately their satisfaction does not really allow for the receiver to waive their duties. The receiver is a representative of the court and not the plaintiff.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "hookisacrankycrook",
                                                    "body": "So Elon will bid 3.51M now with his sudden interest in this bankruptcy and the receiver will accept his bid. Elon gives Infowars back to Jones and everyone goes on about their way. Great outcome! Elon ties up the judgement in court until the families give up. Yay! What great justice! Twitters lawyers should have been thrown out of court. They have no place in this bidding war.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "weaverco",
                                                            "body": "Don't forget how it put Jones in Elon's pocket",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ItsSpaghettiLee2112",
                    "body": "Bullshit. The victims were happy.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sublimeshrub",
                            "body": "And there was a carve out that it wasn't supposed to be about the money. \n\nThis whole damn society is one big scam. The laws are a scam, the money is a scam, the information that we receive is a scam. Just a big fucking scam and everyone who isn't rich beyond their wildest dreams is a mark.\n\nThat's what this boils down to. The law is a tool for controlling the masses, while enabling the wealthy.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Stahlregen",
                                    "body": "What you're talking about is eerily similar to what the people of the Soviet Union lived through leading up to the collapse of their Hegemony. It's refered to as hypernormalization. We know they lie. They know that we know they lie. They do not care.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sublimeshrub",
                                            "body": "In their arrogance and ignorance they believe themselves untouchable. Maybe they are, maybe they aren't.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "2much2Jung",
                                                    "body": "One of them wasn't.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Greedy_Swimergrill",
                                                            "body": "No see, that’s the biggest grift of all\n\n*None of them are*\n\nThey just need us to think they are, otherwise you get Luigis",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Mysterious_Bit6882",
                                    "body": "> And there was a carve out that it wasn't supposed to be about the money. \n\nUnfortunately, in bankruptcy court, it's *always* about the money.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sublimeshrub",
                                            "body": "It wasn't. It was literally written into the instructions that the families best interests were supposed to be weighed",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "a-bser",
                    "body": "So maybe the Onion floats a little more money their way? \n\nPlus, with all this talk about Elon coming in to buy it, I too would hope a judge would block it considering Musk's new government position.  I certainly would hope that a judge would see that kind of purchase of a \"news\" outlet by a government entity as leading to something extremely close to some party that gained power in the 1930s",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "localPhenomnomnom",
                    "body": "If the value declines over time, could someone drag the process out by claiming there may be some interested Nigerian princes just over those mountains?\n\n\nBetter to destroy your own assets than let your enemy have them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ClassicHando",
                    "body": "The ones the sale was to benefit were happy and this was the one they wanted. Anything else is spitting in their face and telling them to be content it's not worse. Keep making excuses for your 'betters' to keep getting their way.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tails6666",
            "body": "Boo. Dumb as fuck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmokedUp_Corgi",
            "body": "They just gotta find sponsors and bid higher, this is good for the victims families since it’s more money in their pocket.",
            "score": 1,
            "replies": []
        },
        {
            "author": "boner79",
            "body": "It was fun while it lasted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Walrus4627",
            "body": "What is the name of this judge?!? They need to be known widely so when it comes time to vote they’re gonna get their ass lifted off that bench and dropped onto the street",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wokonthewildside",
            "body": "Booo",
            "score": 1,
            "replies": []
        },
        {
            "author": "Qualityhams",
            "body": "Excuse me what the fuck",
            "score": 1,
            "replies": []
        },
        {
            "author": "RetiredHotBitch",
            "body": "So it’s more than likely going to go to Musk.\n\nI wish this pus bag would go away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_love_Hobbes",
            "body": "Hopefully this will be appealed and overturned. These judges really need to get out of the way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "M1sterGuy",
            "body": "The sale was supposed to be a public auction, they did not accept the highest bid and the Onion bid was partial cash, the rest was to be paid from future profits essentially.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mn25dNx77B",
            "body": "The judge's comments sound reasonable, I guess. But I'm afraid the payment went through and he got the Doge coins\n\nJust another nudge pushing us over the cliff into a class war",
            "score": 1,
            "replies": []
        },
        {
            "author": "iCE_P0W3R",
            "body": "Skimmed the article, it seems that a mistake was made during the auction process, what the judge called a \"good faith error.\" Apparently, they didn't give enough time for competing bids? This doesn't really permanently block the Onion from getting Infowars, they just need to win the next auction again, I guess. It's still possible, but I can't lie, I'm a little worried Elon tries to buy it and allow it to continue as it were.\n\nThe families who are suing Jones, do they own the company, or do they just own the restitution from selling the company? Can they dictate who is and isn't able to buy it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "CowboyKarate13",
                    "body": "You're rooting for the guy that defamed the parents of dead children killed in a school shooting? Well, I guess Mark Robinson was right about one thing...\n\n[https://www.joshstein.org/press-releases/some-folks-need-killing-robinsons-history-of-violent-rhetoric-on-display-in-latest-ad](https://www.joshstein.org/press-releases/some-folks-need-killing-robinsons-history-of-violent-rhetoric-on-display-in-latest-ad)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "T_Weezy",
                    "body": "Why would you say this in a thread where it's clearly not going to be appreciated?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Im_always_scared",
                            "body": "Cause they are attention-seeking children",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TelescopiumHerscheli",
                    "body": "A month? That's three whole Scaramuccis!",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}