{
    "title": "Introduction to cats",
    "author": "Dollbaby777",
    "subreddit": "Dogtraining",
    "rank": 395,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i55iac/introduction_to_cats/",
    "id": "1i55iac",
    "selftext": "I have a 4 year old redbone coonhound mix and a 2 year old brown lab pit mix. Before I had the lab I had my 4 year old and a pit mix who I rescued from an abusive home that I was rehoming. While i was fostering her I found a kitten on the side of the road in a park. I took her in of course and I kept her in a separate room until I was comfortable introducing them. One day we got home and the pit mix got out of her cage and busted out the door to the room and unfortunately harmed the kitten. We ended up rehoming her but I still have trama. I don’t know how my dogs would act they have never been around kittens. I do have a big cage for the kittens when we’re not home they go in there behind a closed door. When they are in the cage we take the dogs in there as a way of slowly introducing them but I’m still not comfortable. I want to be able to have the kittens out with the dogs but I’m honestly traumatized. I trust my dogs I have but I’m having a hard time due to that situation. I am an animal lover and I save animals frequently from situations. And the 2 year old does not like other male dogs but is fine with female dogs. I feel like I’m failing my animals and I do train them they have recalls when they want to listen… they act like they don’t see the cats when they go into the room and when they go to the cage they sniff the cats noses and walk away. I just need some guidance on how to work on my trust with my dogs and also guidance on how to introduce them without making me feel uncomfortable. My husband stands by the fact he thinks they wouldn’t harm the cats but I just can’t get past seeing that dog and what it had done.. please don’t berate me for getting the cats I am a animal rescuer and found them as bottle kittens by a stop sign in a box. I do want to keep one since I lean toward a cat person.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Dollbaby777",
                    "body": "Question about training",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}