{
    "title": "UPDATE: Dog Snapped at Baby - Help!",
    "author": "phover7bitch",
    "subreddit": "Dogtraining",
    "rank": 301,
    "score": 871,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 52,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i87gvy/update_dog_snapped_at_baby_help/",
    "id": "1i87gvy",
    "selftext": "Original Post (3.5 years ago) : [https://www.reddit.com/r/Dogtraining/comments/ptdnr4/dog\\_snapped\\_at\\_baby\\_help/](https://www.reddit.com/r/Dogtraining/comments/ptdnr4/dog_snapped_at_baby_help/) \n\n  \n3ish years ago I made this post about my reactive rescue dog snapping at my 8-month old. I've gotten lots of messages asking me for an update so I thought it might be helpful to post this. Our daughter is now 4 years old and I'm happy to report that she and Danzig (who is almost 9 now) are bffs. \n\nBut the road to get there was LONG and the first few years were nerve-wracking as hell. Many comments in my original post recommended rehoming him. We decided to try a few things before going that route because we know our dog and we thought we could work with him. But we did arrange with my parents that he would go live there if there was no progress. Thankfully, we didn't have to do that but I am NOT using this post to tell you that you should not rehome your reactive dog if you have kids. If anything this is a cautionary tale about the amount of work that goes into keeping your family safe. Dog bites happen fast. In many cases, the lengths we went to might not be possible. \n\nThis is what we did to make it work: \n\n1) kept them totally separate unless they were supervised. Supervised does not mean an adult in the adjacent room doing something and occasionally checking on them - it means actively watching them both. Things gets crazy in a house with a small kid, so this was really hard. But we took it very seriously and made sure that everyone who visited or watched the baby knew that the dog should never be in her personal space and vice versa. We never gave the dog the opportunity to get annoyed by her being too close to him because we never let her too close to him unless it was fully safe (i.e. him sitting next to her while she's in her high chair, him sitting next to her while I'm holding her, etc.) This was the hardest part because it took constant vigilance, especially when she was crawling/walking and getting into everything.\n\n2) We met with a behaviorist who recommended putting him on Reconcile, which we did and he has been on ever since. He still gets anxious sometimes, but never to the extent that he used to. \n\n3) We worked with the behaviorist on understanding what situations triggered his anxiety and recognizing the signs of stress so that we could fix the problem before he got so stressed that he felt he needed to react. This is different for every dog but for him the trigger was usually being approached while he was laying down. Being loomed over when he's in a prone position is very stressful for him. We made it so that he would never be in the position to be approached like this \n\n4) We worked really hard on the \"place\" command. When he laid down in our common space - immediate \"place\" to his bed. We put his bed in an area that was inaccessible to our toddler and never allowed our toddler near his bed. We also worked on \"leave it\", which comes in handy a lot but we would also use it when he started to show anxious interest in the kid - \"leave it\" and \"place\" until he started to understand that he's not allowed to mess with her and if he's anxious about her he needs to retreat to a safe place. Eventually he just started doing it on his own.\n\n  \n5) we worked with our kid from day 1 about respecting the dog and not messing with him. We still work with her on this but she fully understands that the dog is sensitive about his personal space and if she messes with him she will get bitten. We work with her on learning about his body language, like rolling over on his back means he’d like to have his tummy rubbed but moving his face away from her, hard stare, a low tail, etc, means he needs space.   \n  \n6) we actually moved. There were other factors that went into the move aside from the dog/baby situation, but it was one of the things that made the biggest difference imo. Our house at the time was really small and cramped and there was nowhere the dog could go to get away from baby noises and stuff, I think it was really stressing him out. Once we moved to a place that was more spread out we started noticing that when he was stressed he would just go upstairs and nap and come back and be fine\n\n7) as soon as she was able, we had her feeding him and giving treats. As soon as she started eating solid food regularly (I guess around 1.5 years?) a lightbulb seemed to click for him and he realized that she was not a loud annoying grub, but a small human with treat giving capabilities who was always sticky and dropping food on the floor for him. This is really when things changed in a big way and he started to bond with her.\n\n  \nAll that to say that if you find yourself in the same boat we were, there are thing you can try before you commit to rehoming. However, getting through the next few years until your kid is old enough to be recognized as a family member is hard because you’ll have to constantly supervise them and stay on your toes. Bites happen so fast. If you're not watching and catching the signs of stress, you've already lost. And, like with any training, it's never \"over\" and you need to remain consistent. Even though the two are friends now, I would still never allow certain situations to happen like them snuggling or her annoying him while he's laying down. His anxiety is a part of him and it's never going to fully go away. \n\nHope this can help others! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "phover7bitch",
                    "body": "This is not a question - it's an update. I did read the wikis on aggression and the dogs & kids wiki and this is a lot of the same info but just outlines what worked for us because so many reddit users have hit me up asking for an update since my original post",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "phover7bitch",
            "body": "Thanks guys! \n\nAlso [applicable tax](https://imgur.com/a/rRZucZh)",
            "score": 138,
            "replies": [
                {
                    "author": "mand3rin",
                    "body": "What a stinking cutie. Glad all of the work paid off.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Double_Estimate4472",
                    "body": "Such a good boy!!!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "jalapeno-popper72",
                    "body": "He looks JUST like my dog, holy cow.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crafty-Snow9633",
            "body": "I love this so much. So happy you guys were able to figure out something that worked for your family, and keep the dog!",
            "score": 58,
            "replies": []
        },
        {
            "author": "Lizdance40",
            "body": "Thank you for your story of cautiously moving forward.  So glad it worked out for you.",
            "score": 64,
            "replies": []
        },
        {
            "author": "duketheunicorn",
            "body": "You 👏 did 👏 the👏  work👏 \n\nAmazing job, and excellent that you realized how big a role the environment played in your issues.\n\nProud of you, thrilled for your dog and your kid.",
            "score": 15,
            "replies": []
        },
        {
            "author": "basicparadox",
            "body": "That’s a great story and really impressive, well done",
            "score": 31,
            "replies": []
        },
        {
            "author": "SaraJurassicaParker",
            "body": "Thank you for this - I'm 20 weeks pregnant and I have a pup who is really nervous around kids and I've been worried about making this work. This gives me some hope",
            "score": 15,
            "replies": []
        },
        {
            "author": "h__08",
            "body": "Wow, that's amazing work! I love that you put all that effort in to keep the family together.\n\nI think that your points 1 and 5 are something every parent / dog parent should follow, though. Most bite incidents could be prevented by more careful management and respecting of boundaries.",
            "score": 13,
            "replies": [
                {
                    "author": "phover7bitch",
                    "body": "Absolutely! I am totally jealous of families who post videos of their toddlers crawling all over their dogs and the dogs just laying there happily. Like man, my dog could NEVER. But I do wonder if others watch those videos and think all family dogs are cool with that behavior. It takes a really special dog to be that chill, it's the exception, not the rule.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "sleepysunday121",
            "body": "This post makes me so happy! 7 months pregnant with a somewhat reactive Heeler and we’re currently doing some private training with him. I think I saw your story a couple of months ago when searching this sub for “dog and baby” type posts, so seeing a positive ending to the story really warms my heart. A lot of the steps you took are the steps we have planned to take as well so it’s great to hear what worked\n\nThanks again for sharing!",
            "score": 6,
            "replies": []
        },
        {
            "author": "HappySparklyUnicorn",
            "body": "I'm so glad you were able to work things out. Well done and thank you for the update.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Strange_Abrocoma9685",
            "body": "I love that you and your family put the time in.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Significant_You_1051",
            "body": "This is the exact same play by play of our story.  It’s like we live the same life.  So glad we kept our sweet girl and seeing them bond now makes it all worth it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MrsHands19",
            "body": "I remember seeing your post! We were dealing with some anxiety in our dog around the same time. I’m so happy to hear you didn’t rehome! Our oldest is 6 and youngest is 2. Our 5 yo dog is highly anxious and she had a significant spike in her anxiety after the youngest was born. We took similar steps and everyone has figured out their role/relationships and boundaries and it was so worth it! I see posts on social media all the time asking for suggestions after their dog growled at their baby. It makes me so sad when all the replies suggest to rehome. The work is hard but so worth it!",
            "score": 5,
            "replies": []
        },
        {
            "author": "cornfromindiana",
            "body": "Thank you for sharing! We have a reactive dog who started to growl at our now 2.5 year old when she was about 6 months. We got in with a behavioralist and switched up his meds and the progress has been so encouraging. We’re not 100% there yet, and like your dog, he will always be reactive and I’ll never trust them alone. Can you give more info on his medication? I’m not familiar with it. Ours is on gabapebetin and venaflaxine.",
            "score": 7,
            "replies": [
                {
                    "author": "phover7bitch",
                    "body": "Yes fluoxetine, sorry I should have used the real name. Doggie prozac. So glad you guys are making progress!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "HeyGurlHAAAYYYY",
                    "body": "Their medication is fluoxetine",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "plaidmonkey",
            "body": "Thank you so much for the update!! This is all really helpful to read - we've got an anxious dog and a nearly-8mo baby, and these are the things we've been trying to do with them from the jump (heard too many horror stories.) I'm so glad to hear it's working out for you, and I'm really hopeful that we end up in the same positive place. It absolutely does take a ton of work, but it's worth it.\n\nAlso, your little man is GORGEOUS. Thank you for sharing pics ❤️❤️",
            "score": 3,
            "replies": []
        },
        {
            "author": "Whatifdogscouldread",
            "body": "It’s really cool you took the time to share this with people who might be in the same boat.",
            "score": 5,
            "replies": []
        },
        {
            "author": "floating5",
            "body": "Thank you thank you thank you for sharing!!! I have a 3 week old newborn and a 7 year old lab mix who has shown fear aggression to children. We have a dog trainer we are working with and it’s manageable for now because the baby can’t move much but I have been so anxious for the future.\n\nEverything you say here makes sense and gives me hope!! We have been working on place and leave it and this reinforces what our trainer has been having us do.\n\nI might come back with questions for you, but thanks so much for sharing!!!",
            "score": 6,
            "replies": [
                {
                    "author": "phover7bitch",
                    "body": "Any time - good luck!! Danzig also chilled out a ton between ages 8-9 so you’ll def have a chiller  older dog if you wait it out and keep working on it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StopTheBanging",
            "body": "Holy crap OP, you worked so hard! You deserve a vacation from both of them lmao",
            "score": 3,
            "replies": [
                {
                    "author": "phover7bitch",
                    "body": "Thank you lmao maybe one day!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Useful_Shop_1371",
            "body": "You sound like an amazing person! Thank you for this story and for being amazing.",
            "score": 4,
            "replies": []
        },
        {
            "author": "atsirktop",
            "body": "\nI like to think I would handle it like you guys, knowing the dog we had when our daughter was born. But I totally understand people on the other end of the spectrum. \n\nHappy you guys are all thriving.",
            "score": 7,
            "replies": []
        },
        {
            "author": "peggydippin64",
            "body": "This is great news and lovely to hear a positive story for a change, well done!",
            "score": 2,
            "replies": []
        },
        {
            "author": "benji950",
            "body": "\" treat giving capabilities\" -- brilliant",
            "score": 2,
            "replies": []
        },
        {
            "author": "emrelk",
            "body": "Love this so much",
            "score": 2,
            "replies": []
        },
        {
            "author": "PLACENTIPEDES",
            "body": "That was 3 years ago? Jesus Christ.\n\nAnyway, good to hear! You did something most people don't: put the work in. Congrats!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jackfruit3177",
            "body": "makes so much sense !! 💞",
            "score": 2,
            "replies": []
        },
        {
            "author": "NicoNicoNessie",
            "body": "YIPPEEEE! Happy pupdate! So happy for you!",
            "score": 2,
            "replies": []
        },
        {
            "author": "kd4444",
            "body": "Thank you SO much for posting this, my dog gets anxious around my niece and my husband and I are planning to grow our family soon so this is really, really helpful! Thank you!",
            "score": 2,
            "replies": []
        },
        {
            "author": "simbaismylittlebuddy",
            "body": "This is amazing, congrats to you on putting in the work and not giving up on your pup.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bucciryan",
            "body": "Read this whole thing feeling like it exactly described my dog and kids. And clicked the pic to find that your dog could be my dogs bro. \n\nLooks just like my ruby do",
            "score": 2,
            "replies": []
        },
        {
            "author": "AncientdaughterA",
            "body": "These communities need this kind of content confirming the actual work required to make situations like this safe and keep dogs in homes. Thank you so much for posting!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "annierose77",
            "body": "Give you so much credit for actually making the effort to work with your pup instead of immediately getting rid of him. So happy things worked out and your hard work paid off🥰",
            "score": 2,
            "replies": []
        },
        {
            "author": "SparklyCamel789",
            "body": "I'm so proud of you!!! Good job!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Brilliant-Abject",
            "body": "You did such a great job! I'm glad they became BFF's.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Previous-Ad8792",
            "body": "Love. Love. Love. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "IAmBobC",
            "body": "The only thing I can think of adding would be crate training, so Danzig knows the crate is HIS personal place, and nobody will mess with him there. A human-free zone.\n\nA \"place\", such as a bed, is not the same, despite some overlap.",
            "score": 2,
            "replies": [
                {
                    "author": "duketheunicorn",
                    "body": "Not at all the same, but we have a cat defence system on the outside of the dog crate—hardware cloth and unclipped zip ties. Dang cat was sticking his arms through the bars to bother the dog in her “leave me alone zone”.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "phover7bitch",
                    "body": "Great point, that definitely would have been helpful.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pascalle112",
            "body": "Thank you for sharing, for doing the hard work, and for being realistic about dog and kid interactions.         \n\nI hope you’re all very very proud of the work you’ve done and continue to do.       \n\nI better go, someone must be cutting onions",
            "score": 1,
            "replies": []
        },
        {
            "author": "Viking793",
            "body": "I didn't know about your original story but what amazing parents/pet parents you are to be loving and dedicated to fixing the situation/relationship rather than giving up and making him someone else's problem. I take my hat off to you and your family for taking the right but difficult path.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SadApartment3023",
            "body": "Love this so much!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "linbad",
            "body": "Our family could have written this! Additional things to consider: training can be EXPENSIVE. It’s worth it, but something to be aware of. Also, baby gates! We had them everywhere to facilitate keeping them separated. It worked but was pretty irritating for a very long time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few_Distribution3640",
            "body": "I really appreciate your update for outlining the specific and clear controls your family implemented. I also appreciate your honesty regarding the effort and time involved in reshaping your dogs relationship to its family and environment. \n\nI feel you consistently applied rational, sound judgement and a commitment to critically assess all your options over months and years. That is so difficult to do after such an emotional and stressful incident. I really applaud you for your achievements and I hope you guys get many more years to enjoy together as a family :)",
            "score": 1,
            "replies": []
        }
    ]
}