{
    "title": "Puppy playing pretty roughly and scaring other dogs",
    "author": "wanderl0st1",
    "subreddit": "Dogtraining",
    "rank": 303,
    "score": 8,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i8xgqe/puppy_playing_pretty_roughly_and_scaring_other/",
    "id": "1i8xgqe",
    "selftext": "Hi! My puppy just turned 8 months old. We socialized her from a young age, with fully vaxxed dogs we know, and once she was fully vaccinated we started taking her out in public. She is 95% good on leash and can settle at restaurants, on walks, etc—but gets extremely excited when she sees another dog and just “locks in” — I have been putting her into a sit and rewarding calm behavior. She will hold the sit and responds to her name in these moments but she needs a lot of redirection. I don’t let her meet every dog, but if she does get to say hi she does pretty well initially and then ramps up and may try to jump on or rough house with the other dog, so I’ll end the interaction and put her into a sit and/or down stay until she settles.\nThat’s really just context for this—she has recently played off leash with some dogs she knows (and a few she doesn’t) in a supervised setting and has become a bit of a bully. She will bark, nip, paw at other dogs when they are clearly showing her they don’t want to play. She doesn’t seem to get it and just wants to rough house if given the opportunity. How can I help her learn better social behaviors with other dogs at this point.\nShe has been to a dog beach one time and did well there but otherwise is not a dog park dog at this point, meaning I don’t let her off leash in large group settings. I should also add that she went through basic puppy obedience and did so well there but was the youngest in her class by far and none of the other dogs were at a spot where they’d want to directly meet or interact. She did well executing the commands around the other dogs, including in close proximity. That ended just before Thanksgiving. I will take her to the next course in the Spring.\nShe is a very social dog and I want her to be able to have dog friends and play well with others. Thank you for your help! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "wanderl0st1",
                    "body": "I read the managing play page and think my puppy is either a “bully” or “a dog who always wants to play”. I suppose I’m trying to figure out which, and looking for more specific ways to train good manners around other dogs and how to continue to expose/socialize my puppy to playing with other dogs in a safe way.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "luxlacus",
            "body": "She’s just a rude adolescent dog. Totally normal; however it’s too exciting for her and she’s confused about leash introduction; sometimes she says hi and gets reenforced to be crazy by having access to the other dog. Leash introductions cause confusion/frustration so I don’t encourage them, instead look up neutral dog walks on YouTube. If you want calm on leash; you teach it by redirecting her attention to you- not reenforcing her to stare at dogs. Reward when she looks to you for guidance; not when she’s focused or aroused fixated at other dogs. Play with her on leash, make yourself more fun but also have clear boundaries of what’s appropriate and what’s not. She needs a dog with same energy; or to be told off by an appropriate adult- which is hard because it’s fun and overstimulating to meet dogs- I would incorporate breed appropriate games/outlets whatever she likes; nose work, flirt pole, jogging, urban agility, jolly ball and go on walks with friends with dogs (after watching how to do it on YouTube lol no dog interaction on leash still) \nOr do a group training class!",
            "score": 8,
            "replies": []
        },
        {
            "author": "sourgrapes222",
            "body": "Find her a compatible friend or two and stick to them for off leash play! Your dog doesn’t need to be everyone’s bff - as long as she can be neutral around other dogs on leash that’s all you really need to worry about. My 1 year old is similar and he has 3 doggie friends that match his play level/style. We meet up a few times a month and they have a ball together. He’s a little too much for some dogs and that’s ok!!",
            "score": 8,
            "replies": []
        },
        {
            "author": "sicksages",
            "body": "I would stop allowing her to greet dogs on leash. She obviously can't contain herself when she does and its creating reactivity in her.\n\nSet up doggie playdates with friends, family or other. That's the best way for her to learn how to socialize. If she starts showing the bad behaviors then remove her completely from the situation.",
            "score": 6,
            "replies": []
        },
        {
            "author": "bullzeye1983",
            "body": "One of mine is a Rhodesian. We don't play with dogs she doesn't know and already know what Rhodesians play like. Don't go to dog parks, they are a disaster waiting to happen anyway. Play dates in controlled environments. Or do like me and have two dogs that love the way each other play.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Business_Ad4509",
            "body": "I wouldn't have them sit and stay when they're that high strung and tempted. It might be too hard and that entire time they're reving up. I would try competing a skill or some other task instead of just sitting there, that way their energy is being expended rather than just sitting there building anticipation",
            "score": 3,
            "replies": []
        },
        {
            "author": "Key-Ad-5068",
            "body": "Some advice, if they can't play nice with others, don't allow them to play with others. You don't want someone getting hurt before you figure this out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Previous-Ad8792",
            "body": "You can't teach your dog social manners NOW. Stop all off leash play and teach her around another senior, well mannered dog who won't tolerate this kind of play. She needs to learn to settle around other dogs.  ",
            "score": 2,
            "replies": []
        },
        {
            "author": "TenderKodaMonkey",
            "body": "I’m not a professional, but have been successful training dogs for over 40 years. IMO, you’re already on the right track. Redirection + maintaining a calm mindset is key but don’t forget two vital tenets of good training: timing and consistency. Timing - Apply redirection the very second your dog locks on the other dog. This will require hyper-vigilance of your dog’s telltale signs. Consistency: Correct every single time. This can be exhausting at first, but have faith that it will get better over time. \n\nI wish you luck and success in your endeavor. Thank you for being a conscientious dog owner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BayAreaPupMom",
            "body": "My very energetic 1 yr old puppy is also still working on the skill of desensitizing his reactivity to other dogs. We have made a lot of progress in that when we are walking and another dog approaches or passes us, he knows to keep focus on me. We used to have to keep about a block away from other dogs. Then it was across the street. Now it's down to a couple feet apart. If the other dog approaches us closer than that, it's still too much for him. So the distance is still important, as other dogs act as a distraction from him doing the task that I am asking him to do, which is focusing on me as his trainer. It's part of the Three D's of dog training: distance, duration and distraction. My puppy is in training to be a service dog, so it's important for him to not react when he is near other dogs while \"working.\" I do not allow him to stare at other dogs. His focus is always supposed to remain on his handler, which he now is able to do with and without treats, given that the other dog is not too close. If we are sitting close to another dog, I insist that he keeps eye contact focused on me. That helps a lot with his focus.\n\nI also do not allow him to play rough or bark with our other dog, even if our own dog is exhibiting bad behavior. We have been quite successful with this double standard approach by the time he was 6 months old.\n\nBTW, there is a current philosophy on dog parks that they are not really as good for socialization as people think, as not everybody has similar control over their animals and it can also be overstimulating for some dogs. You definitely want to listen to what other people are saying about not bringing your dog to off leash areas especially while she maintains a dog -reactive behavior.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Subject-Olive-5279",
            "body": "Dogs don’t need to play with strange dogs. If you have a second dog or a close friend with an appropriate temperament dog that would be the exception. My dogs plays with my other dogs. But not strange dogs. Because you don’t know their temperament, vaccination status or the way they play. Socializing doesn’t mean playing with other dogs. It means ignoring other dogs and If a dog is so intense and eager to greet other dogs. And plays too rough. They will eventually meet the wrong dog, and they will either get hurt or hurt another dog. Bully breeds/pitbulls (don’t know what breed you have) tend to have genetic animal aggression which usually “turns on” around 1-3 years. Some never get it but those that do will be difficult to stop due to gameness. Reward your dog when you are at distance from other dogs when it ignores other dogs. You may need to be really far away at first. But you will eventually be able to get closer. But be patient and eventually they will learn that is what you want.",
            "score": 0,
            "replies": []
        }
    ]
}