{
    "title": "Blind puppy barking at things that aren’t there",
    "author": "odithekittycat",
    "subreddit": "Dogtraining",
    "rank": 302,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i9drqg/blind_puppy_barking_at_things_that_arent_there/",
    "id": "1i9drqg",
    "selftext": "Hi I recently got a blind at birth dog who we think is a husky mix, whenever i take her outside she gets freaked out by the wind then starts barking which makes all the other dogs in the neighborhood start barking, what can I do to have her bark less I understand her barking at the wind but once the other dogs also start barking she can’t stop, i don’t think she understands they aren’t there. hearing the dogs also makes her get really aggressive and she starts guarding me so I’m worried this might spiral into her actually attacking a dog .(she also can’t really seem to smell anything unless it’s right under her nose which makes treat training hard)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "odithekittycat",
                    "body": "I don’t think anything I read on the wiki fits the situation besides maybe the barking reactivity but it’s ways to fix it are for seeing dogs",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}