{
    "title": "Need help with age increased aggression",
    "author": "SuspiciousBedroom124",
    "subreddit": "Dogtraining",
    "rank": 292,
    "score": 8,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i9lox4/need_help_with_age_increased_aggression/",
    "id": "1i9lox4",
    "selftext": "I have an 11-year-old Yorkie Mix whose behavior has increasingly become more aggressive. I have hired animal behavioralist, dog training classes, clicker training, high value treats, and attempt to redirect his focus and break the aggression in those moments. \n\nNothing has worked and his behavior has gotten worse with each passing year. At this point nobody can come or go from the house without being attacked. Although he is 5 lb he is still a liability and at worse he has drawn blood by small nips and have torn clothing on friends, family, and even us. He loves car rides but now if we take him for a ride where I need to get out of the car he attacks me by biting and barking.  \n\nFor the last 2 years we don't answer the door to anyone that stops by unexpectedly unless it's absolutely necessary. And when we do this we have to pick him up and move him to another room while being bitten and shut the door for the duration of the visit. Afterwards he will not calm down and is on high alert for hours afterwards because he knows somebody was here. This is particularly a nuisance since we have retired neighbors that love to drop by in the middle of our work day which wreaks havoc for the rest of our day. It's a huge issue when we have landscapers, pool service, and pest control visits as he knows someone is on the property.\n\n If we do have planned visitors coming over that he is not typically aggressive towards, what I mean is he's okay with them in his space after the initial entry into the house. However, we have to watch the camera for their arrival so we can take him outside and pretend it's a potty break so he doesn't attack and will be chill for the visit. We do the same before they go. \n\n\nI have tried thunder vests, pheromones colars, trazodone, other sedative drugs the vet have prescribed, and we still can't get his anxiety under control. If we have to take him to the vet or grooming he has to be sedated. He wasn't like this until he was about a year and a half old when I had him neutered.\n\nI just don't know what to do and I love my dog so much. Any helpful recommendations would be appreciated. I honestly feel trapped in my home and I have to tell friends that I wish I could invite them in or to come over but my dog is aggressive. \n\n\nI was told that an e-colar might be helpful but I'm worried it would just train him to be anxious over wearing a collar.\n\nPlease help! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "SuspiciousBedroom124",
                    "body": "My dog has been under the care of veterinarian services for this aggression. He's been prescribed medication, training, and even care under a certified animal behavioralist. His aggression has continued to increase.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "xzkandykane",
                    "body": "Did you check his teeth? My aggro chihuahua mix was much better after his teeth removal. His mouth was in pain all the time. Id be grumpy too\nstill hela spicy but better",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LoveAllHistory",
            "body": "He has extreme anxiety. Sedatives don’t address it; it’ll just make him anxious and sleepy, which in turn will make him more anxious. Talk to your vet behaviorist about Prozac.",
            "score": 14,
            "replies": [
                {
                    "author": "CasaTLC",
                    "body": "Agreed, but I’ll add that he needs a full work up at the vet to make sure there are no underlying health issues or dementia at play here. Once those are ruled out, I’d try Prozac.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dbellz76",
            "body": "Please please please stay stay from shock collars! This will NOT be beneficial in any way, it will likely make things worse. \n\nMy first thought is s vet visit, not for medication, but for pain. I wonder if there's an underlying issue that started causing this 2 years ago? Sudden changes in behavior likely means something is wrong. Also remember that behaviors that are rehearsed will continue to get stronger.",
            "score": 13,
            "replies": []
        },
        {
            "author": "WittyNomenclature",
            "body": "Dementia? Pain? Just like with humans, these behaviors are not a normal part of aging.",
            "score": 10,
            "replies": [
                {
                    "author": "insignificantwalrus",
                    "body": "agree, any sudden aggression with aging I’d always say consider pain first…",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "> I have hired animal behavioralist\n\nIs this behaviorist ACVB certified? \n\n> high value treats, and attempt to redirect his focus and break the aggression in those moments.\n\nHave you tried the Capturing Calmness technique?  \n\nIf the dog is nipping, would you consider either not giving the dog free roam of the house (use a pen) or consider s basket muzzle (see Muzzle Up Pup)?\n\n>  trazodone, other sedative drugs the vet have prescribed, and we still can't get his anxiety under control. \n\nWhat is your vet recommending?\n\n> I was told that an e-colar might be helpful but I'm worried it would just train him to be anxious over wearing a collar.\n\nI agree with you.  E-collars are considered aversive and are not recommended.  [See About/Wiki page here for why they are not recommended.](https://old.reddit.com/r/Dogtraining/wiki/prongandecollars)\n\nI don’t know if any of these will help but I think it is worth checking just in case:  18 Dog Relaxation Tips, a detailed list in my comment on [this post.](https://www.reddit.com/r/Dogtraining/comments/12w9wnd/comment/jhe8zq3/). Includes Karen Overall’s Relaxation Protocol.  \n\nResources for Reactive Dogs can be found [here](https://old.reddit.com/r/Dogtraining/wiki/reactivedogsupport). ",
            "score": 5,
            "replies": [
                {
                    "author": "SuspiciousBedroom124",
                    "body": "Yes, he was seen by ACVB certified specialist and we did an intensive group of sessions. I was told this behavior was likely a result of bad breeding and aggression in the blood line. I struggle with that because he was the sweetest kindest puppy until he was neutered, then the territorial and aggression started \n\n\nI have not heard of Capturing Calmness and will definitely look into this.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JudySmart2",
                            "body": "It sounds like your dog is anxious and stressed most of the time, his cortisol levels will be so high that chronic stress will be leading to him being unable to learn. \nWhat did you do with the behaviourist in the sessions? How did the dog behave? What management have you put into place so that your dog doesn’t need to be put in the stressful situations?\nStair gates in door ways can be really helpful to keep an anxious dog farther away from something that it finds overwhelming while potentially feeling safer because they can still see what’s happening. \nIs the dog happier at the back of the house? Away from the front door so that when the door bell goes it’s already away and you don’t have to pick up the dog. \nI’d really really recommend seeking anti anxiety medication from your vet. Sometimes it takes a few different medications to get the right fit. Also a pain trail. It’s when you give your dog a pain medication for a few months to see if the difficult behaviour gets better. If your dog is in pain and you’ve never realised, then their stress levels will be considerably higher which can lead to these kind of behaviours. A pain trial could indicate if that’s the case by potentially treating that underlying pain, while you use management to stop the dog being put in situations that it cannot handle. \nJust because you can physically pick up the dog and move it out of the way, doesn’t mean that you should. The dog may be telling you that they’re in pain and don’t want to be picked up, or so stressed in that moment that their only option is to bite. Please use management to ensure you change the environment. Put a sign on your front door that tell people not to ring the bell. Have them text you when you arrive. Then you can calmly get up, get a yummy treat for the dog, give it to them behind the stairgate and close them there away from the visitor, then go to the door to see who’s there",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "JudySmart2",
                            "body": "I’d also recommend watching dog calming signals and dog body language videos to learn more about reading your dog and see if your missing other indicators that your dog is stressed. Excessive licking can be an appeasement behaviour",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "spaniel_lover",
            "body": "I'm going to say something you likely don't want to hear, but I want you to think about your dog. Does this sound like a happy existence for him to you? You say he's been under the care of a veterinarian. Have health and pain issues been ruled out? If so, and medication, along with behavioral modification work, hasn't helped, it might be time to think about BE. There are times when behavioral euthanasia is the kindest thing we can do. It isn't what we hope for, but when the dog exists in a constant or near constant state of heightened awareness, frustration, and anger that isn't alleviated with any of the things tried, it's time to think about taking that frustration and anger away in the last way we truly want to.",
            "score": 9,
            "replies": []
        },
        {
            "author": "tminus7MT",
            "body": "If this dog was any bigger than it is, with multiple confirmed bites that draw blood, it would be an obvious answer. \n\nThis dog isn’t safe. If you were my very best friend, I would still tell you that this dog should be euthanized. \n\nAt the bare minimum, he needs a well-fitted muzzle to wear out of the house and to be leashed at all times, so you have some control over the dog when people come over.",
            "score": 6,
            "replies": [
                {
                    "author": "Len_S_Ball_23",
                    "body": "Cuteness always seems to override dangerousness with humans for some reason.\n\nImagine if you were out in the street and someone such as a child comes to pet your dog? The dog gets aggressive and lunges for the child. The child then jumps backwards out of the way, straight into the road and in front of a bus.\n\nI've met less aggressive and nicer bull terriers than a lot of anthropomorphised toy breeds.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "SuspiciousBedroom124",
                            "body": "We never take him out in public unless to the vet or groomers. When we do, he's sedated, leashed, and carried by me. And since we take him outside or put him in a closed room with opening the doors he won't bolt.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SuspiciousBedroom124",
                    "body": "I know I'm my heart of hearts what you say is true. I would have to make this gut wrenching decision even though I would prefer to cut off my own arm if it came to it.I could not have more children after my first child. So my husband gifted me this beautiful little boy while I was struggling with my hormonal overload of my ticking maternal clock.\n\nWhy I hope we are not there yet, is because my sweet little boy is great and loving most of the time. Like endless cuddles and kisses. \n\n But his aggression when it happens is so out of control it literally can't be stopped in the moment. When he is at his height of anxiety and aggression I look in his face and he is foreign to me and looks completely feral. \n\nWhen he does bite me while I try to pull him back from the door he will attack my hands, stop for a second and recognize me and what he did but in a split second he's gone.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Directly-Bent-2009",
                            "body": "I agree that a well -fitted muzzle and a leash on in the house, and some pressure gates will help a lot. You can purchase \"bite gloves\" online to protect your hands also. Take the time to get him adjusted to the muzzle if you can, otherwise it will increase his anxiety, but there are some great tutorials online. The Leash, compounded with some strategically placed pressure gates in your home will help with the overall anxiety as well. There is nothing that says he needs to have free reign of the house, and sometimes, even with adult dogs, making their world \"smaller\" helps. The pressure gates are great because no one is trying to step over them, and they are not expensive.\nYou have probably checked this, but just in case, if this happened after his procedure and is getting worse, has the vet checked that there wasn't a nerve or some other type of damage done accidentally that is causing pain? The vet would have to look for tender/painful areas specifically to see if there is something wrong that is pushing him over threshold that much faster. Hope this helps.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "accidentally-cool",
            "body": "Does he have doggy dementia?",
            "score": 3,
            "replies": []
        },
        {
            "author": "noneuclidiansquid",
            "body": "An 11 year old yorkie should be easy to put away when people are over - do it before they come and practice this as a safe space when new people are not there as well - make it a fun place that many treats are received in and that's a soft place to sleep.  You can put a sign on the door for people to send you a message instead of knocking as well. Increased aggression and anxiety is often associated with pain, arthritis or mental decline in older dogs. Give him a safe space and save him from the noise and confusion of visitors and look at daily anxiety meds from a behaviourist. \n\nWith random people showing up - a puppy pen in front of the door to prevent him accessing it would help - I had to do this when my JRT got old - you kind of pen off the door so they can't get through and just step over yourself so no one at the door gets hurt. \n\nAdding shock to this mix is going to make him miserable and confused don't do it.",
            "score": 3,
            "replies": [
                {
                    "author": "SuspiciousBedroom124",
                    "body": "I would agree he should be easy to put away. But he's like the tasmanian devil. He is very spry with puppy agility even as a senior.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Other_Cabinet_7574",
            "body": "probably dementia. the dog is elderly. just enjoy the time you have left. there’s no sense in trying to “fix” this… you won’t. it’s not a puppy, it’s a senior… certain battles we can’t win.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules/) and [posting guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), particularly regarding trainer recommendations.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sirkseelago",
            "body": "Do you think he has more good days than bad?",
            "score": 1,
            "replies": [
                {
                    "author": "SuspiciousBedroom124",
                    "body": "I would say he goes days and days with just a relaxed vibe and no barking. Is just the doors that trigger him. House and car.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MoodFearless6771",
            "body": "Prozac + Gabapentin together, do not use a e-collar, use a carrier for transport in the car, if your doorbell rings or guests come put your dog in the bedroom with the tv or radio on. And most importantly make sure the dog is loved, and having fun.\n\nEdited to remove device recommendation.",
            "score": 0,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules) and [guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), as well as our wiki page on [punishment](https://old.reddit.com/r/Dogtraining/wiki/punishmentproblems). The standalone \"anti-bark\" devices are just as harmful as the collars.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MoodFearless6771",
                            "body": "Apologies, I will edit it. I did not intend to promote their use.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lizdance40",
            "body": "First let me say I'm terribly sorry you're going through this. It is very possible this is pain related or fear related. It's also possible it's a genetic problem that he's always had. I always tell people not to blame themselves because it's very likely it's not something they did, or something they didn't do. Dogs can be mentally ill. You'll often hear people say that \"the dog is not wired right\"\n\n\nThere is absolutely no good can come from an e-collar for aggression. It was almost always make it worse. Especially if the aggression is coming from a place of anxiety / fear. \n\nYou should consult a veterinary behaviorist. Medication can help but it may take weeks to kick in. And if the first medication doesn't work you'll have to wean him off and try a different one.  Medication is not necessarily a cure-all. It can actually make dogs worse. \n\nThat leads to the more difficult discussion, when is it time to let a dog go over the rainbow bridge when every day they are in mental anguish.  Absolutely have to discuss this with your veterinarian.  \n\nI belong to a group on Facebook for those who are or have considered behavioral euthanization. For the most part the dogs are bigger than a 4 lb Yorkie. Just because the dog is only 4 lb does not mean it's not capable of doing some damage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible-Stock-12",
            "body": "When you say “behavioralist” what do you mean? In the US, that title should be used only by veterinary behaviorists (vets with advanced behavioral training) but some trainers (particularly balanced trainers) call themselves that. \nAn e-collar will definitely make this worse. \nHas the dog been checked for pain? \nWhen you say you try to “break the aggression” what do you mean? Counter conditioning is supposed to be done before the dog starts to react. For example, my dog became dog reactive. If we were 50 feet away he wouldn’t react, so we reinforced looking at dogs calmly from that distance, then decreased over time. If he started to react, that was my fault, I pushed him farther than he was ready to go.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hamandcheese521",
            "body": "Have you had him the whole 11 years? Was he not socialized??",
            "score": 1,
            "replies": []
        },
        {
            "author": "sks2177",
            "body": "At 11 he probably has some form of pain and maybe even vision and hearing issues. Those things can make does insecure and reactive. He may even sense your fear of him acting out which makes him act out. Get him a bone and a comfy crate for when company drops by so that he has a safe space to relax for everyone’s sake.",
            "score": 1,
            "replies": []
        }
    ]
}