{
    "title": "Dog messing inside after loss",
    "author": "Budget_Score9613",
    "subreddit": "Dogtraining",
    "rank": 299,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i9np4a/dog_messing_inside_after_loss/",
    "id": "1i9np4a",
    "selftext": "What it says on the tin.\n\nMy family and I recently lost our dog, Temmie, a week before christmas to spinal cancer. He and Roxy (currently alive) would do just about everything together -- namely, going outside to the restroom. They would spend most of their time together, inside or out, and a few weeks after he died she began to start showing signs of grief (not eating, drinking, etc.) He was not dead when we took him to the vet; I figured it would take a few weeks for her to start to miss him. She started eating again a few weeks ago. \n\nShe'll be going to the vet in a few weeks, but I pre-emptively called and they said it was most likely related to the loss. Her poops are healthy and show no signs of parasites or GI issues, and she still pees outside. No licking or chewing, or any other abnormal behaviors. \n\nWith that said, every morning the past few weeks I wake up to a pile of dog poop somewhere in the house -- it's not consistent. Sometimes it's in the spare bedroom, sometimes it's the livingroom, kitchen, bathroom... You get the idea. \n\nShe's fed twice a day -- 6:30 AM (around when I wake up) and at night around 7 PM. \n\nI don't like locking kennels if I can help it-- but I feel like that's the only option now. I don't know if that would just fix the symptoms. \n\nAccording to her prior owner, she's a rescue? She's skittish and incredibly anxious, but those behaviors seemed to ease off with temmie around. She dislikes being grabbed or handled by the collar. She's a high energy Blackmouth Cur, and regularly did sprint-speed laps around the yard with her brother. Is it possible she's not getting the stimulation she needs, now, because Temmie is gone? Could that be related to the pooping in the house?\n\nI feel awful for being so irritated about this. \n\n\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Budget_Score9613",
                    "body": "She will be going to the vet soon. I called, and they said it would be okay to wait, as it likely wasn't health related.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}