{
    "title": "Dog wont go on a walk",
    "author": "Competitive-West-451",
    "subreddit": "Dogtraining",
    "rank": 294,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i9vaua/dog_wont_go_on_a_walk/",
    "id": "1i9vaua",
    "selftext": "Hi everyone,\n\nour 8 year old labrador (9 this year) got diagnosed with sciatica on Tuesday, she didnt go on her usual walks a week before hand (thought it was just her anxiety) but would go on quick ones with my mam.\n\nNow she wont even leave the house for a walk, i give her a soft tug on her lead and she’ll follow me to the grass outside the gate but immediately pulls home.\n\nShe’s on arthrocam and it seems to be working (has been lying on her back and isnt pacing anymore) aswell as anxiety medication.\n\nWhat can i do to help her get out again?\n\nthanks :)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Competitive-West-451",
                    "body": "Dog has been to the vet and diagnoses with a condition, however behaviour is still continuing",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "If it were me, I would allow her to take  as long as she needs to get back up to speed, particularly since she is still going outside to pee.  ",
            "score": 1,
            "replies": [
                {
                    "author": "Competitive-West-451",
                    "body": "that was our plan if she didnt go today however we changed her lead and she went on a walk!\n\ni’m assuming the slip lead was pressing on her nerves that then shot down to her sciatica!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Cursethewind",
                            "body": "Those can actually prevent a dog from wanting to go on a walk because it makes walking painful. You're dealing with aversive fallout it sounds like with that information.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Competitive-West-451",
                                    "body": "sorry whats aversive fallout ? 😓\n\nwe’ve used a slip lead all her life and she’s never had a problem with it!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Cursethewind",
                                            "body": "Aversive fallout is where the dog connects the pain/discomfort from the tool with something else, creating a dislike of that thing instead of causing a change in behavior.\n\nSeeing your dog is fearful of walks *only* when the slip is on, the slip is the problem and it's caused by it.\n\nIt doesn't matter if she's used it her whole life, the change of feelings can occur slowly over time.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Competitive-West-451",
                                                    "body": "thank you very much! \ni’ve changed the lead and she went on a walk right away!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "From the About/Wiki page here:\n\n> A slip lead is a lead that runs through a ring, creating a loop that can be placed over a dog’s head for a single collar/lead combo. **It is NOT advisable to use a slip lead, as it has unlimited tightening and can hurt your dog, and its asymmetrical nature means that it will not easily release when held in some orientations.** The advantages of a slip are that, in an emergency, they are compatible with dogs of any size, stoppers can be applied that will prevent tightening too far, and that any regular leash can be converted into a slip lead by using the handle end as the “ring” to create the loop. It can easily be ‘slipped’ on your dog if your collar breaks, or if you find a stray dog you don’t need the exact collar size in order to lead it around. Knowing how to convert your leash into a slip lead is useful, as long as you are aware of **the damage it can cause both to your dog’s neck and to the dog’s relationship with you if it tightens.**",
            "score": 1,
            "replies": [
                {
                    "author": "Competitive-West-451",
                    "body": "thank you, i had no idea about this!\n\ni’ll order a new lead for my other dog aswell :)",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}