{
    "title": "My dog has started barking at friendly strangers all of a sudden",
    "author": "theoneandonlyjan",
    "subreddit": "Dogtraining",
    "rank": 274,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ib20f7/my_dog_has_started_barking_at_friendly_strangers/",
    "id": "1ib20f7",
    "selftext": "I got my dog about 3 months ago, and she’s always had a weird thing where she stops and stares at strangers as they approach us on walks. She’s certainly not unfriendly towards strangers, but she’s always seemed apprehensive. In the past few days, though, she’s developed a habit of barking and jumping away from well-meaning strangers who have asked to pet her, and it’s embarrassing! It seems pretty clear to me that she’s anxious around strangers, but the barking has to stop and I don’t know what to do about it. The weird thing is, though, that she’s always loved people with dogs. If we come across someone walking their dog, she’ll go up to them, tail wagging, happy as can be. The barking has only happened with people who don’t have dogs with them. Why??? The only thing I can think of is that she’s in heat (I haven’t been able to get her spayed, it’s a long story so please no lectures about that because I know it’s important and I’ll do it when I’m able to) and maybe hormonal changes are causing this sudden behavior change?? Please help!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "theoneandonlyjan",
                    "body": "Sorry, I’m asking for free advice BEFORE I spend $$$ at the vet for advice about sudden behavior problems! Please let me post this and potentially have my problem solved right now rather than having to wait to get a vet appointment!",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}