{
    "title": "My dog constantly runs around headlessly around the neigborhood and cries when being caged",
    "author": "Miserable_Wear_552",
    "subreddit": "Dogtraining",
    "rank": 256,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ibznip/my_dog_constantly_runs_around_headlessly_around/",
    "id": "1ibznip",
    "selftext": "Hi I am a new dog owner. My dog, Toby is very hyperactive. Too hyperactive. My street is very busy as cars and people are always present. I don't want to get Toby in any kinds of accident or disturb people while walking along our street, so I occasionally cage him. That's when he cries and whines and I just can't help but open his cage again but supervised. He doesn't want to be leashed too....",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Miserable_Wear_552",
                    "body": "Problem with calming him down with exercising is exercising itself. He is too distracted with other things. He also doesnt want to be leashed and gets sad + uncomfortable when done so. To be honest the \"exercise\" he's getting is his zoomies and that's really it.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}