{
    "title": "He won’t come inside",
    "author": "Lavarticus_Prime",
    "subreddit": "Dogtraining",
    "rank": 253,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ic60dv/he_wont_come_inside/",
    "id": "1ic60dv",
    "selftext": "I have a 10 month old puppy, we’ve had him since he was 8 weeks, he’s enormous (100lbs already!) and a very good boy, we’ve taught him sit touch stay, etc etc he’s eager to please, very food oriented so using treats for training works great.  Other than chewing things he shouldn’t when he gets bored (expected for a puppy) the one issue we have is that it’s a huge battle to get him to come back inside from the back yard, no matter how long or short he’s been out there, it’s the only situation where “touch” and treats don’t work. He just stands half way in and out and stares at you, if try to get close he goes back outside, to get him to come in you have to pretend like you aren’t paying attention and give him like 15 minutes to decide to come all the way through the door.     How do I get him to just come through the open sliding door when we do “touch”…. Once he’s inside he does touch like 95% of the time, but from the backyard into the house he does it 0%.    How do I address this?\n\nIf you care about breed, his wisdom panel has 11 breeds, the highest percentage being 28% Great Pyrenees.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Lavarticus_Prime",
                    "body": "I’ve gone through the linked guide and a bunch of the wikis, and none of the options really fit my hyper specific situation, the closest being “my dog doesn’t listen” but he does listen everywhere except this one situation. We even hired a trainer when he was younger (when we realized that we was going to be enormous) but this behavior only started a few months ago.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}