{
    "title": "Help With Overactive Dog? (1yr5months girl)",
    "author": "prickly-knight",
    "subreddit": "Dogtraining",
    "rank": 191,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ifq1b9/help_with_overactive_dog_1yr5months_girl/",
    "id": "1ifq1b9",
    "selftext": "I read through guide for Hyper dogs and such, its not really the advice im looking for :( My dog, Junji, is an Australian Shepherd Rott Lab mix (Spayed), and she is bursting with energy!\nI know the usual jump is to think she needs more stimulation or enrichment, but she's still amped and at 100% even after 7 hours of dog daycare and 6 miles walking (3 miles ea). \nI love her dearly and I try to do my best for her, she gets treat puzzles and training time as well on top of this, but I can't always do 6 miles (its below 0 freezing lately) and there are days she can't go to daycare.\nNot to mention we have to move daycares as hers is relocating and she's going to have to go at least a few weeks without it! \nHer energy in itself isn't the biggest issue, its getting her to understand that not all the time is playtime and she needs moments of rest? Unless she's completely exhausted, she'll continuously push play.\nAnd I love her to death, but I can't do it 24/7! And lately she's picked up a habit of whining if I don't throw the ball, which I ignore but she's pretty persistent. Im tryning to teach her a \"No more/all done\" command, but it hasn't really been taking so far\nIf anyone has any advice or ideas, please let me know. She's healthy as of her last check up, I don't think her being like this is medical really either way. I plan to get her a dog treadmill soon which I think will really help especially with the cold weather, but I truly will appreciate anyone who comments greatly",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "prickly-knight",
                    "body": "This is a little much just to ask a question on reddit imo, but i read through that and it didn't help. I want advice from a human being please. \nLike I said in the post she is healthy to my knowledge rn, she doesn't show any signs of health issues save for wonky anal glands i have to help her release sometimes (Shown how and was given permission to do by vet), and last year she had a leg injury that is healed with no problems now. She gets a looot of exercise, some days less than 6 miles ofc but im only human. She has dog daycare rn but were going to have to pause that for a bit. At home I try to do training sess 2-3  times a day at least, I take her out in the yard at least a handful of times in the day to play fetch and chase, she has a decent amount of chews, and she has treat puzzles tho I'd like to get her new more complicated ones. I have tried teaching her to relax by teaching her a \"no more/all done\" but its like she has dog adhd.\nI realize what I need is for her to be able to relax before even tiring her out, but I'm having troubles and would really appreciate advice from people who have been here before. I love her dearly, I want the best for her but I can't keep up with her neverending energy and need her to be able to just chill with me more often. \nIm in a rough patch in life and suddenly in between jobs with a lot of stress, so if I could get this portion of my stress under control it would really help. I plan to get her more puzzles and hard chew toys asap, but right now I just need to know what my first steps with her should be.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rebcart",
            "body": "Have you done the relaxation protocols in the wiki page on calmness?",
            "score": 1,
            "replies": [
                {
                    "author": "prickly-knight",
                    "body": "I have but it hasn't really taken? If the treats are around she'll humor me, but unless she's exhausted it doesn't stick so far although I remain trying. Really, it's the whining that gets me. I take away away her ball at a certain hour and it does help her to get ready to settle down, but I'd much rather her be able to keep her toys out and understand its solo play time, she just doesn't really seem to get playing by herself.\nAre there any other relaxation methods I could try? I have her scheduled for a vet check up, but she's always been this energetic and go go go honestly. It's just worse now without the benefit of her taking puppy naps",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rebcart",
                            "body": "It kinda depends on which one you do, for this kind of active dog the Suzanne Clothier Relaxation Protocol tends to work a bit better than the other two. I also recommend going *really* hard on sniffing games because sniffing tends to tire a dog out mentally way more than other types of indoor games. Also long-term chews like a dried beef tendon.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}