{
    "title": "Help letting go of toys",
    "author": "itsric0001",
    "subreddit": "Dogtraining",
    "rank": 92,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ilbnz1/help_letting_go_of_toys/",
    "id": "1ilbnz1",
    "selftext": "Hi all, i have a 14 month old, 60 lb boxer-pit-shepherd mix. She is very sweet but has tons of energy and can get out of control if other dogs are around or even people. She loves everyone a lot. \n\nWe usually play fetch at an area of a park that’s not too crowded, and she will bring back the toy and eventually drop it without me saying anything. However, she almost never lets go of a toy if its in my hand. \n\nShe is too strong to just hold it limp, and has accidentally chomped me a few times when I’ve tried. \n\nI’ve been advised against trading for food, and if she’s really in play mode, she won’t even let go for really good treats. \n\nShould i try to trade for another toy? Is there another technique I’m missing?\n\nThanks for your help!\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "itsric0001",
                    "body": "I have tried holding the toy still in a boring position, but my dog is too strong. I have tried trading for food, but doggy once swallowed a small toy to get the treat. I have tried trading dor another toy, but she will get up to 4 toys in her mouth at once.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}