{
    "title": "How do I get my dog to WANT to go in the crate?",
    "author": "aerialison",
    "subreddit": "Dogtraining",
    "rank": 91,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ildbv5/how_do_i_get_my_dog_to_want_to_go_in_the_crate/",
    "id": "1ildbv5",
    "selftext": "A bit of background: My 2yr old rescue dog (a genetic mess mutt, but partly boxer and kelpie) has been sleeping in a crate since we got her at 8 weeks old. She is HIGHLY anxious despite being on 2 medications and having worked with multiple trainers. The crate is a necessity for her to sleep well as she’s prone to pacing, barking, and not settling (again, despite SO many attempts to train), and when in the crate she settles well and sleeps through the night.\n\nHowever, she absolutely hates GOING to the crate. When we say ‘bedtime’ (her crate cue), she straight up refuses to get up from where she’s lying. We end up having to pick her up or guide her by the collar.\n\nShe is not particularly food motivated, and also doesn’t really care to please us, so I’m not sure how to train this. I worked for months when we got her by trying to feed her in the crate and give her treats when she went in etc. but it just didn’t make much difference. I’ve tried just leaving high value treats in there through the day for her to find, but it hasn’t done anything. Also, I always make sure to get her both physical and mental exercise throughout the day.\n\nHow can I get her to listen to us and go to her crate (and ideally enjoy doing so) without us having to drag her there? I feel like it’s not good for our bond.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "aerialison",
                    "body": "I’ve read the crate training guides and have already tried it all. She will go in the crate fine once she’s at the door of the room, but I want her to get up when we ask and actually WANT to go to the crate. How do I do that when she doesn’t care for treats?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Cauliflower_5461",
            "body": "Firstly, I would stop using any physical force to get her in the crate. Pulling her into the crate is stressful for her, and it's creating a negative association with the crate, thus making it more difficult to get her into the crate.\n\nIt's amazing that you're using treats randomly throughout the day- are you sure these are high-value treats to your pup? Dogs are the ones who decide what is reinforcing, not humans. Try giving her a variety of things and see what she likes best- Greek yogurt, peanut butter, scrambled eggs, carrots, berries, etc. Whatever she REALLY likes, use this! Continue tossing high value treats randomly to create a more positive association with the crate.\n\nNext, stop only getting her into the crate whenever it's bed time. This is likely why she doesn't want to go to begin with. \n\nDog doesn't like bed time, dog has learned she ONLY goes into the crate when it's bed time, dog now doesn't want to go into the crate. \n\nSo shake it up! Slowly, (very slowly, work at your dogs pace!) have her go into the crate, give her a stuffed Kong toy (fill it with peanut butter and toss it into the freezer beforehand so it lasts longer), leave her in there for 30 seconds to start, then let her out. Then build up to a minute, 2 minutes, 5 minutes, 10 minutes, half an hour, an hour, etc. Slowly slowly slowly! Allow her to realize the crate does not only mean 8 hours of alone time. It's stressful for her! Dogs are sequential thinkers and are fantastic at learning patterns. So break up the pattern! \n\nI hope this helps, and best of luck!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chocolate_gringo",
            "body": "You see your dog is not food motivated but I may challenge that you may not have yet found which food is her big motivator. But nonetheless your dog will have other motivation . Your job is to find out what motivates her. Maybe it's a ball maybe it's a stuffed animal maybe it's you. Whatever the case may be use that intermixed with some lower level motivators and then you begin the training. And it will help if you are very excited when training with her if you're just a stick in the mud she's not going to care as much or at all. But I would start outside her cage with the door shut and her by your side. Toss in the most high value treats that you have toss in the most motivated tug toy you have. And play into her with your emotions get her so jacked up about going in that crate that you think she might just explode. And right before she does you open the gate and let her in. But do not close her in quite yet. Rinse and repeat for a half dozen sessions. And then you're done for today's first step towards your dog wanting to be in her crate. \n\nRico",
            "score": 2,
            "replies": []
        }
    ]
}