{
    "title": "Chronic whining",
    "author": "Jezebelle22",
    "subreddit": "Dogtraining",
    "rank": 44,
    "score": 38,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 44,
    "url": "https://v.redd.it/lsdn6dpbhjie1",
    "id": "1in30w4",
    "selftext": "My dog does this low level whining constantly through the day. He’s been to the vet, we don’t believe it’s anything physical. He’s currently on 40mg of Prozac a day along with 100mg of trazadone twice a day - he’s a very anxious dog, super sound sensitive. \n\nAnyway. I’ve been trying to do things like the relaxation protocol, or waiting out his whining. I must not have done a good enough job paying attention to his signs because he learned to bring it down to this lower level. So now it’s really difficult to tell when he’s actually relaxed because he can give me the body signs he is, head down, laying down on one hip, and if there’s enough noise around (the tv, people talking etc.) I won’t necessarily hear him whining. \n\nSo I feel like I’ve reinforced this. And it makes training so stressful because I feel like I’m messing up every time. And if I just try to wait it out it can take literally over an hour of sitting waiting for him to stop whining. Which doesn’t feel beneficial because it’s not really tiring him out in any meaningful way to keep him calm for a while for me to get work done. And I feel like I’m never doing it right anyway. And this noise just grates on me so much partially because it’s annoying partially because every time I hear him whine I just think about how I’ve messed this up and just feel like an awful owner because he’s obviously not happy. \n\nAny help or tips would be appreciated. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Jezebelle22",
                    "body": "I have tried the relaxation protocol as well as kikopups capturing calm. My dog has been to the vet and we do not believe he is in any pain. We have really upped the amount of general training we do. Which he enjoys doing because he loves treats of any kind, to the point I’m not really sure how much he is learning because he’s so over excited to train. \n\nEven if my dog has been walked, has had a chew or a Kong, played he will default to this behavior when he is awake. He will nap through the day but the majority of the time he is awake he is whining. \n\nI am going to ask my vet to see if we should switch to gabapentin, maybe the trazadone is having an opposite effect.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "AdminsAreScum420",
                    "body": "Seems like a lot of good opinions in this thread with a lot of questions asked. But you don't seem to be responding? You don't mention what your physical routine is, you mention training, but now how far/often you walk him. You don't mention how much you exercise him. It really seems like he isn't getting enough stimulation. Maybe this dog requires too much exercise for you?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "the-hourglass-man",
            "body": "How often are you walking your dog?  \n\nI have a pit mix who requires a LOT of mental and physical stimulation, otherwise she cries exactly like this.  \n\nWe have been going insane because she is small (about 35lbs) and doesn't do well in the cold.  \n\nWhen the weather allows, I walk her for 20-40 mins/day, have an afternoon fetch session in the backyard, and go on a run/hike once a week or every few weeks. She will run until she literally collapses if I let her. Her behavior is directly tied to how much I exercise her.  \n\nWe had a warmer few days where we hiked for an hour and a half.. the snow was up to her shoulders so every step was a jump. She still had enough energy to zoom through the house when we got home.  \n\nMy girl isn't medicated (my vet and i decided against it) but has anxiety and all kinds of behavioral problems. The only time I saw her calm was after a 3 day backpacking trip where we hiked a total of 36km with lots of elevation. It was like having a whole new dog for 2ish weeks. They are animals made for movement, not to sit on a couch all day.",
            "score": 37,
            "replies": [
                {
                    "author": "looseleashdog",
                    "body": "This is also my dog. If he isn't getting enough bonding/mental stimulation with me then this is what he does.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "pinotage1972",
                    "body": "My 30lb requires two to three HOURS a day of walking, running, being off leash.   Or she will complain like this.   She's part Pit, Ozzie Shep, Chihuahua.   I take her to a 30acre park near me, she goes off leash - and just runs and runs and runs.   The only other times she whines is if she's hungry.   We tried moving her to one meal a day as she left her puppy years but eventually went back to the two smaller meals - because she was clearly uncomfortably hungry and just whining cause she was hungry.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "candyapplesugar",
                    "body": "The breed? I had always read pits were couch potatoes. Not trying to argue- I’m no expert, just curious",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PandaLoveBearNu",
                            "body": "LOL.  Pitbulls are terriers.  They are not bred to be couch potatoes.  They are a high prey drive, high energy breed. Can easily overwhelm inexperienced owners. Part if why tgey get dumped so much  Huskys are in the same boat.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "candyapplesugar",
                                    "body": "Interesting. My guy is crazy chill for a what I assume is a husky/pit mix and only 10 months old. Luckily great with our cats too",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PandaLoveBearNu",
                                            "body": "Sometimes they're drive doesn't come up till they hit maturity usually around 2 years old.  Which incidently also very very common age when you see them in rescues and shelters.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "the-hourglass-man",
                            "body": "My dog is a mutt of 13 different breeds, mostly small breeds of terriers, pomeranian, chihuahua, etc. She is predominantly pitbull at a whopping 25%, everything else being 1-10%.   \n\nWhile I've definitely met pitties that were couch potatoes, I've met pitties that were on the same energy level as a working line lab and are incredibly driven. I think it is very dog dependent. They were originally bred to have a job after all. An anxious dog is a bored dog, a tired dog is a happy dog.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "patienceyieldsfocus",
                            "body": "IMO, pitties are couch potatoes until the moment you tell them to be otherwise. Give them something they WANT to do and they'll outrun their own body.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "pinotage1972",
                                    "body": "I agree with this.   My Pit x sleeps until she runs and then goes back to sleep.  But she requires a lot of running and very strenuous exercise.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "whyohwhythis",
                            "body": "I have an ammstaff and she’s not very energetic and is mostly a couch potato. I walk her for anywhere from 10-20 minutes a day. She is really slow on walks, mainly just stops and sniffs everything. She has hip dysplasia, so she does tend to slow down towards end of walk and she tells me she’s had enough by walking me back to car. She’s not really into playing, running around. She likes to pull her plush toys apart and doesn’t mind a bit of tug of war.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aussydog",
            "body": "That's a lot of drugs bud.\n\nMy dog sounds like this when he wants something from me; either attention or outside to pee/poo. \n\nIf yours is doing it like this constantly and it isn't a pee/poo reason then I'm going to guess your pup is bored and in desperate need of stimulation.\n\nNow there's far better experts on here but I'll give you some advice from my own experience with cattle dogs and cattle dog crosses who do need that stimulation.\n\nSo here's what I'd tell you, while physical stim is good; mental stim is king. So you need to start playing mental games with your dog. \n\nEasiest way to start, especially if you're in a one dog household, is \"Seek/Find it\". Have your dog go in a sit/stay. Show your pup the treat then place the treat somewhere close and release with \"Seek\" encouraging them to find the treat. Gradually increase the distance and obscurity of where the treat is. Then the number of treats. Then the variety of treats. This turns the boring house into an exciting place where treats could be stashed anywhere. It allows the dog to use its natural hunting and smelling ability and since its a normal natural thing this is probably one of the easiest \"tricks\" you'll ever teach a dog.\n\n(for reference; I took my two pups to visit my mom. Did a sit/stay with my pups, my mom held her dog. Hid the treats around my mom's place and then did a \"seek\". Her dog immediately followed mine and with only that one rep, she already knew what seek was. The next time we did \"seek\" about 30mins later, she did just as well despite her size disadvantage)\n\n  \nAnother thing you can do thats dead on simple is not to feed your dog in a bowl but make it \"work\" for their entire meal. It sounds cruel but it isn't and dogs do love it. Basically turn feeding time into training time. Once you're done, finish with a real treat, and you'll probably find that your pup with curl up and go to sleep pretty soon after the whole event.\n\nThe benefit for this is it gets two things done at once. Both training and feeding. A secondary benefit is an increase in understanding between you and your dog. If yours is like mine, it whines when there is something amiss and its frustrated you're not understanding. There is a certain amount of excitement and enjoyment dogs, especially smart dogs, get from understanding what you want from them. \n\n  \nAnyways; those would be my simple suggestions that you can put into action right away without needing to put down any money at all.\n\nIf you're not sure what to do for training, if you're choosing the second thing i meantioned, just go to online resources on youtube for training ideas and tips. Kikopup is pretty good iirc [https://www.youtube.com/@kikopup](https://www.youtube.com/@kikopup)",
            "score": 25,
            "replies": []
        },
        {
            "author": "lilsassprincess",
            "body": "Please push your vet to do a thorough pain investigation. Posture/gait analysis, blood/urine tests, and possibly a trial of an NSAID (non-steriodal anti-inflammatory drug). There is a high likelihood that your dog is experiencing physical discomfort that is contributing to their difficulty relaxing. I know someone whose dog's behaviour was very similar to yours. Initial pain investigation found nothing, we proceeded with bmod, results weren't progressing at the rate we expected, so they started him on Prozac. The dog improved but still struggled. Second pain investigation showed a joint issue requiring surgery. The dog was under 2 years old and a small breed. Pain can be a factor regardless of age or breed.",
            "score": 6,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ilovecouchandchair",
            "body": "He’s in pain, anxious or bored. Does he get plenty of mental and physical exercise? You’ve ruled out pain first (unless you want to get a second opinion and consider more diagnostics ie. scans), which is exactly the right thing to do. Now it’s working out what it is.",
            "score": 7,
            "replies": []
        },
        {
            "author": "filmbum",
            "body": "Can you tell us more about his environment and exercise routine?",
            "score": 6,
            "replies": []
        },
        {
            "author": "Electrical-Art-1111",
            "body": "Dumb question, but do you play with him?",
            "score": 4,
            "replies": []
        },
        {
            "author": "majestic_landotter",
            "body": "Following as my pup does the same",
            "score": 2,
            "replies": []
        },
        {
            "author": "StrangerThingies",
            "body": "He may feel under a lot of pressure from you. Do you need to be doing any particular training with him? Why do you need to wait for him to stop whining? Does he follow you around the house and whine at you? I would make sure he’s been given enough exercise and then try an enrichment activity like a lick mat. Is he crate trained? He’s either bored or anxiously waiting for YOU to relax. I feel for you, this would grate my nerves big time.\n\nI want to add that he does actually appear relatively relaxed if not a little nervous about you filming him. This may just be a quirk and not some deep anxiety thing. In which case I would just get a couple noise machines.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Moki_Canyon",
            "body": "Are you SURE he's not in pain? The vet has scanned/x-rayed/blood work to make sure there's no medical problem? He looks, to me, like a dog in pain. Try a different vet.\n\nSwitch foods. Allergic or indigestion. \n\nToys? And a big beef bone. \n\nAnd I'm curious. Does this behavior change if he's around another dog?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Admirable-Heart6331",
            "body": "We call this the annoyed whining.  Usually a build up to a more vocal sound - a whimpering sigh or a howl.  Usually when she wants something or when she cannot settle.  Usually a belly rub or conditioned relaxation helps (I also have a pit on meds for her anxiety)\n\nAlso check out training between the ears - mine benefited from this since she started just laying and looking relaxed but in time she would just relax and moments later fall asleep....I would do this after a long walk so I know she was ready to settle.  \n\nAnd last of all - have you tried different med combos or Ellevet CBD?  The meds may be causing the problems settling and there are tons of options to try.",
            "score": 2,
            "replies": []
        },
        {
            "author": "123sjb",
            "body": "My pittie Jolene is also on behavior meds, shy/fearful and noise sensitive along with pretty strong stranger danger/territorially reactive.  When we were first exploring behave meds I was told that trazodone/prozac can cause serotonin syndrome, so I’d do a med-check with your vet.  My girl was on Prozac/gaba pentin and we added Clonidine which helped with noise sensitivity but made her extra whiny when there wasn’t something making her afraid. \n\nI recommend seeing a vet behaviorist if you can afford it and have one in your area.\n\nNow my girl whines when she wants something, and we go through the water, outside, food, fun checklist to make sure she has what she needs when she gets vocal.",
            "score": 2,
            "replies": []
        },
        {
            "author": "portablezombie",
            "body": "Not an expert, but that's a lot of drugs. I've got a 75 lb Pyrenees mix who is unintentionally destructive (rips up couches \"nesting\", destroys doorframes trying to get into closed rooms, etc) and he's on 100mg Trazadone once a day, at night to help take the edge off. It works pretty well. I was told that we could mix the Trazadone and Prozac with our other dog, who has panic attacks with thunder and fireworks, but I'm not particularly keen on that.\n\nMaybe talk to your vet about cutting back a bit and seeing how your dog does? My pit mix does the low level whine when she's bored or wants attention (and she always wants to be the center of attention.) Are you being active with the dog? Yours looks like a pit mix too, and they need a lot of stimulation - maybe a puzzle or snuffle toy to keep him occupied? Something to work that brain?",
            "score": 2,
            "replies": [
                {
                    "author": "filmbum",
                    "body": "That is a normal dosage of trazodone. Recommended is 2.5mg/lb every 8-24hrs. Your dog is just on a low dose.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "The decision to change a medication protocol must be made by the qualified veterinarian who has actually examined the dog and can see the full scope of the issue; your suggestion is highly inappropriate.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lalanikshin4144220",
            "body": "My dog whines when he wants something.  But I can always figure out what it is as he will show me-go by it or look at it when I ask.   He also needs a lot of play as he's a border colli/aussie shepherd. A lot of the whining is reminding me he wants me to throw his toy if I get distracted or take too long. Either that or he brings me every other toy to see if I prefer to throw one of those.  He also stares in a ready to go position until I throw it. I feel bad when I get distracted and realize he's been standing there staring for 30 min. Sometimes he will lay down but man I feel horrible..",
            "score": 1,
            "replies": []
        },
        {
            "author": "pinkybadinsky",
            "body": "Just wondering how old your dog is? My lurcher is super whiny as well,  and I've often wondered if there's some pit bull in his mix, he's a stocky boy who's smart and needs loads of mental and physical stimulation.\n\nMy boy's 4 this year and he is starting to mellow out a bit, but yeah I know first hand how annoying the whining is and I felt guilty and like it's my fault, the same as you.\n\nWhat we have done is ensure all his needs are met, food, walk, play, training, and when he's still whining after all that, we ignore. It can take a while, but forcing him to self soothe like this is working for us. It did take ages, though, and also, I had to train myself not to give in to him every time because I am a pushover when it comes to my dogs! Consistency and patience. If he's young, and this is not a medical issue in your case, hopefully, this helps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "junglepiehelmet",
            "body": "I have a dog who looks a lot like this and does the same. He’s bored. High energy dogs are tough but a lot of fun if you also have energy to deal. I walk my dog for like 1-2 hours a day and play fetch almost daily. Hikes are awesome as well but it’s winter so my dog is chilling more than normal. It gets better with time but my dude is 5 now and still does this sometimes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaltyDeSouffle",
            "body": "My dog starts whining when we get back from his walk and I have to tell him to go to \"bed\" so I can make a cup of coffee and make some lunch in peace then I get him out of his bed and we spend some time together. That instruction to go to bed lets him swtich off and he relaxes. Maybe this would help?",
            "score": 1,
            "replies": []
        },
        {
            "author": "plasticketchup",
            "body": "Is there some reason you don’t just literally ignore it for a week? Stop all relaxation training",
            "score": 0,
            "replies": []
        },
        {
            "author": "lynvan77",
            "body": "Needs another pet around",
            "score": 0,
            "replies": []
        }
    ]
}