{
    "title": "Resident Dog Policing New Rescue",
    "author": "lookingisfree",
    "subreddit": "Dogtraining",
    "rank": 23,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ip9s2z/resident_dog_policing_new_rescue/",
    "id": "1ip9s2z",
    "selftext": "Hello everyone, we recently (as in, in the last couple of weeks) adopted a gorgeous 2 year old rescue into our home with a 5 year old labrador. Our resident dog was a lockdown pup and as such sometimes has socialisation blindspots, but has been other dogs hundreds of times and loves staying at the doggy day care and playing with her friends, she's just never had another dog in her space.\n\n  \nThe rescue is very shy and timid, but we're managing to get her out of her shell in most ways. The biggest thing we need help with is she is unable to move, walk, sniff without our resident dog coming over to her and getting up in her face - its not *scaring* her persay as it is just making it less appealing for her to come out from her safe space. She's made herself a safe spot on the landing of the stairs, but the minute her paws come to the hardwood floors our lab comes over to her to police her.\n\n\n\nHow can we train this so it happens a bit less in *actionable* ways? I'm concerned that in the longer run the rescue is just going to get scared of moving or doing anything without the resident bothering her. We're doing some anti-resource guarding stuff with regards to attention and food/water, and they both get time alone and in the same room, its just the braver the rescue gets the more policing the lab gets.  \n  \nThanks everyone <3  ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "All posts require review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "lookingisfree",
                    "body": "This is specific issue of an older dog not being overtly aggressive but relatively intimidating to a rescue who isn't responding back. I cannot find specific help on the wiki",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}