{
    "title": "Unfixable dog?",
    "author": "Low-Vermicelli1201",
    "subreddit": "Dogtraining",
    "rank": 8,
    "score": 5,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1iq3tii/unfixable_dog/",
    "id": "1iq3tii",
    "selftext": "I have a 10m/o cardigan corgi pup. He is a lovely boy and we used to have a great bond, but I and my family are away from home on weekdays from 7/8-4:00 at the earliest. I sometimes have 12hr days and cannot walk or really interact with him, but because I asked for the pup, my family insists that he is my responsibility even on these days. I love this dog so much and will never even consider giving him away, but my family is constantly trying to convince me to. He's become destructive when home alone, and won't leave my older (10yo) dog alone. What are some ways I can stimulate him when home alone? I give him puzzle feeders before I leave, and if I'm home before 9 I almost always walk him. I've also tried to send him to doggy daycare but he's not been neutered yet so he can't go. What can I do to fix this, because my family is seriously considering giving him up.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "All posts require review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Low-Vermicelli1201",
                    "body": "I have tried to train him out of destructiveness, we do have an older dog who is an absolute angel and never disobeys, however with toys he eats (not chews) EVERYTHING. Even rubber bones or hard nylabones. He also avoids these bad behaviors when I am home with him, it only happens when me and my family leave for the day.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}