{
    "title": "Inconsistent Belgian Malinois behavior after moving",
    "author": "MissBenzadrine",
    "subreddit": "Dogtraining",
    "rank": 12,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1iq3fys/inconsistent_belgian_malinois_behavior_after/",
    "id": "1iq3fys",
    "selftext": "Hey everybody i have a female Malionis that is around 2 years old. I bought her and she spent the first year of her life in Serbia near a big park with a lot of different dogs nearby. She always played and had no problem interacting with other dogs no matter the size or bread ( she regularly played with dogs froma a Cane Corso to a jack russel).\nSo last year i moved to Hamburg Germany (with her obviously) and there is quite a big difference here as there are a lot less dogs here and most of them are from shelters and not quite well behaved. But the park here is much bigger and i play with her a lot more as i have more time and space. Since moving here her behavior at home has actually really improved she has never had any incidents (back home she had a few instances of eating shoes cables and unattended food but she was a puppy and we were still training so nothing major).\nThe problem is that sometimes (~30% of the time) she can start to bark at other dogs and its usually the small ones,but she doesn’t lunge she doesn’t scrunch her snout and she keeps wagging her tail so its really confusing as if she’s initiating play. Most of the time she basically ignores all others people and animals and only pays attention to the person walking her no matter how close far the other dog is or what it’s doing. Everything is fine every day for a month and that bam one day i have to grab her or remove from a situation because she barks once or twice the other dog doesn’t like that and starts barking and that continues.\nI think she only properly played with a dog once  since we got here, so Idk what to do it’s nothing too serious but i don’t want her to develop real reactivity to other dogs since she isn’t a problematic dog.\n\nSorry for the long and poorly worded post English isn’t my first language \nAny tips or ideas or suggestions would be greatly appreciated as i really love her and want her to have the best life possible ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "All posts require review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "MissBenzadrine",
                    "body": "Dog has been to the Vet and everything is fine",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}