{
    "title": "Dusk Slayer, ultimate phys axe",
    "author": "Far-Wallaby689",
    "subreddit": "pathofexile",
    "rank": 15,
    "score": 290,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 68,
    "url": "https://i.redd.it/7kmkkn5f5ape1.png",
    "id": "1jdhgty",
    "selftext": "",
    "comments": [
        {
            "author": "kilqax",
            "body": "1500+ max hit with culling strike, what the fuck",
            "score": 56,
            "replies": []
        },
        {
            "author": "Far-Wallaby689",
            "body": "Few days ago I posted the exact same craft but wasn't fully satisfied that it was on 20% base, so I decided to delete the post and do it properly on a 30% base. I ran out of upgrades on my build so decided to pour everything in the ultimate weapon.\n\n\n\nCrafting steps:\n\n1. Acquire 30% bases iLvl83+\n\n2. 3 way split using Black Morrigan\n\n3. Apply cheapest conqueror exalt and reroll to elder influence on harvest\n\n4. Alteration spam looking for any of the mods - I later used harvest reforge physical after not hitting a single T1 hybrid after 5k+ alts\n\n5. Recombine prefix with prefix\\* and suffix with suffix to make 2p and 2s rare items\n\n\t\\*When recombining T1 %increased phys and %increased phys/accuracy I made them rare and crafted multimod + exclusive modifiers to increase the odds\n\n6. Craft multimod and fill with exclusive modifiers, recombine into 2p/2s item\n\n7. Prepare another 2p rare item with the missing prefix\n\n8. Multimod the 2p and 2p/2s items, craft exclusive modifiers, recombine - in hindsight, I should've divined the prefixes at this stage but I simply forgot\n\n\ta. You win and the craft is done\n\n\tb. You end up with 2p/2s item, in which case repeat from 7.\n\n\tc. You end up with 1p/2s item, if this happens make another 2p/2s, multimod & craft exclusive mods, recombine\n\n9. Divine prefixes until you're satisfied, then prefixes cannot be changed and divine the suffixes\n\n10. Tempering orb to roll the implicit, I was going to stop at either 10% increased physical or 15% increased physical & 3 sockets.\n\n11. Socket, link, finish with crafted mod\n\n\n\nOverall cost was around 200-250 divines, of which \\~40 I've spent on bases, splits and influence, \\~20 on alts & yellow juice, \\~70 on multimods(bad RNG I think it took more attempts than it should on average), \\~40 on diving, \\~20 on white sockets(completely unnecessary but it looks nice).\n\nSomething around \\~100div I wasted on tempering orbs, I was getting very unlucky and it took almost 200 to hit one of the enchants I wanted. I  think I got incredibly unlucky with tempering orbs, it took way more than I expected to hit the enchant I wanted.\n\nThis is by far the best item I have ever made in PoE, my friends are saying I should put it up for mirror service but I doubt anyone would be interested because Earthshatter is not very popular in Phrecia and it can be crafted for less than a mirror anyway.",
            "score": 63,
            "replies": [
                {
                    "author": "whatisagoodnamefort",
                    "body": "Getting a 5 affix from recombine is something in the 20-30%, I’ve had 5-6 fail. Not sure how many you had but I think you may have moreso been lucky with your previous craft\n\nAlso how much could ya bump that damage up if you div’d up the flat damage? It’s probably not a whole lot but could be worth it if you have the extra money. Otherwise is an awesome looking axe!",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Initial-Pudding7892",
                            "body": "hell i missed 11 straight recombs jsut to get a T1 flat/hybrid onto the same damn item\n\nthis dudes RNG is insane, i cant imagine the amount of clicking and currency this cost",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Far-Wallaby689",
                                    "body": "Were you recombing them as blue items? If you did that's only 1 in 3 to hit.\n\nWhat I did was make them rare(by rolling reforge phys on harvest then annuling down to 1 mod), then do the usual recomb procedure with multimod and exlusive mods. That way the chance of success goes just over 50%.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "grogo-",
                                            "body": "I thought rarity of the item doesnt change odds at all. And only impacts the cost in dust and gold.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Far-Wallaby689",
                                                    "body": "The rarity itself doesn't, but making it rare allows me to craft 3 mods on it, which with the right mods can be used to increase the odds. You can only benchcraft 1 mod on a magic item.",
                                                    "score": 12,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CelosPOE",
                            "body": "I thought getting a 5 affixes is like 72% if both items have 6 affixes each. I’ve been failing at 5 affixes claws all league. I gave up because my damage is fine and I’m tired of collecting bases.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Far-Wallaby689",
                                    "body": "It's way less than 72% to hit exactly what you want. 72% is the chance to have 3 prefixes(or 3 suffixes) when having a total of 6 prefixes or suffixes in the pool. But one of those 3 mods could also be a crafted mod, so the chances of actual success are lower.\n\nThen you have to apply the same logic to suffixes, from what I've read and watched about recombs, the chance of actually hitting 5 desired mods is in the ballpark of 30%.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "CelosPOE",
                                            "body": "That’s what I mean. I always establish whether I want a crafted prefix or suffix the try to get as few crafted affixes in the pool as possible while ensuring I have six affixes in the pool so that I end up with a six mod item with one being crafted.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Far-Wallaby689",
                            "body": "I failed 2p + 2p/2s twice, first time it basically deleted the 2p item and 2nd time it came out as 1p/2s. I made another 2p/2s, recombined it with 1p/2s and hit that way first time. I think the final part was reasonably lucky, it was the smaller recombs where I lost a lot of divs. I was multimodding 1p + 1p items just because the phys mods are such low weights, at one point I failed 1p+1p 4 times in a row even though it's something over 50% chance to succeed.\n\nIf my math is correct at 100% perfect divine it would go to just over 1700pDPS, so about 3% more than it is currently.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "turkeyandpesto",
                                    "body": "> I was multimodding 1p + 1p items just because the phys mods are such low weights\n\nIs there any guidance on exactly how the weighting of mods impacts the chances of recombination success? I haven't seen anything concrete out there. I had initially thought mod weighting doesn't impact recombination?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Far-Wallaby689",
                                            "body": "As far as I know the weightings themselves aren’t very significant, the reason I did this is because the chance to succesfully recombine two blue items is 1 in 3. I didn’t want to take these chances because the phys mods take over 1k alts on average to hit and I’ve spent hours rolling them.\n\nDue to how recombinator works, if I craft „can have up to 3 crafted modifiers” and then craft two exclusive prefixes, my chances of success go up by a lot.\n\nThis entire craft I based on this video: https://youtu.be/ily5sDzQIAE?si=1FhqUqcPOd8wBC1W\n\nAround 25min he starts talking about recombining two 1 mod items.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "turkeyandpesto",
                                                    "body": "Ah, got it. You meant the weighting is low for alt rolling purposes and so multi modding just saves time/hassle by increasing the odds of recomb success. Makes sense.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Starwind13",
                            "body": "Can attest to that 20%-30%. Took me five tries in settler's league and four tries in phrecia's league",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CelosPOE",
                    "body": "I played earthshatter as my SSF league starter in settlers. It was the smoothest experience I’ve ever had until bossing.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Far-Wallaby689",
                            "body": "Ancestral Commander feels like the perfect ascendancy for Earthshatter, wish we could keep him instead of Jugg tbh",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "SoulofArtoria",
                                    "body": "Will be private league at least ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "coldkiller9696",
                    "body": "It's prob not better than a synth base, but is put it up for service anyways. Nothing to lose, just make a form post so you can use it while its posted.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "DeeJudanne",
                    "body": "i mean it doesnt hurt if you try to put it up for mirror service",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Irrelevant_User",
                    "body": "8c is not possible unless I'm not understanding something?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Far-Wallaby689",
                            "body": "With 6 prefixes in the pool it's 72% to get 3 prefixes and 28% chance to get 2 prefixes. If it hits the 28% then it can pick one desired mod and one crafted mod which is effectively 1p.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Irrelevant_User",
                                    "body": "Oh I see. You were referencing the desired mod outcome",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheFuzzyFurry",
                    "body": "And you got an awesome name! Dusk Slayer... something straight out of an anime.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ghepip",
                    "body": "This works for more then just earth shatter!\nIt's amazing on volcanic fissure of snaking if you don't wanna go mace.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "habar414",
                    "body": "?!? There's a harvest craft to reroll item influence?!\n\nHoly shit I wasted 6div on using an awakener's orb to make an elder psychotic axe. zzzzzz\n\nWell, now I know haha. Thanks for sharing your process mate.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Visible_Adeptness_59",
                    "body": "if only i have the mirror my friend\nif only ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SirCorrupt",
            "body": "Enough phys damage? Jesus lmao",
            "score": 19,
            "replies": []
        },
        {
            "author": "tFlydr",
            "body": "Excuse me what the fuck?",
            "score": 24,
            "replies": []
        },
        {
            "author": "Initial-Pudding7892",
            "body": "what in the fuck is this monstrosity",
            "score": 15,
            "replies": [
                {
                    "author": "PhraseSpiritual6094",
                    "body": "Viable.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AznKian",
            "body": "1662 pdps",
            "score": 10,
            "replies": [
                {
                    "author": "Far-Wallaby689",
                    "body": "Shows as 1.33APS 1650.5pDPS in PoB, it's probably something to do with rounding the attacks per second.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "AznKian",
                            "body": "Makes sense. I just tossed it into calculator with the numbers on screen.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Trushdale",
            "body": "Undisputed best axe in the game https://youtu.be/XXo1-CQ37-Q?feature=shared&t=142\n\nwatch for 6 seconds :D",
            "score": 6,
            "replies": [
                {
                    "author": "Blury1",
                    "body": "That was 7 years ago? Damn",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Trushdale",
                            "body": "damn",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brejkkalu",
            "body": "I see an angke where you could divine it up for that 0.1% phys increase.",
            "score": 8,
            "replies": []
        },
        {
            "author": "CrustyToeLover",
            "body": "Can you really call it the ultimate phys axe with those sub-par rolls?  Get that extra 2%, chad, get the 1600 max",
            "score": 6,
            "replies": []
        },
        {
            "author": "HerroPhish",
            "body": "Honestly I’ve never seen a 1500 physical roll.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zranju",
            "body": "Hey it's my axe\n\n...in PoB\n\nGz, OP!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Legal_Lettuce6233",
            "body": "Pff doesn't have the warlord Phys suffix mod, vendor.",
            "score": 2,
            "replies": [
                {
                    "author": "psychomap",
                    "body": "So with that mod and perfectly divined, this would be 1021-1669 damage if I calculated correctly.\n\nThere are technically also the 15% increased effect enchantments, but I didn't check those.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mlohavi",
            "body": "Im in process of making a claw with triple t1 ele. I have 1 claw with 4 mods i want (2p 2s), and making another 4 base feeder. Will craft multimod and 1 exclussive prefix. What are the chances of hiting 3p in that case?",
            "score": 2,
            "replies": [
                {
                    "author": "Far-Wallaby689",
                    "body": "I don't know the exact math but from what I know about recombs and my personal experiences it's something in the ballpark of 35%.\n\nThis entire craft was basically based on this video: [https://www.youtube.com/watch?v=ily5sDzQIAE](https://www.youtube.com/watch?v=ily5sDzQIAE)\n\nHe's showing it on a chest, but it follows the exact same logic for any 3p/2s item.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mlohavi",
                            "body": "To just keep 3 prefixes from 2 6 mod items? I mean im in ssf and grinding for alts is pain in the ass",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Far-Wallaby689",
                                    "body": "I recommend the entire vid I just edited into my previous comment, at around 18 minute mark he explains the possible outcomes and odds when recombinating 2p/2s + 2p items.\n\nIt can be a pain in the ass and I can't imagine doing this in SSF, the only reason I attempted this is because I farmed up a ton of divines and bought everything I needed.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ENSASKE",
            "body": "That's my favorite axe, it reminds me of \"get to the choppa\" haha",
            "score": 2,
            "replies": []
        },
        {
            "author": "dizijinwu",
            "body": "What is that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blunt_break",
            "body": "Question can it still be enchanted ? And I would mirror this if I had a mirror still working on that atm 😘 earthshatter is my only build currently but I'm lvl 94 having a good ole time",
            "score": 1,
            "replies": [
                {
                    "author": "Eymou",
                    "body": "no, the tempering orb mods are enchants too",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MakataDoji",
                    "body": "There are a handful of ways to get an enchantment on an item: harvest, heist currency, runeforge, etc. but every one is an enchantment and barring specific edge cases, an item is only ever going to have 1 enchantment on it at a time. You can take this item to the runeforge and apply one, but it will take away the one there.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jjohnp",
            "body": "What build are you using this on?",
            "score": 1,
            "replies": [
                {
                    "author": "Far-Wallaby689",
                    "body": "Ancestral Commander Earthshatter",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jjohnp",
                            "body": "Is the hybrid phys here better than the Endurance charge on slam support mod? That one is pretty easy to get onto a 4 mod axe",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Far-Wallaby689",
                                    "body": "Endurance charge support mod was like 8-10% more damage but 7 linking Earthshatter would nearly double my mana cost. It would be too much hassle to figure out a way to reduce the mana cost so I went with this.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "G2Keen",
            "body": "I remember crafting an axe years ago and felt great about it. This thing makes it look like a piece of junk.",
            "score": 1,
            "replies": []
        },
        {
            "author": "livid69",
            "body": "Holy shit this things a beast!!!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hullunmylly",
            "body": "Shock ground rune enchant is better on my pob. Might wanna check that out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chubacca80",
            "body": "I read this as Duck Slayer, and immediately became more interested. lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zihilism",
            "body": "Penultimate*\n\nCuz your prefixes are all one off perfection lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "xMcSilent",
            "body": "It feels like you want to provocate us.  \n1 off max flat phys  \n1% off inc phys  \n1% off hybrid inc phys\n\nWhy would you do this to us",
            "score": 1,
            "replies": []
        },
        {
            "author": "RangePossible8069",
            "body": "I'm going to miss recoub",
            "score": 1,
            "replies": []
        },
        {
            "author": "Behdjed98",
            "body": "Higher dps in axe than in my whole build when I finish acts",
            "score": 1,
            "replies": []
        },
        {
            "author": "_NekoBeko_",
            "body": "UNDISPUTED",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Thanks for sharing your crafted item! This is a reminder to include the story of how (and optionally, why) you made the item; otherwise, we may have to remove your post. See our [Rule 10](https://www.reddit.com/r/pathofexile/wiki/rules/#wiki_10a._crafting_showcases) for more details and some potential questions to answer. If you've already done that, thank you! You can ignore this message in that case.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pathofexile) if you have any questions or concerns.*",
            "score": -1,
            "replies": []
        }
    ]
}