{
    "title": "Weekly VR - What Did you Play?",
    "author": "AutoModerator",
    "subreddit": "virtualreality",
    "rank": 0,
    "score": 9,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/virtualreality/comments/1jba5pw/weekly_vr_what_did_you_play/",
    "id": "1jba5pw",
    "selftext": "Hey r/virtualreality!\n\nAnother week in the VR space.\n\nDid a certain game or experience stand out to you? This is your spot to chat, share, and discover.\n\nWhen sharing, you might consider sharing:\n\n**Name** of the game or experience.\n\nA brief **insight** or **overview**.\n\nYour **personal rating** and a bit about why.\n\n*Example*: I got hooked on \\[Game Name\\]. It offers \\[Brief Description\\], and I've been having a blast! Rating it 8/10 mainly because \\[Reason\\].\n\nSo, what's been captivating you or challenging you in the VR world lately?",
    "comments": [
        {
            "author": "No_Opportunity_8965",
            "body": " I cranked up all the settings in Elite: Dangerous. I have not played it since I used the Q1, and it was a mess to just set it up. Now with Q3 it is a different looking game. I can finally put my HOSAS to use (Only VR game i know of that can use dual-sticks). It is an old game but looks incredible.",
            "score": 3,
            "replies": []
        },
        {
            "author": "thegimboid",
            "body": "I've become addicted to In Death Unchained.  \nMy only gripe with it at all is that it's a little dull to look at - everything's just kinda shades of grey and brown. I'd love to have a similar game but with a more exciting visual landscape. \n\nOtherwise it's absolutely amazing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TommyVR373",
            "body": "All I played this week was Golf+. It's a really good game, but the content is very lacking unless you buy a ton of courses. I'm used to having hundreds of courses in The Golf Club, but with lesser physics. I'd give Golf+ a 7/10.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bh-alienux",
            "body": "I've been playing Arizona Sunshine 2, and I'm about 3/4 of the way through.\n\nI'm enjoying it, for the most part, as much as I enjoyed the original game, which I played about 6 or 7 years ago. My one big gripe is that reloading is terrible, and doesn't work half the time, even when using the Quick Reload setting. It's frustrating being in a big swarm of zombies who are chasing you in a limited amount of space, and trying desperately to run while trying to reload, but it just won't work.\n\nAside from that, I'm really enjoying the game, though. I think the 1st was more enjoyable b/c the reload issue was non-existent, but otherwise, it has a very similar feel. Oh, I do like having Buddy be able to attack enemies and help you save ammo. That has been a fun upgrade from the first game.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sciencebitchs",
            "body": "Finished Echo 1, started Echo 2. Purchased the big PC hitters on sale. Got Skyrim VR installed and mod and messed with that a bit. Never played Skyrim at all before. It's going to be great!",
            "score": 2,
            "replies": []
        },
        {
            "author": "t3stdummi",
            "body": "Just beat Alien, on PSVR2, and it was a top-tier experience.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LunchFlat6515",
            "body": "Actually.. Crysis VR. Haha.\nBut needs a top class HW.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TwinStickDad",
            "body": "Skyrim VR. With the FUS RO modpack. It's a totally different experience than the flat game. I'm more cautious, everything feels so much more threatening, and casting magic is wildly more satisfying ",
            "score": 2,
            "replies": [
                {
                    "author": "Sciencebitchs",
                    "body": "This is me. I'm still trying to figure out the best looking settings for the 5070Ti wireless to the Q3 or wired to the PSVR2. I got it pretty good but I've been reading about DLSS4 being able to be enabled and really crimping things up. Haven't gone thru that yet.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Orowam",
                    "body": "I have it but just couldn’t get into it for some reason. Maybe it was the way I was trying to play. I’ve never done a stealth archer build before. That seems like it would add a lot of challenge compared to mage blasting everything to oblivion and back haha",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fath0m",
            "body": "Exfilzone , vail ,zero caliber ,golf+",
            "score": 1,
            "replies": []
        },
        {
            "author": "IveyTheHockeyWitch",
            "body": "Medal of Honor: Above and Beyond it’s not perfect but I’m definitely enjoying it when I need a break from paper",
            "score": 1,
            "replies": []
        },
        {
            "author": "sandermand",
            "body": "I got my PSvr2 this week and put it through the Alyx Zheptics mod and my goodness....i have missed OLED so much...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chronomize",
            "body": "I played a couple Luke Ross modded games. Cyberpunk 2077 and Red Dead Redemption II. Cyberpunk runs pretty well, and I rate it a 8/10. The RDRII mod hasn't been updated for literal years, so it has horrible performance and is really finicky to get it to work at all, so I rate it a 5/10 (when it works it's fun)\n\n\nEdit: I also finished Boneworks. Has to be one of my favourite VR games, but I can't say I'm a fan of getting launched backwards off of things after jumping to them and catching with my arms. 9/10",
            "score": 1,
            "replies": []
        },
        {
            "author": "chunkymonke589",
            "body": "Resident Evil 2 VR With my new RX 9070 Xt. Absolutely loving. Game is scary as shit, got jumpscared more than 10 times and im still at the beginning!",
            "score": 1,
            "replies": []
        },
        {
            "author": "RelevantMetaUsername",
            "body": "Well, I was going to play some MSFS2024 until the most recent update from Meta completely broke PCVR on my quest 3. So I won’t be playing anything until they fix it :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "TommyVR373",
            "body": "All I played this week was Golf+. It's a really good game, but the content is very lacking unless you buy a ton of courses. I'm used to having hundreds of courses in The Golf Club, but with lesser physics. I'd give Golf+ a 7/10.",
            "score": 1,
            "replies": [
                {
                    "author": "upvote_or_get_AIDS",
                    "body": "They have a membership which unlocks all the courses even future releases. If you play enough the $9 subscription is worth it.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}