{
    "title": "Surgical chair",
    "author": "agertagehsa",
    "subreddit": "BeAmazed",
    "rank": 12,
    "score": 462,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 12,
    "url": "https://v.redd.it/dic93v70yfpe1",
    "id": "1je3ndm",
    "selftext": "",
    "comments": [
        {
            "author": "qualityvote2",
            "body": "Welcome to, I bet you will r/BeAmazed !\n\n---\n**Upvote** this comment if you found the above post amazing in a positive way otherwise **Downvote** this comment. This will help us determine whether to allow this post or not.   \n***\n\nMod Note:\n>If you know the Content Creator / Artist / Source of this post, then it would mean a lot if you can credit them in the comment section.        \n   \n>Subreddit Rules TL;DR - No War, Politics, Porn, Gore or Misleading Content.       \n      \n>Thanks for taking time and reading this.    \nI hope you find something amazing in this subreddit today ♡\n\n>Regards,      \nCreator of r/BeAmazed",
            "score": 1,
            "replies": []
        },
        {
            "author": "DirtiestOFsanchez",
            "body": "Maintenance man here, I got me a set for doing my jib (repairing commercial kitchen equipment and plumbing fixtures) I love my set. They work phenomenally! I paid like 70 bucks on amazon",
            "score": 10,
            "replies": [
                {
                    "author": "Mrlin705",
                    "body": "Someone one of the other million times this has been reposted looked up these specific ones and I think they were like $5-6k",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DirtiestOFsanchez",
                            "body": "I found a pair for 70 bucks last year on amazon. Obviously not for the medical field buy do the job. Anything in the medical field will be expensive.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mrlin705",
                                    "body": "I know. Wasn't meant to detract from your statement.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "zehamberglar",
            "body": "Fucking Gabe.",
            "score": 8,
            "replies": []
        },
        {
            "author": "dcoconutnut",
            "body": "I wanna buy one for when I’m cooking.",
            "score": 2,
            "replies": []
        },
        {
            "author": "peawolffan",
            "body": "Didn't know these actually existed, makes that guy in Jury Duty seem slightly less insane now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Captainfunzis",
            "body": "Man I need them",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sc0ttiShDUdE",
            "body": "what’s wrong with a stool  ?",
            "score": 1,
            "replies": [
                {
                    "author": "Mrlin705",
                    "body": "Generally frowned upon to grab a stool, then put your hands back INSIDE someone.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sc0ttiShDUdE",
                            "body": "A stool on wheels that you can move with your feet?  \nA stool that just sits 2 meters away from where you work?  \nA stool that is sanitized like everything else, including the stool in this picture ?  \n\nI just couldn’t be bothered having this strapped to my legs for hours on end.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}