{
    "title": "It's 2025. What's your favorite module or method for converting xml to json and vice versa?",
    "author": "melvin_poindexter",
    "subreddit": "learnpython",
    "rank": 6,
    "score": 3,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/learnpython/comments/1jef0pp/its_2025_whats_your_favorite_module_or_method_for/",
    "id": "1jef0pp",
    "selftext": "I've got some legacy APIs that simply cannot do anything but XML, but I need to work with them and I don't like XML. \n\nWhat's the best method these days for converting XML to JSON, and JSON to XML? \n\n Idk if there's a standard method, or everybody goes by preference, or what have you",
    "comments": [
        {
            "author": "a-rich",
            "body": "I hate working with XML.\nI recently had to parse some responses from namecheap and just used ElementTree (xml.etree.ElementTree).\nI didn't find any recent XML to JSON modules, and my need was minimal, so just stuck to ET. \nI would hate to have to work with XML regularly!",
            "score": 3,
            "replies": [
                {
                    "author": "melvin_poindexter",
                    "body": "Yeah, it's so bad. \n\nIt's Cisco things. I don't work for Cisco so I don't mind saying it.\n\nCisco. Get your act together.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "worldtest2k",
                            "body": "If they did get their act together then someone else would complain that they don't support YAML.\nThen by the time they roll out support for XML, JSON and YAML, a different new format will be popular, 😂",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "panatale1",
            "body": "BeautifulSoup. You can read it in, iterate over tags, and convert to JSON that way",
            "score": 1,
            "replies": []
        },
        {
            "author": "baghiq",
            "body": "I did a lot of XML work years ago, and since most of the XML I get are well defined, so I run XSLT to transform the data into anything I want, including JSON.",
            "score": 1,
            "replies": []
        }
    ]
}