{
    "title": "Not Previously Posted New Updates: My husband has ruined both our lives by asking me to double up his lunch serving for work.",
    "author": "LucyAriaRose",
    "subreddit": "BestofRedditorUpdates",
    "rank": 14,
    "score": 8143,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 533,
    "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1jd4r7k/not_previously_posted_new_updates_my_husband_has/",
    "id": "1jd4r7k",
    "selftext": "**I am still NOT the Original Poster. That is** [Empty\\_Researcher\\_348](https://www.reddit.com/user/Empty_Researcher_348/)**.** She posted in r/TrueOffMyChest, r/legaladvice and her own page.\n\nPrevious BORU [here](https://www.reddit.com/r/BestofRedditorUpdates/comments/17x7jjf/my_husband_has_ruined_both_our_lives_by_asking_me/). **New updates to the sub marked with \\*\\*\\*\\*\\***. Thanks to u/Dazzling_Past1141 who commented on the OG BORU to remind me to check for updates!\n\n# Do NOT comment on Original Posts. This is a fairly long post.\n\n**Trigger Warning:** >!std; infidelity; harassment; stalking; vandalism; !<\n\n**Mood Spoiler:** >!sad and frustrating; OOP will be ok!<\n\n**Original** [Post](https://www.reddit.com/r/TrueOffMyChest/comments/17ek3ex/my_husband_has_ruined_both_our_lives_by_asking_me/)**: October 23, 2023 (deleted by mods of TOMC, preserved on OOP's page)**\n\nMy husband has ruined both our lives by asking me to double up his lunch serving for work.\n\nI’m on a throw away because I still haven’t fully decided on divorce but I’m 95% sure on it. Me f26 and My husband m25 and I have been married for almost two years and have a 6month old baby.\n\nI work part time only to supplement our income and to pay for the legal process of getting him documented. We are very fortunate that it seems it may be an easy process of maybe 2 years max for his residency but now I’m going to cancel everything and ask for a divorce.\n\nMy routine used to be I wake up 1.5hours before him in the morning and make him lunch and pack everything for him for work and have his breakfast coffee and clothes ready for him to wake up, eat get dressed and head out with in 30mins.\n\nHe used to be satisfied with what I packed him of freshly made chicken in either honey buffalo, lemon pepper and salad or some sort of chicken wraps ect. Pure healthy food. I did this because I wanted to make his life easier and show him I cared and love him and I’ve done this since we first moved in together more then 3 years ago.\n\nWell recently I’ve had to start including dinner leftovers because he started asking for more food that he was still hungry afterwords, which I thought it was odd because no matter if I work or not he always comes homes to prepared food so even if he wasn’t full he would be okay. But I explained it off with maybe he’s bulking or something.\n\nSo I started including what I normally take to work which has caused me to either go without lunch and having to wait til after work or be late for work because I have to wait till the food is ready and take some because I’m breastfeeding and can’t miss eating every time(I’ll leave food going such as in a crockpot or low heat depending how long after I leave he gets home) Well last week when I was packing his lunch I found a unrecognized second fork in his lunchbox and was thrown off so I asked and he said he found it in the kitchen of his work and brought it home. (Odd why didn’t he just leave it?) I had noticed small changes in him that I gaslighted myself into I’m being insecure because I just had a baby but this made the pit of my stomach churn.\n\nSo a few days later I decided to go to his work during lunch to “surprise him” with dessert 🍮 and for him to see the baby. Well that was when I found out why he wanted more food. His coworker he told me no longer worked there, who I’d caught him talking too friendly to and I told him it bothered me and I had him remove from everything and block on whatsapp not only still worked there but was eating the lunch I freshly prepared for HIM and he was eating the leftovers.\n\nI didn’t cause a scene instead took pictures and added to my folder of everything he’s done before from simple hearting other girls stories after telling me he didn’t to naked pictures of a coworker from a previous job he got fired from because of her.\n\nI drove home crying to packed my things when I got home I took the bassinet and anything I’d need for the baby and my essentials and went to my sisters and BILs and told them everything and even showed him our conversations from WhatsApp where he told me she no longer worked there.\n\nI normally text him through the day so he started texting me and calling me to see if I was okay and what was for dinner? He was almost off is everything okay? And then he got to the house a hour earlier than usual (which also has me question if he’s been lying about what time he gets off too) and saw mine and the babies things gone. And my letter that he had 7 days to leave my house (my mom gave it to me when I was 20) and that he can communicate with my mother to see the baby when I’m at work or whenever he wants to see her just let her know and I’ll drop off the baby with her. I for the time being don’t want anything to do with him. And I left the printed fotos of them eating lunch laughing together under the letter.\n\nLater that night when I decided I no longer wanted anything to do with him I informed the lawyer (we had a group WhatsApp chat with me him, the lawyer, paralegal and my BIL (our cosponser)) that I no longer was going to need his services. And then messaged the lawyer privately to ask if I could maybe move our contract and the money I’ve paid so far over to his divorce and family practice. He said unfortunately no there’s some clause or something that if we decide to no longer pursue the case we lose the money we’ve invested and also that his immigration practice is a partnership with different people then his family one. But he will just leave our case open till we get a response for our next appointment from the government and if we haven’t worked things out by then, then he will cancel everything.\n\nWell this cause him to go insane because now if he doesn’t get papers he has to choose between his daughter and parents. To either risk never seeing his parents and family again or never seeing his daughter again if he goes over there. He’s begging me to the point I blocked him on everything, he’s came to my BIL house and been told to leave or we are calling police then he later came back drunk with his buddies who then were all scared off by my BIL and his shotgun. I feel so lost, broken and depressed. I also have security at work to make sure he doesn’t show up at my office. My sister tells me to leave him but not to divorce so he can never get with anyone else and get papers but I can’t do that to him.\n\nIve gone back home (only to check on the house and see if he’s gone im still staying with my sister) and surprisingly there’s no damage to anything and his things (only) are gone. So at least I feel a little relief in that. I’m not looking for advice I know I’m not going back, there is no longer any trust, my mental health wouldn’t be safe in that relationship, and I know I can’t have my daughter grow up with that kind of relationship being an example.\n\nI just needed to put this out there in order for it to solidify in my brain and to be able to reflect that this is now a pattern and he’s gone beyond disrespecting me by now also making me make HER food. I’ve been budgeting trying to make things last, sometimes eating less then I want to or skipping meals if possible (if a meal was heavier of carbs I’d skip since I should have enough for my milk supply) all to be able to pay bills, lawyer his gym membership and supplements. I lose out on rest and sleep because I ensure laundry and the house is kept spotless while the baby sleeps. I’ve basically gone from an independent educated career woman to a 1950s house wife with a job and school, all because I blindly fell for this man. When I say I feel stupid that’s an understatement.\n\n**Anyhow TLDR**: my husband had me (his breastfeeding wife) skipping meals and going out of my way to make him an extra lunch for his side chick at work. And now I have the house cars and he’s lost his nuclear family and ability to get a green card to be able to stay in the states and/or see his family in Mexico ever again.\n\nEdit: My phone seems to post it without paragraphs no matter what I do but I promise i tried to format it even though I was an emotional mess. This time I double spaced the paragraphs to see if that helps idk if it’s my phone or what.\n\nSome things I want to clarify I’ve been seeing in the comments.\n\nNo my sister isn’t pushing me to stay in a relationship with him, she’s telling me not to divorce him so that he can’t just go find another woman to marry and use for the green card.\n\nNo im not taking anything from him that wasn’t mine before we got married. Before me he lived in a house with 7other men sharing a bedroom with a bunk bed, and he drove a 2000 Buick he had to unplug from the battery in order to use it again. That car got scrapped after the electrical when out. The car he is using is my car I got in high school that got me through high school part time /seasonal jobs and community college.\n\nAlso my mom isn’t dead, she gave me my childhood home because I was going to college and it’s 10minute commute from the college. She gave it to me because I’m the last of the kids all my brothers and sisters are at least 10 years older and aside from my sister who’s helping me, they all live in different states.\n\nHe left home with a motorcycle his customizing, his gaming systems, clothes and the guest bedroom tv which was the only tv that was not mounted.\n\nAlso I’m not keeping his daughter from him. I just personally don’t want to see him because I know he will try to give me a ton of excuses and try to make me “understand” him. He can speak to my sister or mom and they will supervise him to see his daughter whenever he wants to. There is no battle in that. I don’t think he’s a bad father but I just don’t think my relationship with him is the example I want to give my daughter.\n\nYes, I am Mexican too, my dad came to the states and then later brought my mom and 2 brothers 2 sisters. Took a decade to see each other again which is why I’m so apart from my siblings and the only one born here.\n\n***Relevant Comments:***\n\n*Their relationship*\n\n>I’ve been told by my sister to inform everyone that this was my first actual long term relationship. She says that may give people a clue as too why I was so naive.  \nIt was also very early in the relationship and we weren’t living together yet. I met him when I was traveling around to local jobs where it was known immigrants worked to post and inform them of local resources to help them with medical insurance, free clinics and ESL programs for children and adults. I was working for a seasonal daycare program for agriculture workers.\n\n*How are you going without food if you both work and own your own home?*\n\n>He makes below minimum wage due to undocumentation, I work part time minimum wage because I can’t be away from the baby due to breastfeeding. He also sends money to provide for his parents and younger siblings\n\n*Why did putting more food in his lunch cause budgeting issues?*\n\n>Yes, I was budgeting in order to be able to save money for the lawyer expenses but now that I look back it was basically him paying bills and pocketing the left over for gym and supplements plus tools/paints and whatever while my paycheck was going to groceries, his family in Mexico and diapers.  \nAnd yes, I feel really stupid, naive and blind\n\n*What would get you more child support- him getting a green card and permanent job here or not? Basically when should you divorce?*\n\n>This may be the numbness in me talking at the moment but I don’t need his money he can contribute by buying her diapers clothes and whatever necessities. Now that I’m not catering to him I can leave my part time paper pushing job and find a good daycare for my daughter go back to teaching.  \nI might also just sell my second car and lower my car payment. Full time job and one less person in my home also means lower utilities since it’s less utilities being used at home. No mortgage, no stupid expenses on random gym crap/ $40 membership, just protein creatines and supplements was at least $150 a month not to mention whatever he was doing to that junk motorcycle.  \nMy sister and mom have talked me through finances and my BIL said I could honestly keep my part time job get on government benefits and spend more time with my daughter but I think mentally I need to go back to teaching, and feel the independence of being self reliant again. Food stamps feels like it’s just one thing he will throw in my face. Idk if I’m trying to hold on to what little bit of pride I have left or it’s just the anger I have inside that I wanna show him and his chick I am better without him.\n\n*To another commenter:*\n\n>If I continue with the process I’ll be legally and financially responsible for him for years to come. Supervised visits is due to him never being more the. 3 hours (aka one bottle fed) alone with the baby. Also the fear of him taking my child to another country now that he’s loss everything here and he may just decide to go to Mexico a place where he can’t come back unless he risks his life again, is very real.\"\n\n*The other woman:*\n\n>Idk she doesn’t have anything to offer she doesn’t have a legal status either because she overstayed her visa to my understanding from a coworker of his I went to school with. According to her that woman is younger, no legal status or education, no English and she’s already gotten in trouble for being inappropriate in the work place before and if there is proof that they are being inappropriate that will be a strike against him and firing against her. Apparently she likes to call herself “one of the guys” because she’s a woman who works in a male dominated job and degrades women making jokes with the men.\n\n**Update** [Post](https://www.reddit.com/r/TrueOffMyChest/comments/17r90k1/update_husband_feeding_side_girl_wives_cooking/)**: November 9, 2023 (almost 3 weeks later)**\n\nSorry it’s been a while since I updated anyone, I’ve been busy sorting out my life and this was supposed to be a throwaway so I didn’t expect it to blow the way it did much less anyone to actually want updates.\n\n\\-I guess I’ll start with the most asked question which was if I left him?\n\nYes, I also got a full check up and I indeed had an infection I was lucky I could treat and be good without any further issues.\n\nThis also confirmed his unfaithfulness because as I mentioned I had a baby not long ago and during the whole pregnancy they checked me for everything and they had done a full panel when I was 3months postpartum because I got a UTI and my doctor wanted to ensure it was only that.\n\n\\-Did I talk to him to get his side of the story?\n\nYes, when I went to tell him about the infection I allowed him to speak his mind about everything I only asked him for the truth as there wasn’t anything else for him to ruin, it was completely over at this point.\n\nAnd here’s a basic tldr:\n\n• He never meant to hurt me, he loves his daughter and me •he enjoyed the attention it was something new and exciting •it took his mind off the stress of bills, kid, my “emotional” state and the general routine his life •life had gotten boring and she entertained him (I’m sorry that your wife organized your previously chaotic life)\n\nThat’s about what I believed to be true out of the couple of hours of begging, excuses, gaslighting, and even blaming.\n\nThe rest was:\n\n•The infection is a common one that happens because of cow 💩 everywhere and because he goes out and pees outside without washing his hands or something 🙄\n\n•She doesn’t like men she was just one of the guys (cmon really??)\n\n•I only gave her lunch that day! It was just the one time that she forgot her lunch and she asked me because she saw I had two lunches 🙄\n\n•He would never stand so low to break his family why would I make such assumptions (oh so you knew what you were doing)\n\nOnce I showed him my MyChart with my results and explained how it’s not a normal infection like ecoli that you can get because of poop and it was an actual transmissible infection.\n\nI also explained that I hadn’t slept with anyone since we met! And how my doctor explained that if I would have had any kind of transmissible diseases I would have known during my pregnancy because not only is it common practice to test for all risks but my high risk pregnancy and preterm labor she tested for all kinds of things to see if she could find the cause of issues and afterword to find the cause of preterm labor.\n\nHe admitted it shortly after that he listened to me and saw my drs note (I’ll add I have the best obgyn and she was amazing in listening to me and allowing me to cry and gave me not only support during that moment with even having a nurse take my daughter out for me to cry but also printed me information and ensured me that a simple medicine will make it all go away and I should not see any more issues)\n\nAnyhow\n\nHe’s staying at the dairy at some trailer the owner let him borrow and for those who thought she would take him in turns out she’s engaged and she is about to start her wedding and do a adjustment of status (get her papers)\n\nAnyways I’m back to living on my own, my baby is doing great, I have another office job lined up for January, and I have a few universities I’ve applied to, I’m currently going to community college online but if I get into a uni I think I’ll move out of this town, my grandma said she would move with me to help me.\n\nSome days are long like today it’s late at night and I can’t sleep because I miss him. But I’ve been entertaining myself getting rid of stuff in my home to start a new slate and organize everything.\n\nI won’t lie and say I’m doing great. On my days off I don’t get out of bed. My house is clean but my bedroom has my laundry basket over full and I brought out the guest blankets and pillows to use.\n\nPeople at work have noticed a slowed pace in my work and I was offered time off but I denied it. Although now that somehow the rumor of what happened has reach my job I may take it.\n\nThank you for all the support everyone. Although I had a few people call me names and talk badly to me in my messages, I appreciate the other people who commented nice things and showed me support.\n\n……………………….\n\nEdit for update:\n\nWoke up to husbands call, he apologized again. I’m Still not budging, but he told me he was talking to some guys at work about free clinics or where they go when their sick and turns out that same woman has been sleeping with a few from there. Idk if around the same time but one of them told my husband where to get treated for free because he got it from her too.\n\nIn his apology which sounded more sincere this time but I believe it’s worse because it’s only after he realized he wasn’t special to her just another one of the guys she slept with.\n\nBut I say sincere because he didn’t have many excuses instead he seemed to hold himself accountable by saying he had won the lottery and messed up. He begged for a second chance because he doesn’t know what came over him. He says he hates coming home to an empty trailer he misses seeing his daughter the moment after work.\n\nWhat choked me up was when he said he used to feel more exhausted when he used to come home to us because the baby would be excited to see him and would cry to be held by him, and during the week I would often leave the same easy meals made for him so he could eat while I left to work and he started to feel tired of it. It was a boring routine of same foods during the week. Coming home and having to watch the baby so I could go to work.\n\nThat solidified to me that I don’t ever want to find another relationship much less go back to him. The routine I worked hard to put my family together, was a chore to him. I literally dealt with a fussy tired child til he got home so she would mostly sleep and he would only need a single bottle for her but even that was too hard.\n\nHe said he would give up the world just to be back into his routine because now he comes home to an empty trailer where it’s just a bed and a fold out table. He hasn’t eaten his diet because he doesn’t have time to prep. He started spending money on lunch because he doesn’t have food made for him. He says he misses the baby so much that he now cries when he goes home.\n\nI told him idk what to tell him about that, but if wanted to see the baby when I go to work he can go see her at my moms who now’s babysits for me. Knowing my mom she makes food and she would never deny him food so he can go over there and eat and be with the baby after work. But I had to go I couldn’t talked anymore.\n\nWhen I tell yall I’ve never cried so hard in my life, it’s an understatement. It doesn’t help it’s raining today. I think I’m calling into work today and tomorrow talking to my boss about taking those days.\n\n……..\n\n**Edit: November 10 (Same Post)**\n\nI was logging off for a while but I figured I’d update everyone to let you know she found my home and started harassing me now. I guess somehow her fiancée found out and she thinks it was because of me. I feel like things are just going from bad to worse. I had to leave my car in my moms garage and borrow my nephews car which my neighbor let me park in her driveway because she threatened to ruin my car like “I ruined her relationship”, which isn’t just hypothetical but also ironic.\n\n***Relevant Comments:***\n\n*What have you decided regarding legal aspects of this (ie green card)?*\n\n>I don’t want to make any legal decisions at the moment. I’m barely getting through leaving him, I don’t want to also put on too being responsible for my daughter to lose her dad. Because of his stupidity\"\n\n*Someone cautions her to not overly listen to reddit here, because this is a decision with huge ramifications. She should just do what feels right for her and her child:*\n\n>I feel like there’s no way out without severe damage. I feel like I’m in that bridge game from squid games except all tiles break at any decision just some have lesser consequences than the others.  \nI currently don’t want to make ANY decisions because I feel safe in limbo atm because even though my logical reasoning understands if he gets deported it’s going to be from his decision my emotional reasoning feels responsible for it. I don’t want him back the betrayal and his dishonesty has broken any trust I could ever have and I don’t think it would be good for my mental health to continue a relationship like that.  \nI grew up seeing my mom always asking and wondering if my step was cheating or not to the point my mom neglected us because she was so busy ensuring her husband wasn’t cheating. It turned a once loving caring involved mother into a toxic person who would take her daughters out at 3 am to go to shady neighborhoods to see if her husbands car was outside someone’s house.  \nI don’t want that for myself or daughter. I saw cheating ruin my mother without her ever being unfaithful, I seen it destroy my sisters first engagement , I have seen my brothers bleed from aggressive cheating women who attack them for wanting to take their kids from toxic environments with drugs and other men.  \nCheating is something I don’t want ANY involvement in and I’ve seen what it does to people. But I also have that responsibility that I want my daughter to have her dad. So in the meantime I am having that distance because I KNOW what is better for her and I am trying my best to stick to the logical conclusion not the emotional one.  \nNo matter how much I miss him, but I tell myself I don’t miss this person talking to me. I miss the person who made me feel safe, loved and cared for. And even then I’m starting to look back and realize a lot of it was me in a delusional state thinking that him hugging me when I asked, me going to him for kisses, me cuddling to him, was all love. I felt safe with him not because he made me feel safe but because I thought i was. But looking back it’s embarrassing to say I was the one who did a lot of the instigating of affection.  \nMaybe some of the people who messaged me saying I was I was psycho were on to something. I’m starting to feel like maybe I was in some delusional state and he was just using me.\"\n\n**Legal Advice** [Post](https://www.reddit.com/r/legaladvice/comments/17rz46f/what_do_i_need_to_file_a_restraining_order_in/)**: November 10, 2023 (Same day as the edit in update post)**\n\n**Title:** What do I need to file a restraining order in Texas?\n\nMy husband cheated on me and the woman who he cheated with is now harassing me. Ig she was engaged and was about to go from a visa to residency because of her fiancée but somehow he found out about her relationship with my husband.\n\nShe believes it was me but I don’t know who her partner is/was or who told him yet since like 4pm today she’s done the following:\n\n•punctured a hole in one of my tires\n\n•wrote on my front bay window “home wrecker”\n\n• keeps calling me from different numbers and now I’m starting to receive spam text messages after I blocked all of her numbers and stopped answering random numbers\n\n•threaten “I’ll ruin your car like you ruined my relationship ####”\n\nThis is all since this afternoon. I called the police but by the time they showed up she was gone. And they said I had no prove of what’s she doing so unless they find her doing it or I have prove their hands are tied.\n\nMy mom and step dad said they will put up cameras in my home and my mom is keeping my car at her home. They want me to stay with them too but I don’t want to leave my home incase she tries something against it.\n\nThe most I was able to get is a police officer patrolling the area. Meaning they will be close by and randomly pass by.\n\nI’m not sure what to do, I don’t even know who her partner is and I’m already dealing with leaving my husband and now she’s harassing me?\n\nAny advice before it gets worse?\n\n**\\*\\*\\*\\*\\*New to this sub Comments\\*\\*\\*\\*\\***\n\nCommenter: Your situation is very similar to mine which started 15 years ago. I made the decision to stay to make sure he got his green card and stayed with his son in turn, I received so much abuse from him. He is a narcissist and he subjected me to all kinds of abuse. I stayed because of my son and finally decided to leave. I was waking him for 15 years and once I left he stopped contact with our child, so all the abuse I endured it was pointless.\n\n>**OOP:** He was never abusive in any physical way but looking back I believe him to be very manipulative and immature. I don’t want to waste anymore time if it was possible I would go back and refuse to ever give him the time of day. It’s been the worst month of my life and going back or if I’d stay I can’t see it would have ever gotten better.  \nI’ve loss so much hair from stress my milk supply has plummeted to the point I think I may need to supplement formula soon, my mom tells me to just switch to formula because all my stress is going to go to the baby. But we’ve had such a bad formula shortage I don’t want to.  \nI don’t think my situation would have been any better if I would have stayed because I don’t think he would have changed his behavior just hid it better. My trust issues (which I had already prior to this whole mess) would have driven me into the same stress so I’m just give god thanks for him opening my eyes and not putting me in a worse situation.  \nI’m sorry your ex was just as horrible and you feel all your suffering was pointless. I believe it tells how important your son was for you and how selfless you are.\n\n**Update** [Comment](https://www.reddit.com/user/Empty_Researcher_348/comments/17seakt/comment/k9qqkgh/?context=3)**: November 18, 2023 (8 days later, almost 1 month from OG post)**\n\nThank you. My baby and I are. Doing better. She’s doing okay atm but unfortunately I’ve started to show some physical symptoms of the extreme stress I’ve been going through. As of Wednesday I haven’t had anymore issues with the woman as my step dad put cameras up and the moment one of the cameras alerted me they captured movement I got on the phone with police.\n\nI’m not sure what she was planning but she spent enough time under my kitchen window and my laundry window that the police showed up and got her for trespassing now with my video evidence I’ve sent it to the guy who was originally our immigration lawyer who said he will be doing a immigration report on her and use my original picture of her “working” and my video evidence of her trespassing and idk what else to prove she’s not only in the country while her visa isn’t active but also working and doing illegal things.\n\nIdk what she wanted but if she would have left me alone I would not have done anything. I didn’t report to her fiancée or do anything against her. Everything naturally happened and now in order to protect myself I’ve had the lawyer report her for me.\n\n**Update** [Comment](https://www.reddit.com/r/TrueOffMyChest/comments/17r90k1/comment/kd59zjg/?context=3)**: December 12, 2023 (about 1 month later, shy of 2 from OG post)**\n\nTLDR: I’m okay, ex is still a ex, ex is still sleeping with others, harassment is less severe but now more people. Ex is either stupider than I thought or manipulating women to harass me. And the girl, my ex and all other illegal workers were fired but to my knowledge not deported.\n\nNow more detail is below ⬇️\n\nWe’re okay, I’ve been numb to the whispers and just waiting for the office closing days for holiday vacation to start so I can go to Mexico for a while til our office reopens mid January. I’ve made friends with my areas police officer so he comes by and sweeps the area often and even has had his wife come stay with me and help me with my daughter and help me stay safe.\n\nI quit posting because the post actually blew up enough to where she found out about it I guess I wasn’t vague enough. I guess her husband uses Reddit and after he found out about her cheating and drama he put two and two together and reached out to me and I was able to confirm it was him by phone and met in person to talk. *\\[editor's note- this post did get a lot of traction on several different subs and was posted several places outside of reddit, including facebook, youtube, pinterest and tiktok. To me it's actually quite plausible someone found it\\]*\n\nTurned out he actually reported her overstay but I guess somehow she didn’t get deported but she along with a few others including my ex were all fired from their job because of his report. According to him she won’t be able to ever renew her visa again because she came as a tourist which means she can’t work. He apologized for her craziness and offered to help me but I turned him down because his involvement might actually make it worse.\n\nMy ex started sleeping around and I guess doesn’t learn his lesson. I don’t care anymore though I’ve come to peace he’s not the person I married. I’m so disgusted by him now that I don’t even like him kissing on my daughter. He does come to see her when my mom watches her more now that he got fired and is job haunting. I ask my mom that he leaves before I pick up because he will start crying the moment he sees me and tries to hug me.\n\nPolice have been useless aside the friendly officer and his wife. It’s not just that girl now, it’s like 3 girls who are her friends plus a few others who have slept with my ex who harass me because he tells them he loves me and wants me back which I don’t know if he’s stupid or is manipulating them to attack me for him.\n\nEither way I’ve deactivated all of my social medias and the ones I do use are all private or with a different name so I can just use but I just don’t post.\n\nSorry it’s long and boring.\n\n***OOP adds:***\n\nAlso one of the people who was sending me hate messages saying I’m a psychopath I deserved the cheating and talking a lot of crap to me was her, her ex confirmed her account.\n\n**Mini Comment** [Update](https://www.reddit.com/r/TrueOffMyChest/comments/17r90k1/comment/kp06uny/?context=3)**: February 4, 2024 (1.5 months later, 3.5 from OG post)**\n\nShes finally stopped but I think it’s because she doesn’t know anything of where I live work or do. “Suspiciously “ when I quit informing my ex she also quit finding me. I only meet my ex in public now.\n\n**Final Update** [Comment](https://www.reddit.com/r/TrueOffMyChest/comments/17r90k1/comment/kp06uny/?context=3)**: February 6, 2024 (2 days later)**\n\nHonestly I’m trying to focus on healing now. After everything I’m disgusted to think back of a time I slaved for him. I look at him and it’s just not the same.\n\nI used to see his green eyes and love his long lashes, now I notice his pimple scares and bad skin.\n\nI used to be excited for him to be home and try to think of something special to surprise him when he got home or what would get him to smile, now I just wonder how many time he was screwing around while I was fixing him something special or preparing everything for him to come home to a warm clean welcoming home.\n\nI never thought I would dread to have to see him or have anxiety when he’s near.\n\nI just focusing on myself now.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "HomeOfTheRisingStorm",
            "body": "What a scumbag! Sending his deranged side pieces to what? Terrorize the mother of his child? That he cheated on?!",
            "score": 3740,
            "replies": [
                {
                    "author": "spacespacespace_m",
                    "body": "As soon as she said she was getting harassed by calls and the deranged mistress was showing up at her home it was obvious the ex gave her all the info (and the other ones too). Otherwise how else would she have gotten OP’s phone number. Smh he’s a POS and I hope his karma hits him hard to where he can’t ever recover.",
                    "score": 1647,
                    "replies": [
                        {
                            "author": "sleepingrozy",
                            "body": "I have a feeling the ex was the one who informed her fiance, so get back at her for hooking up with other guys. The hypocrisy.",
                            "score": 437,
                            "replies": [
                                {
                                    "author": "Party-Argument-8969",
                                    "body": "If he gets deported I hope his family disowns him for cheating ",
                                    "score": 94,
                                    "replies": [
                                        {
                                            "author": "armomo3",
                                            "body": "No doubt.  His inability to keep it in his pants kept them all from coming legally.  What a dipshit.",
                                            "score": 27,
                                            "replies": []
                                        },
                                        {
                                            "author": "Alone_Dot_831",
                                            "body": "Me too and I hope he gets deported",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "spacespacespace_m",
                                    "body": "Right! But OP did say the AP’s partner found out through seeing her Reddit post on other sites. I think, I have to double check that again.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "sleepingrozy",
                                            "body": "I read it as he recognized the OP's post after additional information information about the AP's downward spiral and breakup was posted. There's not a hell of a lot to go off of from OP's initial post to identify her. Unless the AP was divulging what has happening in ex's personal life, it's a rather generic description.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "clauclauclaudia",
                                    "body": "In retrospect it looks like it *was* OP who told the fiance. Not on purpose, but when her post went viral.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Apathetic_Villainess",
                                    "body": "Oh definitely. Not just because she was messing around with multiple men but so he can accuse his wife of being the one who told.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "happyrhubarbpie",
                                    "body": "Off topic, I'm begging for the story behind your flair!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Myfourcats1",
                            "body": "I’d have reported him for green card fraud. He was probably using her all along.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "perpetuallyxhausted",
                    "body": "Well yeah. That POS had his wife making his side piece lunch. I don't think there's any level that he wouldn't sink to.",
                    "score": 229,
                    "replies": [
                        {
                            "author": "Snoo_61631",
                            "body": "His *breastfeeding* wife, who was going hungry to provide that extra lunch. I'm so furious on her behalf. ",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EtainAingeal",
                    "body": "Even when she was describing how he was trying to get her back, he missed his daughter, he missed having his meals made, and all the things the OOP did for him but he didn't miss HER. He just missed having a maid.",
                    "score": 193,
                    "replies": [
                        {
                            "author": "Apathetic_Villainess",
                            "body": "That's honestly pretty common with men. Ask people what they like about their partners, women will talk more often about their personality and traits, men will talk about what their partners do for them.\n\nIt's why the divorce rate is so high when the men's partners get serious diagnoses, she won't be able to do those things any more, so no longer holds value to him.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "EtainAingeal",
                                    "body": "Upvoting this feels so wrong but I can't argue with your point.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ProfessionalCat420",
                            "body": "I noticed that too. Nothing about OOP, ALLLLL about the creature comforts and baby makin. 💀",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 173,
                    "replies": [
                        {
                            "author": "Astecheee",
                            "body": "I think the ideal karma is something like losing his dick while playing around with an angle grinder.",
                            "score": 50,
                            "replies": []
                        },
                        {
                            "author": "sinacure4u",
                            "body": "ICE?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "paulinaiml",
                    "body": "And getting everyone fired and potentially reported. What a way to shoot himself on his foot.",
                    "score": 68,
                    "replies": []
                },
                {
                    "author": "undeadvictorianwitch",
                    "body": "I'm sure he thought if he made her feel unsafe she would call him back to protect her",
                    "score": 45,
                    "replies": [
                        {
                            "author": "clauclauclaudia",
                            "body": "Okay, yeah, he's idiot enough that that's plausible.",
                            "score": 29,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "shelwood46",
                    "body": "He was pretty psycho long before the sidepiece terror campaign. He had her sending her own money to his family while his money went for gym memberships. Eating high quality food for him and his sidechick to hit those macros while his nursing wife was skipping meals. Giving her \"ecoli\" (chlamydia) 3 months post partum.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "SitcomKid411",
                    "body": "Probably to scare her into having back in the home to “protect” her",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "matchamagpie",
            "body": "I wish nothing but the worst for OOP's ex and his affair partner. Both garbage people who deserve every karmic thing the universe decides to bestow on them",
            "score": 5490,
            "replies": [
                {
                    "author": "Sea-Conference3984",
                    "body": "Partners.... plural. It is men's behaviour like this that makes me glad I'm single",
                    "score": 1533,
                    "replies": [
                        {
                            "author": "johnnieawalker",
                            "body": "I’m also 1000% happy to be single but I do have a sort of funny story involving a man not cheating lmao. \n\nMy friend’s fiancé was at a restaurant/bar thing that I was also at with some coworkers. He was sitting at the bar watching a football game with a buddy and I was grabbing another drink for one of my friends when I see this (pretty attractive) woman come up to him and, I kid you not, say “Hi handsome.”\n\nHe literally says “Nope” and sets his drink down and then leaves (I guess he had paid his tab already?) but I’ll never forget that woman’s expression. She was genuinely gobsmacked. \n\nI mentioned it to them like a month later and my friend tells me that he told her about it too but that she was lowkey pissed that he didn’t stay and get the score bc she wanted to know when he got home 😂😂",
                            "score": 458,
                            "replies": [
                                {
                                    "author": "Artistic_Frosting693",
                                    "body": "LMAO! I love your friend and their fiance!",
                                    "score": 151,
                                    "replies": []
                                },
                                {
                                    "author": "thestashattacked",
                                    "body": "I now wish I could have seen her face. \n\nAnd dudes, that's how easy it is to not cheat. Just... say no.",
                                    "score": 86,
                                    "replies": [
                                        {
                                            "author": "johnnieawalker",
                                            "body": "LITERALLY. \n\nAnytime I hear of someone cheating, I’m just like “this dude didn’t even ENTERTAIN it.”",
                                            "score": 57,
                                            "replies": [
                                                {
                                                    "author": "Apathetic_Villainess",
                                                    "body": "I feel like \"hey handsome\" is so scripted sounding that I'd probably bust up laughing if I heard someone say it to someone they didn't even know.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Human-Walk9801",
                                            "body": "Nancy Reagan would be so proud of you ;) lol!",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "WayCalm2854",
                                            "body": "Nancy Reagan was onto something!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Lovat69",
                                    "body": "I'm sorry, get the score, what does that mean in this context?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "MillieFrank",
                                            "body": "The score of the game he was watching, he left before the game finished.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BigMax",
                            "body": "How does one guy like him get so many dates?  And not only dates and sex, but get them to harass his ex on his behalf?  \n\nUnder minimum wage and then unemployed, deadbeat dad… and that’s the guy out there romancing a group of women?\n\nI’m glad OP is sorting things out, but it’s so sad that it’s been so long and heartbreaking along the way, and still ongoing.",
                            "score": 196,
                            "replies": [
                                {
                                    "author": "craftygoddess1025",
                                    "body": ">How does one guy like him get so many dates?  And not only dates and sex, but get them to harass his ex on his behalf?  \n\n>Under minimum wage and then unemployed, deadbeat dad… and that’s the guy out there romancing a group of women?\n\n\nRight??? Not just that, but banging them AND telling them that he loves OP and wants to get back together with her. None of these partners have an iota of self esteem between the lot of them, in my opinion.",
                                    "score": 142,
                                    "replies": [
                                        {
                                            "author": "pourthebubbly",
                                            "body": "And the fact he somehow thinks getting these women to harass OOP is going to win her back.",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "armomo3",
                                            "body": "Usually it's a bunch of 2's and 3's hanging with 2's and 3's with the occasional 4 tossed in.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "WayCalm2854",
                                                    "body": "Maybe the OOPs ex is a 4, he has green eyes she once thought were attractive.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Constant-Wanderer",
                                    "body": "If you assume that he's dating women that you would want to date, I can see how that would be confusing.\n\n  \nAnswer: men like him troll for neediness, for the unbalanced, for women who love drama. He's not dating a bunch of well-adjusted, happy models.",
                                    "score": 76,
                                    "replies": []
                                },
                                {
                                    "author": "Bupod",
                                    "body": "Lid for every pot, basically.\n\nWomen can be dumb fools with poor judgement too",
                                    "score": 70,
                                    "replies": [
                                        {
                                            "author": "IMissNarwhalBacon",
                                            "body": "I get it.  Female trump voters.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "Bupod",
                                                    "body": "Honestly? Yes. That’s one subset. I was just remarking that women can make poor relationship choices just as easily as men, and they often do. They’re not particularly special in that regard.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ethicalphysician",
                                    "body": "lack of education, morals, poor role models. it’s lord of the flies in some areas",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "iikratka",
                                    "body": "None of these people are older than 25, and they’re undocumented and working under the table for sub-minimum wage and the constant threat of deportation. Very young adults + exhausting manual labor jobs + financial stress + the pressure cooker of long-term uncertainty/desperation/helplessness = inexplicably bad life choices. \n\nAnyone who’s ever worked with stressed-out broke kids (construction, restaurants, the military, etc) has seen some version of this nonsense.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "ethicalphysician",
                                            "body": "this. agree with you",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lookingforalma",
                                    "body": "“green eyes and long lashes” and they’re Mexican? he’s probably a hottie, and light eyes will make you overlook a lot (ask me how i know 🥴)",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Diligent_Asparagus22",
                                            "body": "plus a lot of mentions of gym + supplements. he's probably pretty ripped. but also kinda weird that his booty calls are harassing OOP because he keeps telling them how much he loves her? I mean a hottie with a body and pretty eyes only goes so far haha",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "imitationpeoplemeat",
                                    "body": "Some guys know how to schmooze. \n\nWe had a friend get used as a fleshlight and hotel for about a month and a half until buddy got bored and went to live with another girl.\n\nHe was a serial manipulator, and she was taken in by the love bombing.\n\nOh, and guys like that are MASSIVE liars. They're always just on the brink of being \"back on my feet\" and their living/ financial situation is never their fault.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "GlitterDoomsday",
                                    "body": "He gets many dates by specifically going after naive or with very low self-esteem women. All those randoms being awful to OOP are sad and desperate.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "KaleidoscopeGreat973",
                                    "body": "OP's ex would appeal to insecure, emotionally immature women who live for drama and believe their love will change him.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sugaredberry",
                            "body": "Literally giving myself a hug right now and just thankful that I’m single.",
                            "score": 296,
                            "replies": [
                                {
                                    "author": "SafiyaMukhamadova",
                                    "body": "My asexuality has made my life SO much easier and I just wish everyone could have this kind of peace.",
                                    "score": 100,
                                    "replies": [
                                        {
                                            "author": "zombie_goast",
                                            "body": "God ikr. Like I'm good thanks, my friends, family, pets, and Karlach and Garrus are enough for me tyvm",
                                            "score": 49,
                                            "replies": [
                                                {
                                                    "author": "firelark_",
                                                    "body": ">Karlach and Garrus\n\nYou're either one of my besties or you should be friends with us.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "zombie_goast",
                                                            "body": "Karlach, Garrus, Zevran. The holy trinity 🤣",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "hiddenone0326",
                                            "body": "I'm primarily asexual as well (really demi sexual, but the attraction almost never happens - I've had exactly one crush in the last decade). When I was on testosterone for six months (I'm FtM, had to stop because I ran out of hormones right as COVID started happening and I was getting them out of state) I actually started having a little bit of a sex drive for the first time in my life. I was genuinely confused by how people manage to get things done all day when all I wanted to do was stare at cute girls.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "SafiyaMukhamadova",
                                                    "body": "My friend's doctor told her that her sexuality might change a bit once she started hormones. She went from mostly asexual to lesbian. My current roommate's sexuality (MtF) went from mostly straight bisexual (mostly female leaning) to mostly straight bisexual (male leaning) lol.\n\nIdk, I'm definitely not in an egg, I'm just a perfectly cis woman who wishes she had a dick and did not have boobs which is a completely cisgender thing to say, I'm sure many cis women feel that way. Just ask Freud. I have tried to imagine if my sexuality would be different if I had a male body and I'm not sure. Hormones also put you through puberty which changes you a good bit so maybe if I took testosterone things would be different.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Apathetic_Villainess",
                                                            "body": "I mean, Freud did think that women that women had literal penis envy rather than realizing it was about the way society treated women.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "THUMBELS1988",
                                            "body": "Same",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "IWantALargeFarva",
                                            "body": "I’m not asexual, but I just don’t cheat. It’s freed up a lot of drama from my life. I don’t know how people have the energy for all that crap. I can barely keep up with one spouse. Let alone sneaking around with someone else. Who has the time???",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FullyAdjustableFunk",
                                    "body": "I honestly dread the thought of my daughter getting married.  Not because I don’t want her to be happy, but because of the sheer percentage of shitty men out there.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "1568314",
                            "body": "I mean the other woman's behavior is pretty deplorable too.",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "Sea-Conference3984",
                                    "body": "Oh no doubt, she is disgusting no doubt.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Luffytheeternalking",
                            "body": "And these men rant about the loneliness epidemic.",
                            "score": 50,
                            "replies": [
                                {
                                    "author": "Lt_Muffintoes",
                                    "body": "I don't think they're the same group of men tbh",
                                    "score": 24,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Firewolf06",
                            "body": "\n>men's behaviour\n\nthis story also features a woman doing the exact same thing. dont play into the patriarchy",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Feeling-Visit1472",
                    "body": "Let’s be honest, the red flags were there from the beginning when he was sending money back home to Mexico while his pregnant wife was barely making ends meet.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "armomo3",
                            "body": "Most do.  He probably thought she was lying about the money she made and spent and was squirrelling it back.  Liars think everyone else is lying too.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Gifted_GardenSnail",
                    "body": "I hope they got deported by now",
                    "score": 73,
                    "replies": [
                        {
                            "author": "Notmykl",
                            "body": "Those that deserve being deported generally are not the ones being deported.",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "Gifted_GardenSnail",
                                    "body": "But /Leopardsatemyface features a few of them nonetheless",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PinxJinx",
                            "body": "Yeah I’ve barely wished this on anyone but damn get him out of here!!",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Gryffindor123",
                    "body": "This ",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Asleep_Region",
                    "body": "Amen",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Enough_Basis_8935",
                    "body": "And it will, karma may be slow but it's certain",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "deriik66",
                    "body": "Yea partners, he has a magical menagerie of woman who all instantly fall in love and agree to harass a single mom with child. He has a radar for those types specifically",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "hollywoodhandshook",
                    "body": "they're trash but i find using the vicious US immigration system as punishment to be incredibly scary and a marker of a real bad person",
                    "score": -11,
                    "replies": []
                },
                {
                    "author": "clauclauclaudia",
                    "body": "It was the affair partner's fiance who did that. OP is just stuck in a bad position--divorce, or turn what wasn't a green card marriage into one, for the benefit of a cheater? He put her in a terrible position when all he had to do was not cheat.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "martphon",
            "body": ">naked pictures of a coworker from a previous job he got fired from because of her.\n\nI wonder what happened there.",
            "score": 1303,
            "replies": [
                {
                    "author": "Rerun-my-ass",
                    "body": "Yeah I was like wow way to bury the lede there we’re just gonna skimm over that massive red flag?",
                    "score": 336,
                    "replies": [
                        {
                            "author": "OriginalGhostCookie",
                            "body": " I bigger lede was buried than when it comes to this posts title.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cyberllama",
                    "body": "I read that bit and thought 'no, he got fired because of *himself*'",
                    "score": 229,
                    "replies": []
                },
                {
                    "author": "No_Proposal7628",
                    "body": "Happy Cake Day!",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Anonphilosophia",
            "body": "I don't know why, but I was not expecting the STD. Jeez.",
            "score": 1063,
            "replies": [
                {
                    "author": "Houki01",
                    "body": "Nah, that's actually how a lot of busy women figure out that their partner is cheating. She's busy and she trusts him, so a lot of the subtle signals don't get noticed, and then she has a problem or gets sick, she goes to the doctor and finds out, hey, she's got an STD. Where did it come from? The only person she's sleeping with is her SO, and he didn't have one before ... And that's when the dots connect.",
                    "score": 1307,
                    "replies": [
                        {
                            "author": "linerva",
                            "body": "I used to work in sexual health and saw both a lot of cheating partners who were like \"what do you mean I can't have sex with my partner til it's treated? They'll know something is up!\". \n\nLike sir/ma'am, you're going to infect them and catch it back from them again AND they will find out. Tell them you have a headache or the flu for 2 weeks. Unfortunately there may be repercussions either way and you may already have infected them if you had sex with them since cheating. \n\n And I saw a lot of partners confused how they got gonorrhea or chlamydia and you'd have to explain tgat we can re-test in case it's a false positive (rare but happens) but it's almost certainly because you had sex with an infected person since you were last tested negative. Most people can draw the inference for themselves.\n\nTreated them all kindly and respectfully, obviously. We arent there to judge or moralise. Most people aren't cheating...but a lot are.",
                            "score": 228,
                            "replies": [
                                {
                                    "author": "TheZigerionScammer",
                                    "body": "Are condoms just not an option for these people? Jeeze....",
                                    "score": 71,
                                    "replies": [
                                        {
                                            "author": "clauclauclaudia",
                                            "body": "Hard to explain if you haven't been using them all along. More of a giveaway than having a headache.",
                                            "score": 43,
                                            "replies": [
                                                {
                                                    "author": "ReasonableFig2111",
                                                    "body": "I think they meant, using condoms during cheating. You know, to protect yourself from contacting something from the affair partner. Then at least, they wouldn't be passing anything along to their unsuspecting spouses. ",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Apathetic_Villainess",
                                                    "body": "I found condoms in my boyfriend's (at the time) car. He tried to claim they were for us. Lol, dude was either a dumbass or thought I was.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ProfessionalCat420",
                                            "body": "Apparently it is also possible to contract some of these curable diseases through oral sex so that's really all you need unfortunately. ",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "steveabutt",
                            "body": "It could be from Koala....",
                            "score": 275,
                            "replies": [
                                {
                                    "author": "Mindless-Top766",
                                    "body": "God that story shocked me to my core",
                                    "score": 118,
                                    "replies": [
                                        {
                                            "author": "mischievouslyacat",
                                            "body": "I feel I may regret asking what story",
                                            "score": 52,
                                            "replies": [
                                                {
                                                    "author": "Resentful-user",
                                                    "body": "Woman gets chlamydia, refuses to accept partner had cheated.\n\n\nShe concluded that either her or both of them had contracted chlamydia from a koala they had held in the past year, as its common for koalas to have chlamydia. \n\n\nThe comments exploded, telling her the koala strain is not transmissable to humans.\n\n\nShe was NOT having it. IT WAS THE KOALA.",
                                                    "score": 222,
                                                    "replies": [
                                                        {
                                                            "author": "Normal-Height-8577",
                                                            "body": "Confession: that thread was actually the first time I'd heard that the koala strain of Chlamydia is different than the human strain. All the articles and TV programmes where I'd heard of koalas being infected, and not one of them had mentioned that fact. They were too busy making jokes about koala STDs and warning people not to hold them.\n\nSo considering my own ignorance, I wasn't entirely surprised that she doubled down and refused to believe it. I just hope that everyone's comments sowed enough uncertainty that she eventually went and googled it.",
                                                            "score": 135,
                                                            "replies": [
                                                                {
                                                                    "author": "Meteorite42",
                                                                    "body": "I didn't know there is a strain of Chlamydia that Koalas get.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "InfiniteRadness",
                                                                            "body": "Oh, it gets even funnier/weirder, because it’s apparently *running rampant* through the population, to the point they have dedicated koala chlamydia treatment wards, one of which [is named after John Oliver](https://www.nytimes.com/2018/05/08/world/australia/koalas-chlamydia-john-oliver.html).",
                                                                            "score": 31,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Firewolf06",
                                                                                    "body": "\n>it’s apparently *running rampant* through the population\n\n[80% of koalas in nsw have it, up from \"just\" 10% in 2008](https://www.npr.org/2023/05/09/1174940150/in-australia-scientists-begin-vaccinating-koalas-against-chlamydia)",
                                                                                    "score": 16,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "DeathByOrgasm",
                                                                                    "body": "I remember that episode. That man is an absolute treasure.",
                                                                                    "score": 13,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "AggravatingFig8947",
                                                            "body": "No that’s not what happened, or at least not the one that I’m thinking of. \n\nIn the initial stages she thought that he cheated and was adamant about it. She was distraught that he wouldn’t admit it. He was distraught and insisted he never cheated either, and was hurt because he thought SHE was lying about the cheating and framing him as the bad guy. \n\nThey carried on for like 3 or 4 years with this mutual distrust and hurt towards each other for the kids’ sakes. Then they found out about the koala chlamydia thing. It wasn’t a passive exposure either, he picked one up, it PEED ON HIM, HE DIDNT WASH HIS HANDS (vomit) and they apparently had sex shortly thereafter. After the koala chlamydia revelation happened, the husband said he had a one night stand after she accused him of cheating (as revenge because he thought that she had cheated).",
                                                            "score": 37,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "MrBleah",
                                                            "body": ">The comments exploded, telling her the koala strain is not transmissable to humans.\n\nAll the koala fuckers breathe a sight of relief.",
                                                            "score": 19,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "GiveMeCheesecake",
                                                            "body": "Absolute classic.",
                                                            "score": 40,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Used-Cup-6055",
                                                            "body": "My Roman Empire is a girl I was friends with in college finding out she had HPV and saying “HPV is genetic. My aunt has it so that’s why I have it.” \n\nIt couldn’t possibly have had anything to do with her fiancé who was in the Army and stationed in Hawaii while she was living in Illinois. I just was like “oh” and didn’t tell her that unless she was fucking her aunt there was no way this was possible. \n\nThey’re married now and from what I’ve heard through the small Midwestern town grapevine is he’s been cheating on her for about 20 years now 🥴",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Z_is_green13",
                                    "body": "Only an idiot would believe they got the STD from anyone other than the partner they are currently sleeping with.\n\nIt’s amazing how many loser cheater men also can’t hack basic biology. Truly worthless lumps of carbon:",
                                    "score": 71,
                                    "replies": [
                                        {
                                            "author": "thatfattestcat",
                                            "body": "If it's strictly an STD, yes. Some transmittable diseases, though, are transmittable through several things including sex, like for example herpes. And some people don't know which are which.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SnooKiwis2161",
                                    "body": "Do you have a link?*\n\n*I think I will regret this ask",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "Gifted_GardenSnail",
                                            "body": "Check the flair page for 'Someone cheated, and it wasn't the koala'",
                                            "score": 45,
                                            "replies": [
                                                {
                                                    "author": "heathbar_14",
                                                    "body": "TIL there's a page for the flair origins. there goes the rest of my day, thank you for your service 🙏🏻💀",
                                                    "score": 47,
                                                    "replies": [
                                                        {
                                                            "author": "Gifted_GardenSnail",
                                                            "body": "You're welcome, see you next week 😂",
                                                            "score": 22,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Longjumping-Bell-762",
                            "body": "Yup. That’s how my ex finally confessed to the cheating. I was told by a friend I should get tested because she had heard the supposed girl he cheated on me with had an STI. I asked him if I needed to get tested for a specific STI and he said that I should get tested.",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "dilqncho",
                            "body": "The problem with that is, there are multiple STDs that can go dormant or symptom-free for a long time.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Gypsikat",
                                    "body": "If the women have given birth/been pregnant during their relationship they would have been tested for STD’s (in the US).",
                                    "score": 43,
                                    "replies": []
                                },
                                {
                                    "author": "linerva",
                                    "body": "That's true. Chlamydia abd Gonorrhoea are often asymptomatic but usually show symptoms early if you get them at all. Syphilis and HIzv may habe a latent priod or mild flu like symptoms initially and only become more serious later on.\n\nBut if you tested going into the relationship or during pregnancy etc then you'd know when you were last negative...and who you had sex with since then. \n\nThis is why we should advocate for regular testing. People should be testing before and after each sexual relationship  or every 3 months if they have multiple partners.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "clauclauclaudia",
                                            "body": "Hlzv? Tried googling, didn't help.\n\nOh wait, that's typo for HIV and me reading in a typeface that doesn't distinguish I and l much.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "linerva",
                                                    "body": "Yeah sorry, HIV.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Notmykl",
                            "body": "What in the hell was the ex doing to cow pies to catch an STD that is transmittable from cow pies to people?  And seriously a cow pie STD?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Houki01",
                                    "body": "There isn't one. Ex was lying to try to convince OOP that he wasn't cheating. But OOP knew he hadn't got anything from a cow pat, much less an STD.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nomad_l17",
                    "body": "One of my bosses had to take the whole day off and not just the morning because her obgyn appointment ran late. She was miffed but her obgyn said an earlier patient broke down when informed she had an std. That's how she found out her husband was cheating on her and it took a long time to calm her down.",
                    "score": 249,
                    "replies": [
                        {
                            "author": "Comfortfoods",
                            "body": "Isn't it a HIPAA violation for the obgyn to tell your boss about another patient's business like that?",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "momofeveryone5",
                                    "body": "No as long as the doc doesn't say the patient name",
                                    "score": 129,
                                    "replies": []
                                },
                                {
                                    "author": "Normal-Height-8577",
                                    "body": "Not unless you also tell them identifying information. \n\nUnless you were sitting in the waiting room right from the start of the day, timing everyone and looking for reddened eyes, you're not going to be able to identify which patient the doctor was talking about.",
                                    "score": 90,
                                    "replies": []
                                },
                                {
                                    "author": "Alternative_Year_340",
                                    "body": "If it’s anonymised, it may be ok.",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "GigaPuddi",
                                    "body": "Not if they change enough information for it not to be identifying.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "clauclauclaudia",
                                            "body": "Not even change, just leave out.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Useful_Language2040",
                                    "body": "Can you identify the individual from \"an earlier patient...\"? I'd imagine (as a non-American, non-healthcare worker, etc, that it would be anonymous enough for it to be fine.\n\n\n\n\nUnless the boss saw the previous person being led out, tear tracks down their face, heard their name at the reception desk as they booked in a follow-up, etc - how would you identify them?",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "nomad_l17",
                                    "body": "No because my boss didn't know who it was. She was busy reading her emails while waiting for her turn. And turns out it's a common way here for wives to find out their husbands have been cheating/cheated on them (pre-marital sex or living together before marriage isn't that common here as it's a conservative country).",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AriaCannotSing",
                    "body": "At all, or that there was just one?",
                    "score": 61,
                    "replies": [
                        {
                            "author": "Anonphilosophia",
                            "body": "At all. \n\nClearly I am a naive idiot. \n\nMaybe because of everything going on right now. I honestly I thought he was just providing lunch for a fellow immigrant in need. \n\nAnd he kept it quiet because he knew his wife would have a problem with it because the person was female. \n\nWas not expecting that they had sex, nor that she was servicing the worksite. Yikes.",
                            "score": 120,
                            "replies": [
                                {
                                    "author": "PrincessCG",
                                    "body": "I feel like all the cheating BORUs will surprise you then. We get like one wholesome one a week. Everything else is hell and douchebags.",
                                    "score": 175,
                                    "replies": [
                                        {
                                            "author": "IllustratorSlow1614",
                                            "body": "“Everything else is hell and douchebags” should be a flair!",
                                            "score": 88,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "piemakerdeadwaker",
                                    "body": "You must be new to BORU 😅",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "TomorrowNotFound",
                                            "body": "And the internet. And life. Hope they stay just the way they are, with no harm done.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Apathetic_Villainess",
                                    "body": "I mean, when she's having to skip meals herself while breastfeeding, asking her to provide extra food was douche enough even if it were for an actual needy person.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Gingersnapandabrew",
                    "body": "That was how my friend discovered her husband of 10+ years had cheated.",
                    "score": 58,
                    "replies": []
                },
                {
                    "author": "SuppleSuplicant",
                    "body": "It’s unfortunately common. Cheaters often cheat with other cheaters, meaning everyone’s risk of STI goes up. ",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Hetakuoni",
                    "body": "I’ve had to tell a person “yeah you’re gonna want to tell all your partners you’ve got an std so they can get checked too” and they look at me like I’m insane and go “I’m married and only slept with one person”\n\nI usually just let that sit in the air before going to the next bullet point.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Anonphilosophia",
                            "body": "Eeek.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "istara",
            "body": "Heads up guys!\n\n> my folder of everything he’s done before from simple hearting other girls stories after telling me he didn’t to naked pictures of a coworker from a previous job he got fired from because of her\n\nThe bar just slipped even lower.\n\nAll that and she was still happy to stay with him and drudge for him, until the lunch-affair-partner finally tipped her over the edge.",
            "score": 631,
            "replies": [
                {
                    "author": "graft_vs_host",
                    "body": "And willing to skip meals and go hungry while she’s breastfeeding so he can have extra food. I don’t get it.",
                    "score": 300,
                    "replies": [
                        {
                            "author": "AffectionateFig9277",
                            "body": "I actually really dont like that she blamed him for that. She fully chose to do that. What woman in her right mind would deprive her baby of nutrients so that her husband can eat?",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "ImpressiveChart2433",
                                    "body": "I mean, she probably *wasn't* in her \"right mind\"... she said she had a lack of sleep from breastfeeding, she was doing all the cooking, cleaning, and taking care of the baby solo, she probably had low self esteem, and her manipulative husband likely acted as though he'd leave her if she *didn't* sacrifice her food... she was obviously mentally overextended and probably didn't have time to think objectively about her situation/relationship, assuming that staying together was best her baby (not yet realizing he wasn't actually contributing anything to the baby's life).",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "graft_vs_host",
                                    "body": "But he might be bulking! That’s more important than feeding your baby.",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "lesterholtgroupie",
                                    "body": "I’m not going to lie to you I rolled my eyes at that. My ex was abusive I’m so many ways but when I had my baby all bets were off.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ShitLordOfTheRings",
                            "body": "That's because it makes no sense. She is making food for him, he wants more food - she can just make a greater amount. \"I'm going to give him leftovers and go hungry\" is the most bizarre approach to this.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "meresithea",
                                    "body": "I think she’s had to budget to the penny. There isn’t any more food until payday.",
                                    "score": 106,
                                    "replies": [
                                        {
                                            "author": "eastbaymagpie",
                                            "body": "And yet he can afford gym supplements and motorcycle parts and gaming systems. That fucker.",
                                            "score": 52,
                                            "replies": []
                                        },
                                        {
                                            "author": "ShitLordOfTheRings",
                                            "body": "I've been poor, I don't buy that, sorry. If you are that tight you don't worry about making \"pure, simple food\", or are going for a visit to your BF to bring him dessert. BF is hungry? Add a potato, they are about $1 for a pound. Go without meat for a day and you've financed that for a week. Or don't buy the dessert / save the bus ticket to go to his workplace.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "graft_vs_host",
                                                    "body": "It’s also strange that at first she says she’s working part time only to save money for the lawyer. As if he makes enough to support them and she’s earning the extra.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "LilStabbyboo",
                                                            "body": "Because they have no rent or mortgage, i think? Her mom gave her the house.",
                                                            "score": 19,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "thievingwillow",
                                                    "body": "Thanks for articulating it. I had the gut feeling that their financial situation as described didn’t add up, and you’ve put your finger on part of why.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "paulinaiml",
                    "body": "He was a limbo master aside from being a cheating master",
                    "score": 25,
                    "replies": []
                }
            ]
        },
        {
            "author": "Commercial_Eye8016",
            "body": "I’ve seen this happen so many times, I even warned an old friend about this happening but she swatted me off🤷🏿‍♀️ he got his papers, told her he was getting a divorce, and brought his family (wife & kids) over. All she got in the end was a baby he doesn’t see and debt.\n\nI got another friend who’s dad was trying to convince her to marry a friend of his to help get his papers, claiming he was a good guy, etc😩 omg men are terrible we were on group FT telling her not follow through with it",
            "score": 941,
            "replies": [
                {
                    "author": "Consistent-Primary41",
                    "body": "I've seen this happen because I grew up in a heavily Mexican area of SoCal and it's all machismo bullshit.\n\n\"You get a fat, ugly one to marry because they won't ever cheat on you or leave you. They will cook your meals and raise your kids and you keep a hot woman on the side.\"\n\nLike...adult males. Telling me some variation of this shit. In front of their daughters.",
                    "score": 592,
                    "replies": [
                        {
                            "author": "DohnJoggett",
                            "body": "There's a whole ass \"oldies\" song about it from the 40's. The lyrics literally tell men to marry an ugly fat woman with a lazy eye so she'll make up for it with cooking skills.\n\n\"A pretty woman makes her husband look small\"\n\nIt's 2025 and we still have that 1940's mindset.\n\nhttps://www.youtube.com/watch?v=6EqFVWzOfN8",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HalloweensQueen",
                    "body": "My friend did this, I fought with her to not do it. Minute he got his green card he was in the wind. It’s 20 years later and she’s still married to him because she can’t find him or afford to divorce him!",
                    "score": 369,
                    "replies": [
                        {
                            "author": "Alternative_Year_340",
                            "body": "She should be able to file for the divorce on her own. If they have no property together or minor children, she shouldn’t need a lawyer.",
                            "score": 184,
                            "replies": [
                                {
                                    "author": "HalloweensQueen",
                                    "body": "She said it would cost, I was more concerned she had children after he left (not his) but since he was her husband I could see problems there if he wanted to be an ass to her. Either way it’s a giant mess!",
                                    "score": 77,
                                    "replies": [
                                        {
                                            "author": "Alternative_Year_340",
                                            "body": "She can talk with a legal aid clinic, or if she’s near a law school, they usually have few or low-cost clinics. But if someone else’s name is down on the birth certificates as the father, she might not need a lawyer. \n\nShe should also do checks to see if he’s dead — she could be eligible for social security benefits. (At least until trump kills social security)",
                                            "score": 73,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "NanaLeonie",
                            "body": "Life Pro TIP : If she doesn’t divorce him, may I suggest she get a will in place so he  doesn’t have statutory rights to her estate if something happens. Just a thought.",
                            "score": 58,
                            "replies": []
                        },
                        {
                            "author": "Normal-Height-8577",
                            "body": "One of my second cousins married a guy who wanted the UK equivalent of a green card. She was so in love (and quite naïve in some ways) and he walked out pretty much straight after he had legal residence.",
                            "score": 74,
                            "replies": []
                        },
                        {
                            "author": "Notmykl",
                            "body": "My cousin did this.  He married her for the green card and was upset when she divorced him because he thought it would be perfectly fine to keep his girlfriends while being married.  I don't think he obtained his green card before being divorced.\n\nBTW he was German.  His mother and my Aunt got on like a house on fire cause Aunt is German too.  Aunt enjoyed being able to talk to someone in her native language.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tesdinic",
                    "body": "I saw something similar, but in a way more sinister. A woman helped her man through law school and he was going to do the same once he was done. As soon as he graduated, he divorced her. She eventually did get her own law degree and ended up with a local judge. \n\nPlot twist, the ex husband, wife, and judge ran into each other in a Walmart and got into a fist fight, which was the subject of small town gossip for ages.",
                    "score": 207,
                    "replies": [
                        {
                            "author": "NotOnApprovedList",
                            "body": "oh man. I've known of a couple women slaved to put their men through grad school and once the men graduated, one guy left for a younger woman from grad school and left his STBX with a giant pile of debt from their wedding and honeymoon, and to arrange the divorce herself. The other presented his fiance with an incredibly outrageous prenup, where even her house that she owned prior to meeting him would be seized in the case she cheated on him (but no provisions if he cheated on her).",
                            "score": 95,
                            "replies": [
                                {
                                    "author": "YawningDodo",
                                    "body": "Friend of mine slaved away putting her boyfriend through grad school with the understanding he’d do the same for her in turn. She got into her dream program, and then he rug-pulled and said no, he wasn’t willing to move to where she was going to go to school because it would delay the start of his career—and gosh, wouldn’t it be better if she was just a house wife anyway? \n\nShe couldn’t afford to go to school without his support, but she *could* afford to walk away and take a job on the other side of the country, which is where I met her.",
                                    "score": 86,
                                    "replies": [
                                        {
                                            "author": "osiris0413",
                                            "body": "Stories like this make my blood boil.  Yeah, it could delay the first few years of your career, just like she delayed the start of hers entirely for your benefit!  I take a long time to fully trust people knowing how many of them can casually discard or step on friends, family and loved ones (or \"loved\" ones maybe) when it will get them ahead, or walk away when the person caring for you needs your help for once. The men who divorce their wives when they get a serious illness fall into this category.  It's such a sickening cowardice.",
                                            "score": 30,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dimityblue",
                            "body": "Wouldn't you love being a fly on that wall?",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "Gifted_GardenSnail",
                                    "body": "I'm thinking more in the direction of 'fly swatter' and 'hit him where it hurts'",
                                    "score": 31,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Hefty-Analysis-4856",
                            "body": "I would have fought him too.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "peppermintvalet",
                            "body": "Women have sued and [won](https://memphisdivorce.com/tennessee-alimony-law/alimony-10-14-years-married/wife-put-husband-through-med-school-gets-7-5k-mo-alimony/) in cases like that.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "shelwood46",
                            "body": "Women supporting men by working shit jobs while the men go to law or medical school then immediately getting dumped is a common thing. Heck, it was the back story for Annie Potts's character on Designing Women, tale as old as time.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Open-Attention-8286",
                    "body": "A family my parents are friends with tried to set me up with their cousin who needed a green card. They actually seemed surprised when I refused!\n\nI had long since set myself a rule on refusing all blind dates and 3rd-party fix-ups. It's amazing how many people know what terrible partners their friends would be, but think I want to date them anyway.\n\nThe only tom-catting I'll tolerate is the kind with 4 legs and a tail.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PartySr",
            "body": "I really don't understand why his other partners are harassing OP. Do they miss her food or what is their problem? They gain nothing from forcing OP get back together with her ex.\n\nCrazy people.",
            "score": 419,
            "replies": [
                {
                    "author": "Mystic_printer_",
                    "body": "They might be angry at her because he’s telling them he can’t be in a relationship with them because he wants her and the baby back. Or they’re serving as his minions. Either way they are not being reasonable at all.",
                    "score": 250,
                    "replies": [
                        {
                            "author": "Dimityblue",
                            "body": "Or they can't get him a green card and OOP's the easiest/best way to get him documented so he can stay with his One True Love/flavour of the week. The ex must have been great at manipulation.",
                            "score": 135,
                            "replies": [
                                {
                                    "author": "Hefty-Analysis-4856",
                                    "body": "It was a perfect storm. Naive, first relationship for her, and machismo manipulation for him.",
                                    "score": 44,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Alternative_Year_340",
                            "body": "Or he’s telling them that she’s keeping him from his baby, or she’s trying to get him deported, etc",
                            "score": 53,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SnooKiwis2161",
                    "body": "Her ex is likely influencing them to behave that way in an attempt to hurt her, the old \"if I can't have you no one can.\" Maybe I missed it, but I don't remember any of them attempting to force her to reconcile. Seems like they were intent on violence. Either way it's an upside to him: reconcile? Get the green card. Don't reconcile? Minions hurt/ destroy her. He's happy with any outcome.",
                    "score": 56,
                    "replies": [
                        {
                            "author": "Late_Management_3788",
                            "body": "So dark. Ugh.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nailsofa_magpie",
                    "body": "He's probably egging them on and claiming she's trying to keep the baby from him",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Cocotapioka",
                            "body": "That's my guess. There are a lot of women who form a defense force around men who claim that the mother of their child(ren) is a vindictive psychopath who is preventing him from having a relationship with his kid(s). It makes more logical sense than \"they're sleeping with him but upset with her for not being in a relationship with him\".",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cabinetbanana",
                    "body": "The homemade lunch was never the issue.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "molsminimart",
                    "body": "With what a downer that whole story was (wishing best for OP and their daughter and family that is supportive) your comment about \"do they miss her food or what\" gave me a good chuckle.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "WolfGal2374",
            "body": "So she was a “teacher” who wanted to go back to teaching, but then wanted to go to uni to improve her life so she didn’t have to work an office job???\n\nThe flow of this story makes no sense. Like she didn’t move but suddenly the woman who had trespassed didn’t know where she was? Or did she move and I missed it in the story?",
            "score": 446,
            "replies": [
                {
                    "author": "modernwunder",
                    "body": "Also she made friends with “her area’s” police officer. Singular PO?? To the point his wife and kids would babysit OOP?",
                    "score": 266,
                    "replies": [
                        {
                            "author": "WolfGal2374",
                            "body": "Yeah that was also  wild. Like I’ve known police officers, and they would absolutely never send their wives over to, keep some random woman “safe” from a stalker. \n\nSo much of this story makes absolutely no sense at all.",
                            "score": 247,
                            "replies": [
                                {
                                    "author": "modernwunder",
                                    "body": "Also: “uni.” In the US, I’ve only seen kids call it that if they are trying to sound fancy. Source: was a kid.",
                                    "score": 149,
                                    "replies": [
                                        {
                                            "author": "WolfGal2374",
                                            "body": "That’s a good point I hadn’t really picked up on. I was raised in the US but have lived in Australia for over 20 years and it’s Uni here",
                                            "score": 62,
                                            "replies": [
                                                {
                                                    "author": "modernwunder",
                                                    "body": "And I think UK! Been a pet peeve of mine with these BORUs—it always ruins my suspension of disbelief lol.",
                                                    "score": 56,
                                                    "replies": [
                                                        {
                                                            "author": "rusticusmus",
                                                            "body": "Yes, ‘uni’ here in the UK too!",
                                                            "score": 25,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Travel_Jellyfish_5",
                                            "body": "I call it uni online b/c I'm lazy & no want type.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "savvyliterate",
                                            "body": "I'm in the US, but I've taken to calling it uni because of my British spouse. But before him, never used the term.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Late_Management_3788",
                                            "body": "I figured there was some sort of language/writing skills barrier. Like maybe English is her second language or she hasn’t completed HS. I’m not judging but the grammar/writing issues suggested someone with limited English language skills.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "modernwunder",
                                                    "body": "She stated she was born & raised in the US and if her siblings went to college stateside they would not ultimately use that shortening. So there may be a gap in her writing abilities (our education sucks) but if you are at that point you still don’t use Uni. It’s only when you’re exposed to that shortening which is UK-Aus-NZ (in my experience) media or folks. I’ve never heard someone say that who hasn’t had that specific exposure, but combined with the other stuff (PO, job discrepancies, etc), it seems like a slip or a very young person. Given that she has her own house and a job and was a teacher, I wouldn’t say she’s that young.\n\nI don’t normally pick these apart but there are a lot of Sugah-like holes in this story.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Late_Management_3788",
                                                            "body": "I mean who knows.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BroadMortgage6702",
                                            "body": "That's always baffled me about the US. I've had Americans think it's funny I call my school \"uni\", but it's literally called the \"University of ___\", not the \"College of ___\". There's colleges and universities and they serve different purposes, it makes sense to have a distinction.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "modernwunder",
                                                    "body": "University as a word holds more prestige than college, but college is the more general term.\n\nIIRC university as a term is reserved for schools with graduate programs (hence fancier/seems more exclusive).",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Notmykl",
                            "body": "That I find completely unbelievable.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nursepenelope",
                    "body": "The fact that her previous job was working in a daycare, which would be the perfect job for a breastfeeding mother because most daycares will let you slip into another room to BF your baby. But instead the character went to work in a random office... But she says she can't be more than 3 hours away from the baby so why is her not eating lunch even a problem.",
                    "score": 107,
                    "replies": []
                },
                {
                    "author": "gardeniagray",
                    "body": "I stopped reading after the whatsapp lawyer/retainer comments.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "ifartsosomuch",
                            "body": "Me too! The same lawyer happens to specialize in two completely different areas of law, and has two different practices? I'm sure.",
                            "score": 28,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Athenas_Return",
                    "body": "I am so glad someone else noticed this. She was an educated woman who wanted to go back to teaching but she was going to community college online and applying to university? She also called it Uni which no one in the US really does.",
                    "score": 96,
                    "replies": [
                        {
                            "author": "Notmykl",
                            "body": "You cannot speak for the entire nation of 340 million people.  Believe it or not there will be those who say 'uni'.",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EsisOfSkyrim",
                    "body": "Honestly the weird use of Uni (not usually what Americans call college) and stuff increasingly makes this feel racist anti-mexican anti-immigrant bait",
                    "score": 98,
                    "replies": [
                        {
                            "author": "WolfGal2374",
                            "body": "You know what, I completely agree. The fact she also states that she’s a legal immigrant and all these others are illegal kinda makes me lean that way as well. \n\nMy parents would regularly use immigrant labour if they had a fuller schedule that usual, my dad owned an auto body repair shop, and sometimes had a lot of clean up to do. Every single one of the people he used was hard working and stayed out of trouble.",
                            "score": 65,
                            "replies": [
                                {
                                    "author": "Alarmed-Pangolin-154",
                                    "body": "And she says she's from Mexico, but then says she was the only one of her siblings born here.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "WolfGal2374",
                                            "body": "And her immigrant mother had a house to just give to her. It makes no sense",
                                            "score": 21,
                                            "replies": []
                                        },
                                        {
                                            "author": "clauclauclaudia",
                                            "body": "I think she said Mexican, as in ethnicity.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Notmykl",
                                    "body": "She is NOT a \"legal\" immigrant.  She is a natural born citizen, she stated she was the only one born in this country.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "WolfGal2374",
                                            "body": "Yes, I apologise I did get that wrong. I got mixed up with all the details. Thank you for pointing it out.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AwardImmediate720",
                            "body": "What's funny is AFAIK \"uni\" is used almost exclusively in Western Europe, not exactly countries known for having propaganda mills that spread right-wing content.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "marzistars",
                                    "body": "You're obviously not from Europe then 💀",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Active_Match2088",
                            "body": "Yeah, it super is. I was reading this at first thinking, \"Damn, this is similar to what happened to my grandmother until my shitty grandfather divorced her,\" but then red flags started popping up.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thefinalgoat",
                    "body": "She was going to afford a house with a part-time job?? In 2023?? In Texas?? Do you know how expensive it's gotten here????",
                    "score": 48,
                    "replies": [
                        {
                            "author": "Hefty-Analysis-4856",
                            "body": "AND go back to school somehow! Literally with both of them pulling in basically below min wage.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "scarletwellyboots",
                                    "body": "Don't forget that minimum wage was paying for a new baby, two car payments, an immigration lawyer, a gym membership, and $150/month on supplements.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WolfGal2374",
                            "body": "It wasn’t exactly cheap when I moved away in 2001, so I can imagine it’s sky rocketed since then.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Delini",
                    "body": "And the affair partner’s husband found out the affair from her post, when the only detail about who she is is that she shares lunch with a co-worker.\n\nHe would need to already know about the affair to make any connection to the post, and even then the only detail that would match to his situation is “they have lunch together at work”. ",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Gibbie42",
                    "body": "Don't forget she was working part time minimum wage but seems to have all this money to spend. And go to Mexico on.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "ThirdAndDeleware",
                    "body": "Who in the US says “uni?”",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Cute-Scallion-626",
                    "body": "Many daycare workers call themselves teachers. They may teach in some capacity, but mostly they are not trained and licensed teachers. (Some are, just probably not OP.)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lucky_Bit_5649",
            "body": "It’s insane the other woman was calling OP a home wrecker when a) she was the one cheating not only on her husband but with a married man that had a child, a HOME she wrecked and b) OP isn’t even the one that outed her affair to her partner, he found out on his own. \n\nAlso like to note that every single reason OP’s partner provided as to why he cheated could have been so easily resolved by basic communication, “things are starting to feel stale, how can we spice things up in everyday life? Maybe try out some new meals?” Like it is so simple.",
            "score": 45,
            "replies": [
                {
                    "author": "bakerowl",
                    "body": "Well now being in limbo where he doesn't know which part of his family he will never see again is adding plenty of spice.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "wscuraiii",
            "body": ">My routine used to be I wake up 1.5hours before him in the morning and make him lunch and pack everything for him for work and have his breakfast coffee and clothes ready for him to wake up, eat get dressed and head out with in 30mins.\n\nI love my husband to death, but part of what I love about him is he would NEVER even want ANYONE to do this amount of shit for him. This is shocking. I don't give a shit what his schedule is, he chose it. Why is it ENTIRELY his spouse's responsibility?",
            "score": 78,
            "replies": [
                {
                    "author": "AffectionateFig9277",
                    "body": "I feel like she put that on herself. She doesnt say he asked her to, in the same way she CHOSE to starve herself and her baby so he could eat. And then she blames it on him even though he had no say in those decisions. Especially the first one. If my spouse did that for me I'd tell them they dont have to, but if they did it off their own back, I would assume they're doing it cause they want to.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "peter095837",
            "body": "So much of this just...doesn't make sense anymore.",
            "score": 600,
            "replies": [
                {
                    "author": "ExitingBear",
                    "body": "It stopped making sense around update 2.\n\nSomeday, they'll learn that it's ok for stories to have an end.",
                    "score": 137,
                    "replies": [
                        {
                            "author": "ifartsosomuch",
                            "body": "It's the Redditor equivalent of a show making it to season five, when the writers ran out of material in season four, and now all the characters have moved to LA and there's a musical episode and a serial killer is targeting the cast.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_Sausage_fingers",
                    "body": "My warning bells were going off pretty early, but the “I’m in a WhatsApp group chat with my husband, bil, lawyer and paralegal” put me over. No you sure as shit are not.",
                    "score": 244,
                    "replies": [
                        {
                            "author": "Delicious_Win_9848",
                            "body": "People with pending immigration cases would absolutely be in a WhatsApp group with their case lawyer. This is incredibly normal ...",
                            "score": 81,
                            "replies": []
                        },
                        {
                            "author": "earth__wyrm",
                            "body": "Lol same, in what world are you casually WhatsApp messaging (idk what it’s called) your lawyers?",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "bonghits4jess",
                                    "body": "This is actually fairly normal to communicate with immigration lawyers via WhatsApp.",
                                    "score": 52,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NotaBolognaSandwich",
                            "body": "lol that’s when I stopped reading and came to the comments",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "cabinetbanana",
                            "body": "We don't really use WhatsApp in the US. Nor do we say uni. We do call them green cards and have community colleges. I'm still trying to figure out where this woman thinks she lives.",
                            "score": -9,
                            "replies": []
                        },
                        {
                            "author": "WakeUpBetter",
                            "body": "> We don't really use WhatsApp in the US.\n\nI don't doubt your personal experience, but WhatsApp has a *ton* of users in the US. Especially people who weren't born in the US (like many of the key people in the OP). I wouldn't consider OP's use of WhatsApp suspicious at all.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "cabinetbanana",
                            "body": "That's a good point about people not born in the US. I hadn't even considered that. Thanks for correcting me.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Notmykl",
                            "body": "I think it's funny she thought she could get back the money she'd paid in for the immigration case.  LOL no.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sleepyjess4",
                    "body": "Yeah. Referring to college is uni in the US is not exactly common phraseology. I thought maybe she was living somewhere else, but then the later post say she's in Texas. 🤔",
                    "score": 87,
                    "replies": [
                        {
                            "author": "thatjoachim",
                            "body": "She might very well be bilingual, it tends to influence the way you talk (which words come first, the structure of the sentences, etc)",
                            "score": 58,
                            "replies": [
                                {
                                    "author": "cremeriee",
                                    "body": "I’m bilingual. I noticed she also mixes up words that kind similar and will write the wrong one (scars/scares, hypocritical/hypothetical) which I tend to do if I’m tired. Her English is pretty riddled with errors but they’re all plausible ones, to me anyway.",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "author": "stranger_to_stranger",
                                            "body": "I unfortunately giggled a little when she said \"job haunting\" instead of job hunting ",
                                            "score": 56,
                                            "replies": [
                                                {
                                                    "author": "cremeriee",
                                                    "body": "Sometimes it can be really funny! I was trying to type “L.A.” once and wrote “Ali” instead. Not even close!",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "cabinetbanana",
                                                    "body": "Looking for a job is pretty haunting these days.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "stranger_to_stranger",
                                                            "body": "True, maybe she meant haunting",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PupSquiggly",
                            "body": "Uni is how they say college in Mexico. So, if she's Mexican, she's probably gonna say it as uni (which she does say she's Mexican).",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "bored_german",
                            "body": "What do Mexicans refer to it as? She says her family is all immigrants as well, so maybe she just learned it from them",
                            "score": 70,
                            "replies": [
                                {
                                    "author": "sleepyjess4",
                                    "body": "Well universidad is university in Spanish, so it's possible. It just made me question the story.",
                                    "score": 72,
                                    "replies": [
                                        {
                                            "author": "blueskies8484",
                                            "body": "She says she started community college halfway through the semester, if you look at the dates. This story is complete bull. For a lot of reasons, the uni and the start date are just two.",
                                            "score": 63,
                                            "replies": [
                                                {
                                                    "author": "RedDeadEddie",
                                                    "body": "Online universities aren't beholden to standard school calendars; DeVry for example starts online classes every 8 weeks.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SailorLupis",
                                            "body": "Eh, there are a few things in this post that make me think she’s probably done both university and college. Being in the same boat, I sometimes use “uni” to differentiate between the two, usually when it’s relevant but sometimes subconsciously. It’s less of a mouthful than saying “university” or any of my schools’ names",
                                            "score": 26,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HealthyMaximum",
                            "body": "Uni for Universidad is not uncommon in Spain, I believe. \n\nMaybe it’s the same in Mexican Spanish?  \n\n… which was probably the primary language spoken in OOP’s home, even if she’s fluent in English herself. ",
                            "score": 46,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LuckyNeko14",
                    "body": "Yep - I got suspicious when the side chick’s fiancée turned into her husband less than a month later. Them getting married was not part of the update (would have been a major point to add to the story) and probably wouldn’t have happened if the fiancée knew about her cheating during all this. Of course, it is still possible - I just found it a bit odd.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Toosder",
                    "body": "I was suspicious pretty early on. I am definitely not sold on the truth of this. But I will say one thing. If anybody knows where this guy got his door mat, I would love to know because I need a new one. Like if the story is true, I feel for her, and I hope she finds a spine somewhere.\n\n\nIf it's true, to me the cheating wasn't the first problem. It was the waking up an hour and a half early to be a 1950s housewife to a 1950s abusive husband, after having had a kid, and sacrificing your own health and well-being and the health and well-being of your baby for your husband. She has to carry some of that burden as an adult with a baby. She's just as responsible for not standing up for that infant as he is for being a dick about it.",
                    "score": -22,
                    "replies": [
                        {
                            "author": "Traditional_Lab1192",
                            "body": "Chill out, geez. She came to her senses and left the guy. Its not like she’s still with him. Even looking back, she can’t believe how much she did for him. Humans choose the wrong partners but she’s learned from it.",
                            "score": 95,
                            "replies": []
                        },
                        {
                            "author": "sharraleigh",
                            "body": "It read like some bad wanna be novelist from the get-go for me. Too many unnecessary details that are thrown in there.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Toosder",
                                    "body": "I've watched enough cops to know that people embellish and include a lot of details when they are lying.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "cabinetbanana",
                                            "body": "In the BORU subreddit, there are two types of liars...*chung chung*",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TimeInitial0",
                            "body": "Yesh even when reading that bit first time i said to myself i could never wake up at 5 am everyday to make lunch for someone. Whst happened to mesl prepping for 2-3 days??\n\nWhy would she skip her portion of lunch to give him 2 portions instead of you know just prepping a bigger quantity in the first place?? \n\nWhy is missing out on having food whilst breast feeding to give him a bigger portion and saying this is due budgeting but then paying 150 a month on stupid gym supplements for husband?\n\nShe literally made herself the sacrificial lamb in favour of giving her husband everything. And he still cheated",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Live_Angle4621",
                                    "body": "If you have a baby you often have to wake at 5 anyway ",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Trillion_G",
                                    "body": "Food costs money.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "TimeInitial0",
                                            "body": "No shit. And you eould have more money to spend on food so everyone has enough if you didnt prioritise spending 150 a month on supplements. Or buying tools and parts for a non functioning motorcycle. As a household with a baby and breastfeeding mum they both collectively decided to splurge on a monthly basis on the non essentials i mentioned above, whilst she starved herself by going without food",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Toosder",
                                    "body": "Yeah, she's not exactly a sympathetic narrator. People are being mad that I'm saying that but she sacrificed the health of her infant allegedly to give this man two meals. I'm not going to have much sympathy for a mother like that.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Nullspark",
                    "body": "It's so god damn verbose too.  My vote is writing assignment ",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "yvesdot",
            "body": "Worth noting that this is one of the many byproducts of deportation law—without taking a stance on the veracity of this specific story, it is absolutely true that many women are forced to make this kind of decision every year. When someone has to choose between the extraordinarily high stakes question of whether her partner will be potentially sent back to a country he has no stability in, let alone whether her child will have access to both of their parents, and the question of whether she will face constant interpersonal abuse and harassment, it is impossible for her to make a decision with full agency and comfort. It's similar to the issue women who are dependent on their husbands face—when you want to leave, but you are faced with a choice that doesn't seem worth it, the material result is that you often physically *cannot* leave. It doesn't matter how spectators feel about what the husband deserves. Women will continue putting themselves in danger because they are afraid of what they quite reasonably feel is a worse outcome.",
            "score": 186,
            "replies": [
                {
                    "author": "AriaCannotSing",
                    "body": "AITA for feeling I wouldn't mind an ex like this getting deported? Children don't need a philandering liar in their lives.",
                    "score": 136,
                    "replies": [
                        {
                            "author": "Turuial",
                            "body": "Not in my opinion, at least. Notice how he only started coming around more, to see his daughter, because he's out of work and OOP's mother would feed him?\n\nEDIT: corrected the auto-correct.",
                            "score": 62,
                            "replies": []
                        },
                        {
                            "author": "Toosder",
                            "body": "No but not at the cost of good people also being deported who shouldn't be.",
                            "score": 43,
                            "replies": []
                        },
                        {
                            "author": "Fickle_Grapefruit938",
                            "body": "There is a (small) possibility that the lying philanderer is a good father, and depriving your kid of their father is not an easy choice.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "kenyafeelme",
                                    "body": "Can you be a good father if you’re a lying philanderer? Seems like one cancels the other out.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "FullMoonTwist",
                                            "body": "They're entirely different sorts of relationships. \n\nYou can, theoretically, cheat on the women who you have a romantic connection to, but still be a decent parental figure to your children. Just like you can be a cheater, but be a decent friend or uncle. \n\nPeople have different concepts of what is ok or just in different relationships. Parenting takes a different skill set *entirely* to maintaining a respectful and healthy life partnership.\n\nHe may not be, in the end, but when the kid is so young and he's unproven either way, it's hard to say he would *definitely* be a bad father.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "kenyafeelme",
                                                    "body": "He’s literally stealing resources from the home to give to his mistress and endangering the health of his child and the mother of his child. That doesn’t even touch on the STDs and modeling toxic relationship patterns for his child. \n\nThere is no question he’s an awful excuse for a parent",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "RedDeadEddie",
                                                            "body": "I think there's a difference between doing those things maliciously and doing them carelessly and selfishly. Her ex wasn't stealing food from the baby in his mind, because he had no idea where the food came from or how much of it there was. He was so disconnected that I can't imagine he had any idea his wife was going hungry; I doubt she ever said anything about it.\n\nNow, to spell this out *very clearly*, I don't condone his actions in the slightest. He's a human trash bag.\n\nBut likewise, I doubt he knew about the STI, or that the AP would start harassing OOP. He's an idiot and a philanderer, but his intentions were selfish joy, not harm to others. Personally I think *that's* what makes him an unfit parent.",
                                                            "score": 0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "kenyafeelme",
                                                            "body": "Lmao yeah. He’s so disconnected from his wife and child he doesn’t even realize he’s starving them so he can give food to his side piece. He irritates me so much it’s hard to say anything about him that’s not dripping in contempt.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "cabinetbanana",
                                            "body": "Personal opinion: You can be a terrible husband/partner and a good father. You can also be a good husband and a terrible father. They are very different relationships that intersect in some ways but are ultimately separate.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "kenyafeelme",
                                                    "body": "You can’t be a good parental figure if you’re modeling bad behavior. Being a bad romantic partner will imprint on your children and they will go on to engage in the same toxic patterns unless there is an intervention.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "cabinetbanana",
                                                            "body": "I don't disagree, but there are ways to be a poor romantic partner that your kids don't know about. Is your child going to know that you don't attend to your partner's sexual needs? Or that you don't use their love language? People also hide cheating from their families. If you have a secret affair that even your partner doesn't know about, you're still a bad partner. But that's not imprinting on your kids because they have no idea.\n\nI think your scenario is most common, but there are a lot of ways to be a poor partner that have nothing to do with your role as a parent.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "kenyafeelme",
                                                                    "body": "We’re not talking about just being a poor romantic partner in general and not using preferred love languages, we’re talking specifically about cheating on your partner and lying to them about it. \n\nYour statement that you can be a good parent while being a lying philanderer assumes that the person who didn’t get caught doesn’t raise any suspicion or cause damage to their partners self esteem while trying to cover up the lying. It assumes that children never see those inconsistencies and learn how to navigate relationships using those patterns. That they don’t feel the tension between their parents when they’re pretending everything is fine when it’s not. \n\nThe damage from cheating doesn’t come only from getting caught.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cabinetbanana",
                                                                            "body": "I apologize for misunderstanding your comment.  \n  \nI was responding to the specific statement: \"Being a bad romantic partner will imprint on your children and they will go on to engage in the same toxic patterns unless there is an intervention.\" \n\nIf we're talking about cheating that your partner becomes aware of, sure that causes problems in the household. And as I said, your scenario is the rule, but there are always some exceptions to it. People lie. Some people are even \\*really\\* good at it. \n\nAgain, though, I am sorry if I didn't understand what you meant.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "kenyafeelme",
                                                                                    "body": "No worries. I meant the bad romantic partner in the context of being a lying philanderer. \n\nBut to your other point, Im talking about when the cheater *doesn’t* get caught, there is still damage to the relationship and the children within the relationship. (Not always as I’m sure there exists a person out there who was able to hide it very effectively.) \n\nCheaters think they’re better liars or sneakier than they actually are. They frequently leave evidence that doesn’t get called out because it’s not airtight proof of the infidelity. Kids pick up on the fact that someone isn’t completely honest and it’s swept under the rug. Or they’re a little more emotionally distant. It’s these little papercuts of dishonesty and emotional manipulation that cause all sorts of damage to the kids when they try and navigate adult relationships of their own. Sure as far they know mom or dad didn’t cheat, but that doesn’t mean the cheating they don’t know about didn’t mold how they view relationships because of all the other toxic patterns they experienced to cover up a secret relationship.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "cabinetbanana",
                                                                                            "body": "Yes. Death by a thousand cuts. \"I knew there was something weird about my parents' marriage, but I didn't know what... it just wasn't *right*.\" \n\n100% children learn about romantic relationships from their parents. And kids are much more perceptive than we give them credit for. But so many people think they're getting away with things that they just aren't!",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "kenyafeelme",
                                                                                                    "body": "For real it’s so depressing. Poor kids almost don’t stand a chance and adult relationships are already tough to navigate",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Nullspark",
                    "body": "People should avoid dating people without a way to stay in the same country as them.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "worstkitties",
            "body": "I absolutely love that she\n\n1. Showed up at his work \n2. With dessert \n3. And the baby \n\nProbably the most painful moment of her life but whether she meant to or not she blew his affair up.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Chance_Loss_1424",
            "body": "Damn I hope she’s okay",
            "score": 16,
            "replies": []
        },
        {
            "author": "blythe_blight",
            "body": "run-ons galore, did anyone else find oops writing style just...exhausting to read?",
            "score": 124,
            "replies": [
                {
                    "author": "ro_ro_ro_roadhouse",
                    "body": "It's the poor grammar and overexplanation mid-sentence.",
                    "score": 56,
                    "replies": []
                },
                {
                    "author": "Ok-Bird1249",
                    "body": "I stopped reading and skipped to the comments because I genuinely could not understand what she was saying. \n\n>His coworker he told me no longer worked there, who I’d caught him talking too friendly to and I told him it bothered me and I had him remove from everything and block on whatsapp not only still worked there but was eating the lunch I freshly prepared for HIM and he was eating the leftovers.\n\nThis especially tripped me up.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "ViedeMarli",
                            "body": "I think it's meant to say\n\n> \"His coworker, who he told me no longer worked there (the friend I told him that I was uncomfortable with him talking to so intimately, and had him remove from everything including WhatsApp), not only still worked there, but he was giving her his lunch, that I made fresh for him, and eating the leftovers instead.\n\nThat's the best I could do it, but I know I removed some of her over-explained context.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "OliveBranchMLP",
                            "body": "i tripped on the same sentence.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "piemakerdeadwaker",
                    "body": "Yes, the sentences are so awkwardly formed I thought I was having a stroke.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "candyhorse6143",
                    "body": "I’m still not sure what happened, even with the first post about the food.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "sarcosaurus",
            "body": "\"it’s like 3 girls who are her friends plus a few others who have slept with my ex who harass me because he tells them he loves me and wants me back\" what in the charles manson",
            "score": 14,
            "replies": []
        },
        {
            "author": "tacwombat",
            "body": "Her ex is absolutely infuriating, causing all this shitnanigans and harassment.\n\nThis took me out (though she may have typed this unintentionally):\n\n>he got fired and is job haunting\n\nEx was so excommunicated, he couldn't get a job in corporeal form.",
            "score": 12,
            "replies": [
                {
                    "author": "Avlonnic2",
                    "body": "I liked that, too.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConfuseRye",
            "body": "\"Homewrecker\" says the engaged woman who slept with a married man, oh the lack of brain cells in that one.\n\nAlso the husband is a POS. Glad she left!",
            "score": 24,
            "replies": []
        },
        {
            "author": "tarekd19",
            "body": "I haven't finished yet but I doubt he was that decent of a father if:\n\n>•life had gotten boring\n\nwith a 6 month old, especially his first.",
            "score": 12,
            "replies": []
        },
        {
            "author": "ChrisInBliss",
            "body": "OOPs ex is such a garbage person. Clearly everything was just for a green card",
            "score": 10,
            "replies": []
        },
        {
            "author": "monogll",
            "body": "Wake up 1,5h before husband to prepare his food, pack everything for him for work, HAVE HIS CLOTHES READY FOR HIM (!!), prepare dinner, gives up on food so husband can have more (as a breastfeeding mom!), all while going to work part time so she can pay for HIS gym membership and supplements…all for a man, who has treated her like shit before. \nAre you kidding me?? He sounds like an ungrateful piece of shit and a big baby, but am I the only one who feels like OP has zero self respect and willingly and happily cared for that adult second baby in the house? \nSorry if this sounds utterly harsh, but I will never understand such women (and have even less respect for men like these).",
            "score": 10,
            "replies": []
        },
        {
            "author": "rattlestaway",
            "body": "What a psycho that other woman was. Hopefully she gets deported. No doubt the ex told oop blabbed to her fiance. Ppl like the ex are so two faced. They'll tell u anything and say the opposite once u leave. Ugh. I wouldn't let such a nasty person near a baby",
            "score": 9,
            "replies": []
        },
        {
            "author": "Specialist_Passage83",
            "body": "That poor woman.  I hope OOP is doing OK, but I have a feeling that this isn’t over quite yet.",
            "score": 23,
            "replies": []
        },
        {
            "author": "ForsakenPercentage53",
            "body": "Aren't you liable to financially support the person you sponsored, even if you divorce?",
            "score": 21,
            "replies": [
                {
                    "author": "oofieoofty",
                    "body": "Yes",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "SmartQuokka",
            "body": ">I’m so disgusted by him now that I don’t even like him kissing on my daughter. He does come to see her when my mom watches her more now that he got fired and is job haunting.\n\nJob haunting is somehow appropriate.\n\n>Police have been useless aside the friendly officer and his wife. It’s not just that girl now, it’s like 3 girls who are her friends plus a few others who have slept with my ex who harass me because he tells them he loves me and wants me back which I don’t know if he’s stupid or is manipulating them to attack me for him.\n\n>Either way I’ve deactivated all of my social medias and the ones I do use are all private or with a different name so I can just use but I just don’t post.\n\nWTF, there is no need to harass OOP, he is with them. If their goal is to break OOP and him up then thats already happened.",
            "score": 19,
            "replies": [
                {
                    "author": "AnAwkwardStag",
                    "body": "Job Haunting is getting LinkedIn notifications that someone was looking at your profile",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sercorer",
            "body": "TLDR - girl marries loser thinking loser will change, loser doesn't change, gets worse, girl realises she deserves better, girl leaves loser. It's a tale as old as time.",
            "score": 18,
            "replies": [
                {
                    "author": "readinganything",
                    "body": "Edit: people told girl what would happen and girl keeps saying no I won’t make any harsh decision bc she still keeps her hope up",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "DrSnidely",
                    "body": "This is the less common version. More often it's, \"girl knows he's a loser who's never going to change, but she sticks around anyway because she has no sense of self worth and he knows exactly what to say to her to make her think she'll never do any better.\"",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OrcEight",
            "body": "Thank you **OP** for all your work in putting OOP's posts together.",
            "score": 10,
            "replies": [
                {
                    "author": "LucyAriaRose",
                    "body": "Thank you 💜",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SubstantialPlan7387",
            "body": "How do these guys find partners who not only sleep with them,  but have their kids, support them, and help them with heavy issues like immigration? Not only that, he sleeps with other girls and then sends them to harass his ex to get back with her? What story could you even tell them? “Hey, I know we are sleeping together, but I really love my ex. Mind harassing her to get back with me, while we are hooking up on the side?”\n\nJust when I think people’s self esteem can’t get lower, I read this story.",
            "score": 8,
            "replies": []
        },
        {
            "author": "lewdpotatobread",
            "body": ">After everything I’m disgusted to think back of a time I slaved for him. I look at him and it’s just not the same.\n\n\nThissss. I remember i used to do so much for someone i was in love with. Id get up early and prep breakfast, prep a lunch box. Then before he was home, i'd have dinner ready.\n\n\nBut he'd still get pissy at me. What did i do all day? Uh, i played on my phone and waited for you to come home. I prepped food for your breakfast, lunch, and dinner for while im visiting. I prepped food for you to eat when im not here. I did your laundry, that you put off doing for 3 months and folded all your clothes. He'd huff. He'd be upset. He was still pissed off at me. It was an LDR  LMAOOOOoooo \n\n\nI tried to hang with him a couple years after the breakup and i was like, \"wtf have you always been this annoying? This stupid? Damn what did i see in you tf lmao\"",
            "score": 7,
            "replies": []
        },
        {
            "author": "cottondragons",
            "body": "What gets me is how bad this was even aside from the cheating.\n\nThey were earning next to nothing and the _breastfeeding wife_ had to skip meals to allow him double portions, and yet he spent $150 a month on a gym membership and supplements?! Girl WHAT?\n\nFind a man who respects you please and who doesn't value his health over yours and his baby's.",
            "score": 7,
            "replies": []
        },
        {
            "author": "StrongArgument",
            "body": "So many weird plot holes. Why didn’t she make more food instead of giving him her lunch? How could an immigration lawyer also be a divorce lawyer? What kind of infection do you get from peeing outside near cow poop, and then pass to a partner? Did the baby change gender in there? 🚩",
            "score": 310,
            "replies": [
                {
                    "author": "KanishkT123",
                    "body": "An immigration lawyer handling marriage based green card and residency is reasonable and possibly crucial depending on how the green card process is affected post separation. So she may be getting the same lawyer to draw the paperwork up, as when they got married they may have needed to have the immigration lawyer draw up paperwork, etc. That part feels okay to me.",
                    "score": 129,
                    "replies": [
                        {
                            "author": "TheBlueMenace",
                            "body": "Didn’t the immigration lawyer specifically say he couldn’t help OOP and that the other part of the firm would need to handle the devoice? Or did I misunderstand something?",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "KiloJools",
                                    "body": "That's what I read, too. I don't recall reading anything about a divorce lawyer. Just immigration.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "DaddyBoomalati",
                                    "body": "No. The lawyer was a partner in two different firms and couldn’t take payment from one firm and transfer it to the other. The lawyer didn’t change, the firms did.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Toosder",
                            "body": "Wouldn't the lawyer be able to use the retainer for the family situation? I mean even if you had a contract with a client stating this retainer is for immigration stuff, and their situation changed, wouldn't you at least feel ethically responsible ro use the money for the new situation if you were going to represent the same client? Maybe contractually you wouldn't be required but I can't see an attorney feeling okay with saying well I have to keep the money even though you're not doing this situation anymore and you have to pay me more money for the new situation. I would never do that to a client but I work in a very different field of law.",
                            "score": -3,
                            "replies": []
                        },
                        {
                            "author": "blueskies8484",
                            "body": "Representing her in a divorce against a former immigration client is almost certainly a conflict of interest, so that didn’t make sense to me either.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "KanishkT123",
                            "body": "Yeah but the way green card paperwork works, she's the sponsor and therefore technically she's possibly the client who is responsible for handling payment. So it wouldn't be a conflict, it would just be the same client. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Disastrous_Injury299",
                    "body": "When you’re on a fixed income and you have enough money to buy groceries for two meals, then he asks to double his one meal, he ended up with two meals, making her portion zero meals",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "skywarka",
                    "body": "The first question just read as poverty to me, it's entirely possible to just not have enough money for more food. But the longer things went on the weirder it got, in addition to your points *both* partners in the affair were immigrants with unstable status who blew up their immigration process by cheating on their citizen partner? And despite this, nobody involved actually got deported, since then the story would be over.",
                    "score": 272,
                    "replies": [
                        {
                            "author": "Brave_anonymous1",
                            "body": "I am not surprised by both affair partners cheating. They both used their official partners to get legal status. They didn't feel love for their oficcial partners, didn't chose the relationship, didn't appreciate their partners as people. All they needed is to find a US citizen, love bomb them, get married, get legal status. \n\nAnd poverty: he works below min wage, she works part-time min wage. And this guy was spending $190 each month to look macho, while his breastfeeding wife was skipping meals to save money.",
                            "score": 56,
                            "replies": []
                        },
                        {
                            "author": "AlizarinQ",
                            "body": "The place they worked employed a lot of people under the table so it makes sense to meet others there that also can only work under the table",
                            "score": 35,
                            "replies": []
                        },
                        {
                            "author": "notsam57",
                            "body": "it sounds like poverty but oop owns a house she was gifted from her mother while having multiple older siblings that live in different states, except the one she went to stay with for a week?",
                            "score": 100,
                            "replies": [
                                {
                                    "author": "Pelageia",
                                    "body": "House isn't money, though. It isn't uncommon for people to inherit/own a house/apartment but being otherwise on a very restricted budged because their income is small (+ a house probably also has expenses even if it is owned). \n\nHer family might not have been helping with money for a multitude of reasons; maybe they have their own money issues, maybe they didn't know OOP has money issues (and she might have not told bc she wants to be independent, was ashamed or whatever), maybe they thought it should be enough that OP got the house, maybe most of them are not close and do not really keep contact etc.",
                                    "score": 120,
                                    "replies": [
                                        {
                                            "author": "swordrat720",
                                            "body": "Exactly. You can own the property outright, but you still have the property taxes, school taxes, water, gas, electric bills. Even not using the place, those all have minimum payments. And those add up before you realize it.",
                                            "score": 45,
                                            "replies": []
                                        },
                                        {
                                            "author": "MOGicantbewitty",
                                            "body": "Yeah but op insists her mother just gave her the house because she was going to school near there and it just made sense because it was paid off. She was also already in college. And she was a teacher before she became a full-time mom? And she was going to go back to teaching to make more money than her husband, but now she's in community college?",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "author": "Trala_la_la",
                                                    "body": "There are a lot of daycares with an education element with workers who call themselves teachers even though it’s not a salaried teaching position. She references it as a daycare job elsewhere in the posts.",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "author": "MOGicantbewitty",
                                                            "body": "Daycare positions do not pay much more at all than minimum wage. \n\nAnd she said her mother gave her the house because she was going to college 10 minutes from the house and her siblings were too old to want the house? Because they were a decade older than her? Regardless, she was supposedly already in college and that's why her mother gave her the house. Her teaching job supposedly made twice what her husband's job makes. But she quit that job to live on half of the income and can totally go right back? Because she went to college already... But now she's in community college? \n\nIt's not just this. Every single thing she has said has a hole in it. You could come up with reasons for each individual thing that doesn't make sense, but when there are 25 to 30 different savings in these coasts that are conflicting and don't make sense at all, the post is a load of bullshit.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Trala_la_la",
                                                                    "body": "I’m not going to get into all the other plot holes but she literally said she got paid minimum wage and her husband less than minimum wage because he was paid under the table. \n\nI assume the college she was talking about was the community college that she has not graduated from and wants to start attending again. Lots of people start college without finishing.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Cute_Assumption_7047",
                                    "body": ">it sounds like poverty but oop owns a house she was gifted from her mother\n\nIm poor money wise but i own my own home thanks to my grandparents/parents hard work. I would not be able to buy a house, not even shoeboxed sized. I bought my grandmothers house from my parents with money they lended me. But an official mortgage,  dream on...",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "ehs06702",
                                    "body": "Being house rich and cash poor is common, though.",
                                    "score": 56,
                                    "replies": [
                                        {
                                            "author": "MOGicantbewitty",
                                            "body": "Much less common when your mother gives you the house fully paid off though. Supposedly. Because you're going to college in the area and it just makes sense.",
                                            "score": 15,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CutieBoBootie",
                            "body": "Lawyer fees also tend to just evaporate money. But yeah after a while it started to feel like weirdly anti-immigrant",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "definitelynotjava",
                            "body": "Just because a green card application did not go through doesn't mean that the visa is automatically voided. They may be on non-immigration visas like student or work which is perfectly valid for however long it was issued for",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "skywarka",
                                    "body": "I'm aware it's possible, it just adds to the number of contrivances and coincidences the story is adding for the sake of drama, and makes it feel less like something that really happened.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ookoshi",
                    "body": "I agree the story has some major holes, but the lawyer thing is not one if then. A combination off criminal law, immigration law, and/or family law is not all that uncommon, because there's a lot of overlap between those.  Both family law and criminal law issues can have consequences that impact a person's immigration status.",
                    "score": 85,
                    "replies": []
                },
                {
                    "author": "arsenal_kate",
                    "body": "She answered most of them if you actually read the post:\n\nThey were on a strict budget, so she couldn’t just make more food, they couldn’t afford a whole extra meal.\n\nThe infection being from cow poop was a ridiculous lie her ex made up to try to pretend he didn’t give her an STD, but then she showed him her test results and he admitted it. \n\nThe lawyer has different partnerships for his different practice areas (feels like a lot of work but not impossible). \n\nNot sure where you saw the baby change gender?\n\nIt gets boring when people turn every post on this sub into truth detective time.",
                    "score": 204,
                    "replies": [
                        {
                            "author": "TheBlueMenace",
                            "body": "I thought the lawyer was saying he could give references but he couldn’t handle it himself as it was a different part of the firm that handled devoice.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "MOGicantbewitty",
                            "body": "How about her insisting she was going to go back to teaching and make a lot more money than her husband did, but now she's in community college? After her mother gave her the house that was fully paid off because she was going to be going to college in the area and it just made sense, but that was before she ever met her husband and gave up her full-time teaching job?",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "omg_stfu_wtf",
                                    "body": "Didn't she say she taught at a daycare for immigrant workers? Daycare teachers aren't usually  certified.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "courierblue",
                                    "body": "She was a daycare worker (a lot call their employees teachers) and now she’s probably going back for early education to become a primary or above teacher.\n\nHer previous credits might have been in something else, didn’t transfer because of time or maybe she failed the first time.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HedgehogNo8361",
                            "body": "Agree 💯\n\nI had to re-read some parts bc her writing was a bit confusing; there are no plot-holes (that I can see)",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "mcginge3",
                                    "body": "She referred to him as her husband and had a baby with him but claimed it was “early on the on the relationship”??",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Toosder",
                            "body": "I do not. Absolutely do not buy a mother allowing her infant to go without food because her husband needs asecond meal at lunch. But if that mother was so weak-willed as to let her infant go without feeding, she wouldn't also be strong enough to up and leave after a few photos at a lunch break. I'm sorry I don't buy it.",
                            "score": -11,
                            "replies": []
                        },
                        {
                            "author": "arsenal_kate",
                            "body": "Where did she say the baby went without food?? She, the mom, was skipping her own meals, but did what she could to have enough food to keep her milk supply up.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Toosder",
                            "body": "I love that people are justifying a mother going without meals as acceptable. If she is breastfeeding, her lack of a good diet is going to hurt both her and the baby. There's no getting around that.",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "arsenal_kate",
                            "body": "Who is justifying it? “This is not a plot hole, she explained the situation” is not the same thing as “it’s good that she skipped meals so her husband could feed his side chick.” You said you didn’t believe the story because no breastfeeding mother would ever skip a meal, but OOP explained in detail how she managed enough food to keep her milk supply up, it was just a challenge. Explaining that is not saying it was acceptable or a good situation for her.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Toosder",
                            "body": "I just don't buy it. The character willing to sacrifice her health and her infant's health just so her slave owning husband can have two meals instead of one being the same character also having the spine to leave immediately seeing him eating lunch with someone and magically getting a hold of her attorney the same night and cone up with answers? Nope. It's bad writing. ",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mabel_Waddles_BFF",
                    "body": "It sounds like they’re on a very tight food budget, so his extra food would’ve come out of her portion. \n\nImmigration lawyers would need to have some experience in family law as well given how many people are sponsored by spouses. \n\nThe ex was just full of it and coming up with any excuse for the STD, hence the nonsense about cow dung.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "LuementalQueen",
                            "body": "At least it wasn't a koala.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "WarmProgrammer9146",
                            "body": "But they had money for his gym membership and supplements?? ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Bex1218",
                                    "body": "That came out of the food budget I'm guessing. Which is fucking idiotic.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "thievingwillow",
                                    "body": "Or like, sell the guest bedroom TV; they have at least two more, plus a game system. People make dumb financial decisions, sure, but the rest of it far from paints a picture consistent with not being able to at least buy some potatoes or beans and rice for yourself when you’re breastfeeding. If you get even just $50 for the TV, or cut down by one new video game or a few months’ protein powder, that’s a *lot* of poor person food you can afford. (Source: was poor person.)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MarlenaEvans",
                    "body": "The other woman doesn't know where she lives but also she was at her house.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "MOGicantbewitty",
                            "body": "And her mother gave her the house when she was going to school because it just made sense, and she was going to go back to being a teacher making good money when she left her husband, but now she's in community college? Have at least a bachelor's to be a teacher.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AphasiaRiver",
                    "body": "Not sure if this is a plot hole but it confused me. She said she wanted to go back to teaching and later said she’s looking to take classes. Was she changing careers?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "DianaSt75",
                            "body": "My impression was she used to work in a daycare and now wants to get more qualifications, likely in that area or closely related. I am not sure how that works in the US, but maybe she wants to transition from daycare to teaching in primary school or something? Or extend her abilites in working at a kindergarten?",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "PreppyInPlaid",
                            "body": "In some daycares, the childcare workers are called teachers.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CanofBeans9",
                    "body": "\"Why didn't she make more food instead of giving him her lunch?\"\n\n\nSome people are poor and struggle to make ends meet especially with a new baby. She owns her home because it was inherited, so it doesn't mean she has a lot of money spare.\n\n\n\nAlso he was lying about the infection coming from peeing outside, and admitted to sleeping with AP once he saw her doctor's report that said it was an STD. He is a clown who thought he could lie his way out.\n\n\nAnother woman shared a story about staying with her abusive husband so that he could keep seeing his son. Is that what you meant or did I miss something?\n\n\nNo idea about the lawyer thing, i am not a lawyer",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "TheNightTerror1987",
                    "body": "I'm feeling rather lost myself.  Did I mix up my BORU posts due to exhaustion, or was this a post about a woman who wants to get back to teaching and then was talking about going to community college and later \"uni\" when she lives in Texas?  I could barely figure out what the hell she was talking about when she found out about the affair, I gave up trying to figure it out and just kept reading in case I could deduce it from the rest of the post.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "CanofBeans9",
                            "body": "Yeah idk.\n\n\nI wondered if she meant she had her Associate's or some kind of certificate, or if she worked at a job like teaching private music lessons or tutoring. In that case, she'd be going back for a Bachelor's, or if she already has a Bachelor's she'd be going back for a Master's in Education. Because different US states all have different requirements, I don't know what the Texas requirement to be a schoolteacher is. It's also possible to teach at a private school with different qualifications than you need for public school.\n\n\nBut, she could also just mean that since she's been out of the workforce for a while, she wants to take a couple of classes at community college or a university to brush up on her skills and resume. She doesn't really clarify that",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Beka_Cooper",
                                    "body": "She said she met her husband while working at a daycare, so I assumed she meant \"teacher\" as in \"preschool teacher.\"",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "draculasbloodtype",
                    "body": "She trusted this man but just so happened to ALSO have a running folder of all the transgressions he had made online with other women? Like tracking whose stories he gave a heart to on instagram? Who has time for that shit?",
                    "score": 54,
                    "replies": [
                        {
                            "author": "Commercial_Eye8016",
                            "body": "lol, I don’t really see that as a plot hole. This is unfortunately very common. Possessive partners who claim to love their spouse, but keeping track of things they find as transgressions to start an arguement. Or couples where cheating took place, and they reconciled, but the person never truly moved on… so they’re constantly going through their partners phone, following them, asking for confirmation. Because they think this will prevent cheating from happening.",
                            "score": 77,
                            "replies": [
                                {
                                    "author": "Cute_Assumption_7047",
                                    "body": ">This is unfortunately very common. Possessive partners who claim to love their spouse, but keeping track of things they find as transgressions to start an arguement. \n\nMy ex just to do this and still does.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Toosder",
                            "body": "She's a complete and absolute doormat in the first three paragraphs but then has the spine to show up at his work and take photos and leave that day. She's an absolute doormat who lets her own feeding and help go to the sidelines to give him a second helping of food while she's nursing an infant.\n\n\n And the timing sounds like, but I'm willing to be corrected, that she reached out to her attorney that evening and they had a big conversation? That's never how that works.",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheBeautyDemon",
                    "body": "And on her days off she can now sleep in? What about the baby?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "HoundstoothReader",
                            "body": "I assumed that the other woman no longer knowing where OOP lives and OOP sleeping in on days off meant that OOP is staying with family or friends: away from her house and with people who help with childcare. As for the teaching-without-a-degree thing, I assumed daycare. Lots of daycare workers I know call themselves teachers.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "TheBlueMenace",
                                    "body": "Or not having to get up to cook for 1.5 hours every morning counts as sleeping in.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RikkitikkitaviBommel",
                    "body": "More food = more money spent, so the skipping meals was for financial reasons which she does explain in her posts.\n\nShe asked to transfer to the divorce & family law DEPARTMENT of yhe law office. Again, this is written in the post. If I'm not mistaken some law offices have different departement for different topics.\n\nShe called his bullshit from the ex's story the infection came from cowpoop. And later he does backtrack that when she shows him her testresults. This also was in the post. OOP was not lying here  ge was trying to bs her.\n\nTheir kid stayed a girl throughout the post. Some commenters shared their own stories in which the commenters mention sons. OOP only mentions a daughter.\n\nAll this was written in there.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "LazyTypist",
                    "body": "No one in Texas says \"uni.\" It's college or school. Sometimes we'll say university. Not sure about the other 49 states, but I'm pretty sure they're the same.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "AltruisticPickle9640",
                            "body": "Mm but she does state shes mexican and i have heard the word uni used in certain states/demographics so its plausible.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Toosder",
                            "body": "Uni is definitely not an American thing.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Bex1218",
                            "body": "I've said it here in Florida (where I'm from). It happens, sometimes.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Irisheyes1971",
                            "body": "Also, she said originally she wanted to go back to teaching. If she was in the United States, she would’ve already needed to have a bachelors and a masters in most places to teach. Then suddenly she’s going back to community college? The story is such a bullshit.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ChippedEar",
                    "body": "I know! This story is so laughable.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "th30be",
            "body": "I just don't understand the people that do this. \n\nI have an acquaintance that went through something very similar. She married a guy from Jamaica who needed citizenship. Caught him cheating. She went full scorched earth and actually had him deported. I don't think it was on purpose but that was the result.",
            "score": 6,
            "replies": []
        },
        {
            "author": "bete_du_gevaudan",
            "body": "Why on Earth would you wake up early everyday to cook for him In the first place?\n\nIsn't he a grown man ?\n\nWomen need to stop accepting that kind of genre cliché labour.",
            "score": 6,
            "replies": []
        },
        {
            "author": "MushroomExtension679",
            "body": "He really tried the Seinfeld Tractor Story",
            "score": 6,
            "replies": []
        },
        {
            "author": "IAmJustAHusk",
            "body": "Why do these people drone on so much, this could have been 20% as long and still gotten the information across. Plus in the grand scheme of things, not a lot happened.",
            "score": 68,
            "replies": [
                {
                    "author": "AriaCannotSing",
                    "body": "Most people don't learn to write effectively.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "Toosder",
                    "body": "Any law enforcement officer will tell you that people tend to embellish details when they're telling something that isn't true.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "HedgehogNo8361",
                    "body": "It helps some people process shit.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "violue",
                    "body": "Stressed people pouring their guts out to reddit probably aren't thinking about making their posts bite sized and manageable for those of us using them as entertainment.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Boeing367-80",
            "body": "Generally, illegal immigrants go out of their way to avoid trouble. Anything that could bring official attention is dangerous.\n\nSomeone fucking with your car and house - they deserve to be reported to ICE, even pre-Trump.\n\nThe wildest comments are those saying \"hey, you should keep supporting him to get his green card so he provide child support\" - which is insane. As a green card sponsor, she becomes responsible for financially supporting him. And however great a father he may or may not be, he's not worth that.\n\nShe's a hard-working first generation Mexican American. She's been badly treated, but my money is on her to ultimately succeed.",
            "score": 25,
            "replies": [
                {
                    "author": "MakanLagiDud3",
                    "body": ">Generally, illegal immigrants go out of their way to avoid trouble.   \n**Anything that could bring official attention is dangerous.**\n\nAnd this tells you more about the harassers than their short term thinking, I understand they're pissed but apparently their blind to their own foot getting shot.\n\nSorry it just grinds my gears that OOP is being unfairly harassed by people who should've known the consequences; getting deported.\n\n> He apologized for her craziness and offered to help me but I turned him down because his involvement might actually make it worse.\n\nI wish she had taken the olive branch, the harassment might've been reduced.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mdlgswitch",
            "body": "Cow poo is not as fun a excuse as a koala",
            "score": 13,
            "replies": []
        },
        {
            "author": "nataliejkd",
            "body": ">Why did putting more food in his lunch cause budgeting issues?\n\nThe audacity of this level of ignorance is what angered me the most in this boru",
            "score": 14,
            "replies": []
        },
        {
            "author": "Ok_Procedure_5853",
            "body": ">Did I talk to him to get his side of the story?\n\nSometimes...just sometimes...it's okay to not five two flying shits about 'the other side'.  Cheating on your 3 month post partum, breast feeding wife and having said wife MAKE LUNCH FOR YOUR SIDE PIECE does not require learning about 'the other side'.\n\nHis side of the story?  He's a scum bag.  No need to look farther.",
            "score": 11,
            "replies": [
                {
                    "author": "00Lisa00",
                    "body": "But but he was bored!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Ok_Procedure_5853",
                            "body": "He was bored AND what he had to do after work was SOOOOOOOOOOOOOOOO HARD.  Too hard for him!  Such a boringly hard life!",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Prudence_rigby",
            "body": "Dang. I had no idea she had posted so much more. I guess updateme doesn't always work. \n\n\nAnyway, poor OOP. She's gone through so damn much. Hopefully he will keave her alone",
            "score": 5,
            "replies": []
        },
        {
            "author": "SoggySea4363",
            "body": "Oh, I remember this post. I wish the best for OOP and her daughter, and I wish the worst for her ex-husband and his AP.",
            "score": 4,
            "replies": []
        },
        {
            "author": "FinerThingsInHanoi",
            "body": "This one sure is entertaining",
            "score": 5,
            "replies": []
        },
        {
            "author": "Dimityblue",
            "body": "\\> It’s not just that girl now, it’s like 3 girls who are her friends plus a few others who have slept with my ex who harass me because he tells them he loves me and wants me back which I don’t know if he’s stupid or is manipulating them to attack me for him.\n\nHe could be saying the only way for him to stay is if OOP supports him/marries him. The guy's a scumbag and those girls aren't any better.\n\n  \nI had to laugh at the sidechick getting reported to the authorities and getting her life blown up even more for harassing OOP when OOP wasn't even the one who told her fiancé in the first place. It was probably one of her other lovers' partners who told the fiancé.",
            "score": 5,
            "replies": []
        },
        {
            "author": "jhascal23",
            "body": "What a rollercoaster, two people got caught being unfaithful and are now trying to ruin OPs life, thats horrible when OP was just trying to be a good wife and mother. I hope they both got deported and can't come back, I would just be worried about her illegally coming back and trying something, or that psycho lady trying to get her friends to do something to OP.",
            "score": 4,
            "replies": []
        },
        {
            "author": "eggsmackers",
            "body": "I found this to be almost unreadable. So many sentences that run on and on and go absolutely nowhere.",
            "score": 13,
            "replies": []
        },
        {
            "author": "pineapple_juice_love",
            "body": "Is this an elaborate ad for ICE?",
            "score": 14,
            "replies": []
        },
        {
            "author": "FireFoxx13",
            "body": "That which is beautiful is not always good. That which is good is always beautiful. \n\nIt is amazing to me that someone's inner ugliness affects how other see them. You can be the most beautiful/handsome person, but once someone gets to know you, if you are ugly inside, you start to look ugly on the outside, no matter how \"pretty\" the cover is.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Snarkan_sas",
            "body": "People who actually deserve to be deported.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Cultural_Thing9426",
            "body": "Good lord what an idiot",
            "score": 4,
            "replies": []
        },
        {
            "author": "peppermintvalet",
            "body": "I wonder how the ex is doing in the current political climate.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Electric-Sheep49",
            "body": "Jesus the ex’s justifications for cheating are so weak. \n\n“I got tired of eating the same thing for lunch and dinner week after week” boohoo dude did you even try communicating that? Most people would be lucky enough to have a partner who cooks their meals for them. Also if you’re on a budget and low income  yeah dude get used to eating the same things. Dude was so fucking ungrateful Id give anything to have someone love me that much",
            "score": 4,
            "replies": []
        },
        {
            "author": "violue",
            "body": "That poor man, he must have been devastated when he found out his side piece was cheating on him :'((((",
            "score": 7,
            "replies": []
        },
        {
            "author": "Tim-R89",
            "body": "I stopped at “I wake up 1,5 hours before he does and get his breakfast, lunch and clothes ready” \nHow can people live like this😳!?",
            "score": 7,
            "replies": []
        },
        {
            "author": "IanDOsmond",
            "body": "Writing \"home wrecker\" on the home of the person whose husband you are screwing... I guess she thought you were supposed to write your name?",
            "score": 8,
            "replies": []
        },
        {
            "author": "HestiaHalcyon",
            "body": "OOP is very kind. I wish she could’ve been as ruthless as that one girl (on TikTok) who had hired a “coyote” to bring her undocumented boyfriend to the U.S., and when he cheated on her, took him on a “small” road trip as he napped right over the boarder 😭. Saying she didn’t pay for him to be there for him to be with another girl, and she left him stranded in Mexico.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Nameisnotmine",
            "body": "I’m concerned that if this is real she wants to go back to teaching yet can’t spell and claims to be at community college - she used to be a daycare worker so not a teacher.  \n\nAlso she’s letting an almost stranger - friendly cops wife help her with the baby but the baby is looked after by her mother so when is the friendly cops wife helping. And how does that even happen?  Did he go home and say oh I met a newly single mother with a baby want to go help her? I’m feeling in a future episode the cop and his wife will try to take the baby",
            "score": 16,
            "replies": [
                {
                    "author": "deriik66",
                    "body": "It's called bullllllshit",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "PeppermintEvilButler",
            "body": "I remember when this was originally posted and just felt so heartbroken for OOP. She clearly deeply loved the facade the ex presented and he got her hooked in order to use her. It seems to happen so freaking often with green card marriages. She also didn't deserve the affair partner's harassment, which the ex clearly egged on for these women to attack. I really hope oop is doing okay and is safe away from these crazies.\n\n\nAlso big drama stories like these end up making it big all over the other social medias. It was bound to be seen.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Ok-Commercial1152",
            "body": "How is it that an undocumented person who is breaking the law and harassing a citizen gets identified by the police, and the police say they can do nothing? \n\nOn top of that, then you have the same undocumented person committing a crime against a citizen on video so now there’s evidence, on top of the fact that they are here illegally, which means if they commit a crime it’s going to be hard to hold them accountable, and the police again say they can do nothing? She should’ve been arrested and deported immediately.",
            "score": 6,
            "replies": []
        },
        {
            "author": "kenyafeelme",
            "body": "This story reads like a tik tok trend come to life",
            "score": 9,
            "replies": []
        },
        {
            "author": "deadlyhausfrau",
            "body": "The wild thing is, this is the woman all those alpha male dudes claim they want- but this is how they treat them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Why_Is_Toby_In_Jail",
            "body": "If a woman says she's not like other girls, run! They tend to be the most toxic people and need attention to live lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "armomo3",
            "body": "It's hilarious that the AP wrote \"home wrecker\".  Does she even understand she was leaving a signature not making a comment like she thought?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ja-Kathra",
            "body": "He ruined his relationship with his daughter. She doesn’t deserve that kind of man as an example. Deport his ass.   Damn.  People suck!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zealousideal_Tea5988",
            "body": "I wish I was as strong as you. My now ex hubs cheated on me so many times. I stayed because I truly loved him, and for the kids and for the lack of self esteem. Better the devil you know than the one you don't.  But he left for one of the home wreckers, became a deadbeat dad to our adult kids, and doesn't even \"co-parent\" regarding our adult disabled son.  My 24 yr old hadn't seen dad in 5 yrs.  He hadn't seen this precious kid go from a drug addiction n criminal to being diagnosed with schizophrenia and finding his way to clean for almost a year and learning to live a medicated life.  He is our adopted foster son and I am so damn proud of MY son.  And that is how I finally got him out of my heart: he treats our kids like they don't exist.  On the otherhand, this is absolutely not the main I married.  He has combat ptsd and a tbi: both I feel contribute to his about face personality change.  No one who has known him before he joined the navy (20 yr career now retired) to today can believe he is the same man.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Appropriate_Ruin3771",
            "body": "Poor thing. I wouldn’t want him near my daughter, either. I hope nothing other than the best for her & the baby, and nothing but the worst for him and all his skanks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheLastWord63",
            "body": "I wish OP would update one more time just to satisfy my nosyness.",
            "score": 7,
            "replies": []
        },
        {
            "author": "deriik66",
            "body": "> [editor's note- this post did get a lot of traction on several different subs and was posted several places outside of reddit, including facebook, youtube, pinterest and tiktok. To me it's actually quite plausible someone found it]\n\nLol i love the op trying to run interference on this being real as the last 3 or 4 updates all descend into near incoherent inconsistency",
            "score": 5,
            "replies": []
        },
        {
            "author": "thrwwyunfriended",
            "body": "> Why did putting more food in his lunch cause budgeting issues?\n\n\nReally...?",
            "score": 5,
            "replies": [
                {
                    "author": "Alternative-Boot2673",
                    "body": "The reality of the working poor is life gets more expensive the less money you have, no matter how many times you turn off lights as you leave the room, shop at goodwill for everything (used clothing, kitchenware, small appliances), drive 20 y/o cars with the absolute cheapest insurance, or live in low income/food desert areas. And then wealthy people tell you to quit buying ⭐️bucks or ask how you can afford a cellphone which no one can now live without? The futility of working 2 or 3 minimum wage jobs and still not able to afford rent is what destroys people; and then again, wealthy people say “no one wants to work” - without considering they are exhausted from living in a real life “Skinner’s box”.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "thrwwyunfriended",
                            "body": "Oh yeah I know, this is basically my life. :( I'm just surprised someone had to ask why food costs money.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Alternative-Boot2673",
                                    "body": "I thought you were teeing me up for the assist!",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "slicedbreaf",
            "body": "Job haunting—is that when you apply for a job and they call you for an interview you ghost them? Or is it when you apply and they ghost you?",
            "score": 4,
            "replies": []
        },
        {
            "author": "wscuraiii",
            "body": ">His coworker he told me no longer worked there, who I’d caught him talking too friendly to and I told him it bothered me and I had him remove from everything and block on whatsapp not only still worked there but was eating the lunch I freshly prepared for HIM and he was eating the leftovers.\n\nCompletely and utterly incoherent.",
            "score": 7,
            "replies": [
                {
                    "author": "TheFilthyDIL",
                    "body": "Translation: OOP caught her husband being \"too friendly\" with a coworker. (Speculation: trading nudes?)  She made him remove & block Coworker from his social media. He says Coworker no longer works there. OOP visits Husband at work and sees that not only is Coworket still there, but is eating the lunch she packed for her husband.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PastelAnemone",
            "body": "AMIGA SE DIO CUENTA!!!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "SomePumpkin6850",
            "body": "A homewrecker spray painting \"homewrecker\" on her property was the best part. No self reflection whatsoever",
            "score": 2,
            "replies": []
        },
        {
            "author": "Party-Argument-8969",
            "body": "Hhe doesn’t have to choose between his daughter and family he shouldn’t get custody. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "ececacademic",
            "body": "This is a painfully sad story and I really hope OP is okay",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aluanne",
            "body": "He was likely cheating on her whilst she was pregnant. Causing serious risk to her and the baby due to STIs",
            "score": 2,
            "replies": []
        },
        {
            "author": "Seahorse_93",
            "body": "I'm so confused. I could've sworn when I originally read this story and the older updates, OP's ex was the one harassing her directly. He would stand outside of her house and talk about how he's going to make things right or something like that. The affair person wasn't that involved after the first two updates.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Impossible_Cover_232",
            "body": "Love the irony of the home wrecker comment since she was the actual home wrecker. Don’t do the crime if you can’t do the time. If she had been faithful none of this would have occurred. They both shot themselves in the foot. At least OP knows now and this isn’t going on behind her back. It also led to her knowing she got infected instead of it doing damage when it wouldn’t have been treated.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Otherwise_Fined",
            "body": "I do not like guns myself but GIRL GET A GUN. Multiple stalkers and harrassers and acts of damage only leads to escalation and while I would rather nobody be hurt, oop needs to defend herself from the inevitable assault.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fanfictionaddict13",
            "body": "Idk why I get genuinely shocked women will cheat with a guy and then take his side while he tries to get the partner he cheated on back. I had a friend who was with this fiancee for nearly 10 years, she was the breadwinner and supported him and his family in another country while he went back and forth from our home country to his. She worked 3 jobs and he got deported year 9 of the relationship. They do the long distance, she still sent him and his family money, she starts a side hustle on top of her 3 jobs so she can go to his country to surprise him for their 10th anniversary. \n\n\nShe was the one surprised that when he said he was sending money to his family he meant his wife of 7 years, their 2 kids, and his 2 other baby mommas. All kids were younger then 10 if you know what I mean, and these women knew about each other and her. Obviously she cut him off and came home, but these women were the ones reaching out to berate her for not supporting him and the family and the kids anymore. Legit it's the audacity of them to say she ruined their lives because she dumped a cheater they knew was a cheater.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JJStray",
            "body": "I am the only liberal thinking… Sick ICE on his ass.   I hear gitmo is nice thjs time of year.  /s…. Mostly",
            "score": 5,
            "replies": []
        },
        {
            "author": "Chronox2040",
            "body": "Damn. Now this is the people you want deported for sure.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Free-Pound-6139",
            "body": "> I didn’t cause a scene instead took pictures and added to my folder of everything he’s done before from simple hearting other girls stories after telling me he didn’t to naked pictures of a coworker from a previous job he got fired from because of her.\n\nWhat a life to live.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BobBee13",
            "body": "He only got upset when his green card was in jeopardy. Girl, you were just his ticket to citizenship and nothing more.",
            "score": 2,
            "replies": []
        },
        {
            "author": "myung_l",
            "body": "What?",
            "score": 5,
            "replies": []
        },
        {
            "author": "PenelopeShoots",
            "body": "The nerve of earning below minimum wage and having your breastfeeding wife go without meals but sending your earnings to your parents and THEIR kids instead. \n\nI don't want to hear \"you don't understand FAMILY and other cultures!\" He was ok with his wife getting up 90 minutes early, making him a meal for his side chick, and would have left her once he got his papers... he was 100% choosing his parents over her because he doesn't love her and he was ok with her going hungry. \n\nAnd the woman who is one of the guys at work sleeping with all the guys and giving them all the same infection. I think he made this up to act like \"now I REALLY won't sleep with her anymore, so give me another chance!\" but really they were both using citizen suckers for papers and both sleeping around and thinking they were smarter than the morons they were fooling into thinking they were actually loved.\n\nHe IS the man she married. He never loved her, he was always using her, and he was always cheating. She said she had suspicions before, and she still got up to make his food and go without to earn the love of a loser. He's not telling those women he loves OP so they harass her because they feel badly for him. He's telling them she won't help him anymore, so they harass her to not lose one of their boyfriends. The idea of \"ok, you're abusing me, so I'll do what you say and help you stay so the abuse continues\" is idiotic. If someone is abusive, you work harder to get rid of them (and he's not a good father, he's hurting the mother of his child, giving her diseases, starving her, overworking her, staying later at work to cheat, and will bounce once he can and never see the kid again). \n\nI don't know how people are not suspicious of people from other countries wanting to marry them. But by the end, it's very clear she's wisened up, will protect her child, and won't repeat her family's tradition of accepting abuse from cheaters.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Katya_",
            "body": "Poor OOP, her ex is a gigantic waste of space.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Flat_Shame_2377",
            "body": "She’s a wonderful person. I hope it all has worked out for her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PricelessPaylessBoot",
            "body": "She called herself “one of the guys” but it was OOP’s husband all along. One of the many guys… OOF \n\nI reacted as soon as I realized he was getting his BREASTFEEDING wife to GIVE UP HER OWN FOOD for him, before the story just got worse and worse with the mystery fork… 😥😵‍💫😮‍💨",
            "score": 2,
            "replies": []
        },
        {
            "author": "Enough_Basis_8935",
            "body": "I didn't even finish reading but I  have to say stop paying for his stuff!! Why are you paying for his gym and supplements?? Stop paying for that!! You're skipping meals to pay his crap while breastfeeding FFS!!\n\nHe's a lying cheater, cut the wallet off and let him get deported, safer for you and the child.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SkyNervous9739",
            "body": "Why did he have to choose between is parents and daughter?",
            "score": 1,
            "replies": [
                {
                    "author": "West-Kaleidoscope129",
                    "body": "I'm assuming his parents are in Mexico and if he goes back there he won't ever be allowed back due to no longer getting his Green Card, not even to see his daughter. So he either stays where he is and sees his daughter but never sees his parents, or goes back home and sees his parents and never sees his daughter.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "CelestialJavaNationT",
            "body": "This is literally the biggest crock of bullshit I've read in quite some time. Talk about a jump from A to Z in less than a parsec, but also such a huge overreaction over a lie that doesn't lead to \"he's cheating on me.\" Clearly the OP in the story is emotionally immature and hypersensitive to major negative events that require a calm mind to figure out. Seriously...laughable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "frankydie69",
            "body": "I see this happening more and more now with green card marriages. The dude comes to work here and gets with someone that was born here. The girl falls for it cuz it’s usually a “small town” guy that’s here to work to provide for his parents back home. \n\nSometimes they’re here already being married in Mexico and they trick these poor girls into thinking they’re single and only sending money back home to help a relative. \n\nSome of these women will go broke themselves to try and help financially to “support” these relatives. It’s always someone’s sick, they don’t have enough money to cover tuition to school, a relative got locked up and needs to be bailed out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mystrohan",
            "body": "This hits a bit of a personal note for me, because I actually found my life boring after my wife stepped in and starting backstopping the domestic problems created by my lack of focus (took everything I previously had to keep them from tanking my job as a lawyer - bad place to have ADHD or anything related).\n\nI got a new hobby by keeping an AeroGarden and by joining a local singing group. Filled the gap that way.\n\nNever seriously considered an extramarital affair, and would have punched myself in the face if I had.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infamous-Cash9165",
            "body": "Like most women who have these harassment problems, she should get a gun",
            "score": 1,
            "replies": [
                {
                    "author": "Ginger630",
                    "body": "Exactly. She’s in TX.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AlissonHarlan",
            "body": "\"she's one of the boys \"\n\nTurn out HE was \"one of the boys\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Some-Chef5376",
            "body": "Holy shit. This story is so awful but I totally believe it is true. OP, I wish you the best future without all of this shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Devourer_of_Sun",
            "body": "Never trust a \"'one of the the guys' girl\" that degrades women, that's a pick me. I'm specifically talking about the ones that put down women and seek male validation, because there are girls who ***are*** really \"one of the guys\" with no interest in dating the guy friends, and those aren't the pick me girls. Anyway, with the state of things now, I don't think ex or the pick me are in the clear at all, and if the girlfriends or the girl friends are immigrants too, they're probably not living so hot either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "h3dwig0wl1974",
            "body": "If this had happened this year, she’d have had an easier solution to the harassment, I think.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tranquilrage73",
            "body": "What a ridiculously misleading title.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Divinemango7",
            "body": "With a title like that and complete incomprehension of this story. Makes sense why it was deleted lol.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Brave_Cauliflower_88",
            "body": "I hope the Trump administration deports those assholes. I would go out of my way to report them to ICE. They deserve it.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Notmykl",
            "body": "Women not girls.\n\nYou are an AMERICAN not Mexican.  Your family is Mexican, you are not.  Your nationality is American, ethnicity is Mexican, you are also NOT a Mexican-American as you were not born in Mexico.\n\nThe affair partner's significant other is either her *husband* or *fiancé*, he cannot be both.  Plus male = fiancé, female = fiancée\n\nWTF are you even contemplating allowing your illegal alien husband to stay *illegally*?  He's the one who chose to come here illegally.  You stupidly chose to marry an illegal alien.  Divorce the bastard and make sure he is sent back whence he came.  Do not under any circumstance stay married to the cheating bastard.\n\nYou are not responsible for his cheating but you ARE responsible for your inability to divorce the bastard after finding out.  Do you really want your daughter to grow up thinking it's perfectly okay for a parent to cheat on the other?  That it's okay for the one being cheated on to do nothing, to accept being cheated on and getting any STD from the cheater?  That it's okay to put up with the affair partner harassing you and vandalizing your property and harming your body?\n\nAnd what is this complete nonsense about making sure HE gets fed while you, the breastfeeding mother, gets nothing?  You get fed FIRST! Always!",
            "score": -9,
            "replies": []
        },
        {
            "author": "milehighphillygirl",
            "body": "This is a repost sub. OOP most likely won’t see this since her last post was over a year ago.",
            "score": 4,
            "replies": []
        },
        {
            "author": "lyricanum",
            "body": "Z",
            "score": -3,
            "replies": []
        },
        {
            "author": "OkLeg3964",
            "body": "P",
            "score": -1,
            "replies": []
        },
        {
            "author": "danoneill180",
            "body": "I couldn't understand a word of this post, can anyone post a TLDR of the whole thing?",
            "score": -1,
            "replies": []
        },
        {
            "author": "fakesongs",
            "body": "Latin guys with green eyes think they can do whatever they want! But I was put on this earth to tell them No.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Spittin_FlimFlam",
            "body": "Cc",
            "score": -1,
            "replies": []
        },
        {
            "author": "oxycodonefan87",
            "body": "The WhatsApp bit has me suspicious about this story a little. Americans don't use WhatsApp",
            "score": -2,
            "replies": []
        },
        {
            "author": "LucyAriaRose",
            "body": "I mean, I use it and most of my friends use it and I'm American. It's pretty common here actually.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Maleficent_Maara",
            "body": "I'm American, and I know a LOT of people who use WhatsApp. You can not speak for people you don't know as a whole.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ArrEehEmm",
            "body": "Ridiculous. Set herself up for failure by playing house so quickly and with an undocumented immigrant. Kinda wild. Good luck to her and her kid. He sucks.",
            "score": -10,
            "replies": []
        }
    ]
}