{
    "title": "Colleague harasses my sister at Carnival",
    "author": "soliraco",
    "subreddit": "BestofRedditorUpdates",
    "rank": 12,
    "score": 1396,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 99,
    "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1jdq5rk/colleague_harasses_my_sister_at_carnival/",
    "id": "1jdq5rk",
    "selftext": "I am NOT OOP. OOP is u/Calm_Bid7851\n\nOriginally posted to r/Ratschlag\n\nTrigger warning: >!sexual harassment!<\n\n**Posts were translated from German to English.**\n\n[Colleague Harasses My Sister at Carnival](https://www.reddit.com/r/Ratschlag/comments/1j20sz3/kollege_bedr%C3%A4ngt_meine_schwester_an_karneval/) March 2, 2025\n\nWhat the title says...\n\nA good friend of mine, who I also work with, harassed my sister at a party yesterday.\n\nI was actually there with her, along with some of my friends and hers. At some point, we split up, I figured she’s not a kid anymore, and she was with people I trust. That was a mistake.\n\nAt some point, she called me and asked where I was and when I could take her home. I went to her & I asked if everything was okay because she seemed really nervous and just off.\n\nShe then told me that \\[my colleague\\] was being 'disgusting' toward her, he hit on her, said things like 'Don't be so prude, just let me touch you', touched her by the waist (slightly pulled at the laces of her dress) and even pulled her away from the others, despite her repeatedly saying she didn’t want that. He only left when one of her friends showed up.\n\nI was honestly speechless. This guy is a good colleague of mine, and man… seriously, my sister?\n\nI’ve been feeling guilty all day & don’t even dare to bring it up with her again. Honestly, I also feel like she didn’t tell me everything, maybe because he’s a good friend of mine. But I don’t want to pressure her into telling our parents and I should have protected her in the first place, and I messed up.\n\nI really don’t feel like working with him on Tuesday. Should I confront him? To be honest, I’d rather make him feel what I think of him. He might not even remember. And he was a really good colleague of mine.\n\nHow should I deal with him? And should I talk to my sister again?\n\nBy the way my sister is 19, and the guy and I are 22.\n\nThanks for your advice!\n\n[Update](https://www.reddit.com/r/Ratschlag/comments/1j62l77/update_kollege_bedr%C3%A4ngt_meine_schwester_an/) March 7, 2025\n\nUpdate because some people asked. My sister was sexually harassed by a friend of mine during Carnival while I was away for a short time.\n\nI have since spoken to my superior, and preliminary investigations for a possible disciplinary procedure have been initiated.\n\nI also had a conversation with my friend after duty – if you can even call it that. It got pretty rough. I confronted him directly, and as expected, he denied everything. “She actually wanted it” & “She never really said no,” etc. Today, he also started talking about loyalty within the brotherhood, probably to make me keep my mouth shut. But he completely shot himself in the foot, and hopefully, the disciplinary procedure will go through.\n\nMy sister is doing okay for now, but she opened up again and told me more details. He really cornered her, pressed her chest to chest against a wall, and made it clear that if she didn’t play along, she would really get to know him. That was more than enough information for me.\n\nThat’s why I spoke to my superior in the middle of the week. I had to call in sick on Tuesday so I could calm down and not do anything stupid. I’m struggling a lot with guilt for leaving her alone, and it feels incredibly uncomfortable facing her, knowing that this was one of my closest friends.\n\nThanks again for all your advice and support.\n\n**Reminder - this is a repost. Please don't comment on the original post.**",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Initial-Company3926",
            "body": "Loyalty within the brotherhood, is just a way to say : support me in sexually harrassing women",
            "score": 1734,
            "replies": [
                {
                    "author": "DrunkTides",
                    "body": "The funniest part being, he’s ACTUALLY the brother of the one being harassed!",
                    "score": 529,
                    "replies": [
                        {
                            "author": "SpecialistFeeling220",
                            "body": "Shows you what the aggressor truly thinks of women, if he believes that the “brotherhood” trumps real familial bonds.",
                            "score": 304,
                            "replies": [
                                {
                                    "author": "MamieJoJackson",
                                    "body": "\"In the brotherhood, we're all rapists, right?\"",
                                    "score": 185,
                                    "replies": [
                                        {
                                            "author": "Nimelennar",
                                            "body": "It reminds me of a satirical song by the Brothers-In-Law about the KKK:\n\n\n>We'll protect your daughter's honor / If a rapist falls upon her / If he's not a fellow member of the Klan",
                                            "score": 74,
                                            "replies": []
                                        },
                                        {
                                            "author": "SaboLeorioShikamaru",
                                            "body": "There are 2 words in these last 2 replies that go together like peanut butter and jelly 😒",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Environmental_Art591",
                    "body": "I would say \"where is the loyalty to not go after a brothers family member\" and \"i thought your loyalty to me included keeping my sister safe from guys like you\".\n\nIt really is disgusting how they use loyalty and brotherhood as a way of enabling bad behaviour",
                    "score": 118,
                    "replies": []
                },
                {
                    "author": "WaltzFirm6336",
                    "body": "…and I’ll support you when you sexually harass a woman.",
                    "score": 159,
                    "replies": [
                        {
                            "author": "oceanarnia",
                            "body": "\"Rape culture should be perpetuated because we will be the perpetrators.\".\n\nGenuinely hope he fucking get bent",
                            "score": 149,
                            "replies": []
                        },
                        {
                            "author": "bolonomadic",
                            "body": "Yeah right? This guy seems to think it’s fine if you assault other women just not my sister.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "surreptitiouswalk",
                    "body": "I laughed at this too. Imagine arguing loyalty is assaulting a fellow brother's sister.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "boredbytheabyss",
                    "body": "“Loyalty within the brotherhood” tell me you are a raging asshole without telling me",
                    "score": 22,
                    "replies": [
                        {
                            "author": "thebearofwisdom",
                            "body": "Those words make me feel very uncomfortable. Like someone might bring out a white sheet with holes in, and maybe have a pyrotechnic display that looks suspiciously like a cross on the lawn.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "On_The_Blindside",
                    "body": "He is, but the brotherhood is the fact he's the victims brother.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "apatheticsahm",
                    "body": "When OOP is the one actually showing loyalty within the brotherhood by *actually acting the way a brother should*.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "paulinaiml",
                    "body": "Brotherhood dictates he should by beaten by fellow members and expelled",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "archangelzeriel",
                    "body": "Yeah, when I heard that from one of my now-former (due to \"expelled for harassing people at our parties\") fraternity brothers, I responded with \"I prefer loyalty TO the brotherhood, which means improving it by casting out people like you.\"",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "MordaxTenebrae",
                    "body": "Loyalty to family in an ideal world supersedes anything to a coworker or friend.\n\nI don't know any people in my circle that would tolerate someone harassing/abusing their sibling.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Initial-Company3926",
                            "body": "Honestly, family or not, sexually harrasing another person is a no go",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zortak",
                    "body": "Depends on the context. \n\nIt could also mean that Ezio wants to make sure you're no Templar",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "OkStrength5245",
                    "body": "Yeah. It is why I had so few male friends.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Creatureteacher86150",
                    "body": "I think you meant: support me in my attempts to sexually assault women.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WeeklyConversation8",
                    "body": "Yep, even when one of the women he's sexually harassing or SA is his co-worker's own sister. He really thinks he comes before family? ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Beautiful-Ad-7616",
                    "body": "Man where is Omar when you need him?! ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "itsallminenow",
                    "body": "If this is what brothers do, I don’t want one.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MeFolly",
            "body": "“She actually wanted it” and “She never really said no” are things rapists say. \n\nSince your superior is involved, check to be sure that they are asking all the women that this person has contact with at work have been asked specifically about their interactions with him.",
            "score": 620,
            "replies": [
                {
                    "author": "Zelfzuchtig",
                    "body": "This is why people are moving away from \"no means no\" in talks about consent and more towards \"anything other than an enthusiastic yes is a no\".\n\nPredators like that guy are probably still going to pull shit like this of course but hopefully the shift in public perception means they'll get away with it less.",
                    "score": 212,
                    "replies": [
                        {
                            "author": "PrancingRedPony",
                            "body": "This so much. Only yes means yes and we need to understand that consent isn't debatable. That pushing against a woman to say yes isn't consent, is coercion and the only acceptable reaction to any person saying no or even just not outright saying yes is stopping those advances and leaving them alone.",
                            "score": 88,
                            "replies": [
                                {
                                    "author": "penandpaper30",
                                    "body": "If you can't say no comfortably and feel safe, it's still not a yes.",
                                    "score": 55,
                                    "replies": [
                                        {
                                            "author": "PrancingRedPony",
                                            "body": "Exactly",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "siren_stitchwitch",
                                    "body": "And a yes now doesn't mean it will always be a yes, it needs to be an enthusiastic yes *every time*",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SuchConfusion666",
                            "body": "Kinda unrelated but also kinda not, but at carnival (I am german just like the OOP) this year there was a girl with a shirt that said \"no means no\" that got raped by a group of men because \"she was provoking them with her shirt\".",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "Pale-Worldliness9399",
                                    "body": "I hate humanity...",
                                    "score": 25,
                                    "replies": []
                                },
                                {
                                    "author": "Zelfzuchtig",
                                    "body": "Das ist schrecklich. Hast du zufällig einen Artikel darüber? Ich konnte nichts zu \"nein heisst nein\" und \"Karneval\" finden.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "SuchConfusion666",
                                            "body": "Lief im Lokalradio, ist in Leverkusen passiert. Ich kann mal schauen, ob ich einen Artikel dazu finde.\n\nEdit: habe leider bisher keinen Artikel zu dem Fall selber gefunden, es gab aber wohl mehrere Vergewaltigungen am gleichen Tag, dabei auch in Köln, wo es mehrere Fälle gab von Frauen die in Dixiklos gezerrt wurden. Und da die Polizei Köln für Leverkusen zuständig ist... naja, könnte der Fall etwas untergegangen sein was die Medienpräsenz betrifft.\n\nAus meiner Erinnerung was ich über den Fall gehört habe (von Verwandten, da ich selbst kein Radio höre und dort auch nicht mehr wohne):\n\nEin Mädchen war mit zwei Freundinenn unterwegs und hatte ein T-Shirt mit der Aufschrift \"no means no\" an. Eine Gruppe Männer (Anzahl ist mir gerade entfallen) hat sie daraufhin attackiert. Ihre beiden Freundinnen waren es, die die Polizei gerufen haben, aber bis die da waren, war es bereits zu spät. Das Mädchen wurde nach der Tat in die Psychiatrie eingewiesen. Einer oder mehrere der Täter wurden geschnappt. Einer hat die Aussage getätigt, dass das T-Shirt ja provokant war und sie es dementsprechend selbst Schuld sei, da das respektlos gegenüber seiner Kultur sei (oder so ähnlich, jedenfalls).\n\nWenn ich mich recht entsinne ist das Opfer 16 Jahre alt.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Zelfzuchtig",
                                                    "body": "Ich habe mich auch anhand Deiner Informationen auf die Suche gemacht und dabei festgestellt wie viele Artikel es allgemein zum Thema Vergewaltigung auf Karnevalsveranstaltungen gibt. In was für einer Welt leben wir....",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Raz0rking",
                                                    "body": "And, what do you think? The perps will get to feel the sharpness of the german justice or how was that from the judge who gave a bunch of gangrapers basicly just slaps on the wrists?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "smallfluffyfox",
                                    "body": "What the actual fuck is wrong with some people.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "WeeklyConversation8",
                                    "body": "WTF?!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mysterious-Ruby",
                    "body": "And this is why I choose the bear.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "PreppyInPlaid",
                            "body": "Every damn time.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChaosFlameEmber",
            "body": "It warms my heart to see all the people in the comments tell OOP to call out and ditch that POS. And to be there for his sister.",
            "score": 202,
            "replies": [
                {
                    "author": "paulinaiml",
                    "body": "One wonders why OOP posts in the first place. Just by writing/proofreading he should have realized he described a POS",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Karls_Ideologue",
                            "body": "For advice on how to handle the situation in the professional context? Seems a delicate situation to me, that one could need advice on how to handle",
                            "score": 70,
                            "replies": []
                        },
                        {
                            "author": "ChaosFlameEmber",
                            "body": "Young, super stressful situation, of course he's insecure. In the comments he said he wasn't sure if he could keep it civil if he faced the guy.",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "reazlerum",
                            "body": "Because his buddy is not only a beloved colleague and friend but a soldier, and the Bundeswehr doesn't exactly encourage calling out rapists. I'm actually a bit grateful that OOP did because so many of them wouldn't have, even if their own sister was affected. He needed encouragement from somewhere else, his buddies could have talked him out of it.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mr_Coco1234",
            "body": "I don't think anyone in the 'brotherhood' (whatever that means) talks about loyalty when calling out a rapist.",
            "score": 63,
            "replies": [
                {
                    "author": "Muttley-Snickering",
                    "body": "You have to do the right thing in situations. Don't stand by loyalty, stand by integrity,",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "RunWombat",
            "body": "u/soliraco keep up the good work. Loving reading all these German -> English posts",
            "score": 63,
            "replies": [
                {
                    "author": "thebearofwisdom",
                    "body": "Me too actually! It’s interesting to see posts specifically from other countries. I know a lot of people from other countries post on every sub, but I think it’s a bit different when it’s inside a sub in their own language. It must be easier for them to type up, if they don’t have the English to translate it to and it must be a different set of responses to their questions. Fabulous I vote MORE",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mindless-Top766",
            "body": "I feel literally beyond disgusted by men like that, hope he steps on Legos for the rest of his life",
            "score": 108,
            "replies": [
                {
                    "author": "Normal-Height-8577",
                    "body": "I hope he steps on the sharpest, pointiest D4 dice for the rest of his life.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Mindless-Top766",
                            "body": "Absolutely!! May he feel the agony of that for the rest of his pathetic life :))))",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "scummy_shower_stall",
                            "body": "I'd rather he be sat down *with great force* on them.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "thefinalhex",
                            "body": "So much better than the lego curse.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "SoftLikeABear",
                                    "body": "I raise you one better.\n\nhttps://ideascdn.lego.com/media/generate/lego_ci/18ab86a1-ad8c-48db-9d73-aa6ddfbf95fa/original:0:0/webp",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "fractal_frog",
                            "body": "I hope he is plagued by 3 d4s in his bed every night for the rest of his life.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "necianokomis",
                    "body": "I stepped on a scotch tape dispenser last night, and the sharp cutty bit gouged a tape width line down half my foot. I vote \"steps on tape dispenser\".",
                    "score": 18,
                    "replies": [
                        {
                            "author": "thebearofwisdom",
                            "body": "Oh my god I pulled such a horrible face thinking about that, I remember skinning my knuckles with those bastards but my foot?! Nooooooooo",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SoftLikeABear",
                            "body": "Ouch.\n\nThe worst I've had from a tape dispenser is it slipping from my grasp while the end of the tape was attached to my finger. It swung around me and then hit me squarely in the crotch.\n\nYou definitely have me beat.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Pale-Worldliness9399",
                    "body": "May his socks always be slightly damp. May his pillow always be warm. May he always remember something he needed immediately after sitting down. May his phone die and he be late all the time.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Mindless-Top766",
                            "body": "Absolutely!! P r e a c h!! May his clothes never be clean. May he always stink. May he always step in poop and may birds always shit on his face and clothes 🙏🙏",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "chromaticluxury",
                                    "body": "I love the viciousness. May he always be ghosted by the third date. May his mom grow to hate him and disinherit him. May his red-pill \"brethren\" in his head canon \"brotherhood\" slowly start laughing at him behind his back until it's all of the time. May everyone he loves abandon him, and everyone he wishes would love him laugh at him",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Pale-Worldliness9399",
                                    "body": "The problem with these ones is they harm the people around him. I want him to suffer. Not them. 😞",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tacwombat",
                    "body": "May he always be afflicted with pimples inside his nose and get an insanely itchy butt that he can't help but scratch in public.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Mindless-Top766",
                            "body": "Hell yeah!! He is gonna have a miserable life :))))",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PashaWithHat",
                    "body": "Dream bigger. May he take one of the many medications with [Stevens-Johnson syndrome](https://en.m.wikipedia.org/wiki/Stevens%E2%80%93Johnson_syndrome) as a potential rare side effect and end up with a necrotic rash *right* on his dick.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stunning_Loquat_7323",
            "body": "Well done for oop believing and supporting his sister. And following through with his superiors at work. Hopefully she can get some counselling \n\nIt is sad many women experience this every other Tuesday.",
            "score": 20,
            "replies": []
        },
        {
            "author": "HoldFastO2",
            "body": "Good job calling out the creep.",
            "score": 18,
            "replies": []
        },
        {
            "author": "violue",
            "body": "the entitlement is STRONG with that guy\n\nloyalty within the brotherhood my fucking ass",
            "score": 19,
            "replies": [
                {
                    "author": "Turuial",
                    "body": ">loyalty within the brotherhood my fucking ass\n\nThe Aryan Brotherhood, maybe. I'm positive that asshole voted for the AfD. Is it really an \"alternative for Germany\" if they just want to go back to being Nazis?",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "randomndude01",
            "body": "When toxic masculinity is in discussion, topics of the bastardization of the concept of “brotherhood” like this should come up.\n\nWhile I’m not in advocating for the segregation of genders, there’s just stuff that in life that coincides with your gender. \n\nAs a guy who’s been raised mostly by women, I’m more than aware of effects of the female biology by virtue of being in the vicinity. However, at best I can only empathize but I just cannot understand. I simply do not have the means to go through what a woman goes through. I can only see the effects and not feel it.\n\nBut I do for men. I understand testosterone. I understand how horny our bodies make us. I understand the underlying physical superiority we have over the fairer gender and the constraints needed to handle that. I once mistakenly body checked my own sister that was aimed at my male cousin, something we usually do when celebrating, that sent her flying. I wasn’t even going that hard and if it was my cousin that got it, he’d barely even budge.\n\nMy version of “brotherhood” aims at keeping fellow men accountable, share methods to cope and understand ourselves to help each other, a place for us to just let it go with fellow people who can empathize AND understand.\n\nBut that’s been bastardized to mean a boy’s club where men can brag how they treat women like objects, a place to share how to get away with cheating, or put down other men for being too “feminine.” \n\nGuys like that “friend” are the people why I lost touch with a few friend groups I had over the years and it just sucks.",
            "score": 36,
            "replies": [
                {
                    "author": "CrimsonStiletto",
                    "body": "You sound like my husband. You're a good egg.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "randomndude01",
                            "body": "Thanks, I try but life never makes it easy.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Stunning-Stay-6228",
                                    "body": "If it makes you feel better, as a small afab person, I have encountered a lot of good men, men who understand their privilege socially and physically, are understanding and helpful without making me feel figuratively small.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "paulinaiml",
                    "body": "The brotherhood would approve this post",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 9,
            "replies": [
                {
                    "author": "autistic_cool_kid",
                    "body": "Just so you know, when you share an Instagram reels like this apparently, Instagram shows me your account and I can see your face",
                    "score": 20,
                    "replies": [
                        {
                            "author": "PotentialityKnocks",
                            "body": "Thanks for letting me know!",
                            "score": 12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mnl_cntn",
            "body": "Loyalty within the brotherhood means beating the shit out of rapists. That disgusting fuck needs to get “civilian arrested”",
            "score": 5,
            "replies": []
        },
        {
            "author": "Skinna_JTD",
            "body": "“Come on man, loyalty within the brotherhood.”\n\n“You’re right,” punches him in the dick, “I have completed my loyalty within the brotherhood”",
            "score": 6,
            "replies": []
        },
        {
            "author": "Snackgirl_Currywurst",
            "body": "> and man… seriously, my sister?\n\nI mean, I get that he's especially concerned for his sister compared to any other woman. \n\nBut shouldn't the reaction rather be \"(colleague) is a disgusting piece of shit for harassing amother individual sexually\" instead of \"you're my friend, how dare you touch my sister\"? \n\nThis isn't about OOP and his relationships, this is about OOPs colleague being a misogynistic pos. \n\nBoth men in this story treat women like props to their story, instead of seeing them as an individual person. It's just that one of them doesn't harass them on top of that.",
            "score": 19,
            "replies": [
                {
                    "author": "misselphaba",
                    "body": "This. This story isn’t great. OOP makes it to “not a rapist” but the misogyny drips off the rest of it.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "crystallz2000",
            "body": "Poor girl. It's horrible what we women have to go through every day. I once heard someone say, \"If all the men in the world disappeared, who would protect the women?\" And someone said, \"Who would we need to be protected from?\" It really made me think.",
            "score": 2,
            "replies": [
                {
                    "author": "WeeklyConversation8",
                    "body": "I heard that too.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "8_foot_leprechaun",
            "body": "OOP is a better man than me, I would have stomped his ass then and there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "schumi33510",
            "body": "How could he not hit this deesphit ?",
            "score": 2,
            "replies": [
                {
                    "author": "waterdevil19144",
                    "body": "That's literally why he took Tuesday, his first day back, off.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "schumi33510",
                            "body": "I would have done something stupid anyway, he probably know where he live, or at least try to bring my sister to the police (I know they probably can’t do anything)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Latter-Refuse8442",
            "body": "More men need to start questioning a brotherhood that threatens sexual assault.\n\n\nUs women need more men to stand up for us and call this out. Because when we stand up for ourselves, it was \"just a joke\" and lighten up. Men value other men's opinions more than a woman's life. As long as men value having friends more than having integrity, we are all in trouble. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "SteroidSandwich",
            "body": "That's a guy waiting to get on a list somewhere",
            "score": 1,
            "replies": []
        },
        {
            "author": "NumberOneNPC",
            "body": "I know op feels guilty but he’s taken literally every single step he should take in the aftermath of something like that. His sister will remember this for the rest of her life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GroovyYaYa",
            "body": "Was this a work event?  Co-worker is a pig and deserves all the consequences, but I don't get how this leads to termination at work unless there is a morality clause or something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlappityFlurb",
            "body": "OP has more restraint than me. Something like this would have ended up with all the boys in the family piling into a couple of trucks and jumping the creep. While people like my grandma cheer us on, while assuring us the family will cover the bail. That guy was bold to assume nothing will ever happen to him, just hasn't messed with the wrong people yet.",
            "score": 1,
            "replies": []
        }
    ]
}