{
    "title": "Coworker shares private information about me in a meeting",
    "author": "soliraco",
    "subreddit": "BestofRedditorUpdates",
    "rank": 7,
    "score": 7860,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 434,
    "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1jdq7gz/coworker_shares_private_information_about_me_in_a/",
    "id": "1jdq7gz",
    "selftext": "I am NOT OOP. OOP is u/DangerousCalendar960\n\nOriginally posted to r/Ratschlag\n\nTrigger warnings: >!abortion, workplace harasssment!<\n\n**Posts were translated from German to English.**\n\n[Coworker shares private information about me in a meeting](https://www.reddit.com/r/Ratschlag/comments/1flato3/kollegin_erz%C3%A4hlt_private_dinge_%C3%BCber_mich_im/) September 20, 2024\n\nHey everyone, I (F, 27) really need your advice on how to handle this situation.\n\nI work an office job, and next to me sits the executive assistant (F, 61). We don’t get along well because she treats me like her daughter. I notice it every time it happens and ask her to stop, but she doesn’t.\n\nToday, we were in a tense meeting discussing a sensitive topic for the company, the atmosphere was already strained among the eight participants. At some point, our boss suggested taking a break or calling it a day, I agreed that ending the meeting might be the better option. The assistant then looked at me weirdly and, in a very aggressive tone, said, \"Well, you sure know a lot about terminations.\"\n\nThere was a brief, awkward silence before she immediately added, \"Because she had an abortion.\"\n\nI was completely stunned and had no idea how to react. My colleagues were just as shocked. I just wished everyone a nice weekend, left the room, and went home early.\n\nIt’s true that I had an abortion this year, but I have no idea how she found out. Only two people in my life know about it, and she doesn’t know either of them.\n\nRegardless, I find it absolutely unacceptable to bring something like that up - especially in a professional setting, whether it’s relevant to the discussion or not.\n\nNow I’m wondering what steps I can take. We don’t have a workers’ council, our \"HR\" representative is based at another location and is currently on extended sick leave. Our boss sees \"these kinds of conflicts\" as personal issues that should be resolved between the individuals involved.\n\nI plan to confront the assistant on Monday.\n\nCould there be (legal) consequences for her, or do I just have to accept this and move on?\n\nI’d really appreciate any advice, thanks in advance!\n\n**Update** (same post, same day)\n\nI have an appointment with a lawyer first thing Monday morning. Since we only need a sick note from the 3rd day of absence, I’ll be calling in sick on Monday and discussing the next steps with the lawyer.\n\nI’ve also found the contact details of the data protection officer at the clinic, but I’ll wait until after my lawyer appointment to proceed with that.\n\nI really appreciate all of your support! The idea that sensitive data might have been leaked from the clinic didn’t occur to me on my own, and I hadn’t even considered it before. You’ve all opened up a lot of options for me that I’ll discuss with the lawyer on Monday. Thank you for that!\n\nUPDATE: First of all, thank you for all the helpful responses, I’ll try to reply to as many as I can!\n\nAfter a thorough search online, I found out that the partner of the boss’s son actually works at the clinic where I had the procedure. I strongly suspect that this is how the assistant got hold of the information, as she regularly attends family events and birthdays of the boss’s family.\n\nThis seems to be the most likely explanation for how she found out.\n\n**Update** (same post) September 26, 2024\n\nHello everyone, here’s the promised update :)\n\nOn Monday, I had a meeting with a lawyer, and it was definitely worth it. During the meeting with the lawyer, my boss called me and asked me to come to the office for a clarifying conversation. After discussing with my lawyer, I went to the office to have the conversation. The assistant greeted me in tears and insisted that it \"wasn't meant like that.\" I took my favorite colleague with me as a witness/support, and we entered the meeting. Given the sensitive nature of the topic, I asked for minutes to be taken, which everyone agreed to.\n\nIn the conversation, my boss explained that such behavior between colleagues would not be tolerated, and the assistant had to apologize and promise that it wouldn’t happen again. I then asked what consequences would follow, to which he seemed confused and asked if I even wanted consequences, since an apology was given.\n\nNaturally, I demanded consequences for the assistant and clarification about the data leak. I also told the boss that it was outrageous that he was asking if I wanted consequences instead of implementing them himself, especially when it comes to something as sensitive as spreading private information. He became a bit grumpy but explained that it wasn’t a data leak and that he had just \"slipped up.\" When I asked where he got this information from, he bluntly admitted that he had learned about it through his daughter in law. He even followed up with, \"But you couldn’t even tell you had the procedure.\"\n\nI seriously thought I was going to flip out in that room, but fortunately, I managed to stay composed. I asked for confirmation of his statements to make sure everything was understood correctly, and then had everyone sign the protocol. I got up, wished everyone a nice day, and informed him that my lawyer would be contacting him, and we’d go from there.\n\nOne of the six colleagues who was in the meeting on Friday approached me afterward, apologized for not saying anything in the moment, and wished me luck, strength, and that someone would react better than he did if something like this happened again. I really appreciated that.\n\nThree days later, here’s where we stand: The assistant received her third warning - I don’t know where the first two came from. Today, I received confirmation that she has to leave the company. I think my boss would have preferred not to make this decision, but since the situation spread very quickly through the office grapevine, it seems to have influenced his decision.\n\nAs for the clinic: The first contact was made through my lawyer. I didn’t personally call or inform the data protection officer - the lawyer took care of all of that. The lady at the clinic no longer works there, as the lead doctor seems to be aware of the risks. He apologized both over the phone and in writing, and I’ll be receiving a nice compensation.\n\nAnd with my employer: We were able to agree on a very nice severance package, and the termination of my employment is happening soon.\n\nThese are all nice solutions, but there are still civil and criminal proceedings ongoing, which I can’t discuss right now. The lawyer is motivated to bring further consequences, especially regarding GDPR violations.\n\nAll I can say is: Don’t tolerate this kind of treatment! Last Friday, I was completely overwhelmed and unsure how to handle it. But I received so much support and perspective – especially here on Reddit – that I was able to navigate the situation and seek help.\n\nThanks for reading all the way through and for all the responses and comments!\n\n**Reminder - this is a repost. Please don't comment on the original post.**",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "StitchandReuben",
            "body": "I’m somewhat stunned at the number of folks that screwed up so badly for this to happen. Boss’s son’s partner. Boss. Boss’s assistant. I mean, birds of a feather? But still, I’m so glad OOP is taking this as far as it can go.",
            "score": 6196,
            "replies": [
                {
                    "author": "SnakeJG",
                    "body": "I didn't notice where it was posted when I started reading, but when I saw GDPR I knew that they were screwed.   European data protection does not fuck around.",
                    "score": 2520,
                    "replies": [
                        {
                            "author": "EatMorePieDrinkMore",
                            "body": "If you violate GDPR as a corporation, the fine is based on your gross revenue.  It’s forced American companies to really be stricter about privacy, too.",
                            "score": 1447,
                            "replies": [
                                {
                                    "author": "angelicism",
                                    "body": "More fines for companies should be based on their gross revenue. It's the only way they'll stop fucking up.",
                                    "score": 425,
                                    "replies": [
                                        {
                                            "author": "EatMorePieDrinkMore",
                                            "body": "One of the Nordics bases speeding fines on income. That’s brilliant.",
                                            "score": 226,
                                            "replies": [
                                                {
                                                    "author": "ResidentEvilNerd13",
                                                    "body": "Finland. Totally based for that.",
                                                    "score": 112,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "happierThanABird",
                                                    "body": "Finland does that. In Denmark severe speeding can result in cars being impounded by authorities. Whether the owner was the one speeding or not.",
                                                    "score": 71,
                                                    "replies": [
                                                        {
                                                            "author": "MisterMarsupial",
                                                            "body": "Exactly the same in Australia as well.\n\nMore than 45km/hr over the limit and they'll impound your car for a month. Do it again and they'll confiscate your car and crush it or sell it at police auction.",
                                                            "score": 30,
                                                            "replies": [
                                                                {
                                                                    "author": "EatMorePieDrinkMore",
                                                                    "body": "I love this.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MisterMarsupial",
                                                                            "body": "https://www.drive.com.au/news/victoria-police-crush-first-vehicle-under-anti-hoon-laws/\n\nLooks like they give them to the State Emergency Service (SES) for training before crushing them, ha.",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "EatMorePieDrinkMore",
                                                                                    "body": "What the heck does “hoon” mean?!",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "MisterMarsupial",
                                                                                            "body": "When someone speeds a whole lot over the limit, has a drag race or does something else stupid in a car like burnouts in a residential neighbourhood etc.",
                                                                                            "score": 6,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "EatMorePieDrinkMore",
                                                                                                    "body": "Oh, I wish we could go after them like that here",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "gavch298",
                                                                                            "body": "Hoon is Australian / New Zealand slang, meaning to go fast, carelessly.\n\nIt can also be used to mean taking a turn or having a go on something, e.g. “hey Gary, give me a hoon on your vape” (pronounced “oi Gazza, gizza hoon on ya vape”).",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ok_Shape349",
                                    "body": "I actually think that's a big part of the reason for the current attempts to destabilize the EU by the felon and the muskrat\n\nMore reason for it to exist",
                                    "score": 625,
                                    "replies": [
                                        {
                                            "author": "EatMorePieDrinkMore",
                                            "body": "Not just GDPR but tons of other regulations the EU has issued, as well.  The tech companies are really in the crosshairs,and rightly so.",
                                            "score": 307,
                                            "replies": [
                                                {
                                                    "author": "Ok_Shape349",
                                                    "body": "Couldn't agree more, we'd be better off if they got the same scrutiny everywhere",
                                                    "score": 46,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "joe-h2o",
                                                    "body": "Yup, and you can see how the tech companies are trying to cling to control and monopoly where it's allowed.\n\nFor example, Apple has been forced in the EU to allow you to change the default maps app for navigation in CarPlay and other navigation requests. It's not enough to just allow Google Maps and Waze etc, they have to allow the option to set it as default. \n\nYou can *only* do this in the EU. In the USA you're still stuck with Apple maps as the default. It's more difficult to separate out the software to do this - it would be easier to just change the setting for everyone, but they obviously don't want to do this unless they have to.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "EatMorePieDrinkMore",
                                                            "body": "When I get a new phone, the first thing I do is delete stupid Apple Maps.  I never u sweat and the default thing though I should have.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "joe-h2o",
                                                                    "body": "I actually like Apple Maps - I prefer the interface in CarPlay compared to Google Maps, but I just like having the option to change the default now.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "abritinthebay",
                                                    "body": "Unfortunately a lot of the tech regulations the EU proposes are incredibly ham-fisted & poorly thought out.\n\nThey’re pretty great at consumer & data protection tho. It’s encryption & hardware they suck at.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Couldhavesizeddown",
                                                            "body": "For something ham-fisted and poorly thought out, it sure protects more than what we have in the US. In Healthcare here we have HIPAA, but that's the strictest it goes.",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "EatMorePieDrinkMore",
                                                            "body": "I agree that they’ve missed the ball in some areas but at least they are trying. It’s more than Americans can say.  Hell, our joke of president is letting a ketamine addict and his merry band of tech bros douchebags rummage through our federally protected data like my dog looking for a bone.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DaniMrynn",
                                    "body": "The org I work for is so large the fine would be over seven figures, so we have a department dedicated specifically to GDPR and individual staffs have to go through regular training.",
                                    "score": 57,
                                    "replies": []
                                },
                                {
                                    "author": "EthexC",
                                    "body": "That's amazing",
                                    "score": 59,
                                    "replies": []
                                },
                                {
                                    "author": "Karkenna",
                                    "body": "American companies are dog shit with protecting private information and personal data. It's all in the interest of consumerism and people's personal data feeds that.",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "mvsuit",
                                            "body": "Generally true but in the US a leak of medical information from a care provider (“covered entity”) is a violation of federal law—HIPAA—and that is a big deal. There are potential fines as well as civil and even criminal penalties.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "otetrapodqueen",
                                            "body": "I think some of it depends on industry, I worked in pharma labs and they generally adhere to European standards for data privacy",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Distinct_Project_979",
                                    "body": "It’s €20 million euros OR 4% of global annual turnover, which ever is higher. GDPR does not fuck around.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Jason_liv",
                                    "body": "Or they block their websites from being accessed in Europe - Home Depot does this for example.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TA_totellornottotell",
                            "body": "Completely. I work at an accounting firm in the US but because we’re a global company and because of the nature of our work, we have had extensive training to make sure we understand the GDPR rules for when we deal with Europe.  Those rules have also influenced our own internal policies.",
                            "score": 314,
                            "replies": [
                                {
                                    "author": "Terrie-25",
                                    "body": "I work in the international contracts for my company. I live and breathe GDPR on a daily basis. Something like this would be my personal nightmare. Personal health information? Oh, boy. Boss's DiL is lucky if she gets out of this with the shirt on her back.",
                                    "score": 163,
                                    "replies": [
                                        {
                                            "author": "I_Am_Become_Air",
                                            "body": "I am good with that level of punishment.  She should NOT have spoken about OP's medical treatment.",
                                            "score": 100,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "blubb444",
                                    "body": "Ah, the good old [Brussels effect](https://en.wikipedia.org/wiki/Brussels_effect) (closely related to the [California effect](https://en.wikipedia.org/wiki/California_effect))",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TA_totellornottotell",
                                            "body": "I cannot say it’s a bad thing, though.  And I think it is, in many ways, independent of the Brussels effect. Especially with accounting firms - after Enron and Sarbanes Oxley, it’s been a constant expanding of ethical and record keeping standards.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "frumperbell",
                            "body": "I believe the correct terminology to describe their situation is Gigafucked.",
                            "score": 140,
                            "replies": [
                                {
                                    "author": "PM_ME_YOUR_WEIRD_PET",
                                    "body": "Unlubed gigfucked",
                                    "score": 27,
                                    "replies": []
                                },
                                {
                                    "author": "SpeedyCat202",
                                    "body": "I am so stealing this phrase!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "harrellj",
                            "body": "Even in the US with our laughable laws, this would still be a violation of HIPAA.",
                            "score": 140,
                            "replies": [
                                {
                                    "author": "SnakeJG",
                                    "body": "And the wrist slapping would be a solid mild inconvenience for the company.",
                                    "score": 100,
                                    "replies": [
                                        {
                                            "author": "Kimmalah",
                                            "body": "In that scenario, the company wouldn't be bound by HIPAA at all. The only one who would be in trouble here (at least in terms of that law) would be the clinic/the employee who leaked the information.",
                                            "score": 39,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lmNotaWitchImUrWife",
                                    "body": "Well, none of OP’s colleagues/boss are bound by HIPAA in this instance. That covers the clinic employee obviously, but I’m having trouble seeing what laws OP’s employer broke here, other than potentially creating a hostile work environment.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Hefty-Analysis-4856",
                                            "body": "This isn’t American. They have something called GDPR. The HIPAA isn’t the issue.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Kimmalah",
                                                    "body": "Yes, people are just talking about this hypothetically.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Hefty-Analysis-4856",
                                                            "body": "This was for the comment above me.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "GillianOMalley",
                                                                    "body": "Which was talking about the hypothetical of it being in the US instead of Germany.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "accj30",
                            "body": "Based on the sub where it was originally posted, you can assume that it was in Germany or another country that uses the German language or a derivative.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "Conscious_Control_15",
                                    "body": "I assumed Germany because she mentioned worker's council. Betriebsräte are not uniquely German, but the way she mentioned it seemed quite German to me.\n\n\nAnd one of the first things musk did at his German factory was trying to subvert the worker's council there. ",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ok_Shape349",
                            "body": "Yeah people constantly give out about GDPR but shit like this is exactly why it's needed",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "layz2021",
                            "body": "This is not even gdpr, it's \"worse\" even before gdpr you weren't allowed to go around spreading medical information",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Witty_Cucumber255",
                            "body": "The post is from Germany, and it's mentioned at the top of this post that the original has been translated from German into English. And we do take data protection extremely seriously here, especially health information. Also, our employment laws are extremely pro-employee, so the boss was doubly screwed; rightfully so. \n\n\n(btw, kudos to @soliraco for the translation, it's excellent!) ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Inevitable-tragedy",
                            "body": "Thanks. I was actually really confused about how she managed all that with a lawyer in a weekend. From my understanding, it typically doesn't work like that in the US, and she probably would've been fired for not showing up Monday, just so the company wouldn't have to deal with it. It really sucks over here lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WaltzFirm6336",
                    "body": "I think it’s pretty typical in privileged/entitled groups of people. They see themselves as so far removed from the ‘little people’ that they don’t even see them as human, just pawns. \n\nEA probably been protected for so long, and is so in with the boss and family they thought they were untouchable. Boss thought he was untouchable because he’s the boss. I can see the DIL getting enveloped in the superiority of the family and losing their own reality too.",
                    "score": 885,
                    "replies": [
                        {
                            "author": "szu",
                            "body": "It sounds like a very small firm or branch of a bigger company to be honest. Sometimes these far-flung branches can develop their own 'culture' and their behaviour can be shocking to HQ.",
                            "score": 341,
                            "replies": [
                                {
                                    "author": "EscalatorBobalator",
                                    "body": "Yes it sounds like small/rural town behaviour to me, given that the information came from the boss' daughter in law. Normally people either wouldn't have those sorts of ties to each other or they wouldn't be aware of them, but small places operate differently. They're probably so used to people gossiping/knowing others' business that they don't register how intrusive, (and in this case, illegal) it is.",
                                    "score": 214,
                                    "replies": [
                                        {
                                            "author": "Crazy4Swayze420",
                                            "body": "Depending on the state if in the USA the DIL may be looking at fines from 50 to 250k and jail time of up to 10 years.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "teatabletea",
                                                    "body": "2nd and 4th line of the OP above.",
                                                    "score": 19,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "dropshortreaver",
                                                    "body": "Its in Germany",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bobthemundane",
                                    "body": "Someone should make a show about a far flung office and the shenanigans that they can get in. Maybe make it about something boring, like paper?",
                                    "score": 49,
                                    "replies": [
                                        {
                                            "author": "7AlphaOne1",
                                            "body": "Yeah, and base it in a sorta mundane but still kinda urban town. Like, say, Scranton, Pennsylvania",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "author": "fractal_frog",
                                                    "body": "And everyone's heard of Scranton.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "1568314",
                            "body": "It sounds more like they are jist so used to clucking like hens with their colleagues that they forgot not everyone is family and will tolerate their behavior.",
                            "score": 18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "potpourri_sludge",
                    "body": "It’s kind of amazing what idiots can do when they get together like this. And by that I mean it’s amazing how fast they can fuck up.",
                    "score": 68,
                    "replies": []
                },
                {
                    "author": "DaydreamTacos",
                    "body": "Yes! What the hell is wrong with these people? They had zero shame until they were forced to face the music. How utterly disgusting.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Himeera",
                    "body": "I am both stunned and not. If it's bigger city, then all the coincidences to happen for this to happen are kinda crazy.\n\nIf its a small(er) town in countryside? Well then, even in EU the rumors can spread like wildfire from Drs offices... And while overall imho EU ain't as religiously nuts as some other parts of the world, Germans are quite christian, especially in the south.\n\nGood on op and her lawyer though.",
                    "score": 124,
                    "replies": [
                        {
                            "author": "ctkwolfe",
                            "body": "Abortion isn‘t really seen as a religious issue though",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "BarnDoorHills",
                                    "body": "This wasn't really about abortion though. It was about hurting and shaming her. That's very Christian.",
                                    "score": 39,
                                    "replies": [
                                        {
                                            "author": "ctkwolfe",
                                            "body": "You don‘t need Christianity to be a shitty person in Germany, we manage that without professing religious beliefs. I doubt that assistant had religion on her mind.",
                                            "score": 47,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "fuckyourcanoes",
                                    "body": "Are you serious?! Have you *seen* what's happening in the US?!",
                                    "score": -69,
                                    "replies": [
                                        {
                                            "author": "ctkwolfe",
                                            "body": "I mean in Germany of course, that‘s what we were talking about",
                                            "score": 75,
                                            "replies": [
                                                {
                                                    "author": "fuckyourcanoes",
                                                    "body": "This is the internet. You need to be specific if you're talking about a particular country.",
                                                    "score": -121,
                                                    "replies": [
                                                        {
                                                            "author": "rayitodelsol",
                                                            "body": "Please stop feeding into the American stereotypes, we look stupid enough on the daily without folks bringing up USA-specific issues in a conversation about a completely different country and culture.",
                                                            "score": 98,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Ilikepie81",
                                                            "body": "It's literally a German subreddit?",
                                                            "score": 69,
                                                            "replies": [
                                                                {
                                                                    "author": "fuckyourcanoes",
                                                                    "body": "r/BestOfRedditorUpdates is a German subreddit?",
                                                                    "score": -80,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ookoshi",
                                                                            "body": "Lol, the person you're responding to is responding to a comment about Germany, and OOP is also from Europe.  The US isn't the center of the universe in every conversation.\n\nJust take the L here and move on, you keep doubling down and it's embarrassing.",
                                                                            "score": 44,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "writinwater",
                                                                            "body": "BORU is a repost community. You know, where people post things that were originally posted elsewhere. The original post, as you would see if you look at the top of *this* post, was a German sub. So, yes, it was literally posted on a German subreddit.\n\nPlease stop embarrassing America. Our government and voters are doing a bang-up job of that already.",
                                                                            "score": 80,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Licensed_KarmaEscort",
                                                                                    "body": "No kidding. \n\nI am an ignorant American, but I know I am. And I’m kinda enjoying learning a bit about how Germany handles stuff. (Not in a “I’m so humble and smart” way, in a “I am a nosy little person in a small US town and I really like seeing things outside my own experience” way. It’s kinda nice to know I’m dumb because I get to learn new stuff all the time.)1",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "writinwater",
                                                                                            "body": "I know what you mean, I'm nosy as fuck. I live for posts like this from other countries.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Licensed_KarmaEscort",
                                                                                                    "body": "Right?\n\nTell me EVERYTHING. I am a country girl who has meaningful conversations with my pet chicken, I neeeeeed it.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Pretend-Sundae-2371",
                                                            "body": "America is not the default. It should not be assumed that American issues apply if the person is not specific. And it was in a German sub.",
                                                            "score": 16,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ctkwolfe",
                                                            "body": "I replied to a comment talking about Germany, in a post about Germany and you come here with USA talk. I don‘t give a shit about the US and why do you assume everyone is talking about that dystopian nightmare of a country anyway",
                                                            "score": 78,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "blubb444",
                                                            "body": "I'm tempted to link this to r/USdefaultism/",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "fuckyourcanoes",
                                                                    "body": "I don't even live in the US. I just pay attention to the news.",
                                                                    "score": -2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "twistedspin",
                                            "body": "That's a recent, US propaganda thing. Until recent decades even in the US evangelicals didn't care about abortion, it was only catholics and was part of why they were considered kind of cult-y.",
                                            "score": 37,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ellensundies",
                                    "body": "It is in the United States. It’s a very serious religious issue here.\n\nEdit: okay then",
                                    "score": -19,
                                    "replies": [
                                        {
                                            "author": "fractal_frog",
                                            "body": "The location of the events of *the actual post,* which is what we're discussing in *the comments of the post,* is Germany.",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "ctkwolfe",
                                            "body": "Again: this is Germany",
                                            "score": 23,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdFew8858",
                    "body": "Funny how out of the three people who babbled, the two women got fired, but the old man gets to keep his job. Fingers crossed for an update on that.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "perpetuallyxhausted",
                    "body": "Possible boss's son too, depending on how direct the line of info went from the partner to the boss.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Own-Source-1612",
                    "body": "I've worked with big wigs and how in the world most businesses don't fall apart, I will never know. So many people in charge are beyond incompetent.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Strange-Artichoke660",
                    "body": "This is insane. I'm glad she got the resolutions that she did but they better just be the appetizers!",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "tacwombat",
                    "body": "**Boss:** But she's like faaaaamily.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "accj30",
                    "body": "I bet 10 bucks that the assistant is the boss's mistress and he told her about OP's abortion in a pillowtalk about office gossip. It explains his reluctance to fire his assistant in a very serious case like this.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "EtainAingeal",
                            "body": "Even if he isn't boning her, to discipline her, he had to know the question of how she found out would come up and he'd have to admit that not only was he sharing personal medical information about one employee to another, but that his daughter in law (whose job relied on privacy) had told him. It didn't require an affair for him to want to cover for his fuck-up.",
                            "score": 58,
                            "replies": [
                                {
                                    "author": "marino1310",
                                    "body": "His daughter should absolutely lose her job for this. And probably will, in the US HIPPA violations are taken *very* seriously and I know EU is even more strict",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "EtainAingeal",
                                            "body": "Sounds like she has, OOP said she no longer works there and that they offered an apology plus compensation",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "iikratka",
                            "body": "She’s 61 years old. Of course there’s a lid for every pot, but that wouldn’t be my first guess.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Roadgoddess",
                    "body": "Yeah, the boss knew he screwed up, I was definitely trying to push this down. I’m so glad that OOP took this all the way.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BlaketheFlake",
                    "body": "Unfortunately, as someone who has worked for a small, owner operated company that hired family, played favorites I can totally see how this occurred. People get way too comfortable in these types of environments.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Geode25",
                    "body": "\"Now apologize, shake hands and make up. No harm was done, get back to work\" *smh*",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "3dgemaster",
                    "body": "What do they all have in common? None of them seem to think a person's medical history is private and sensitive, and should be treated as such. I wish OP every bit of strength needed to hit these assholes with everything.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ThisIsAlexisNeiers",
                    "body": "It is shocking to me that someone would choose to work for an abortion clinic and not be fiercely protective of pregnant people and their privacy. It’s such a sensitive subject, I can’t for the life of me understand what would compel the son’s partner to relay this info to *anyone*, partner included",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Beneficial-Way-8742",
                    "body": "OOP handled this sooooo well!   Id love to have a lawyer like hers",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "lambdaBunny",
                    "body": "This story has \"takes place in a red state\" written all over it. Fucking hate this world.",
                    "score": -68,
                    "replies": [
                        {
                            "author": "midmorningnaps",
                            "body": "Unlikely, given it was posted to a German subreddit.",
                            "score": 76,
                            "replies": [
                                {
                                    "author": "lambdaBunny",
                                    "body": "Good point.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AriaCannotSing",
            "body": "I empathize with the guy who apologized for not saying anything in the moment. The assistant's behavior was so wtf-worthy that I would have been at a loss of words, too.\n\nThis is a good situation for an unfiltered, \"What the fck\" in the ensuing silence.\n\nLastly, the boss is a special kind of idiot. I don't care about the apologies of someone who is just sorry they're facing consequences.",
            "score": 1727,
            "replies": [
                {
                    "author": "SlutForDownVotes",
                    "body": ">The assistant greeted me in tears and insisted that it \"wasn't meant like that.\"  \n\nYou've got to be kidding me. How else was it meant, if not exactly the way it sounded?",
                    "score": 730,
                    "replies": [
                        {
                            "author": "alleswaswar",
                            "body": "People like her will never admit responsibility for any wrongdoing lol. It’ll always be “I didn’t mean it like that / I was just joking” or “it’s not my fault you were offended” 💀",
                            "score": 334,
                            "replies": [
                                {
                                    "author": "QCisCake",
                                    "body": "Ah. The narcissists prayer....\n\nThat didn't happen.\n\nAnd if it did, it wasn't that bad.\n\nAnd if it was, that's not a big deal.\n\nAnd if it is, that's not my fault.\n\nAnd if it was, I didn't mean it.\n\nAnd if I did, you deserved it.",
                                    "score": 138,
                                    "replies": []
                                },
                                {
                                    "author": "FingalPadraArran",
                                    "body": "Yeahhh my mom used to tell me growing up that \"no one will ever want to marry you if you cant keep a schedule/the kitchen clean/be  sweet/etc\" so I felt unlovable unless I was perfect. I told her that as an adult and her response was \"well I never meant for you to take it that way! You should have told me.\" And implied that it was my fault. \n\n\nWhen there is literally no other way to take a statement like that. ",
                                    "score": 39,
                                    "replies": [
                                        {
                                            "author": "Licensed_KarmaEscort",
                                            "body": "My mom always told me “no one will EVER love you until you love yourself”\n\nWhelp, I hate myself so that just told me even my own mother couldn’t love me and I was unlovable, which… thanks Mom?\n\nI’m an adult and still can’t shake that. My stepmom on the other hand replies to my self hate with “Well I love you a lot, and I’m older and wiser so just assume I’m right about how lovable you are.” (It sounds kinda mean in text, so you’ll have to trust me that it’s affectionate.)\n\nI struggle to even like myself, but I’m slowly starting to think I might not be an entirely terrible person.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "bluediamond12345",
                                    "body": "That’s not who I aaaaaaaaaaaam",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Aggressive_Plenty_93",
                            "body": "and the fact that assistant said “you sure know a lot about terminations” before she dropped that line! What other way can it be meant??",
                            "score": 261,
                            "replies": [
                                {
                                    "author": "calling_water",
                                    "body": "It seems so shoehorned in, too. Like she was looking for an opportunity to bring it up. Certainly didn’t sound like a “slip” — she should never be talking like that at all.",
                                    "score": 229,
                                    "replies": [
                                        {
                                            "author": "Half_Man1",
                                            "body": "Yeah that’s a grasp at straws for a segue to gossip on a coworker in a heated meeting. That was meant to be hurtful.",
                                            "score": 87,
                                            "replies": []
                                        },
                                        {
                                            "author": "Sheephuddle",
                                            "body": "It's almost as if she meant to just think it but her mouth betrayed her. It's such an astonishingly bad thing to say in any circumstance.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Historical_Agent9426",
                            "body": "“It wasn’t meant to get ME in any kind of trouble, it was just meant to humiliate you”",
                            "score": 80,
                            "replies": []
                        },
                        {
                            "author": "ShutUpIWin",
                            "body": "What difference does it make in what way it was said? What possible way could it be that would absolve you from saying that?",
                            "score": 75,
                            "replies": [
                                {
                                    "author": "SlutForDownVotes",
                                    "body": "Excellent point.",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "marino1310",
                            "body": "Lmao even if she didn’t mean it as the insult it clearly was, the more horrific part of it was revealing private medical information to all her coworkers",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "StreetofChimes",
                    "body": "My brain would have absolutely short circuited if I was in that meeting. Too much crazy in one moment to process. Why does this person know? Why is it being casually mentioned in a meeting? Why do I work with obvious lunatics? What other medical history do they bandy about? What the actual fuck?",
                    "score": 414,
                    "replies": [
                        {
                            "author": "Kilen13",
                            "body": "Same, and after all that my next thought would probably be \"I need to change my passwords and update my CV immediately cause 1000% fuck this place\"",
                            "score": 108,
                            "replies": []
                        },
                        {
                            "author": "IWantALargeFarva",
                            "body": "I have absolutely no skin in the game whatsoever, and I’m still sitting here with my jaw open. I can’t believe someone would ever say that. What the actual fuck.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Adventurous_Pie_3064",
                                    "body": "I actually gasped when reading it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "exhauta",
                    "body": "The boss should honestly be fired. You leaked confidentiality info, then you made an insensitive comment about someone's body and the medical procedure they had, then you signed the minutes confirming you said those things? You are too big a liability to be in a leadership position.",
                    "score": 84,
                    "replies": [
                        {
                            "author": "AriaCannotSing",
                            "body": "His consequences are coming. I hope OOP can post a follow up in a year or whenever the legal issues are finished.",
                            "score": 49,
                            "replies": []
                        },
                        {
                            "author": "Ginger_Anarchy",
                            "body": "It sounds like the office isn't doing great based on the initial meeting where the comments were said. So losing two employees simultaneously, in a way that probably has other employees sending their resumes out in mass, might be the straw that broke the camera back.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "please_and_thankyou",
                                    "body": "My world would spin out of control without my EA! Them being down two admins will torpedo the office.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Viperbunny",
                    "body": "I agree. It was so out there r I don't think their brains fully wrapped around it!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ExitingBear",
                    "body": "Same.\n\nIt's so wrong that you don't know what to do and do nothing.  (Which is also wrong).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "reluctantseal",
                    "body": "Yeah, sometimes people read about an incident, and they say, \"But why did no one intervene??\" Well, because it was so absurd and unpredictable that no one there had time to think of something to say and actually say it. They were all busy trying to figure out what the fuck was happening.\n\nThe Build-a-Bear birthday party post that went around a while back is another good example.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mrfish31",
            "body": ">He became a bit grumpy but explained that it wasn’t a data leak and that he had just \"slipped up.\"\n\n\nKnow what else that might be called? A FUCKING DATA LEAK",
            "score": 655,
            "replies": [
                {
                    "author": "paulinaiml",
                    "body": "Not so important if family is involved it seems",
                    "score": 39,
                    "replies": []
                }
            ]
        },
        {
            "author": "CosplayGeorge",
            "body": "The way I would have said, \"What the fuck is wrong with you?\" to the EA in that meeting.\n\n\nJFC I can't even. I hope oop takes that person who worked at the clinic to the damn cleaners",
            "score": 2604,
            "replies": [
                {
                    "author": "raiseyuorhandt",
                    "body": "Same. After that comment about not being able to tell if she had an abortion. I would’ve stood up and screamed in his face. Lmao",
                    "score": 1004,
                    "replies": [
                        {
                            "author": "bitemark01",
                            "body": "That's such a weird fucking comment. How would you \"tell,\" like, why is this a thing you would even say to another human? \n\n\nI hope the ex boss is part of the ongoing civil/criminal proceedings.",
                            "score": 496,
                            "replies": [
                                {
                                    "author": "PhlegmMistress",
                                    "body": "Because her highest value is if she's considered fuckable. He thinks women think like that because he does so he was trying to compliment her that her body was still considered \"nice\" since pregnancy, and/or pregnancy fat would devalue her worth. ",
                                    "score": 251,
                                    "replies": []
                                },
                                {
                                    "author": "52BeesInACoat",
                                    "body": "Immediately post c section, like I was being wheeled out of the operating room at that moment, my obgyn said, approvingly, \"I can't even tell you were pregnant.\"\n\nHe'd just delivered my 6 pound 2 ounce son, and his office had been treating me for debilitating all day continuous morning sickness that had lasted the entire nine months. And insurance had only covered enough anti nausea medication for the five day work week. Five pills per week, each pill lasting eight hours. Every appointment I would ask my obgyn to appeal to the insurance company to let me keep food down during weekends too. Or at least to prescribe me morr and let me pay out of pocket. And he'd say I hadn't lost too much weight and was okay. \n\nWeird fucking comment indeed.",
                                    "score": 53,
                                    "replies": [
                                        {
                                            "author": "Fandanglethecompost",
                                            "body": "Holy fuck that sounds awful. I had a ten pound baby and gained no weight at all during my pregnancy because of constant nausea. No one was concerned, I think because I was a healthy (read: slightly overweight) weight to start with.  I was in the UK though and if I'd needed meds I'd have got them - I even got gaviscon for free!",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "SpicyPorkWontonnnn",
                                            "body": "What the actual fuck? I really wish you could have sued that OB. That's just heinous. And bordering on malpractice. I am furious on your behalf.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MagicCarpet5846",
                                    "body": "He’s saying she never even looked pregnant… I think (hope?)",
                                    "score": 43,
                                    "replies": [
                                        {
                                            "author": "ueber-ich",
                                            "body": "Nope.\n\nHe meant that she wasn’t even on sick leave/sad/depressed enough",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GWillikers_",
                            "body": "Like did he expect her to start showing up with a big scarlet A pinned to her shirts? ",
                            "score": 106,
                            "replies": [
                                {
                                    "author": "Longjumping_Hat_2672",
                                    "body": "\"Call me Hester!\"",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SherlockScones3",
                            "body": "It’s a shame we can’t post pics here - that one meme from Steven universe yellow diamond is exactly how I imagined OPs face as soon as her boss said that 😅",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Worth-Mammoth2646",
                    "body": "Oh you can bet on it that this will happen.\n\nOOP is in the EU and we have same pretty strict data regulations. This is definitely not the end.",
                    "score": 132,
                    "replies": [
                        {
                            "author": "mightyacorngrows",
                            "body": "Or the UK. We still follow GDPR, and hopefully will still do until we rejoin the EU :)",
                            "score": 30,
                            "replies": []
                        },
                        {
                            "author": "sleepingrozy",
                            "body": "Are you required to list your employer on medical forms in the EU?  It's common practice in the US primarily because of insurance.  I'm  just wondering how this person even connected the dots that OP worked for the boss. ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "EtainAingeal",
                                    "body": "It's not standard practice in the UK or at least anywhere I've been but it could just be that they're in a small community or the DIL already knew OP or the DIL overheard or was part of a casual conversation. It's pretty standard for nurses to chat to distract patients.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Worth-Mammoth2646",
                                    "body": "No you’re not but some doctors ask what kind of job you have cause it can helps with the diagnosis.\n\nWe can only guess how but I think OOP and the boss DIL know each other or at least DIL knows who OOP is.\n\nETA: I don’t know how it now works with the electronic sick notes you get at a doctors appointment but it could be that OP got a sick leave and with sick notes you can see from which doctor the employee got a sick note from. If her Boss saw her sick note from the doctor and saw that it was the one who is DIL worked with he could have just asked her.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "marino1310",
                            "body": "Even in the US you’d be fucked without lube for violating HIPPA like this. You’d lose your license and may face jail time",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Guidance1422",
                    "body": "How do you ask \"What the fuck is wrong with you?\" in corporate?",
                    "score": 248,
                    "replies": [
                        {
                            "author": "Soft_Silhouette",
                            "body": "“I am not sure why you thought it would be appropriate to say that.”",
                            "score": 618,
                            "replies": [
                                {
                                    "author": "penguin_0618",
                                    "body": "Lol, I say something similar to my students! “Why did you think that was an appropriate thing to say/do?”",
                                    "score": 141,
                                    "replies": []
                                },
                                {
                                    "author": "bitemark01",
                                    "body": "This is great, but I always like to add an \"explain to me\" at the beginning as well :)",
                                    "score": 88,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AcuteDeath2023",
                            "body": "Well in Australia, \"What the fuck is wrong with you?\" sounds exactly the same in corporate.  There might also be sounds of someone's nose breaking, coz I'd absolutely punch someone who said that about me, whether it was true or not.",
                            "score": 216,
                            "replies": [
                                {
                                    "author": "MamieJoJackson",
                                    "body": "The corporate offices I've worked in in my part of the US don't beat around the bush either, lol. The lingo is reserved for emails, client relations, formal meetings with higher ups, etc., not moments like this.",
                                    "score": 80,
                                    "replies": []
                                },
                                {
                                    "author": "Mission_Ad_2224",
                                    "body": "Literally 😂\n\nToday someone asked me something and my response was 'I don't fucking know'.",
                                    "score": 47,
                                    "replies": []
                                },
                                {
                                    "author": "SpeedyCat202",
                                    "body": "This is one of the reasons we Americans absolutely love the Australians.  Same mindset, but you guys have better accents!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AdultDisneyWoman",
                            "body": "I save polite alternatives for things that are dumb AF but work related and office appropriate. For something this awful, I wouldn't even care about corporate speak I would straight up just ask \"WTF is wrong with you\" to the busybody.",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "Aussiealterego",
                            "body": "“Did you actually mean to say that out loud?”",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "ManaKitten",
                                    "body": "“Wow, you said that out loud *and* on purpose?”",
                                    "score": 33,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gingerzombie2",
                            "body": "\"My goodness, what a thing to say.\" Or similar",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "misselphaba",
                            "body": "After a decade + in advertising, it’s just “What the fuck is wrong with you?”",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "SmartCrazy4",
                            "body": "Why exactly did you think that was an appropriate statement?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Snarkonum_revelio",
                    "body": "I’m furious with the assistant who is clearly a shit-stirrer, but the boss is who I’m really mad at. If I’m understanding correctly, the boss’ daughter-in-law works at the clinic, told the boss, and then the boss spread it to at least the assistant. That’s so many levels of unprofessional.",
                    "score": 157,
                    "replies": [
                        {
                            "author": "brainsareoverrated27",
                            "body": "He cannot be very smart if he admitted it and all of that went into the meeting minutes, that were signed. OOPs lawyer probably thinks that they never had an easier case than that.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Rhamona_Q",
                            "body": ">at least\n\nYes, if he told one person, he's probably told more.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "MightyP13",
                            "body": "It's also possible the assistant also heard from the DIL directly at a family event. But yeah, the boss still fucked up big time",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LunaMoonChild444",
                    "body": "I would have said \"No I didn't, where did you hear that from?\", gotten my info, and proceeded to a lawyer, like she did. Neither of these people can be trusted with any sensitive information, both of their careers should be over.",
                    "score": 166,
                    "replies": [
                        {
                            "author": "ena_bear",
                            "body": "The way the assistant clarified her first statement by saying “because she got an abortion,” I feel like she would have doubled-down and argued that OOP did get it and she knows because of 1, 2, 3 lol. Probably act smug thinking she had all the proof and not realize that she was the one looking like an ass. \n\nPutting the ASS in ASSistant since 2024",
                            "score": 106,
                            "replies": [
                                {
                                    "author": "LunaMoonChild444",
                                    "body": "Oh, absolutely, that's why I'd be doing it! Watch her reveal all her sources right there in front of everyone to prove me wrong, lol. Then I and everyobody there would know exactly who all the problem people are. ASS is right!",
                                    "score": 28,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CombatWombat65",
                    "body": "So many people had to be so incredibly stupid for all this to happen",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "herminihildo",
            "body": "WTF! Good for OOP to take action and proceed to let her lawyer handle it.",
            "score": 632,
            "replies": [
                {
                    "author": "tequilitas",
                    "body": "The lawyer knows they already won.. She can go after every single person in that chain of information and will be compensated. Also the woman working at the clinic tanked her future, she will never be allowed to handle so much as a sign up sheet!",
                    "score": 648,
                    "replies": [
                        {
                            "author": "oceanarnia",
                            "body": "Man that daughter in law really thought shes all that. Giving up HIPAA information like its everyday's gossip. \n\n\nAll the time and effort and money going into her license to practice. Not anymore now.",
                            "score": 285,
                            "replies": [
                                {
                                    "author": "tequilitas",
                                    "body": "It's in Germany so it goes beyond Medical info. The data protection is taken pretty seriously from all angles and on top of that she already signed a document about compliance so the clinic can go after her for breaking compliance and demand the money they would pay OOP. I doubt she would get anything proper anymore, hell even express supermarkets tend to value privacy at some levels so she might be lucky if she gets to be a SAHW now.\n\nWhat shocks me the most is how nonchalant the boss was by admitting it came from his daughter in law. That is such a stupid admission, the OOP was the one that had to prove where it came from and he basically gave it up like kamelle..",
                                    "score": 459,
                                    "replies": [
                                        {
                                            "author": "AccountMitosis",
                                            "body": "Man really thought he wasn't gonna get got on a GDPR violation when *Google* couldn't even weasel its way out of a fine.",
                                            "score": 194,
                                            "replies": [
                                                {
                                                    "author": "tequilitas",
                                                    "body": "Going by the EA's age I would assume the boss is around the same or older.. He probably thought he could get away with it because he *apologized* to the little woman.....",
                                                    "score": 188,
                                                    "replies": [
                                                        {
                                                            "author": "AccountMitosis",
                                                            "body": "So true! \n\nThe GDPR being relatively new, as legislation goes, means that idiots with antiquated notions also don't realize that their notions about how horribly screwed they could end up are ALSO antiquated :) \n\nThe full weight of modernity is gonna hit this man like a freight train and I'm SO here for it.",
                                                            "score": 112,
                                                            "replies": [
                                                                {
                                                                    "author": "tequilitas",
                                                                    "body": "The most idiotic thing he did was having a conversation, admitting to who said what to whom, and on top of everything signing it. The stupidity is outstanding because she can go after the company and the boss himself.. such a mess just to gossip.\n\nLike, the only thing missing was a notary as a witness!!!!",
                                                                    "score": 94,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AccountMitosis",
                                                                            "body": "Everyone present signed the minutes... which presumably means *he signed them too.* He basically handed her an actual signed confession! PLUS witnesses!",
                                                                            "score": 58,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Mcgoobz3",
                                            "body": "When I worked in a law firm in Ireland, people always tried to make GDPR complaints when they heard their data was compromised. They knew the offending party would be fined but would drop their efforts when they learned they don’t get any of that money and it goes to the state. \n\nI wonder how it works in Germany and if the clinic was just going to pay her to keep her from making a big deal or not.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "tequilitas",
                                                    "body": "I think she can get something from them because it is a medical issue and she can move it into the work environment issue. This is also about abortion and depending where she is it's a reputation thing so that counts as well. \n\nThe clinic can go after the daughter in law because she broke compliance signed with them to recoup from whatever they end up paying regardless. If OOP can demonstrate this breach has affected her ability to work and so on it also plays a role. It's a bit like a snowball, but this is about this particular case.. there are others not so lucky.",
                                                    "score": 34,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ifeelnumb",
                                                    "body": "I'd still go after them even if the money goes to the state.  Consequences are consequences.  At least other countries than USA actually enforce them.  This weird dystopia I'm living in now feels like a fever dream.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Mcgoobz3",
                                                            "body": "I agree. The potential clients I spoke to tho just wanted to cash in at any opportunity. They thought they were going to hit the jackpot or something and nearly hung up the second I told them the money goes to the government and not them.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "brainsareoverrated27",
                                            "body": "The lawyer will probably think it is Christmas come early. Signed minutes with admission of guilt.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "AccountMitosis",
                                    "body": "HIPAA is one of the relatively few American regulations with some teeth. But the GDPR-- the regulation that covers this situation in Germany-- has *more* teeth. And that is a beautiful, beautiful thing.",
                                    "score": 70,
                                    "replies": []
                                },
                                {
                                    "author": "CapaxInfini",
                                    "body": "There was another BORU where a girl doing clinicals had leaked information about OP’s medical history and she was expelled so fast and black listed after that",
                                    "score": 99,
                                    "replies": [
                                        {
                                            "author": "chippy-alley",
                                            "body": "do you have a link or suggest a search phrase, please?",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "raphaellaskies",
                                                    "body": "It's the one where OOP was on Vyvanse and her sister's best friend (who worked for the clinic) was spreading the information around: [https://www.reddit.com/r/BestofRedditorUpdates/comments/1hmqqm4/aita\\_for\\_wanting\\_to\\_report\\_my\\_doctor\\_who\\_is\\_my/](https://www.reddit.com/r/BestofRedditorUpdates/comments/1hmqqm4/aita_for_wanting_to_report_my_doctor_who_is_my/)",
                                                    "score": 23,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "smaller-god",
                                    "body": "They are in Germany, there’s no HIPAA. It’s GDPR.",
                                    "score": 54,
                                    "replies": [
                                        {
                                            "author": "Kylie_Bug",
                                            "body": "Isn’t GDPR better? Have more teeth than HIPAA?",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "pandop42",
                                                    "body": "Very many teeth. Even though we aren't in the EU anymore (fuck Brexit), UK data protection law maps on to GDPR, & I've just done my annual training.   \nMany teeth. Many consisting of £ signs, or for the OP € signs. Both corporate and \\*personal\\* fines",
                                                    "score": 35,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "bobthemundane",
                                                    "body": "Not only does it have more teeth, it has a nice side arm, a buddy with a sniper rifle on the hill, and the ability to call in an air strike. \n\nAn individual cannot sue over HIPAA. There is no or little financial gain from the victim. Not so with GDPR.",
                                                    "score": 31,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Nice-Cat3727",
                                                    "body": "HIPAA is Samuel L Jackson staring at a mother fucker.\n\nGDPR is a pack of starving dogs staring at a man wearing a suit made out of steak",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "kyreannightblood",
                                    "body": "GDPR, actually, which isn’t limited to healthcare data and has way more teeth than HIPAA.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Viperbunny",
                                    "body": "People like that love to be the gatekeeper of information. They think they can say whatever they want because they hold \"all\" the secrets. When they find out there are consequences they are shocked. Probably because OOP is the first to call her on it.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GroovyYaYa",
                                    "body": "HIPAA is an American law.\n\nShe's in the EU and Germany specifically.   She's screwed every which way but loose.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Nice-Cat3727",
                                    "body": "It's even worse. It's Germany. HIPPA is Samuel L Jackson staring mother fuckingenly at you. The GDPR is a rapid pack of grizzly bears.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ginger_gorgon",
                                    "body": "It's not medical, but I also work in a field that handles sensitive information and I am SO CAREFUL when sharing work stories with friends to make sure I'm not about to say anything that would expose anyone/anything. I can't imagine casually saying to someone \"oh yeah, Jane had an abortion\".",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CautiousRice",
            "body": "So she never told anyone she had an abortion but a nosy colleague knows anyways and insists on telling everyone. This is terrifying.",
            "score": 248,
            "replies": [
                {
                    "author": "MakanLagiDud3",
                    "body": "But it was because someone rummaged through classified information which you know is illegal, violates lords knows what laws like Patient - Doctor Confidentiality.\n\nSo....it's actually worse than a nosy colleague. Glad they got fired.",
                    "score": 100,
                    "replies": [
                        {
                            "author": "DemonKing0524",
                            "body": "They didn't rummage through anything.  The boss's daughter in law worked at the clinic and physically saw op, and she told the boss and the assistant.",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "-oligodendrocyte-",
                                    "body": "I don't know about the EU, but do clinics usually only do one type of procedure? She could have gone for anything, so daughter-in-law would need to look up her info to find out why she visited.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "DemonKing0524",
                                            "body": "In the US abortion clinics only handle abortions. It's probably the same in the EU",
                                            "score": -13,
                                            "replies": [
                                                {
                                                    "author": "-oligodendrocyte-",
                                                    "body": "That's not true and it's actually anti-abortion propaganda. Clinics like Planned Parenthood do anything sexual health-related: STI screenings and treatment, pregnancy tests, some prenatal care, birth control, non-sexually transmitted infections (e.g., UTIs, yeast infections), hormone-related treatment (e.g., gender affirming, menopause), prostate exams, erectile treatment, and annual wellness exams. Patients who go to those clinics for non-abortion care are usually underserved (e.g., poor or uninsured, undocumented), live in an area where it's hard to find practitioners, or who need additional privacy protections (e.g., victims of incest or rape who don't want their family to find out).\n\nNow, some clinics might have a highly-secure location off-site that does surgical abortion care (this is only 40% of abortions). For example, I live in a state where clinics were bombed and shot up. The \"surgical center\" in my area was unmarked, walled, and you call ahead so they can open the gate to the parking lot. However, those are the exception and the one near me closed after Roe was overturned, I would expect that to be the case nationally.\n\nEdits for grammar.",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "DemonKing0524",
                                                            "body": "I'm talking about clinics that handle nothing but abortions. Not planned parenthood. They are totally different. And why would that be the case nationally when abortion is not illegall rationally? Plenty of states still support it.",
                                                            "score": -7,
                                                            "replies": [
                                                                {
                                                                    "author": "-oligodendrocyte-",
                                                                    "body": "I could have been more specific. I was speaking from a state where abortion rights were under attack for decades. My understanding is that, in states where it's still legal, there has historically been less of a bombing risk and abortion services are treated on-site rather than having a separate secured location. \n\nMy point remains, there just aren't enough abortion-only clinics for them to be considered the norm. Definitely not enough for your blanket statement to be accurate. \n\nThe anti-choice movement has messaged, intensely and for decades, that clinics only provide abortions, ergo, closing a clinic isn't denying anyone \"legitimate\" care. That kind of messaging also makes it easier for people to feel justified in protesting clinics, threatening women entering them, and bombing them. \n\nPersonally, I'm not a fan of that messaging, so I thought it worthwhile to offer a counterpoint to your statement.",
                                                                    "score": 10,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "CautiousRice",
                                                    "body": "Not in Bulgaria, absolutely no way to know why a person was in the hospital unless you were in the room or have access to the hospital's software.\n\nI'd guess it's like that everywhere in the EU.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "DemonKing0524",
                                                            "body": "An abortion clinic isn't a hospital typically",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "CautiousRice",
                                                                    "body": "Okay but why would anyone build a separate institution for it if we have hospitals where medical procedures can be done safely?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "linachar",
                                                    "body": "There are many countries in Europe, three of those that I know of don't have abortion clinics. You go either to a public or a private hospital/ clinic, that provides care. You can't know what someone is there for, unless you search their personal file. I haven't heard the term \"abortion clinic\" being used in general, everytime the topic of abortion rights comes up.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "linachar",
                                                    "body": "There are many countries in Europe, three of those that I know of don't have abortion clinics. You go either to a public or a private hospital/ clinic, that provides care. You can't know what someone is there for, unless you search their personal file. I haven't heard the term \"abortion clinic\" being used in general, everytime the topic of abortion rights comes up.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MiriaTheMinx",
            "body": "My ghasts are absolutely flabbered. Thank you for taking your time to translate and post this. I'm so glad there was some justice done because gawddamn.",
            "score": 915,
            "replies": [
                {
                    "author": "piezombi3",
                    "body": "I've never thought about it before, but how do we know that it's not your flabbers that have been ghasted.",
                    "score": 96,
                    "replies": [
                        {
                            "author": "Elesia",
                            "body": "I think this story has room for both. I never!",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "Turuial",
                            "body": "The consensus is that the first “flab” or “flabber” half of the word referred to the action of hitting or the thing being hit, and the second “gast” or “aghast” bit originally meant “shocked” or “horrified”.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Treefrog_Ninja",
                                    "body": "Really? So it's verb, adjective? Neither of those are nouns, so which one is, \"my?\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "lesterholtgroupie",
                            "body": "I’ve always said “My flabbers have just been ghasted.” Or “My flabbers are extremely ghasted.”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "2kids3kats",
                    "body": "Ain’t it the truth. Literal jaw drop.",
                    "score": 48,
                    "replies": []
                },
                {
                    "author": "filthy_kasual",
                    "body": "The face I made was comical. I'm still in awe someone would say that but also kind of not. Some people...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MiaOh",
            "body": "Those of you not in EU don’t understand how difficult it’s to fire people in Germany and Austria once they have passed their probation period. But the one this they don’t fuck around with is GDPR.\n\nThe boss was protecting his DIL and his gossipy ass.",
            "score": 146,
            "replies": [
                {
                    "author": "himewaridesu",
                    "body": "I think I’m confused why OOP got a termination package? That to me in the US, signifies she was fired?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Tattycakes",
                            "body": "They said severance package, so I think it’s more like she’s leaving because the place is shit, and she’s taking a hefty bonus with her",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "Traditional_Fun7712",
                                    "body": "Yes, and the money is in exchange of some kind of NDA or some kind of settlement to lessen the charges/fines against the company",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Advanced_Law3507",
            "body": "She said GDPR. That means this is in the EU. The boss was all the way fucked and so was the clinic.",
            "score": 396,
            "replies": [
                {
                    "author": "jdmillar86",
                    "body": "It being translated from German to English is also a bit of an indicator",
                    "score": 218,
                    "replies": [
                        {
                            "author": "Havannahanna",
                            "body": "Oh… the Clinic is in for a world of hurt. They will get audited by the „Landesdatenschutzbeauftragten“ (Head data protection of a German State).  Also health data is more protected then just name and address. \n\nThey will be put on a naughty list and be fined. Like 6 figures or potentially more if the audit reveals systematic shortcomings.",
                            "score": 46,
                            "replies": []
                        },
                        {
                            "author": "Advanced_Law3507",
                            "body": "Hah. Totally missed that. Fair point!",
                            "score": 77,
                            "replies": []
                        },
                        {
                            "author": "waterdevil19144",
                            "body": "Former Nazis hiding out in Argentina very pointedly have *not* entered the chat.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FruitIsTheBestFood",
                    "body": "It is translated from German to English from a German language sub, so most probably Germany.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "hermionecannotdraw",
                    "body": "Yup, the last place you should fuck around with data protection is in the EU. I work with sensitive data and have actual nightmares of stuff going wrong and anything accidentally leaking. No idea how a clinic worker can be this chill about sharing private medical data",
                    "score": 16,
                    "replies": [
                        {
                            "author": "brainsareoverrated27",
                            "body": "And probably the most sensitive data there is. A lot of people are judgemental about abortions.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Havannahanna",
                    "body": "I’m afraid GDPR would only apply to the clinic, not the boss. It’s a law regulating companies/institutions handling and processing data. So only the clinic would get the OMGWtF-fines (or prison sentences).\n\nThe boss did “only” gossip. He was not responsible for processing the data about OOPs health. There will be repercussions though due to employment laws which are also really strict in Germany. Probably slam dunk cases for every lawyer. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nonameswhere",
            "body": "Laws concerning these kinds of things seem to be rather strong in Germany. 👍",
            "score": 109,
            "replies": [
                {
                    "author": "Canis_Lyceus",
                    "body": "GDPR is a European Union Regulation. \nAnd if you mess with it, you’re major f*ed. Fines going up to 20.000.000 € or 4% of annual sales.",
                    "score": 112,
                    "replies": [
                        {
                            "author": "ScriptThat",
                            "body": ">Fines going up to 20.000.000 € or 4% of annual sales.\n\n€20 million, or 4% of annual revenue. **Whichever is larger**.\n\nThat last bit is important.",
                            "score": 158,
                            "replies": [
                                {
                                    "author": "palabradot",
                                    "body": "Oh my various deities!",
                                    "score": 28,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "UnderDubwood",
            "body": "This is why you don’t fuck with GDPR",
            "score": 101,
            "replies": []
        },
        {
            "author": "PrancingRedPony",
            "body": "Uhhhh, Germany! This is one of the few topics where punishment in Germany is actually useful and rightfully harsh. \n\nUnder German law the in-law working at the clinic could get barred from doing so in the future. You absolutely cannot break data protection in a medical environment without severe consequences, and being informed about this is part of the apprenticeship. What was she thinking?",
            "score": 62,
            "replies": []
        },
        {
            "author": "DamnitGravity",
            "body": "Assistant was so far out of line they'd gone fractal.",
            "score": 226,
            "replies": [
                {
                    "author": "sal101",
                    "body": "This would be an absolutely cold flair haha",
                    "score": 47,
                    "replies": []
                }
            ]
        },
        {
            "author": "rbaltimore",
            "body": "I hope she updates again when the civil and criminal litigation wrap up.\n\nFifteen years ago, I had an abortion. It was a termination for medical reasons (TFMR) - about halfway through my first pregnancy we discovered that my baby did not have kidneys (plus some other defects) so we induced labor knowing he’d be stillborn. Induction wasn’t hard, apparently my body was heading that way anyway.\n\nI’m generally pretty open about it because I think it’s a good learning opportunity because for most people, abortion is more of a concept to be argued about, and I have the ability to put a face - and a heartbreaking reality - on it. My son was very much wanted, and my life is divided into before we lost him and after. \n\n**But I live in a very blue state** (see username). If I were traveling in, let’s say, Alabama, and the topic of pregnancy loss came up, I *might* mention the stillbirth, but I sure as shit wouldn’t mention that we deliberately induced it. **I want to be in control of who knows and who doesn’t know**, and that would be hard to manage if someone at the hospital violated HIPAA and told people about it. And a TFMR is something most people (so far) understand. This was not a quality of life issue. This is a life issue. I can’t even fathom dealing with the stigma on non-TFMR abortion. I know that it’s less stigmatized in Europe but I still would want to be the arbiter of who knows and who doesn’t.\n\nAnd I’m glad OOP got a lawyer’s advice. An apology was all they planned to resolve the situation with? Not a single actual consequence? I would LOVE to see what Allison from AAM would say about all of this!!!",
            "score": 151,
            "replies": [
                {
                    "author": "ena_bear",
                    "body": "I am so sorry for your loss. \n\nI think Allison would have given a solid “what the fuck?!” But then laid out exactly how OOP handled it: immediately get a lawyer and do what the lawyer says. But I would love reading that post from her, too",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "GroovyYaYa",
                    "body": "Fellow American woman here - this story made me so uncomfortable because of the consequences for OP if she was in a deep red state right now. \n\nI'm so sorry for your loss.   \n\nPeople DON'T get that in so many cases, like yours or others, abortion is life saving healthcare.\n\nI'm reminded of what happened to Chrissy Teigen and John Legend - she didn't even \"get\" at first that what they did to save her life was an abortion.  I think they were brave in revealing and talking about it so openly.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CheerilyTerrified",
            "body": "At least the Germans don't fuck around when it comes to releasing private data. I don't think it would have had the same resolution, or as quickly in my country.\n\n\nI wonder if there has now been any further legal consequences.",
            "score": 46,
            "replies": [
                {
                    "author": "Traditional_Fun7712",
                    "body": "All of the EU is like this, it's GDPR regulation. The US citizens should be demanding the same protections.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CheerilyTerrified",
                            "body": "It's definitely not all of the EU. I'm in the EU, but my country is a lot more lax about this stuff than the Germans. ",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cursd818",
            "body": "The boss is going to also lose his job and likely be individually sued for his negligence. This isn't over for him, whatever he thinks.",
            "score": 93,
            "replies": []
        },
        {
            "author": "tacwombat",
            "body": ">\"Well, you sure know a lot about terminations.\" There was a brief, awkward silence before she immediately added, \"Because she had an abortion.\" \n\n\n\n>The assistant greeted me in tears and insisted that it \"wasn't meant like that.\"\n\n\n\nReally, Martha?? What exactly DID YOU MEAAAAAN???\n\nI'm glad OOP is taking everyone to the cleaners. Go get that justice, OOP!",
            "score": 40,
            "replies": [
                {
                    "author": "thefinalhex",
                    "body": "Yeah, what did she mean?",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "snarkaluff",
                    "body": "The first part about \"you sure know about terminations\" maybe \\*could\\* be considered a slip, but after the awkward silence she just had to follow up with \"because you had an abortion\" like that was a conscious decision to humiliate. It only became a slip up when she realized she was actually in trouble. \n\nIf she just left it after the first part, she mightve been able to play it off. When I first read that I thought they were talking about being fired from a past job or something. But no she just had to clarify that it was about an abortion",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "theycallmemomo",
            "body": "I'm absolutely stunned that the boss knew that the meeting was being recorded and knew that a lawyer was involved and still proceeded to show his entire ass anyway. OOP had a lot more restraint than I would've shown with that comment about not looking any different.",
            "score": 36,
            "replies": []
        },
        {
            "author": "Grail90210",
            "body": "So the boss was the one who initially blabbed the private information to the EA in the first place after his family member blabbed it to him, but he gets to keep his job, while OOP accepts a severance deal. Doesn’t seem like much of a win for OOP at all despite her spinning it that way.",
            "score": 259,
            "replies": [
                {
                    "author": "Great-Pain4378",
                    "body": "He egregiously violated gdpr and then admitted it in a legal document. He's proper fucked, it'll just take some time.",
                    "score": 334,
                    "replies": [
                        {
                            "author": "hannahranga",
                            "body": ">He egregiously violated gdpr \n\nDoes gpdr actually apply to someone who's heard/passing along gossip?",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "TheOuts1der",
                                    "body": "When it's PII....especially health PII.....especially in the EU, yes.",
                                    "score": 105,
                                    "replies": [
                                        {
                                            "author": "someoneelsewho",
                                            "body": "What is PII?",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "-WeepingWillow-",
                                                    "body": "Personally Identifiable Information",
                                                    "score": 34,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "throwawaymmhaha",
                                                    "body": "i'm guessing personal identifying information?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "hyungs00",
                                    "body": "It's not just 'gossip', it's private medical information - a GDPR violation is serious business in the EU and UK.",
                                    "score": 45,
                                    "replies": [
                                        {
                                            "author": "hannahranga",
                                            "body": "It was private medical information when the daughter in law shared it, my understanding of GPDR doesn't particularly apply to individuals unless they're part of the related organisation.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "hyungs00",
                                                    "body": "The daughter-in-law shared it with the boss (her father-in-law), putting the DIL in breach of GDPR. Her boss knowing the information was not in breach of GDPR itself, but he THEN shared it with the executive assistant, putting him in violation of GDPR as he had no lawful reason to process or further disclose it but did so anyway. The executive assistant, now in possession of the unlawfully obtained personal data, announces it to everyone in the meeting room, and by doing so, breaches GDPR again. It's not that knowing the info is unlawful, it's the act of spreading it without a legitimate business interest and explicit consent first. If the boss had merely heard the info in a personal context and done nothing with it, GDPR would not have applied to him directly.",
                                                    "score": 23,
                                                    "replies": [
                                                        {
                                                            "author": "hannahranga",
                                                            "body": "> but he THEN shared it with the executive assistant, putting him in violation of GDPR as he had no lawful reason to process or further disclose it but did so anyway. \n\nHe shared it with her as an individual tho",
                                                            "score": -15,
                                                            "replies": [
                                                                {
                                                                    "author": "hyungs00",
                                                                    "body": "That doesn't matter, it's still a breach. Courts have ruled that data protection responsibilities don’t disappear just because someone acts in an informal or personal way while still being connected to their role.",
                                                                    "score": 14,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "theycallmemomo",
                                                                    "body": "Why did he share it with anyone at all?",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hannahranga",
                                                                            "body": "Cos he's a raging dick, I'm not arguing the morals just impressed with how far GPDR goes.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "thefinalhex",
                                    "body": "Gossip is just a euphemism.  It is private information that is not to be shared.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Great-Pain4378",
                                    "body": "I work with sensitive data covered by gdpr in a role adjacent to my company's DPO, I've seen and compiled reports for less.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "NUNYABIX",
                                    "body": "Is it a legal loophole to share confidential information as long as you call it gossip?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "smallfluffyfox",
                            "body": "It makes me sooooo happy that she insisted on the meeting having recorded minutes and the boss went ahead and straight up admitted everything.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thesweed",
                    "body": "She did say things are still ongoing so maybe he will get what's coming for him.. hopefully",
                    "score": 74,
                    "replies": []
                },
                {
                    "author": "AccountMitosis",
                    "body": "The GDPR violation is gonna take time to process legally, but the boss is omegafucked, and the company along with him. Not even Google could weasel its way out of a GDPR fine, so the boss's little \"we only have one HR rep\" show is DEFINITELY not gonna escape.\n\nOOP's severance deal is just her making sure she's covered in the meantime. There's no way she could feasibly work at the company with the legal process ongoing, so she might as well get *paid* not to work there. She's also getting her severance money BEFORE the company gets hit with something that could potentially be financially ruinous.",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "SufficientMacaroon1",
                    "body": "I am not a data law expert, but unless i am mistaken, GDPR fines are paid to an official place, not to the victim.  Compensation for the victim is a different legal process.\n\n It sounds like they negotiated an end of contract, likely including extra severance as compensation. That would end her dealings with the company. That does not mean the company or the hospital are off the hook for the GDPR violation. \n\nGerman labour law is pretty strict when it comes to firing someone. Even for misbehaviour, only the worst cases actually allow for an imediate firing. In most cases, several warnings over no more than 2 years, for related issues, are required. I am not saying that this here was not a case that could justify a firing without warning, but the question is if the employer wants to do this, and risk the Boss filing a lawsuit against the firing (which he would be stupid not to, if he is without related warnings). \n\nIt is totally possible that the boss got consequences, but OOP would not get informed about them. \n\nOOP herself could have kept her job. Nothing in this post even hints towards the employer having a legitimate reason to let her go. The question is if she wants to. She can of course quit, but that leaves her with nothing but the job being gone. By making a mutual termination agreement, they can agree on a severance, paid leave till end of contract, etc.. Chances are she allows them to buy her out and settle/prevent the lawsuit for compensation",
                    "score": 47,
                    "replies": [
                        {
                            "author": "Havannahanna",
                            "body": "Both. The fines are paid to the state, but if the breach put you at a disadvantage, you can individually sue. Payout won’t be as astronomical as the fines, but still a few thousand bucks. In her case it might be even more",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SufficientMacaroon1",
                                    "body": ">The fines are paid to the state, but if the breach put you at a disadvantage, you can individually sue.\n\nExactely, that is what i said. The state fines and individual compensation are seperate processes",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NOSE_DOG",
                    "body": "It's REALLY hard to fire people in Germany, so most likely the severance deal is pretty comprehensive and good. Also sounds like the rest of the legal cases are more or less slam dunks, so she's going to be coasting along on the company's dime until those resolve.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "Flockwit",
                    "body": "While I certainly want to see the boss get justice, I don't think the outcome for her was too bad. It doesn't sound like she was entirely happy at her job anyway, and it sounds like she was getting a *very* nice payout.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "Skull_Bearer_",
                            "body": "With coworkers and bosses like this I doubt it was the first instance of something screwy.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IncompetentPolitican",
                    "body": "Its a good win for OOP. A German Company can not fire people just like that. Germany has, like all civilized countries some worker protection laws  stoping that. So the boss can only be fired if he fucked up often or in a very big way. But he is now known in the company as the guy who tells people private informaton about coworkers and employees. This can stop promotion, good tasks and gets people to look at you differently. And should our Data Protection Laws decide it, then he or the company are fucked. The fines are high for \"a little bit of gossip\". \n\nOOP on the other hand got money, got away from a boss who does not respect her privacy, gets money from the clinic. Enough to look for a job and take their time with it. That is the best they could get.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Kozeyekan_",
                    "body": "I would expect that the civil suit will be significantly aimed in his direction.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "justbreathe5678",
                    "body": "Boss' DIL just got fired I don't think it would be a pleasant environment to keep working for him",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Flimsy-Wolverine-663",
            "body": "All the trouble I go to, as a pharmacy technician, to never divulge confidential information, even to telling a man I couldn't discuss his 17 year old daughter's prescriptions with him, unless directed by the custodial parent; and someone working at an abortion clinic (!) thinks patient names are fair topics of gossip?!?!?",
            "score": 31,
            "replies": []
        },
        {
            "author": "GuaranteeThat810",
            "body": "What, and I cannot emphasize this enough, the fuck?",
            "score": 27,
            "replies": [
                {
                    "author": "enbycats",
                    "body": "this has me legit giggle :D\n\ni will use this phrase, thankyouverymuch",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GuaranteeThat810",
                            "body": "Haha use and enjoy! It’s a favourite for me",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "buttbologna",
            "body": "It was like the assistant was waiting for the punch line to hit with her coworkers.. \n\n “**GEDDIT, BECAUSE SHE HAD AN ABORTION** she experienced personal trauma and we should all laugh at my clever pun!”",
            "score": 26,
            "replies": [
                {
                    "author": "Amazing_Cranberry344",
                    "body": "I wish I could read German to read the comments",
                    "score": 8,
                    "replies": [
                        {
                            "author": "brainsareoverrated27",
                            "body": "Use DeepL.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pretty_Marzipan_555",
            "body": "I'm so impressed at the composure of OOP!",
            "score": 23,
            "replies": []
        },
        {
            "author": "violue",
            "body": "How the hell does that even come up? \"My co-worker Sophia said I was mothering her again.\" \"Oh, Sophia Bauer? I know her! She came in for an abortion!\"",
            "score": 22,
            "replies": [
                {
                    "author": "ecodrew",
                    "body": "You underestimate the power of gossipy asshats.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Terrible_Kiwi_776",
            "body": "*It wasn't meant like that.\"*\n\n\nDa fuq it was.",
            "score": 20,
            "replies": []
        },
        {
            "author": "NotThatValleyGirl",
            "body": "I love when idiots get hosed by the power of the law in BORU.\n\nReally would love to have been a fly on the wall when the in laws who worked at the clinic got completely hammered-- fired and blacklisted from the profession they likely invested years into learning.",
            "score": 20,
            "replies": []
        },
        {
            "author": "grumpy__g",
            "body": "I am surprised that nobody said „WTF“ in that moment.",
            "score": 15,
            "replies": [
                {
                    "author": "misselphaba",
                    "body": "I’m 98% sure if I had been in the room I would not have been able to stop the “What the fuck?!” From coming out of my mouth.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Half_Man1",
            "body": "TIL the EU does not fuck around with data privacy.\n\nGood. All the consequences were deserved!",
            "score": 10,
            "replies": []
        },
        {
            "author": "chillyhellion",
            "body": "Sounds like the assistant now knows a bit about terminations as well. ",
            "score": 10,
            "replies": []
        },
        {
            "author": "CapaxInfini",
            "body": "DIL is in deep shit, GDPR violations (Like HIPPA) are no joke like to the level of no longer able to be in the medical field\n\nEdit: corrected from hippa to gdpr",
            "score": 28,
            "replies": [
                {
                    "author": "not_notable",
                    "body": "This is in Germany. GDPR is the law there, and it is *much* more stringent than HIPAA.",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "pied_goose",
                    "body": "To be clear HIPPA covers only healthcare data, GDPR _any_ personal data.\n\nSo you could be in equally deep shit for disclosing any other kind of service done for OOP.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "IrradiantFuzzy",
                            "body": "HIPPA covers nothing, because it's HIPAA.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Acrobatic_Car_2878",
                                    "body": "That typo always makes me laugh because \"hippa\" is Finnish for a game of tag :'D",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JemimaAslana",
                    "body": "Not HIPAA. GDPR.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "ftjlster",
            "body": "Honestly surprised that OOP's ex boss wasn't also fired as he was the one gossiping about the employees under him sufficient to break privacy laws.",
            "score": 9,
            "replies": []
        },
        {
            "author": "limbodog",
            "body": "I'm glad to finally read one of these where the consequences are real",
            "score": 9,
            "replies": []
        },
        {
            "author": "mycatsitslikeppl",
            "body": "I hope OOP takes them all to the cleaners!",
            "score": 8,
            "replies": []
        },
        {
            "author": "paul_rudds_drag_race",
            "body": "I know this is the type of thing where people might chime in with the perfect thing that they would’ve said, but it’s hard to really know what one would say in that moment. It’s easy to be caught off guard by such a thing and know how to react in a work setting. Anyway, I’m glad the OP is getting out of there.",
            "score": 10,
            "replies": []
        },
        {
            "author": "NegScenePts",
            "body": "Scorched earth!  HELL YEAH!  :D",
            "score": 8,
            "replies": []
        },
        {
            "author": "TransportationClean2",
            "body": "Way to go OOP. There's a reason these laws exist, and this is a perfect case of how to handle it.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Monkeywrench08",
            "body": "Holy shit is all I can say... \n\n\nGlad OP got justice. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "crookedparadigm",
            "body": "Why is this marked as CONCLUDED when the end of the last update specifically says it's still ongoing?",
            "score": 8,
            "replies": [
                {
                    "author": "enbycats",
                    "body": "because the rest is DA against the company/the doctor/the SIL, the boss and the assistant. because the rest is official. the OOP got her money already with the severance package and the direct money from the doctor's office. \n\nthere might me still a situation where she will pursue a civil suit, but not very likely. \n\nso it might be very unlikely, that she will get any further informations, maybe via grapevine but not guranteed. \n\nfor OOP the story is over so far. the rest is official legal work, where she or her lawyer don't have any direct influence anymore.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ennuiandarson",
            "body": "WAIT. So the DIL told the BOSS WHO TOLD THE ASSISTANT. Every step of that is a nightmare on its own. And HE didn’t get penalized?!? \n\nI’m so angry.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Venusdewillendorf",
            "body": "What does “a protocol be taken” mean?",
            "score": 20,
            "replies": [
                {
                    "author": "Jonka0",
                    "body": "Protocol = Official notes  \nSo a written document that is available to all who participated (and sometimes others as well) and is an official account of what was said. Perfect for use in a law suit.",
                    "score": 54,
                    "replies": []
                },
                {
                    "author": "bakanisan",
                    "body": "It's a report summarising what was said/done in a meeting. It's just called a Protokoll in German so the translator might've missed the translation.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "soliraco",
                            "body": "But the translation of Protokoll in english is protocol, or am I missing something? Would minutes/ record be better?",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "bakanisan",
                                    "body": "Best to use *transcript* in this case.",
                                    "score": 37,
                                    "replies": []
                                },
                                {
                                    "author": "Pandahatbear",
                                    "body": "From the context of the post, yes I think minutes or transcript would be the better translation",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "soliraco",
                                            "body": "Okay thank you, I edited it :)",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Pandahatbear",
                                                    "body": "Thanks for finding and translating the post! It's a good one!",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "sliverfishfin",
                                    "body": "Protocol in English is closer to “policy”, for example “the assistant followed protocol and reported the illegal sharing of private information to the relevant authorities”",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "StreetofChimes",
                                    "body": "Isn't language grand? Even though words can literally translate, the meaning doesn't follow.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sufficient_Bag_4551",
                    "body": "This sounds like it's happening in Germany which has really strong labour laws. In HR matters there will be really strong procedures and documentation which needs to be followed, agreed and signed ",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "On_The_Blindside",
            "body": "This is absolutely ridiculous. What the fuck. I'm angry for her.",
            "score": 5,
            "replies": []
        },
        {
            "author": "kebb0",
            "body": "GDPR doesn’t fuck around",
            "score": 5,
            "replies": []
        },
        {
            "author": "mtngrl60",
            "body": "This boggles my mind. I used to work for an end in a large metropolitan area. I’m 65 now so this was a while back.\n\nMy boss was somebody who had done some pioneer work in the field of work canals. Was still teaching. Was literally pretty well known on both sides of the country.\n\nWe had in our office sports figures. Entertainers. Physicians. And of course, just regular every day folks.\n\nRegardless of who came in, my husband never knew. And this was 40 years ago. What happened in our office state in our office. And HIPAA was enacted in 1996. This was in the 80s.\n\nA patient’s privacy was to be protected at all costs. I’m not even because it was or was not a law. Because that’s simply professional and respectful.",
            "score": 5,
            "replies": []
        },
        {
            "author": "TheRangdoofArg",
            "body": "Yeah, GDPR doesn't play. In case anyone is confused a bit by how this started: a slightly clearer translation would be that she suggested they terminate the meeting and the assistant then made the 'joke'.\n\nThe OP used the word Abbruch for ending the meeting, which means to break off and can also be used to refer to breaking off a pregnancy, i.e. abortion.",
            "score": 5,
            "replies": []
        },
        {
            "author": "RightofUp",
            "body": "At first I thought the private information was something like “She got into a car wreck last weekend.”\n\nNope. Shit started at level INSANITY.",
            "score": 8,
            "replies": []
        },
        {
            "author": "ExquisiteGerbil",
            "body": "That’s messed up! That wasn’t just private information but private medical information of a particularly sensitive nature considering the political climate concerning abortion. OP could have had her career tanked or even been physically attacked if the wrong person found out",
            "score": 3,
            "replies": []
        },
        {
            "author": "minimalist_coach",
            "body": "My hubby used to do cybersecurity for a medical provider. In the US there are substantial fines and potential criminal penalties for leaks of medical information. \n\nIt’s just gross that not only did the employee share protected private medical information, but everyone who learned about it thought it was ok to share it further.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Free_Dome_Lover",
            "body": "In the US this could result in jail time, a 100k fine and being barred from ever working in healthcare again for the clinic employee who leaked the information.\n\nIt's insane to me that anyone would risk this just to spread some gossip. HIPPA violations don't fuck around.",
            "score": 5,
            "replies": [
                {
                    "author": "Skatingfan",
                    "body": "This was Germany, so from what I'm reading here, there will be severe consequences.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Free_Dome_Lover",
                            "body": "Yeah the US doesn't even have great privacy laws compared to the EU. I imagine the person in Germany may be facing some pretty hefty punishment.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jolly_Conflict",
            "body": "Hopefully there’s consequences for the assistant",
            "score": 9,
            "replies": []
        },
        {
            "author": "Snarkan_sas",
            "body": "I’m a bit shocked at how quickly action was taken!",
            "score": 3,
            "replies": []
        },
        {
            "author": "practicallydeformed",
            "body": "This is why I come here, the justice was so swift and ongoing. I hope we get more updates 🙏",
            "score": 3,
            "replies": []
        },
        {
            "author": "ben-hur-hur",
            "body": "Having worked with European teams as an American, GDPR regulations are no joke and not something you mess around with. Hope both ex-boss and ex-colleague got their comeuppance.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HawtPuffPuff",
            "body": "THIS! IS! JUSTICE!!!! AWOOOOOOOOOOO!!!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "PoppyHamentaschen",
            "body": "I am shocked. I was under the impression that Germany has so many laws and protocols for protecting employees, and the GDPR thing, that nobody would even begin to do the boneheaded things that OOP's boss and his assistant did. Yikes! I am really happy OOP got it sorted out, and I hope it doesn't affect any future employability.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mcindy28",
            "body": "Well done to OP and following through especially with way more than an apology!",
            "score": 3,
            "replies": []
        },
        {
            "author": "cerebral__flatulence",
            "body": "Smart decision to speak with a lawyer. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "SLAUGHTERGUTZ",
            "body": "Uhh, wait why tf is OP losing their job?? ",
            "score": 5,
            "replies": [
                {
                    "author": "EmykoEmyko",
                    "body": "They are parting ways and she’s getting a payout. This is a translation.",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "SufficientMacaroon1",
                    "body": "I think OOP wants to leave.\n\n She talks about severance. I strongly assume that she was offered an Aufhebungsvertrag, basicly a mutual end of employment contract. Likely, they offer her a big severance in order for them to seperate without further issues, like, without her potentially comming after them further.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "SLAUGHTERGUTZ",
                            "body": "That makes sense, ty ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yukinojou_bw",
                    "body": "I assume they don't want to work there anymore. I suspect that the severance is at least half a year's salary if not a full year, plus paid time off during the notice period. Depending on how long the employment lasted, that notice period in Germany can be up to three months (judging by OP's age - up to 7 months if you work somewhere for two decades!), plenty of time to find new employment somewhere without people who are so completely unworthy of trust.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "TiredUngulate",
                    "body": "Considering they are likely in a legal battle with the company, it is common for people to leave said company as working with them can be a conflict of interest",
                    "score": 11,
                    "replies": [
                        {
                            "author": "SLAUGHTERGUTZ",
                            "body": "That makes sense ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AccountMitosis",
                    "body": "She's involved in an ongoing, *extremely serious* legal case against the company. GDPR violations are no joke. There's no practical way she could continue to work there, so it's best to work out the severance now, BEFORE the company gets hit with financially ruinous consequences. \n\nThe severance is likely quite generous, because the company is probably well aware of how fucked they are and trying to limit the damage by giving her a reason to look down upon them with at least *some* mercy.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "uncle-noodle",
                    "body": "Dude, you want her to stay at that job? \n\nThe boss will still eventually get fired and is fucked, but it makes absolutely no sense for her to have any desire to remain in that job after what happened. Would you?\n\nOnce lawyers are brought in for a situation like this, it makes absolutely no sense to remain in the job. It’s why it’s abysmally stupid to stay in a job where you sued them successfully for sexual harassment. Doesn’t matter that you were a victim and should be protected. People are going to be fucking pissed with you.\n\nEdit: umm this goober I am replying to blocked me and accused me of getting angry with them. People are silly lmao",
                    "score": 5,
                    "replies": [
                        {
                            "author": "SLAUGHTERGUTZ",
                            "body": "Absolutely bizarre reaction to my post. Getting angry at me and accusing me of wanting her to stay there is fucking weird. \n\n\nWhere I'm from *termination* is synonymous with being fired. Go take a walk.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "BrotherMack",
                                    "body": "Goober.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "palabradot",
            "body": "Holy shit. Yeah I’d be going to my lawyer too if my boss said that to me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "firemeup18",
            "body": "There are just so many shitty people in this world. I’m sorry OP. And glad you are getting compensation.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdFew8858",
            "body": "I bet the assistant learnt a thing or two about termination herself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Underpaid23",
            "body": "Love her and her lawyer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ghostthroughdays",
            "body": "Good that she was standing up for herself. Assistant gossiped but boss was very unprofessional himself spreading this private information",
            "score": 2,
            "replies": []
        },
        {
            "author": "Malicious_blu3",
            "body": "This is a literal nightmare of mine. Holy shit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChickPeaEnthusiast",
            "body": "Me again with the dumb questions - why is OOP getting terminated?",
            "score": 2,
            "replies": [
                {
                    "author": "MyNameIsZealous",
                    "body": "To get a fat payday and not have to see anyone there she doesn't want to ever again.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "tagenero",
                    "body": "Termination of employment does not necessarily mean the OP was fired but is also the terminology used for when you quit. Ie: OP terminated her employment voluntarily. Can also use \"separated\" from the employer, I've seen both. Freaked Mt out the first time in left a job and it used the \"termination\" language.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "IAAA",
            "body": "I work with the GDPR every day.  This clinic and the place where this lady worked are COLOSSALLY SCREWED.  This is a MAJOR violation and things will not go well if the regulators decide to make an example of this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lemetellyousomething",
            "body": "Good for op for standing up for herself since not a single person was able to advocate for her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EnvironmentalAd2341",
            "body": "When I saw the original post was in German I knew op wouldn't let it go easily. Honestly,  good for her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Test_After",
            "body": "If Ratschlag is a town, I don't want to work there. ",
            "score": 4,
            "replies": [
                {
                    "author": "KestrelHath1",
                    "body": "It means advice.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Test_After",
                            "body": "That's a relief. Thanks. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IrradiantFuzzy",
            "body": "Good going, boss.  You managed to go from \"Assistant gets fired, OOP get a big check\" to \"You get fired too, and OOP now owns the company\" in one sentence.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AhBee1",
            "body": "If I had been in that meeting and heard the old bag pop off, I would have gone insane. What a horrible person through and through.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BookEnvironmental689",
            "body": "This will not be tolerated. No sir. Not at all. In fact I would go so far as to ask for an apology. That's right, as you can see I'm not messing around.",
            "score": 4,
            "replies": []
        },
        {
            "author": "HereForTheBoos1013",
            "body": "> I found out that the partner of the boss’s son actually works at the clinic where I had the procedure.\n\nHolyyyy crap.  I don't know the laws in Germany, but in the US, this is a massively big deal.  Like \"reasons HIPAA exists\" big deal, on par with leaking someone's HIV diagnosis.",
            "score": 2,
            "replies": [
                {
                    "author": "peachesnplumsmf",
                    "body": "It literally talks about how it's a massive GDPR violation. And honestly I'd say worse as whilst abortion isn't as politicised in most countries over here there's never a \"good,\" reason to out that.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "HereForTheBoos1013",
                            "body": "I saw that, but am unfamiliar with how the consequences go in Germany versus in the US, where I'm very well acquainted with HIPAA as a physician, so gasped at that.  Sorry to offend you.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "enbycats",
                                    "body": "let's just say, GDPR is at least 5 times stiffer than HIPAA - and not just with medical information, but with every personal information.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "HereForTheBoos1013",
                                            "body": "Then hooray for Germany!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "enbycats",
                                                    "body": "more hooray for EU and GB. there's a reason why the big tech's want to break up the EU. they hate the  GDPR. even google had to pay fines",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "peachesnplumsmf",
                                    "body": "You didn't offend me? Just assumed given most of us are familiar with HIPAA via existing on the Internet yous would be similarly aware of GDPR which unlike HIPAA also impacts the US and their companies on quite a big scale and is a key motivation behind why people such as Musk are slating European governments and countries.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "HereForTheBoos1013",
                                            "body": "Sorry; saw the downvote and your comment and figured I'd said something stupid.  But you are correct; I was unfamiliar with GDPR, and definitely had no idea it impacted us.\n\nI have noticed Musk attempting to play kingmaker with more than just our democracy, but I assumed it was because he was viewing the entire globe as a giant game of Warhammer for trolls, but it does make a lot more sense that they're trying to round up ALL the western democracies into supporting oligarchs.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "HereForTheBoos1013",
                                            "body": "Sorry; saw the downvote and your comment and figured I'd said something stupid.  But you are correct; I was unfamiliar with GDPR, and definitely had no idea it impacted us.\n\nI have noticed Musk attempting to play kingmaker with more than just our democracy, but I assumed it was because he was viewing the entire globe as a giant game of Warhammer for trolls, but it does make a lot more sense that they're trying to round up ALL the western democracies into supporting right wing oligarchs.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MakanLagiDud3",
            "body": ">Three days later, here’s where we stand: **The assistant received her third warning** \\- I don’t know where the first two came from. Today, **I received confirmation that she has to leave the company.** I think my boss would have preferred not to make this decision, but since the situation spread very quickly through the office grapevine, it seems to have influenced his decision.\n\nSo hold up, she was fired straight away or was warned first? Because if she was on her third warning, that means she's on thin ice but not fired yet. Understandable because well confidential information but why didn't she get fired straight? It feels redundant and tedious.",
            "score": 1,
            "replies": [
                {
                    "author": "Responsible_Judge007",
                    "body": "I don’t know where OOP lives but in my Country (Europe) the employment-law says: you need 2 written warnings. If you get the 3rd warning, you’re fired.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "UndercoverHouseplant",
                    "body": "People can't be fired willy-nilly in Europe, your employer has to have good reason and proof for doing so. This was the third warning in a \"three strikes and you're out\" kind of situation, where the employer had tallied up enough faults to fire the assistant.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Icy_Radio_9503",
                    "body": "The way I interpreted it was the EA had received prior warnings for other egregious behavior. After pressure from others in the company, the boss reluctantly gave her a third warning bc of the incident with OOP.  A third warning may mean that EA must be terminated.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Goidelica",
            "body": "There's actually an outsized number of posts from Germany here. Well done, she handled this like a pro. NTA. 10/10 would not mess with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BabyYodaX",
            "body": "Holy shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "kellyoccean",
            "body": "There are a lot of times when reddit is amazing!! This is one of them. Good for you and now maybe they can learn at their big age to shut the fuck up about things that aren't any of their business.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chronox2040",
            "body": "wtf she got severed from the company? Being the victim how in hell is that fairv",
            "score": 1,
            "replies": []
        },
        {
            "author": "Coollogin",
            "body": "What is going on at that clinic that someone who works there would recognize a patient as an employee of her FIL's company, and then relay that information to her FIL?",
            "score": 1,
            "replies": []
        },
        {
            "author": "bellapenne",
            "body": "I don’t believe the assistant slip up. How does ending a meeting lead to bringing up an abortion?",
            "score": 1,
            "replies": [
                {
                    "author": "Theres_a_Catch",
                    "body": "Because it upset the assistant so much she used any excuse to bring it up to shame her.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "notsam57",
            "body": "the boss’s son works at the clinic but it was the daughter-in-law that told him, and she was fired from the clinic?  and somehow recognized oop worked for his/her father’s company?  and the boss blurted it out to his assistant?",
            "score": -8,
            "replies": [
                {
                    "author": "WorthyJellyfish0Doom",
                    "body": "Boss's son's partner works there, not the son",
                    "score": 58,
                    "replies": []
                },
                {
                    "author": "Icy_Intern1364",
                    "body": "“the partner of the boss’s son actually works at the clinic”, not the boss’s son. Awkward phrasing, but it looks like she gossiped at a family event that the EA attended. Not sure how the daughter in law would recognise OP though unless she’s bringing clinic files to swap like Pokémon cards for this job’s employee record files with the EA.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "notsam57",
                            "body": "ahh, i missed the partner part",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HotBoxButDontSmoke",
                    "body": "Partner of the boss's son works at the clinic, hence daughter in law. I think she figured out the company because some medical forms require information on your employer.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "thereasonpeason",
                            "body": "I was wondering about how she knew, but this DOES remind me that on literally every patient intake form I've filled out in the US, they ask for employer and whatnot.  Not a stretch to think Germany might do the same.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CardoconAlmendras",
                    "body": "No, the daughter-in-law is the one that used to work there, recognized OOP and told the boss. Then the boss told the awful coworker. It’s a small office and the boss seems to have a “we’re family” approach (I hate this kind of places 🙃) so I’m not surprise that OOP and DIL know each others in a superficial way.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "HumanWithResources",
                    "body": "The partner of the boss's son works there. It's clearly written in the update. The assistant attends events at the boss's house and socialises with the family. It's not unreasonable to recognise someone from your father-in-law's office. You may not know their role or designation, but you can still know them by face, and the name would be in the patient file.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Sharu-bia",
                    "body": "It's his partner that worked at the clinic as explained here :\n\n\n\"After a thorough search online, I found out that the partner of the boss’s son actually works at the clinic where I had the procédure.\" ",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "WeeklyConversation8",
            "body": "How did the boss's son's partner at clinic know where OP works? I find that very strange.",
            "score": 0,
            "replies": [
                {
                    "author": "Literally_Taken",
                    "body": "Patient registration information probably included the patient’s employer.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WeeklyConversation8",
                            "body": "Why would the DIL be looking through her information? Even if she's the one who processes insurance, she doesn't have the right to tell an employer anyway about their employees. \n\n\nI don't know how it works in Germany, but are abortions covered by insurance? Don't they have universal healthcare, which unless I don't understand it, isn't provided by your employer? Do you have to disclose who your employer is?\n\n\nAlso if DIL is against abortions (given she blabbed makes me think she is) why is she working at a clinic that provides abortions?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "snarkaluff",
            "body": "Wait, why was OP \"terminated\"? Is that a nromal thing that happens when you sue a company?",
            "score": 0,
            "replies": [
                {
                    "author": "Megamedium",
                    "body": "The post is translated to English so it could just be that. But there also aren’t technically any inherent implications behind the word “terminated”, it just means end. \n\nThe company presumably had an employment agreement with OOP to work for them, but now obviously that won’t be happening so they have mutually terminated that agreement.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ScubaCC",
                    "body": "She’s probably uncomfortable continuing to work there and negotiated a nice severance.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "snarkaluff",
                            "body": "Yeah but that would be her leaving on her own. Termination means she was fired without a choice, I thought",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ScubaCC",
                                    "body": "No, termination just means the job is ending.  Voluntary or involuntary.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Myrandall",
            "body": "A settlement with the clinic in 6 days...?",
            "score": -13,
            "replies": [
                {
                    "author": "Canis_Lyceus",
                    "body": "Bc no one wants to mess with GDPR. It can get quite expensive, up to 20.000.000 € or 4% of annual sales (depending on what’s higher). \nIt even helps with solicitors via E-Mail or phone, when you don’t know from where they got your data. A simple GDPR threat and they will leave you alone.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "ReverieMetherlence",
                    "body": "It's a GDPR violation. Clinic quickly understood that they fucked up. You can't weasel yourself out of this.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "SufficientMacaroon1",
                    "body": "Where does it say that? The text only says the clinic was informed. Not that they settled",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Myrandall",
                            "body": "> the lead doctor seems to be aware of the risks. He apologized both over the phone and in writing, and **I’ll be receiving a nice compensation.**",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SufficientMacaroon1",
                                    "body": "Oh, sorry, i must have skipped over that part, thanks! \n\nTbh, it is still not very unrealistic. That sentence could just as well mean that she was promised \"a nice compensation\" that they are still in the process of negotiating. Or maybe the hospitals first offer was so good that OP just took it rather than keep negotiating. \n\nA GDPR violation is a big deal in germany. And here a hospital had a violation concerning an extremely sensitive matter. It is not at all unlikely that they reacted very quickly, and trew money at OOP to avoid this becomming public.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}