{
    "title": "AITAH for taking away the keys of our house from my husband's ex-wife?",
    "author": "Choice_Evidence1983",
    "subreddit": "BestofRedditorUpdates",
    "rank": 8,
    "score": 1969,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 97,
    "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1jdwkf5/aitah_for_taking_away_the_keys_of_our_house_from/",
    "id": "1jdwkf5",
    "selftext": "**I am NOT OOP, OOP is** u/Ethereal_Wife\n\n**Originally posted to r/AITAH**\n\n**AITAH for taking away the keys of our house from my husband's ex-wife?**\n\n**Trigger Warnings:** >!mental health struggles, mentions attempted kidnapping, invasion of privacy!<\n\n-------------\n\n[Original Post](https://www.reddit.com/r/AITAH/s/U0JLbc1mOO): **February 25, 2025**\n\nA couple of days ago, I came home from a work meeting and was unpleasantly surprised to find my husband's ex-wife wandering around the house, fresh out of the shower, with only a towel wrapped around her body. I felt absolutely hysterical, though I didn’t show it. She had the keys because her daughter (who is also my husband’s daughter) spends more time at our house than at hers, so she occasionally comes to \"visit\" her.\n\nThis time, I didn’t hold back. I demanded that she give me the keys and told her she wasn’t allowed to come over while I was not home. My husband was asleep in the bedroom and had no idea that his ex-wife was even in the house. When I asked my stepdaughter why her mother had stayed, she simply said that she wasn’t planning to leave until her dad woke up. My mind immediately interpreted that as an attempt at seduction.\n\nIn short, I took away the house keys and told her that it wasn’t necessary for her to come see her daughter on weekdays when my stepdaughter went to her house already on weekends. If she needed to come over for something important, she had to ask for permission. She called me crazy, but my husband backed me up, which was the only reason she eventually left without making a scene.\n\nToday, I started wondering if maybe I overreacted and handled things immaturely, but at the same time, I don’t want her around my 4-month-old baby when I’m not home.\n\nEDIT: to avoid more accusations, I checked the entire chronology of the cameras at home and my husband was sleeping with our baby all morning, he didn't even know she was home but he was angrier than me when he saw her and even insisted that we report her.\n\n**AITAH has no consensus bot, OOP was NTA**\n\n**Relevant Comments**\n\n**Does the ex-wife comes by the house that often for a shower or something else?** \n\n> **OOP:** She didn't usually come to the house much before, but lately she seems \"very concerned\" about being present in her daughter's life. And my stepdaughter wasn't that calm, in fact, she was the one who sent me a message saying that her mother was in home, although I never thought I would find her in a towel.\n\n+\n\n> According to my stepdaughter, she had come home from work to check on her and told she was going to take a shower without any other explanation. I checked some cameras and my husband had been taking care of and sleeping with our baby all morning, he didn't even notice she was home.\n\n**Commenter 2:** Why did she have keys in the first place? And how old is the daughter?\n\nBigger question is why was the husband sleep and she was showering? Sounds suspect. Can't help but think you arrived after their activities...\n\n> **OOP:** She always had the keys in case of an emergency while we were traveling. My stepdaughter is 17 years old. And the last thing, my husband had spent the night awake at work, so he slept all day. Although I also thought like you at first, I immediately checked the cameras I have in some areas of the house to monitor my baby (including in the bedrooms)\n\n**Commenter 3:** NTA. You didn’t overreact but I would be suspicious of your husband. Might want to keep an eye on him.\n\n> **OOP:** I understand that concern, but my husband despises his ex-wife enough to the point that he hasn't reported her for the sake of their daughter. And anyway, I have some cameras in the house that I check whenever she comes over.\n\n**Was the house the husband and ex's at some point?**\n\n> **OOP:** Hi, yes. The house belonged to both of them before they divorced, although legally it always belonged only to my husband, but she lived with him.\n\n**OOP clarifies the details on how she met her husband. Was it during the time when her husband was married to the ex?**\n\n> **OOP:** No, I met him when they had been divorced for about 11 years. But she did live there during their marriage.\n\n**OOP on her husband's custody battle with his ex over their daughter and if the ex is dangerous to the daughter**\n\n> **OOP:** Before you judge, calmly ask for explanations. She and my husband had a legal battle for custody because she wanted to move to another state and wanted to take my stepdaughter without my husband's consent. It has been a long conflict because she literally almost kidnapped their daughter, and if it weren't for me acting as a mediator on occasions, he would have already sued her for it.\n\n+\n\n> She is not abusive, she wouldn't even try to be 'cause my stepdaughter lives with us most of the time and we would notice immediately if something happened with her. Now she has no intentions of taking her anywhere, of course, but that's why I spoke in the past tense all the time.\n\n&nbsp;\n\n[Update](https://www.reddit.com/r/AITAH/s/WP1zAYCcw8): **March 11, 2025 (two weeks later)**\n\nHi, it’s me! The woman who found her husband's ex-wife in her house wearing a towel. I've seen that things have gotten pretty out of control (to the point where it's spread all over the internet), so I'm here to clear some things up and give some updates.\n\nFirst of all, we’ve changed all the locks, and although my stepdaughter has her own key, she’s not going to risk losing her father’s trust after the serious talk they had.\n\nAfter my husband started the process for a restraining order, his ex-wife’s sister reached out to us. She told us that the ex-wife was feeling empty and threatened because of me. I’ve been living with my husband in this house for three years, and she had never done anything like this before, so it seemed extremely strange to me that she would pull this kind of stunt right after I gave birth to my son.\n\nAnyway, my husband’s ex-sister-in-law assured us that she was going to receive psychological treatment and that we could move forward with the restraining order. She just asked us to understand that the ex-wife seemed to be falling into some kind of depression that was preventing her from thinking clearly.\n\nAs for why I feel so bad and why I haven’t reacted more aggressively, I have an explanation: Since giving birth a few months ago, I’ve felt slow, dumb, and a bit confused about everything. I never had serious trouble defending myself in english before, but now I do, and my emotions are all over the place, leaving me feeling distressed in any dramatic situation.\n\nTo wrap things up, I’d like to clarify a few points:\n\n1. No, my husband has not cheated on me with the woman he’s been having issues with for 11 years. I checked the security cameras, and he was asleep next to our child during the hour his ex-wife was showering downstairs. That bathroom is pretty far from the bedroom.\n\n2. My stepdaughter was barely involved in her mother’s plan. In fact, she was the one who alerted me that her mom was in the house and that she had no idea why. Normally, her mom would let her know before visiting, and only if my husband wasn’t home.\n\n3. Yes, that woman only did it to get under my skin and make herself feel better. Spoiler: she won’t be coming near my family again.\n\nIn any case, thank you for the support and all the advice. I’m glad to know that there are still understanding people who have stood by me in a moment when my emotions faltered and made me doubt myself.\n\n**Top Comments**\n\n**Commenter 1:** My guess is the birth of your son pushed her over. Until that point. She thought she had the upper hand because she and your husband had the bond of a shared child. In her mind, she was still the primary relationship and you were temporary. Now, you have the ring AND a child and that blew up her fantasy.\n\nGo forward with the restraining order. Her mental health is on her to manage and she has her own relatives to support her through that.\n\n**Commenter 2:** NTA. That is absolutely a violation of privacy and scary! Shes being a complete creep and needs to be put in her place aka out of the picture.\n\n**Commenter 3:** I remember this post, glad you changed the locks.\n\nAlthough it’s sad that the ex is having mental health struggles you are not obligated to deal with her issues and need to follow through on the restraining order to avoid any potential harm to your family and new baby, remember this women may not be thinking clearly so again not worth the risk.\n\n&nbsp;\n\n**DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n**THIS IS A REPOST SUB - I AM NOT OOP**",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CatmoCatmo",
            "body": "I followed this one in real time. I couldn’t believe that she said this comment:\n>so it seemed extremely strange to me that she would pull this kind of stunt right after I gave birth to my son.\n\nMany people on the OOP (and the update) pointed out that the birth of her son was 100% the reason why the ex suddenly went all fatal attraction minus the bunny on the stove part. So for her to still be baffled was…well…kind of baffling. \n\nI believe that the ex had been holding onto the false sense of superiority +/- hope that they would get back together, for the past 11 years.  The ex believed that she was always in a superior position vs. OOP, because regardless of their marriage, the ex was still the mother of his child. She thought their “bond” was different and she would always be more important than OOP. \n\nBut then OOP had to go ahead and burst the ex’s superiority bubble and gave a baby. Now, she not only is also a mother of his child, but she alone possesses a ring on her finger.  Now, whether the ex actually wanted to get OOP’s husband back in her arms because she was still truly in love with him, or whether her attempting to seduce him was solely to elevate her “status” as being the most important woman in his life, I’m not sure. Could go either way. \n\nRegardless, this woman is insane and I’m glad her family is getting her professional help. It’s pretty bad when even her own daughter was like, what the fuck mom?!? And alerted OOP to the ex’s unwanted and freshly showered presence in her home.  \n\nAnd just so we’re all clear. You will never be the asshole for taking steps to ensure that anyone who does NOT live in your home, cannot just secretly waltz in unannounced, take a shower, and loiter about in a towel to try to seduce your SO.  You don’t need to ask.  The answer will always be NTA.",
            "score": 494,
            "replies": [
                {
                    "author": "imjustalilbot",
                    "body": "NGL but I'm one of those who wouldn't see this coming at all. Color me baffled as well. I genuinely don't understand how the ex-wife thought she still had a shot at the spouse, 11 years and another marriage later. What bubble do these people live in? And even if it went that far, I don't understand how the arrival of the baby catalysed into a poorly-thought out seduction/attempt to frame the spouse for infidelity, rather than being a wake-up call to finally move on with her fucking life... OP handled things with so much more grace than the ex-wife deserved, this is appalling behavior.",
                    "score": 126,
                    "replies": [
                        {
                            "author": "Altril2010",
                            "body": "Exes can be strange. When my mom started dating my dad his first ex-wife offered to go get drunk and tell my mom all the ways she could please him. His second ex-wife showed up to my oldest sister’s 21st birthday brandishing a handgun at my mom. Guess my dad finally got it right with my mom because they are celebrating 40 years married soon.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Live_Angle4621",
                    "body": "I don’t know if she was planning on seducing him just because she took a shower. Assert power sure. But the daugher and baby were in the house too ",
                    "score": 37,
                    "replies": [
                        {
                            "author": "_PrincessOats",
                            "body": "Babies are notorious for tattling on cheaters.",
                            "score": 32,
                            "replies": []
                        },
                        {
                            "author": "FeNeac",
                            "body": "Well, she at least wanted the misunderstanding, because she was walking with just a towel",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rose249",
                    "body": "Well she's also got post baby brain as well as the confusion of a generally normal person applying normal person logic to someone irrational, so I can more than forgive some confusion.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MissSweetMurderer",
                    "body": "The fact the OOP had a son can also be a factor for her losing. We all know how people get over boys (the whole boy mom thing😒). I mean, doing what she did and having that type of misogynistic mindset often goes hand in hand",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lesterholtgroupie",
            "body": "It’s a miracle that in 11 years she didn’t spiral sooner.",
            "score": 1138,
            "replies": [
                {
                    "author": "phyrsis",
                    "body": "It's the new baby.",
                    "score": 1196,
                    "replies": [
                        {
                            "author": "Murky_Translator2295",
                            "body": "Happened to my neighbours too. He'd had a son with his ex, and she did everything possible to stop him from being in his son's life. Neighbour wife had two daughters with her ex, he was present in their lives. Neighbours had a daughter together - nothing from his ex. As soon as neighbours had a son, ex flipped her lid and make **everything** difficult for them. They ended up back in court for child support, but he was able to prove he had paid consistently with no access to his child, so the court ended up reducing his payment (I think they'd worked the original number out between themselves, but the court took into account his two new children) and forced 50/50 custody. So they went through the wringer for about 18 months, but at the end it worked out for them and his ex shot herself in the foot.",
                            "score": 228,
                            "replies": []
                        },
                        {
                            "author": "Wooden_Television701",
                            "body": "Maybe she feels replaced and like her husband is playing house with a stranger and taking her place",
                            "score": 272,
                            "replies": [
                                {
                                    "author": "perpetuallyxhausted",
                                    "body": "Yeah that one commentor had it right. The ex thought she was still all that bc she'd given him a kid. But now OOP has the ring, the house AND has given him a new baby so she came to try and mark her territory and stir up some shit in OOPs marriage. No way she knew that OOP would have video evidence of her husband staying faithful and probably thought in the future she could tease that they'd slept together.",
                                    "score": 141,
                                    "replies": []
                                },
                                {
                                    "author": "OldManFire11",
                                    "body": "She's not being replaced, she **has** been replaced. That's what happens when someone remarries after a divorce. She just couldn't accept that her ex has moved on.",
                                    "score": 65,
                                    "replies": [
                                        {
                                            "author": "waterdevil19144",
                                            "body": "She was replaced as a wife, but she'll remain her daughter's mother (unless she really, really screws up and makes the daughter go NC).",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Turuial",
                                    "body": "I wonder if it being a boy, on top of everything else, might have been what prompted the ex-wife to begin to spiral.",
                                    "score": 125,
                                    "replies": [
                                        {
                                            "author": "Creepy_Addict",
                                            "body": "This could be possible. Some women believe men want sons, so the woman who provides a son is \"top dog\". For 3 years, she still thought she was top dog, because she had his child, when OOP not only gave him a child, she gave him a boy child.\n\nSome people still don't understand how babies genders are determined.\n\nEdit typo",
                                            "score": 123,
                                            "replies": [
                                                {
                                                    "author": "Reluctantagave",
                                                    "body": "That whole carrying on the family name mess plays a lot into some people too. Maybe she felt like she had to assert dominance or something. Whatever it was, it’s messed up!",
                                                    "score": 58,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Rubychan228",
                                                    "body": "Additionally, daughter is 17. Depending on where they live, she's probably almost an adult, meaning custody/visitation/child support ends in as little as a few months.\n\nSo now, just as her last legal tether to him is about to be severed (AND she's possibly going to become an empty-nester soon), he has a new (male) baby.",
                                                    "score": 31,
                                                    "replies": [
                                                        {
                                                            "author": "Creepy_Addict",
                                                            "body": "This is also a possibility.",
                                                            "score": 9,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "hellbabe222",
                                                    "body": ">Some women believe me want sons \n\nThe thousands of years of men preferring male babies over female babies to the point of exterminating female babies at birth may have contributed to some women believing this.",
                                                    "score": 60,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Apprehensive-Gas4485",
                                            "body": "That, and also the fact that the child she shared with her ex is a year or less away from adulthood. She's in the home stretch on her way to mommy retirement the same year that her ex and his new wife are hitting the starting line? Yeah, that stings. ",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "DeviceMotor3938",
                                            "body": "I didn’t think the gender matters. The baby is irrevocable proof that her ex has moved on. Also, her daughter is 17, probably looking at colleges and now the ex is taking stock of her life and seeing what little she has.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "hellbabe222",
                                    "body": "I just wanted to point out that the exes had been divorced for 11 years by the time OP came on the scene.",
                                    "score": 55,
                                    "replies": [
                                        {
                                            "author": "RedShirtBrowncoat",
                                            "body": "When my partner and I had first started dating, she'd been broken up with her ex for nearly a decade at that point. No marriage, but they have 2 kids together. We accidentally ran into him early in our relationship, upon which he threatened to kill me the first time he met me, and afterwards tried to spread horrible lies about me to his kids, telling them that I was going to hurt them (I never have hurt a child, especially in the way he suggested I was going to, and never would). He seems to think that if he runs off any men in my partner's life, she'll come crawling back to him. My point being, delusional exes don't just stop being delusional, even if it's been a long time.",
                                            "score": 49,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HeQiulin",
                            "body": "And depending on which culture they belong to, a son could be viewed (especially by grandparents) as the carrier of the family name. I absolutely disagree with this sentiment of course, but the ex wife could be spiralling due to this as well",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Fine_Ad_1149",
                            "body": "Don't forget that the previous child, the one that gave the ex some sort of power (in her mind, however little) is about to turn 18.  So poof - that leverage evaporates with the daughter coming of age.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Accomplished_Yam590",
                            "body": "Yep. That seems to be a huge trigger for people like the ex-wife.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TurnipWorldly9437",
                    "body": "People like this need to WIN. It's not about what's best for the child or what makes sense, they count every interaction as a win or lose.\n\n\nAs long as there was no new baby, she \"won\" by being \"inevitably\" in the husband's life and having a child with him, even when nobody wanted her there (seemingly not even her daughter). \n\n\nNow that he has a child (=permanent ties) with OOP, that's not enough anymore.\n\n\nUnfortunately, I know someone like that...",
                    "score": 110,
                    "replies": [
                        {
                            "author": "MadamKitsune",
                            "body": ">People like this need to WIN. It's not about what's best for the child or what makes sense, they count every interaction as a win or lose.\n\nLike one of my in-laws. They are the second spouse but go so far out of their way to try and make the kids (and now the grandkids) prefer them to the first spouse and then gets pissy and snarky when the kids and grandkids still love their bio-parent/grandparent more.\n\nThe first spouse doesn't give a crap about the second spouse and wouldn't want the ex back even if they came wrapped in gold, which makes the whole thing even more ridiculous.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dajur1",
                    "body": "It's either 1. She kept thinking that the ex-husband's relationship would crash and burn. or 2. She would get into her own relationship and it wouldn't be a problem anymore. Neither happened and she couldn't take it anymore and wanted to cause drama.",
                    "score": 118,
                    "replies": [
                        {
                            "author": "lesterholtgroupie",
                            "body": "I think it likely a little of both- “he could never do better than me” combined with loneliness. She doesn’t actually want him, they don’t get along. She just wants *someone* to want her. Even if it means creating an awful situation for her own daughter.",
                            "score": 81,
                            "replies": [
                                {
                                    "author": "LittleMsSavoirFaire",
                                    "body": "He replaced her as a wife, that's fine, she doesn't like him. And the new wife doesn't try to parent her daughter, so also fine. \n\n\nBut now her replacement is *a mother* and the *mother of his child* which was previously her exclusive titles. \n\n\nPlus OOP is probably is younger ",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "everydaycrises",
                                            "body": "There's also that the daughter is 17, so she'll possibly be moving out for college soon, she's nearly an adult - which means there'll probably be even less need for ex wife and husband to communicate. \n\n\nOOP said she has had mediate and there has been drama between them in the past, but that's still attention the ex is getting.",
                                            "score": 14,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "xvasta",
                            "body": "Or 3. Perimenopause hormones messing with her brain. She has a 17-year-old daughter, so, even though we're on Reddit, let's assume the woman is in her late 30s at least.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AccomplishdAccomplce",
                    "body": "Which I feel like substantiates the idea it was the birth of the new child that fractured her",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "hellbabe222",
                    "body": "I'm a mom to a 17 year old about to head off to university. There's a lot of emotions tied to that. I'm married with an amazing support system. My husband and I are dealing with our emotions as a team. \n\nThe ex-wife is watching her ex start over from scratch with a new baby and new wife. That's gotta be a lot for her to deal with. I'm glad she has her sister who seems to now be on top of getting her some much needed counseling.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Deeppurp",
                    "body": "This kind of spiral may be why the husband has majority custody of his daughter for a minimum of 3 years.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "beachpellini",
            "body": "The baby coming along solidified that she was never getting him back... so she needed to try and prove that she still ruled the roost.\n\nSo much for that.",
            "score": 116,
            "replies": []
        },
        {
            "author": "00Lisa00",
            "body": "Daughter is close to 18 so ex is losing her contact with the husband.",
            "score": 81,
            "replies": []
        },
        {
            "author": "peter095837",
            "body": "Some people scare me. And husband's ex-wife are the kind of people to why I have trust issues with some people. Fucking humans can be wild out there.",
            "score": 209,
            "replies": [
                {
                    "author": "WielderOfAphorisms",
                    "body": "I can confirm that too many people are completely off their rockers. \n\nSure, not all, but enough to make the policy that trust is earned and not freely given.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "Trouble_Walkin",
                            "body": "With all the centuries of violent human history, it boggles my mind that most peoples' default is set on Automatic Trust. ",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Consistent-Primary41",
                    "body": "It's such an unusual case, though. Really the exception to the rule, not the rule to live by.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "rosemwelch",
                            "body": "I think it is considerably more common than you might think.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WeeklyConversation8",
                    "body": "I agree.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnooWords4839",
            "body": "OOP having a child, set the ex for the spiral. Ex thought she still had a chance to get back with ex.\n\nOOP needs a security system and a restraining order!",
            "score": 72,
            "replies": [
                {
                    "author": "Dreamsnaps19",
                    "body": "They’re not granting a restraining order on a woman who entered a home to visit her child with a key that she was given. \n\nThey won’t even hand out restraining orders on people who beat up, sexually assault, and threaten their former partners. Let alone when someone has not actually done anything harmful.\n\nHaving said that. This behavior seems like a warning sign of someone seriously unhinged and I’d worry about the baby’s safety. So cameras and whatever else it takes to keep the family safe.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "AlternativeMinute289",
            "body": "> She is not abusive, she wouldn't even try to be 'cause my stepdaughter lives with us most of the time and we would notice immediately if something happened with her.\n\n\nSpeaking as a child of verbally/emotionally abusive parents.... No you wouldn't. ",
            "score": 48,
            "replies": [
                {
                    "author": "Dingo_Princess",
                    "body": "Yeah the person who tried to kidnap a child from their other parent is certainly not abusive. /s\n\nIdk how she typed that out seriously.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "twoweeeeks",
                            "body": "OOP is a bit naive.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PupperoniPoodle",
                    "body": "The 17 year old daughter only had enough gumption to text her stepmom about the naked mom in the house. She didn't question any of her mom's odd behavior, didn't even just go get her dad who is in the same house. \n\n\nI'm not blaming the daughter for that, I'm saying that shows that she doesn't feel totally safe around or about her mother. Either her mother has behaved oddly enough often enough for this to not stand out, or she's afraid of her mother and needs someone to stand up to her. (Good job there, OOP!)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kistner",
            "body": "OK, question here, can you get a restraining order for this situation?  I mean she was in their house, with keys they had given her, visiting (in an unusual way) with her daughter.  I don't know a lot about restraining orders other than what I've seen on TV or read on reddit but I thought someone had to be threatened in some way.  \nNot trying to stir the pot, genuinely asking.",
            "score": 58,
            "replies": [
                {
                    "author": "17HappyWombats",
                    "body": "As with many civil legal actions, you can always ask. You might not get very far into the process.\n\nBut with the ex-wife being in some kind of psychiatric treatment the restraining order is likely to be given more easily. Her reaction to the cops talking to her would have been really important. She may have just consented when the prospect was first mentioned.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "meepmarpalarp",
                    "body": "That was my question too. I’ve mostly heard stories about how it can be difficult to get them.\n\nAs you said, ex-wife had keys and her daughter was there. In addition, she left “without making a scene,” hasn’t tried to come back, and hasn’t contacted them at all.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "mocha_lattes_",
                    "body": "Will depend on the court system and a the judge. Some might toss it but others might let it go through.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "PeppermintEvilButler",
                    "body": "She entered into the house without permission, took a shower and was walking around in a towel while the home owner had no clue and was unconscious. Yeah I would say they have at least a case for a temporary one pending a court visit. Not to mention it's on film.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "GloomyWorldliness796",
                            "body": "They gave her keys",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Everyonecallsmenice",
                                    "body": "In the US legal system giving someone a key is not authorization to enter your home at any time. Entering without permission is still a crime. \n\nI would imagine that remains the prescident in most legal systems.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "fuknthrowaway1",
            "body": "Stuff like this is why my mother took away the a hide-a-key us kids used and instead left keys with all the neighbors..\n\n  \nWe came home early one summer day to drop off groceries to find my father, wearing nothing but a pair of shorts, sitting in her La-Z-Boy, drinking her beer, with the TV tuned to a baseball game.\n\n  \nThey'd been divorced six years at that point.\n\n  \nHis excuse was that he'd stopped by to see if we wanted to go see a movie, and, since we weren't home, he'd used the hidden key to let himself in to wait. He hadn't been there long or anything, he said.\n\n  \nExcept he'd finished five beers.\n\n  \nIn one of the wisest moves my father ever made he shut up and made his way quickly towards the door when Mom started counting down from ten.\n\n  \nI'm not entirely sure, but he probably knew she'd begun packing a .38 in her purse.",
            "score": 13,
            "replies": []
        },
        {
            "author": "mochiimin",
            "body": "I was worried the attempted kidnapping mention in the triggers was gonna be of the baby",
            "score": 12,
            "replies": []
        },
        {
            "author": "justathoughtfromme",
            "body": "The number of folks who were reaching for ANY reason to blame the husband and disregarding the OOP's explanations that he was asleep with their child is pretty telling.  They need to check their own biases and projections.  They probably also need to get offline for a bit.",
            "score": 10,
            "replies": [
                {
                    "author": "PupperoniPoodle",
                    "body": "Right?? I'm even kind of upset at OOP for saying she thought that way at first, too. Why doesn't she trust her husband enough around the ex she knows he despises? \n\n\nIf my husband's ex did something shady, she is going to be the first and only one at fault in my brain, until given very strong proof otherwise. I wouldn't trust a thing she said about or against my husband, yes even if she were to be walking naked around our house.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheFluffiestRedditor",
            "body": "\\> but my husband despises his ex-wife enough to the point that he hasn't reported her for the sake of their daughter\n\nCan someone help me make sense of this?  'cause I'm not getting this.",
            "score": 14,
            "replies": [
                {
                    "author": "lalajia",
                    "body": "he hates her so much he wants to report her to police, its only for his daughters sake that he hasnt gone that far yet.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "TheFluffiestRedditor",
                            "body": "Oh right, gotcha. Thank you. It mages sense now.  Stupid lysdexia.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Mean_Environment4856",
                                    "body": "Na, it just wasn't very clearly written.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "PrancingRedPony",
                                    "body": "It's not your dyslexia. I don't have that, and I still struggled. That sentence is very confusing. So it's not you.\n\nThank you for asking, that way I didn't have to.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ActualGvmtName",
                    "body": "That the ONLY reason he hasn't reported her is for the sake of their daughter.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "KikiHou",
            "body": "I sense an upcoming Dateline episode... Glad the ex-wife seems to have some close, sane, family.",
            "score": 8,
            "replies": [
                {
                    "author": "tacwombat",
                    "body": "The sane family members give me hope that this won't happen again. But it wouldn't hurt to change the locks and add security cameras.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DrSocialDeterminants",
            "body": "I can imagine how scary this must have been but .... like I really got ex wife gets well but it's still not an excuse.",
            "score": 19,
            "replies": [
                {
                    "author": "GeneralPhilosophy691",
                    "body": "Assuming the ex-SIL is telling the truth and not just covering for her sister.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "TyrconnellFL",
                    "body": "I know what you mean, and yes, but… I, too, feel threatened by almost-naked women wearing towels. Especially when they’re recently washed!",
                    "score": -20,
                    "replies": []
                }
            ]
        },
        {
            "author": "SmartQuokka",
            "body": "If daughter has the new key then her mom can steal it from her or surreptitiously make a copy. I would not give her a key. At least get an electronic deadbolt with a combination so she can enter without having a key that can be stolen/duplicated.",
            "score": 18,
            "replies": [
                {
                    "author": "17HappyWombats",
                    "body": "It's very difficult to get a lock that only works for the chosen person. Codes can be shared, keys can be borrowed, with phone apps the phone can be borrowed too. Or the chosen person can be persuaded to open the door.\n\nFingerprint locks are great but generally suck when people have wet hands. Or dirty hands. This is most apparently when it's pissing down, you get a flat tyre, you finally get home and the front door won't open and you are really not in the mood for this shit right now. Ahem.\n\n(I work for a company that makes burglar alarms. We have lots of options for locking/opening doors. Employees get to test them)",
                    "score": 21,
                    "replies": [
                        {
                            "author": "SmartQuokka",
                            "body": "Yes daughter can share the code, however it can't be stolen from her keychain and duplicated.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sunburnedaz",
                    "body": "Fingerprint reader lock is perfect for this case.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "smlpkg1966",
            "body": "A restraining order for what?  She didn’t break in. She didn’t damage anything. She didn’t injure anyone.  They don’t give out restraining orders just because you don’t like someone.",
            "score": 15,
            "replies": []
        },
        {
            "author": "4wheelsRunning",
            "body": "ex is trying to make both of your lives miserable, bc she's miserable, I would guess...Be Strong, and hang in there!💢",
            "score": 3,
            "replies": []
        },
        {
            "author": "DistributionOver7622",
            "body": "I don't know......she should have thrown her out right away,  towel and all.   Then throw her clothes out later.",
            "score": 3,
            "replies": []
        },
        {
            "author": "gratefulandcontent",
            "body": "I’d be checking my house for any new cameras that I didn’t place already.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Latter_Discussion_52",
            "body": "I'm just glad the ex-SIL took this seriously. Way too many people make excuses for the person causing trouble, no matter how far they go, and tell the victim to allow it to continue just so they can \"keep the peace\". That only ever leads to things escalating.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SaboLeorioShikamaru",
            "body": "That “upper-hand” shit it’s wild. I know everyone is in competition with everyone, but goddamn. Not that they get a thrill out of it, but yeesh is that the wrong thought to follow",
            "score": 2,
            "replies": []
        },
        {
            "author": "exhauta",
            "body": "I'm all for good coparenting relationships but honestly kinda weird she had a key to begin with. I can't really imagine a situation where this would be useful. If she wants to see her daughter not on her parenting time she can just knock on the door.",
            "score": 2,
            "replies": [
                {
                    "author": "The_B0FH",
                    "body": "My ex husband has a code to our house, but that's because our adult son lives with me.  My son was diagnosed with brain cancer and then had a stroke because of treatment.  \n\nOutside of edge cases like mine I'm not sure why the ex would need access.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Autumndickingaround",
            "body": "Ex really thought what her and her ex had was still some kind of special bond that OOP didn’t have, because they had a child together. It’s true that is a special bond, but it’s not all that special when surrounded with chaos and mistreatment. \n\nThe fact OOP has the great relationship that she couldn’t manage to accomplish, and now also has that unique layer of sharing a child added to it - but surrounded by a healthy relationship and love… that is totally what pushed her into trying something. She probably doesn’t even know what she was trying to do, because she didn’t have any specific goal in mind, she just wanted to see what her exes reaction would be. \n\nOne of those things where you can tell mental health issues are involved because it’s such a short sighted action where any consequence would cause something negative, but nothing will ever change that it happened.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Oops_I_Did_It_Again",
            "body": "I have divorced and I can’t in my wildest dreams imagine the shit show that would have occurred if one of them did that. \n\nNot only that, but as an adult now, I have secondhand embarrassment for the ex wife.",
            "score": 1,
            "replies": []
        },
        {
            "author": "emccm",
            "body": "A restraining order is a wild way to cover your having sex with your ex wife while your is at work. \n\nI’d be shocked if one was granted. She had keys. There’s no way the husband/ex husband didn’t know.",
            "score": -27,
            "replies": [
                {
                    "author": "Skull_Bearer_",
                    "body": "What sex? Husband was asleep the whole time.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Narrow-Mongoose-9075",
                    "body": "Are you alright? Her having keys actually strengthen the fact that she can come inside their home easily without the husband knowing.",
                    "score": 13,
                    "replies": []
                }
            ]
        }
    ]
}