{
    "title": "Neighbors won’t stop driving through my yard",
    "author": "LucyAriaRose",
    "subreddit": "BestofRedditorUpdates",
    "rank": 9,
    "score": 1500,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 98,
    "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1jdwwfw/neighbors_wont_stop_driving_through_my_yard/",
    "id": "1jdwwfw",
    "selftext": "**I am NOT the Original Poster. That is** [mosterhout](https://www.reddit.com/user/mosterhout/)**.** They posted in r/mildlyinfuriating \n\n# Do NOT comment on Original Posts. Latest update is 7 days old per the rules of this sub.\n\n**Mood Spoiler:** >!things are better!<\n\n**Original** [Post](https://www.reddit.com/r/mildlyinfuriating/comments/1j1cpu6/neighbors_wont_stop_driving_through_my_yard/)**: March 1, 2025**\n\n**Title:** Neighbors won’t stop driving through my yard\n\nApparently it’s too far to drive around the block and they’ve decided the yard between my house and shed is the better option. I’m impressed they take the time to keep moving my rocks. Don’t worry, I’m fully ready for this battle and my friends are helping me find some boulders to bring in 😂\n\n*OOP attached 5 screen-shots. The first two are text exchanges, transcribed below. The next three are pictures, which are also described below.* \n\n*Texts:* \n\n**OOP:** \\[February 14\\] Hey please make sure you guys aren't driving through my yard. Someone moved my rocks I put there. *\\[OOP also attaches a photo of the yard\\]*\n\n**OOP:** \\[most likely February 23\\] This feels pretty petty lol. I'm not sure how else to ask you guys to not drive through my yard and move the rocks *\\[another picture attached\\]*\n\n\\[Editor's note: neighbor never responds\\]\n\n[image 1](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fneighbors-wont-stop-driving-through-my-yard-v0-4cx8bhzrv5me1.jpg%3Fwidth%3D3024%26format%3Dpjpg%26auto%3Dwebp%26s%3D15257920fa76090de7776cdd5313ca6d79334104): OOP's yard with a whiteboard that says \"this is not a driveway\" propped up against some rocks\n\n[Image 2](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fneighbors-wont-stop-driving-through-my-yard-v0-kllt4ezrv5me1.jpg%3Fwidth%3D4032%26format%3Dpjpg%26auto%3Dwebp%26s%3Dcb086316206a2085198c0ca847a7da8416c2e956): the whiteboard and rocks moved to the side so there is a clear path *\\[editor's note- unsure if this is from the neighbors this time or OOP demonstrating what they do\\]*\n\n[Image 3](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fneighbors-wont-stop-driving-through-my-yard-v0-x6j84hzrv5me1.jpg%3Fwidth%3D4032%26format%3Dpjpg%26auto%3Dwebp%26s%3Da26cf6c9b11966505e7c1449d564dd96fc3e26d6): A close up of the whiteboard. It now reads \"This is not a driveway. Caution \\[underlined\\] nails in ground. Don't worry- I'm finding bigger rocks so you won't be as tempted \\[heart\\]\"\n\n***Some of OOP's Comments:*** \n\nCommenter: Get yourself some cheap cameras and record. Looks like you've tried the polite route.\n\n>**OOP:** My Ring is just out of reach where it’s currently set up. Might have to temporarily move it!\n\nCommenter: I was going to suggest this. Hell, I think I have an old Nest Cam in my storage you can have for free. I live nearby, recognized the cityscape immediately. Also run down to Ace and grab some No Trespassing signs. Local PD can get them for trespassing if it’s posted clearly and they still continue.\n\n>**OOP:** Thanks for the offer! If you come across the camera easily, I’ll definitely take it off your hands.  \nAnd yep, I’m all for keeping the peace and trying to communicate through issues. I’ll resort to trespassing signs and PD if it continues.\n\nCommenter: I'm not even OP and this has me infuriated 🤣 wtf is wrong with some people. I wish you hadn't warned them about the nails.\n\n>**OOP:** There may or may not actually be nails… 😂  \n*To someone who tells OOP that booby traps are illegal technically:*   \nThanks! There’s not actually nails in the ground, I just felt sassy.  \n*OOP adds later:*   \nI just changed it so the nails part is no longer there :)\n\nCommenter: put a czech hedgehog there and call it \"modern art\"\n\n>**OOP:** I was hoping this was a giant hedgehog. But looks like it might work better after a quick googling.\n\n*\\[editor's note- a czech hedgehog is an anti-tank obstacle. It's made of metal and yeah- honestly it does look like modern art\\]*\n\nCommenter: Have they ever replied or spoken to you about this? Weird they just completely ignore a simple request about the use of YOUR property.\n\n>**OOP:** It’s a frat house so they have a bunch of people coming and going. The kid whose number I have isn’t responding so I went to talk to a few guys who were outside today. They said they don’t live there but will try to get it sorted out lol.\n\nCommenter: This guy boulders . My man . You need help ?\n\n>**OOP:** I’m accepting boulders via mail!\n\nCommenter: They don't have the time to drive around your property, but have the time to get out of their car and move the rocks?\n\nThe math isn't mathing. It's wild you have communicated with them about it and they're willingly trespassing your property by driving through it.\n\n>**OOP:** That’s the part that my friends and I don’t understand lol. It takes longer for them to move the rocks than to drive around.\n\n**Clarifying** [Comment](https://www.reddit.com/r/mildlyinfuriating/comments/1j1cpu6/comment/mfix52o/?context=3)**: 1 hour later**\n\nI can’t (figure out how to) edit the post! Here’s some more context:\n\nI live (renting) in the green shack and the shed to the right is part of the property. The main road can be seen from the pictures but there’s no parking for my place there. The use a gravel road on the backside of the house as my entrance. It’s a large through-road that many people use for parking and to access the frat houses I live between. I don’t know if it’s the guys who live to the right of my place who are driving through or if it’s their friends.\n\nI’ve lived here for over a year and have had mostly positive interactions with the frats. I’ve introduced myself as a teacher who doesn’t mind the loud music that comes with this area. There’s been a few times when they’ve had music blasting late on a week night and they turned it down after I send a pic of my dogs trying to sleep and ask them nicely 😂 This is the first circumstance where the contact I have hasn’t responded.\n\nToday, there were some people out front of the place next door so I went over to ask them about the rocks. They said they don’t live there and the guys who do live there weren’t home. They said they would talk to them to try and get it sorted out. I also texted the owner of the house, who is one of the frat boys’ dads. I haven’t heard back from him yet.\n\nI didn’t actually put nails in the ground haha. I was feeling sassy when I updated the sign but I’ve since covered the part about the nails after some nice redditers warned me of the possible legal consequences.\n\nMy friends are helping me find larger boulders and we’re determined to build a ridiculous structure.\n\nI love the creative suggestions y’all have given and I will make an update when I have one!\n\nEdit time:\n\nYes, it’s not my property because I’m the renter, and this isn’t causing major physical damage yet. The property line is on the other side of “my” shed. Sometimes they park at the base of the yard, slightly over the property line, which isn’t an issue for me. I posted in mildly infuriating instead of a legal thread because it’s exactly that, mildly infuriating lol. Why does it bother me? The path they are taking goes right past my bedroom window and feels like an invasion of space. This particular frat only moved in last summer. The previous residents never had issues with staying on the roads that are in place 😂\n\nI found out the guy who isn’t responding in the texts no longer lives there. He has previously texted with me and they even helped my classroom collect pop tabs for a fundraiser earlier this school year haha. Yes, he could have easily responded and let me he doesn’t live there anymore, but I’m not upset with him. He’s a college kid who owes me nothing.\n\nI’ll send a message to my property manager to inform them of the situation. I highly doubt they will care about my makeshift barrier. I’ve turned this place into a cozy shack that I love and won’t be ending the lease over something like this. I don’t need to convince y’all of how hard it is to find “affordable” housing right now that allows my animals!\n\nI prefer the route of trying to keep the peace and resolve this without involving law enforcement (unless my property managers ask me to do so). I’m all about healthy conflict resolution ✌️If the issue continues, I’ll reach out to the homeowner and/or the university.\n\nAs of now, my most recent construction is still in place. I now have the weight on my shoulders of finding some boulders to satisfy myself and all of Reddit. Please give me a week to work on this and I’ll try not to let you all down 😂\n\n**Edit to comment: March 2, 2025 (Next Day)**\n\nSecond edit: property manager responded right away and said they are going to deal with it. They had already noticed the parking at the base of the hill and said that’s a liability issue so it looks like I’ll be getting a fence!\n\n**Update** [Post](https://www.reddit.com/r/mildlyinfuriating/comments/1j96t5x/update_neighbors_wont_stop_driving_through_my_yard/)**: March 11, 2025 (9 days later)**\n\nAlright team, I failed with the boulders, but I secured a few more decorative rocks to add to the beauty of my yard. The current barrier has yet to be breached and I updated my sign to reward the positive behavior.\n\nI contacted my landlord and they said they are working on a fence due to the liability issues.\n\nIf you want more detailed updates, I listed them in a comment on the original post. Seems like overkill to copy and paste it here. Cheers!\n\n[Image 1](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fupdate-neighbors-wont-stop-driving-through-my-yard-v0-dsqreaepp5oe1.jpg%3Fwidth%3D4032%26format%3Dpjpg%26auto%3Dwebp%26s%3Dd06ee0ad3155fd4a1d7cdbc7b4f7915f8c5072cf): OOP's yard, now with more rocks and the whiteboard\n\n[Image 2](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fupdate-neighbors-wont-stop-driving-through-my-yard-v0-s08qoaepp5oe1.jpg%3Fwidth%3D3024%26format%3Dpjpg%26auto%3Dwebp%26s%3D765d364e739ea3a1661013848ddc32ca885fb4d0): A close up of the whiteboard which reads \"Thank you for not using this as a driveway! (And for giving me my 15 mins of fame on Reddit) \\[heart\\] your neighbor\"",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReflectionNah",
            "body": "Hilarious that those frat guys were more willing to move the rocks than, doing the more obvious choice, of driving around the house.",
            "score": 1057,
            "replies": [
                {
                    "author": "reload_noconfirm",
                    "body": "I've found, with some type of guys who may or may not be this type, that they respond very quickly to a person requesting feats of strength. \n\n  \nThat said down with the patriarchy. It's dumb.",
                    "score": 454,
                    "replies": [
                        {
                            "author": "demon_fae",
                            "body": "And yet they instantly and correctly respond to the knowledge that they had mildly upset a dog.\n\nI suspect that these are some absolute dumbasses. Probably not malicious, just really, really dumb.",
                            "score": 227,
                            "replies": [
                                {
                                    "author": "nekocorner",
                                    "body": "It's possible that OOP's text contact was the one corralling all the guys, & now that he's gone, they don't have anybody enforcing decent neighborly relations.",
                                    "score": 178,
                                    "replies": []
                                },
                                {
                                    "author": "attachedtothreads",
                                    "body": "Dumb as rocks?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GranGurbo",
                            "body": "Au contraire! What we have is a great strength of feet!",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "decemberrainfall",
                                    "body": "Upvote for Men in Tights",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "shadedmoonlight",
                                    "body": "r/unexpectedMenInTights",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Xiad6682",
                                    "body": "...........don't follow.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "otetrapodqueen",
                                            "body": "It's a Robin Hood Men in Tights reference!",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "GranGurbo",
                                                    "body": "And that was Robin's answer in that dialogue",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "otetrapodqueen",
                                                            "body": "Lol you right, I spaced that! My bad!",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "decemberrainfall",
                                                            "body": "No it was Asneeze!",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Personal_Sprinkles_3",
                    "body": "Pledges. Hazing is a still a thing, and little tasks like “get out of the car and move that rock” are minor enough to not really bother most people.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Lopsided-Sky396",
                    "body": "Dunno why she didn't just cover them in honey or oil or something else that'll fuck up their hands. \n\nIt'll take them twice as long to move and she'll have have the \"WHAT THE FUCK!?!?\" alarm to alert her to the true dumb as the rocks they're picking up bandits!",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Romulan-Jedi",
                            "body": "Do you want ants?  'Cause that's how you get ants.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Lopsided-Sky396",
                                    "body": "You're kinda missing where my thought process was going here I think. Less about the substance than the result. \n\nAlso where I live ants would only be a potential problem like one month of the year if the weather's nice so it really didn't occur to me. We don't all live in warm weather 🙄",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bibbiddybobbidyboo",
                            "body": "Or Marmite. That is way worse.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Stormy8888",
                    "body": "Even more hilarious is OP didn't arrange the rocks in the shape of a dick and balls, updating the sign with a \"Don't move Deez Nuts.\"",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Teauxny",
                    "body": "I'm seeing it as the first guy moving them, then the rest cruising through.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dajur1",
            "body": "Whenever someone says \"thank you for not...\" it always reminds of an an old Jason Priestly movie where a guy is in a cab and starts smoking.\n\nCabbie: The sign says \"no smoking\".\n\nGuy: No, the sign says \"thank you for not smoking\". Since I'm smoking, I don't expect to be thanked.\n\nHah, I just looked up the movie and the \"guy\" was John Hurt. Of course young me wouldn't have known who he was.",
            "score": 465,
            "replies": [
                {
                    "author": "IrradiantFuzzy",
                    "body": "Love and Death on Long Island, if anyone wanted to watch it.",
                    "score": 57,
                    "replies": []
                },
                {
                    "author": "ZarquonsFlatTire",
                    "body": "I'm old and have friends who are both lawyers and friends who own heavy machinery. Me? I'm a former landscaper.\n\nI would have had a boulder installed with a small juniper on top and a walled bed around it. So the roots could grow over it and I can take it down inch by inch over the next 36 years.\n\nMacro-bonsai motherfucker. \n\nDirections would be in my will. It's legitimate gardening! And actually... after 20 years would be pretty cool.\n\n*looks at yard no one parks on*",
                    "score": 50,
                    "replies": [
                        {
                            "author": "demon_fae",
                            "body": "You can do it anyway. Don’t let your dreams be dreams!",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "ZarquonsFlatTire",
                                    "body": "Well my current \"yard\" is about 30' by 5' because I own the ground floor condo.\n\nI haven't bothered to do anything for the last ten years because it's nice to let someone else do it for a change. Even if they aren't good at it and I'm paying them.\n\nBut legally I CAN rip out the lorapetalum and hollies and do anything I want. I know a guy with the equipment to rip them out, I just need a plan for afterwards.\n\nLots of shade really limits me.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Lycaeides13",
                                            "body": "Good luck getting rid of holly. That shit is *tenacious*\n\n\nSource: my parents continually cut the unwanted holly to the ground, tried to pull it out, tried to poison it. It always comes back",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ZarquonsFlatTire",
                                                    "body": "Reminds me of my parents killing an acre of ivy. They actually had the balls to say \"We'll be here a while, fucking mow it down and spray a mixture of salt and vinegar.!\"\n\nThey actually salted the earth in their own yard.\n\n Killed everything for like 5-7 years. \n\nEdit: I should add that all the hardwood trees survived. They had the loblolly pines removed. Some oddly placed azalea, and an acuba and a pittisporum also survived. Along with mom's favorite tree, a weeping fir. Which has shot up 30 feet since the pines were cut down and it could get some light.\n\nThen they started spreading rye grass seed for a few years, and now 20 years from the start it has way fewer snakes than before. Like, almost none.\n\nBut they do have this one red tip bush. I have chainsawed that thing down at ground level. It has come back taller than me.\n\nAt this point, fuck it. The front porch needed a railing but the red tip does that. It earns its keep.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "xelle24",
                                                    "body": "I accidentally killed one of my hollies by leaving a pumpkin to rot next to it. I think it grew some kind of mold that got into the roots.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "FunnyAnchor123",
                                                            "body": "Thank you for sharing this solution with humanity. The unborn will be forever indebted to you.\n\nNext: a solution for English ivy & Himalayan blackberries.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "xelle24",
                                                                    "body": "I'm pretty sure English ivy is a direct ancestor of kudzu. There's no getting rid of that shit. Like cockroaches, it will outlast us all.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ZarquonsFlatTire",
                                    "body": "Also when I was in landscaping my catchphrase was \"Yeah but in 20 years....\"",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CatmoCatmo",
                            "body": "Anything can, and should, be a bonsai if you’re brave enough. Be brave. Make your dreams a reality. \n\nAlso, if I ever need to brainstorm some ideas on how to be petty AF, especially with landscaping, I’m totally going to hit you up on here. Your two cents and expertise would be priceless.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "ZarquonsFlatTire",
                                    "body": "With low nitrogen, high potassium fertilizer, anything is possible.\n\nOr at least, this thing is possible.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Helpful_Librarian_87",
                            "body": "Just went & checked out macro bonsai and holy fuck, I want to go find one irl.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ZarquonsFlatTire",
                                    "body": "Wait that's a thing? I thought I was just making it up.\n\nEdit: Jesus. I googled it.\n\n Just goes to prove, anything you can think of, some Asian person already did it waaaay better.\n\nThose things are incredible!",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Helpful_Librarian_87",
                                            "body": "I know!!! I love bonsai cos it keeps me feeling young, now I want to hang out by macro bonsai so I can feel even smaller than I am. Oh god, redwood bonsai would blow my tiny brain",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kfrostborne",
                            "body": "Uh, that sounds amazing, and I want one for my yard.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ZarquonsFlatTire",
                                    "body": "Yeah I was just drunk and talking out of my ass, but it's not a bad idea.\n\nI'll admit, I've only read one book on bonsai, but the whole plant on top of a rock and slowly take away the soil is how they do that.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "kfrostborne",
                                            "body": "Well you know, some of the best ideas come from when your brain is in “fuck it!” mode.\n\nI would absolutely love to try that. I’m mostly an indoor plant enthusiast, but I love a challenge! The closest I’ve come yet are 2 baby adeniums that I’m terrified to trim yet. lol",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ZarquonsFlatTire",
                                                    "body": "Well you can try it in a small pot. There are definitely bonsai that train roots over rocks. \n\nThey do it by, well like I said. Get a small pan planter, put a rock on it, then build a cardboard wall around it and fill that with soil. Put your plant on top on the rock.\n\nMostly water the lower level to encourage downward root growth and slowly (years slowly) take down the wall.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Anonphilosophia",
                    "body": "Lolol. I'm gonna save that. 😂",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "ScrofessorLongHair",
                    "body": "While a great actor, he wasn't the just talented John Hurt. He's no Mississippi John Hurt.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Griffithead",
            "body": "If you are throwing parties, you do NOT fuck with a cool neighbor. You shower them with love and gifts.",
            "score": 313,
            "replies": [
                {
                    "author": "CatmoCatmo",
                    "body": "Especially when there’s a pretty high likelihood that there’s underage drinkers at said parties, and that there may or may not be *VERY* questionable shenanigans happening as well. \n\nI’m a 40 year old woman who has parties on rare occasions that typically end around or just before midnight, and I still always make sure my neighbors are cool with it and know what’s going on. These frat boys are a bunch of amateurs.",
                    "score": 84,
                    "replies": []
                },
                {
                    "author": "FunnyAnchor123",
                    "body": "If you are kids throwing parties, you do NOT fuck around with certain neighborhoods.\n\nBack when I owned my first house in a Black neighborhood that later trended upper middle class, some college kids next door to me threw one of those parties. Every male adult within listening distance paid them a visit the next day not all of them friendly visits. I forget if that was before or after the summer there was one drive-by shooting & another under-aged party where some fool shot a handgun.\n\nFunny thing is, except for those incidents, it was a very nice place to live. The neighbors were very friendly, & I seriously regretted moving away from there.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "ena_bear",
                    "body": "And if you’re wanting to haze pledges to move rocks, you ask the nice neighbor if they would like some free landscaping done lol",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "justbreathe5678",
            "body": "I was hoping for giant rocks and I got the knowledge of Czech hedgehogs!",
            "score": 91,
            "replies": [
                {
                    "author": "beaglemama",
                    "body": "Reading about hedgehogs reminded me about how some hedgehogs from WWII used against the Nazis were taken from a Kyiv museum to be reused against Russian invaders.\n\nhttps://museumobserver.com/anti-tank-hedgehogs-from-ww2-taken-from-museum-used-as-barricade-in-kyiv/",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Useful_Language2040",
                            "body": "I just don't want to Google too much in case it turns out that these are not animatronic, near spherical (somewhat teardrop shaped with a camera/sensor in the pointed front), and with spikes over most of their bodies, shuffling along slowly up and down back and forth across roads/lines of defined width.\n\n\nI ***want*** that to be what Czech anti-tank hedgehogs are... I know they are more likely to be stationary, but the mental slow shuffling image... 🥹 Does not want to surrender it!!!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LucyAriaRose",
                    "body": "You and me both!",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "tacwombat",
                    "body": "I am not fully awake and had a bizarre brainfart moment thinking they turned u/czechtheboxes into a hedgehog.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "czechtheboxes",
                            "body": "My name has always been czechthehedgehogs, what do you mean?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "tacwombat",
                                    "body": "[GASP!](https://i.kym-cdn.com/entries/icons/original/000/050/266/ChJ6QmwWUAAb5DK.jpg)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JJOkayOkay",
            "body": ">They don't have the time to drive around your property, but have the time to get out of their car and move the rocks?\n\nThe campus cops at my university used to have this tiny electric car. Very tiny. So tiny that groups of students would pick it up and move it elsewhere whenever they found it parked unattended.\n\nIn other words, university students have all the time in the world for doing things they think are hilarious.",
            "score": 60,
            "replies": [
                {
                    "author": "SuperCulture9114",
                    "body": "My father told a story about his school principal who owned an Isetta (50s or 60s). So the boys from his school naturally carried it up and put it in the classroom 🤣",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Mtndrums",
                    "body": " Most uni kids never had *time*, but that only works if you think there's a normal sleep schedule. Hell, during hockey seasons, I got about 2 hours a night of sleep.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Immediate_Radio_8012",
            "body": "I'm on OPs side but the whiteboard is such a teacher thing to do, especially  the positive reinforcement in the end.  \n\n\nThis seems like a lovely spot for a pond to go in... ",
            "score": 31,
            "replies": [
                {
                    "author": "BestAtempt",
                    "body": "Or just plant a tree",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "istara",
            "body": "I saw that first picture and just thought *\"they need bigger rocks\"*. \n\nI suspect that they will still need bigger rocks or some kind of permanent structure, quite honestly.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Resentful-user",
            "body": "When having problems with a fraternity, the best thing is to contact the national branch. They are focused on protecting the brand and will make members either stop their behaviour or leave.",
            "score": 13,
            "replies": []
        },
        {
            "author": "SmartQuokka",
            "body": "I like the nails sign, and the temptation removal. And the fact that there were no nails 😄",
            "score": 24,
            "replies": []
        },
        {
            "author": "Aradene",
            "body": "I would put star pickets in. Without the tool to remove them they’re a bastard to pull out by hand!",
            "score": 8,
            "replies": []
        },
        {
            "author": "Tobias_Atwood",
            "body": "After a certain point you really gotta stop and ask yourself why you're working harder to avoid work than if you just did the work.",
            "score": 34,
            "replies": [
                {
                    "author": "YukariYakum0",
                    "body": "Never underestimate the lengths human beings are willing to go for the sake of being lazy.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "AnAwkwardStag",
                            "body": "Lazy people are good for one thing and one thing only: they're experts at finding the path of least resistance.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Tobias_Atwood",
                            "body": "Moving the rocks repeatedly was more work than just driving the small extra distance though.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Alternative_Year_340",
                            "body": "Never underestimate men who have decided they have the right to a particular space and their anger at anyone who tries to stop them.\n\nNot to mention the stupidity of the damage risk of driving your car through that space. Even without nails, it’s a flat waiting to happen",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ShadowWingLG",
            "body": "Reminds me of the time some frat boys thought it would be fun to prank a neighbor by putting really large rocks behind her car after a request to keep the music down.  She was a geology professor and had on hand a very LOUD rock crusher, she waited till 9-10 am then WENT TO TOWN on said rocks.\n\nWhen she was done the frat porch was full of frat boys in various states of shock/hungover/impressed.\n\nShe didn't have a problem with them after that!",
            "score": 7,
            "replies": [
                {
                    "author": "LucyAriaRose",
                    "body": "Haha that's awesome. What a badass.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "king_kong123",
            "body": "Life pro tip.  With situations like this get a play structure from a place like Costco. Very hard to move without damaging and when they do damage it you can then report to the police as property damage.",
            "score": 12,
            "replies": []
        },
        {
            "author": "paparoach910",
            "body": "Imagine showering the yard with caltrops for tired. That would be quite the disincentive.",
            "score": 4,
            "replies": [
                {
                    "author": "dogsonbubnutt",
                    "body": "also highly illegal",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "BaneChipmunk",
            "body": "Go full Home Alone on them. Place a hot iron above the tree and have it drop on their heads when they go to move the rocks.",
            "score": 4,
            "replies": []
        },
        {
            "author": "mmrose1980",
            "body": "OOP should contact the fraternity’s national headquarters. Their president will get an earful, and this will be dealt with immediately.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Late_Cupcake750",
            "body": "Those are not boulders, they’re just rocks.",
            "score": 35,
            "replies": [
                {
                    "author": "Baejax_the_Great",
                    "body": "\"Alright team, I failed with the boulders, but I secured a few more decorative rocks\"",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "heckno_whywouldi",
                    "body": "Oh, the pioneers used to ride these babies for miles",
                    "score": 23,
                    "replies": [
                        {
                            "author": "HurricaneK8",
                            "body": "The KRUSTY KRAB PIZZA! is the PIZZA! for YOU and ME! 🤣🤣🤣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZarquonsFlatTire",
                    "body": "Yeah. I'm not from a particularly rocky area, but I don't think it's a boulder unless it's like size of an adult's torso. If a single adult man can lift it, it's not a boulder.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "BeatificBanana",
                            "body": "Did someone say they were boulders? ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ZarquonsFlatTire",
                                    "body": "I dunno. Other people said boulders so I started talking boulders.\n\nYou wanna talk not quite pretty large rocks? Because honestly,  that doesn't have the same appeal.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FunnyAnchor123",
                            "body": "Me too.\n\nBut in a lot of places, it's more than just a challenge to find rocks big enough to be a problem to trespassing cars.\n\nIf the OOP was willing to invest the time & effort, there's always the recourse of an anti-tank trench: dig a ditch much less than a yard/meter wide & a foot or two deep. Cars trying to cross that will bottom out & get stuck. But I fully understand if OOP wasn't willing to invest that much labor.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AshamedDragonfly4453",
                    "body": "I mean, yes, that's what OOP said: they didn't manage to source any boulders.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Slp023",
            "body": "It amazes me how people could just do this. I buy local strawberries from a guy who sells them out of his house. He lives on a very busy road that is hard to back out of. He told me he and his neighbor have an agreement that both can drive over the grass for an easy exit. Still couldn’t do it. It just seemed wrong.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Ok-Benefit197",
            "body": "Instead if a fence plant some trees ",
            "score": 3,
            "replies": []
        },
        {
            "author": "VSuzanne",
            "body": "Aw, it almost looks like a mini Stonehenge now 😄",
            "score": 3,
            "replies": []
        },
        {
            "author": "__VOMITLOVER",
            "body": "I would have went with landmines and spike strips but then again I'm not known for reacting well when my property is disrespected.",
            "score": 3,
            "replies": []
        },
        {
            "author": "tribalgeek",
            "body": "A couple t posts that cost less than 10 bucks should be enough to make it so cars can't fit and be a big enough pain to un do to stop it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ifeelnumb",
            "body": "Missed opportunity for treelaw here.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Geordieqizi",
            "body": "I feel like it speaks badly of me that I was disappointed this was resolved peacefully, and not with someone being arrested or having their car fucked up by nails in the ground.\n\nGlad that it worked out for OP though (she said resentfully)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dana07620",
            "body": "I don't know.\n\nI've known some frat type very young men that the more boulders you put there, the funnier they think it would be to move them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mountain-Selection38",
            "body": "Install rebar sticking up about 18\" and buried about 3' deep.... Someone will drive through your yard one more time",
            "score": 1,
            "replies": []
        },
        {
            "author": "trentraps",
            "body": "Why didn't he just put a vehicle there?",
            "score": -1,
            "replies": [
                {
                    "author": "BeatificBanana",
                    "body": "What a good question. A vehicle may have been even more effective than rocks. I wonder what possible reason someone would have to choose rocks instead of just parking a car there? Hmm, this is a tough one... ",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "BestAtempt",
                    "body": "Validates cars belong there, so when the car is out the “driveway” remains",
                    "score": 3,
                    "replies": [
                        {
                            "author": "trentraps",
                            "body": "That's a good point!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}