{
    "title": "AITAH For Not Letting My Pregnant Sister Sleep In My Bed?",
    "author": "Choice_Evidence1983",
    "subreddit": "BestofRedditorUpdates",
    "rank": 10,
    "score": 1387,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 76,
    "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1jdwj0w/aitah_for_not_letting_my_pregnant_sister_sleep_in/",
    "id": "1jdwj0w",
    "selftext": "**I am NOT OOP, OOP is** u/SilenceFiction\n\n**Originally posted to r/AITAH**\n\n**AITAH For Not Letting My Pregnant Sister Sleep In My Bed?**\n\n**Thanks to u/queenlegolas for suggesting this BoRU**\n\n**Trigger Warnings:** >!entitlement!<\n\n--------------------------\n\n[Original Post](https://www.reddit.com/r/AITAH/s/t6NZvmy3JN): **March 10, 2025**\n\nI (26M) rent a small two-bedroom apartment. I live alone, but I use the second bedroom as my office because I work from home full-time.\n\nMy older sister, \"Lily\" (31F), is 6 months pregnant and soon to be single mother.\n\nShe has some issues with her apartment (in a disagreement with her landlord, and in the process of moving out), so she asked if she could stay with me for a few weeks. Of course, I said yes and that I would be happy to accomodate her for as long as she needs.\n\nShe moved in last weekend, and the first thing she did when settling in was pointing towards my bed and saying: \"I'll take this one.\" I laughed, thinking she was joking. Only later in the evening when I asked her if she needs anything else before going to bed did she mention that she was not joking about wanting to sleep in my bed.\n\nNow I'm a little bit of a germophob, and I am quite uncomfortable with the idea of other people sleeping in my bed.\n\nI told her that I am uncomfortable letting anyone else sleep in my bed. But I will gladly set her up with my guest bed (which I did use to sleep on before buying my current bed, and I know for a fact is very comfortable and spacious).\n\nThen, she started guilt tripping me saying that since she got pregnant she's having problems falling asleep and that she needs the bigger more comfortable bed.\n\nI stood my ground and told her I was happy to accommodate her, but I wasn’t giving up my bedroom. She sulked, but she took the guest bed.\n\nThat lasted exactly two nights before she started complaining that the bed was “too stiff” and that she “couldn’t sleep.” I offered to buy a new mattress topper, but she refused. Instead, she tried to pull the \"you’re my brother, you should want to make me comfortable\" guilt trip again...\n\nI told her that she is lucky I can even take her in, since I work 10 hours a day from home and I do value having a work enviroment that's private, calm and quiet.\n\nShe called me selfish and accused me of not caring about her or her baby. I told her she could take the couch if the guest bed was that unbearable.\n\nWell, she did... but exactly for 1 night before turning into an absolute menace.\n\nIn the second night on the couch, she made sure to sigh loudly all night, \"accidentally\" bump into things, and complain the next morning about how \"horrible\" I was making her feel.\n\nThe following day, she kept making calls and talking loudly on the phone while I was working.\n\nI didn't pay attention to the actual calls and what she was saying, but later it became very clear...\n\nIn the evening I started getting phone calls from most if not all of my family members.\n\nApparently, she was ranting all day on the phone to my family about how rude and how horrible I was making her feel, trying to make my family put pressure on me just to let her sleep in my bed... Like she's on a mission or something..\n\nMy mom took her side and tore me a new one on the phone saying that Lily is carrying a child and I'm being inconsiderate, she also said \"I thought I taught you better hospitality than this, I am very disappointed\".\n\nMy aunt called to tell me that my uncle (her husband) used to sleep on the couch and sometimes on the floor next to her when she was pregnant.\n\nEven my cousin (who I haven't spoken to in like 2 years) called to tell me I'm being selfish.\n\nMy father is taking my side telling me to ignore them and that my sister is a fuck up that she got in that situation in the first place... But I feel like my mom is giving him a super hard time in the background because he did sound kind of hesitant when I asked him to have my back.\n\nHonestly I'm just feeling like I'm in the middle of a soap opera drama.\n\nMy mom is threatening to come take Lily home (yea like that's much of a threat haha) but she's giving me such a hard time and telling me I disappointed her and that she raised me better..\n\nI don't know how to feel about this anymore..\n\nAITAH for not letting my pregnant sister sleep in my bed?\n\n**AITAH has no consensus bot, OOP was NTA**\n\n**Top Comments**\n\n**Commenter 1:** NTA\n\nTell your sister, your Mom has offered to let her stay, so \"pack your bags if the guest bed is uncomfortable\".\n\nEveryone who has called, call them back and ask when they intend to pick up your sister to stay with them.\n\n**Commenter 2:** Get her out of your house ASAP. You’re going to end up with her in your room, baby in guest room and you’re going to be sleeping on the couch.\n\nCheck your lease and tenancy laws. Do not let her use your address for mail. Seriously, get her out before she gives birth. Ship her off to mom.\n\n**Commenter 3:** “I offered you a place to live and you have returned that favor by turning a bunch of flying monkeys on me so you can steal my bed on top of the rest of my home. You are disrupting my work and my life. I expect you to be out tomorrow. Maybe one of your flying monkeys will take you in.” NTA.\n\n**Commenter 4:** NTA and I would just say \"Oh sure thats a perfect plan. You can come tomorrow and pick her up and take her home. I am sure she will be much more comfortable there, then at my place. Why didnt you offer this before knowing how small my place was and knowing that conflicts would happen? But yeah go ahead and pick her up, because if she continues to disturb my work, well idk how long she can stay in this house in general.\"\n\n&nbsp;\n\n[Update](https://www.reddit.com/r/AITAH/s/EVIKLuYTkF): **March 11, 2025 (next day)**\n\nFirst of all, I wanna thank you guys for the overwhelming support! This blew up way beyond anything I expected. Wow! I really appreciate you all for taking the time to chime in and sharing your opinion, you guys really helped reassure me and gave me confidence in my own feelings that my private space has been disrespected (and quite frankly, violated).\n\nI would like to answer a few common questions I saw in the comments:\n\n* The guest bed is in the living room. It's stored in the second bedroom (my office), but whenever I have a guest I set it up in the living room. The living room space is quite big and can comfortably fit the guest bed, couch and living room table as well.\n\n* My parents live 4.5-hour drive away and they are the closest family members to my apartment, that is why I didn't initially think of suggesting anyone to come and pick up Lily to take her to their place.\n\n* I, infact, **did NOT** get my sister pregnant (WTF guys! LOL).\n\n* Lily is moving out of her current apartment because it is being sold, and the new owners aren't sure if they want to keep renting it, or what to charge exactly. So that's why she is moving out.\n\n**Anyways, here is the update:** My mother made the drive over yesterday. She came in quite furious, barely said a word to me, and wanted to just take Lily and leave ASAP.\n\nShe had that cold, disappointed look on her face. It broke my heart honestly.\n\nI told them (Lily and my mother) that I wanted to talk and explain my side of the story. I told them both that I didn't want them to leave on bad terms.\n\nI sat them down in the living room, and explained my side of things. I also decided to show them the original post, and it did help calm them down and made them second-guess their opinions. Also I did believe they were quite embarassed (judging by the looks on their face when I showed them the post) to see everything written out like that, but they didn't dare to say a word about it lol.\n\nIn the end, they both agreed that my apartment is my personal space (and also my workplace), and they understood why it was difficult for me to give up my bed.\n\nIt wasn't totally smooth though, they still gave me a bit of a hard time, saying that while they do understand my side now, I could've still been the bigger person and just let Lily sleep in my bed. At least they did drop the whole \"you're selfish\" act.\n\nAs for the rest of the family, I demanded that my sister called each and every one of them to let them know my side and calm them down. Lily was reluctant at first, but my mother gave her \"the look\" and eventually she came around and told me she'd do it on the drive back to my parents'.\n\nI was honestly surprised she agreed. My aunt even called me today to apologize, that was... definitely unexpected and very satisfying haha.\n\nLily is now staying with my parents. And honestly? I wouldn't be surprised if I get a in a few weeks with them ranting about her being entitled in their house haha. Can't wait to see how they'll hande that one.\n\nHopefully, this is the last time I'll have to deal with this. Lily still needs to move her stuff from her old apartment (which is a 30-minute drive from me), so I know she's going to ask for my help. Not that I would mind, I would be happy to help her, but I'm worried she'll might want to come stay at my place again or use my place to store some of her stuff.. Also she might bring this whole thing up again and I couldn't be arsed to deal with it once again.. Ahh that's a problem for another day, though (hopefully not hahaha).\n\nSo in the end, I believe it turned out the best way possible, and I have you guys to thank for that!\n\nSeriously, I appreciate each and every one of you who took their time to comment on my original post.\n\nThank you!\n\n**Top Comments**\n\n**Commenter 1:** So naturally your sister will be sleeping in your parents bed right? You know since Mom doesn’t think its a big deal?\n\nOk all kidding aside you handled this perfectly, you were NTA then and you’re still NTA\n\n**Commenter 2:** Amazing how busy work is going to be for the foreseeable future and all the tight deadlines you have (and get a coworker to back you up) but you can ask if anyone knows a good moving company.\n\nOr just dodge her calls and after she’s moved tell her you needed a break from her after all the drama she caused you. Warm your dad you’re going to do this so he can get ready to handle it on his end.\n\nMost importantly remember you don’t owe her a thing right now, the way she treated you isn’t how you treat family you value when they are doing you a favor, and also what kind of idiot moves out but doesn’t move their stuff? Talk about a preventable problem.\n\nAlso check your lease for any limits on how long guests can stay!\n\n**Commenter 3:** Still NTA! I’m so glad you spoke to them and got the story straight.\n\nThey sound like they think you’re still in the wrong. I honestly would take a big step back from Lily and anyone who was disrespectful to you.\n\nDon’t help Lily move. She needs to figure it out on her own. You were nice enough to her and she tried to take advantage of you. You’ll end up doing all the work if you help her move. Let your parents and all your disrespectful relatives do it. Let her hire movers. If she calls and asks, either ignore her calls or tell her you’re busy. You don’t have to explain further.\n\nDon’t let her store any of her stuff at your place either. She can rent a storage unit. Don’t pay for anything either. If she can’t afford it, she can ask mommy or the other people she called.\n\nLet her know she burned that bridge. Take care of your own peace now.\n\n&nbsp;\n\n**DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n**THIS IS A REPOST SUB - I AM NOT OOP**",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmartQuokka",
            "body": ">My mom is threatening to come take Lily home (yea like that's much of a threat haha) but she's giving me such a hard time and telling me I disappointed her and that she raised me better..\n\nPlease don't threaten me with a good time 😄",
            "score": 1496,
            "replies": [
                {
                    "author": "Time-Reindeer-7525",
                    "body": "OOP's mum really hasn't got the hang of this whole threat-making business, has she?",
                    "score": 262,
                    "replies": [
                        {
                            "author": "SmartQuokka",
                            "body": "Indeed not. And its better this way, these are the kinds of threats i like and will accept.",
                            "score": 67,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tacwombat",
                    "body": "After living with Lily for a while, Mom is going to ask to move into OOP's apartment.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "HeQiulin",
                    "body": "Right!? I would have replied “omg you would thank you very much! I’ll go tell her the good news now” lol",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "paulinaiml",
                    "body": "Now Lily is gonna demand her bed, let's just wait",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "LincBtG",
                    "body": "It's a hell of a feeling",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "spooteeespoothead",
            "body": "You can really tell who Mom's favorite kid is...",
            "score": 458,
            "replies": [
                {
                    "author": "GeneralPhilosophy691",
                    "body": "Yep, the faildaughter who got knocked up.",
                    "score": 109,
                    "replies": [
                        {
                            "author": "kitskill",
                            "body": "It's very common for well-meaning parents to favor the screw up child. They feel like they failed them as a parent and that they need extra help. The competent child(ren) can look after themselves and should help look after their ne'er do well sibling. \n\nI don't know if it has an official name, but I call it the \"Prodigal Son Effect\".",
                            "score": 64,
                            "replies": [
                                {
                                    "author": "MageVicky",
                                    "body": "ooor for the screw up kid to \\*be\\* the screw up \\*because\\* they were favored so much, which I think it's what happens more often, in my opinion.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "kitskill",
                                            "body": "I think it's a bit of a chicken and egg thing, really.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HoshiAndy",
                                    "body": "I don’t know if she’s the fail daughter? Her apartment being sold wasn’t her fault. Though it’s crazy she didn’t have a backup plan. They usually tell you WAY earlier.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Accomplished_Yam590",
                            "body": "It's weird how abusive parents usually love the fuck-up kid(s) more than the successful kid(s).",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "captcha_trampstamp",
                                    "body": "It’s all about control. Your child is a fuckup, therefore you get to play savior and show everyone what a wonderful parent you are.",
                                    "score": 37,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gwynasyn",
            "body": "Okay but did she demand to sleep in her parents' bed? The people need to know!",
            "score": 503,
            "replies": [
                {
                    "author": "Merebankguy",
                    "body": "Something tells me that even if she does demand that, OOPs mom will happily kick out the dad out of the bed for the sister ",
                    "score": 134,
                    "replies": []
                }
            ]
        },
        {
            "author": "DubiousPeoplePleaser",
            "body": "Still don’t understand why Lilly couldn’t stay at her own place. She still rented the place. Her stuff was all there. Sure it sucks to live with all those moving boxes, but she could have packed most of her stuff and just kept her bed and essentials til she needed to leave. And she should be looking for a new place anyway.",
            "score": 306,
            "replies": [
                {
                    "author": "Couette-Couette",
                    "body": "Because in reality her plan was to move in with OP...",
                    "score": 189,
                    "replies": []
                },
                {
                    "author": "Audiovore",
                    "body": "Yeah, I've stayed in several empty/boxed places pre/post move, and it's nbd? The whole pregnancy thing does add an element, but she is over 30 and 6mo, um sorry she should have been more prepared on her end, \"hormones\" being a lazy excuse that no one should accept.",
                    "score": 61,
                    "replies": [
                        {
                            "author": "worldbound0514",
                            "body": "I moved when I was seven months pregnant. We had some neighborhood guys for help loading the truck, but I did most of the packing and organizing. It wasn't terrible. Of course, two days after we moved in, we had a terrible storm that knocked out the power for 48 hours.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "mortaine",
                                    "body": "Almost everyone I know who has given birth to a kid moved while they were pregnant. It's like nesting turned up to 11. I personally don't have any kids so I only imagine it being the most stressful way to move.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Will-to-Function",
                                            "body": "I moved when my son was ten months old, I wish I had done it during the pregnancy",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "twilipig",
                            "body": "I moved a total of THREE times during the course of my pregnancy, and then once 3 months post partum. My roommate (who I still live with in a different house lol) did offer me her bed as I worked nights and she worked days. I only ever took the bed once in the 6 months we lived in that place, and it was because my back was killing me and I had to sleep on a camping cot until my parents finally got my bed back from storage (another long story). My room, until we settled into our more permanent place the final time, was my wardrobe, cat necessities, a tv stand with no tv and a BUNCH of boxes with my stuff in them. I was just happy to have a place at all",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ecosynchronous",
                    "body": "Maybe she was worried about her ex or the landlord doing some fuckshit to her? Pregnancy is a very vulnerable time.",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dana07620",
            "body": "What kind of job does Lily have? It's not a physical job or she couldn't have moved 4.5 hours away. But there's no mention of her working while at OOP's home.\n\nWhich leads me to wonder if Lily currently has a job at all? If she doesn't...hope parents enjoy living with her and their grandbaby, because she's going to be there a good, long while.",
            "score": 51,
            "replies": [
                {
                    "author": "I_comment_on_GW",
                    "body": "Lily does not have a job. Her job is being pregnant and a mother and everyone needs to take care of her. The second the dad called her a fuck-up I knew exactly what she was.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Dana07620",
                            "body": "Yet she lived on her own and that requires money from somewhere.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "WeeklyConversation8",
                                    "body": "Mom and Dad?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HaplessReader1988",
                    "body": "Exactly what I was wondering!",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "peter095837",
            "body": "Sister really has some goldilocks syndrome cause that entitlement shows.",
            "score": 183,
            "replies": []
        },
        {
            "author": "SmartQuokka",
            "body": "This is not over, soon enough they will be pestering OOP to take her in because she is driving them crazy.  \n\nI expect it will start with helping her move/storing her stuff, and then with many calls about how rough things are and then with promises that she will not try to steal OOP's bed again but will OOP please, please, please house her; just short term in his spare room...",
            "score": 95,
            "replies": [
                {
                    "author": "Shoddy-Minute5960",
                    "body": "Luckily oop has a bunch of other relatives that volunteered to take her in. At least that's what I understood they were doing when they called to berate him.",
                    "score": 51,
                    "replies": []
                },
                {
                    "author": "MakanLagiDud3",
                    "body": "Aka, \"You're right, \\[Lily\\] is a menace but we will *NEVER* acknowledge that. Also, your sister is making us lose our hair so please take her. Oh and we're not gonna be honest, we're just gonna say your place is better for reasons\"",
                    "score": 21,
                    "replies": [
                        {
                            "author": "SmartQuokka",
                            "body": "On the plus side if they lose all their hair then they are achieving solidarity with the head shaving BORU.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "almostinfinity",
            "body": ">I, infact, did NOT get my sister pregnant\n\nWhy are people like this?",
            "score": 48,
            "replies": [
                {
                    "author": "KaetzenOrkester",
                    "body": "Peak Reddit.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "LuementalQueen",
                    "body": "\"I did not get my sister pregnant\" -sweet home Alabama stops with a record scratch-",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "istara",
            "body": "As someone who has been pregnant myself, Lily is an entitled fuck.\n\nI wouldn't have acted like that at nine months and feeling like a whale. I'd have bought my own bed or mattress.",
            "score": 60,
            "replies": [
                {
                    "author": "Corfiz74",
                    "body": "And isn't there a danger of incontinence, once the baby is big enough to push on the bladder? I wouldn't like a pregnant person to potentially leak onto my new mattress...",
                    "score": 20,
                    "replies": [
                        {
                            "author": "FlappityFlurb",
                            "body": "When I opened this up, that's what I assumed the reason was before I saw OP was a germaphobe. Like it's not abnormal for leaks to happen or if he lets her stay long enough she could have her water break. I'd burn the bed at that point and I'm not even the most hygienic person.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thebigeverybody",
            "body": "Certain things in my life have become so much easier since I just started telling people to fuck off. This situation would be one of them.",
            "score": 24,
            "replies": []
        },
        {
            "author": "CatmoCatmo",
            "body": "I would have loved for OOP to say to his sister, that if he allows her to sleep in his bed, then he wants something in return. Like her toothbrush. It looks so much softer than his. And her underwear. They are so much more comfty than his boxer briefs.\n\nAnd since his mom apparently thinks that you’re not being appropriately hospitable, and a jerk, if you don’t provide your guests with whatever they demand of you, I so wish he would have went to his parents and started demanding things. To wear his mom’s jewelry.  It’s just so pretty. To have her bath towels because they’re so much softer than his.  Her silverware because he likes the way they feel in his hand. What about the toaster? It just toasts so much better. \n\nI also love how the aunt said that when she was pregnant, her husband gave up their bed for her comfort and slept on the coach, so OOP should do the same. Yeah. Well. I’m willing to bet that HE helped to make that baby, and was also married to her. The situations are NOT the same and should not be compared as it’s kind of…gross.  Man. People?!?  Amirite?!",
            "score": 23,
            "replies": []
        },
        {
            "author": "th30be",
            "body": ">My aunt called to tell me that my uncle (her husband) used to sleep on the couch and sometimes on the floor next to her when she was pregnant.\n\nRemind me where OOP got his sister pregnant. What a very strange thing to say to someone.",
            "score": 25,
            "replies": [
                {
                    "author": "Cygnata",
                    "body": "Sounded like he was responding to comments or DMs.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beautiful_mistakes",
            "body": "I’m always shocked that extended family members are reaching out. Like I have 4 blood family members and they would never.",
            "score": 20,
            "replies": [
                {
                    "author": "MakanLagiDud3",
                    "body": "That's the definition of a flying monkey and blind family loyalty, sometimes it doesn't happen, sometimes you'll be questioning why the world hates you.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "LuementalQueen",
                    "body": "Simple, Lily exaggerated everything.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EvilFinch",
            "body": "When i read \"for a few weaks\" i just laughed. Did he really believe that she planned to move in just for a few weeks?\n\nShe tried to take over the main bedroom. Soon it would be \"it is so hard to find an apartment as an expecting mother. It is much easier for you to find one! So you mive out!\" She would try to take over his place, baby in the guest room and he lives as a guest in his own place.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Latter-Refuse8442",
            "body": "I think Lily's insistence on sleeping in others' beds is what landed her in this position. ",
            "score": 53,
            "replies": [
                {
                    "author": "Newgirlkat",
                    "body": "Savage! 🤣 But accurate 🤣🤣",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "firegem09",
                    "body": "r/angryupvote\n\nNow, take it and go! \n\n😂😂😭😭💀💀",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Consistent-Primary41",
            "body": "She be looking at OOP's bed the way Trump be looking at Greenland trying to annex that shit",
            "score": 115,
            "replies": [
                {
                    "author": "Anonphilosophia",
                    "body": "Lolol.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "peter095837",
                    "body": "That perfectly sums it up.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "gathayah",
            "body": "I straight up do not understand people who decide to show their posts to the people it’s about in order to prove their point. It always sets off my bullshit alarm. I can’t imagine ever doing that thinking it would turn out well. “Look, I aired our dirty laundry on the internet for literally anyone to see, and a whole bunch of complete strangers agree with me! Don’t you feel silly now?”",
            "score": 20,
            "replies": [
                {
                    "author": "artipants",
                    "body": "I'm honestly confused by the whole \"explain my side\" thing. Like OOPs side was basically just \"I don't want to\" right? That's a totally justified stance to take but what explanation could they give that would change their mom's view? Like did she think OOP offered it then changed their mind? It just seems such a straightforward situation that I can't begin to imagine what an explanation would even cover.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnooWords4839",
            "body": "Why the F does a pregnant sibling feel entitled to a bed they don't pay for?",
            "score": 15,
            "replies": []
        },
        {
            "author": "TOG23-CA",
            "body": "I know it's technically concluded but I think we all know that this isn't over",
            "score": 6,
            "replies": []
        },
        {
            "author": "DamnitGravity",
            "body": "Oh, this ain't over.",
            "score": 5,
            "replies": []
        },
        {
            "author": "grumpycat46",
            "body": "I'm gonna say it again STOP FUCKING TAKING IN PEOPLE EVERYONE, DON'T CARE IF IT'S FRIEND OR FAMILY JUST STOP, or be like this guy he's lucky most aren't most have to evict there own friends or family because they come in and take over your home, just stop say NO its not difficult",
            "score": 16,
            "replies": []
        },
        {
            "author": "juhamatti88",
            "body": "They were embarrassed when OOP showed them the post because they found out OOP not only uses Reddit but asks Reddit for advice, not because it made them see his side",
            "score": 8,
            "replies": []
        },
        {
            "author": "KitchenDismal9258",
            "body": "The only help I would give with moving her stuff is helping to load the truck she has organised with her belongings to take back to mom and dad's place.  But preferably it's a truck that comes with movers to load everything.\n\nThe only concession I would consider if she's not moving it all to mom and dad's is to help her friends pack the trailer/truck to move it to the storage unit she's organised.\n\nI would be doing very little to help as she sounds like she's the sort of person that would take a mile when you give an inch.... and constantly move the goalposts.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Ninja_Flower_Lady",
            "body": "Here's a life lesson I learned the (very) hard way: do not let anyone move into your space!!! Not without extremely careful evaluation of their character!!!\n\n\nIt's much much much harder to make them leave once they move in! This is made even worse if you live in a pro tenant city. People abuse squatter right and it can be such a nightmare to kick them out. \n\n\nIf the sister was acting so entitled, there must've been warning signs even way before this. OOPs first mistake was agreeing to let her move in.",
            "score": 6,
            "replies": []
        },
        {
            "author": "darsynia",
            "body": "I hate that his family tries to walk all over him but the answer isn't to avoid helping his pregnant/new mom sister move. That's going to inflate tensions a TON for not much moral superiority or distance.\n\nLOVED 'if you don't shape up we'll come get your sister' oh no pull my leg why don't you??",
            "score": 4,
            "replies": []
        },
        {
            "author": "Ok_Play2364",
            "body": "What are her plans after the baby comes? Lucky she went to your parents",
            "score": 1,
            "replies": []
        },
        {
            "author": "SteroidSandwich",
            "body": "And she wonders why she is a single mom",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrinaGu3",
            "body": "Anybody who calls let them know they are welcome to take her and let her sleep in their beds.  Beggars can’t be choosers, not even when they are pregnant.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SenioritaStuffnStuff",
            "body": "Listen....\n\nI'm an only child AND child free. \n\n\nI would rather take a late term tumble down the stairs before DEMANDING my family change their lives because of my choice! \n\nI'm glad the sister and mom seemed a bit embarrassed, but it's FAR too late to understand \"tacky\" behavior lol",
            "score": 0,
            "replies": []
        },
        {
            "author": "R0ihu",
            "body": "No wonder she's going to be a single mom...",
            "score": -2,
            "replies": []
        }
    ]
}