{
    "title": "I started washing and putting away my roommates favorite mug whenever she uses it. When she caught me I lied about why.",
    "author": "Choice_Evidence1983",
    "subreddit": "BestofRedditorUpdates",
    "rank": 5,
    "score": 2926,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 135,
    "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1jdwlnv/i_started_washing_and_putting_away_my_roommates/",
    "id": "1jdwlnv",
    "selftext": "**I am NOT OOP, OOP is** u/wearejustroomies\n\n**Originally posted to r/TrueOffMyChest**\n\n**I started washing and putting away my roommates favorite mug whenever she uses it. When she caught me I lied about why.**\n\n**Mood Spoilers:** >!wholesome, positive, and happy!!<\n\n------------------\n\n[Original Post](https://www.reddit.com/r/TrueOffMyChest/s/wYZHbB1kgC): **March 3, 2025**\n\nI (30M) share an apartment with my friend (30F), I'll call her Gwen.\n\nGwen has a lot of mugs, more than will fit in the cup cupboard all at once. So she rotates them seasonally, she loves swapping them out. I asked why and she says it's like getting new mugs every couple months. But there are two mugs in her collection that never leave the kitchen. They are rarely in the cupboard because the second they are washed she uses them again.\n\nWe have a dishwasher, but it's broken. Part of our chore division is that we each take care of our own dishes. The thing is I know she doesnt like doing her dishes, its a sensory thing, but she insisted that we do our own dishes and I thought that was pretty fair. I also know that Gwen's most favorite is her Spiderman mug. She's never told me that, I can just tell because the spiderman mug gets picked before any of the others when its clean. I know this because I see it in the sink every day for her to wash before bed with her other dishes from the day. There were times that her dishes sat for a couple days before she could force herself to work through the sensory issues and get them done. It never got to the point of smelling bad, and she apologized every time for any dishes she left overnight. I truly did not mind when that happened. I understand the sensory issues and I'm proud of her for keeping on top of it as much as she was.\n\nNow comes the part I need to get off my chest, the background info was important I promise! Every time Gwen realises she can use her Spiderman mug she dances an adorable happy dance while making her tea for the morning. She doesn't seem to realise she's dancing, or doesn't realise I noticed her dancing. Either way, it's my favorite part of the day when I am getting ready for work and she dances a happy dance while getting her breakfast because she gets to use her Spiderman mug every single morning. It's seriously cheers her up and she's been a lot more positive throughout the day since I started doing this.\n\nGwen found me washing her dishes last week. I had been doing them for a while, but this was the first time she walked in and caught me bubble-handed washing her Spiderman mug. Not gonna lie I panicked. She thanked me for helping her and then asked why I started to do her dishes too. She even asked if I was annoyed by her dishes when she left them. This was absolutely not the case, but I couldn't tell her I watch her happy dances, that's creepy right? But it's so cute and makes me so happy to see her so happy. If she knew I watched her dance she would feel self conscious and stop doing them. She's pretty shy about stuff like that. She won't sing in front of anyone, but singing is one of her favorite things to do and I've caught her singing along to her music before she realises I'm home more than she realises, I also pretend not to notice when that happens, she has a really pretty voice. So yeah, I couldn't tell her why I'm really doing her dishes or I would loose my favorite part of my day.\n\nI told her I like to get mine done every night, its something my mom always told me to do, I was already there so it wasn't a big deal to do hers too, it saves water and she does a few of the house hold chores that I hate because she likes them, so I don't mind doing this one tiny extra chore that she doesnt like. I feel like I was pretty obviously not telling the truth, but I think she believed me lol. She didnt tell me to stop and she hasn't brought it up since she caught me. So I still get to see her happy dances when she goes in the kitchen and sees her Spiderman mug ready for her to start the day.\n\nTl:Dr I wash my roommate's favorite mug every night to give her something to look forward to in the mornings. She does a little happy dance every time she uses her mug and it makes me happy to see her that happy.\n\n**Edit 1:** alright, I'm headed to bed, thank you all for your comments. To clarify we are just friends, we are roommates now, but we were friends first. Anyways, it's been fun, but it's 5 am and I have an appointment at 10 am. This should be fun! Good night!\n\n**Edit 2:** it is now 9am. I just woke up to so many notifications, jesus h christ what happened while I was napping? Thank you everyone for your responses. I did not expect my habit, that I thought would be seen as weird or creepy, to get so much attention. I'm so glad so many of you got a smile from my post, as you can tell, I like to give people a reason to smile. I hope you all have an awesome day!\n\n**Edit 3:** Guys she found the fucking post. SCATTER! No for real. She commented on this post, she made an account specifically to comment. How. How. How did this happen and how did it happen so god damned fast??? I didnt think she was on reddit! Shes always on youtube watching video games or listening to stories! She used a picture of The Mugᵀᴹ as the profile pic. I'm panicking. I'll update when I'm brave enough to go out to the kitchen. I can hear her cooking.\n\n**Edit 4:** so I linked a picture with an update and the automod did not likey. So I have removed the link, but the update is still on my profile, for anyone interested.\n\n**Relevant Comments**\n\n**Commenter 1:** this is honestly the sweetest thing ever. The way you go out of your way just to make her mornings a little brighter is top-tier wholesome\n\n> **OOP:** It seems like such a little thing to do, just an easy ten minutes, if that, for me and her whole day is better.\n\n**Commenter 2:** You're both good room-mates, I'm so proud of you both! It's not easy getting along with someone in your space.\n\n> **OOP:** I've never been as happy at home as I am with Gwen. She's so easy to live with, and any problems we have had we have been able to talk over and resolve. It's almost too good to be true, but we do bicker a lot, I make fun of her for wearing crocs nearly 24/7 and she laughs every time she hears me swearing at my bed after I stub my toe on it. I do that at least twice a week, I am an idiot lol!\n\n**Commenter 3:** Well after all the awful crap that I come across on Reddit every single day, a post like this is so refreshing.\n\nOP, this is adorable. Does Gwen know you're in love with her? Because she should.\n\n> **OOP:** I mean we say I love you to each other when we leave the apartment, but we are just friends.\n\n**OOP explains why he says I love you**\n\n> **OOP:** One of our friends passed away a few years ago, it almost ended our whole group. His house was the hang out spot, he liked to do the planning for things, he kept us together by being the person we all wanted to be around. Losing him was the hardest thing ive gone through, we were like brothers. So now we all make sure to tell each other how we feel, we ask for help when we need it and we always always say love you instead of goodbye.\n\n**How did OOP and Gwen meet?**\n\n> **OOP:** We met through a mutual friend group and when we realised we were both looking for a place to live and we got along really well it just made sense. So far, it's paying off.\n\n&nbsp;\n\n[Update #1](https://www.reddit.com/u/wearejustroomies/s/GNd7pRRDet): **March 3, 2025 (same day, nine hours later)**\n\n[Pic of the 2 mugs](https://imgur.com/a/LgsJQSA)\n\nAnd wait for it.... Update!\n\nI can't actually post an update in trueoffmychest so soon after my first post. So here's a small update. We talked a little bit over breakfast, I'm officially a fan of tea now lol. She thinks I'm an idiot and I agree, but she's not mad about the post or about me creeping on her mug inspired happy dances.\n\nAll said and done, I think making that post was the best 5am decision I've ever made. Gwen says hi everyone 🩷.\n\n**Relevant Comments**\n\n**OOP's thoughts on Gwen**\n\n> **OOP:** I was watching her work in the living room today and it kinda just made me realise why I feel different, but also completely the same. I still have the same feelings of friendship, but it's like going from a familiar room to another room that's bigger, but it has the same paintings as the first room, there's just more wall space for more paintings now. I hope that makes sense, I said it to Gwen and she asked if I was high lol!\n\n&nbsp;\n\n[I'll just leave this here 😏](https://www.reddit.com/u/wearejustroomies/s/t1dxp9JSrN): **March 3, 2025 (same day, seven hours later)**\n\n[Pic of a chat exchange](https://imgur.com/a/6mlevio)\n\n**Transcript of the chat**\n\n**Outrageous-Can6185:** You're a dork.\n> \n> I made you tea for after your zoom call.\n>> \n>> **OOP:** What mug is it so I know how this is about to go down*\n>> \n>>> **Outrageous-Can6185:** \"Snoo smile\"\n>>> \n>>> The pumpkin one\n\n**Relevant Comments**\n\n**Commenter 1:** Wait for real???? Are you together now?? Cuz boy, you have fallen hard!!!\n\n> **OOP:** The pumpkin mug is her second favorite, if that tells you anything and it should.\n> \n> I can neither confirm nor deny what conversations were had over our tea and toast this morning 😏\n> \n> For real though, we are going to do an update, we want to have more time to discuss things and figure out where we land and we will post an update once we feel more comfortable. The fallout from this post has been a lot to handle on top of trying to figure out how to share without oversharing, we are usually pretty private people. I never imagined my silly post about doing the dishes would end up changing so much, but I wouldn't change a damn thing.\n\n**Commenter 2:** Congrats king 👑 y’all are meant for each other (non of ur mugs better out do her favorite mug).\n\n> **OOP:** I'm more of a water bottle guy, the mugs in the house are all hers so no risk of mug competition. Although I might order her a custom one for a special occasion some day but never with the intention to make her change what her favorite is.\n\n&nbsp;\n\n[Update #2](https://www.reddit.com/r/TrueOffMyChest/s/o8lwAzMZ1z): **March 5, 2025 (two days later)**\n\nGood morning yall! A couple days ago I made a post at 3 in the morning to confess to doing my roommates dishes because I secretly love to watch her do a happy dance when she sees her favorite mug is clean for her to use again. That post changed our lives and I'm only being a little dramatic by saying that.\n\nI gotta say thanks to everyone who upvoted and commented on my original post, I'm still shook at just how many people read about me and my mug happy best friend. The amount of people saying my post made them smile or reminded them of their own friendships or significant others has kept me smiling for days. I'm kind of into making people happy, if that wasnt already obvious, so the fact that so many people had even a moment of positivity because of me has been awesome.\n\nWhen I made that original post it was because I just wanted to tell someone about the mug dancing but I knew Gwen wouldn't like it if I told anyone we knew so I came to reddit to shout to the void and oh boy, did the void shout back. There were so many comments asking if I really thought we were just friends, and I'll be honest when I made that post we absolutely were just friends. We had never talked about being more than friends and I was happy being friends because we have an amazing friendship. I hadn't really thought about there being a possibility for more because dating was always something I planned to do when I had my life together or when I had more money. I never let myself consider what I was missing out on by waiting for the \"right time.\" \n\nHer finding my post opened up the chance for Gwen and I to talk about things that we hadn't before and over breakfast that morning we found where we stood with each other and what we thought things could look like moving forward depending on what we both agreed was the best course. We didn't make any solid plans or decisions and didn't want to rush into something that would ruin the good we already had going for us, but I'll admit I was hoping for a specific outcome.\n\nThere was one comment on that first post that had really caught my attention. To paraphrase, they told me to think about how I would feel if someone else got to see Gwen do her happy mug dance instead of me and it hit me so hard. I didn't mind the idea of someone else seeing her so happy. I just dont know if anyone she dates would notice what I did and decide to do what I did. What if they didn't care or didn't think it was that important or any of the other things I do to make her laugh or smile. I really didn't like the thought of not being there to make sure she has that extra reason to smile in the morning. (Gwen wants me to admit that I'm a sappy moron because I teared up writing this. Im a sensitive man in touch with my emotions and you know you love it so shut it you 😝.)\n\nTo all the people saying it's possible for platonic relationships to be like ours you are absolutely correct. Our friend group is very open with physical and verbal affection and we help each other all time with big and small things. We all say I love you to each other, it's just normal communication for us as a group, not just between Gwen and I. Honestly, if I hadn't made my original post I'm not sure when or if we would have gotten to the point we are now. Maybe we would have continued as we were and that would have been just as happy of an outcome, just a different one, like a choose your own adventure with multiple options for a good resolution.\n\nWhich brings me to the actual update. Gwen and I agreed we want to try dating. We aren't putting a new label on our relationship yet, but our first date is next week. I'm making it all a surprise. Gwen helped write this post and will be reading the comments so I can't give any details, but it's going to be the best first date she has ever been on, or I'll eat my candy corn patterned socks. I think she might be the one for me and I'm going to take every chance I can to make sure she thinks the same about me.\n\nYall are the best and we love you. Do something kind for your loved ones for us and everyone can and should find something to happy dance about, it makes life more fun.\n\nLove Gwen and Peter  🩷 🕸.\n\n**Relevant Comments**\n\n**Commenter 1:** Yippieee it finally happened!! I'm so happy for you two, and kinda jealous too (I have a friend that makes me really happy but the chances of us dating is close to zero so...).\n\nI hope everything goes well for you two and please promise me and specially her that, if it doesn't work, you'll remain being friends because your relationship is really pure!!\n\nThank you for the update!!!\n\n> **OOP:** Yeah we're definitely being very cautious about taking this step. There will be lots of conversations and checking in to make sure we don't mess things up.\n\n**Commenter 2:** The only thing I can say to both of you is this:\n\nYou have a charming innocence around you. Don't take it for granted. Be aware of it, treasure it, and nurture it. This doesn't have to end and it can get better. Always assume the best of each other, be kind, and don't be passive-aggressive or hold grudges.\n\n> **OOP:** We both come from pretty dysfunctional families. Half of hers don't even talk to each other and I haven't seen my mother in years, thank the lord for small mercies lol. So when we agreed to be roommates respectful communication became our top priority.\n\n**Commenter 3:** This isn’t quite on topic, but OP, how did you find such an empathetic and close group of friends? I have always wanted that but have a hard time connecting with people. It sounds really wholesome.\n\n> **OOP:** So the people who started our group were three buddies, they were friends all through middle and high school and stuck together after. Everyone else has been added to the group after being \"vetted\". We invite people to hang out a few times with the group, if we feel they would be a good fit we keep inviting them. It's a bit like a club, but doing it this way makes sure only people who mesh well enough with everyone are added. Gwen was already pretty much part of the group when I was invited to a movie night, that was the first time we met. I can't tell you how to meet people that youll connect with, I'm sorry. The person who invited me was someone I work with, we went for drinks after work a couple times before she asked if I wanted to go to a movie night her friends were planning and I didn't have anything better to do. You just need to be willing to talk to strangers until they aren't strangers anymore and see if they are someone you think would be a positive influence in your life.\n\n**OOP gives advice on relationships**\n\n> **OOP:** The best advice I can give you is to want change. If you aren't happy, for the love of all that's holy, CHANGE. Sit down with your partner and say you aren't happy and that things need to change. Figure out if you want to change together and be a team against the issue or if things would be better off with you going your separate ways.\n> \n> Ending a relationship does not erase all the good times you've had with them, but it opens the door for the potential of new good times with someone else.\n\n+\n\n> It will only get harder the longer you wait. You deserve peace and happiness, even if it means it's not with this person. They also deserve peace and happiness, I wonder if you approach it from that angle of saying you are unhappy and you feel like they are unhappy too and you want to team up to figure this out. The more you wait the more you build it up in your head to the point where you'll feel it's not worth trying. You are worth it, they are worth it.\n\n&nbsp;\n\n**DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n**THIS IS A REPOST SUB - I AM NOT OOP**",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CatmoCatmo",
            "body": "I remember this one, and the update. I was 100% not surprised when the update dropped, but I was so glad that the way I imagined it would end up, came to fruition.  \n\nI mean, we ARE on Reddit, and there was a chance that she could have found out about his post, called him a creep, and filed a restraining order after abruptly moving out. However, OOP was too adorable and I desperately wanted them to end up together so that in 50 years, someone could ask him about his definition of paradise and he can reply, “This morning with her, having coffee, watching her do her happy dance when she thinks I’m not looking.”",
            "score": 1756,
            "replies": [
                {
                    "author": "W0nderingMe",
                    "body": "TEA.",
                    "score": 264,
                    "replies": [
                        {
                            "author": "tacwombat",
                            "body": "the **TEA**",
                            "score": 68,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Reluctantagave",
                    "body": "It’s cute and I love this update. Reddit is crazy and expects drama but sometimes, people are just people. Your last sentence reminded me of a Johnny Cash quote  “this morning, with her, having coffee” about happiness and his relationship with June Carter Cash. (Though yeah they each did some not great things to be together). \n\nI married my best friend so I hope these two work out, either as a couple or best friends!",
                    "score": 69,
                    "replies": []
                },
                {
                    "author": "DrSocialDeterminants",
                    "body": "Don't get your hopes too high up... we could be seeing the divorce update followed by hitting the gym and deleting Facebook. Then some legal battle for kids and some sibling keying a car followed by assault and arrests.",
                    "score": 89,
                    "replies": [
                        {
                            "author": "Travel_Jellyfish_5",
                            "body": "I'd like to live in the cute happy world the other poster described & not this rather specific sad one that you painted.",
                            "score": 148,
                            "replies": []
                        },
                        {
                            "author": "wrymoss",
                            "body": "I dunno, you can usually see the warning signs in those kind of outcomes. \n\nOOP seems really self-aware. Like. Even his worries about Gwen dating someone else aren't to do with losing her, they're to do with someone mistreating his awesome friend. \n\nHe's also pretty empathetic, willing to be sensitive, willing to acknowledge when he's wrong, and adjust his understanding of a situation according to new information. \n\nI reckon they've got all the foundations you need to build a rock solid relationship.",
                            "score": 105,
                            "replies": [
                                {
                                    "author": "AshamedDragonfly4453",
                                    "body": "\"OOP seems really self-aware. Like. Even his worries about Gwen dating someone else aren't to do with losing her, they're to do with someone mistreating his awesome friend.\"\n\n\nThis. This exactly. I already suspected he's a good egg from all the other wholesome stuff, but that part absolutely confirmed it for me.",
                                    "score": 65,
                                    "replies": [
                                        {
                                            "author": "zootnotdingo",
                                            "body": "I agree. Good egg 🥚",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Inactivism",
                            "body": "I dated my best friend for a year and we realised through trying very hard we are not a match in that area and now he is in a very happy relationship with a man and we are still best friends and hug and cuddle every time we see each other :). It can have a happy ending even if it doesn’t work.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "bloodbeardthepirate",
                            "body": "Delete gym, hit lawyer, Facebook up",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "True_System_7015",
                            "body": "The kids will of course be twins, and there's gonna be a MIL that pops up and tries to be in their lives and tries to get grandparents rights. And then once MIL is told no, she'll start screeching on the porch and all of it will be captured in crystal clear and perfect sound and visual quality from the doorbell camera",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Must_Love_Dogs0331",
                            "body": "Okay party pooper.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bytegalaxies",
                    "body": "that would be a huge and stupid overreaction lmao, there's nothing weird about OOP enjoying seeing his friend being happy (even if he did also have feelings for her lol)\nI often enjoy seeing my friends be happy too",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Stormy8888",
                    "body": "Dude, if OP's real name is Peter and he's dating his roommate Gwen, over Tea. I'm going to die.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "juhamatti88",
                    "body": "I'm eagerly awaiting the update where OOP discovers Gwen's necrophilia porn folder and gets harassed and stalked by her when he tries to bounce",
                    "score": -16,
                    "replies": [
                        {
                            "author": "evanthx",
                            "body": "Jokes on you, turns out he’s also into it!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cest_Cheese",
            "body": "You know it is love when \nA) he knows her favorite mug by observation\nB) he is not bothered by her having too many mugs for the cupboard \nC) he is not bothered by her not doing her dishes \nD) he does her dishes to make her happy \nE) her happiness is his happiness. \n\nLog off Reddit folks.  This is as good as it gets.",
            "score": 1070,
            "replies": [
                {
                    "author": "MalAddicted",
                    "body": "A friend of mine asked me to go see a movie with him because he remembered from six years prior a casual conversation about liking the series it was based off of and liking the main actor in something else. It was such an offhand conversation that I'd forgotten we talked about it. Just tv shows we liked back in the day. But he remembered and made note of it, and wanted me to enjoy it. \n\nWe've been together for 12 years now, married with a toddler. And he still notices and finds ways to bring joy to my everyday. I'd say he's my best friend before he's my husband. I hope it's the same for these people.",
                    "score": 237,
                    "replies": [
                        {
                            "author": "Dramatic_Buddy4732",
                            "body": "Haha he sounds like my husband. I actually have to be careful sometimes because if I have a random craving for like grapes say, and I offhandedly mention it, there will be grapes in the fridge next time he goes to the store.",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "Cest_Cheese",
                                    "body": "My husband of 25 years does the same thing. But he does get annoyed when I leave dishes in the sink now.",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SquashaKitty",
                            "body": "Definitely sounds like my husband. I knew he was the one during one of our stay-in date nights. We'd ordered takeout, sat down to eat, and he turned on some music. After the first couple of notes I realized he'd turned on a playlist of my favorite modern composer, and it was my favorite piece. I swear I could have only mentioned the composer's name and the name of the piece maybe twice, but he remembered. \n\nTogether seven years in May, married for just shy of 19 months now.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "morbidconcerto",
                            "body": "Funny story, my now husband and I originally met up to be friends with benefits and see where it went from there. \n\nWe began talking at the end of September and finally met up in person towards the end of October. By mid-November we decided we wanted to be exclusive but didn't want to label anything just yet, and then at the end of November my birthday rolled around and he planned a surprise for me. \n\nWe had spent part of the day at a big nature preserve with a few of our friends, where we hiked around and had a picnic. I was tired when we got home so I decided to take a nap. I woke up and he asked if I was hungry, to which I said I was, and he told me to wait there in the bedroom and come out in 5 minutes. I was a little confused but also amused by how cute he was being so I waited and then headed to his dining room. He had set up a premium sushi and sashimi platter, brewed fresh gunpowder green tea, and had a little dish of pomegranate pearls set up to have afterwards. \n\nIt was so deeply touching and moving to me that he'd remembered not only all of the things I enjoyed, but had went through so much effort, that I actually froze with happy tears running down my face. I knew at that moment that I loved him and wanted to be with him forever... we'll be celebrating 10 years together this December 🥰",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mellow-drama",
                    "body": "I'm glad it worked out for them. When my roommate moved in I noticed (since I work from home and my bedroom is next to the bathroom) that he always kind of absently sang to himself while he peed. I thought it was funny and charming and didn't think too much about it. One day I mentioned it to him offhand and he got really embarrassed and I've never heard him pee-singing since. I feel bad that I removed some joy from his life and made him self-conscious about something that isn't a big deal.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Explosion2",
                    "body": ">You know it is love when \n\n(Proceeds to list 5 things that also apply if he's secretly a creepy stalker type)\n\nI'm glad it worked out but this absolutely could have gone the opposite way and he's lucky that he's attractive enough to avoid the creeper allegations.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mochiimin",
            "body": "\"Gwen and Peter\" 🥹 this was so cute",
            "score": 343,
            "replies": [
                {
                    "author": "wahlburgerz",
                    "body": "It took me until that sign-off to realize why he chose to call her Gwen 🤦",
                    "score": 152,
                    "replies": [
                        {
                            "author": "Justokmemes",
                            "body": "I got two lines in and I saw Gwen and Spider-Man, my mind immediately went there lol. Granted I'm a big Spider-Man fan lmao",
                            "score": 78,
                            "replies": [
                                {
                                    "author": "thechristoph",
                                    "body": "I hope we don't get an update about Gwen's tragic demise in a Goblin-related incident. :(",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "violue",
                            "body": "it took me until this comment",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Trick-Statistician10",
                                    "body": "Me too.  No excuses, I'm on my 2nd coffee.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "True_Face8631",
                                            "body": "Check my dm pls",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PuffballDestroyer",
                            "body": "I noticed it once I got to the end, and as cute as it is, I cannot help but think how that particular love story ended. But I guess Mary Jane would have been too obvious.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "marquisdc",
                    "body": "I was hoping someone else caught this.",
                    "score": 42,
                    "replies": []
                }
            ]
        },
        {
            "author": "occultatum-nomen",
            "body": "The part that I found most wholesome is that thinking about someone else seeing her happy dance didn't make OOP jealous, it made them dismayed at the idea of someone not celebrating her joy and seeing it as something wondering \n\nJealousy and possessiveness is thinking about yourself first. OOP's first thought was about Gwen's happiness. That's wholesome as fuck, and whatever the two of them become, that's being a good and caring friend.",
            "score": 312,
            "replies": [
                {
                    "author": "PrincessCG",
                    "body": "Honestly that part was so sweet. I’m rooting for those crazy kids.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "Luffytheeternalking",
                    "body": "Ikr. OOP is such a wonderful dude.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "LadyCheeseWater",
            "body": "Caught me bubble handed would make an excellent flair.",
            "score": 108,
            "replies": [
                {
                    "author": "LittleMsSavoirFaire",
                    "body": "Honestly, catching a roommate bubble handed, cheerfully doing MY dishes and cleaning the kitchen before bed would give me pants feelings regardless of their gender. ",
                    "score": 33,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cabbagetastrophe",
            "body": "And They Were Roommates",
            "score": 219,
            "replies": [
                {
                    "author": "ReflectionNah",
                    "body": "Oh my god, they were roommates",
                    "score": 140,
                    "replies": [
                        {
                            "author": "user37463928",
                            "body": "What is this referring to?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "welcometoflavorcity",
                                    "body": "[this](https://youtu.be/S0iM3bkkpbI?si=H7AjBO8oIGJf58Sr) famous vine from years ago",
                                    "score": 43,
                                    "replies": [
                                        {
                                            "author": "MsDucky42",
                                            "body": "Obligatory \"I Miss Vine\" reply",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "IncompetentPolitican",
                                    "body": "History. Back in the olden days it was expected that a woman gets together with a man, they live together and have children. Some people prefered not to do that. For them it was lucky that at some point the people decided that living with roommates is ok. Just before they find someone to marry and all that. This resulted in some women (and I am sure men too) to live with \"roommates\". Some of them had so little money, they had to share the bed! Or thats how I read it somewhere where someone better at history then me explained it. \n\nAlso Historians try to avoid labeling things in any way that is not proofable. So if you have two people living together, refering themselfs always as roommates and never mentioning beeing in any other kind of relation, then historians will refer them as roommates and maybe mention existing rumors about their relationship.",
                                    "score": -14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nonnumousetail",
                    "body": "This is what I was thinking of the whole time! I had to scroll too far to see this!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gwynasyn",
            "body": "This is too wholesome and I choose not to question things I would normally question because I want this one to be true.",
            "score": 163,
            "replies": [
                {
                    "author": "moreisay",
                    "body": "FWIW my friend is getting married this summer to her roommate that she found on Craigslist!  It can happen!",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "shelstropp",
            "body": "Not even 7am here. That's enough reddit for the day.",
            "score": 35,
            "replies": [
                {
                    "author": "TwoFlower68",
                    "body": "Right? Here I am all teary-eyed and I haven't even had my coffee yet (in my favourite mug, the one from which I used to drink milk some 50 years ago lol)\n\nEdited to add picture of the mug: https://imgur.com/gallery/pEw5lpC",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "pandanitemare",
                    "body": "Put down reddit before it has the chance to ruin your day today, this post is all you need lmao",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "LittleMsSavoirFaire",
                    "body": "Right? We're done here. Have a good day, everybody! ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "peter095837",
            "body": "Okay now this is the best time to close my computer now. This is the good ending I want!",
            "score": 147,
            "replies": [
                {
                    "author": "gooberdaisy",
                    "body": "I fully concur. Good night Reddit and happy dreams.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "shadow_dreamer",
                            "body": "Goodnight Reddit, sleep well all!\\~",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "I_Gotta_Know_01",
                            "body": "ditto ditto! G'night!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "theluggagekerbin",
                    "body": "yup this is it for today. goodbye reddit",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "DonkeyAndWhale",
                    "body": "But somewhere else in the world a new day has started. But I'm definitely off Reddit for a few hours. This was so wholesome!",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "tipsana",
            "body": "“She found the fucking post. SCATTER!” is flair worthy.",
            "score": 28,
            "replies": []
        },
        {
            "author": "DrSocialDeterminants",
            "body": "D'awwwwwwwww",
            "score": 21,
            "replies": []
        },
        {
            "author": "Mr_Hugh_Honey",
            "body": "\"For all of the people saying it's possible to have a platonic relationship like ours, you're absolutely correct....with that said, we are now dating.\" LOL",
            "score": 18,
            "replies": []
        },
        {
            "author": "wintyr27",
            "body": "it's really important, in any relationship, to be invested in the other person's happiness, even if it's just for getting a good grade in friendship (a thing that is normal to want and possible to have). one of the things my parents raised me with was the saying \"if it's easy to make someone happy, do it.\" sometimes that means watching anime with your little brother even though you're not really in the mood, but sometimes it means noticing your roommate's favorite mug and washing it every night so they can use it in the morning. (it also helps me with self-care somehow??)",
            "score": 16,
            "replies": []
        },
        {
            "author": "JJOkayOkay",
            "body": "That was super-sweet, and doubly-so for how unaware OOP was of how obviously in love he was.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Helpful_Librarian_87",
            "body": "I Love his room metaphor.",
            "score": 10,
            "replies": []
        },
        {
            "author": "HopefulTranslator577",
            "body": "And they were roommates.",
            "score": 11,
            "replies": []
        },
        {
            "author": "SupportStandard6918",
            "body": "When you find someone that loves the things about yourself you find dorky you keep them, either  friends or lovers either way you keep them cause that’s something you need in your life. ",
            "score": 10,
            "replies": []
        },
        {
            "author": "Southern-Interest347",
            "body": "I totally fancy this OP! ",
            "score": 8,
            "replies": []
        },
        {
            "author": "ThatBitchDoe",
            "body": "I’m smiling like an idiot while reading this",
            "score": 7,
            "replies": []
        },
        {
            "author": "Thorolhugil",
            "body": "Gwen's comments on the thread are iconic. Such wholesome gremlin behaviour. 😅\n\nOutrageous-Can6185\n\n>hes such a sap right?  \n\\[...\\]  \n\"just roomies\" lmfao  \n\\[...\\]  \nDon't worry I'm not letting him get away",
            "score": 7,
            "replies": []
        },
        {
            "author": "Consistent-Primary41",
            "body": "I was hoping there was a new update. I think we're all pretty invested in this one.",
            "score": 11,
            "replies": []
        },
        {
            "author": "charmurr",
            "body": "\"Caught me bubble handed\" love this guy.",
            "score": 5,
            "replies": []
        },
        {
            "author": "beachpellini",
            "body": "That's so wholesome... 🥺",
            "score": 6,
            "replies": []
        },
        {
            "author": "napincoming321zzz",
            "body": "I'm about to go to sleep, and this post is so sweet I'm sure I'll be waking up with new cavities tomorrow.",
            "score": 7,
            "replies": []
        },
        {
            "author": "featherbrainedfeline",
            "body": "I know this isn't the main point of the post, but this in one of his comments is just such great advice, regarding finding friends: \"Be willing to talk to strangers until they're not strangers anymore.\" I've never seen \"Talk to people!\" worded like that, and it's so much more helpful. No wonder OOP has a great group of friends!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Key_Break_9312",
            "body": "Is there a Spider-verse where Gwen and Peter get together and stay happy? I'm rooting for this to be in that one.",
            "score": 8,
            "replies": []
        },
        {
            "author": "whittenaw",
            "body": "If this is the last reddit post I ever read, I'll be satisfied. Not in the toxic kind of way, but the happy way.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Justokmemes",
            "body": "Yup, this is where I sign off. Happy for these two!😊",
            "score": 3,
            "replies": []
        },
        {
            "author": "Niitroglycerine",
            "body": "I was like 20% through and thought to myself I wonder if he knows he's in love with her lol!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Newgirlkat",
            "body": "She caught him bubble handed 🤣🤣 that is SO ADORABLE! I love this whole post",
            "score": 3,
            "replies": []
        },
        {
            "author": "CatPurrsonNo1",
            "body": "This is making me smile a big, sappy grin!\n\nI have been all over Reddit talking about the crush I have on my roommate. It’s toned down a bit, and now I’m just really happy to be living with my best friend and enjoying his company and (most of) his quirks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "raebz12",
            "body": "Alrighty. And now that I’ve got a dopey smile myself, it’s time to turn off Reddit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gryffindor123",
            "body": "Ooft.. I just kinda got dumped and this hits me in the feels.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeanXeL",
            "body": "Gwen and Peter??? Oof, she's gonna fall of a bridge, isn't she?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Final_Soil_8801",
            "body": "This made me happy",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ohio_gal",
            "body": "Nothing on Reddit is going to be better than this today. I’m closing the app heart full! I hope everyone has a great day!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nogoodatnuthin",
            "body": "This is so wholesome. I fwd to my wife, because she does the same thing when she eats. On the weekends I wake up early and make her grilled cheese while she sleeps. Then I put it on a plate and set it next to her on the bed and give her a kiss on the forehead. More often than not she'll wake up and smile. She'll then come out eating it and do a little happy dance every time she takes a bite. It's the best moments of every one of my days.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tacwombat",
            "body": "Peter and Gwen are adorable AF and I wish them all the happiness.\n\n(Also, this is the second post I've read today from BORU and...I may or may not face regrets in reading the other posts for today.)",
            "score": 2,
            "replies": []
        },
        {
            "author": "dieselgirlpdx",
            "body": "Ok this is a perfect time to get off the internet and just sit with this joyful update.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ashleybear7",
            "body": "This was an adorable way to start my day…. I’m stopping here for now😅",
            "score": 2,
            "replies": []
        },
        {
            "author": "RiddleViernes",
            "body": "Y´all this post is gonna end up in \"most wholesome of 2025\" in this sub next year.",
            "score": 2,
            "replies": []
        },
        {
            "author": "standrightwalkleft",
            "body": "As someone who eventually married my roommate I fully support this\n\n(It's not a common way to meet your spouse. But knowing how you live with someone platonically before you live with them romantically is very useful information, if it does happen to work out!)",
            "score": 2,
            "replies": []
        },
        {
            "author": "LadyNorbert",
            "body": "This is *so precious*",
            "score": 2,
            "replies": []
        },
        {
            "author": "Flimsy-Wolverine-663",
            "body": "Does Gwen have brain damage? Or does she think household brownies washed her mug? If there are two of you, and she doesn't wash her mug, does her \"happy dance\" indicate she thinks her prayers were answered, or magic is real?",
            "score": 5,
            "replies": [
                {
                    "author": "AlwaysInTheWay13",
                    "body": "I have ADHD and can tell you with certainty thatit would take me a long while before coming to the realization that “oh hey, I didn’t wash this. Someone else is doing it.” I would see my mug, be pleased it’s there to be used and take it without thinking about how it got there or how many days in a row it was used. If it wasn’t every day and maybe just half of the time, I could really see it taking me a month or more",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MoonManPrime",
                            "body": "My freshman roommate took until second semester to realize the ice tray did NOT refill itself, I just did it every night before I went to bed. I was/am an unrepentant night owl and he was invariably asleep before me. By the time he next needed ice, the tray was always full and frozen and he just never questioned this until he stayed up with me late one night. We were drinking and talking, he went to get ice for his drink and remarked, “Oh, something must be wrong with the freezer. There’s no ice.” I said, “Oh, I finished it off and haven’t refilled it yet.” Blew his fecking mind. I asked how he thought ice trays worked and I could see the gears turning, hahaha. He quipped something about it just happening and must be freezer elves. Oh, I love that man.\n\nUnrelated: He lost my rug and umbrella that year too. And pissed in his closet sleepwalking. Best roommate I’ve ever had except the one that just wasn’t ever there.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FeetOnGrass",
            "body": "Have I gotten too cynical, or does anybody else think he knew she would see this and manipulated the whole situation and it's cringe?",
            "score": 5,
            "replies": [
                {
                    "author": "TheTetrisHeel",
                    "body": "I got your back on this one, my friend.\n\nI also don’t think there are two people truly this dense and the whole thing feels rather contrived. But if it made lots of people happy and feel nice reading it, I have no problem with it.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "NUNYABIX",
                    "body": "I thought the initial post was really cute but the update had me wondering if it was real for a few reasons.  I'm also curious why you would edit a post to say THEY FOUND THE POST Y'ALL that will always make me do a double take cause why would you update the post to say that, what's the intention except to get strangers more invested in the story. Happy for them if it is real.  Side eyeing if it's not",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "fishebake",
            "body": "This is a good one to end the night on.",
            "score": 2,
            "replies": []
        },
        {
            "author": "charliesownchaos",
            "body": "This is so cute, this is the only one I'll be reading for now, I'm logging off.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SmartQuokka",
            "body": "This is so adorable 🥹",
            "score": 1,
            "replies": []
        },
        {
            "author": "the-first-98-seconds",
            "body": "everything was great here except the font in that screenshot, wtf was that",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emergency-Twist7136",
            "body": "Well if that isn't just the sweetest thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ro536ud",
            "body": "I was gonna comment “and they were roommates”\nWhen I first read the beginning since it was obvious he was in love with her but then walah, it happened. I do love how he thought they were just friends tho.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ecosynchronous",
            "body": "> What if they didn't care or didn't think it was that important\n\nOhhh it's raining on my face....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guilty_Ordinary1730",
            "body": "My man",
            "score": 1,
            "replies": []
        },
        {
            "author": "seensham",
            "body": "Can I be part of OOP's friend group? They sound so good 🥹",
            "score": 1,
            "replies": []
        },
        {
            "author": "LampLambisalu",
            "body": "As a fellow sappy moron, I've got to say that being completely enamoured by her *daily* adorableness is a bit much. That's a legit crush. Which, to be fair, can be difficult to acknowledge for oneself. It usually requires direct declared interest to completely reframe how you view the other person. Only then will you start to realize that oh fuck, idk, maybe.\n\nBet it was Gwen who saw that as an in and just straight up asked him when are they finally going on a proper date.\n\nPete would've never realized it on his own. And I get why. Women are cute *all the fucking time*. So that's nothing out of the ordinary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hellboundroar",
            "body": "Man, the updates made me think of the song \"Boop\" from the RWBY ost",
            "score": 1,
            "replies": [
                {
                    "author": "gem_scheltema",
                    "body": "Hold my Spider-Man mug, I think I'm gonna faaaaaaaint",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bhamv",
                    "body": "> I think oh whoa what am I to do  \n> I didn't know that I would fall in love with you  \n> And what to do right now I haven't got a clue  \n> I just bite my tongue and when I want to say I love you  \n> I wash your mug",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Hellboundroar",
                            "body": "\"like it's the same but brand new\"",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Limp-Razzmatazz-5265",
            "body": "What happened to the comments in here lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nyoteng",
            "body": "What an excuse “I can’t do the dishes because I have sensory issues”",
            "score": -16,
            "replies": [
                {
                    "author": "Elinor_Lore_Inkheart",
                    "body": "She still did them, it wasn’t an excuse for her to get out of the chore. I absolutely can not stand using dish sponges and touching old food on plates. I was an adult before I could do both without exerting significant effort to stay calm. Rotting food also really bothers me. Not caused by trauma or anything, it’s just something that really bothers me. I now have gloves (which also bothers me but not as much) and use dish brushes and scrapers as much possible. I also use cast iron for cooking, partially because you can use chainmail to clean without causing any damage. \n\nI honestly appreciate and am glad that you’ve never hyperventilated and fought back tears while doing dishes. I did, and forced myself to keep going because it needed to be done. It’s frustrating and embarrassing. Some strong, hardworking, and very capable people do, it is what it is.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "violue",
                            "body": "God when my cat died ten years ago I buried her behind the house but didn't think about the fact that I was putting her right smack in the eyeline of the kitchen window. So this activity I already found weirdly stressful became \"staring at my dead cat's grave\" time for *years*.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "bnenbvt",
                            "body": "I don't even have sensory issues, and I still think dish sponges are really gross. Scrubber brushes all the way.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TwoFlower68",
                    "body": "Be happy you don't have them. In my experience just about every ND person has sensory issues. Cotton wool and some types of fleece fabric for me",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "tac0bill",
                    "body": "> What an excuse “I can’t do the dishes because I have sensory issues”\n\n\n\"Someone else has issues I don't understand and I'm an unempathetic douchebag.\"",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Nyoteng",
                            "body": "100% what the fuck of an excuse is that.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "tac0bill",
                                    "body": "You sound like someone whose ex has a restraining order.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Nyoteng",
                                            "body": "You sound like you can't walk 3 steps outside without fainting.",
                                            "score": -9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}