{
    "title": "Looking back at how Nintendo pitched the original Switch",
    "author": "cubechris",
    "subreddit": "NintendoSwitch",
    "rank": 8,
    "score": 312,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 58,
    "url": "https://www.polygon.com/nintendo/540331/nintendo-switch-original-pitch",
    "id": "1jdpa2m",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Heads up! r/NintendoSwitch is currently collecting nominations for our 2024 Games of the Year! \n\n* Name and vote on your favorite games [in our nominations post](https://www.reddit.com/r/NintendoSwitch/comments/1hzg4kp/2024_rnintendoswitch_goty_nominations_thread/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dukemon102",
            "body": "That original announcement trailer perfectly showed what the console was all about. It's a handheld console that you can take with you, play in handheld, then when you arrive at home you can dock it, remove the controllers and play on the TV.\n\nSimple to understand and attractive as a concept, as well as useful on practice. Nothing like those Wii U trailers where it was never clear what even was the purpose of the Gamepad (Because not even Nintendo knew) or if it was even a new console at all.",
            "score": 259,
            "replies": [
                {
                    "author": "wisdomoftheages36",
                    "body": "Gamepad works for households with only one tv so kids can still game while mom and dad can watch tv",
                    "score": 56,
                    "replies": [
                        {
                            "author": "A-Centrifugal-Force",
                            "body": "Pretty niche feature though. The Switch can do that but it actually works everywhere and not just while sitting next to the TV. Honestly even back in the Wii U era you were better off just gaming on the 3DS if you wanted to play a game without a TV. An actual portable like the Switch or 3DS just works so much better. There’s a reason the Wii U never caught on.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "Boomshockalocka007",
                                    "body": "I remember taking my Wii U and playing it at the airport without a TV. I was one of the few, the proud, and that reminds me... 2016 was the worst year for Nintendo in the last 20 years. HORRIBLE YEAR!",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "A-Centrifugal-Force",
                                            "body": "Yeah 2016 legit had nothing lol. They were saving literally everything for the Switch. Breath of the Wild was finished and could’ve been released that year but they obviously didn’t want to burn it.\n\nAt least with other slower years like 2018 and 2020 we still got stuff like Smash Ultimate and Animal Crossing New Horizons. 2016’s premier titles were like Star Fox Zero and Paper Mario Color Splash lol. I guess the 3DS still got some good games that year, but everything for home console was being saved up for the Switch.\n\nThankfully 2017 was probably Nintendo’s best year ever which makes up for it haha.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Boomshockalocka007",
                                                    "body": "Funfact about my life: I was so pissed at how Nintendo abandoned us in 2016 I REFUSED to get a switch. I got TPHD and Star Fox Zero. I even played Color Splash (i actually love the music in this game, and its genuinely unique level designs) and then I said BotW Wii U would be my last video game ever. It actually was for a time. I put almost 200 hours into it and never played another video game until finally in the Fall of 2018 I caved and bought a Switch with the Super Mario Party bundle to take a on cruise with friends. The even funnier joke is we never played the switch on the cruise...so I got back home and had this untouched system. Had my heart healed from Nintendo's reckless abandoned? A little. And so I began to play video games again...",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "A-Centrifugal-Force",
                                                            "body": "Hey if one game is going to be your last one ever, Breath of the Wild is a heck of a way to go out lol. I remember in 2017 people kept saying you could just play Breath of the Wild as your only game on the Switch and it would be worth it, and it was true lol.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Boomshockalocka007",
                                                                    "body": "It was true. And whats crazier? TotK was the better game. Never thought BotW would be topped. Amazing what video games can do.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MinecrasherHD",
                            "body": "When I was a kid I actually used that feature quite a lot",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "nhSnork",
                            "body": "The core point of the Gamepad was always a home console take on the dual screen gaming of NDS and 3DS. Too bad it went over so many people's heads.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "KimberStormer",
                            "body": "And for asymmetrical multiplayer that Nintendoland showed off, and dual-screen gaming that they'd been doing for years on the DS.  I will be honest, I think the Switch is a straight downgrade from the Wii U in many ways.  But it's certainly encrusted with a lot of weird gamer myths about how incredibly stupid they and other people are, screeching like 2001 apes at this mysterious interface and unable to tell one console from another.",
                            "score": -26,
                            "replies": [
                                {
                                    "author": "A-Centrifugal-Force",
                                    "body": "The Switch was not a downgrade lol. Found the kid whose first console was a Wii U.\n\nThere were a very small handful of games that used the GamePad well, mainly Nintendoland, Splatoon, and Mario Maker. The rest either used it as a map or menu of sorts, or else they shoehorned in something with it that generally didn’t work. Remember how horribly Star Fox Zero turned out because it was built around the GamePad?\n\nYes the DS had used the dual screen gimmick, but that’s part of the problem, the gimmick had already been played out. Most 3DS games by that point weren’t using the touchscreen for much, most of the innovative ideas of it had already been used. Also now that we have smartphones, stuff like being able to write notes on the screen just isn’t as useful when you can just put it in your notes app.\n\n13 million units vs. 150 million speaks for itself.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "shortish-sulfatase",
                                            "body": "The ‘13M vs 150M speaks for itself’ just means nintendo found a gimmick people understood, doesn’t mean one was better than the other.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "KimberStormer",
                                            "body": "My first console was the [Intellivision](https://en.wikipedia.org/wiki/Intellivision).  Dual screen was the best innovation in all that time, with motion control a close second.  If the Switch had half the social features of the DS, streetpass and pictochat etc, and Wii stuff like the weather and news and Everybody Votes, all the stuff you can do with those systems, then I might have been able to see it as a side-step rather than a downgrade, but it doesn't.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "A-Centrifugal-Force",
                                                    "body": "Bro just said dual screens and motion controls were better innovations than 3D gaming, scrolling platformers, analog control, and a whole host of other improvements.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "shortish-sulfatase",
                                                            "body": "Imagine people having preferences that don’t line up with yours.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "KimberStormer",
                                                            "body": "Smurfs was a scrolling platformer of sorts for Atari, analog control is not something I really notice, and 3D gaming sucks.",
                                                            "score": -11,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "madmofo145",
                    "body": "They also focused on \"adult\" gamers in the reveal, and very specifically focused on games like Skyrim over something like Arms, not even showing off motion control. It was also shown off in Grey, and not tell much later did the red and blue scheme become standard in ads. \n\nIt was pitched as a device targeting core gamers who might want to play big AAA games on the go. Even if the focus shifted to family overtime, not showing off kids playing ARMs with colored controllers in that first reveal was very important as it needed to sell to the random 35 year old first and foremost.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ToothZealousideal297",
                    "body": "I’m still a little bitter that we didn’t get car headrest slings for the system so kids could play Mario Kart split screen on the road…. but I have to admit the screen would honestly be too small and multiple systems in handheld mode wound up being the way to go.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SteveFrench12",
                    "body": "Idt i knew WiiU was a new console until like four or five years ago",
                    "score": 2,
                    "replies": [
                        {
                            "author": "BrandSilven",
                            "body": "You weren't alone. I saw so many \"Finally a new Nintendo console! It's been a long time since their last one, the Wii, was released\" type of comments when the Switch was announced.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MyMouthisCancerous",
            "body": "A lot of people were speculating about stuff like whether the screen was a touch display or if the detachable controllers had motion sensing but if they had shown that at any point here, it would've definitely detracted from the effectiveness of the reveal\n\nComing off of Wii U and how difficult of a time Nintendo had explaining its nature and the different applications of the hardware, the only way they could've sold Switch was as a no-frills console. Yes the hybridity between home and handheld is obviously a gimmick, but that hook has way more immediate appeal to the core gamer than basically anything about the GamePad, and the games shown were exactly the kinds that needed to be there to sell that it was Nintendo going back to basic and reorienting their focused demographics, which stood in stark contrast to how Wii U was only ever marketed towards very young children and families. Skyrim being there alone was pretty huge considering the dire state of Nintendo's relations with third parties at that time",
            "score": 68,
            "replies": [
                {
                    "author": "Samwyzh",
                    "body": "I think the reason why they are doing showcases on April 2 is to continue what worked with the Switch and Wii: letting people play with it. No better way to show how it works that letting people play with it the way they would.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Goldeniccarus",
                    "body": "The handheld to TV thing was a gimmick, but, a very easy to explain gimmick, and one with immediate obvious use cases, which helped a lot in marketing. It was very easy to show \"here it is attached to your TV with the big screen, now here it is in hands on the go\". Plus, those two use cases are great for opening up the market more. Some people don't really like handheld and much prefer having a home console, some people are on the go a lot, or share a TV so they don't always have the ability to play on it, so handheld is great for them. \n\nAnd that \"click\" was such a perfect little marketing thing. It's so recognizable, and I feel like just after the original trailer it was already a very recognizable sound. \n\nPlus, definitely being able to open up by showing a game like Skyrim, saying \"hey, we'll be able to run these big console games on here\" (even if Skyrim was already 4-5 years old when the Switch was revealed) definitely helped show a use case for it. Handheld games that were a lot more like full console games now.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "A-Centrifugal-Force",
                    "body": "Yeah they were very smart to just focus on it playing games and not any gimmicks beyond it being a hybrid console. Including a touch screen and motion controls was the right call because it allows the Switch to play a lot of past games from Nintendo’s library (and sequels to said past games), but for everyone else who just wants to play it normally, they can do that.\n\nLike 98% of Switch games support a regular control scheme with a pro controller on the TV and normal controls for handheld mode. Gone are the days of Wii and Wii U where you had to read the box to see if it supported a regular controller, and even if it did you had to make sure you had the correct controller. Switch just plays games normally.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thisisnotdan",
                    "body": "> detracted from the effectiveness of the reveal \n\nNot contradicting you necessarily, but motion controls and touch screen would have been easier to showcase and less distracting than HD Rumble and the IR camera, neither of which saw virtually any use in practice. I always wondered why Nintendo was so dead set on marketing the HD Rumble feature, when I could tell right off the bat that nobody was ever going to care about that.\n\nTouchscreen controls could have been demonstrated with a split-second shot of a player interacting with the system menu with a touch, and motion controls likewise could have been demonstrated with something like one of the motion control shrines in BotW moving in sync with a controller (unless they didn't want to reveal shrine interiors yet, idk).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WeDidItGuyz",
            "body": "It was genius. I was travelling a lot for business at the time, and had lost touch with video games. When I saw this trailer I was immediately sold. I bought one as soon as it was out. If they had a specific target demographic, it was me.",
            "score": 36,
            "replies": [
                {
                    "author": "madmofo145",
                    "body": "I traveled with my 3DS all the time, so having something that would allow me to play something like BOTW on a trip was a no brainer.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ObiWhanJabroni",
                    "body": "I still have my original switch. Bought it first week it was released in the US",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rbarton812",
                            "body": "Still have a Day 1, first out the door of my GameStop.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tom_yum_soup",
            "body": "I do remember thinking the concept as originally pitched was a little weird (especially since they pitched people bringing their Switch to cool rooftop parties and the like), but it definitely seems normal and even ideal all these years later.",
            "score": 35,
            "replies": [
                {
                    "author": "Cold-Drop8446",
                    "body": "Nintendo doesn't think you're bringing it to cool rooftop parties per say, the point of the rooftop party was to 1) indicate there would be party games, 2) to demonstrate the horizontal joycon functions and 3) to demonstrate that the switch is easy to learn to use. The girl who's hosting the party looks confused when she first holds her controller but a moment later shes all smiles and gaming away. Its only on a rooftop because whoever came up with the ad thought it would be a good scenario. ",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Omegatron9",
                            "body": "> per say\n\nIt's \"per *se*\", by the way.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Odd_Juggernaut_497",
                                    "body": "If English wasn't a fucky language then OP wouldn't have made that mistake.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "the-land-of-darkness",
                                            "body": "\"per se\" is just a loan phrase from Latin, it's not a good example of English homophone excess",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Boomshockalocka007",
                                    "body": "Maybe its Maybelline.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "tom_yum_soup",
                            "body": "I know what the point of it is. The context is still silly.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyMouthisCancerous",
                    "body": "I have yet to have experienced like, any of the scenarios the trailer pitched but it's pretty common for console trailers, especially hardware reveals to be formatted as a lifestyle piece showing how you need a specific platform in your life even just as an element of socialization. Like I still remember the early PS4 ads that pushed hard in a similar fashion for stuff like the Share feature, livestreaming to your friends, and Remote Play with Vita anywhere",
                    "score": 15,
                    "replies": [
                        {
                            "author": "hgeyer99",
                            "body": "Yea turns out you just bring it to the airport every once in a while.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "DrakonILD",
                                    "body": "I remember TSA having a hell of a time deciding what to do with mine in the summer of 2017 (sweet Christ it's been 8 years)",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "madmofo145",
                            "body": "Eh, it starts with just playing on TV, playing traveling, playing in the airplane, and playing in the car. Really the only parts that never really took off were the tabletop focused ones, where you're playing multiplayer away from the house.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "illbeyour1upgirl",
                    "body": "i think we all remember karen bringing her dumb nintendo thing to the party again",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -17,
                    "replies": [
                        {
                            "author": "Paddys_Pub7",
                            "body": "Maybe i'm an outlier but, I take my Switch out with me regularly. I have a couple spots i like to go hiking/hammocking and I'll bring it with me to play while i'm chilling in the woods, I take it when I go on road trips, I dogsit for family friends/coworkers fairly often and my Switch always comes with me, I've even brought it to work to play during lunch or when I have downtime.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Briggleton",
                                    "body": "Same, I'm at work now. My switch is literally in my backpack so I can play a bit once everyone else leaves. \n\nBringing it camping is great because I usually wake up before everyone else. Having some time in the early morning to start a fire and play some games in nature is a really really relaxing experience",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "recursion8",
                            "body": "Good thing they're not Microsoft and actually sell in Japan then",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Flonk2",
                            "body": "That’s not true at all. I take my Switch with me everywhere. I also work at a restaurant and kids constantly have their Switches with them.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "A-Centrifugal-Force",
                            "body": "Huh? I’ve literally taken mine around the world with me. You need a case so it’s slightly less portable than a DS, but anywhere you can go with a bag you can take it with you.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "p_andsalt",
            "body": "I think for sure it would be cheaper if the Switch had integrated joy cons and a seperate controller, but the clicking is such a clever marketing how it works.",
            "score": 4,
            "replies": [
                {
                    "author": "f-ingsteveglansberg",
                    "body": "But the concept of the JoyCons working for two players was one of the draws. It wasn't just that they detach.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "MyMouthisCancerous",
                    "body": "The only thing I really wanted and still want is a Joy Con set where the left one has a traditional D-pad. I basically never use them as individual controllers since either the majority of my games are single-player or in the case of Smash, I already have a Pro Controller and let someone else use the Grip if I'm playing locally, but especially for indies, platformers and definitely traditional fighting games I wish that was an option",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ilwish",
                            "body": "there aren't any licensed ones afaik but you can get joycon shells with dpads if you or someone you know is comfortable with taking them apart.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "MyMouthisCancerous",
                                    "body": "There are licensed \"alternatives\", like Hori has a D-pad Joy Con but it can't be used in TV Mode because it lacks wireless, and they also have the Split Pads that are bulkier and meant for stuff that require more intense inputs like Daemon x Machina, but there's no real option for just a Joy Con that functions like the stock Nintendo ones, but just has a D-pad. Yeah you are left with the custom shells but I've also seen the dismantling process to swap out shells and it looks super risky because I don't want to damage the membrane on anything",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ilwish",
                                            "body": "it's a little surprising that there's not a better option honestly. i swapped the shells on most of my switch parts and accessories, and even having spent several years repairing laptops i have to admit the joycons were annoying af to do.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BobBensen",
            "body": "I bought a bit later, after Super Mario Party announced. Trailer and rollout still kicked ass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darth_snuggs",
            "body": "I distinctly remember posting the Fry / Futurama “shut up and take my money” meme",
            "score": 1,
            "replies": []
        },
        {
            "author": "wicktus",
            "body": "Switch is, for me, a return to the core: Simplicity and games.\n\n* simple hybrid concept (unlike the wiiU)\n* simple ARM & Tegra architecture well known by developers (unlike that weird GPGPU in that wiiU again). When I see monolith games, Zelda, Panic Button ports early on in the switch lifespan...no doubts.\n* simple/lightweight OS (maybe too simple, I'd have liked themes lol)\n* familiar controls...\n* Versatility: one console, one dock, 2 joycons (so up to 2 players)\n\nit's all about gaming and you can play any way you like: solo, couch lan, online..tabletop mode, docked, undocked.\n\nMore than a relief to see the switch 2 being a direct continuation, only this time with (rumored) MUCH more power and ML upscaling, because after 8 years, that underclocked Tegra X1 and those 4GB or shared ram are struggling to keep up for sure",
            "score": 1,
            "replies": []
        }
    ]
}