{
    "title": "Xenoblade Chronicles X: Definitive Edition Review (IGN: 9/10)",
    "author": "Turbostrider27",
    "subreddit": "NintendoSwitch",
    "rank": 2,
    "score": 1103,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 291,
    "url": "https://www.ign.com/articles/xenoblade-chronicles-x-definitive-edition-review",
    "id": "1je4e5r",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Heads up! r/NintendoSwitch is currently collecting nominations for our 2024 Games of the Year! \n\n* Name and vote on your favorite games [in our nominations post](https://www.reddit.com/r/NintendoSwitch/comments/1hzg4kp/2024_rnintendoswitch_goty_nominations_thread/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JaxMed",
            "body": "I need a bigger gun",
            "score": 315,
            "replies": [
                {
                    "author": "scuba_tron",
                    "body": "Am I all alone??",
                    "score": 83,
                    "replies": [
                        {
                            "author": "Mopey_",
                            "body": "Is this thing on???",
                            "score": 67,
                            "replies": [
                                {
                                    "author": "EbrattPitt",
                                    "body": "Am i all alone",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "BroGuy89",
                                            "body": "Hello?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ImReallyAnAstronaut",
                                                    "body": "This world sucks",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "crisp_autumn_farts",
            "body": "> Perhaps the biggest adjustment is that you can now conveniently change out your party members at any time, anywhere, from a separate menu. While this is a basic feature of many RPGs, the original version instead asked you to memorize where every single character was within New LA and go talk to them in order to swap them in.\n\nThis was my biggest issue with the original, and I'm so glad to see it's been updated. I could never remember where characters were located to swap them out.",
            "score": 293,
            "replies": [
                {
                    "author": "Donnor",
                    "body": "There are characters I was never able to find",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Galle_",
                            "body": "They move around based on their schedule and whether they have a heart-to-heart active.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "ArcadianBlueRogue",
                            "body": "I memorized where Alexa and Hope were. Other than that...",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "brattysweat",
                    "body": "I have zero recollection of this. I zoomed through this game",
                    "score": 26,
                    "replies": [
                        {
                            "author": "DropDeadEd86",
                            "body": "By zoom do you mean you only spent 150 hrs on it haha",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "goldblumspowerbook",
                                    "body": "That’s what zooming through is in Xenoblade.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DrewSlim",
                    "body": "Nah that’s fuckin crazy for the OG version. I would never swap characters at that point lol",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "ArcadianBlueRogue",
                    "body": "OH MY FUCKING GOD THANK YOU",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "VacaDLuffy",
                    "body": "They moved around too...gated that",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Roman_Suicide_Note",
                    "body": "Wtf lol, never played X, but look realy toxic",
                    "score": -27,
                    "replies": [
                        {
                            "author": "kevvit2",
                            "body": "I gotta ask, what do you mean by \"toxic\"?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Roman_Suicide_Note",
                                    "body": "to go remember where the character are and to go there to swap look like a realy bad design",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MartDiamond",
            "body": "Can't wait. This is the Xenoblade game that I like many others never played when it first game out. It's one of my favourite series and getting a shiny new and improved version of it is exciting.",
            "score": 76,
            "replies": [
                {
                    "author": "Organic_Rip1980",
                    "body": "You know what’s amazing is this is the _only_ Xenoblade game I’ve ever played! I loved open world and how beautiful and creative it was. \n\nI’m hoping it will lead me into playing some of the other ones, since I have heard that they’re good.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "MartDiamond",
                            "body": "Xenoblade is one of my favourite series out there. Many love 1 for the story, my personal favourite is 2 for the deep mechanics, music and vibe (plus some of the best DLC of all time) and 3 might just be the most complete all around game out there. You have a couple hundred hours of Xenoblade gameplay to look forward too.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Xile350",
                                    "body": "I 100% agree with this take. I liked all 3 for different reasons. I know a lot disliked 2 for the over the top anime kinda vibe but it didn’t ruin the experience for me. 3 was definitely the most polished overall. Just reminded me I need to finish the XC3 dlc… can’t wait to try out X.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Flame48",
                            "body": "Same here. This game was my introduction to the series, but I've heard that it's pretty different from the other ones.\n\nI actually own the 3rd one, but haven't played it yet (should I play the 2 before it first?)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Neospartan_117",
                                    "body": "You don't absolutely have to play the first 2 before 3, but it does make the experience better to do so. The game is clash between the worlds of 1 and 2, both in gameplay and worlds, so you can imagine that knowing the first two beforehand makes you appreciate the tragedy of 3 more.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Mayorquimby87",
                                    "body": "You can absolutely play 3 by itself and understand everything. It's pretty self contained. That said, if you intend to play all 3, I would play them in order. 3 has some references to characters from the first 2 that will mean more if you've played them. You will definitely want to play all 3 before playing the DLC of XC3.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Flame48",
                                            "body": "I do want to get into the series as a whole, so maybe I will just start from 1 and play through.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DadooDragoon",
                            "body": "Man, I wish I could memory wipe myself of those games just so I could play them all for the first time again. They're so fucking good.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_Ok_-_",
                    "body": "For fucking real. I can't wait. I have it downloaded. Ill play it right after I finish Kingdom Come deliverance 2",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "MarcsterS",
            "body": "A lot of games use “Definitive Edition” a lot, but I think this feels like the absolute truth for this game. I’m so jealous that people are going to experience this game for the first time with better UI text, actual customization of game settings, an actual party menu and (SUBJECTIVE) better face models.",
            "score": 52,
            "replies": [
                {
                    "author": "SpottedNigel",
                    "body": "Those old face models were hard to look at. “Fixing” the face has took it from an eventual/maybe purchase to a pre-order",
                    "score": 4,
                    "replies": [
                        {
                            "author": "EbrattPitt",
                            "body": "I only hope I finally get an explanation for that ending, the cliffhanger has been living rent free in my head all these years",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pbzeppelin1977",
                    "body": "Trying to read some of my map ui on the game pad was haaaard.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dat_Boi_Teo",
            "body": "Reviews are looking good, Thursday can’t come soon enough.",
            "score": 31,
            "replies": [
                {
                    "author": "thejameffect",
                    "body": "Make a free Japanese eshop account and play at 12 eastern Wednesday I do it all the time for first party titles ",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Dat_Boi_Teo",
                            "body": "Appreciate the tip but I’ll be fairly busy Wednesday afternoon anyways. Might do that in the future though.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "The_spiceseeker",
                            "body": "Can i do that even though i pre-ordered on the EU eshop ? If so, could you tell me how to ?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "thejameffect",
                                    "body": "You definitely could but your preorder time is stuck unlocking under the region you bought it in ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "The_spiceseeker",
                                            "body": "Damn it. Thank you anyway.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 88,
            "replies": [
                {
                    "author": "Z3M0G",
                    "body": "I still have my WiiU and this game unfinished but I had so many problems with the game that this version fixes... I'm so excited.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "iupz0r",
                            "body": "I bought day one for Wii U, have 300h and still havent found all the landmarks and finished the sidequests, game is HUGE",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "SoloWaltz",
                            "body": "I had the gigantic skill issue of overwriting my savefile.\n\nI bought a Wii U just for this game, and I ended up besting only 1 game: >!Donkey Kong 64!<",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Fishtaco1234",
                            "body": "I tried to get back into it and I was totally lost. I spent a few hours getting up my mines and gave up.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aekatan160",
                    "body": "I was running it on my steam deck, I hit new LA, and then xbc3 came out and never went back, I am soo glad I get to finally play this gem as intended",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "devenbat",
                    "body": "I don't think any game, no matter how good, is worth $360",
                    "score": 8,
                    "replies": [
                        {
                            "author": "iuhiscool",
                            "body": "puyo puyo tetris?",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Mountain-Papaya-492",
                            "body": "Metroid Dread was worth $410 to me. The price of the Switch Oled and game itself. But I am a huge Metroid fan, and had been waiting since childhood for Metroid 5. \n\n\nKinda my own personal rule when it comes to Nintendo consoles, I only buy them when a Metroid game comes out. Did it for the 3ds as well and I didn't buy it but GameCube was all about having Metroid Prime 1.  Trying to send them a message. Which they actually have some data out there where it shows that even tho Metroid is a niche game it's a system seller to alot within that niche.\n\n\n Also usually by that time there's a bunch of other good Nintendo games to make the purchase more than worth it. ",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "SoloWaltz",
                            "body": "No but buying into the system ecosystem a more convincing angle, since its also access to a wii that runs through HDMI, or a digital only gsmevube under conditions. While the shop was up, Virtual Console entries as affordable one tine purchases were also interesting.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mikon77",
            "body": "I can’t wait! I pre ordered my copy a few weeks ago. Now I’m just trying to think of an excuse to skip work!",
            "score": 43,
            "replies": [
                {
                    "author": "GreenVisorOfJustice",
                    "body": "As a professional, I think you're starting to come down with some sort of illness.\n\n~Signed, an Accountant",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Mikon77",
                            "body": "That’s perfect, thank you! They will never suspect a thing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Schitzl1996",
            "body": "Does the game have memorable characters like Elmo or Lan?",
            "score": 76,
            "replies": [
                {
                    "author": "_Xeno2010_",
                    "body": "Idk, but I hope they are as memorable as Rain and Duncan from Xenoblade 1.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "Power_to_the_purples",
                            "body": "Was this from an IGN review? Old ass meme you just awakened in my memory",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "iupz0r",
                            "body": "or Poppi from xenoblade 2",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Galle_",
                                    "body": "I don't remember that character, do you mean Torna's blade, Popeye?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "iupz0r",
                                            "body": "o think the name is Poppie",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Just_another_gamer3",
                            "body": "I wonder if the dlc will have a nopon named bama",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Joseki100",
                    "body": "Tasty the Nopon was my favorite despite the hate he gets for his interactions with Lan.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "bongio79",
                            "body": "Hate? How can someone hate him? TATSU NOT FOOD!",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "Schubert125",
                            "body": "No one is ever going to live up to Rain and Duncan...",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "thisisnotdan",
                                    "body": "Don't forget Pira and Mithra!",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ArvindS0508",
                    "body": "Specific characters or party members not so much but I do remember certain quest NPCs or interesting factions.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "mspaintshoops",
                    "body": "No. It’s much more about the setting and gameplay systems. I played it about five years ago and I don’t remember a single character but I remember the open world was dope as fuck and the combat was really cool.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Schitzl1996",
                            "body": "Someone didn't get the joke\n\nFor clarification, the joke is a reference to IGNs review of XC:DE where they said \"memorable characters like Duncan and Rain\" (their names are Dunban and Reyn)\n\nSo that's why I spelled \"Elmo or Lan\" instead of \"Elma and Lin\"",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MiraculousFIGS",
                    "body": "Only 1 character really stands out to me after I played it years ago.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "JaxMed",
                            "body": "Gotta be H.B. right?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "SoloWaltz",
                                    "body": "The postrated child of Malos and Akhos",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "SoRedditHasAnAppNow",
                                    "body": "I was gonna say Murdress. She was such a >!poor misunderstood oligarch!< that of course she had to turn to >!some sort of absurd back-stabbing walking OHSA violation!<",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Galle_",
                                            "body": "Murderess is very important. Without her dedication to rotating exactly five degrees every week we wouldn't have this new release.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SoRedditHasAnAppNow",
                                                    "body": "🤣",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LakerBlue",
                    "body": "Imo no. There are some good missions involving various characters but I didn’t feel the cast was strong. They are all just ok. Enough to be enjoyable but I would not call them good.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "yammityyakkity",
            "body": "Maybe it was just the point I was at in my life, but the original is one of my favorite games of all time. I remember being so excited for it, I also just started college, so it really felt like all this freedom in the game reflected this change in scope in real life, and I just remember thinking, this is the perfect game right now. \n\nExcited to revisit this amazing game and maybe even try to rediscover that feeling.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Someturtlesdream",
            "body": "Dinner is served",
            "score": 10,
            "replies": []
        },
        {
            "author": "A-Centrifugal-Force",
            "body": "Debuted with an 88 on Metacritic. Let’s go baby!",
            "score": 9,
            "replies": []
        },
        {
            "author": "Hot_Cheese650",
            "body": "I’ve never play the Xenoblade series before, is this a good start? How difficult is the game?",
            "score": 30,
            "replies": [
                {
                    "author": "Crybe",
                    "body": "The exploration of this game is amazing. Once you get your Skell, it becomes so much more awesome.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "Witch_King_",
                            "body": "Ok but isn't that like... 20 hours in?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "TannenFalconwing",
                                    "body": "It definitely takes a while, but the game paces itself extremely well. Plus ground combat is still fun and satisfying.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "Ph33rDensetsu",
                                            "body": ">but the game paces itself extremely well.\n\nEh, I dunno about that.  When I played it on the Wii U, I ended up getting stuck in a spot around level 5 where I couldn't do any quests because I needed to be at least level 7 and my only option was to grind it out.  I bounced off of it then and never picked it back up but I was also new to the series back then.  Now with 1, 2, and 3 under my belt, I'm excited to give X another try.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "TannenFalconwing",
                                                    "body": "... how? I just replayed a bit on my Wii U and I has level 15 at chapter 4. Like, that sounds like you just gunned the MSQ and didn't actually do anything else.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GearGolemTMF",
                                    "body": "Yeah, but you move a lot faster in this game and jump much higher vs XBC 1 & 2. The skell is a massive upgrade though",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "sonic260",
                                            "body": "You also don't take fall damage. Sprint around with no stamina and leap as much as you want",
                                            "score": 15,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ChaoticChatot",
                                    "body": "The exploration before the skell is still very good, but the skell opens the world up in a massive way. \n\nAs for your question, though, 20 hours would be rushing it. I think I was pushing 40 hours back when I first played it (although I like to take my time)",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Jellyka",
                                    "body": "That it takes time to get it is a feature. For real, if you play, don't rush it. The ground combat can be stronger anyway if you know what you're doing, but exploring on foot is also a ton of fun.\n\nAnd when you get your mech... The change of scale of the exploration is an experience i've never had anywhere else.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Crybe",
                                    "body": "Possibly 30?",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Frickelmeister",
                                    "body": "It's a Xenoblade game - everything is at least 20 hours in. 😜",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "LakerBlue",
                                    "body": "Well yes but the game is still fun BEFORE that, it just gets even better afterwards. It’s not a XC2 where the first few chapters are meh (mostly combat-wise)",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Witch_King_",
                                            "body": "Yeah and the XC1 combat starts boring and gets... slightly less boring.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Galle_",
                                    "body": "It starts off great and gets better. Traversing and exploring the world on foot is fun enough to last those first twenty to thirty hours, and it makes the mech more exciting when you do get it.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Cersei505",
                                    "body": "yes, and?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Cersei505",
                                                    "body": "Because thats not the only cool part of the game? Where is it written that a game has to give you access to all of its mechanics in the first 2\\~\\~5 hours? That only serves to make a game of this size and scale boring, imo. Leaving the skells for later allows the game to give you a sense of scale for the world and ground combat, and then making you feel like you progressed and conquered that world after getting the mech. It's called a progression system, and its sorely missing in open world games.\n\nThere's also nothing mutually exclusive or contradictory between saying the mechs are cool and unique, and the game taking its time to give it to you.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Witch_King_",
                                                            "body": "Yeah I'll definitely consider one day playing it now that it's on the Switch. Still haven't even started XC3 yet, however. Unfortunately don't have a ton of time for super long games any more",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Witch_King_",
                                                            "body": "Yeah I'll definitely consider one day playing it now that it's on the Switch. Still haven't even started XC3 yet, however. Unfortunately don't have a ton of time for super long games any more",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "youcanotseeme",
                            "body": "What makes it amazing? No spoilers please",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Crybe",
                                    "body": "It gives your character so much more power, and mobility. Suddenly you want to pilot your mech there, vs. fast travelling. \n\nIt's a pretty game, so there is a bit of that Breath of the Wild looking at a large open map, vibe.\n\nI just recall sinking a good 140+ hours into the game. 60 of those were post-game stuff to do.\n\nIf RPGs aren't your bag, then you may not like the game. I really only have dug into the Xenoblade games for RPGs, so I'm not a huge player of them, but considering XCX was my second RPG, and I put that many hours into it, the gameplay loop had me going.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kingethjames",
                    "body": "You do not need to play the other games for this one. This is set in an alternate universe.\n\nThe games are not difficult when you understand the battle system, but you need to actively learn it or you won't learn how to take bosses down effectively.\n\nThe game plays like a single player open world MMO with an emphasis on exploration more than other JRPGs. The rest of the series, Chronicles 1, 2, and 3 play similarly but are more traditional in their JRPG characteristics and have a stronger fantasy and philosophical narrative and are worth playing, but X holds a special place in my heart for being so different from anything Nintendo has done when it first released.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Shas_Erra",
                    "body": "Apart from some minor story elements, each game is a standalone and can be played in any order. XCX has the least crossover and is probably the most accessible for new players.\n\nThe fact that it’s a fucking masterpiece is just a bonus",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Apex_Konchu",
                            "body": "The connections between 1, 2, and 3 aren't \"minor\". X is standalone, but the others should be played in order.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "goldblumspowerbook",
                                    "body": "I disagree. Played 2 before 1 and was totally fine. The end of 2 with the connections made me want to play 1. 3 is way enriched with having played the first two, but it’s quite coherent even without.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MV6000",
                    "body": "I think it’s best to start with Xenoblade Chronicles: Definitive Edition.\n\nThat game is a masterpiece.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "BenignLarency",
                            "body": "I think it depends on what someone might be looking for in a game. \n\nXenobalde Chronicles DE, or X DE are gonna be your best options to start with, but which one someone might prefer will largely come down to what kinds of games they prefer. \n\nXC:DE is far more story focused, the exploration is there, but is not as good as X. The amount of freedom and \"rule of cool\" is also far less than that of X. \n\nConversely, X is one of the best exploration games that exist. The world being completely open from the start, and the addition of skells (mechs) add a level of freedom the other Xenoblade games don't even come close to. The story isn't as in depth a narrative as that of the XC:DE (or the other numbered games for that matter), but the moment to moment gameplay is far tighter in X IMO. \n\nThey're both masterpieces in their own rights, but which one someone might prefer will come down to what type of game they're looking to play.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "asylumsaint",
                                    "body": "I hope you mean the exploration is not as good as X and only that. Because literally every other aspect of the original xenoblade chronicles blows X out of the water 10x over. Having played all 4 of the xenoblade games, X was by far the weakest while still enjoyable of course.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "happymudkipz",
                                            "body": "Story and characters I'd give you, but the combat, exploration, music, and environments are all more interesting in xenoblade X. 1's combat feels so clunky and slow to me after the rest of the series, and collection and sidequests are awful.",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "BenignLarency",
                                            "body": "Rereading what I said, I stand by it all. I vastly prefer the combat, exploration, and side characters in X than XC:DE. You can prefer XC1 to X, that's fine and perfectly valid. \n\nI don't think I agree that X is the weakest of all 4 Xenoblades, I think they all excell at different things. XC:1's world for example is so rich in history and story telling. The main party is a delightful cast, and I quite enjoy their characters. But the combat leaves a lot to be desired. Between the limited combat options compared to the other games, to the irritating choice to bind chain attack continuation to party affinity, the game is far from unflawed. The game is still a masterpiece, and I love it dealy, but IMO X's combat, moment to moment exploration, and the side characters/ stories in X, are all far more compelling than that of XC:1.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "Cersei505",
                                            "body": "Yeah, no. I much prefer the tone, setting and music of X. Combat and exploration is also miles better and more fun than in 1, which has barebones combat. \n\nSidequests are also massively superior in X, whereas in 1 they're just fetch quests with no story behind it.\n\nThere's plenty X does better than 1, and even 2 and 3.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HighVulgarian",
                            "body": "That’s where I started, I’ve got about 20 hours into it. So many side quests!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SoRedditHasAnAppNow",
                    "body": "It's the best of the bunch from an exploration and combat point of view. But it's the weakest from a story point of view. \n\n\nI really enjoyed it. I played XC1 on Wii, but haven't delved into the switch sequels because they're so damn long and I've had 3 kids since XCX released.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "phalseprofits",
                    "body": "Following. I want to know too.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "A-Centrifugal-Force",
                            "body": "Yes you can start with this game! It’s separate from the main trilogy. Xenoblade X Definitive Edition and Xenoblade 1 Definitive Edition are the two places I’d recommend starting.\n\nIf you love open world games like Breath of the Wild and Tears of the Kingdom, start with X. In fact a lot of the team that made X also helped Nintendo make the open air Zelda games (they have a whole team that just works on Zelda now because they were so helpful). The game features a great story too, but it’s much more focused on exploration and side content.\n\nIf you prefer a linear story based game with one of the best stories in the history of gaming, go with 1 Definitive Edition. It’s still got a huge world to explore and is pretty much an open world game too, you just have to progress through the story in order to unlock parts of the map. It’s on the eShop as “Xenoblade Chronicles: Definitive Edition”, check the release date for it (2020) so you don’t get it confused with this game.\n\nXenoblade 1 has two sequels (each set in their own world with their own characters) and all of them also have story expansions. It’s an amazing series to get into and now it’s all on the Switch!",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CatHatGuy",
                    "body": "I’d say it’s the second best place to start after the first Xenoblade/definitive edition, or maybe it is the best if you prefer a heavier focus on exploration than story. None of the games are really directly difficult, but they have a decent amount of reading tutorials required to understand the intricacies of the combat systems (though with the new release there’ll be plenty of YouTube guides breaking down anything you might find hard to follow in the game if needed).",
                    "score": 2,
                    "replies": [
                        {
                            "author": "A-Centrifugal-Force",
                            "body": "As a follow up here, I recommend the YouTuber Enel if you need any help building a strong party for defeating high level enemies. He makes guides that are helpful for both newcomers and veterans alike and has them for all the Xenoblade games. That’s obviously something you won’t need to get into at first though, that’s for late game and post game stuff mainly. He said he’s making new ones for X that will take advantage of all the changes in Definitive Edition.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ph33rDensetsu",
                                    "body": "Seconding Enel for Xenoblade content.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NooksWave",
                    "body": "As an introduction to the series, it's not the best - even though this game is AMAZING. \n\nThe original release had no connections to the main series, and almost completely opted out of telling a story (Think 30 minutes of storytelling for every fifteen hours of gameplay) which made it a HUGE departure from the numbered Xenoblade games. This version seems to have put in a lot of new story content to connect it to the other games though.\n\nSo while not a good starting point for getting into the  \"series\" so to speak, it is still quite the masterpeace. I  still havent played anything that comes even remotely close to handling exploration and discovery as this one does. Just like you might have \"just one more battle\"-moments in other games, this will make you go \"just one more hill\" instead. The pure thrill of reaching new places is unique for this game.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GrooseKirby",
                    "body": "This is the one with the most complicated combat in the series. Would recommend starting with the first Xenoblade instead if you're interested since that teaches you the basics you'll use in every other game.  From what I've seen of the new content online, X will tie into the other games near the end of the story so you should probably play those ones first anyways for context.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "WretchedBlowhard",
                    "body": "Storywise, it isn't tied to any other Xeno title. It's an offline MMORPG where you get fetch quests in a central hub town area and then walk around the countryside picking up shit for said fetch quests. Combat is, well, autocombat with cooldown mechanics, which was typical for MMORPGs when the game was originally designed. It doesn't require any skill, you just wait there and click the icons as their individual cooldowns end.\n\nFetch quests, gather materials, upgrade your pants, sell off old pants, go back to fetch quests, rince and repeat. There are a little under 20 missions that move the story along, but the NPCs all behave like weird lifeless dolls from a PS2 game.\n\nIt's like FF14, crossed with that shitty Adam Driver movie 65, and you're the only non-npc in the entire game. Pretty, but lonely and repetitive. Adding insult to injury, because americans are horrible degenerates that must have their chastity preserved, the international version of the original game had the titty size slider removed from character creation and extra layers of low effort clothing were added to some female sprites, like a censored CN gacha.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "Amrita_Kai",
                    "body": "Not a good starting point. This was my 1st xeno game on wii u and only stuck to the game cause of the world. You really need prior combat mechanic knowledge to enjoy this game. I recommend playing XB1 then dive in to this.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "pacman404",
                            "body": "You don't need to play a 60 hour game to understand the combat, what are you talking about lol 🙄",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BrightOctarine",
            "body": "Wait, where is this game set? I've played xenoblade chronicles 1 but this looks like a whole different planet?",
            "score": 22,
            "replies": [
                {
                    "author": "Crybe",
                    "body": "A new planet, Mira.\n\nThis game is all but a standalone from the rest of the series.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "BrightOctarine",
                            "body": "Ah, then I guess we'll need a bigger gun",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "roosell1986",
                            "body": "To be fair, all the games are pretty standalone.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "munchyslacks",
                                    "body": ">!I would argue that XC3 is not. Or at least less than the games that came before.!<",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "roosell1986",
                                            "body": "Of course there's the things that tie them together.  But for someone dropping in after 3 games, they'd never know they're missing that.  It's not vital to enjoying the game.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "munchyslacks",
                                                    "body": "Fair point",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Shas_Erra",
                            "body": "Even though it’s not explicitly stated, I believe this game is more linked to XC and XC2 than it appears. Without spoilers, I think the events that triggered those games was the invasion of Earth that we see in XCX",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Alkafer",
                    "body": "Yes, not even a distant land.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "JaxMed",
                    "body": "Not to sound cliche, but this world sucks",
                    "score": 15,
                    "replies": [
                        {
                            "author": "geosunsetmoth",
                            "body": "Context to people who didn’t play the game, “this world sucks!” is a reference to a line in the soundtrack. The world is sublime 😭",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "AmarilloCaballero",
                                    "body": "\"a whole different planet\" is also a reference to the same song.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ImReallyAnAstronaut",
                                            "body": "It's also a reference to the planet that the game takes place on - Mira. I only know this because I've watched countless lore videos",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "geosunsetmoth",
                    "body": "It is. It takes place on an alien planet called Mira",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "UltimateWaluigi",
                    "body": "The guy who said \"this world sucks\" is just memeing one of the song lyrics. This game's world design is great (same team as BOTW). Just so you know.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "AmarilloCaballero",
                            "body": "You are responding to someone who is also memeing the same song lyric. He said \"a whole different planet\".",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "UltimateWaluigi",
                                    "body": "I may be stupid",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Organic_Rip1980",
                                            "body": "No you’re not, all of this was interesting for me to find out.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DSMidna",
            "body": "An acceptable quantity of water",
            "score": 19,
            "replies": [
                {
                    "author": "goldblumspowerbook",
                    "body": "Is this an IGN Pokemon Ruby/Sapphire reference? It’s an older meme, but it checks out.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ttm-o",
            "body": "Day one, day one, day one.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Mizerous",
            "body": "It's peak.gif",
            "score": 3,
            "replies": []
        },
        {
            "author": "iupz0r",
            "body": "The OST alone is worth the purchase.",
            "score": 5,
            "replies": []
        },
        {
            "author": "No-Rub322",
            "body": "I haven’t played any of the other Xenoblade games in the series. Would this be a good place to start?",
            "score": 7,
            "replies": [
                {
                    "author": "TheRigXD",
                    "body": "This was my first Xenoblade game and I can say that you can absolutely start with X. There's some minor references to 1, but it's self-contained otherwise.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Paetolus",
                    "body": "Either start with this one (Xenoblade Chronicles X: DE) or the first one (Xenoblade Chronicles: DE). Either is a good starting point imo.\n\nI'd say X is better in almost every way other than the main story. (And maybe the music too, but that's subjective)",
                    "score": 7,
                    "replies": [
                        {
                            "author": "NakiCoTony",
                            "body": "Thanks I am mostly hooked on story when it comes to rpgs..  (Replaying Kotor now on my mobile)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Arterra",
                                    "body": "I'd say this one has the weakest narrative of the series. It's absolutely there and not bad, but this *is* a game where story is second to the gameplay.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "NakiCoTony",
                                            "body": "I played astral chain how is it compared to that?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "geosunsetmoth",
                    "body": "Yes.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "goldblumspowerbook",
                    "body": "This isn’t connected to the others. Also, IMO you can start almost anywhere. The connections are substantial, but the stories are told in a way that holds together even if you haven’t played a predecessor. I played 2 before 1 and it was a great story that made me want to play 1. I also like the combat gameplay of 2 and 3 way better than 1.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Joestac",
            "body": "Pre-order already secured and just ordered the other 3 games new off Ebay. Ready to get all up in this series.",
            "score": 3,
            "replies": []
        },
        {
            "author": "wargr8mon",
            "body": "How does the online multiplayer works?",
            "score": 3,
            "replies": [
                {
                    "author": "geosunsetmoth",
                    "body": "You can join with other players for co-op missions that work as boss fights, or you can team up with a large number of players (I wanna say… 32?) to have certain passive “kill X number of enemy type Y” missions in the background while you play your main, solo quest",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Arterra",
                    "body": "Adding on to the other reply, you can also hire other people's characters as npc companions. I can't remember if they get rewarded, but certain paths you can take reward you for doing so. Very Dragons Dogma like, though the quality difference between players of even the same level will be massive.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Financial_Exit_7710",
            "body": "W",
            "score": 3,
            "replies": []
        },
        {
            "author": "yydbgeorge",
            "body": "Stupid hyped for this game.\n\nInstant buy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GeekyGame",
            "body": "Was very fun on Wii U. I'll wait for Switch 2.",
            "score": 3,
            "replies": [
                {
                    "author": "Resident_Durian_478",
                    "body": "It will probably be compatible on switch 2",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ryan_e3p",
            "body": "This was my first XB game. Played the others as they came out for the Switch, and glad to have come full circle back to the one that I honestly enjoyed the most overall.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jwfd65",
            "body": "My Wii U gamepad broke not long before this came out originally, and I’m pretty sure the game was unplayable without it, so I never got to play much beyond the first few hours. Super super excited for Thursday!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "ultibman5000",
            "body": "If you check Metacritic, the reviews by other companies outside of IGN are great too, which is nice because I really enjoyed the game on the Wii U.\n\nI'd love to see a Xenoblade 2 Definitive Edition as well, sometime in the future for the Switch 2, polishing off some of the edges and addressing some fairly fixable issues like with 1 and X. Or maybe even just a free/low-price next-gen update, either or is fine with me since base XB2 has a metric ton of content as is. Just something that would finally bring *the entire* Xenoblade series up to the **QOL** standard of Xenoblade 3.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Eve-of-Verona",
            "body": "I just redeemed this game and smash bros with the JP eshop coupon before they lock payment to Japanese cards and PayPal only in that eshop. I have been quite a JRPG fan but haven't yet get a touch on the series (have been playing Fire emblem, Ys and Persona in the past few years) and these seem like exciting news.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Power_to_the_purples",
            "body": "So hype to play this game. Missed out on the experience during the WiiU era, but I’ve played every other Xenoblade since then.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mlvisby",
            "body": "I find it amazing that we could get a Switch remake this late in the console's life, and get such a positive score.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ftatman",
            "body": "What’s a better starting point for this series if I’m new - is it this one or the game with Shulk as protagonist?",
            "score": 2,
            "replies": [
                {
                    "author": "meowkittycat93",
                    "body": "I would say xenoblade chronicles 1 which is the one with Shulk\n\nI feel it helps you understand the battle system a lot more as a “foundation” since they built upon it since the first game",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SovietKnuckle",
            "body": "Never had a chance to play this but am excited to finally play the only Xenoblade I haven't tried yet. Timing couldn't be better either as I just got done with Romancing Saga 2 last night.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Omega-A",
            "body": "Where big anime tiddies?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Josh100_3",
            "body": "I genuinely considered buying a Wii U for this game when it originally released but didn’t get around to it.\n\nGlad to see playing the waiting game has paid off.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Erionns",
            "body": ">One substantial addition is the Quick Cooldown bar, which fills up over the course of battle as you use auto-attacks. ... The Quick Cooldown bar builds fairly slowly, so it’s important to pick the right time to use it, but it can instantly turn the tide of battle when you do.\n\nThis is just blatantly wrong, and I'm honestly not sure how you could even play the game and not understand this. The Quick Cooldown gauge is a fixed amount per battle, that does not refill, and the game quite literally tells this to you in the tutorial that pops up when it unlocks.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mandalorian6780",
            "body": "I’m surprised IGN didn’t give it their standard 7/10 review.",
            "score": 3,
            "replies": [
                {
                    "author": "dasdull",
                    "body": "7/10 too much Tatsu",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Paetolus",
                    "body": "It's always a roll of the dice with IGN (and other big reviews sites) because they have so many different reviewers with different tastes. I wonder how they go about assigning who does a particular review.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Mandalorian6780",
                            "body": "IGN is so trash at reviewing games, I’m surprised that people still read their reviews.  There are better, more reliable, game review sites out there.",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FSTxx",
            "body": "I've never played any Xenoblade games before, but it's a saga i've always wanted to dive into. Still, i fear that playing this game right away would in some way ruin the story of the other games. Is this totally disconnected from the other games, or are there elements that tie into the previous games? I wouldn't wanna be \"spoiled\" anything",
            "score": 1,
            "replies": [
                {
                    "author": "thatkaratekid",
                    "body": "You can play xenoblade in any order, but I recommend xbc3 last. There is very little tie in between saga and blade besides a guest character in xbc2. (A guest character who is obtained via gacha and the rarest character in the game). X (at least in it's original form) had no ties to the other xbc chronicles games.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "FSTxx",
                            "body": "\"in it's original form\", huh? As a Kingdom Hearts lover, this tells me i should play the XC1-2-3 first then lol",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "thatkaratekid",
                                    "body": "As a fan of both franchises, I promise you it's not comparable at all. Xenoblade is more akin to Final Fantasy, where each entry is entirely it's own thing. The parts of the story that overlap for XBC1 and 2 can be enjoyed in literally either order. XBC3 while totally fine on it's own, is greatly enhanced (especially the dlc) if you have played both XBC1&2. XBCX came out before XBC2 and it's entirely playable separately as doesn't have any tie ins story-wise to previous games. I say in it's original form because this remake has enhanced story content the way the remake of 1 did, and it's very likely the same enjoy in any order Easter egg from 1&2 will be confirmed in x.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "FSTxx",
                                            "body": "Oh okay, that's nice to hear. You really got me hyped up. I've been keeping this saga in my backlog for too long. So as a long time fan, what would you say? Should i get in by starting with XCX or i go 1-2-3-X? I understood that it doesnt matter that much as long as i play the 3 last, i'm just asking what would you do in my place :)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "thatkaratekid",
                                                    "body": "All of them are great. 1 and X are both great starting points. I personally would recommend starting w XBC1 but many friends who hated it, adored XBCX, so I'd say whichever looks more appealing. Both are absolutely massive games.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "FSTxx",
                                                            "body": "Got you man. Thank you very much!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "thatkaratekid",
                                                                    "body": "Also worth noting XBC2&3 both have full extra campaigns available as dlc, and both add content to the main game as well. I still haven't played the 3 DLC, but the 2 DLC was a full campaign (still shorter than the main game, but longer than many other standalone games). It had a fantastic story that was a prequel to 2, and expanded the story so much (although it's a prequel, it is universally recommended you play xenoblade 2's main story first, as this contains spoilers, and many many worldbuilding and combat concepts will assumed to have already been learned from the main game. From my understanding, 3's DLC is a direct sequel to all 3 main games at once.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "FSTxx",
                                            "body": "Like, based on what you told me, and since i like playing the game in release order, i could go X-1-2-3 or 1-X-2-3. Yeah, maybe i'll start with X since it's a spinoff and then 1-2-3 back to back",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HexenVexen",
                    "body": "This one is completely standalone from the other three. According to one of the reviewers Gene Park, even the new story content doesn't need knowledge of 1-3 and it doesn't spoil them at all. If there are any new connections, it's gonna be done in a subtle way where \"if you know you know\" but if you don't know then it's completely fine and the story is still fully understandable.\n\nHowever yes Xenoblade 1-3 are connected and it's best to play those three and their additional stories in order. Those games also sort of operate in a \"if you know you know\" manner but knowing the connections does improve the experience significantly.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Galle_",
                    "body": "The original game was totally disconnected from the rest of the series. That *may* have changed in the new release, we don't know, but if that's a problem for you you could always just not progress the main story after the credits roll.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JLTMS",
                    "body": "They don’t have many tie ins but the first game is great so start with that",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Reporter-8728",
            "body": "What’s so different about this game then the others",
            "score": 1,
            "replies": [
                {
                    "author": "geosunsetmoth",
                    "body": "Completely different, almost a spin off. Different universe, characters, gameplay and design focus. Think of the other games as Skyward Sword, and X as Breath of the Wild",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "GreatestBox",
                    "body": "Less focus on story more focus on exploration and world building. Here you also play with a customizable silent MC",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Galle_",
                    "body": "* It's a true open world, rather than having large but linear areas.\n* It's more science-fiction with some fantasy elements than fantasy with some science-fiction elements.\n* The main story is weaker and instead there is more emphasis on exploration, side content, and worldbuilding.\n* Giant robots",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "gizmo998",
                    "body": "Others being? 1.2 and 3?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ok-Reporter-8728",
                            "body": "I mean what else would I be saying Lol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "japzone",
                    "body": "Mechs and exploration would be the key parts I remember.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ArcadianBlueRogue",
                    "body": "Heavy focus on exploration and customizing, instead of story. There is a story but it kinda takes a sideseat to the billion small sidequests and BLADE stuff.\n\nAlso gives you giant mechs called Skells which also transform into cars.\n\nIt had a minor online component with doing some quests online with others, but also you could summon their avatars at their current level to help you as party members. So you could spend money to have max level chars in the party if you had a quest in a dangerous area, etc. Comes in clutch for some spots.\n\nOverall it's a great and really cool game. My only real knock against it was the story felt like background.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lifedragon99",
            "body": "I own this on Wii I buy hated playing with the gamepad. And couldn't be bothered to look for a pro controller for one game. \n\n\nI have been waiting years for this to come out and I cannot wait to play it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "boktobw18",
            "body": "I could never get into this game and really REALLY wanted to like it. I adored the original Xenoblade Chronicles but this one didn't pull me in. The music also made me want to play it on mute as well which was such a contrast to the original which is arguably my favourite soundtrack of all time in a game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PunkyBobster",
            "body": "I can’t wait. I bought a Wii-u a few years ago just for this game but absolutely hated the Wii-U’s interface to ever want to use it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "forgotmapasswrd86",
            "body": "Hows the open world? Can't say I've had a \"open world\" game on a Switch that didn't feel empty even the good ones like BoTW/ToLK.",
            "score": 1,
            "replies": [
                {
                    "author": "Galle_",
                    "body": "The team that made X's open world went on to design BOTW's. It's very pretty and has a nice mix of different environments. Traversal, both on foot and in a mech, is fantastic. It is very crowded with aliens and items.\n\nThat said, there's not much to do in it besides look at pretty things, pick up items, and fight aliens.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ArcadianBlueRogue",
                    "body": "Early game has a barrier to stop you from going too far, but once that's gone you can go wherever you can get to. The BLADE console being able to summon avatars of other players at their set levels meant you could roam around high level areas when you were still low level yourself so it opened a lot of doors.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ultibman5000",
                    "body": "The environments are extremely alien/fantastical compared to any other open world on Switch, you'll see sights you haven't seen before in a game. These environments are appropriately filled (not sparse and Bokoblin-cloned like BOTW/TOTK but its also no Monster Hunter either) with a pretty big roster of alien species of various shapes and sizes, some of which even travel in herds of sorts and a few that are given neat (if not outright cute) animations showing them interacting with the environment in animalistic ways. There are also many collectibles littered across the map, but they're admittedly displayed as mere blue and red diamonds to run across in order to pick up (I can't remember exactly, but I *think* these items are given some flavor text in the menu at least). There are an okay amount of treasure chest-like containers and structures to find too. In general, these chests plus many of the aliens' corpses contain plenty of useful weapons and costumes (lots of fashion options in this game, or at least a fair amount).\n\nAll this being said, the game is mostly about explored uncharted territory in a wild alien planet, NPCs are very sparse (although not nonexistent) in the outside world and mostly confined to the hub area. The hub is a city which is significantly bigger and denser than any town/city in other Nintendo game, although it is far from the most city-like cities in gaming as a whole. You're spending most of your exploration fighting aliens, sneaking past aliens, running over blue diamonds on the map, taking in beautiful alien biome sights, running to Ubisoft towers of lights, and vibing in a mech through flight or vehicle transformation.\n\nIt's an amazing open world overall when it comes to the raw fundamentals of fun environments and enemies, but don't expect anything like an immersive-sim type game.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stargate476",
            "body": "Got mine pre-ordered already, I have this on the Wii U but I never finished it and so I really want to finish it on the switch",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrewSlim",
            "body": "I have 3 in my backlog and I’m thinking of copping this one. Let’s give the backlog some company",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jam-Master-Jay",
            "body": "Got an email that my copy has been dispatched. Will still probably arrive on launch day, but I'm hoping I get it tomorrow instead like I have with other launches in the past.\n\nCannot wait!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Boonatix",
            "body": "So it is like part 3…?",
            "score": 1,
            "replies": []
        },
        {
            "author": "binchicken1989",
            "body": "Does the X mean 10 like Roman numerals? Sorry legit question cause the last one was xenoblade 3 which I'm playing a bit",
            "score": 1,
            "replies": [
                {
                    "author": "Galle_",
                    "body": "Nope. It's actually pronounced \"cross\".",
                    "score": 2,
                    "replies": [
                        {
                            "author": "binchicken1989",
                            "body": "Ohh so all 3 together?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "binchicken1989",
                            "body": "Or it's own base game.. sorry I'm not trolling lol bit confused",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Galle_",
                                    "body": "XCX is its own base game. The story is not connected to 1, 2, and 3.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "binchicken1989",
                                            "body": "Not connected at all? Shit dude that's huge. Gotta hit it! Cheers 👊🙏",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheReaver",
            "body": "nice, cant wait!",
            "score": 1,
            "replies": []
        },
        {
            "author": "youcanotseeme",
            "body": "How good is the exploration in this one?",
            "score": 1,
            "replies": [
                {
                    "author": "Galle_",
                    "body": "Best in the series. The team that made this game went on to design the open world for Breath of the Wild.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "youcanotseeme",
                            "body": "Then it's a must play for me!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Calexixa777",
            "body": "Ready to leave earth once more",
            "score": 1,
            "replies": []
        },
        {
            "author": "ughlump",
            "body": "I knew that voucher would come in handy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pawlik23",
            "body": "Does anyone treat IGN's reviews seriously though? They gave Veilguard 9/10 too.",
            "score": -7,
            "replies": [
                {
                    "author": "masterz13",
                    "body": "I mean, did you actually play Veilguard or Avowed? Or just to the internet",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Sweaty-Practice-4419",
                    "body": "People treat IGN seriously whenever it suits their agenda or opinions.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "witzyfitzian",
                            "body": ">People treat [information] seriously whenever it suits their agenda or opinions.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "munchyslacks",
                    "body": "I personally wouldn’t give it a 9, but other people seem to love this one. I’ve played all the Xenoblade games and while the XC1 remake was a no brainer to pick up, I have no desire to return to this one. Definitely my least favorite in the series.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Galle_",
                    "body": "They gave Baldur's Gate 3 a 10/10, so they aren't even consistent in how they overrate mediocre RPGs.",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Full_Metal18",
            "body": "This looks so good but I promised myself I'd deal with the backlog of games I got during the holiday season before buying any new releases. Gotta keep my wallet happy.",
            "score": 1,
            "replies": [
                {
                    "author": "SirDanOfCamelot",
                    "body": "Fuck that wallet",
                    "score": 3,
                    "replies": [
                        {
                            "author": "japzone",
                            "body": "*\"Beat it with a bat Vinny.\"*",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Full_Metal18",
                            "body": "Shit, you unironically convinced me",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SonicSpeed0919",
            "body": "Guess this sub likes ign when they give Nintendo games a high score.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fasted93",
            "body": "I played the original one and the story got AWFUL (and I don’t think it’s only me who thinks that way) so I’m surprised about a 9/10 tbh.\n\nEdit: For real those downvotes? The story has the worst pacing of the series and has gaps all over the place that have never been explained.",
            "score": -3,
            "replies": [
                {
                    "author": "MrSnek123",
                    "body": "I agree, but I also don't care lol. Side content and combat easily make it the most enjoyable Xenoblade game for me.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Fasted93",
                            "body": "Yeah I think the gameplay, the world and so was so much fun, but the story (and keep in mind it’s a JRPG, so it’s a big part of it) had big issues and I just felt a 9/10 was quite high. \n\nEven though, maybe they changed a few things to improve the pacing and the epilogue fills the (quite big tbh) gaps in the story.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "munchyslacks",
                    "body": "I agree. I love Xenoblade but this is my least favorite entry by far.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Galle_",
                    "body": "The main story is definitely the weakest part of X, but it has other strengths that make up for that.\n\nAlso DE resolves the cliffhanger ending.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Missingno1990",
                    "body": "People downvoting probably never even played it. Easily the weakest story in the series. Weak start, slow paced and ended up all over the place. Lin and Tatsu's interactions were pretty unbearable, too.\n\nThat said, I'm not surprised a review outlet is giving it a 9. Review scores have been massively inflated for a good while now.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BadThingsBadPeople",
                            "body": "2 is obviously the worst story since it expects you to take the anime seriously.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ptony_oliver",
            "body": "Well it's IGN, but it's nice to see such a good score nonetheless.",
            "score": -12,
            "replies": [
                {
                    "author": "Im_a_Knob",
                    "body": "ign is great when they give my anticipated games a good score. they are bad when they give any games my that favorite youtuber hate a good score.",
                    "score": 50,
                    "replies": [
                        {
                            "author": "BigChungusOP",
                            "body": "You will never convince me that your favorite game is better than my favorite game. There, I said it.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professor_Poptart",
            "body": "My question about this game is how much do you get bogged down in cutscenes and/or reading lots of text? The exploration and combat seem fun to me but I get turned off by games if they're too story/dialogue heavy.",
            "score": 0,
            "replies": [
                {
                    "author": "geosunsetmoth",
                    "body": "Very little. Unlike the rest of the series, X is extremely story-lite. They put all their eggs in the exploration basket. Think Breath of the Wild",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Professor_Poptart",
                            "body": "Incredible, that's very cool to hear. Thanks!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Galle_",
                    "body": "This game is very light on cutscenes.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Klayehn",
            "body": "Do you need to play the previous games in order to understand the Lore?",
            "score": 0,
            "replies": [
                {
                    "author": "Galle_",
                    "body": "No.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Delicious_Coast9679",
            "body": "Played around 10 hours of it, I can't speak on too much of the new content. \n\nBut draw distance is still ass and the texture and resolution bump made performance in the game worse than the original. I have also noticed some lighting issues here and there, like some flickering. \n\nThis is a hit and miss remaster. The QOL improvements do make it overall better than the original, especially the UI, but I can't give this a glowing review. It being on the Switch with low specs won't have me blindly defending it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "alienfreaks04",
            "body": "I never played XC because of the epic long campaign in my 20s. Now I’m approaching 40 and I have even less time.  I don’t want to play one campaign for half a year.",
            "score": -22,
            "replies": [
                {
                    "author": "MattyXarope",
                    "body": "Unfortunately, Nintendo is now mandating that every man, woman, and child of all ages play this game in its entirety including side missions.",
                    "score": 56,
                    "replies": [
                        {
                            "author": "steep2798",
                            "body": "Lobsters and all",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "Excited_Onion",
                            "body": "As well they should.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "alienfreaks04",
                            "body": "I meant that I wish I had the time now but I don’t. I WANT to be able to. \nIt’ll be the same for future Elder Scrolls and Witcher etc😢",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Galle_",
                    "body": "XCX is a bit different in how it's structured. The main quest is shorter and there's more focus on side content.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Employee_Lanky",
            "body": "This game is like a 5/10 on a good day. Cool world and artistic design but it’s mmo lite gameplay and lack of a story make it the worst xeno game by far.",
            "score": -49,
            "replies": [
                {
                    "author": "0172thetimeguy",
                    "body": "It’s sitting at an 87 from 35 reviews on Metacritic. You’re clearly in the minority.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Employee_Lanky",
                            "body": "That’s cool am I not allowed to discuss the game because I’m a minority?",
                            "score": -8,
                            "replies": []
                        },
                        {
                            "author": "Delicious_Coast9679",
                            "body": "LOL Nintendo fanboys",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "2ndMin",
                            "body": "Bro who cares",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Galle_",
                    "body": "Nah. It has the best gameplay in the series (great build variety) and the story, which it has its weaknesses, is merely told differently rather than lacking.\n\nThe worst Xenoblade is 2, incidentally.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Employee_Lanky",
                            "body": "I dislike 2 for different reasons mostly being the characters and story not being my cup of tea. Idk X just feels like an mmo that ripped out the social aspect",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "biscuitsdad",
                    "body": "This is the only xeno game I couldn't finish. The grinding threw off the pacing for me, only made it about 70 percent of the way through on Wii u",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Employee_Lanky",
                            "body": "Yeah it becomes a slog. Maybe they fixed the pacing but I doubt it",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Great_Gonzales_1231",
            "body": "WTF I love IGN now",
            "score": -2,
            "replies": []
        },
        {
            "author": "Hoodlum8600",
            "body": "What I remember most about this game is the OST is god awful and the New LA theme is probably the worst game music I’ve ever heard. That and I remember the Skells running out of fuel so often that I just stopped using them. Original game was a 6/10 for me so we will see if the updated port is any better",
            "score": -4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -88,
            "replies": [
                {
                    "author": "NineSwords",
                    "body": "Scared me there for a moment so I had to look up what's censored:\n\n>One of the character's outfits were made less revealing due to the character Lin being 13 years old.\n\n\n>The breast slider feature in the make the character screen was removed.\n\nDo you really think this is the hill to die on?",
                    "score": 73,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "NintendoSwitch-ModTeam",
                                    "body": "Hey there!\n\nPlease remember Rule 1 in the future - No personal attacks, trolling, or derogatory terms. Read more about [Reddiquette here](https://reddit.zendesk.com/hc/en-us/articles/205926439-Reddiquette). Thanks!",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Dreamweaver_duh",
                            "body": "Lin's outfit? No.\n\nBreast slider? I miss it. Big naturals exist, folks.\n\nI mean, it was removed for the US Wii U version (and I play as guys anyway), but the option hurted nobody.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "VagrantValmar",
                                    "body": "Breast slider being removed sucks but is that really a hill to die on? Are people really going to miss out on a great game because you can't make boobs bigger or smaller?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dreamweaver_duh",
                                            "body": "I mean, you'd be surprise what little things people will drop a game for. Some people refuse to play games without customization. Some people refuse to play games without multiplayer. Some people refuse to play games without Trophies and Achievements.\n\nWill a lack of a breast slider be my hill to die on? No, because it wasn't back on the Wii U, and it's not my hill now. But I get it.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Paetolus",
                            "body": "Yeah, people complaining about the Lin changes are really weird.\n\nI don't care about the breast slider either, although I think the original WiiU localizers overestimated how much people would have cared if it was left in.\n\n[Anyway, here's an interesting interview Jason Schreier did with the game's director back in the day about the localization stuff.](https://kotaku.com/xenoblade-chronicles-xs-director-on-localization-change-1796157409)",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "eatdogs49",
                    "body": "Oh brother...",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "pinkurocket",
                    "body": "mfw no boob slider or underage skimpy outfits :(",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "lightslinger",
                    "body": "I found the reason we got the embarrassingly horny gacha blades in 2.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Business717",
                    "body": "I heard you like em young",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Jazzlike_Athlete8796",
                    "body": "You are literally whining that you can't give a child giant breasts and ogle her in a skimpy swimsuit.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Ph33rDensetsu",
                            "body": ">can't give a child giant breasts\n\nThat's not how it works, lmao.\n\nThat's referring to MC who you customize the appearance of and they are an adult.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BabySealOfDoom",
                    "body": "Details?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Schitzl1996",
                            "body": "He's mad because he can't put a 13 year old into a bikini",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "JaxMed",
                            "body": "The English release removes the bust slider in the character creator and also some of the risqué outfits like the bunny suit lingerie get changed when worn by the child character. This offends the sensibilities of some anime fans",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Mushroomman642",
                            "body": "Old controversy from when the original came out 10 years ago. There was a feature to adjust the breast sizes of female characters in the JP version of the OG Xenoblade X that was removed in the international versions. That's probably what they're referring to by \"censorship\".",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "NintendoSwitch-ModTeam",
                            "body": "Hey there!\n\nPlease remember Rule 1 in the future - No personal attacks, trolling, or derogatory terms. Read more about [Reddiquette here](https://reddit.zendesk.com/hc/en-us/articles/205926439-Reddiquette). Thanks!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NintendoSwitch-ModTeam",
                    "body": "Hey there!\n\nPlease remember Rule 1 in the future - No personal attacks, trolling, or derogatory terms. Read more about [Reddiquette here](https://reddit.zendesk.com/hc/en-us/articles/205926439-Reddiquette). Thanks!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TerribleTerabytes",
                    "body": "While I agree that Western gamers are way too obsessed with the ages of fictional characters and are their ridiculous for their hatred of fan service...this isn't a hill to die on.   \n  \nThis is a 200+ hour game and what you are crying about is purely cosmetic. This game is an open world technical marvel, an absolute masterpiece of JRPG gaming. You won't miss the boobies THAT much.",
                    "score": -8,
                    "replies": []
                }
            ]
        }
    ]
}