{
    "title": "Do you think Nintendo will continue to make games for the Switch after the Switch 2 launch?",
    "author": "aZEROemerges",
    "subreddit": "NintendoSwitch",
    "rank": 14,
    "score": 0,
    "upvote_ratio": 0.47,
    "num_comments (reported by reddit)": 63,
    "url": "https://www.reddit.com/r/NintendoSwitch/comments/1jeg3bh/do_you_think_nintendo_will_continue_to_make_games/",
    "id": "1jeg3bh",
    "selftext": "The last Wii U game was released in 2023\n\nThe last 3DS game came out in 2023\n\nThe last Wii game came out in 2019\n\nThe last DS game came out in 2014\n\nThe last GameCube game came out in 2007 (not quite as impressive, but yeah)\n\n  \nNintendo certainly has a habit of keeping their consoles and handhelds alive well beyond their successor's launch date. The only exception being the GameCube cutoff just a year after the Wii's release. That was certainly understandable. And look at the Wii's longevity, last 13 years! Even the Wii U, which was lackluster lasted a hefty 11 years.\n\nAnyway... It took me a while to upgrade to the Switch, so I'm not sure when I'll get around to buying the Switch 2. Do you think we can expect the same with the Switch? I'm hearing talk that Metroid Prime 4 might get pushed to the S2. I'm hoping they'll do a dual release like with Twilight Princess in that case.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Heads up! r/NintendoSwitch is currently collecting nominations for our 2024 Games of the Year! \n\n* Name and vote on your favorite games [in our nominations post](https://www.reddit.com/r/NintendoSwitch/comments/1hzg4kp/2024_rnintendoswitch_goty_nominations_thread/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mindofone",
            "body": "Anything that was already in the Switch pipeline will probably release in the coming years, but then I suspect everything will move to Switch 2 pretty quick.",
            "score": 60,
            "replies": []
        },
        {
            "author": "notthegoatseguy",
            "body": "Nintendo didn't make any of those games that came out that late on the Wii U, 3DS or Wii. Those were all third party games.\n\nWe already know Pokemon Z-A is out later this year, and Pokemon has traditionally been a console behind. B2W2 came out after the 3DS, and Ultra Sun/Ultra Moon was on the 3DS after the Switch came out.\n\nI do not anticipate a long cross or previous gen support. First year or so and I think Nintendo will drop Switch support pretty soon after that.\n\nI think third parties will continue to support Switch, particularly for games that don't need the power boost like retro compilations. We're seeing similar things on PS4 where the RDR1 port and Marvel Vs Capcom compilation were put out on PS4 rather than PS5.",
            "score": 49,
            "replies": [
                {
                    "author": "siderinc",
                    "body": "Yeah a lot of people are expecting the new pokemon to drop on the switch 2 but I dont see that happening because of the things you said.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "FlowKom",
                    "body": "pokemon being \"one console behind\" in terms of production quality? more like 2 gens. there are xbox 360 games looking and running better than all pokemon switch games combined, minus new snap",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Blue_Bird950",
                            "body": "In terms of actual consoles. We don’t need another nintendo rage bait here, we have enough of those. Black 2 and White 2 were released on the DS while the 3DS was out, and Ultra Sun and Moon were released on the 3DS while the switch was already out.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HaouLeo",
            "body": "Nintendo themselves, probably not. Third parties, sure.",
            "score": 17,
            "replies": [
                {
                    "author": "munchyslacks",
                    "body": "Kirby has to see the console off. It’s tradition.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "goozy1",
                            "body": "How many Kirby games can they make in a generation?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "munchyslacks",
                                    "body": "Yes",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LeatherRebel5150",
            "body": "Im pretty sure all of those last games were released by other developers no? Like ubisoft with Just Dance and the like. Actual Nintendo produced games stopped well before those dates",
            "score": 17,
            "replies": []
        },
        {
            "author": "Dukemon102",
            "body": "Nintendo didn't support any of those consoles nearly as long.\n\nJust because some Third Parties or indies want to pull out the funny **\"I'm publishing the last game that existed on this console to be noticed\"** gag, that doesn't mean the console was supported for all those years.\n\nThe Wii U was a walking corpse by 2016. The Legend of Zelda: Breath of the Wild was the final and only Nintendo game for Wii U in 2017. After that it pretty much died permanently.\n\nSame for Kirby's Extra Epic Yarn for 3DS in 2019, Rhythm Heaven Fever for Wii in 2012, The Legend of Zelda: Twilight Princess for Gamecube in 2006 and so on.\n\nNintendo will probably support the Switch 1 for one or two more years (Because it's been successful) and after that they will drop it like they did with all their other consoles.",
            "score": 8,
            "replies": []
        },
        {
            "author": "derekhenkels",
            "body": "I'd predict third party games for years if the game doesn't need to be on Switch 2. The install base is huge already and it's backwards compatible so no rush to limit yourself. And it will probably be cheaper to produce them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beneficial_Ask_6013",
            "body": "I assume they'll be new switch games for another 2 years. Maybe 3, for 3rd party indie stuff. The fact switch 2 is backwards compatible means a game that can be for either will have a huge install base. ",
            "score": 5,
            "replies": []
        },
        {
            "author": "GabeReddit2012",
            "body": "They said they will still make games for it, just for a while\n\nThe Wii U was a absolute failure and only lasted 5 years.\n\nWii technically lasted 11 years, 2006 to 17.\n\nDS was 10 years.\n\n3DS was 9 years.",
            "score": 6,
            "replies": []
        },
        {
            "author": "roto_disc",
            "body": ">I’m hearing talk\n\nFrom reputable sources, I’m sure.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Lee_Troyer",
            "body": "Nintendo will for a while for sure, and third party most likely for even longer. \n\nWith backward compatibility, you can publish a game and access both the Switch's and the future Switch 2's users.\n\nThat's why there are still games published this year on the PS4, four years into the PS5's lifespan, and the PS4's install base is smaller than the Switch's.",
            "score": 3,
            "replies": [
                {
                    "author": "tom_yum_soup",
                    "body": "I think indie games, in particular, will continue to launch for both systems for a few years, at least. They tend to have lower spec requirements, so making their games available for Switch and Switch 2 gives them a bigger install base to shoot for.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RockRik",
            "body": "Prolly not for long, lets be honest Switch is very weak by mid 2020s standard but Im sure the devs whove supported it thus far will continue if their game isnt too demanding. Just dont expect stuff like Doom Dark Ages on Switch 1 lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fit-Lack-4034",
            "body": "Like some lower end third party games and indie games will be available on switch 1 but anything Triple-A from Nintendo or third parties will be switch 2 only for the most part",
            "score": 2,
            "replies": []
        },
        {
            "author": "d3gaia",
            "body": "What I really want to know is whether our switch digital games will still be available to play on switch 2 when it drops. Haven’t seen any info or discussion on this anywhere",
            "score": 2,
            "replies": [
                {
                    "author": "Blue_Bird950",
                    "body": "Yes. If the physical games are able to be ported, the digital ones certainly are.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fakemoon",
            "body": "I expect that third party development when possible will support the original hardware on the eShop for many years. There's a huge appetite for less hardware intensive games generally, and if it can be developed without incurring additional huge development costs I'd like to think that we'll see some bangers hitting the original hardware for a while ",
            "score": 2,
            "replies": []
        },
        {
            "author": "goro-n",
            "body": "I give it a maximum of 2 years. Some SNES games released in 1998. Some NES games released in 1992-1993. If Nintendo wants people to buy Switch 2s, they have to release exclusive games or it’s not going to work out. But continuing games on Switch also gives them a lifeline in case Switch 2 doesn’t start out as strongly as they expect",
            "score": 2,
            "replies": []
        },
        {
            "author": "Curun",
            "body": "For a time.  This will be the easiest.  Same controller user form.  \nSimilar soc gpu family.  ",
            "score": 2,
            "replies": []
        },
        {
            "author": "JavenatoR",
            "body": "Yes they absolutely will. Some of the games that will be released will run perfectly fine for both consoles and therefore will be released for both consoles. Only the games that just will not run on the Switch will be released solely for Switch 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZGMF-X09A_Justice",
            "body": "I feel like they won't have much reason to keep making cross-gen games. It's Nintendo, we all know people are gonna buy the Switch 2 asap.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pokeguy211",
            "body": "Ofc but btw the Wii U game (pretty sure it’s captiain u) wasn’t made by Nintendo so that doesn’t really count. In fact Wii U is like the only console Nintendo has never released a game for after its successor came out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MultiMarcus",
            "body": "I don’t think Nintendo will. I could see some games from the end of the switch era being multiplatform so they might have both a switch one version and a switch 2 mode that has higher fidelity settings or whatever. Third parties will probably keep launching stuff on the older platform but I think the rule of thumb is that for the platform maker it’s very important to get people to move over to the successor console. It’s why at the start of the PS5 only a very short list of titles were exclusive to the new hardware and that was almost entirely Sony titles because there needs to be some reason for people to buy the new console that isn’t just playing the old games at a higher resolution or frame rate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gorgeoff",
            "body": "Dance Dance Revolution will support it until 2040",
            "score": 1,
            "replies": []
        },
        {
            "author": "coughcough",
            "body": "Yes, almost certainly. I'd expect many joint releases on Switch and Switch 2, with the occasional \"Switch 2 exclusive,\" for at least a few years.",
            "score": 1,
            "replies": [
                {
                    "author": "D_Beats",
                    "body": "Nintendo doesn't do that. When a new Nintendo console comes out, they focus on that new console.\n\nThird parties? Maybe. But Nintendo is going to abandon new releases on the switch pretty fast. Only games that are currently in development for the switch will get released.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tolucawarden01",
            "body": "All the “last games” you mentioned were not first party. \n\nWii and Wii u games stopped the second the switxh came out. \n\n3ds had a few more for years after.\n\nSo no real way to tell",
            "score": 1,
            "replies": []
        },
        {
            "author": "lemoche",
            "body": "depends on the game and the demands.  \nit’s certainly a pickle… on the one hand if you don’t make switch 2 exclusives many people don’t have a reason to upgrade but if you do you're shutting out the currently biggest player base.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Majestic_Electric",
            "body": "Yes, but only for the first year, at least.\n\nAfter 2026 would depend on the Switch 2’s first-year sales.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandomShyguy4",
            "body": "Yes, but ambitious 1st party games and more modern games will probably be exclusive.\n\nI’m coping that Poe 2 will make its way to Switch 2 and run decently.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Griffdude13",
            "body": "What im curious about is if they’ll release performance patches for previous games. For instance, getting Breath of the Wild or Tears of the Kingdom with increased resolution and performance would be a huge gesture of goodwill to early Switch 2 adopters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ISpewVitriol",
            "body": "My prediction is that Metroid Prime 4 will be the last major 1st party Switch 1 game and after that Nintendo will be full Switch 2 with their own titles. There will still be Switch 1 games that come out from 3rd parties, but Nintendo's next 3d Mario game, etc. will all be Switch 2.\n\n> I'm hearing talk that Metroid Prime 4 might get pushed to the S2.\n\nThe DF guys have talked about this in their direct and concluded that what has been shown off so far is pretty consistent, graphically, with the Metroid Prime Remake. Based on that it is likely going to be a Switch 1 game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cabbage_Vendor",
            "body": "Depends of how big the Switch 2 launch is, but as it's backwards compatible, there's not a big rush. They can have games that release on Switch 1 but have better performance on Switch 2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ledairyman",
            "body": "don't worry I'm pretty sure they will continue to make games for the switch two",
            "score": 1,
            "replies": []
        },
        {
            "author": "VCBeugelaar",
            "body": "Hope not",
            "score": 1,
            "replies": []
        },
        {
            "author": "raylan_givens6",
            "body": "Hopefully nothing after 2025 \n\nSwitch owners have a huge library so it should be ok to move on \n\nOne of the many big flaws of this past gen of Xbox and PS5 was trying to satisfy both SeriesX /PS5 and older gens \n\nAfter 2025 it should 100% swtich 2 only",
            "score": 1,
            "replies": []
        },
        {
            "author": "AmirulAshraf",
            "body": "Not before my Rhythm Heaven 😭🥺",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ryan1006",
            "body": "The Wii only kept getting games because Just Dance kept releasing their yearly version on it until 2019… did they do the same with WiiU?  What was the game\nreleased in 2023 on the WiiU?\nI suspect Just Dance will do a Switch version for a few years after.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kingofdarkness35",
            "body": "Long as OG switch games are backwards compatible it doesn’t matter to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jackolantern_",
            "body": "Yeaaah doi",
            "score": 1,
            "replies": []
        },
        {
            "author": "TVLubber",
            "body": "Perhaps for at least 2-3 years after the Switch 2's launch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Charlirnie",
            "body": "I fully expect Radiant Historia to be announced 6 months after Switch 2 is out ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yerm_Terragon",
            "body": "Nintendo kinda has a history of saying they will continue to support platforms when they dont. The DS was originally pushed as a new idea that would exist alongside the GBA, and then swiftly took over their whole handheld market. The Switch was even originally positioned as a \"third pillar\" platform and that the Wii U and 3DS would both still be supported. We know how that turned out. It feels like right now they are trying to come off as though the Switch will still be supported, but Im not expecting any first party games for it after the first year of the Switch 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrankPapageorgio",
            "body": "Even if the game is simple enough to run on Switch 1, they'll want to push sales to Switch 2 and release it there.\n\nLike if they finally release Wind Waker HD that game is perfectly capable of running on Switch 1, but it will be a Switch 2 thing",
            "score": 1,
            "replies": []
        },
        {
            "author": "weallfloatdownhere7",
            "body": "Nope they’ll definitely stop making games for their most successful console of all time the moment the Switch 2 comes out",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlowKom",
            "body": "indie and smaller games from third parties will still release on switch, simply because the installbase is so huge.\n\nBut Nintendo will end support for their first party games by the end of 2025, or even earlier. i think metroid prime 4 and Pokemon Z-A are the last big titles for the system.\n\nThe next zelda is probably already in developemnt exclusively for switch2. Same with the next gen of pokemon (boutta look like bad wii u games), Metroid 6 by mercury steam, aswell as the next 3D mario and so on...",
            "score": 1,
            "replies": []
        },
        {
            "author": "That-Molasses9346",
            "body": "At first, they will most likely make Switch and Switch 2 compatible games but itll be more minor stuff. The big titles will be Switch 2 only and that's because Nintendo's mantra is software sells hardware. But as long as there is interest in Switch they will continue to support it is what they've said themselves",
            "score": 1,
            "replies": []
        },
        {
            "author": "Martokk78",
            "body": "They won't abandon a 100+ million install base quickly. They are in the business of selling software. If Switch 2 sells through quickly then that would certainly tip the scales. However, I think that Switch will continue to be supported for at least two years, with strong support dying by year one and then tapering off in year two.",
            "score": 1,
            "replies": []
        },
        {
            "author": "illogicaldreamr",
            "body": "I don’t know if Nintendo will, but other companies might.",
            "score": 1,
            "replies": []
        },
        {
            "author": "8isnothing",
            "body": "No, I don’t think so.\nThis time the new console has basically no differentiator that we know, so they’ll probably just release games for Switch 2 so people buys the new console.\nReleasing games for the Switch 1 will not encourage people to upgrade; on the contrary, actually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sophronia-",
            "body": "No",
            "score": 1,
            "replies": []
        },
        {
            "author": "LivingOof",
            "body": "If they're making games for a non compatible console 2 years after the Switch comes out, there's no reason the less demanding games can't still be released on the Switch when the 2 is backwards compatible. I spent most of my first year with a 3ds playing Pokemon Black 2, although I did upgrade to use the Dream Radar",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarkCh40s",
            "body": "GOWR and Horizon 2 still got PS4 releases despite PS5 already being out.",
            "score": 1,
            "replies": [
                {
                    "author": "Brees504",
                    "body": "Horizon 2 is weird because it does not have full PS4 support. It’s DLC is PS5/PC exclusive. GOWR is fundamentally the same tech as 2018 so it was easy to keep it on PS4.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FlowKom",
                    "body": "yeah because sony themselves didnt believe in their own next generation and wanted to suck off the PS4 installbase... and now they have done it for so long that the PS5 has like 3 years left and there are like 3 games exclusive to it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sneeches",
            "body": "I hope not.",
            "score": 1,
            "replies": []
        }
    ]
}