{
    "title": "A cool guide to which states have the highest housing costs as a percentage of household income",
    "author": "Gard3nNerd",
    "subreddit": "coolguides",
    "rank": 14,
    "score": 428,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 54,
    "url": "https://i.redd.it/cfrvzexfi4pe1.png",
    "id": "1jczuuj",
    "selftext": "",
    "comments": [
        {
            "author": "theajharrison",
            "body": "A cool guide of where the majority of people want to live.",
            "score": 61,
            "replies": [
                {
                    "author": "Aprice40",
                    "body": "Or inversely, where a majority of people do not want to live.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Fourstringking87",
                            "body": "Bingo",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "imphatic",
                            "body": "And yet do, hence the higher cost to live there.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Cetun",
                                    "body": "No, America is capitalist, higher demand means higher prices. However much people shit on California and Florida, people actually really want to live in these places, which is why supply of housing doesn't meet demand and thus you have increased prices.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "bankman99",
                                            "body": "What makes it even more low supply high demand is that in CA and FL only a small amount of coastline is truly desirable. All the wealth and cost is concentrated in small areas but in insane amounts. \n\nMost of CA and FL overall are uninhabited and in Floridas case, super shitty.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Practical-Suit-6798",
                                                    "body": " Lol at most of California is uninhabitable. That's um not true.   Rural California is awesome.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "bankman99",
                                                            "body": "Uninhabited /= uninhabitable. Agree there are a lot of great places, just not nearly as populated as the coastal areas.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Practical-Suit-6798",
                                                                    "body": "I can't read apparently.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bankman99",
                            "body": "You mean the places you’ve never been to",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Serious-Cucumber-54",
                    "body": "\\+ where growth of the housing supply is most restricted",
                    "score": 2,
                    "replies": [
                        {
                            "author": "theajharrison",
                            "body": "I mean, kinda a moot point. Places that aren't in high demand don't implement restrictions. \n\nNorth Dakota isn't exactly putting regulations in place against a flood of new residents. Why? Because people don't *really* give a fuck about living in ND.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Serious-Cucumber-54",
                                    "body": "Places with little to no demand do still place restrictions, through zoning, density restrictions, NIMBYs, etc., but because they have little to no demand there's little incentive put towards growing the supply and so any diminishing effects the restrictions would otherwise have on supply growth basically do not show up.\n\nThe places with high demand however do see the effects of these restrictions. The places which are most short in housing supply relative to demand are the most expensive and those places typically have some of the most restrictive policies towards supply growth.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "theajharrison",
                                            "body": "Yeah, you're kinda proving my point.\n\nGeneral demand matters way more than any regulations. As the impactful regulations are a *reaction* to the demand in the first place. \n\nYou get what I mean? It's kinda moot. Because demand triggers it.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Serious-Cucumber-54",
                                                    "body": "The restrictions are always there, they just cause a shortage in supply in places where there is demand.\n\nThe places with no demand are not seeing any supply increase in response, so any supply restrictions would have no effect on supply increases. The places with demand would see supply increases in response, so supply restrictions would have an effect on these supply increases.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "theajharrison",
                                                            "body": "Are you suggesting that North Dakota is building more homes than California? \n\nCuz otherwise, again, you're proving my point, that demand is the primary focus.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Serious-Cucumber-54",
                                                                    "body": "I am not suggesting that, I am saying California is more short in housing supply relative to demand than North Dakota is. California could be more like North Dakota if they didn't have such restrictive policies towards supply growth.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "theajharrison",
                                                                            "body": "I'm sorry man, you're diving into a very pedantic point on a generally valid statement that I made. \n\nMaybe you're right, maybe you're not. But it's such a minor equivocation you are making on a casual reddit post, that, quite frankly, I don't have it in me to care.\n\nSo for your ego's comfort, let's say that you are correct. And I was somewhat mistaken.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CO-RockyMountainHigh",
                    "body": "People want to live in Nevada?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RMAJTM17",
            "body": "Housing cost $2k in CA is no where near correct!!! It’s astronomically higher.  This graphic is way off base across the board",
            "score": 23,
            "replies": [
                {
                    "author": "pdxnative2007",
                    "body": "Looks like prices from 1999.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "nfwmb",
                    "body": "Same for Hawaii...",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "0verstim",
                    "body": "I have heard CA is pretty big. it might even be three or four times bigger than just San Francisco.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "PalpitationFine",
                            "body": "That's a common myth perpetuated by people not constantly on reddit",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarkusAureleus",
                    "body": "They’re using median numbers, so it doesn’t take into account how much those numbers (rent and salary) skyrocket when you get into California’s most expensive cities",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gard3nNerd",
            "body": "[original source](https://www.madisontrust.com/information-center/visualizations/which-states-have-the-highest-housing-costs-as-a-percentage-of-household-income/) of the guide",
            "score": 7,
            "replies": []
        },
        {
            "author": "Airick39",
            "body": "Take me home.",
            "score": 16,
            "replies": [
                {
                    "author": "MyNameCannotBeSpoken",
                    "body": "Country Roads",
                    "score": 10,
                    "replies": [
                        {
                            "author": "fitness_life_journey",
                            "body": "lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChaoticAmoebae",
            "body": "Mountain Mama here I come!",
            "score": 5,
            "replies": []
        },
        {
            "author": "BakingAspen",
            "body": "As a Nevadan, this hurts. Our economy is such a disaster. In Reno and Vegas tourism and hospitality are huge parts of the economy, but those industries earn us much more gentrification than good wages. Then there’s our more rural areas, which are shockingly not as cheap as you’d think. In fact, Elko is the most expensive part of the state because of money from mining. People doing administrative work for the industry live large but the service jobs that support them aren’t paid nearly enough to keep up. Add to that the fact that we’re a tax haven and most of the new housing we build is for rich people moving from out of state, and we’re just plain fucked.",
            "score": 3,
            "replies": [
                {
                    "author": "anxietylemons",
                    "body": "The way Nevada is heading makes me so sad. It’s my home but my husbands in the military for 5 more years. It might be too expensive for us to live there in 5 years.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gingersnap3514",
            "body": "I live in Indiana and would love to make over 5k a month",
            "score": 7,
            "replies": [
                {
                    "author": "turtlturtl",
                    "body": "It’s household not individual",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "awesome_jackob123",
                    "body": "I live in Indiana. I pull around 5 a month. \n\nIt still sucks",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Suitable-Ad6999",
            "body": "I would not have figured Florida, Oregon or Washington being so high. Unless Miami, Portland and Seattle are skewing it respectively.",
            "score": 3,
            "replies": [
                {
                    "author": "KetUhMean",
                    "body": "In FL since COVID all rental prices have absolutely skyrocketed, you cannot find a studio shack for less than $1k monthly excluding utilities unless you search and get very lucky",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Cinci555",
                    "body": "Oregon and Washington are going to be greatly influenced by Portland and Seattle respectively. \n\nBoth metro areas account for ~50% of their states total population.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Embarrassed-Town-293",
            "body": "Glad to be in Illinois.  Good income, reasonably priced homes depending on where you look, and access to fresh water.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ricekrispies34",
            "body": "Surprised to see Nevada so high on the list.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Joey_Beans",
            "body": "1500$ average in NY? If half my town was homeless those numbers would still be low.",
            "score": 2,
            "replies": [
                {
                    "author": "Miss_Panda_King",
                    "body": "No 1500 median. But even favoring margin of error favorably it’s still about 17-1800 a month.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "withagrainofsalt1",
            "body": "Wisconsin gets the most bang for the buck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nitttt",
            "body": "This is from 2023",
            "score": 1,
            "replies": []
        },
        {
            "author": "swoleswoleswole1869",
            "body": "doing this for my state is just bonkers, sure the northern half you can find most anything for a grand or cheaper a month but in the southern half you can’t find anything under 2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loomis1971",
            "body": "Accurate for the year 2023, when this graph was created?  Tennessee should be a little higher.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlagrantAirpower",
            "body": "I’d like to see DC on this chart.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Relation5965",
            "body": "Bad guide not true at all. It says $1300+ per month for my state and it would cost closer to $3000.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Teach1720",
            "body": "As someone buying a house, this data is off a bit. Things have changed in the 1.5-2 years. It may still be the same ordering, but inflation and proportion aren’t the same. It’s 40% of our income with current rates.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weak_Carpenter_7060",
            "body": "A lot of coal cracking towns are doing a lot of work for WV and PA",
            "score": 1,
            "replies": []
        },
        {
            "author": "tech-badger",
            "body": "As someone who lives in Orlando, FL I can confirm it's expensive as shit with wages that just barely get you by. I'm in a 2/2 townhouse paying a little more than $1100/ month for rent and utilities and we managed to find a cheap one. Thankfully prices have started to come down as there is an apartment complex 20 min away that was charging about $1900 for just a studio last year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "snowyoda5150",
            "body": "Actually makes a good case for the shit red states",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMysteriousSalami",
            "body": "It’s like a ranking of states, from cool to uncool,",
            "score": 0,
            "replies": []
        },
        {
            "author": "Different-Flow4322",
            "body": "These numbers have to be off try and find an apartment in NY for less than $2800 per month",
            "score": 0,
            "replies": []
        }
    ]
}