{
    "title": "Wisconsin man dies after inhaler cost jumps $500, according to family's lawsuit",
    "author": "_CriticalThinking_",
    "subreddit": "LateStageCapitalism",
    "rank": 472,
    "score": 742,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 14,
    "url": "https://abcnews.go.com/US/wisconsin-man-dies-after-inhaler-cost-jumps-500/story?id=118422131",
    "id": "1ihje5k",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "merRedditor",
            "body": "There should be a class action against the private equity and private insurance-driven healthcare system, on behalf of everybody.",
            "score": 178,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 66,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 25,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 46,
            "replies": []
        },
        {
            "author": "cjalas",
            "body": "He made the fatal mistake of being poor and born with asthma and in the US\n\n\n/s",
            "score": 18,
            "replies": []
        },
        {
            "author": "itskey_lolo1",
            "body": "Omggg so scary as I’m fighting to figure an alternative to my Dulera that I can realistically afford monthly smh",
            "score": 9,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "lucker12345",
                    "body": "(not defending or opposing any side with this comment just don't want wrong info being spread) if you read the article you would find the death took place in January of last year and has nothing to do with the current administration",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}