{
    "title": "when capitalism doesnt mix with environmental protections, just change the rules. again.",
    "author": "novahkiin_around",
    "subreddit": "LateStageCapitalism",
    "rank": 461,
    "score": 29,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iik0be/when_capitalism_doesnt_mix_with_environmental/",
    "id": "1iik0be",
    "selftext": "the new pillars to guide the EPA were announced. \"Powering the Great American Comeback initiative.\" im no scientist or bartender, but i dont think these mix well. you can go to the epa website to check them out or read below.. after my venting.\n\nthe language used is something of note. there is talk of \"hard working, middle income families\" but no mention of low income. saying we'll stop relying on \"adversaries\" for energy.. i thought adversaries were sanctioned, not business buddies. also, \"dominance\" in clean energy, my ass.\n\nthe last pillar, sounds like there will be more and/or larger sacrificial zones. those are areas with hot spots for pollution (like around factories). the people in these zones are just about always low income. instead of sacrificing profit, we sacrifice people and land.\n\n\n\nthe pillars are:\n\nPillar 1: Clean Air, Land, and Water for Every American\n\n“Every American should have access to clean air, land, and water. I will ensure the EPA is fulfilling its mission to protect human health and the environment. In his first term, President Trump advanced conservation, reduced toxic emissions in the air, and cleaned up hazardous sites, while fostering economic growth for families across the country. We remain committed to these priorities in this administration, as well as ensuring emergency response efforts are helping Americans get back on their feet in the quickest and safest way possible. We will do so while remaining good stewards of tax dollars and ensuring that every penny spent is going towards advancing this mission,” said Administrator Zeldin.\n\nPillar 2: Restore American Energy Dominance\n\n“Pursuing energy independence and energy dominance will cut energy costs for everyday Americans who are simply trying to heat their homes and put gas in their cars. This will also allow our nation to stop relying on energy sources from adversaries, while lowering costs for hardworking middle-income families, farmers, and small business owners. I look forward to working with the greatest minds driving American innovation, to ensure we are producing and developing the cleanest energy on the planet,” said Administrator Zeldin.\n\nPillar 3: Permitting Reform, Cooperative Federalism, and Cross-Agency Partnership\n\n“Any business that wants to invest in America should be able to do so without having to face years-long, uncertain, and costly permitting processes that deter them from doing business in our country in the first place. It will be important for the EPA to work with our partners at the state and federal levels to ensure projects are being approved and companies can invest billions of dollars into our nation. Streamlining these processes, while partnering with businesses to follow the necessary steps to safeguard our environment, will incentivize investment into our economy and create American jobs,” said Administrator Zeldin.\n\nPillar 4: Make the United States the Artificial Intelligence Capital of the World\n\n“As we rapidly advance into this new age of AI, it is important that the United States lead the world in this field. Those looking to invest in and develop AI should be able to do so in the U.S., while we work to ensure data centers and related facilities can be powered and operated in a clean manner with American-made energy. Under President Trump’s leadership, I have no doubt that we will become the AI capital of the world,” said Administrator Zeldin.\n\nPillar 5: Protecting and Bringing Back American Auto Jobs\n\n“Our American auto industry is hurting because of the burdensome policies of the past. Under President Trump, we will bring back American auto jobs and invest in domestic manufacturing to revitalize a quintessential American industry. We will partner with leaders to streamline and develop smart regulations that will allow for American workers to lead the great comeback of the auto industry,” said Administrator Zeldin.\n\n\nedit: the site is https://www.epa.gov/newsreleases/epa-administrator-lee-zeldin-announces-epas-powering-great-american-comeback",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "znyhus",
            "body": "Because growing AI and reviving the American auto industry are such vital pillars of environmental protection...",
            "score": 9,
            "replies": [
                {
                    "author": "novahkiin_around",
                    "body": "as well as the healthcare industries! theyll be booming with more cases of asthma and various forms of cancer",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrashCulture",
            "body": "Well... we didn't need a planet to live on anyway...",
            "score": 3,
            "replies": []
        }
    ]
}