{
    "title": "The Left has been correct about every US intervention while liberals deny it",
    "author": "Aggressive-Isopod-68",
    "subreddit": "LateStageCapitalism",
    "rank": 420,
    "score": 454,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 23,
    "url": "https://i.redd.it/svr01jqpwjhe1.png",
    "id": "1ij7l34",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Straight-Razor666",
            "body": "There's a massive body of scholarly work produced over decades that proves without question that the US seeks out and viciously destroys any real democratic action wherever it may exist.  \n\nTake an hour of your life and watch Parent's \"Yellow Lecture\" from 1986.  He'll give it to you on the \"true true\".",
            "score": 113,
            "replies": [
                {
                    "author": "squatchbennett",
                    "body": "All hail the Piss filter lecture",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "That’s because liberals like fascism",
            "score": 62,
            "replies": [
                {
                    "author": "NormieSpecialist",
                    "body": "Fascism wrapped in a rainbow flag mind you.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "ZrxXII",
                            "body": "Yeah, shitlibs only pretend to care about lgbtq rights as a performative act to garner votes from lgbtq allies and queer people like me. Then they'll just let the fascists strip away our human rights",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "NormieSpecialist",
                                    "body": "Me as well.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "russian_banya",
            "body": "Ah the old \"the difference between a liberal and a leftist is that liberals support every resistance movement except the current one\"",
            "score": 15,
            "replies": []
        },
        {
            "author": "Anti_colonialist",
            "body": "This is the org fucking liberals are defending. They think they're more intelligent than maga when they fall for the same tricks as maga. All they have to do is be told something they're barely familiar with is under threat and they will defend it tooth and nail. They did the same thing for the ACA",
            "score": 40,
            "replies": [
                {
                    "author": "NormieSpecialist",
                    "body": "Some aren’t even ignorant  of this. But they’ll keep supporting the party because they just want to own the conservatives as much as the conservatives want to own them.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Anti_colonialist",
                            "body": "They would never tear down an exploitive system when they benefit so much from it, so the virtue signal for those that are oppressed under that system.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bullhead2007",
            "body": "Being a Socialist is a constant series of being correct too early.",
            "score": 29,
            "replies": []
        },
        {
            "author": "VadersSprinkledTits",
            "body": "It’s amazing to me that anyone can’t put two and two together. The US’s ability to print money without destroying the dollar is directly linked to its trillion dollar military, and the ability to destabilize and change governments around the globe that may interfere with the stranglehold.",
            "score": 9,
            "replies": []
        },
        {
            "author": "VINCE_C_",
            "body": "USAID is a CIA front that hides behind a few genuinely good and helpful projects. If there is one good thing that comes from the idiot nazi gang carnage of US the government, it's this.",
            "score": 9,
            "replies": []
        },
        {
            "author": "justsomerandomdude10",
            "body": "Maybe if we're so worried about foreign interference in our elections we should stop interfering with other countries elections",
            "score": 3,
            "replies": []
        },
        {
            "author": "yojimbo1111",
            "body": "Lol, Trump is dismantling key components of America's mechanisms of global control",
            "score": 6,
            "replies": []
        },
        {
            "author": "1stepklosr",
            "body": "The articles I can find about this say Guaido stole money from USAID that was supposed to be for humanitarian aid.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Significant-Gap-6891",
            "body": "I'm having trouble finding the article could you provide a link please?",
            "score": 6,
            "replies": [
                {
                    "author": "ZrxXII",
                    "body": "I couldn't find it either, but [this article](https://orinocotribune.com/fbi-investigates-juan-guaido-and-carlos-vecchio-for-misappropriation-of-usaid-funds/) explains the situation",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ZrxXII",
                            "body": "Damn I'm being downvoted. I was trying to be helpful",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "notthefilmdirector",
            "body": "The CIA is getting sloppy with their coup d'etat department. In 1970, the US government \"only\" spent $8 million to overthrow Allende here in Chile (adjusted for inflation, that's just shy of $65 million in 2024)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConsistentlyPeter",
            "body": "Its quite jarring as a Brit sometimes on this sub- “liberal” is what we’d use to describe the Left. ",
            "score": -4,
            "replies": []
        }
    ]
}