{
    "title": "POV: You live in a U.S. colony, rebelled against the U.S. Empire during the Cold War, tried to assassinate Harry Truman, got bombed by U.S. planes, and even shot up Congress, but everyone forgets about it since your followers were outmaneuvered every time and your insurgency never went anywhere.",
    "author": "lightiggy",
    "subreddit": "LateStageCapitalism",
    "rank": 284,
    "score": 122,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 9,
    "url": "https://i.redd.it/kabpcf4pwyie1.png",
    "id": "1iosyoi",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "BX_NYC_Phan",
            "body": "My uncle, aunt and cousins who still live in that occupied colony are staunch independentistas who haven’t forgotten about and know their real history. \nI stand with them 100%. Fuck the hypocritical USA (who was once a colony itself) and the bootlicking statehooders there and in the diaspora who support the usa. \nDeath to amerikkka✊🏼. \nLibre Puerto Rico !",
            "score": 24,
            "replies": []
        },
        {
            "author": "puertorique_o",
            "body": "If you are interested in Puerto Rican independence movement you should look into Filibeto Ojeda Rios assassinated by the us government also look what the cia did to Albizu Campos look for las carpetas and the macheteros",
            "score": 9,
            "replies": [
                {
                    "author": "BX_NYC_Phan",
                    "body": "My paternal grandfather has a carpeta on him in D.C. \nI would not be surprised if they have one on me for all my outspoken rhetoric about Independence For Puerto Rico.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "lightiggy",
            "body": "TFW you see Harry Truman and are about to assassinate him when that guard whom you shot three times in the chest decides to take you with him, gets back up, stumbles out of his booth, and proceeds to one-shot you from 31 feet away:\n\nhttps://preview.redd.it/24ztlccvxyie1.png?width=691&format=png&auto=webp&s=091836f72b9d477695fdd1d4c59a894fbae98357",
            "score": 16,
            "replies": [
                {
                    "author": "op4arcticfox",
                    "body": "Always make sure you killed em before moving on. The third shot should have been to the guards head.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Based",
            "score": 3,
            "replies": []
        },
        {
            "author": "Optimal-Teaching7527",
            "body": "That guy on the right really looks like Orlando Bloom.",
            "score": 3,
            "replies": [
                {
                    "author": "pd-fille",
                    "body": "I was thinking that... Orlando BOOM haha... Yea...",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}