{
    "title": "Is there any literature I can read to get started on learning the history of privatized utilities?",
    "author": "SunsetBeachBowl",
    "subreddit": "LateStageCapitalism",
    "rank": 270,
    "score": 31,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iptlx1/is_there_any_literature_i_can_read_to_get_started/",
    "id": "1iptlx1",
    "selftext": "I know it all probably boils down to greed and stuff but I’m trying to wrap my head around why taxes can’t go to municipalities to keep up the water, gas, electricity infrastructure instead of having to pay private companies who are overcharging . \n\nI just want to learn more about it, even if it turns out that citizen taxes wouldn’t be the best solution. Idk I’m just tired of feeling like I’m getting charged an arm and a leg for irrigation, electricity, and heat. \n\nThanks in advance. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "-zybor-",
            "body": "The Dreamt Land by Mark Arax is about how capitalists like the Resnicks owning 60% of California of water resources for industrial agriculture.",
            "score": 11,
            "replies": []
        },
        {
            "author": "LordTravesty",
            "body": "I used to say if you want to learn about any subject, start with its history. Great question i think, though its beginning is probably more blurry than the recent context so i might reccommend putting a time frame such as since the beginning of USA, if thats what youre interested in. Get the right question and then you could take it to askhistorian for a higher quality answer, if not literature recommendations.",
            "score": 5,
            "replies": [
                {
                    "author": "SunsetBeachBowl",
                    "body": "Thank you for the ask historian sub recommendation.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "LordTravesty",
                            "body": "Its a top tier sub around here, glad to help.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "smughippie",
            "body": "Start searching on google scholar. If the article is behind a paywall, check the authors website. Many academics post their work there. And you can always reach out and ask them to send it to you. I get asked to send articles to people and always send them the article . Not like I make any extra money off of the journals that profit from my labor.",
            "score": 4,
            "replies": []
        },
        {
            "author": "tfe238",
            "body": "Blackshirts and reds?",
            "score": 3,
            "replies": []
        },
        {
            "author": "rawrishere",
            "body": "I'm reading through The Grid by Gretchen Bakke now and it is giving a good historical summary of electricity. Writing style is okay but the content is very interesting to me",
            "score": 3,
            "replies": []
        },
        {
            "author": "DifficultAnt23",
            "body": "Many municipalities run their own utilities.  .... In the early days, there'd be numerous small telephone exchanges running different neighborhoods.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TweeksTurbos",
            "body": "I lived in a place that kept the elect. Frankfort, NY.",
            "score": 2,
            "replies": []
        },
        {
            "author": "An_Agrarian",
            "body": "I think a lot of it was co-ops originally we still have a privately owned internet and phone company around here but yes I think you're on the right track not only that we all pay insurance and it does nothing to remove any of the risk or to mitigate the risk how dumb are we.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Taedaaa_itsaloblolly",
            "body": "So, I haven’t read any books on it, but in my area there are two power companies. Georgia Power and a local customer owned power company. You don’t get to choose, it is based on where you live, but I’ve talked to my mother in law(in her 80s) about the local one, and she remembers when they went around getting people to sign up, and the incentives they provided. She owns a share of the company and can cash out, I think, anytime, but she plans on holding onto it and letting her kids cash it out. I know Georgia Power has acquired a lot of these local power companies, and, I would assume, dismantled their original promises and such. \n\nMy assumption based on what I know, is that originally when the services became available (either through government funding or community desire) little local companies went round to everyone and offered incentives to get enough “customers” on board to motivate implementation of the infrastructure. Then later, companies either became insolvent or were offered incentives/threats from larger companies that then acquired the smaller companies and became big powerhouses like GeorgiaPower. After getting to a certain level of monopoly, customer satisfaction became less of a motivator for the companies (like Southern Bell, an awful phone company, that only lost its power after the rise of cell phones and internet or the cable companies, who only lost power after the rise of Netflix). \n\nThere is corollary between this and the apple houses in Ellijay. From what I’ve read, the apple houses started as coops formed during the government funding era after the depression (cc camps and all that), none of them are coops now, they are all individually owned usually by one family. My best guess on how this happened was either, those families were heavily involved with the coop and interest waned/money got tight and they bought out the others, or they swooped in and purchased it in a financially stressful time. It’s possible it was more insidious depending on who they were. I’ve heard some real horror stories of what some of the richest folks have gotten up to in this area. I do have a good book on that type of thing about the kaolin industry’s start in Washington County called Red Clay, Pink Cadillacs and White Gold. It’s out of print but well worth finding at the library. It kind of opens your eyes on the bullshit straight up lies and trickery that can be involved in parting poor folks from something valuable.",
            "score": 2,
            "replies": []
        },
        {
            "author": "imminentmisanthrope",
            "body": "Shock Doctrine by Naimi Klein. \n\n\nDetails the rise of Friedman economics and how it has been applied and the relevance to what is currently happening with the Trump administration. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "threebutterflies",
            "body": "Like Enron?",
            "score": 1,
            "replies": []
        }
    ]
}