{
    "title": "Body cam of Lincoln Heights residents confronting Nazis in Cincinnati, Ohio.",
    "author": "anohioanredditer",
    "subreddit": "LateStageCapitalism",
    "rank": 256,
    "score": 991,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 72,
    "url": "https://v.redd.it/kaee9ynt4aje1",
    "id": "1ipyl7a",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ddwood87",
            "body": "Didn't realize they had to chase off the uniformed nazis before the cosplaying nazis. Based.",
            "score": 416,
            "replies": [
                {
                    "author": "falconwool",
                    "body": "On duty cops protecting off duty cops",
                    "score": 286,
                    "replies": [
                        {
                            "author": "strangewayfarer",
                            "body": "Some of those that work forces...",
                            "score": 107,
                            "replies": [
                                {
                                    "author": "Chrisbert",
                                    "body": "...are the same that burn crosses.",
                                    "score": 44,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Aggravating-Yam-8072",
                            "body": "Yeah because then there was footage of a police  vehicle escorting the U-Haul through the back of a school parking lot.",
                            "score": 36,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ittollsforthee1231",
            "body": "Cop: It ain’t worth it.\nMan: Yes it IS. You KNOW it is. \n\nIncredible. Truly a perfect response. May we all carry this attitude.",
            "score": 386,
            "replies": [
                {
                    "author": "Farmgirlmommy",
                    "body": "Yes. 💯 well done! Real men standing up.",
                    "score": 53,
                    "replies": []
                },
                {
                    "author": "Directionnn",
                    "body": "What actual patriotism looks like",
                    "score": 58,
                    "replies": [
                        {
                            "author": "advicegrip87",
                            "body": "In a squarely right-wing country like the US that funded Nazis during WW2, protected them afterwards, set them up in global leadership positions, and proceeded to overturn democracies and establish multiple outright fascist regimes since then, Nazis *are* US patriots. \n\nFighting Nazis and other fascists is Proletarian action which will always be in opposition to a Bourgeois State like the US.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "briancbrn",
                    "body": "Kinda feel for that cop; dude really wanted to calm the situation down. Should have considered that shit before allowing Nazis to do their shit on an overpass. \n\nBut as the song goes\n“It’s okay to punch Nazis”",
                    "score": 32,
                    "replies": [
                        {
                            "author": "dunderdrew2",
                            "body": "Cops escorted them there through the school grounds",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "briancbrn",
                                    "body": "That’s fucking awful 😞 \n\nI’m thankful I’ve never had to deal with actual Nazis",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "chilarome",
            "body": "also how come cops are never telling white supremacists “it’s not worth it” to harass and harangue and intimidate Black Lives Matter or pro-Palestinian or pro-union protestors??? ohhhhhhh wait never mind, different sides of the same racist coin",
            "score": 278,
            "replies": [
                {
                    "author": "teenahgo",
                    "body": "You know why",
                    "score": 61,
                    "replies": [
                        {
                            "author": "chilarome",
                            "body": "Sadly I do, fellow human. Sadly I do…",
                            "score": 22,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "superslickdipstick",
            "body": "Cops defending Nazis 😂😂😂 how else could it be",
            "score": 336,
            "replies": [
                {
                    "author": "nram88",
                    "body": "Some of those that work forces\n\nAre the same that burn crosses",
                    "score": 101,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -83,
                    "replies": [
                        {
                            "author": "BrilliantSpecial3413",
                            "body": "Nazis aren't protected by our constitution; they're our enemies IDGAF. The only good nazi is a dead one.",
                            "score": 119,
                            "replies": [
                                {
                                    "author": "The_BarroomHero",
                                    "body": "If your constitution protects nazis, it's a nazi constitution.\n\nScratch a liberal...",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 35,
                                    "replies": []
                                },
                                {
                                    "author": "Chrisbert",
                                    "body": "We had an entire world war to determine if it was acceptable or unacceptable to be a Nazi.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -39,
                                    "replies": [
                                        {
                                            "author": "Intelligent-Pen2072",
                                            "body": "Protected from congress\\* Not from consequences of the public.",
                                            "score": 28,
                                            "replies": []
                                        },
                                        {
                                            "author": "Every-Ad3280",
                                            "body": "It's not a high horse when not being a nazi confers a  legitimate moral superiority over being a nazi.",
                                            "score": 14,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "in5trum3ntal",
                            "body": "Sure free speech is protected. But cops do put people in jail for rallying behind their beliefs especially when they don’t agree with them.\n\nIt wouldn’t be “starting” it’s straight up what they do and have done. \n\nHow many people arrested the day of Jan6? How many people arrested at each BLM protest?\n\nCops rally behind their own beliefs constantly and the consequences are distributed to innocents in jail without their constitutional liberties being protected.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "A-CAB",
                            "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Blastmaster29",
                            "body": "Ah yes because we have a wonderful country and our freedom of speech pays my bills and makes sure I have healthcare. Fuck Nazis and the cops protecting them.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "AnthraxxLULZ",
                            "body": "lol tell that to the university students protesting for palestine",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BooRand",
            "body": "I love the guy calling the cop on his bullshit, the cop is saying it ain’t worth it and the guy says “you know it is” and he’s right. The cop has to pretend it’s not cause it’s his job and his money",
            "score": 115,
            "replies": [
                {
                    "author": "Mysterious_Card5487",
                    "body": "“You know it is” guy is a fucking hero",
                    "score": 43,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zrakoplovvliegtuig",
            "body": "Waving a Nazi flag is asking for it. It simply cannot be acceptable. Thankfully, some people remain civilized and refuse to accept such racist and genocidal ideologies in their neighbourhood.",
            "score": 106,
            "replies": []
        },
        {
            "author": "WastelandHumungus",
            "body": "It IS worth it. They should have crossed those nazis out.",
            "score": 54,
            "replies": [
                {
                    "author": "dunderdrew2",
                    "body": "History is a cycle. People forget that, and we are living in the times where nazism is making a big mainstream comeback and it MUST be squashed wherever possible",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "YoogleFoogle",
            "body": "“It ain’t worth it”. It’s absolutely worth it! Fuck those nazis",
            "score": 73,
            "replies": []
        },
        {
            "author": "neverenoughtape",
            "body": "Being a nazi is bad for your health.",
            "score": 37,
            "replies": [
                {
                    "author": "Chrisbert",
                    "body": "If we don't make it dangerous to be a Nazi, it will become dangerous to not be a Nazi.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "jhenderson360",
            "body": "Ohio seems to be a huge Nazi/bigot state. Wtf?",
            "score": 37,
            "replies": [
                {
                    "author": "anohioanredditer",
                    "body": "This group allegedly is from outside of Ohio. One of the members who was identified in Columbus months ago during a demonstration had a Louisiana driver’s license.",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "vhooters",
            "body": "The cops are straight up saying it’s not worth it to chase the Nazis out of their town. Fuck them.",
            "score": 21,
            "replies": [
                {
                    "author": "jackbeam69tn420",
                    "body": "That’s cause some of the Nazis are the cop’s buddies",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "David_Peshlowe",
            "body": "Punching a Nazi is always worth it",
            "score": 59,
            "replies": [
                {
                    "author": "TheDoctor7557",
                    "body": "Even more worth it when you punch them with a vehicle",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "imwinmylane",
            "body": "Some of those that work forces\nare the same that burn crosses.",
            "score": 17,
            "replies": []
        },
        {
            "author": "TheJuggernautReturns",
            "body": "\"y'all got the wrong neighborhood\"",
            "score": 19,
            "replies": []
        },
        {
            "author": "DantesPicoDeGallo",
            "body": "“Get your bitch asses out of here!! This is our neighborhood.” Love this",
            "score": 16,
            "replies": []
        },
        {
            "author": "Opposite-Invite-3543",
            "body": "“Good people on both sides” 🤬",
            "score": 15,
            "replies": []
        },
        {
            "author": "Phluxed",
            "body": "'You know it is'\n\nMy mans, no he doesn't. Ignore the cops until they put you under arrest and go right after the Nazis. Make cops arrest you for punching Nazis. Let's see who they are protecting",
            "score": 33,
            "replies": []
        },
        {
            "author": "thedreadcandiru",
            "body": "Never forget which side the cops were on.",
            "score": 8,
            "replies": []
        },
        {
            "author": "TolPM71",
            "body": "Cop, \"It ain't worth it.\"\n\nResident, \"It is, you know it is.\"\n\nWell said!",
            "score": 6,
            "replies": []
        },
        {
            "author": "MrPoosh",
            "body": "Man that's fuckin beautiful, GO GET EM",
            "score": 5,
            "replies": []
        },
        {
            "author": "Templar388z",
            "body": "The only good Nazi is…?",
            "score": 4,
            "replies": []
        },
        {
            "author": "fort_wendy",
            "body": "ACAB ACAN",
            "score": 6,
            "replies": []
        },
        {
            "author": "Republiken",
            "body": "Some true American heroes confronting those fascists",
            "score": 5,
            "replies": []
        },
        {
            "author": "Thlom",
            "body": "All I’m interested is why the nazis are marching on the sidewalk of what looks like an overpass? It looks like it’s in the middle of nowhere with nothing around? Why don’t they march in downtown like normal nazis? Are they pussy nazis?",
            "score": 4,
            "replies": [
                {
                    "author": "anohioanredditer",
                    "body": "Showing flags above I-75 underpass",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "yoolcalyptus_trees",
            "body": "It’s 100% worth it",
            "score": 2,
            "replies": []
        },
        {
            "author": "gonebonanza",
            "body": "Not cops protecting Nazis",
            "score": 1,
            "replies": []
        },
        {
            "author": "anontway",
            "body": "It wasn't that long ago that both my grandfathers had jobs with the government to dispatch these types all across Europe. Seems like there's plenty of opportunity now for the same government jobs again. Let's make these cowards afraid again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "curlysgold44",
            "body": "make racists afraid again!  thank you to these men who stood up and said no, this shit will not be tolerated!",
            "score": 1,
            "replies": []
        },
        {
            "author": "BaseNice3520",
            "body": "what are free-speech rights really like on the USA? Like, if Bill the neighbor is a d\\*ck towards me, can I make a protest with my family in the backyard with the flag \"Bill the neighbor should be sent to a gas chamber\"?\n\nis it legal to  target large groups, but illegal to name specific individuals?",
            "score": 1,
            "replies": [
                {
                    "author": "anohioanredditer",
                    "body": "A general breakdown of hate speech in the U.S.\n\n>While “hate speech” is not a legal term in the United States, the U.S. Supreme Court has repeatedly ruled that most of what would qualify as hate speech in other western countries is legally protected speech under the First Amendment. In a Supreme Court case on the issue, Matal v. Tam (2017), the justices unanimously reaffirmed that there is effectively no “hate speech” exception to the free speech rights protected by the First Amendment and that the U.S. government may not discriminate against speech on the basis of the speaker’s viewpoint.\n\nSome states will have some laws about hate speech. Direct threats aren’t typically covered under free speech, and could be a crime.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ItsNovak",
            "body": "The cops get the heads up about Nazi protest from upper management because it's actual contracted workers hired by the CIA to perform these protests.",
            "score": -8,
            "replies": []
        }
    ]
}