{
    "title": "The remains of 12-year-old Delisha Africa, one of five children killed when Philadelphia police dropped a bomb on the MOVE house in 1985, have been found at the University of Pennsylvania, an Ivy League school.",
    "author": "isawasin",
    "subreddit": "LateStageCapitalism",
    "rank": 254,
    "score": 500,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 7,
    "url": "https://v.redd.it/22jpcsjg3cje1",
    "id": "1iq5rlz",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "degenerateworker",
            "body": "\"Confronting our institutional history requires ever-evolving examination of how we can uphold museum practices to the highest ethical standards.\"   \nNice try, but this implies that stealing family remains is on the spectrum of \"ethical standards\", and that at one time it was perfectly okay, and this is just a normal \"evolution\" of those practices.    \n  \nHow bout:  \n\"Confronting our institutional history requires bringing to light the shameful acts of our institutions, taking accountability, and seeking to heal the harm caused.\" And then follow that up with some tangible action.",
            "score": 107,
            "replies": [
                {
                    "author": "m_right",
                    "body": "They own us even after we are dead.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "DoubleDixon",
                    "body": "End it with a formal apology for the actions of their predecessors. Show publicly that you truly disagree with the actions of your institutions leadership from the past.",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "ScucciMane",
            "body": "Sounds like some Skull and Bones shit",
            "score": 12,
            "replies": []
        },
        {
            "author": "Seethinginsepia",
            "body": "Only five comments on this one, huh? 🤔",
            "score": 7,
            "replies": [
                {
                    "author": "howdybeachboy",
                    "body": "Only recommended to me today",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}