{
    "title": "When your party worships billionaires, its bound to happen",
    "author": "SleepEatShit",
    "subreddit": "LateStageCapitalism",
    "rank": 218,
    "score": 572,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 9,
    "url": "https://i.redd.it/fgodvp03upje1.jpeg",
    "id": "1irm29g",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blastmaster29",
            "body": "I mean yeah this is just what they are. They wanna suck the lord off so they can have their little fiefs",
            "score": 35,
            "replies": []
        },
        {
            "author": "Warm_Cress3583",
            "body": "Such a funny country",
            "score": 21,
            "replies": [
                {
                    "author": "b0bx13",
                    "body": "Just a shame so many of us are locked in here with these freaks",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrdaemonfc",
            "body": "Democrats literally passed huge government spending bills that gave most of the money to Musk's businesses, like Tesla, while he was openly spewing Nazi ideology and his biggest fanboy was Ramzan Kadyrov, the leader of Chechnya, who loves his Tesla Cybertruck and has concentration camps for any gay people he hasn't killed yet.\n\nThe Inflation Reduction Act won't get repealed in full. They'll figure out how to keep subsidies flowing to Musk, even if it does mean funding an electric car company.\n\nThe Republicans voted unanimously against the Inflation Reduction Act. I would really rather that it had not passed. The Democrats sent 83% of the money, apparently, to Musk and Republican congressional districts, figuring they'd never kill the bill if all the money went there. They may be right, but dumping money on top of Nazis to make the bill safe is not the answer here.\n\nThis also means that the Republicans will figure out how to cut even more from social programs that benefit blue states in order to pass their $2 trillion tax cuts for Musk, Gates, Bezos, and Buffett because they'll have to figure out how to keep the IRA money flowing into red states.",
            "score": 17,
            "replies": []
        },
        {
            "author": "None",
            "body": "It’s missing the democrats in the picture",
            "score": 33,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "My point is the new DNC chair focused his first speech on good vs bad billionaires, what did you think my point was jackass?, how about you educate yourself and understand that the uniparty will not save you, part of the solution my ass\n\nhttps://www.salon.com/2025/01/30/are-we-on-the-side-of-our-donors-dnc-race-puts-spotlight-on-money-and-good-billionaires/",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Pandas-are-the-worst",
                                    "body": "Lol they deleted quick",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mrdaemonfc",
            "body": "Today in Illinois, the House Republicans proposed a State DOGE.\n\nThe Republicans in Illinois, who nobody elected to do anything (they have about 30% of the legislature), think they can seize 50% of the budgetary power (by giving themselves half the board seats no matter how well they do in any election), by emulating Elon Musk, who was also not elected to anything.\n\nThe DOGE bill was read once and referred to committee. It's one of the most ridiculous things I've seen in my life, honestly. \"We know we lose every election. We even lost a seat while Trump was elected President, but can you like, please give us half the power to set the budget anyway?\"\n\nThe State Republican Party collapsed and nobody even wants leadership roles because the only thing they do is sit there and get paid to be Karens and remind us of how bad they'd be if anyone put them in charge of something, like we even need that with the Failed State of Indiana next door.\n\nIn Indiana, the taxes go down every couple of years, while the poverty rate surges again. The reason they would prefer block grants for things like Medicaid, even though it means less money for the State, is so they can spend it on football stadiums and more tax cuts for their richest residents.",
            "score": 7,
            "replies": []
        }
    ]
}