{
    "title": "In a stunning call today w/ employees of UHC, yes that UHC. (Luigi) Offered a \"buyout\" to ≈ 30,000 employees. About 10% of US workforce.\nThey make billions in profits.. looking for tells.. for what Elon & Trump have planned w/ #Medicare.? Large layoffs in M&R dept. (UHC Medicare Dept.)",
    "author": "Rube_Golberg",
    "subreddit": "LateStageCapitalism",
    "rank": 232,
    "score": 19,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 3,
    "url": "https://v.redd.it/w64if9uiarje1",
    "id": "1irtex5",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Widowmaker89",
            "body": "Medicaid is probably first on the chopping block. Poor Red states that rely substantially on federal funding will have their excuse to kill their state medicaid programs if that funding is pulled. Wealthier states like New York and California may be able to soldier ahead on their own.\n\nTouching Medicare is really the third rail of politics, similar to Social Security. They would need to manufacture quite a substantial crisis or public spectacle to shove through any substantial wind down of those programs without the boomers actually revolting. Americans are selfish to their core, but if they want us to work for slave wages with no prospect of social safety net at the end of it, things could get much more...confrontational.",
            "score": 2,
            "replies": []
        },
        {
            "author": "hedsss38104",
            "body": "Who’s Luigi?",
            "score": 2,
            "replies": []
        }
    ]
}