{
    "title": "Trying to invoke patriotism and lies to fight fascism will not work.",
    "author": "EvolveToAnarchism",
    "subreddit": "LateStageCapitalism",
    "rank": 142,
    "score": 1304,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 11,
    "url": "https://i.redd.it/6dgyiiul6yke1.jpeg",
    "id": "1iwjidn",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cake_is_Great",
            "body": "Being a nationalist for an imperial power is identical to being a fascist, the only difference being that the bloody work of empire is usually carried out overseas - out of sight and out of mind.",
            "score": 56,
            "replies": []
        },
        {
            "author": "ChickenNugget267",
            "body": "US patriotism, no. Now is a time for alternative nationalisms. Bring back Pan-Africanism/Black Nationalism. Liberate the occupied Mexican territories. Calexit lfg! PNW Union, it's time. Louisiana, establish the Creole People's Republic. And, it goes without saying, it's time for Amerindians to get that Land Back without asking permission.",
            "score": 16,
            "replies": []
        },
        {
            "author": "MintTealGecko",
            "body": "Fine, can I say I don't want fascism to be American?",
            "score": 5,
            "replies": [
                {
                    "author": "poopy420butt69",
                    "body": "Unfortunately fascism is as American as apple pie.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "NeverQuiteEnough",
                    "body": "it would have to start in the cities, where our Democratic mayors and governors are quick to call in their thugs and crack skulls, where poverty is a crime.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "80MPH_IN_SCHOOL_ZONE",
                    "body": "Yes, you can. It’s weird that you’re getting downvoted for saying you want don’t want your country to be fascist or be associated with fascism.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "MintTealGecko",
                            "body": "Thanks for the kindness. I know I'm in a sub where people respect putting in the work more than platitudes and also my wording might have conveyed a different tone than intended so I'll take the votes I've earned.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CheeseDaver",
            "body": "But are those in the foundational documents?Patriotism is about holding the government to the letter of the declaration and constitution, not about celebrating their crimes. It’s also about acknowledging and preserving all of the progresses that we have made as a society to stand against unjust power.",
            "score": 0,
            "replies": [
                {
                    "author": "SeniorRazzmatazz4977",
                    "body": "What is with you Americans and treating your “foundational documents” like sacred religious texts? You treat your “founding fathers” like they are prophets.\n\nAlso for the record the declaration of independents calls indigenous people “merciless Indian savages” and one of the amendments stated that Africans where only 3/5 off a person.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "CheeseDaver",
                            "body": "my bad. i didn’t read the declaration fully, just the preamble. now a feel like a total idiot. i don’t  treat them as sacred text, i just believe that if our government derives its legitimacy from them, i expect them to follow it to a t. i believe in hypercompliance as a form of resistance.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}