{
    "title": "The Real Gulf of America",
    "author": "stucon77",
    "subreddit": "LateStageCapitalism",
    "rank": 84,
    "score": 3900,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 29,
    "url": "https://i.redd.it/jje5pmz43ple1.jpeg",
    "id": "1izhi4o",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zargoza1",
            "body": "Call me crazy, but that does not appear to be trickling down.\n\n![gif](giphy|14mgxYFJHXGmoo)",
            "score": 130,
            "replies": [
                {
                    "author": "trollblox_",
                    "body": "regean misspoke, he meant to call it trickle up",
                    "score": 16,
                    "replies": [
                        {
                            "author": "mrmdc",
                            "body": "When he said trickle down, he never specified what would be trickling down. Could be anything. In this case, he clearly meant piss.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "rekjensen",
                            "body": "Express elevator up.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "stucon77",
            "body": "Chart courtesy of Stefanie Posavec",
            "score": 33,
            "replies": [
                {
                    "author": "tbs3456",
                    "body": "Link the data pls 🙏🏻",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Bear_of_Flowers",
                            "body": "Found a lot of similar result via google:  \n[https://equitablegrowth.org/new-worldwide-report-on-inequality-shows-how-the-united-states-compares/](https://equitablegrowth.org/new-worldwide-report-on-inequality-shows-how-the-united-states-compares/)",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "tbs3456",
                                    "body": "Thank you. It flipped the year I was born 🥴",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "bored_typist",
                                    "body": "Here's a good site too: https://inequality.org/facts/wealth-inequality/\n\nAnd consider checking out Matthew Desmond's Poverty, by America",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kkareem27",
            "body": "This is good but tbh the percentages seem way too low. The focus on income is always the wrong view that capitalists love to push, Trump or Zuckerberg have lower income than most of us. The real view is wealth inequality, the real hidden beast that remains untaxed...",
            "score": 21,
            "replies": [
                {
                    "author": "able2sv",
                    "body": "I get your point, but I would be careful with \"Trump or Zuckerberg have lower income than most of us\"",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SandingNovation",
                            "body": "Then you don't get the point because that's exactly what he's taking about.  Actual rich people don't make their money from \"income.\"  They make it as returns on real estate and investments which is taxed differently and allows them, through 1000 different loopholes, to have an effective tax rate lower than those who have a traditional income.  Then eventually they reach a level of wealth where they can just take loans out from banks with part of their stock portfolio as collateral (therefore avoiding the capital gains tax that would be applied if they sold the stock for cash) which have even lower levels of interest because of their low risk (of course they'll be able to pay it back, they're a billionaire!) which isn't taxed at all.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "kkareem27",
                                    "body": "Thank you for backing me up, it's outrageous how people even in this sub don't understand how capitalism works to this day. Tax the working class to keep them poor (middle class and upper middle class count as poor too), give loopholes to the rich.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "able2sv",
                                            "body": "I understood this piece! I was just trying to keep us honest that while their income is dwarfed by their capital gains, their literal direct income is still in no means less than average. Most of these billionaires do have base salaries as well as compensation packages delivered as income.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "kkareem27",
                                                    "body": "Actually Trump was at a loss in terms actual cashflow, some other billionaires such as Zuck pay themselves a salary of $1.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "able2sv",
                                    "body": "I do understand all of this. My whole point is the “income” portion, although it is only a small portion of their wealth increase, is not “less than most of us”. \n\nIs Zuckerberg’s $24.4 million compensation in 2024 only a tiny fraction compared to his multibillion dollar gains? Yes. \n\nIs $24.4 million less income than most of us make? No.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SandingNovation",
                                            "body": "And trump famously \"donates\" his presidential salary because it's so meaningless.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tempstem5",
            "body": "Now do national wealth, it becomes a sea",
            "score": 2,
            "replies": []
        },
        {
            "author": "Frequent-Ruin8509",
            "body": "If true this graph tells me Obamas policies helped stop or slow the trend, and had they continued, the divide might have stopped widening. But then Trump got in office.",
            "score": 6,
            "replies": [
                {
                    "author": "Electrical-Box-4845",
                    "body": "Till when we will believe or need heroes? A good system make heroes obsolete",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Frequent-Ruin8509",
                            "body": "You assume I meant it like Obama is a hero. At best he's the figurehead of his administration, which is what a president has always supposed to have been.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WildeNietzsche",
                    "body": "Pretty sure Biden also got in office for a bit. Really is easy to forget that at this point, tho.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "rd--",
                    "body": "That line is trending linear and if true implies Obama's policies were nothing but noise in an uninterrupted transfer of wealth to the 1%.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "highzunburg",
            "body": "Wealth would be all blue with a dot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LexieDeLarge",
            "body": "It's really interesting how during the so-called economic recessions (2008 and covid), their wealth rapidly grew, almost like they're using the situation to exploit the working class and increase profit margins",
            "score": 1,
            "replies": []
        },
        {
            "author": "Appropriate-Cow-5814",
            "body": "The chart correlates with the reemergence of conservativism in the late 60s and then its ascendancy by 1980.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bored_typist",
            "body": "Brilliant title",
            "score": 1,
            "replies": []
        }
    ]
}