{
    "title": "Ethics of Quantative research jobs",
    "author": "Jche98",
    "subreddit": "LateStageCapitalism",
    "rank": 27,
    "score": 4,
    "upvote_ratio": 0.65,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1j3swo5/ethics_of_quantative_research_jobs/",
    "id": "1j3swo5",
    "selftext": "(taken fromy post on thedeprogram sub)\n\nHi Comrades, \n\nI'm about to graduate with a PhD in mathematics. My whole life I've wanted to be a researcher, doing science and discovering new ideas. However, I look at the road ahead and I don't see much potential for success. Unless I do something absolutely groundbreaking (which I'm pretty sure I won't) it's just a slog of low-paying postdocs and assistant professorships until I MAYBE get tenure somewhere, and even then with defunding of research I might still not be financially secure. I'm about to publish my first research paper and, while I've enjoyed working on it, it hasn't exactly given me the overwhelming sense of joy I dreamt about as a teenager reading science books.\n\nMy dad was a researcher in politics and now he's retired and he can't afford to support himself in his retirement. I want to be able to live a more comfortable life and take care of him financially as well. Luckily I had a scholarship so I don't have student loans to repay.\n\nI was thinking about applying to work as a quantitative researcher at Jane Street, Optiver or one of the other Quantitative Trading firms. The pay is really good and the mathematical problems are interesting. \n\nOf course these firms are at best useless to society and at worst actively harmful. They essentially use algorithms to game the stock market. They thrive on capitalism. Ultimately I do want to do something to help society but I also want to financially secure my future first.\n\nMy question is how bad is it to actually work for these companies? How much of a sellout capitalist shill would I be? Would it be like working for the fossil fuel industry and destroying our planet? \n\nI don't know what I'm asking for. Absolution for my sins against the proletariat? Being spared the guillotine when the revolution comes? I'm not sure.\n\nI'd just like to hear people's opinion on this.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "RogerStevenWhoever",
            "body": "I worked at a quant firm once.\n\nI mostly agree with your assessment that they're at best useless to society. There's an argument that they're providing some benefit to society as market makers, de-risking as backnarkle48 said, but yeah part of the reason I left was because of the nagging feeling of bullshit. Also it was definitely stressful.\nThat being said, you should still consider it if you decide you don't want to pursue research. The pay is good enough that if you can just deal with it for a few years you can give yourself a good base financially.\n\nPlus it's really not much different, in terms of having no value to society, than any generic corporate job. We all have to get by in the world, and you could use some of your money for the cause...\n\nIt's all part of the spiritual damage of capitalism. Something intrinsically valuable like adding the humanity's knowledge is severely underfunded and full of bullshit. The best paying positions contribute the most harm and exploitation.",
            "score": 3,
            "replies": []
        },
        {
            "author": "backnarkle48",
            "body": "How is exploiting financial arbitrage a sin against the proletariat ?",
            "score": 3,
            "replies": [
                {
                    "author": "Jche98",
                    "body": "I suppose it's because \n\na) wanton speculation gives us financial crashes like 1929 and 2008\n\nb) that stock market money represents workers' wages. It's the surplus value extracted from hardworking people and invested by the capitalist class. It feels wrong to play around with.\n\nc) It doesn't contribute anything to society. It doesn't develop any new technologies, save lives contribute to education or anything\n\nThese are just my opinions though.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "backnarkle48",
                            "body": "Not that I’m absolving you, as this is not my role, but speculative crashes are an natural outcome of the contradictions inherent in capitalism. Arguably, arbitrage assists price discovery and de-risks markets \n\nB. Every commercial transaction directly affects labor \n\nC. Read David Graeber on Bullshit Jobs. You’re not alone",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yeahbitchmagnet",
            "body": "How about work for me and I can give you lots of snuggles from kitties and really good Japanese food. We can use the profits for revolution! But seriously is there any way for retail traders to use this shit. It's moon talk to me\n\nEdit: also probably don't worry when we storm the capitalists offices we'll leave the quants alone\n\nhttps://youtu.be/1l9FD1GVj1Q?si=cLZkwXN4OSmt_Rg0",
            "score": -1,
            "replies": []
        }
    ]
}