{
    "title": "Deaf girl tries caption glasses that lets her see conversations in real time",
    "author": "HentaiUwu_6969",
    "subreddit": "MadeMeSmile",
    "rank": 12,
    "score": 722,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 37,
    "url": "https://v.redd.it/pqp3rqp8ehpe1",
    "id": "1jea7kn",
    "selftext": "",
    "comments": [
        {
            "author": "Cataleast",
            "body": "Oh, hey! It's these things again! While they can be a useful assistive tool for many people, the actual tech and business side of this is sketchy and scummy as hell.\n\n[https://www.reddit.com/r/MadeMeSmile/comments/1hywtq5/comment/m6kz9ux/](https://www.reddit.com/r/MadeMeSmile/comments/1hywtq5/comment/m6kz9ux/)\n\nTL;DR: The audio is recorded via your phone microphone, so you need to have that thing out at all times. It is then sent to remote servers for processing. The glasses were also sold for $400 last November and suddenly they're $1,400-1,800.",
            "score": 68,
            "replies": [
                {
                    "author": "No-Significance2113",
                    "body": "Reminds me of the color correcting glasses that turned out to be a scam.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Cataleast",
                            "body": "That one made me really sad to hear about. It annoys me to no end how some companies prey on people with shit like that, charging exorbitant amounts for what ultimately ends up being little more than snake oil.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "TellLoud1894",
                            "body": "Looks like a scam, show don't tell. Looks like an act",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "crash250f",
                    "body": "Isn't that how most voice to text and voice processing services work, like Siri and Alexa?  I'm not saying it's a good thing but it's something millions of people use everyday for minor convenience, so I don't think I would look down too much on a company that uses that same tech to substantially improve lives.  ",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "crash250f",
                    "body": "Isn't that how most voice to text and voice processing services work, like Siri and Alexa?  I'm not saying it's a good thing but it's something millions of people use everyday for minor convenience, so I don't think I would look down too much on a company that uses that same tech to substantially improve lives.  ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Cataleast",
                            "body": "Speech recognition has been around for decades. It's not some new tech that leans heavily on AI or something, so it's very questionable whether remote processing is something that's 100% necessary for something like this.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CuteAlternative2125",
                    "body": "Maybe just a glimpse of tech that will be widely available in 5-10yrs through mainstream companies",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Cataleast",
                            "body": "To be fair, the tech is already widely available. Glasses with small HUD-like displays have been around for yonks (Anyone remember Google Glass?) and there are loads of transcription apps that, for example, deaf people have been using for years. There is honestly no new ground being broken here.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CuteAlternative2125",
                                    "body": "Big difference between it being possible and widely available through mainstream companies",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Cataleast",
                                            "body": "At the end of the day, it's a niche market, so widespread mass adoption likely won't ever happen. This being said, Ray Ban's supposedly releasing their smart glasses with a HUD feature this year and Google has had their transcription app available since 2019.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sienile",
                    "body": "I'm sure they started at a low price to get initial users and reviews. Once well established they upped the price to what meant who need it would likely value it at.\n\nIs that all you found sketchy about it?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Cataleast",
                            "body": "It's a 350% price increase that coincided with a sizeable viral marketing push alongside launching a rebranded version of an existing product with AI buzzwords up the wazoo. I can guaran-goddamn-tee you that even at the $400 price point, it had a big ol' profit margin. Hell, Google Glass reportedly cost $152 to make and it had a TON more features than these things.\n\nIs this the kind of company you want to have access to your phone's microphone?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "nansyromany",
            "body": "I love these stories where technology literally changes lives!!",
            "score": 57,
            "replies": []
        },
        {
            "author": "Iceblink-",
            "body": "What happens when she gets into a crowd?",
            "score": 12,
            "replies": [
                {
                    "author": "MajesticArt2445",
                    "body": "guessing she'd just have to turn them off in those scenarios",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "CuteAlternative2125",
                    "body": "speed reads",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OldPros",
            "body": "I love stuff like this. If we'd stop killing each other and work for good...",
            "score": 6,
            "replies": []
        },
        {
            "author": "SeparatePath5411",
            "body": "Is there a “Made Me Sob” sub?\n\nThis is so beautiful. Thank you.",
            "score": 11,
            "replies": []
        },
        {
            "author": "yudumyLedy",
            "body": "The people who create things like this are real heroes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Relevant_Reward8780",
            "body": "How amazing to see these kinds of advances in technology and what the future holds for us",
            "score": 3,
            "replies": []
        },
        {
            "author": "TophetLoader",
            "body": "How could they skip how does it really look like in these glasses? Now I'm curious.",
            "score": 3,
            "replies": [
                {
                    "author": "hmm138",
                    "body": "Or it doesn’t really work",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Valentina_emir",
            "body": "Amazing, it will change his life",
            "score": 3,
            "replies": [
                {
                    "author": "Kindly_Shoulder2379",
                    "body": "her life too! /s",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 2,
            "replies": []
        },
        {
            "author": "Responsible_Clerk421",
            "body": "Even tho im not def i still want these to be able to understand people that talk too fast.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Street_Glass8777",
            "body": "It's a good idea if it's stand alone on the glasses.  Time will tell if brought to fruition.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vegetable-Mover",
            "body": "This girls joy makes my heart warm",
            "score": 2,
            "replies": []
        },
        {
            "author": "random-guy-here",
            "body": "I'm happy for her.  In the U.S.A. funding would be cut for this!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Formal_Dare_9337",
            "body": "The people who create things like this are true heroes and deserve statues made of them tbh. Great post.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DevineAaron92",
            "body": "Best video I've seen this year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sensitive_Dirt5186",
            "body": "That's so nice",
            "score": 1,
            "replies": []
        },
        {
            "author": "Formal_Dare_9337",
            "body": "The people who create things like this are true heroes and deserve statues made of them tbh. Great post.",
            "score": 1,
            "replies": []
        }
    ]
}