{
    "title": "why should any mexican-american, native american, or african american fight in a potential civil war?",
    "author": "alcoholichomogeneous",
    "subreddit": "Anarchism",
    "rank": 246,
    "score": 85,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 32,
    "url": "https://www.reddit.com/r/Anarchism/comments/1illv79/why_should_any_mexicanamerican_native_american_or/",
    "id": "1illv79",
    "selftext": "i've been having this contention for a while, as comrades and i have predicted a potential civil war in the following years to come.. i come from an indigenous background, and have committed myself to staying off the grid/reading theory/committing to direct action. however, i come to a point of strife, as i find that this country has failed most latin american countries through imperialist tactics, apartheid, slavery.. blah, blah. anyways, i saw a post regarding \"fleeing\" in these tumultuous times, and some where criticizing and saying it would be cowardly. however, if a potential war were to flourish, would it be cowardly? i mean, my ancestors are not from here - in fact, they fell for some american dream gimmick, and were continually exploited, harassed, and disregarded in the bureaucratic system. why should i then, turn around and fight for land that's built on the most evil of principles? some romantic idea of revolution and/or autonomous state? that's what got Che killed in the end. these are different times - surely, but not sure. just conflicted and wanted to give my thoughts and meanderings. i would only fight for my loves ones and comrades if the organizing was right and established, which does not seem the case. and it seems it's only bound to get worse here. what do you think? what would you tell your POC comrades regarding this?",
    "comments": [
        {
            "author": "internet_cousin",
            "body": "It's a line we can only draw for ourselves: what is worth fighting for, and what you are willing to risk. \nI am struggling myself with how far I am willing to go to protect my ideals and others. I think you don't really ever completely know either--you react moment to moment....\nI guess I try to remember that we only get one life, and shouldn't I do everything I can for others, for the world? It requires a selflessness I don't always possess, but I know it is the guiding principle if we are ever to get anywhere....\n\nAll actions do not need to be big, or violent. Perhaps the most effective ones are just being sand in the gears...or giving you skills or resources freely. \nThese tiny things are what make the larger things possible. \nSending love and strength.",
            "score": 35,
            "replies": []
        },
        {
            "author": "TillyParks",
            "body": "There’s no reason to think a civil war is in soon to happen, if anything fascists will waltz into power without any opposition and only sporadic isolated fighting.\nI hate America, as in “the state”,\neveryone should hate America. I would not fight fight back in hopes of saving “America”\nBut all social progress has and will always be won via civil unrest and fighting. Not everyone will be able to leave the country; in fact a vast majority will not. I won’t be able to. So in the interest of myself and people like me, staying and fighting back is our best bet. We might be fighting for social progress we won’t be around to enjoy, but we got the 8 hour work day because someone threw dynamite into a crowd in chicago 140 years ago. I am the beneficiary of a long line and history of political action, I will take actions that will benefit people who aren’t me to in a sense, pay it forward. \n\nNot to mention there’s no guarantee that fascist trend or conflicts won’t spill out globally. They already are. So I’m doubtful leaving the United States would help. \n\nLiving “off the grid” and other survivalist ideas are lame and impractical. It’s just rehashed liberal homesteading slop.\nThe capital it would require to build a “self sustaining” living situation is immense and would involve you recreating infrastructure that already exists elsewhere.",
            "score": 43,
            "replies": [
                {
                    "author": "kwestionmark5",
                    "body": "This is what I was thinking. You can peacefully put a fascist into power, but not so likely to be able to peacefully remove them. If there is a civil war it will stem from resistance to the Trump admin. I wouldn’t tell any Black, Indigenous or Latinx person they need to fight for this country. However best to be ready for self defense.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "TillyParks",
                            "body": "They should fight against fascism because they stand to lose a lot. They shouldn’t fight on behalf of this country but if they can they should fight . If you want a better world, and everyone should, that is what it takes. Anarchism is in that sense prescriptive. We do have an idea of what should what, and what people should do",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SailingSpark",
                                    "body": "Everyone should fight against a fascist. Strict authoritarians like that do not like free thinkers and people they cannot rigidly control. If Fascism takes root and blossoms in the US, nobody is safe, starting with Anarchists, Communists, and anybody who is not 100% behind the nationalist viewpoint.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AutoModerator",
                            "body": "Hi u/Desperate_Solid8989 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aromaticmisfit",
                    "body": "This is excellent",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Desperate_Solid8989",
                    "body": "So everyone should just give up? At least survivalist have a strategy. It wouldn't require much capital if you built a community around homesteading",
                    "score": -2,
                    "replies": [
                        {
                            "author": "TillyParks",
                            "body": "Where did I say “give up” ? I said fight.\n\nAnd dude buying a house is outside the price range for most people. Buying a house with acres of land with the necessary support infrastructure to grow your own food would be even more\n\nYou should actually read what anarchists wrote and did, because they didn’t win by homesteading lol",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ColoHusker",
            "body": "You tell people what you see, explain but don't justify. Most importantly, do what you believe is right.\n\nIf there is a civil war that is liberals vs fascists, that's way different than if class consciousness is at the forefront of the side standing against fascists.\n\nWe know what's gonna happen if liberals win, we know what's gonna happen if fascists win. We've seen both of these play out in the West & the global South in our recent family memories. We also have seen what happens to leftists of any flavor that ally with liberals.\n\nSounds like you know the line where it makes sense for you to fight, that being protecting your loved ones & your community. \n\nFocus on organizing & growing your community, that's all any of us can do. And that's what we're going to need as things continue on the direction they are headed.\n\njmo",
            "score": 15,
            "replies": []
        },
        {
            "author": "Art-X-",
            "body": "(1) Fleeing a sinking ship is not cowardice.\n\n(2) Personally, I will resist fascism and the maga idiocracy governed by deranged plutocrats and fake Christian white supremacists, and I am willing to ally with \"liberals\" and \"progressives\" in that oppositional effort; but I won't fight FOR the Constitution or the American republic that it created -- those are plutocracy all the way down.",
            "score": 23,
            "replies": []
        },
        {
            "author": "Bukkkket",
            "body": "I think that whatever transpires within the us over the next couple of years will determine the shape of the world in the years proceeding. There are so many interconnected global issues that are all rooted in the US and its attitudes towards life. If there is a civil war(which arguably is already actively happening) theres absolutely nothing wrong with fleeing to safety, but I do think this moment is an opportunity for humanity to do something against a great evil that has been subjugating all people around the world. Rather than seeing it as a fight to save this country(because really who cares and there’s no saving it anyways) you could see it as an opportunity to maybe shift the world towards a less awful direction.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Sir_Reginald_Poops",
            "body": "If a civil war were to break out, there is no shame in leaving to somewhere you feel safe.  I'm not planning on leaving but I also don't plan on fighting for any side that wants to keep an authoritarian governing system.  I think that situation would be prime time for organized anarchists to work with communities on becoming autonomous and understanding what anarchy can actually be.",
            "score": 10,
            "replies": []
        },
        {
            "author": "anarchyinspace",
            "body": "I am white, however, my spouse is black. The feeling he has is that PoC have forever, resisted, and dealt. But, white people have never, really, come to terms with their own part in the horrible history of The US. And, have never held racists, Confederate /and white supremacists, etc accountable. \n\n\nSo, it's at the turning point of here's fascism, many people (some, white like myself) have been saying, \"hey, this is where we're headed...\" For a long time. So, for PoC who never had many white folks stand up and act in solidarity, except say, perhaps, civil rights.\n\n\nBut the overall feeling, I gather, of many, is \"we told you so\" or, the gist of that. So, for us, my spouse, and some other PoC I know, we want to leave. I know not all PoC can, and that hurts my heart, because I feel like that's abandoning them in a horrible moment. But, I also understand like, in my spouse's perspective, at this point, it's cutting ties and self preservation. \n\n\nThough-- if we stay, my main drive will be making, keeping, and strengthening ties within our community, keeping communication really open and flowing. Safety in numbers. ",
            "score": 4,
            "replies": []
        },
        {
            "author": "cumminginsurrection",
            "body": "I mean, the reality is most people can't flee. So its not really a question of fleeing or fighting, its a question of either defending yourself and your community or getting killed as a bystander.",
            "score": 5,
            "replies": []
        },
        {
            "author": "NotThatMadisonPaige",
            "body": "Don’t let ytppl tell you what to do. This country has never delivered for us. We owe it nothing and it owes us more than it could ever deliver in 1000 lifetimes. \n\nLet them stay and fight. If you have capacity and want to leave for your own self preservation and peace of mind you are allowed to do that. The way I look at it, my ancestors would have left in a heartbeat if they weren’t chained up.\n\nETA: as a black woman, proud 92 percenter, I’ve shown up and done my part. Even as america showed me time and again it hates me. At this juncture, my energy is going primarily into making sure I’m okay, my family is okay, my friends are okay and deepening my connections with the tribes I’m in. Building new connections in my local community is also pretty high on the list and encouraging others to follow my preparatory lead. I’ve even created a platform last year, in anticipation of this shitshow, where they can do it. (I’ll announce here soon!). But Dassit.",
            "score": 6,
            "replies": [
                {
                    "author": "alcoholichomogeneous",
                    "body": "i feel this heavy! thank you for your comment and will be staying tune to what you have to offer to the world.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "NotThatMadisonPaige",
                            "body": "We well fam. It’s all love. 💕",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gabriel01202025",
            "body": "They should not be fighting in any US war. Or any poor person period. Why fight for rights you don't have?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Legitimate-Ask5987",
            "body": "This land is not built in evil principles. Your GOVERNMENT is. This land was built by the blood and sweat of MY ancestors and the enslaved and the working poor. Indigenous people are forced to participate in civil wars because when we don't take a side we risk losing our sovereignty to the winner. Because the Choctaw and Lower Muscogee Creek were in the confederacy, the US decided they had violated the treaties (lol) and they imposed punishments on all of Muscogee Creek Nation, even though my family (the Upper Creek) were union soldiers. Idk about other natives but to be able to leave is a privilege of both being a settler and/or having the means to leave. I won't leave this land for anything. If especially yt ppl want to leave, I encourage them to do so because the treaties were about granting us all the right to live on these lands but the government betrays the treaties. Is it cowardice to leave? I think if someone chooses to leave they are kidding themselves it's better anywhere else. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "Koraxtheghoul",
            "body": "There can be no civil war in the United States while the military is happy... and the military is always cotent because the American state serves their interests.",
            "score": 2,
            "replies": []
        },
        {
            "author": "am_az_on",
            "body": "can the same be said for engaging in activism in general?\n\ni ask because maybe there is some overlap of answer too. \n\nif a civil war is of two sides that don't make a difference to you, that is one thing\n\nif one of the sides basically wants to eliminate your people, then it may be something else, even if you don't consider the land you're living on to be your land\n\nthere is a viewpoint from people in the global south that they don't want the direct support of the people in the USA, they want the people in the USA to challenge the rulers of the USA and get things changed so the USA doesn't keep doing the harms that it has been doing to the global south",
            "score": 2,
            "replies": []
        },
        {
            "author": "sudsmcdiddy",
            "body": "I'm not sure PoC are the target audience of conversations around why it's \"wrong\" to leave the US. I personally think that it would be wrong of me to leave the US because I see that as not only privileged (also that's not an actual option for me lol I would have nowhere to go) but because I think doing so would be complicit in the colonial project. But I'm a white person born and raised in the US. I think white people who figure themselves for any kind of anti-racist need to understand the onus is on them to reign in white supremacy. If Indigenous people are willing to give their lives for their liberation and the land, then I think I have to be willing to do so as well. I think it's an integral part of being decolonial.\n\nWith that said, I'm not going to shit on someone who's worried about staying here if things actually did turn into a full hot war, especially if that person has concerns because of their gender/ sexuality/ disability etc. I certainly wouldn't tell PoC what to do.\n\nEdit to say: for first sentence, I mean also that PoC *shouldn't* be the target audience for this convo",
            "score": 2,
            "replies": []
        },
        {
            "author": "BigChomp51",
            "body": "I guess if they don’t want the Klan to win.",
            "score": 1,
            "replies": []
        },
        {
            "author": "triangle-over-square",
            "body": "people should fight in a war if they think it is good and important to fight on or against one side. its an individual judgement, and every person has to reach the point where are the absolute authority on why/who/how to fight. be free from the idea of great movements that control your identity and be free of the moral they impose on you. speak only for yourself, and act according with what you believe is righteous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nightslayer78",
            "body": "I'm not going to try to convince you to do anything. I'm white. \n\nBut, within Anarchism, you aren't fighting for a country. You're fighting for your own self-determination. While convincing everyone else fighting the same enemy of the same goals would be very difficult, but not impossible. Many may be trying to recreate the old system to a point where they felt like it still worked in their eyes. Others may be trying to change the constitution to make trump impossible to happen again. I hope people are open-minded to a new idea for America, Anarchism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PlastIconoclastic",
            "body": "What is this race baiting? There is working class and everyone else. Working class outnumbers those with all them money. The only war is the class war.",
            "score": 0,
            "replies": [
                {
                    "author": "alcoholichomogeneous",
                    "body": "pretty myopic and underwhelming point all around. good job!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "sudsmcdiddy",
                    "body": "Acknowledging and analyzing white supremacy is not race-baiting in the slightest. Refusing to acknowledge it does prop it up, however.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PlastIconoclastic",
                            "body": "Did he do that? Or did he discuss his personal choices and ask if all folks he sees as kin would rationalize his choice to hide out in the hills.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}