{
    "title": "White Supremacy Culture: What Is It?",
    "author": "AnarchaMorrigan",
    "subreddit": "Anarchism",
    "rank": 240,
    "score": 69,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.whitesupremacyculture.info/what-is-it.html",
    "id": "1ilvm92",
    "selftext": "",
    "comments": [
        {
            "author": "Saphira6",
            "body": "white supremacist, settler-colonial culture is the foundational culture of occupied north america. it is one strain of the fatal disease which afflicts all human kind. its cure is cultural revolution through education.",
            "score": 17,
            "replies": [
                {
                    "author": "ThalesBakunin",
                    "body": "My praxis is helping everyone achieve positive disintegration using methods laid out by Dabrowski.\n\nI believe it is all based in malicious control of their environment based on insecurities, ultimately coming to mortality.\n\nThat gives them the feelings that overpower their natural human morality.  The existential threat of death supercedes all.\n\nThat allows for the mind to accept the consolidation of power that is used by the oppressive forces to dominate the environment.\n\nPositive disintegration follows the motivation of action down to the psyche to determine where it's coming from.  If it is malicious in origin it should be uprooted.\n\nWhite supremacy coalesced from the horribly war-torn landscape of Europe.  We started exporting people all over the world after hundreds of years of warfare on the continent.  \n\nThey felt entitled to the peace they felt they earned from slaughtering their kinfolk en masse.  When they went out to export their hate and violence, they realized that most of the world wasn't as good as hate and violence as they were.\n\nNow the offspring of that exportation of hate and violence has colonized a large part of the world.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Saphira6",
                            "body": "i havent read Dabrowski.\n\nthe source of white supremacy, aside from it being about the concept of whiteness, is the fear of the other inherent in all human cultures. some cultures are infected with fear and bullies who exploit fear. among settler-colonial cultures, these tendencies are well-grooved tracks. strong man rule. lead by bullies. this is what the culture is. bullying on a national scale.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Remote-Remote-3848",
            "body": "The site writes: \"That said, I do personally believe in source, in the divine, in essence – I do believe that we are all one. \"\n\nThey way out of racist shit is belief in a higher power? like the 12 step program? she lost me here...",
            "score": 1,
            "replies": []
        }
    ]
}