{
    "title": "Back on the Grind podcast",
    "author": "EKsaorsire",
    "subreddit": "Anarchism",
    "rank": 172,
    "score": 284,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/gallery/1iq39tp",
    "id": "1iq39tp",
    "selftext": "Really great interview I did focusing on maintaining relationships while inside and the importance of vulnerability. \n\nWe can get caught up in macho shit so often it’s important to stay emotionally connected to those you love and how relationships with. \n\nMay be worth a listen for those involved in abolition work or activism stuff. \n\nhttps://podcasts.apple.com/us/podcast/back-on-the-grind/id1681556943?i=1000692456809",
    "comments": [
        {
            "author": "cellardoor_7",
            "body": "Eric's the best. Thanks for sharing.",
            "score": 23,
            "replies": [
                {
                    "author": "EKsaorsire",
                    "body": "(I’m Eric so thank you so much for lifting me up with kindness!)",
                    "score": 34,
                    "replies": [
                        {
                            "author": "GlassTopTableGirl",
                            "body": "You're an inspiration! Thanks for sharing this- gonna listen to it right now. 🖤",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "cellardoor_7",
                            "body": ":)\n\nThanks for being an inspiration. I always look forward to hearing you on podcasts.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thatwhileifound",
            "body": "Just finished it on my daily don't go crazy wander. Good interview, dude, and thanks for sharing. I've got lucky in life in this area so far, but so many of my friends haven't. Props on continuing to do the good work and getting the importance of prisoner support out. I've got a handful of people in my life now who I think will benefit from hearing this and am hoping I can get them to listen. ",
            "score": 8,
            "replies": [
                {
                    "author": "EKsaorsire",
                    "body": "That’s really kind and I appreciate all of it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "meta_muse",
            "body": "Giving it a listen. This is really awesome. Thank you so much for sharing.",
            "score": 6,
            "replies": [
                {
                    "author": "EKsaorsire",
                    "body": "Thank you friend!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thae86",
            "body": "Well shit, this is fuckin' awesome. Also I need to get more involved in any type of activism/mutual aid for comrades locked up.",
            "score": 6,
            "replies": [
                {
                    "author": "EKsaorsire",
                    "body": "I think that would be a really good idea",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "authorityiscancer222",
            "body": "I miss read this as a back on Grindr post and I was excited for a moment bc the community needs more Ruby Da Cherry types",
            "score": 5,
            "replies": [
                {
                    "author": "Educational_Sir3198",
                    "body": "lol who is that?  Great name",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "rex-begonia",
            "body": "Thanks for sharing, I look forward to listening.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ElRayMarkyMark",
            "body": "Thank you for sharing! It's so good to hear from you, Eric 💗✊",
            "score": 2,
            "replies": [
                {
                    "author": "EKsaorsire",
                    "body": "🩷🩷",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "poorpeopleRtheworst",
            "body": "I’m interested in this. I’ve never seen love as a particularly meaningful political force, but I’ve seen peeps introduced to anarchy via relationship anarchy so I’ll definitely give this a listen.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GambleWaltham",
            "body": "Listened to this today and was going to post it here - great interview Eric! You often do interviews talking about abolition, it was nice hearing about life here. Solidarity forever ",
            "score": 2,
            "replies": [
                {
                    "author": "EKsaorsire",
                    "body": "Thank you so much I really appreciate that",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}