{
    "title": "What are your thoughts on Apo calling to disband the PKK and instate a ceasefire?",
    "author": "TheWikstrom",
    "subreddit": "Anarchism",
    "rank": 45,
    "score": 11,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.france24.com/en/europe/20250301-pkk-declares-ceasefire-with-turkey-ending-40-years-of-armed-struggle",
    "id": "1j0wipv",
    "selftext": "",
    "comments": [
        {
            "author": "Ratagar",
            "body": "I'll believe it when he's saying it while not in a Turkish prison.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Awiergan",
            "body": "I'd probably say anything to get out of a Turkish prison too.",
            "score": 14,
            "replies": []
        },
        {
            "author": "throwawayowo666",
            "body": "I think it's pretty clear that this is a calculated move from Erdogan to extend his presidency since he knows that the writing is on the wall; He was very nearly voted out during the last election as the liberal-left opposition party keeps growing each year, so he knows he doesn't have much time left if his legacy doesn't change.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Brilliant-Rise-1525",
            "body": "It's not over.",
            "score": 9,
            "replies": []
        },
        {
            "author": "ProbstWyatt3",
            "body": "Not so bad. PKK had enough result in drawing the worldwide attention. After the ceasefire, PKK affiliated parties such as YBS/YJÊ and SDF (not only Kurds but also Yazidis, Assyrians, Arab Syrians, etc.) can focus on combating Daesh, while PKK, now legalized, can work on \"symbolic resistance\" like Zapatistas are doing. \n\n\nHowever, the same process happened in 2013, and it didn't go well. I doubt Turkey & Azerbaijan and their allies (Qatar, Israel, NATO, etc.) would have enough morality and conscience left to make such a deal.",
            "score": 18,
            "replies": []
        },
        {
            "author": "solitude_corner",
            "body": "I think it's a grave capitulation from his side. I don't believe that the Turkish government is truly interested in making the Kurds' conditions better; they are only interested in ending the conflict. They will want control over Kurdish Turkey, why would they willingly cede governance?\n\nWhile I am reading Öcalan now, and I believe that he has interesting insights, this was a genuinely bad move by him.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RenzoNovatoreFan",
            "body": "They were extremely flawed already but giving up armed struggle to \"democratize\" the government should at the very least stop anarchists from championing them.",
            "score": 2,
            "replies": [
                {
                    "author": "Big-Investigator8342",
                    "body": "Why is that? Decreasing authoritarianism is not an anarchist thing? I was pretty sure that was like most of what we are about.\n\nNow if you are outgunned, out numbered and your lifes dream is about to be murdered because the guerilla group you and friends formed in college to liberate the people is well ideologically a mishmash and has a bad track record from when stalinism was in fashion.\n\nAvoiding a war and decreasing the power of the state and making an opportunity for open organizing to outgrow the state through citizens councils is an anarchist strategy. War sucks, losing a war or being stuck in a ling ass war really sucks, if you can win by other means do that. Still has done more than the west yelling about why Rojava isn't cool enough to be legitimately fighting for autonomy, self determination and against authoritarianism, state power and capitalist modernity.\n\nLike democratic confederalism as an idea is a model for the world. Like this is a big big idea bigger than this one struggle. Rojava is like a proof of concept what comes next is what we do with that concept.\n\nWe are talking a new era of humanity and an anarchism that does not need anyone to abandon their culture and repeat every last thing from a political milieu's taste and styles. We are talking genuine messy freedom---where people who would be at war or oppress one another sit and talk instead.\n\nIf that makes you uncomfortable and turns your stomach a little, that is a good sign.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}