{
    "title": "pokemon white download tournaments help!!",
    "author": "zombiebrainrot",
    "subreddit": "Roms",
    "rank": 19,
    "score": 0,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Roms/comments/1jdxumu/pokemon_white_download_tournaments_help/",
    "id": "1jdxumu",
    "selftext": "i just beat the elite four and wanted to start working through the touraments, but i didn't realise so much of it was downloaded content.\n\ni know the ds lites internet service is long dead now so downloading any of this 'legitimately' is near impossible - is there any way i can download a rom of these tournaments and patch them onto my game??\n\nfor context, i'm playing a pokemon white 2 rom on an r4 card on my ds lite\n\nany help will be rly appreciated, i was looking forward to this :(",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "If you are looking for roms: Go to the link in https://www.reddit.com/r/Roms/comments/m59zx3/roms_megathread_40_html_edition_2021/\n\nYou can navigate by clicking on the various tabs for each company. \n\nWhen you click on the link to Github the first link you land on will be the Home tab, this tab explains how to use the Megathread.\n\nThere are Five tabs that link directly to collections based on console and publisher, these include Nintendo, Sony, Microsoft, Sega, and the PC.\n\nThere are also tabs for popular games and retro games, with retro games being defined as old arcade systems. \n\nAdditional help can be found on /r/Roms' official Matrix Server [Link](https://matrix.to/#/#romz:matrix.org)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Roms) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "barisax9",
            "body": "r/pokemonromhacks",
            "score": 0,
            "replies": []
        }
    ]
}