{
    "title": "Sorry I'm Really Scared of Getting A Virus so I keep Asking but, Is the Ps3 Update File Safe? I need it for the PS3 Emu",
    "author": "PureEfficiency2685",
    "subreddit": "Roms",
    "rank": 8,
    "score": 0,
    "upvote_ratio": 0.15,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/Roms/comments/1jejtxo/sorry_im_really_scared_of_getting_a_virus_so_i/",
    "id": "1jejtxo",
    "selftext": "Idk",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "If you are looking for roms: Go to the link in https://www.reddit.com/r/Roms/comments/m59zx3/roms_megathread_40_html_edition_2021/\n\nYou can navigate by clicking on the various tabs for each company. \n\nWhen you click on the link to Github the first link you land on will be the Home tab, this tab explains how to use the Megathread.\n\nThere are Five tabs that link directly to collections based on console and publisher, these include Nintendo, Sony, Microsoft, Sega, and the PC.\n\nThere are also tabs for popular games and retro games, with retro games being defined as old arcade systems. \n\nAdditional help can be found on /r/Roms' official Matrix Server [Link](https://matrix.to/#/#romz:matrix.org)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Roms) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "scarlet_seraph",
            "body": "Did you get it from the megathread? If so, yes. If not, then who knows.",
            "score": 3,
            "replies": [
                {
                    "author": "PureEfficiency2685",
                    "body": "I'll Check if its the one! Thank You So Much!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pablouchka",
            "body": "You can officially download it from Sony (Official firmware to update from USB). ",
            "score": 2,
            "replies": [
                {
                    "author": "PureEfficiency2685",
                    "body": "Thank You! I Finally realized How Stupid it would be that Playstation would Have A virus",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Pablouchka",
                            "body": "NP",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "zugglit",
                            "body": "Of you ever plan to hack your ps3, DO NOT UPDATE.\n\nGET AN OLDER FIRMWARE off a place like psxscene.\n\nI hacked my ps3 and wish I would have done it decades ago. \n\nI have an 8tb drive on mine full of gam...I mean, media.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Captain_N1",
            "body": "if your that scared of getting a virus then use a virtual machine to browse the web. install virtual box and then install a copy of windows 10 into that and use it....... or even better install Linux in a virtual machine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Paul-Kersey",
            "body": "No nothing is safe unless you have an original console/games\n\n\nEverything else is a virus, beware",
            "score": -4,
            "replies": []
        }
    ]
}