{
    "title": "Service Dog Meets His Hero Tigger 🥹",
    "author": "InGeekiTrust",
    "subreddit": "TikTokCringe",
    "rank": 3,
    "score": 944,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 66,
    "url": "https://v.redd.it/vnodpjtzggpe1",
    "id": "1je5tb5",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n**Welcome to r/TikTokCringe!**\n\n This is a message directed to all newcomers to make you aware that r/TikTokCringe evolved long ago from only cringe-worthy content to TikToks of all kinds! If you’re looking to find only the cringe-worthy TikToks on this subreddit (which are still regularly posted) we recommend sorting by flair which you can do [here](https://www.reddit.com/r/TikTokCringe/comments/galuit/click_here_to_sort_by_flair_a_guide_to_using/) (Currently supported by desktop and reddit mobile). \n\n See someone asking how this post is cringe because they didn't read this comment? Show them [this!](https://www.reddit.com/r/TikTokCringe/comments/fyrgzy/for_those_confused_by_the_name_of_this_subreddit/)\n    \n Be sure to read the rules of this subreddit before posting or commenting. Thanks!\n \n ##**[CLICK HERE TO DOWNLOAD THIS VIDEO](https://rapidsave.com/info?url=https://www.reddit.com/r/TikTokCringe/comments/1je5tb5/service_dog_meets_his_hero_tigger/)**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TikTokCringe) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lumber_Jack44",
            "body": "Can we be honest? It’s not a service dog if you have it dressed up in a Princess dress and Mickey ears. This the type of shit people point to when they say people are abusing service animal rules to sneak their pets into places they’re not supposed to be. This is a pretty brazen example.",
            "score": 224,
            "replies": [
                {
                    "author": "imitationpeoplemeat",
                    "body": "Honestly, this dog is probably nervous AF haha\n\nThey don't associate with characters like we do, so a larger version of... it's toy? would probably be meaningless to the pooch.\n\nI'm all for cute moments, but do this for your kid. It's incredibly unlikely to be enriching for your dog lol\n\nSo not only do people fake service dogs to circumvent regulations, but they're also probably just stressing their dog out for clout.",
                    "score": 59,
                    "replies": []
                },
                {
                    "author": "MarshalLawTalkingGuy",
                    "body": "Glad someone said it.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "sunshine___riptide",
            "body": "How can a dog have a hero? The poor thing looks very uncomfortable. Tail tucked, body hunched, submissive licking.",
            "score": 125,
            "replies": []
        },
        {
            "author": "OSRSRapture",
            "body": "Id put money on that dog has no idea who that is and definitely doesn't want to be in that stupid outfit",
            "score": 98,
            "replies": []
        },
        {
            "author": "Deepcookiz",
            "body": "Doesn't look excited",
            "score": 115,
            "replies": [
                {
                    "author": "j3horn",
                    "body": "I thought the same thing. Tail isn’t even wagging.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "DarthDank12",
                            "body": "...did you guys even watch till the end? Doggos obviously having a good time",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Kattorean",
                                    "body": "  The dog was frozen,  with tail tucked close to its body, & the dog took a submissive posture,   *until* the dog wiggled *away* from Tigger & was able to kick those back feet at Tigger.  The dog 's tail remained tucked until the dog used it to help move away from Tigger.\n\nHere's more:  When a dog shows you it's teeth,  it isn't smiling.   Exaggerated *yawns* & tongue flicking are signs of anxiety. \n\nDogs are not complicated.\n\nEdit add-on:\n\nIf the tail wags predominantly to one side,  that is NOT a happy dog.  A tail that is tucked tightly into the dog's butt, but wags at the tail's end is NOT a happy dog either. \n\nPeople will smile or laugh when they are nervous.   They smile when forced to smile for photos.   Some people smile to avoid conflict.  Does a smile mean a person is happy?   No.",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "im-dramatic",
                                            "body": "Idk why you’re getting downvoted, this is spot on. The tail, plus the licking",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Kattorean",
                                                    "body": "  People care more about their manufactured,  false image of a \"cute\" dog behavior than they care about the dog. \n\n  These are the people who will antagonize a dog,  ignore the dog's signals,  get hurt & blame the dog.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Kattorean",
                                                    "body": "And,  they think it's so cute that a dog that is trained to be submissive & compliant gets put into a stressful situation for the human's entertainment,  and they are happy to ignore the obvious signs of stress & fear the dog demonstrates.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "hikikomoriHank",
                                                            "body": "The obvious signs of stress and fear like... Baring its belly for rubs, furiously wagging its tail, rolling around in excitement, licking the Tigger incessantly, leaning into Tigger for pets when he withdraws.\n\nA rudimentary understanding of dog body language would seem to be important if you want to paint yourself a dog whisperer and everyone else as abusers lmao.",
                                                            "score": -11,
                                                            "replies": [
                                                                {
                                                                    "author": "sunshine___riptide",
                                                                    "body": "Obvious signs of stress and fear like ... Moon eyes (see the whites of their eyes), submissive closed mouth licking, tail tucked, rolling over in submission, leaning away from Tigger.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hikikomoriHank",
                                                                            "body": "The dog literally walks up to Tigger at the start of the video, and then leans into him over and over whenever he leans back and puts his hand on his fur head.\n\nIf you're just gonna make stuff up about the video I guess you can make whatever point you want",
                                                                            "score": -3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "sunshine___riptide",
                                                                                    "body": "And when Tigger is holding the dog tightly and it's actively leaning away, doing the submissive lip licking and closed mouth smile? And then it cuts to the dog sitting down?",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Kattorean",
                                                                                            "body": "They care only about their own amusement care nothing about the dog they put into this situation.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "hikikomoriHank",
                                                                                            "body": "You mean, right before the dog flops on its back to present it's belly for strokes, before excitedly rolling around on its back, wagging its tail and kicking its legs with joy, licking Tigger and seeking out more pets when Tigger leans back?",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "sunshine___riptide",
                                                                                                    "body": "You mean, AFTER the cut and the dog was given a chance to warm up to this giant toy that smells weird?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "DarthDank12",
                                                                                                            "body": "You should look up the full video before making this judgment call , just saying",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "hikikomoriHank",
                                                                                                            "body": "I don't understand what point you're trying to make? That the video has a cut? Okay, sure? And?\n\nInitially I replied to someone accusing these owners of dog abuse for their own amusement, I pointed out how the dogs behaviour clearly suggests it's enjoying itself. After some trepidation over the costume? Yeah sure, I can see that too. And what?\n\nYou're replying YEAH BHUT THE VIDEO WAS CUT!!!! like thats an important detail as to whether the dog enjoyed itself.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "sunshine___riptide",
                                                                                                                    "body": "Because that dog could have easily walked away like it clearly wanted to and been given space before feeling comfortable with Tigger. If you're such an expert on dog body language you should SEE the dog is clearly uncomfortable at first. It did warm up, but not immediately, which is why I bring up the cut. It didn't immediately melt into Tigger like you're talking about. \n\nDogs are living things not toys, and they deserve respect.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "hikikomoriHank",
                                                                                                                            "body": "I did not say the dog melted in to Tigger immediately. I never said anything like that. I pointed out it flops on its back, wags its tail, licks, and requests further pets. All of that happens. So the dog was clearly enjoying that attention.\n\nYou're saying it was uncertain and nervous to start, and I agree. Lots of things make dogs nervous and uncertain before they figure out the situation. My parents dog is nervous everyone I visit until he gives me a sniff and becomes a soppy baby. Does that mean I'm abusing my parents dog when I visit? Lots of dogs panic at people knocking on the front door, are door knickers dog abusers?\n\nA dog being nervous is not a sign of an unusual encounter is not signs of dog abuse. The fact the video doesn't show the few seconds of the dog acclimatising to the attention is not a sign it was abused.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Bobbith_The_Chosen",
                                            "body": "You know service dogs are trained not to wag right",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Curedbqcon",
                                                    "body": "And this isn’t a service dog… you know that, right?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DarthDank12",
                                            "body": "Ooh I wasn't aware I was speaking with a professional!  You must own a Golden then? \n\nLol you top 1%s are just as funny here as on the cat sub , have a good day",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "Kattorean",
                                                    "body": "Were you voted most likely to antagonize a dog, get hurt & blame the dog?   \n\nYou never know *who* you are engaging with online, unless they self- report as a dumbass,  like you just did.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "DarthDank12",
                                                            "body": "Uh huh... Makes sense.. 🤣 have a good one",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "Kattorean",
                                                                    "body": "Another dumbass brings cats into a discussion about dogs,,  and walks away thinking they were not the dumbass in the room.   Bwa-haha.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DarthDank12",
                                                                            "body": "And you have yet to realize this is a service animal...focus is on handler..tail wags become moot\n\nPlus this isn't even the full video, just clips joined together, keep raging though",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Curedbqcon",
                                                                                    "body": "It’s not a service animal though. People don’t dress their service animals up",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "DarthDank12",
                                                                            "body": "Oh boy the illiteracy there is nuts 🤣 thought you'd be more sane than the top 1%s over there is all I was saying...but you'd know that if you calmed down.. again, have a good one bud",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ShinigamiLuvApples",
                                            "body": "And tail-wagging doesn't automatically mean they're happy either, right?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Curedbqcon",
                                                    "body": "No it really doesn’t.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ChaseballBat",
                    "body": "Aren't service dogs supposed to be well behaved? Like that's their defining trait.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Kattorean",
                    "body": "  The tucked tail tells the tale for this dog.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Eisegetical",
                    "body": "Yeah. Tail wags are involuntary and there's none of that here.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "im-dramatic",
            "body": "Lol people really treat animals like humans. This is kind of unhinged. He looks uncomfortable and eventually warms up. I’m sure that dog does not have a hero and had no clue who he was.",
            "score": 65,
            "replies": [
                {
                    "author": "Star_Chaser_158",
                    "body": "The Disney adult/ dog mom combo has quite the imagination.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "GlitterEnema",
                    "body": "That’s how my dog looks when he “hugs me” his head is down and he leans against me while I wrap my arms around him. I get home from work he stretches and leans up agains my legs for his welcome home hug",
                    "score": 3,
                    "replies": [
                        {
                            "author": "im-dramatic",
                            "body": "My dog does the same but her tail wags and she falls into my body like a noodle. This dog looks stiff and the tail was tucked initially.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Imltrlybatman",
            "body": "Whenever people “human-fy” dogs like this, it really weirds me out.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Zeus_poops_and_shoes",
            "body": "The world is full of nefarious entities. Disney Adults are in the top ten.",
            "score": 13,
            "replies": [
                {
                    "author": "InGeekiTrust",
                    "body": "As a Disney adult, I can 100% confirm this is true 😭",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "CityBoiNC",
            "body": "I have a golden and this is so on point. There really is nothing like a golden.",
            "score": 26,
            "replies": []
        },
        {
            "author": "anthonyynohtna",
            "body": "Looks like a service dog, yeah they were dresses all the time.",
            "score": 4,
            "replies": [
                {
                    "author": "togocann49",
                    "body": "They might on a reward day-where they are toted on instead of toting on someone else. Also my neighbours service dog strangely like the clothing my nieces outfitted her with when neighbour was in hospital a couple of days (and we were happy to take in this wonderful dog for a couple of days).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "poopdood696969",
            "body": "That’s how golden react to everyone.  I assume if intruders broke into my house my dogs would react the same way.",
            "score": 7,
            "replies": []
        },
        {
            "author": "HunterGonzo",
            "body": "Quick personal story: a few years ago we took our kids to Disney World. We did the lunch thing where you get to meet all the Winnie the Pooh characters. After the kids got their picture with Tigger I went up and was casually like \"Do you mind if I get a photo real quick? You were always my favorite when I was a kid.\"\n\nTigger whirled around, grabbed me by the shoulders, and pulled me in for (no exaggeration) the best hug I've ever had. He acted like he was seeing an old friend for the first time in years. I'm grown-ass man and I CRIED. In that moment it wasn't a sweaty college kid in a fur suit, it WAS Tigger.\n\nDisney can be an evil corporate monopoly, but the cast members that do those meet & greets are straight up magical.",
            "score": 2,
            "replies": []
        },
        {
            "author": "grannynonubs",
            "body": "I love how they know Tigger is his hero like he has a poster of Tigger on his wall at home lmao",
            "score": 6,
            "replies": [
                {
                    "author": "Anarchic_Country",
                    "body": "He has a Tigger tattoo that he showed me. Got it in the 90s when it wasn't as cringy getting Disney tattoos.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "grannynonubs",
                            "body": "Oh that's dope. He must have got it right after Desert Storm",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ttmp22",
            "body": "I don’t know if Tigger is actually his hero but at least he got some good pets out of it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Mcboatface3sghost",
            "body": "Bullshit, that’s Hobbes, Calvin is filming, and the golden is the dog that owned me for 13 years. Now everyone of them is going sledding and discussing existential geopolitical views and the many ways that Susie is a gross dork.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ginger__snappzzz",
            "body": "![gif](giphy|Nm3mS4RKOhteg)",
            "score": 2,
            "replies": []
        },
        {
            "author": "BokChoyBaka",
            "body": "Here lies bokchoybaka\n\nDead from cute doggy video",
            "score": 1,
            "replies": [
                {
                    "author": "goblu33",
                    "body": "Rip. You never had a chance!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Posidon_Below",
            "body": "PSA: If you enjoyed the video, stay away from the comments.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BOBfrkinSAGET",
            "body": "Did you guys hear that lady saying “ohh that’s beautiful!”. That was actually me, and I’m a 55 year old  man.",
            "score": -4,
            "replies": []
        },
        {
            "author": "-Erase",
            "body": "We don’t deserve dogs 🥹",
            "score": -1,
            "replies": []
        },
        {
            "author": "weedpornography",
            "body": "Leave it to reddit to find something wrong with a heartwarming moment lmfao",
            "score": -3,
            "replies": [
                {
                    "author": "InGeekiTrust",
                    "body": "I know right 😭",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "tripleDzintheBreeze",
            "body": "I just cried\n\n![gif](giphy|11Un64tF2yX8JO)",
            "score": -13,
            "replies": []
        }
    ]
}