{
    "title": "'Immutable tablets of the communist theory of the party', Il Programa Comunista, 1960",
    "author": "None",
    "subreddit": "Marxism",
    "rank": 457,
    "score": 6,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.reddit.com/r/Marxism/comments/1e0an7d/immutable_tablets_of_the_communist_theory_of_the/",
    "id": "1e0an7d",
    "selftext": "[https://www.marxists.org/archive/bordiga/works/1960/immutable-tablets.htm](https://www.marxists.org/archive/bordiga/works/1960/immutable-tablets.htm)\n\n...\n\nMarx, precisely in order to annihilate the vagueness of the individual and subjectivist system that characterizes the essential parts of the Hegelian structure (Logic and Phenomenology), adopts for a moment the same schema of the double movement. But it is no longer a thinking and conscious timeless subject that devotes itself, on an abstract level, to the sport of stepping outside of itself (alienation, exteriorization) in order to look at itself from afar, and *confirm*: I do exist! – and then returning to the same personal receptacle, the brain, to scale this step of the staircase of certainties, leading up to the summit of the mystical pyramid where there will be – who knows how or why – “Absolute” knowledge. It is instead a physical, tangible, and real being, the worker of the capitalist age, who carries out this tragic experiment of becoming estranged from himself. And Marx poses the problem of the second movement, the true *return*, seeking its goal.\n\nThus we showed that the Hegelian scheme, *seemingly* accepted and applied by Marx, was in fact radically *transposed* by him in a revolutionary manner, in order to destroy the use that Hegel had made of it. The metamorphosis which the man of the modern age, the wage-earning proletarian, undergoes in the economy of *private property*, is a separation from the human essence, to which the members of primitive societies were closer. Alienated by the wages for which he sold himself, his time and his work, the proletarian is estranged from man; he has become a pure commodity, a physical object without life. What follows is the *key* we give to the revolutionary unraveling, described by Marx in these pages for the first time. To regain from not himself, himself; from non-man, man, the estranged worker will not aim to win back his person, his *former* individuality, thus closing a useless and stupid cycle that would offer no prospect other than that of him selling himself into slavery for a second time and for all eternity; he will instead recapture – with his class and for the whole society and human species – the quality of being human *no longer in the sense of a single individual*, but as part of the new humanity, of communism. From this moment on, the framework of the new society is outlined, and this model will remain valid until the historical time of its future realization.\n\nThe whole cycle is described in its last part whose unsurpassed formula bears repeating. The victory over the estrangement suffered until then, which the infamy of private property imposed upon the living man, is formulated as follows:\n\n“Communism as the *positive* transcendence of *private property* as *human self-estrangement*, and therefore as the real *appropriation* of the *human* essence by and for man; communism therefore as the complete return of man to himself as a *social* (i. e., human) *being* — a return accomplished consciously and embracing the entire wealth of previous development.” ^(\\[2\\])\n\n“This communism, as fully developed naturalism, equals humanism, and as fully developed humanism equals naturalism; it is the genuine resolution of the conflict between man and nature, and between man and man — the true resolution of the strife between existence and essence, between objectification and self-confirmation, between freedom and necessity, between the individual and the species. Communism is the riddle of history solved, and it knows itself to be this solution.” ^(\\[3\\])\n\n...\n\nThe thesis of integral communism states that the form of private property, and thus of the dehumanization of man, prevails not only when the capitalist spends his profit or the landlord his rent, but also when the proletarian spends his wages. Only in this way is it possible to condemn all the spurious forms in which *immediate possession* emerges triumphant, and which are luridly extolled by fake communists.\n\nEvery economy based on money is an economy of the alienation of man and of contempt for his humanity. The pages of this text, which we reported on and which deals with the commentary and passages written by the greatest of poets, such as Shakespeare and Goethe, are nothing short of incendiary. Money degrades man to a status lower than that of a beast. But here, too, the Stalinist falsification has wreaked havoc. Money is the soldering together of impossibilities, wrote Marx in his commentary on the English playwright’s statement that money *maketh the opposites kiss*. And it is none other than money, we add, that maketh Khrushchev and Eisenhower kiss.\n\nIn the Stalinist translation, the passage is instead given as follows: “Money... exchanges the characteristics and objects with one another, even if they contradict each other.” In this anodyne restatement, the pitiless condemnation of money is reduced to a vague repetition of the “law of exchange value,” claimed by the Stalinists to govern socialist economy, for it quite obviously governs the economy of Russia. But Marx rejects money precisely insofar as he rejects the law of value. The passage begins with the words: “Since money, *as the existing and active concept of value*, confounds and confuses all things, it is the general *confounding and confusing* of all things — the world upside-down — the confounding and confusing of all natural and human qualities.” ^(\\[6\\]) And it continues thus:\n\n“He who can buy bravery is brave, though he be a coward. As money is not exchanged for any one specific quality, for any one specific thing, or for any particular human essential power, but for the entire objective world of man and nature, from the standpoint of its possessor it therefore serves to exchange every quality (such as the abovementioned cowardice) for every other, even contradictory, quality and object (such as bravery, or the dagger of a hired assassin): it is the fraternisation of impossibilities. It makes contradictions embrace.” ^(\\[7\\])\n\nThis quotation is followed by another passage, which reveals that in full communism, fidelity is exchanged only for fidelity, love for love, joy for joy. And this thesis is preceded by a series of ruthless antitheses: “\\[Money\\] transforms fidelity into infidelity, love into hate, hate into love, virtue into vice, vice into virtue, servant into master, master into servant, idiocy into intelligence, and intelligence into idiocy.” ^(\\[8\\])\n\nWe drew the incontestable conclusion that where there is money, there is neither socialism nor communism, just as there is none – not by a long shot – in Russia.\n\n...\n\nThis excerpt about crude communism merits commenting on at length with regard to the condemnation made in it by Marx of the first affirmation of the community of women, understood incorrectly as the indiscriminate ownership of the female sex by the male. Marx establishes here that the same relation by which the working class man is *alienated* in the forms of property also finds its historical measure in the degree of abjection and sexual alienation of the woman.\n\nIt would require supreme audacity to try to deduce from this profound thesis, for the use of the Kremlin (it is time to retire the old phrase *ad usum delphini* ^(\\[9\\])), a justification for the form of the monogamous and even hereditary family as a socialist form! If there were no immense wealth of other evidence for stripping modern Russia of any remaining socialist veneer, it would suffice to recall an episode of atrocious topicality: the play-acting of the *couples at the summit* ^(\\[10\\]), through which the modern States that emerged from World War II with the pretense of renewing themselves are still represented for promotional purposes by the families... of sovereigns, with President, First Lady, and their offspring, and with much less decency than in the classical hereditary dynasties. The spectacle was already humiliating enough back then, in the case of the US-Russia duo, and has become all the more so recently, with strange undertones of an enjoyable parody, in the case of the Russia-Italy duo ^(\\[11\\]).\n\nMany are the passages in this text by Marx that serve to show that the program of communist society eliminates the institution of the family, just as it does those of the State and of religion – all of which are alive and well in Russia, with a veritable convulsion of justifications that ends up arriving back at the Hegelian system. Marx’s alleged but never existing Hegelianism took refuge in the Kremlin. The theoretical discussion is vast and suggestive on this point. We have the right to follow these hundred-year-old economical theses: no wages, no money, no exchange, no value; and the no less old and original social theses (very different from the bourgeois ones that seem to parrot them): no God, no State, no family.\n\n...\n\nAnother point that serves to reaffirm our rebuke of the sinister structural regressions taking place in Russia is that about *envy*, with which Marx reproached the young and ingenuous crude communism. It is envy that makes the poor man crave the wealth of the rich and depicts the former’s goal as simply a piece of the latter’s property, obtained through a general levelling-down. Marx demonstrates such envy to be an expression of economic competition, the driving force of the bourgeois world. But where else, if not in this, lies the origin of the recent Soviet recognition of the incentive of personal gain, which can be transformed and accumulated into a small fortune belonging to the individual or the family – especially in the countryside? It is this driving force that ultimately underlies the international formula of a race between States, of peaceful competition; a formula that basely wrecked the last remnants of the communist conception of the overthrow of the contemporary world of brigandage. Class struggle, the revolutionary vision, the dictatorship of the proletariat, the programmatic description of a society so radically different from the present bourgeois one – all wrecked in the livid and miserable envy among the \\[world\\] powers, which are without exception built upon the alienation of man.\n\n...\n\nHowever, even in the social-economic part of the text, after the description of full communism and before the end of the chapter on “Private property and communism,” there are passages that refer to the philosophical problem – or rather, to the escape from what has been the traditional subject of philosophizing.\n\nThe passages we have in mind follow after that about science which is not personal but rather social. And with them, we are already witness to a total demolition of Hegelianism. Hegel claims that after a tortuous deduction from the self-consciousness of the individual, one arrives at “general consciousness.” Marx’s whole final chapter will be directed at dismantling this summit of the iridescent idealist pyramid, and will end with two quotes from the Encyclopedia ^(\\[24\\]) so as to bring out their absurdity, up to and including the famous aphorism: “The absolute is mind. This is the highest definition of the absolute.” ^(\\[25\\]) What does ‘absolute’ mean? It means ‘*detached* from’ ^(\\[26\\]), and this nominalized adjective therefore says that the purported supreme achievement is *detached* from any physical or natural basis. A brilliant intuition made Hegel, in his capacity as a revolutionary of thought, say that everything that is rational is real and everything that is real is rational, but the conformist Prussian professor ended up bogged down in a most mystical and unreal spiritualism. Instead of grasping that man does not seek the *absolute* because it is not findable, it is not ‘attachable’, he insists that in his own professional person he found it once and for all, and that the search is over!\n\nHere Marx counterposes to *general consciousness* in Hegel’s sense, which “at the present day \\[...\\] is an abstraction from real life and as such confronts it with hostility” ^(\\[27\\]), the appropriation that man makes with his return to social man, which delivers it from the wretched alienation due to private property. “My *general* consciousness is only the *theoretical* shape of that of which the *living* shape is the real *community*, the social fabric” ^(\\[28\\]). There is no longer anything mystical and metaphysical about the word ‘theoretical’. The reality and life of nature and of the human species are physical facts, and their *imprint*, also made physical, onto the brain that is no longer individual but rather social, is theory.\n\nThe idea claims to have come before the fact. In actuality, the theory is given after the facts, as a superstructure of them. That is historical materialism.\n\nIn the text, there follows the thesis that there will no longer be any reason to distinguish between man’s individual life and his generic life, or rather that of the species. The consciousness of the individual, that ancient philosopheme ^(\\[29\\]), has been gotten rid of.\n\n“In his *consciousness of species* (this is how one must translate *Gattungsbewusstsein*, and not as *consciousness of the kind*, which is... another Stalinization of the kind) man confirms his real *social life* and simply repeats his real existence in thought, just as conversely the being of the species confirms itself in species consciousness and in its generality, as a thinking being, has a real existence (thus we translate *für sich ist*).” ^(\\[30\\])\n\nWhat takes place here is the complete abolition of the individual person, especially as a subject of thinking activity. “Man, much as he may therefore be a particular individual \\[...\\], is just as much the *totality* — the ideal totality — the subjective existence of imagined and experienced society for itself.” ^(\\[31\\])\n\nWe are on the brink of the fall of the eternal riddles and opposites. “Thinking and being are thus certainly distinct, but at the same time they are in *Unity* with each other” (*in Einheit* is much stronger than *united*, as in the version a.u.K. ^(\\[32\\])).\n\nA thousand-year-old contradiction is unraveled. Is it necessary to first presuppose reality, being – or does thought come first? If there were a reality without thought, who would be aware of it? That old trick which led to the dethronement of man and the introduction of His Holiness God Almighty, or the professor Absolute Spirit – what remains of it now?\n\nToday, a remedy is found in postulating populations of beings from other stars, who would have thought before our humanity and whose radio messages we perhaps simply haven’t received yet... ^(\\[33\\])\n\nThe time seems to have come to get rid of another dualist muddle, one that tormented the good Simplicio: that between the Greek *nous* and *aistesis*, the mind and the senses. Remember? The eye tells me that the stick partly immersed in water is broken, yet I say it is not, because the mind makes clear to me as much. The senses deceive; thought finds the truth. But was it thought – or was it the senses of another person looking into the water, or a different sense of my own, touch? Now we will see that after establishing that reason is not a personal faculty but rather a social one, we will do the same also for the senses and for experience.\n\nThat the senses were individual was a stupid illusion determined by the historical relationship of private property. Here it is economy and history that help us escape from the old philosophical tricks!\n\n“Private property has made us so stupid and one-sided that an object is only *ours* when we have it (not when we *sense* it) — when it exists for us as capital, or when it is immediately (O unfortunate immediatists) possessed, eaten, drunk, worn, inhabited, etc., — in short, when it is used by us \\[...\\] In the place of all physical and mental senses there has therefore come the sheer estrangement of all these senses, the sense of *having*.” ^(\\[34\\])\n\nMarx could retrieve his sexual measuring device and say that for bourgeois psychology, joy is not when you love a woman, but when you *have* her!\n\nBut after the elimination of private property, in communism:\n\n“Man appropriates his comprehensive essence in a comprehensive manner, that is to say, as a *whole man*. Each of his human relations to the world-seeing, hearing, smelling, tasting, feeling, thinking, observing, experiencing, wanting, acting, loving-in short, all the organs of his individual being, like those organs which are directly social in their form, are in their objective orientation, or in their orientation to the object, the appropriation of the object, the appropriation of human reality. Their orientation to the object is the manifestation of the human reality. This manifestation is just as highly varied as the determinations of human essence and activities, human activity and human suffering (another classic contrast), for *suffering, humanly considered, is a kind of self-enjoyment of man.*” ^(\\[35\\])\n\n^(...)\n\nAll these wonderful results, which will be brought about by the communist revolution and which are anticipated in the doctrine of communism that has been complete ever since 1844; all these unravelings of riddles ‘unfolded in history once and for all’ have been rendered possible in their marvelous effects by abandoning the thousand-year-old illusion of the sole individual facing the natural world, stupidly called ‘external’ by philosophers. External to what? External to the supremely deficient ‘I’, yes, but external to the human species – that can no longer be said, for Species-man is internal to that same nature; forms part of the physical world.\n\nIn the splendid expression above that an utmost manifestation of man – the highest one – is *suffering*, because if he did not suffer, he would not know of the joy to which he is inclined in life and in history, the very basis of all “grammars” has been gotten rid of: that is, the active and the passive, the subject and the direct object. Elsewhere Marx says that philosophers went so far as to make subjects out of all predicates.36 Philosophy, for thousands of years grammatically incorrect, has been blinded by the folly of relating everything to the silly phantasma of the *Ego*.\n\nIn this potent text, the object and the subject become, just like man and nature, the same thing. Indeed, everything is nature, everything is an object: man the subject, man “against nature” disappears, along with the illusion of the individual ‘I’.\n\nThat is what we can read in these pages, all the greater because of how obviously they bear the marks of the revelatory hastiness (for us, there would be no *creation* if not for *passion*) with which a determining force compelled \\[the author\\] to write them down.\n\nWe have seen that when the individual becomes the species, the spirit, that impoverished *absolute*, dissolves itself into objective nature. For individual brains, those pitiful passive little machines, we have substituted the *social brain*. Moreover, Marx has overcome the individual, bodily *senses* within the form of collective, human *perception*.\n\n“The abolition of private property is therefore the complete *emancipation* of all human senses and qualities, but it is this emancipation precisely because these senses and attributes have become, subjectively and objectively, *human*. The eye has become a human eye, just as its *object* has become a social, human object — an object made by man for man.” ^(\\[37\\])\n\nIt does not have to be pointed out any longer that this grammatically singular *man* stands for the unitary plurality of men, humanity, the social species (when it frees itself from the scourge of property). Even the singular and the plural of grammarians are swept away by the wave of revolution.\n\n“The senses have therefore become directly in their practice *theoreticians*.” The word ‘therefore’ is used because we are no longer speaking of the subjective, individual senses. O Peripatetic Simplicio, here is your bridge to span the Aristotelian abyss between the senses and the mind!\n\n“Need or enjoyment has consequently lost its *egotistical* (Marx’s italics, which every so often override ours) nature, and nature has lost its mere utility by use (use by that ugly mug, the private individual) becoming *human* use.”\n\n“In the same way, the senses and enjoyment of *other* men (in the text: of the other man) have become my *own* appropriation. Besides these immediate (*immediate* means *individual*, which is why immediatism means anticommunism) organs, therefore, *social* organs develop in the form of society\\[.\\]” ^(\\[38\\])\n\nFor ‘social’, read ‘impersonal’.\n\n“It is obvious that the (collective) *human* eye enjoys things in a way different from the crude, non-human eye; the human ear different from the crude ear, etc.” ^(\\[39\\])\n\nHow can the subjective eye of the worker, which only sees small change being slapped in his hand, enjoy things in the same way as the human eye? Or his ear, which only hears the sound of enslavement? Wages and money nail the eye and the ear, and thus also the spirit, to *inhuman crudeness*, which continues unabated in Russia. The text with its *et cetera* has flown to other heights; we have reached the end in a way determined by the present day.\n\n...\n\nHuman knowledge advances by revolution. Human knowledge advances by social revolutions. The rest is silence.\n\nIt is, in the end, a matter of getting rid of God, but not in order to light the pillar candles that were placed on his altars inside the ignoble receptacle of the thinker’s braincase. The unitary welding together of man and nature has abolished every dualism, every *unreality* between man and nature, between spirit and world. But as a result of the tradition passed down from the *property-owning* past, it is not easy to free oneself from the question: since nature had followed its trajectory since before man, its origin cannot be explained without a Creator.\n\nOur atheism has nothing in common with that which the immanentist bourgeois idealists arrived at, and which we reduce to transcendent voids.\n\n“Since the *real existence* of man and nature has become evident in practice, through sense experience (by overcoming the dualist illusion of two non-comparable essences, that of the spirit and of the material world), because man has thus become evident for man as the being of nature, and nature for man as the being of man, the question about an *alien* being, about a being above nature and man — a question which implies the admission of the unreality of nature and of man — has become impossible in practice.” ^(\\[42\\])\n\nWith private property, it was necessary to call oneself an atheist to accept the existence of man as something different from natural matter. Man having been restored to nature as an integral part of it, both religion, which affirms the existence of God, and atheism, which denies it, have become equally useless to us. God and his Negation, time for retirement!\n\nAlong with the two, since 1844 it’s been time for retirement also for Hegel.",
    "comments": []
}