{
    "title": "Book Rec Needed: Transition from Slavery to Feudal Mode of Production",
    "author": "Wheres_My_Mushroom",
    "subreddit": "Marxism",
    "rank": 416,
    "score": 23,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/Marxism/comments/1eo2zv3/book_rec_needed_transition_from_slavery_to_feudal/",
    "id": "1eo2zv3",
    "selftext": "Currently reading Capital and am looking for books (hopefully with a dialectical and historical materialist lens but not a requirement) on the transition from the ancient slave-based mode of production and into feudalism. Also books that are about the feudal mode of production would also be appreciated. Any ideas?",
    "comments": [
        {
            "author": "Mayonnaise-chan",
            "body": " I'm not very well-read on this, but I know the classic book on the topic is Perry Anderson's \"passages from antiquity to feudalism.\" Georges Duby's \"peasants and warriors\", which follows Marc Bloch's definition of feudalism (in his work \"feudal society\") is also considered a classic. A more recent work on this period is Chris Wickham's \"framing the early Middle Ages\", though Wickham is a proponent of the concept of the tributary mode of production rather than the slave and feudal modes (and the more recent historiography in general considers the concept of the slave mode of production incorrect, or at best only applicable for the late roman republic and early empire, and specifically in Italy and Sicily, while in other regions the evidence shows that the greater part of the labor force was made up of free peasants and coloni, rather than slaves; some opt instead for the tributary mode of production (as proposed by John Haldon and others) as a concept encompassing all or most pre-capitalist social formations, while others prefer to describe classical antiquity with the category of the ancient mode of production, as outlined by Marx in \"pre-capitalist economic formations\", a part of the Grundrisse).",
            "score": 15,
            "replies": []
        },
        {
            "author": "TheBittersweetPotato",
            "body": "[This](https://jacobin.com/2022/04/marxism-middle-ages-medieval-antiquity-economic-theory-history-capitalism) is a Jacobin article from a lecturer who specializes in late antiquity and the middle ages about the flaws of the orthodox Marxist views on the transition and alternative conceptions by other Marxists.",
            "score": 10,
            "replies": []
        },
        {
            "author": "LegioTitanicaXIII",
            "body": "A good companion to your reading on this time period:\n\nCaliban and the Witch:\n\nexplores gender and the family during the primitive accumulation of capital. As part of the radical autonomist feminist Marxist tradition, the book offers a critical alternative to Marx's theory of primitive accumulation. Federici argues that the witch hunts served to restructure family relations and the role of women in order to satisfy society's needs during the rise of capitalism.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "pharodae",
                    "body": "You're being downvoted ecause our archaelogical and historical data now points to some rather different conclusions to that of Marx/Engels and a 1950's Soviet textbook. Especially when it comes to stage-theories of modes of production.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}