{
    "title": "Marx and the “end of history” question ",
    "author": "Alternative_Yak_4897",
    "subreddit": "Marxism",
    "rank": 342,
    "score": 13,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/Marxism/comments/1fs7but/marx_and_the_end_of_history_question/",
    "id": "1fs7but",
    "selftext": "In Francis Fukuyama’s “end of history,” does anyone know if he is building on Marx/hegel’s idea that the “end of history” refers to the end of the division of economic classes or if he is trying to pull off an original thesis? I’m not sure if it was Hegel or Marx who use the end of history phrase to refer to the end of economic classes. If Fukuyama’s “end of history” as it refers to world-wide democratic ideology as that which ends the potential for war, is that him building on Marx/hegel or is he seemingly using this phrase in isolation? ",
    "comments": [
        {
            "author": "industrial_pix",
            "body": "Fukuyama was as far from a Marxist as one could reasonably expect.\n\n\"What we may be witnessing is not just the end of the Cold War, or the passing of a particular period of postwar history, but the end of history as such: that is, the end point of mankind's ideological evolution and the universalization of Western liberal democracy as the final form of human government.\"\n\n— Francis Fukuyama, \"The End of History?\", The National Interest, No.16 (Summer 1989)",
            "score": 16,
            "replies": []
        },
        {
            "author": "waspMilitia",
            "body": "Haven't you read the book?\n\n\"The End of History\" directly contrasts Marx, showing that since socialist revolutions did not happen, they are proven impossible and we live in the only possible and best system.\n\nThey rely on different things - if Marx dictates logically, then Fukuyama adjusts the facts and builds a theory on them. This is not without meaning, if you do not leave only the facts convenient for yourself and do not extrapolate them in the order of infinity.\n\nIn addition, Marx did not actually adhere to the concept of the end of history. The built communism according to Marx means only a radically new stage in the life of all mankind. Marx did not know what would happen after this stage. We can fully assume a new round of development for the freedom of mankind, because the ideas of communism ultimately are only the end of the exploitation of man by man.",
            "score": 18,
            "replies": []
        },
        {
            "author": "TheTrueTrust",
            "body": "\"End of history\" is rather broad and was a  widespread notion that got a strong foothold in Europe during and following the French revolution. However, the specific phrasing is not found in either Marx or Hegel. History is linearly progressive in both their systems but it doesn't \"end\" with the Prussian state in Hegel or with communism in Marx. The highest point of history as a process is reached but that point isn't going to be static, rather it plateaus. If anything, that's where they pictured that our true purpose and history *begins,* but that's wildly speculative.\n\nFukuyama drew mainly on the legacy of Leo Strauss and Alexandre Kojeve. Anything said about \"end of history\" in Marx or Hegel must be understood as coming from these guys first and foremost. Kojeve was a Marxist in his youth and a scholar of Hegel, but he erroneously portrayed his own theories as a correct understanding of Hegel and, despite this, exercised a major influence on post-war philosophy. Fukuyama was also a second generation Straussian, part of the neoconservative movement and would have learned a lot of things about Marx that way.\n\nIn short, you could say that he was drawing on Marx and Hegel but in a **very** roundabout way, and what he learned about them was filtered through many other thinkers which would have generated a completely distorted view in the end.",
            "score": 8,
            "replies": [
                {
                    "author": "3corneredvoid",
                    "body": "I don't know much about Kojeve, but I do know that in some sidebar, Deleuze mentions being taught Kojeve's dumbed down version of Hegel by a dry French scholar called Hippolyte as what \"created\" him ...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mymentor79",
            "body": "Fukuyama's \"end of history\" lasted, what, 10 years?  Fukuyama is an educated moron, and I imagine the closest he ever came to engaging with either Marxian or Hegelian thought was a brief period of study he did with Derrida before getting cold feet and transferring to the Harvard Psychopath Factory.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Aristeo812",
            "body": "\"The end of history\" is not a Marxist term, it's a notion from liberal economy. Marx never mentioned \"the end of history\", and it's a mistake to attribute anything in this regard to him. Actually, in his [A Contribution to the Critique of Political Economy](https://www.marxists.org/archive/marx/works/1859/critique-pol-economy/preface.htm) Marx wrote something totally different:\n\n>**The bourgeois mode of production is the last antagonistic form of the social process of production** – antagonistic not in the sense of individual antagonism but of an antagonism that emanates from the individuals' social conditions of existence – but the productive forces developing within bourgeois society create also the material conditions for a solution of this antagonism. **The** ***prehistory*** **of human society accordingly closes with this social formation**.\n\n(Emphasis is mine)\n\nI.e., according to Marx, we ATM live in a *prehistoric* period of human society. The end of class division will mark the beginning of a *true* human history, when social development is no longer a chaotic, unconscious, spontaneous process, but, contrary to that, people themselves deliberately and intentionally govern the process of social development.",
            "score": 11,
            "replies": []
        },
        {
            "author": "SciFi_Pie",
            "body": "Communism would mean that human history would no longer be a history of class struggle (since there would no longer be classes), but by no means does that mean that Marxists would consider communism to be the end of history. That's a firmly anti-materialism notion, though it's similar to Hegel's idealist notion of the Absolute Idea.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Barsuk513",
            "body": "Fukuyama is proven to be totally wrong. Democracy, western style, is suitable only for small western countries of certain cultural background. ( E.g. Finalnd or California). Democracies, after the collapse of USSR, evolved accordingly to Marx . They started to impose themselfs to the rest of planet, behavoring in fact like capitalist corporations and NATO/EU as imperialist front .",
            "score": 0,
            "replies": []
        }
    ]
}