{
    "title": "Dialectical materialism and modern natural science",
    "author": "None",
    "subreddit": "Marxism",
    "rank": 243,
    "score": 23,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 29,
    "url": "https://www.reddit.com/r/Marxism/comments/1h64akc/dialectical_materialism_and_modern_natural_science/",
    "id": "1h64akc",
    "selftext": "How would a dialectical approach to modern natural science change the major bodies of knowledge we have today? Thinking back to people like Lysenko, how do errors like that get avoided and how would the modern scientific community change under a Marxist worldview? Obviously Darwinian speciation gave some merit to dialectics but I just wanted to know if anyone could shed more light on the topic. Thanks in advance",
    "comments": [
        {
            "author": "None",
            "body": "[deleted]",
            "score": 23,
            "replies": [
                {
                    "author": "Oskarkf",
                    "body": "Lenin was so weird about that word 'dialectics'. There's nothing resembling the Hegelian or Marxian dialectic in \"+ and -\".\nThe dialectical method of Hegel relied on negations. - is not the negation of + in the sense that Hegel or Marx used that word",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Canchito",
                            "body": "You're the de only one being \"weird\". NEGation and NEGative have a common etymology for a reason.\n\nGetting hung up on formal differences and seeing them as essential differences is one example of metaphysical anti-dialectical thinking, and a rather primitive one at that.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Oskarkf",
                                    "body": "I'm not hung up on formal differences or etymology. Negation is a very specific concept. The negation of \"being\" is \"not being\" (the dialectic arises realising that being only makes sense when related to the notion of \"not being\"). The negation of \"+\" would be \"not +\" which makes very little sense. That's exactly why Hegel was against using formal logic for metaphysics. \nMarx didn't like spending time on idealistic metaphysics (and just to be very clear, maths aren't material but ideal) , so he instead used similar logics on material social relations. With this in mind, that Lenin quote seems strange and kind of like a misunderstanding of the concepts of the dialectic.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Canchito",
                                            "body": "It's not strange, and it's certainly not a misunderstanding of the dialectic. Dialectics is not about \"concepts\". It's about the underlying material process which leads to the constant inception and death of concepts. \n\nIt doesn't matter what word you want to use: Negation, contradiction, refutation, overcoming, \"Aufhebung\", etc. Similarly, it's irrelevant which particular example from nature or science is used to *illustrate* the point that there is fundamentally no such thing as a non-contradictory phenomenon or idea.\n\nThese are all philosophical terms to very abstractly summarize something which is only found in concrete reality, and which is best described conceptually in the concrete language of science, in the actual description of the real laws of motion as precisely as the current state of the productive forces permit.\n\nIn this, Hegel was absolutely right that there is no \"abstract truth\", truth is always *concrete*.\n\nThere is no reality, therefore no rationality, to the \"concept\" of \"being\" as opposed to \"not being\". It is an abstract concept which serves as the starting point for an idealist and thereby inevitably mystical and metaphysical shadow of dialectics, as contained in Hegel's brilliant but largely abstract and \"conceptual\", i.e. idealist work.\n\nYou are trying to impose on Lenin the Hegelian (i.e. idealist) form of dialectics. As a student of Hegelian philosophy, you say it's \"strange\" that Lenin does not follow this form. You go so far as to imply Marx would somehow agree with your approach.\n\nBut here's what Marx himself had to say about this exact question:\n\n>My dialectic method is not only different from the Hegelian, but is its direct opposite. To Hegel, the life process of the human brain, i.e., the process of thinking, which, under the name of “the Idea,” he even transforms into an independent subject, is the demiurgos of the real world, and the real world is only the external, phenomenal form of “the Idea.” With me, on the contrary, the ideal is nothing else than the material world reflected by the human mind, and translated into forms of thought.\n\nI recommend you read Engels who elaborates on this question, even though it is immediately clear you'll parrot the claims of bourgeois academia according to which Engels somehow deviated from Marx:\n\n>[..]in its Hegelian form, this method was unusable. According to Hegel, dialectics is the self-development of the concept. The absolute concept does not only exist — unknown where — from eternity, it is also the actual living soul of the whole existing world. It develops into itself through all the preliminary stages which are treated at length in the Logic and which are all included in it. Then it “alienates” itself by changing into nature, where, unconscious of itself, disguised as a natural necessity, it goes through a new development and finally returns as man’s consciousness of himself. This self-consciousness then elaborates itself again in history in the crude form until finally the absolute concept again comes to itself completely in the Hegelian philosophy. According to Hegel, therefore, the dialectical development apparent in nature and history — that is, the causal interconnection of the progressive movement from the lower to the higher, which asserts itself through all zigzag movements and temporary retrogression — is only a copy [Abklatsch] of the self-movement of the concept going on from eternity, no one knows where, but at all events independently of any thinking human brain. This ideological perversion had to be done away with. We again took a materialistic view of the thoughts in our heads, regarding them as images [Abbilder] of real things instead of regarding real things as images of this or that stage of the absolute concept. Thus dialectics reduced itself to the science of the general laws of motion, both of the external world and of human thought — two sets of laws which are identical in substance, but differ in their expression in so far as the human mind can apply them consciously, while in nature and also up to now for the most part in human history, these laws assert themselves unconsciously, in the form of external necessity, in the midst of an endless series of seeming accidents. Thereby the dialectic of concepts itself became merely the conscious reflex of the dialectical motion of the real world and thus the dialectic of Hegel was turned over; or rather, turned off its head, on which it was standing, and placed upon its feet.\n\nEngels too used the same \"strange\" examples from maths and science that Lenin used to illustrate the fact that everything is inherently contradictory and changing, and therefore can never be captured by one-sided \"concepts\", or any static concept for that matter: Be it \"being\", \"not being\", or anything else...",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Oskarkf",
                                                    "body": "I also disagree with Engels when he tries to relate the dialectic method to maths. Maths is a system of formal *first order logic* - Hegel's method doesn't apply to that, according to Hegel himself.\n\nMaths is a system of pure ideas, which means that the materialist dialectics doesn't make sense either.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Canchito",
                                                            "body": "Hegel was an idealist. Despite his dialectical method and at times brilliant intuition, his starting point was ideas, which inevitably leads to metaphysics and mysticism. His Criticism of mathematics was based on a very primitive understanding of mathematics. Frederick Engels was far ahead of Hegel in that regard, and even he was behind the developments in mathematics in his time. \n\nThe method matters but the concrete subject matter which is approached with that method also matters. Hegel's main subject matter was abstract philosophical ideas. A better and more concrete understanding of mathematics would have allowed Hegel to see in it the same dialectics he saw in the development of philosophy. His dictum that truth is always concrete prevailed once more.\n\nOf course, you can remain mired in idealist metaphysical anti scientific thinking of the 18th century carried over by Hegel in the early 19th century, and either claim that maths or dialectics are garbage, or you can approach the question historically, i.e. dialectically.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Oskarkf",
                                                                    "body": "I'm not saying dialectics or maths are garbage. I'm just saying that applying Marxian or Hegelian dialectics to a system of formal logic is wrong. That is according to Marx and Hegel. I'm a Marxist like you, but we have to recognize that in their pursuit of relating dialectics to well known stuff, Engels and Lenin sometimes said nonsense. That's neither anti-marxist nor anti-science",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Canchito",
                                                                            "body": "You profoundly misunderstand dialectics. You also fail to substantiate your claim that your views accord with those of Marx or Engels, who hold identical views on dialectics. \n\nYour claims are exactly equivalent to either saying that dialectics is just old Hegelian nonsense and has nothing to do with science, or that Hegelian dialectics is somehow superior to science. \n\nBoth sides of this same coin are false, and represent typical bourgeois tendencies in the treatment of Marxist philosophy. (Look up the debate in the Fourth International with Burnham and Schachtman.)",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Blitzgar",
                    "body": "No, Lysenko rejected *all* concepts of genetic inheritance, not merely \"disgusting and racist bourgeoisie farce\". Lysenkoism was 100% in accord dialectic materialism. You just had to *educate* the seeds and they would take on the traits you want. Inheritance? Genetics? Ignore those anti-dialectic materialist lies!",
                    "score": 0,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Blitzgar",
                                    "body": "I know the history very well. I also know that Lysenko went far beyond rejecting the abuses of the era to rejecting the *very concept of heritability, itself*. No matter how much dogmatic propagandists might want to \"rehabilitate\" Lysenko and Lysenkoism. His dogmas were pseudoscience and cannot be excused. They were what happens when you blindly apply political dogma to biology. They were no better than what modern-day blind dogmatic propagandists claim Lysenko was opposing. Lysenkoism applied the dogmas of Marxism quite forcefully. Inheritance is bourgeoise in nature and, as such, is incompatible with the thinking of the New Man.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Unhappy-Hand8318",
                                            "body": ">Inheritance is bourgeoise in nature and, as such, is incompatible with the thinking of the New Man.\n\nWhat are you talking about?\n\n>They were what happens when you blindly apply political dogma to biology.\n\nIt sounds like you're applying your subjective opinion of Marxism to the historical situation, to be honest.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ResponsibleRoof7988",
            "body": "The sciences already do to a certain degree where they apply concepts like dynamic systems and chaos. These are approached as major breakthroughs - and are - but often miss really significant details that are elucidated by concepts like negation of the negation and quantity into quality/quality into quantity.\n\nThis even comes up in linguistics and linguistic development, this example being English. I had a graph which illustrated this very well but can't find it right now - when a child learns language they will go through a period of accumulating words and phrases, then start to acquire plurals. As they increase the frequency and accuracy of plural use, the acquisition of new vocabulary drops towards almost zero, until they've completed the acquisition of plurals. At that point the acquisition of new vocabulary takes off again, only then at a higher level because the child integrates these with plural forms.\n\nSo the process of plural acquisition negates the vocab acquisition, which is in turn negated by new vocab + plurals acquisition - *aufhebung*. The negation of the negation, with the overcoming and preservation of the negated, now integrated into a higher form. Also quantitative accumulation of vocabulary leads to qualitative leap to development of plurals. Quantitative increase in use and accuracy leads to qualitative leap to accurate application of plurals across new vocabulary.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DialecticalEcologist",
            "body": "Read *The Dialectical Biologist* by Lewontin and Levins and *Dialectics of Nature* by Engels. Dialectical materialism provides a superior framework for understanding the natural world. Another responder has gotten DM confused with historical materialism, which is the application of DM to human societies.\n\nLysenko was just wrong on some key genetic points independent of DM, but he wasn’t as bad as he’s made out to be in the West.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Luke_Z31",
            "body": "I study biology. I think dialectical materialism is more like an application of scientific methods, which has been used by most natural scientists for centuries, in humanities subjects. You also mentioned Lysenko, he’s just a guy who’s LARPING a Marxist to gain power for himself. These people can be found all over the world. The solution is to have a functional peer review system.",
            "score": 6,
            "replies": [
                {
                    "author": "None",
                    "body": "Who is acceptable as a gatekeeper? Who gets to be a peer reviewer?\n\nDecisions have to be made.\n\nThey will be made by those who have gotten themselves into positions of power.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "pharodae",
            "body": "Murray Bookchin uses [dialectical naturalism](https://theanarchistlibrary.org/library/murray-bookchin-social-ecology-and-communalism) as the basis for his theory of Social Ecology. It's within the tradition of Hegel, Marx, and Engels, but it's focused on teasing out the origins of environmental and ecological isses as arising from human social conflict. Definitely super interesting stuff even if you leave the political implications behind. \n\nBookchin was quoted as saying that dialectical naturalism contrasts the \"empyrean, basically antinaturalistic dialectical idealism\" of Hegel and \"the wooden, often scientistic dialectical materialism of orthodox Marxists,\" and was extremely critical of Soviet and Chinese agricultural failures like Lysenkoism and the Four Pests Campaign (which could have been avoided with a sound ecological framework).\n\n\nBouncing off of the Lysenkoism example; he believed he was operating within a scientific, materialist framework for developing new agricultural methods; however, he rejected scientific advances made in the first world (such as genetics and natural selection) by denouncing them as bourgeois, and imprisoning. It should serve as a warning against both the politicization of science and the utilization of state power in class war. \n\nSocial Ecology tells us that Lysenko's failures are rooted in the social attitudes and power dynamics of his time - the Soviet focus on the proletarian factory worker and the proletarization of the peasantry and the mis-application of dialectical materialism led Lysenko into viewing agriculture as an outdoor factory for which the plants develop in stages depending on environmental effects, not genetic heritance. The methods he developed ended in devastating failure because of their extremely lacking material basis and scientific rigor.",
            "score": 4,
            "replies": []
        },
        {
            "author": "sorentodd",
            "body": "Lysenko wasn’t an error. Both his presence in Soviet science and the underpinnings of his theories were massively overstated by liberal media outlets of a perverse desire to craft an evil wizard",
            "score": 1,
            "replies": []
        },
        {
            "author": "ListenMinute",
            "body": "I highly recommend reading Roy Bhaskar on Critical Realism.\n\nBhaskar is a philosopher of science and is of a Marxist framework.\n\n[Reclaiming Reality : a critical introduction to contemporary philosophy](https://annas-archive.org/md5/2910a85e416f2853acb396e0226b2d14)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Techno_Femme",
            "body": ">\"It is obvious that I do not say anything con­cerning the particular process of development of, for example, a grain of bar­ley from germination to the death of the fruit-bearing plant, if I say it is a nega­tion of the negation\"\n\n—Engels, Anti-Dühring. \n\nThis quote by Engels applies to a lot of people in this thread and also to Lenin's notebooks. Lenin we can forgive because most of his work on dialectics was in private notebooks where he was in the process of working things out.\n\nDialectical materialism doesn't really explain anything. It is a language of processes but you still need to understand the process to use the language correctly and say anything worth any meaning. The error of Lysenko and the Soviets of that era was expecting to apply ready-made conceptions and methods to a science. Marx actually critiques Ferdinand Lassale for trying to do this with economics:\n\n>\"He will dis­cover to his cost that it is one thing for a critique to take a science to the point at which it admits of a dialectical presentation, and quite another to apply an abstract, ready-made system of logic to vague presentiments of just such a system\" (MECW, 40:261).\n\nDialectical materialism, then, can be understood as a shared language that can emerge within the sciences to describe complex processes. There are actually other attempts to create shared language in this respect. My favorite is Cybernetics and Systems Theory. IMO, in complex systems theory, you start to get a lot of things that mirror dialectics. \n\nAt best, though, this shared language would allow easier communication between the sciences on many topics but would not explain processes on its own. \n\nThe sciences cannot be fundamentally transformed by the ideas of the scientists alone. They have to be unchained from the profit motive and the need for funding. \n\nThe Marxist and engineer Amadeo Bordiga says:\n\n>\"Whether or not it be behind the capitalist as a person, industrial fixed capital, as opposed in its capitalist form to human labour, becomes the measure of the exchange value of products or commodities. This is the enemy Monster that hangs over the mass of producers, monopolising a product that concerns not only all present human beings but the entire course of the species down through the millennia. This product is the science and technology elaborated and deposited in the *social brain*. Today, with the degeneration of the capitalist form, this Monster is killing science itself, misgoverning it, criminally exploiting it fruits, squandering the heritage of future generations.\"\n\nIn other words, it is the economic and political whips and chains removed from science that will radically change it, allowing it to stretch freely with the needs of humanity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blitzgar",
            "body": "The last time dialectical materialism was applied to natural science, the world got Lysenkoism. After all, inheritance of traits *at all* is a *bourgeois* concept that is incompatible with the immutable dialectical materialist principle of improvability.",
            "score": -1,
            "replies": []
        }
    ]
}