{
    "title": "Books on Individualism based on Marxist prespective",
    "author": "Babu_s23",
    "subreddit": "Marxism",
    "rank": 237,
    "score": 10,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/Marxism/comments/1h8zv1z/books_on_individualism_based_on_marxist/",
    "id": "1h8zv1z",
    "selftext": "Can someone suggest me books on individualism based on marxist sense. I don't know If I am asking it right but wanted to know. \n\nWe should have commune thoughts but we can't be commune in every sense. Then there is this Individualistic taught everywhere when there should be communal thought. Bit finding it hard to understand on the whole. \n\nSuggest some books. ",
    "comments": [
        {
            "author": "C_Plot",
            "body": "I can’t think of any good essays or books off the top of my head. However, the conflict you express here is merely a strawman construction of Marxism from the dogmatic capitalist ruling class subterfuge. What communist/socialist living requires is a healthy and robust civic sphere. \n\nIn that sense, the individual pursues their individual interest in all things. However, part of that individual interest pursuit, involves common resources—common wealth (common assets) and other common concerns (common liabilities). The way the individual pursues their own common interest in these common resources is through a vigorous civic advocacy for what is required for their needs and desires (along with the needs and desires of any collective associations they form) from the communist Commonwealth (in the community) or broader socialist Commonwealth (region, continent, Globe). \n\nThe socialist or communist Commonwealth then faithfully endeavors  to meet the diverse and plural needs and desires expressed by all in the fine-grained stewardship, administration, and proprietorship of our common resources. The Commonwealth must also endeavor to moderate and mediate the diverse conflicting demands upon the scarce natural and other common resources, in a manner that secure the rights of all involved and maximizes the social welfare of the relevant collective.",
            "score": 11,
            "replies": []
        },
        {
            "author": "TheWikstrom",
            "body": "Imo Marx is very individualistic in the sense he wants  people to be radically free. It's just that he's often strawmanned or misconstrued because he argued that freedom can only be achieved through collective struggle\n\n\"Above all we must avoid postulating “society” again as an abstraction vis-à-vis the individual. The individual is the social being.\"\n\n- Economic and Philosophic manuscripts of 1844",
            "score": 9,
            "replies": [
                {
                    "author": "Hopeful_Vervain",
                    "body": "This. I think people sometimes forget how Marx is concerned with overcoming alienation in the first place, with true freedom and emancipation, I guess because the liberal idea of \"freedom\" is antithetical to communism, and I think because he's usually more concerned about *how* to do this rather than discussing abstract ideals. \n\nMarx isn't against personal freedom tho the goal is literally a society where both the broader society and the individuals' interests would match together, where people do things (labour) in order to fulfill both their individual and the collective needs *at the same time*, it's not an either/or situation anymore where one limits the other. \n\n> In place of the old bourgeois society, with its classes and class antagonisms, we shall have an association, in which the free development of each is the condition for the free development of all.\n\n(*The Communist Manifesto*, Chapter 2)\n\nAnd this can only happen in a classless society, through the abolition of private property (because that's where alienation originates from) and through the broader collective action of the working class (because change in isolation is ineffective).",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hopeful_Vervain",
            "body": "I don't know exactly about books specifically on individualism right now, sorry about that. But I think it's not really fair to see it as purely oppositional concepts where you have to pick between individualism and collectivism or find a balance between the two. Under communism both of those concepts would elevate and support each other instead, the individuals can only thrive under a collective framework, the collective framework depends upon individuals to exist as well, they are interdependent. \n\nIf you hear people criticising individualism from a communist perspective it's either because of a focus on individualism in isolation (ignoring the broader social context), or specifically individualism as it exists under capitalism (mostly competition).\n\nedit: I guess [this part](https://www.marxists.org/archive/marx/works/1845/german-ideology/ch01d.htm#d1) of the German ideology might be helpful tho?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Counter-psych",
            "body": "Marx makes various connections to the individual and the true development of the person is in essence the telos of Marxism. He talks about this in Grundrisse and Resultate. Soviet psychologist developed these ideas further. See Luria, Leontvey, and especially Lomov. \n\n“Mind in the World” by David Lethbridge is a great starting point. It’s out of print but very worthwhile. Some mistakes but not many.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PrimaryComrade94",
            "body": "I agree with you on the inability for commune in every sense of being (I concur). Don't know of any specific books on the subject (wish I did), but there are a few research papers done that I think can help you, was able to dig up *Individualism and Communism in Anarchism* by Errico Malatesta ( yeah anarchism but really only one I could find [Individualism and Communism in Anarchism | The Anarchist Library](https://theanarchistlibrary.org/library/errico-malatesta-individualism-and-communism-in-anarchism). As for what Marx thought there is this from the Mises Institute [Why Marx Hated Individualism | Mises Institute](https://mises.org/mises-wire/why-marx-hated-individualism).",
            "score": 1,
            "replies": [
                {
                    "author": "TheWikstrom",
                    "body": "Idk if you're aware, but the Mises institute is an astroturf org that was created by the rich to disseminate propaganda. Marx was fiercely individualistic which is evident if you read his works",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}