{
    "title": "Hi comrades ! I'm a Political Sciences strudent with way too much free time, so I decided to write a Constitution for what i'd consider and ideal socialist state. Please let me know what you think of it !",
    "author": "DeChampignak",
    "subreddit": "Marxism",
    "rank": 207,
    "score": 23,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/Marxism/comments/1hjhm5r/hi_comrades_im_a_political_sciences_strudent_with/",
    "id": "1hjhm5r",
    "selftext": "**Preamble**\n\nGuided by the principles of Marxism-Leninism, the Socialist Federal Republic proclaims the dictatorship of the proletariat, aiming to abolish the exploitation of man by man and to construct a classless society. Founded on popular sovereignty and the centrality of the working class, the Republic guarantees the democratic participation of the masses in all spheres of political, economic, and social life.\n\nEndorsed by the masses, this Constitution establishes and secures their power over the economic and political apparatus. It ensures their leading role in the construction of socialism.\n\n\n\n**Title I: The Organization of Political Power**\n\n**Article 1: Nature and Composition of Representative Institutions**\n\n1. Popular sovereignty is exercised through two assemblies:\na) The Federal Party Assembly (FPA), the central organ of economic planning and state management, representing the organized working class within the Communist Party.\nb) The People's Assembly of the Republic (PAR), a consultative and legislative body addressing societal matters, reflecting the diversity of popular opinions within the Republic.\n\n\n2. Unity between the two assemblies is ensured by the principle of democratic centralism, guaranteeing the harmonization of decisions in the service of proletarian interests.\n\n\n**Article 2: The Federal Party Assembly**\n\n1. The FPA is composed of 650 members elected by direct and imperative suffrage within local soviets, with seats allocated proportionally to the number of workers represented by each soviet.\nElection days in soviets are declared national holidays.\n\n\n2. Candidates for the FPA must:\na) Be members of the Communist Party.\nb) Have at least seven years of work experience in a productive or service sector.\nc) Be of legal age and possess full rights and capacities as citizens.\nd) Not have previously served more than two terms in the FPA.\ne) Not exceed an age limit of 85 years.\nf) Have completed their civic service.\n\n\n3. The FPA is responsible for:\na) Centralized economic planning and strategic production orientations.\nb) Managing state departments and institutions, national security, and diplomatic affairs.\n\n\n**Article 3: The People's Assembly of the Republic**\n\n1. The PAR is composed of 600 representatives elected by direct universal suffrage through a proportional system with a representation threshold of 1%.\n\n\n2. Electoral lists may reflect diverse interests, including cultural, religious, social, or regional perspectives.\n\n\n3. Candidates for the PAR must:\na) Be of legal age and possess full rights and capacities as citizens.\nb) Not have served more than two consecutive terms in the PAR.\nc) Have completed their civic service.\nd) Be registered on an electoral list recognized by the state.\n\n\n4. The PAR is responsible for:\na) Drafting and voting on laws concerning societal matters.\nb) Proposing legislative initiatives to be submitted to a referendum if requested by 30% of its members.\n\n\n\n\n**Article 4: Relations Between the FPA and the PAR**\n\n1. Five-year economic plans and their annual adjustments, drafted by the FPA, are submitted for validation by the PAR.\n\n\n2. If a qualified majority in the PAR rejects the plan or any of its parts, it is returned to the FPA for amendment.\n\n\n3. In the event of persistent disagreement, a joint commission composed equally of FPA and PAR members is formed to develop a compromise. This commission is supervised by local elected officials, soviet-appointed representatives, and a panel of qualified experts who arbitrate discussions in the nation's and proletariat's collective interest.\n\n\n4. If a law passed by the PAR contravenes the fundamental principles of the Republic and scientific socialism, the FPA is empowered to veto it. This veto must be justified and submitted to a supervisory commission constituted similarly to the one described in paragraph 3 of this article.\n\n\n**Article 5: Budget Development and Management**\n\n1. The state budget is the primary tool for implementing the objectives set by the five-year plan and the laws adopted by the PAR. It ensures resource allocation aligned with the priorities defined by soviets, the PAR, and the FPA.\n\n\n2. Budget Drafting Process:\na) The FPA drafts an annual budget proposal in alignment with five-year plan objectives, consulting local soviets and representative unions.\nb) The budget proposal is submitted to the PAR, which examines its conformity with social, environmental, and cultural priorities and the laws it has passed.\nc) If the PAR rejects any part of the budget by a qualified majority, the FPA must revise its proposal within thirty days.\n\n\n3. Adoption and Implementation:\na) The annual budget is adopted upon joint approval by the PAR and the FPA.\nb) Once adopted, it is executed by the state under the supervision of the FPA and local soviets, ensuring proper use and adherence to strategic orientations.\n\n\n4. Strategic Reserve: A portion of the national budget is allocated to a strategic reserve for emergencies or unforeseen needs, as defined by procedures set by the FPA and the PAR.\n\n\n5. Soviet Participation: Local soviets actively participate in budget development and monitoring by submitting their proposals and observations to the central organs.\n\n\n**Title II: Mechanisms of Popular Democracy**\n\n**Article 5: Participation of the Masses**\n\n1. Any bill or program rejected by a simple majority in the PAR can be submitted to a national referendum if requested by 30% of its members.\n\n\n2. Local soviets are required to organize regular assemblies to consult workers on major national decisions.\n\n\n3. If a petition initiated by the people gathers signatures from 5% of the electorate, it will be considered as a draft bill by the PAR.\n\n\n**Article 6: Popular Oversight and Transparency**\n\n1. Members of the FPA and the PAR can be recalled at any time:\n\nFor the FPA, by a vote from local soviets.\n\nFor the PAR, through a petition signed by 5% of the electorate, followed by an absolute majority vote in a national referendum.\n\n\n\n2. The debates and decisions of the FPA and PAR are made public, except in matters of national security.\n\n\n3. Budget Oversight:\na) The implementation of the budget is subject to a semi-annual evaluation, with results published to ensure transparency of public finances.\nb) Any misuse of public funds contrary to the objectives of the five-year plan or the Constitution is subject to administrative and judicial sanctions.\n\n\n**Title III: Fundamental Principles of Socialism**\n\n**Article 7: Centrality of the Working Class**\n\n1. The Communist Party, the vanguard of the proletariat, leads the Republic in accordance with the principle of proletarian dictatorship.\n\n\n2. The interests of workers take precedence over all other considerations, and no institution may act contrary to these interests.\n\n\n**Article 8: Revolutionary Unity and Discipline**\n\n1. Democratic centralism ensures the subordination of minorities to majority decisions and unity in revolutionary action.\n\n\n2. Any deviation by officials, party members, or citizens vested with a state mandate from the principles democratically adopted within the FPA is punishable under the law, within the framework of a fair and just trial.\n\n\n3. These restrictions are suspended during parliamentary debates on the drafting and revision of the five-year plan within the FPA, as well as within soviets during delegate elections.\n\n\n\n\n**Title IV: Special Provisions**\n\n**Article 9: Constitutional Amendments**\n\n1. This Constitution can only be amended with the approval of two-thirds of the FPA and PAR members meeting in a joint session, followed by a popular referendum.\n\n\n**Article 10: Entry into Force**\n\n1. This Constitution enters into force immediately after its adoption by national referendum and its ratification by the Central Committee of the Communist Party.\n\n\n\n**Title V: Citizen Rights and Fundamental Principles of the Republic**\n\n**Article 11: Rights and Duties of Citizens**\n\n1. Every citizen of the Socialist Federal Republic enjoys political, economic, social, and cultural rights guaranteed by the state. These rights uphold the fundamental principles of the Republic: \"Liberty, Equality, Fraternity, Justice.\" These rights are inalienable and exercised in the interest of the community and progress.\n\n\n2. Citizens have the right:\na) To participate directly or indirectly, through their soviets, in the management of political and economic affairs.\nb) To remunerated employment ensuring a dignified life and personal fulfillment.\nc) To free, comprehensive, and high-quality education.\nd) To universal and free healthcare.\ne) To decent housing suited to their needs, provided or subsidized by the state.\nf) To freedom of expression and association, within the framework of respecting socialist principles and combating bourgeois and reactionary ideologies.\n\n\n3. Citizens have the duty:\na) To contribute, through their work, to collective prosperity.\nb) To defend the Republic against any attempt at capitalist restoration.\nc) To promote values of equality, solidarity, and social justice.\n\n\n**Article 12: Equality of Citizens**\n\n1. All citizens are equal before the law, regardless of gender, national or ethnic origin, sexual orientation, religious affiliation, or philosophical convictions, whether actual or perceived.\n\n\n2. The Republic is committed to eradicating all forms of discrimination and oppression inherited from the bourgeois order.\n\n\n**Article 13: Freedoms and Democratic Guarantees**\n\n1. Freedom of thought and debate is guaranteed to all citizens, within the limits of respecting the principles outlined in the Constitution.\n\n\n2. No citizen may be arrested, detained, or deprived of their rights without a justified decision by competent authorities, in accordance with legal procedures.\n\n\n3. Every citizen accused of a crime or offense has the right to a fair, public, and prompt trial.\n\n\n**Article 14: Protection of Collective Rights**\n\n1. The Republic recognizes the rights of cultural, religious, and regional communities to preserve their traditions, provided they do not contradict the goals of socialist construction or maintain oppressive social structures.\n\n\n2. National and ethnic minorities are represented in the PAR and consulted on decisions directly affecting them.\n\n\n**Article 15: Economic Rights**\n\n1. Private ownership of the means of production is abolished, and citizens collectively enjoy the fruits of their labor through socialist ownership and economic planning.\n\n\n2. The state guarantees a minimum income, periodically adjusted, sufficient to cover essential needs and individual development.\n\n\n3. Every citizen has the right to free access to cultural, scientific, and artistic resources, considered a collective heritage. Access is ensured through six weeks of paid leave annually, an eight-hour workday, and two weekly rest days.\n\n\n**Article 16: Secularism and Religion**\n\n1. The Republic is secular and guarantees freedom of conscience.\n\n\n2. Any form of religious propaganda or practice aimed at undermining the foundations of socialism or alienating rights and freedoms to a group or individual is prohibited.\n\n\n3. Education and public services are religiously neutral. The state promotes the dissemination of materialist and scientific ideas in opposition to religious obscurantism.\n\n\n4. The state fosters harmony among religions and respect for spiritual differences.\n\n\n**Article 17: Workers' Rights**\n\n1. Workers have the right to organize and lead local soviets, the foundational organs of proletarian democracy.\n\n\n2. Union rights are guaranteed. Unions have a duty to actively participate in workers' emancipation and socialist construction.\n\n\n3. The workday is limited to eight hours, with progressive reduction based on productivity gains and technological advances.\n\n\n4. Salaries, dignified working conditions, and daily enterprise management are collaboratively organized by soviets and unions.\n\n\n**Article 18: Defense of the Republic**\n\n1. Defending the Republic is a sacred duty for every citizen.\n\n\n2. Universal and mandatory civic service, focused on technical, military, and political training, ensures the people's capacity to defend the revolution. Every adult citizen must complete this service before their 25th birthday.\n\n\n**Article 19: Environmental Protection**\n\n1. The Socialist Federal Republic recognizes the necessity of harmonious development between humanity and nature.\n\n\n2. Economic planning incorporates objectives for preserving ecosystems and addressing environmental destruction inherited from capitalism.\n\n\n**Title VI: Commitments of the Republic**\n\n**Article 20: Unity and International Solidarity**\n\n1. The Socialist Federal Republic acts in solidarity with all peoples fighting imperialism, colonialism, and capitalism.\n\n\n2. It is committed to actively supporting revolutionary movements worldwide, respecting the right of peoples to self-determination.\n\n\n**Article 21: Social Justice**\n\n1. The Republic works to eliminate all forms of social and economic inequality through a fair and equitable redistribution of resources.\n\n\n2. Any concentration of power or wealth contrary to the general interest is deemed an attack on socialism and sanctioned by law.\n\n\n**Article 22: Scientific and Cultural Orientation**\n\n1. The Republic promotes a scientific, artistic, and educational culture accessible to all, aimed at raising the socialist consciousness of the masses.\n\n\n2. Materialist and critical education is a fundamental duty of the state and its institutions. Education aims to eradicate prejudice, obscurantism, superstition, and reactionary ideologies.\n\n\n\n\n(Note that i'm not 100% fluent in english so I used chatGPT to help me translate parts of the original text. If you find any grammar mistakes or sentences that could have been formulated better, please let me know.)\n\n\n\n",
    "comments": [
        {
            "author": "SvitlanaLeo",
            "body": "I am against the Communist Party possessing constitutional power. The party must regularly and consistently be obligated and be able to convince citizens that it is its representatives who must have power. We do not need a party in power that does not possess dialectic. And it was a serious mistake in 1936 in the USSR to adopt the Constitution with the granting of powers to the party as the leading core of workers' organizations.",
            "score": 10,
            "replies": [
                {
                    "author": "lezbthrowaway",
                    "body": "Hm. This is a similar theory to the cultural revolution, and quantitative internal revolutions to achieve communism and prevent alienation. But, even so, Mao supported constitutions (?).Wdyt about Mao's theories here?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -64,
            "replies": []
        }
    ]
}