{
    "title": "Help finding a Marxist reader that’ll give me an intro",
    "author": "philosophyofpoverty",
    "subreddit": "Marxism",
    "rank": 144,
    "score": 13,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 37,
    "url": "https://www.reddit.com/r/Marxism/comments/1i28hp9/help_finding_a_marxist_reader_thatll_give_me_an/",
    "id": "1i28hp9",
    "selftext": "So im looking for a book that gives a primer on Marxist ideas, either only from Marx or from other thinkers as well. Im looking for something easy to read but that will still give me a strong understanding of the basics. \n\nI'm curious to see if the notion of the reserve army of labour ties in to David Graeber's ideas of bullshit jobs, so bonus points if it speaks to this.",
    "comments": [
        {
            "author": "friver86",
            "body": "I think \"Principles of Communism\" by Engels is the most concise and beginner friendly intro to Marxist ideas. Another one would be the \"Three sources and three component parts of Marxism\" by Lenin.",
            "score": 14,
            "replies": []
        },
        {
            "author": "lonelilooney",
            "body": "Given that he is one of the most important Marxist figures out there, I recommend David Harvey’s Companion to Marx’s Capital, which can be accompanied by his lectures easily accessible online. I think you’ll love it. Further down the line, you may even check out his texts on urbanisation, which opened a new eye for me. \n\nFor your other request, if I’ve correctly understood what you meant, you are looking for a ‘history of Marxist political thought’ book. I do not know a book that handles the Marxist literature in a historical manner, but I would love to check it out if anyone could recommend.",
            "score": 4,
            "replies": [
                {
                    "author": "philosophyofpoverty",
                    "body": "Thank you for the suggestions everyone! I'm gonna go with David Harvey's book because I know he's an interesting author who approaches Marxism from unique perspectives (and also because the book's available at my library).",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jw_216",
            "body": "An interesting read was “reading capital politically” by Harry Cleaver which talks about the first few chapters of Capital in a much more contemporary way (it was published in the 70s, but addresses many current issues. and argues that Capital should not be seen and used as a tool for workers to resist capital.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RassleReads",
            "body": "[Marxism-Leninism-Maoism Basic Course](https://foreignlanguages.press/wp-content/uploads/2020/08/S01-MLM-Basic-Course-Revised-Edition-10th-Printing.pdf) from Foreign Language Press is available as a free, printable PDF, and it contains the most concise and succinct primer to Marxist ideas and revolutionary history. It’s a great read, regardless of your ideological preference.",
            "score": 2,
            "replies": [
                {
                    "author": "makhnovite",
                    "body": "OP please disregard any such Stalinist nonsense as it represents a complete revision of fundamental Marxist theory in addition to being opportunist and theoretically incoherent.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "RassleReads",
                            "body": "I’m not here to throw stones and be unfair to ideologies I personally don’t agree with, especially those proven to work with active revolutionary forces putting it into practice in the modern day, but if you want to be like that, you’re more than welcome. I’m being earnest and sharing resources that helped and still help me, even if I wouldn’t necessarily consider myself a “Maoist” or anything like that.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pointlessjihad",
            "body": "There’s a book called Marx’s Kapital for Beginners by David Smith. That was the first thing I read after the manifesto and reading that got me to start reading the actual book Capital. I highly suggest it.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Techno_Femme",
            "body": "You'd definitely like Michael Heinrich's An Introduction to the Three Volumes of Marx's Capital. For more on the \"reserve army of labor\" and Marx's idea of a relative surplus population, I highly suggest Endnotes Vol. 2-3",
            "score": 1,
            "replies": [
                {
                    "author": "Gertsky63",
                    "body": "That is a very bad idea, not only because it is a contentious reading, but also because it is very far from what the OP has asked for, which is an accessible introduction to Marxist ideas as a whole.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Techno_Femme",
                            "body": "Heinrich is very accessible, you don't really need to do any reading before picking him up and he explains all the more advanced vocabulary he uses. His chapters on value are contentious but they also give a decent overview of opposing viewpoints. After someone reads Heinrich, I usually recommend Simon Clarke or Diane Elson as a followup for the contentious chapters on value\n\nI recommend Endnotes because their works cover relative surplus populations and \"reserve army of labor\" as a central point.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NikiDeaf",
            "body": "Maybe “The Meaning of Marxism” by Paul d’Amato? Not perfect by any stretch of the imagination…it’s written from a Trot perspective so take that into account of course. It’s pretty readable though and gives mostly coherent Marxist perspectives on topics like dialectics, overpopulation etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vilnius_Nastavnik",
            "body": "Introduction to Marx and Engels by Richard Schmitt is what kicked it off for me. Very basic but it'll lead you into the denser texts.\n\nIf you like Graeber and haven't yet you should also check out Utopia of Rules.",
            "score": 1,
            "replies": [
                {
                    "author": "philosophyofpoverty",
                    "body": "Haven't heard of Utopia of Rules but I looked it up and it sounds pretty good. I'll check it out when I have a chance. Lately, I've struggled with accessing basic services because of paperwork, receptionists, and ID; and I'd really like some ideas to help me process what's happening.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "interpellatedHegel",
            "body": "I would start with *\"Estranged Labour\"*, which is a part of Marx's *\"1844 Manuscripts\"*. It's short and easily digestible and will provide you with an introduction to Marx's theory of alienation and its relation to private property.",
            "score": 1,
            "replies": []
        },
        {
            "author": "makhnovite",
            "body": "ABC of communism by Bukarin is good but you really can’t go past the manifesto as an introduction to the theory.\n\nGraeber is an anti-Marxist theorist and a great example of someone whose good ideas aren’t original while their original ideas aren’t good. I think his views on work are quite Eurocentric and ahistorical.",
            "score": 1,
            "replies": [
                {
                    "author": "philosophyofpoverty",
                    "body": "Graeber isn't perfect but I can read his books and be critical of it. I watched the lecture for Bullshit Jobs when I was in high school and his ideas have been ruminating as I got my first jobs and experienced the adult world. I'm always going to see the world through this lens, even if I recognize it's flaws.\n\nRight now I'm just looking for things to read for pleasure, which might help me process my own experiences or maybe be the foundation for original ideas one day.\n\nIt seems to be that Graeber rejected Marxism for social reasons more than anything else-- the Marxist scholars he knew in real life didn't vibe with his ideas. But I think there's a lot of potential to read and expand on Bullshit Jobs through a communist perspective and I'd really like to explore that angle.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "makhnovite",
                            "body": "I'm wary of the whole premise of 'bullshit jobs', it reminds me of the communisation milieu in that I find it heavily Eurocentric, with the idea being that essentially the productive forces are so developed as to enable an immediatist approach to economic transition. A basic Marxist view is that western economies have transitioned to service jobs and gig economy type of work because manufacturing has generally been transferred to developing countries where primitive accumulation only began in the last half century or so, providing a cheap labour force of first or second generation proletarians that are still in their infancy in terms of political organisation and class consciousness. Obviously this process was a response to the militancy of the western labour movement and multiple class offensives in the 60s and 70s coinciding with the post-war economic boom hitting its limit due to the declining rate of profit.\n\nGraeber can be enjoyable to read, I liked his book on the history of debt, but its very superficial pop-culture theory and its noteworthy that he treats these specific aspects of the modern economy as representing fundamentally important new trends in the system. During the debt crisis in Greece he released his book on debt, now that gig-economy work is the big new thing thanks to Uber, and no doubt in 5 years he'll have uncovered some other profoundly new economic tendency to analyse in a similarly exaggerated manner.\n\nI just dislike this tendency to treat new ideas as inherently superior or even revolutionary (which is a distinctly petit-bourgeois outlook and therefore endemic amongst academics). The basic axioms of Marxism provide use with sufficient theoretical tools, all that's required is to apply them with sufficient skill and insight that we can actually say something useful for ourselves as scientists and as a political cause which presumes to be the vanguard of the working class cause.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zandroe_",
            "body": "In contrast to many people who have already answered, I would advise you to skip the Manifesto as anything other than a historical document. It represents one of the earliest points in Marx's development and is outdated in almost every aspect (for example, a major part of the document is a platform for the development of capitalism in Germany, something that is well and truly over by now). Instead, I would advise you to read Antiduhring for the clearest statement of the Marxist socialist/communist project, and Value, Price and Profit for a short introduction to the Marxist criticism of political economy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kayotik94",
            "body": "https://www.marxists.org/archive/kautsky/1892/erfurt/\n\nThis book is a banger. It was written in a time when millions of people were organized into socialist parties across Europe and north America. The Marxism here is highly developed and sophisticated but written in such a clear and concise way so that any working class person can understand. This is a must read for any beginner to Marxism.",
            "score": -1,
            "replies": []
        }
    ]
}