{
    "title": "Marxist perspectives on the Syrian Civil War",
    "author": "lonelilooney",
    "subreddit": "Marxism",
    "rank": 61,
    "score": 5,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Marxism/comments/1inogda/marxist_perspectives_on_the_syrian_civil_war/",
    "id": "1inogda",
    "selftext": "Hello everyone,\n\nI'm looking for sources that analyze the Middle East—especially Syria—through a Marxist lens. I’ve had a hard time finding extensive material on this, particularly regarding the **history** and **political economy** of the Syrian Civil War. I’m also interested in the socioeconomic positions of various ethnic and religious groups within Syria, such as the Kurds, Sunnis, and Shiites.\n\nAdditionally, if you know of any Marxist analyses of other Middle Eastern countries, I’d really appreciate recommendations. As a Political Science major, I’ve found that my department doesn’t provide much depth in international relations, so I’m hoping to supplement my studies with solid material.\n\nThanks in advance!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "dowcet",
            "body": "A bit superficial but maybe a helpful start:\n\nhttps://mkaradjis.com/2013/09/24/syrian-revolution-class-against-class-basis-of-uprising/\n\nhttps://revsoc21.uk/2018/04/27/syria-is-not-exceptional-interview-with-joseph-daher-part-1/",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fudotoku",
            "body": "https://us.politsturm.com/communists-and-the-palestinian-question\n\nThere is a great big article from Politsturm about Palestine, where they explain that in the Middle East there is a clash between Iranian and American capital, and not a war of liberation. Here you can draw many analogies with Syria, the only thing that has been added is the Kurds, who are between two fires, they, suffering defeat after defeat, show that libertarian socialism is a dead-end direction of socialist thought, and such a government, balancing on the brink of anarchism, is unable to do enough to protect the revolution from external forces",
            "score": 3,
            "replies": []
        }
    ]
}