{
    "title": "Thoughts on curtis yarvin, the dark enlightenment, and the role of Marxists in the current struggle against techbro fascism.",
    "author": "cl0ak002",
    "subreddit": "Marxism",
    "rank": 0,
    "score": 13,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/Marxism/comments/1j4a7q1/thoughts_on_curtis_yarvin_the_dark_enlightenment/",
    "id": "1j4a7q1",
    "selftext": "Hi. It's your boy again. Asking questions to annoy and delight.\n\nThe heading kinda covers my entire question.  \n\nIs there a consensus that what yarvin has outlined in the butterfly revolution is what is happening (musk seems to be on stage 3 of the blueprint) and if so can Marxists make common cause with liberals and even conservatives to prevent it? Understanding that Marxists, the left et al is not a monolith...is preventing techbro feudalism a priority and should it be?\n\nFeel free to drag me as I can't reply anyway. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sirhanduran",
            "body": "I don't see the point in exploring the mixture of bad thinking & fairy tales of a fascist as if they're serious predictions in any way, or even a coherent philosophy. We don't need \"Yarvin's Dark Enlightenment\" to understand what fascism is or how it works. To some extent we might analyze how \"tech bro conservatives\" have a specific kind of influence and a specific flavor of fascism, but these are new details of an old story repeating itself.\n\nDon't take the writings of alt right fantasists seriously. They are never honest even to themselves, let alone to their readers - and occasionally they even admit it, since the goal is to build up anger & consolidate power by any means, especially lies & mythmaking.",
            "score": 10,
            "replies": []
        },
        {
            "author": "dowcet",
            "body": "Understand their ideas in order to more clearly and directly express our strongest counternarratives. Don't mention them by name as it only gives them more exposure.\n\n\nTo put it very simply we need to constantly repeat and explain why billionaires, all billionaires, are the enemy.",
            "score": 6,
            "replies": [
                {
                    "author": "sirhanduran",
                    "body": "Counternarratives should take place at the root, not at the branches. I agree with your last sentence the most. Capitalism itself is the enemy, and fascism is merely the armed & angry attempt to prevent inevitable revolution by the working classes when liberalism fails to do so. It has no intellectual grounding (though they like to cloak themselves with the *aesthetics* of intellectualism), and not a single argument is made in good faith or consistently.\n\nLooking up Yarvin on wikipedia I was amused to find him saying he was \"not a white nationalist, but not allergic to it either obviously,\" and he \"did not say African Americans should be slaves, but that certain races are more fit for slavery.\" This is not someone to take seriously or argue on *his own terms.*",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheTempleoftheKing",
            "body": "They are seethingly jealous of all the horrible things people say about communism. The Mao inside their heads actually did all the amoral accelerationist world transforming stuff they think their Nietzsche's super man SHOULD do. And it makes them seethe because it turns out communism actually makes things happen in the world while conservatives stay in their bedrooms and write. So, they fetishes the technological and social transformations as ends in themselves, as fascists typically do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aloe-on-my-desk",
            "body": "It certainly needs to be a priority. This shit has kept me up for months and I'm taking every chance to talk about it more with anyone who will listen. This is incredibly scary shit, and luckily, they've been open about talking about their plans. Libs and many conservatives are already mad at Musk. We can show them these plans, and the right loves a good conspiracy already. The things they have planned sound insane to virtually everyone. This could be a good way to unite a wider section of the working class. I think the following videos are fantastic for both a faster explanation in the first video, and a longer, more in depth explanation in the following two vids. \n\n[Dark Gothic MAGA ](https://youtu.be/5RpPTRcz1no?si=Ij06l4pGYY8x27Ju)\n\n[Behind the Bastards Yarvin Part 1](https://youtu.be/mYrPNvVhKLU?si=_Dmus7HlAHa9JhsF)\n\n[Behind the Bastards Yarvin Part 2](https://youtu.be/rpEg4LS3CT0?si=zyYJ50uZtOxSNpus)",
            "score": 1,
            "replies": []
        }
    ]
}