{
    "title": "BYD unveils battery system that charges EVs in five minutes",
    "author": "assman69x",
    "subreddit": "technology",
    "rank": 10,
    "score": 2656,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 531,
    "url": "https://fortune.com/2025/03/17/byd-battery-system-charging-5-minutes-tesla-superchargers/",
    "id": "1je0gtm",
    "selftext": "",
    "comments": [
        {
            "author": "deefjuh",
            "body": "Somehow I picture the next step will be a giant super capacitor charging a car: hook up, please stand 10 meters away, KABLAAAAM, charged, GTFO.",
            "score": 922,
            "replies": [
                {
                    "author": "Zeratas",
                    "body": "[plugging it in](https://c.tenor.com/vHInbH_S9-cAAAAC/tenor.gif)",
                    "score": 169,
                    "replies": [
                        {
                            "author": "attemptedmonknf",
                            "body": "I was expecting doc brown",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "InteractionNo9566",
                            "body": "https://tenor.com/view/krieger-archer-fate-ultimate-gif-14561527",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Spiracle",
                    "body": "You joke, but this is already being worked on for next-gen EVs (Google 'ultra-capacitor EV') and I think that you can already buy e-bikes that use caps.\n\n\nYou have to remember that the current generation of electric cars are at the same stage of development that mobile phones were in the 80s - they're big and heavy and trying to impersonate the thing that they will ultimately replace. The iPhone of cars will eventually arrive. \n\n\n(and if I knew exactly what that was I'd be rich rather than sitting here wasting time on Reddit). ",
                    "score": 129,
                    "replies": [
                        {
                            "author": "imc225",
                            "body": "My understanding is the capacitors work great except that they leak fairly fast, like 20% per day. Are the engineers making headway on the leakage part? Thank you",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Deto",
                                    "body": "This could still work fairly well for public charging stations though if you're using it to do the charging (not inside the car).  Have a capacitor bank that is just held at the ready and re-charged in-between cars.  Maybe they could do somethign in a car if they have a capacitor system that can gradually store power to a battery?  That way you could charge quickly and leave but then mitigate the leakage issue",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "TechRepSir",
                                            "body": "They already have battery banks installed near some superchargers. A capacitor bank would be more useful on the vehicle side to increase charge rate. \n\nI = CdV/dt\n\nUsing a large voltage with large capacitors would be insane. Unfortunately such capacitors take up a lot of space, but with improvements in ultra capacitors (probably using Metal Oxide Frameworks) you could have charging in seconds.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "imc225",
                                                    "body": "This is sort of where I was headed, I meant capacitors on the car side, leaking there, assuming that a fixed station could address delivery. I'd forgotten about the density/volume part. At any rate thanks to all of you.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Infamous_Wave_1522",
                                    "body": "Engineer here. Sorry, I am not working on that at the moment.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "imc225",
                                            "body": "That would explain it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MaybeTheDoctor",
                                    "body": "The leakage is also a problem for hydrogen fuel.  Hydrogen atoms are about the same size as the gaps between the atoms in the steel tank holding it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Black_Moons",
                            "body": ">and I think that you can already buy e-bikes that use caps.\n\nIv seen one for sale, but given its range would be under 10km.. I don't see the point outside of regenerative braking.\n\nThe best supercaps have less then 1/10th the capacity in KWH of the worst lithium-ion per KG.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ChocolateBunny",
                            "body": "I saw an article on the e-bike recently.  [https://www.euronews.com/next/2023/12/05/this-french-company-has-designed-the-first-e-bike-that-doesnt-need-a-battery](https://www.euronews.com/next/2023/12/05/this-french-company-has-designed-the-first-e-bike-that-doesnt-need-a-battery)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ShinyAnkleBalls",
                    "body": "Arcflash and all",
                    "score": 55,
                    "replies": [
                        {
                            "author": "mcbergstedt",
                            "body": "Imagine it in the rain. Try to charge your car and fry the whole block",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "snoogins355",
                                    "body": "Pull into a hanger",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Iceykitsune3",
                                    "body": "Gas stations have been covered for decades, it's a solved problem.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wise-Activity1312",
                            "body": "Because technology to ramp up charging rates isn't dead fucking simple. 🤡🤡👌",
                            "score": -14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "xondk",
                    "body": "TBF, I'm fairly sure if you heard such an explosion and felt the shockwave, I can think of a certain segment of people that would be thrilled to buy such cars.\n\n  \nI mean if it went similar to this...[Firing the Lorentz Plasma Cannon](https://www.youtube.com/watch?v=lix-vr_AF38)",
                    "score": 18,
                    "replies": [
                        {
                            "author": "starbugone",
                            "body": "'Now you might be wondering, why would anyone build such a thing'",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "odaeyss",
                                    "body": "No. Not once. Never. The only wonder is what we can do with it now that it's built!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MaybeTheDoctor",
                                            "body": "\"It looks like doubling the energy had an effect\"",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UnfinishedProjects",
                    "body": "I've always had the idea of interchangable batteries, if all the cars had a standardized system. They could drive up to the charging station. A robot removes their current battery bank, and puts it somewhere to charge, then installs a fresh battery, and off you go in a minute.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Redararis",
                            "body": "there is a chinese company which does exactly that.",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "Fritja",
                                    "body": "Now that is elegant.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "RoboLoftie",
                                    "body": "Nio.  I'm fairly sure they've let other use it too.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "skccsk",
                            "body": "Tesla briefly pretended it was doing that years ago as one of its stock price juicers.\n\nhttps://www.teslarati.com/tesla-shuts-down-battery-swap-program-for-superchargers/",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "UnfinishedProjects",
                                    "body": "That's hilarious and I'm not surprised lol",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Schmeckitup",
                                    "body": "It’ll happen in a year! Really! 😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "soyeahiknow",
                            "body": "Byd already does this lol look it up on youtube",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "UnfinishedProjects",
                                    "body": "Damn they retroactively stole my billion dollar idea!!",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "GrossenCharakter",
                                            "body": "They didn't steal.. you were just outByd",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "thelangosta",
                            "body": "In the US we would never do that even though it would be cool. I can imagine three different batteries for differently sized vehicles. That would require government mandates or an industry wide consortium. See my first sentence…",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "jpiro",
                                    "body": "See Dewalt vs. Milwaukee vs. Ryobi vs. Makita vs. Etc...\n\nThe battery \"system\" is designed to lock you into proprietary tech. Hell, Apple just had to essentially be forced to adopt USB-C because Europe finally stood its ground. America is fucking awful at putting consumers ahead of capitalists.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "El_Grande_El",
                                            "body": "Of course it is. It’s wholly owned by capitalists.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ultradip",
                                            "body": "To add insult to injury, it's USB 2 in a USB C form factor. So your data transfers are slow USB 2.1 speed.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mdp300",
                            "body": "That's a cool idea, but it would require every company to standardize their batteries.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "UnfinishedProjects",
                                    "body": "That's supposed to be what the government is for. Standardization would be great for the consumer, it would mean cheaper batteries that are earlier to replace.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "ryencool",
                                            "body": "But how would the rich people that own everything get those profits that increase year, over year, over year, over year, over year, over year...\n\nYou get where I'm going.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "UnfinishedProjects",
                                                    "body": "That's supposed to be what the government prevents. Lol.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Unable_Pause_5581",
                                    "body": "If you standardized rough size and shape along with voltage, power delivery and connection you could realize, at least for say urban vehicles, the same system you have for propane….slide on over to the 7-11, swap out your battery for a fresh one and off you go…old battery gets plugged in and recharged…",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "tricolorhound",
                                            "body": "Hold on while I look for my lightning cable that we still need in the US for stupid reasons.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MaybeTheDoctor",
                                    "body": "Well, we already have AA batteries.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bilyl",
                            "body": "The problem is that in the US the range you expect to get from a battery exchange requires a prohibitively large battery size.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "AtomWorker",
                            "body": "There's a Taiwanese EV scooter company that's offered swappable batteries for quite a few years. Ride up to an automated kiosk and swap your dead battery for a freshly charged one. They're called Gogoro and claim to have the largest such network in the world with 12,000 stations and several scooter makers having adopted their standard.\n\nOf course, that works when the battery only weighs 20lbs and doesn't underpin the entire chassis of the vehicle. I know that some Chinese companies have demoed similar concepts for passenger cars but I don't think that's practical when you're talking about a 600lbs pack. It's not for nothing that Chinese companies continue focusing on fast charging instead.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "West-Abalone-171",
                            "body": "It works well for small batteries.\n\nNIO did it for cars (and there have been truck systems for even longer). It never really took off and is now obselete as it takes 5-10 minutes, but someone has to stay in the car.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "RockDoveEnthusiast",
                                    "body": "Maybe not in the US, but in most countries, most people would probably say that the size of the battery / the range only matters up to a point if charging is ubiquitous and quick.    \n\nAgain, I understand that Americans need 1700 miles of range for some reason (slight exaggeration), but I'd be fine stopping every 150 miles to swap out the battery for 5 minutes and take a piss.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "West-Abalone-171",
                                            "body": "Small in this instance is \"can be lifted by most people with one arm\".\n\nLook up gogoro for an example.\n\nThey're used for 2 and 3 wheeler vehicles and some low speed 4 wheelers (sometimes 2-4 batteries in a vehicle).\n\nTypical range is under 100km (up to 200) with top speeds typically 80km/h (sometimes over 100 for 2 wheelers).\n\nOne battery is about 3-4kWh or 10-15% of the entry level version of a small city car like the BYD seagull.\n\nAs soon as you need a machine to swap it, charging starts to look favourable from a cost and convenience standpoint.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "RockDoveEnthusiast",
                                                    "body": "ah, makes sense. thanks!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Metalsand",
                                            "body": "> Again, I understand that Americans need 1700 miles of range for some reason (slight exaggeration), but I'd be fine stopping every 150 miles to swap out the battery for 5 minutes and take a piss.\n\nFor you, that 150 miles was the biggest road trip of your life.  But for me, it was a Tuesday.  I have to travel that distance once a week for work, lol.  (round trip)\n\nMy car has 350 mile range but I still have to fill it up with fuel once a week.  I can drive for 9 hours and not leave my state - and I live in Michigan, not a particularly large state.  People who don't live in the US always underestimate just how spread out most of the country is.  There are some parts of the country that you have to be mindful of refueling because of how spread out the gas stations are.  The only situation I would accept a car under 300mi range would be if I had a second car I could drive as a backup.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "WazWaz",
                                    "body": "It works even better for huge batteries. Check out Janus Electric Trucks: https://www.januselectric.com.au/\n\nAs seen on the Fully Charged show.\n\nI'm pretty sure the Nio system is still expanding. I also thought the car entered and did the swap autonomously.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "West-Abalone-171",
                                            "body": "It's mostly autonomous, but for whatever reason is driver supervised.\n\nJanus is really cool. China did similar some time ago, there are also some teething issues over the long term with wear and contact resistance.\n\nThe main issue is swapping stations are much more expensive than chargers and you have to standardise a small set of capacities and form factors. You also can't weight save by using battery casings or even the cells themselve for structure like BYD does.\n\nTechnically it might be better, but it's not a straight win. The coordination issue has prevented it from taking off. Now that trucks can do a full 11 hour day with only charging during mandatory breaks the ship has probably sailed.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WazWaz",
                                                    "body": "I agree it seems like a kludge for passenger cars, but I think for trucks it makes complete sense - they spend huge amounts of time on the road (often with multiple drivers), swapping batteries is *faster* than filling with diesel, and their destinations *always* have forklifts to do the swapping (and often the driver is forklift certified).",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "West-Abalone-171",
                                                            "body": "Again. Current models like the 750kWh iveco have no payload penalty vs. ICE and can do a full day of driving only charging during mandatory breaks.\n\nOnce MCS or other kV systems roll out you're talking about 80 minutes of charging over 24 hours even if you are somehow doing highway speed all day and start at midnight with an empty battery.\n\nIt's a non-problem.\n\nForklifts are also not precise enough. This was the aforementioned teething issues. If you're swapping 2-3x a day, then your battery will get beaten up far too quickly. This is what killed the scheme in china. It caused too many battery failures and fires.\n\nA fully automated system with an overhead crane can do it, but you need every truck stop to have a multi million dollar swapping station and at least two of each battery size. Then you need maintenance staff, and you need to regularly bring in batteries from elsewhere. All this on top of the charging hardware (which either needs to be as capable as the non swapping version or you need more buffer batteries).\n\nIt also has a huge impact on the design of the truck, which is much more important.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Queso_I_Farted",
                            "body": "Same here. It always seemed most logical. Most things use standardized batteries, why should EVs be any different.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "h0ser81",
                            "body": "There were concepts of this dating back to the early 1900s.\nhttps://youtube.com/shorts/x6-f2ROpANI?si=Eh_1-_l2Jj2sE0y1",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Xile350",
                            "body": "The problem I’ve always had with this idea is since battery health can be pretty variable it would suck if you swapped your battery out that was like 98% healthy and got someone’s beat up 70% health battery for instance.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "UnfinishedProjects",
                                    "body": "I'm sure they could have a system built in to the battery to monitor the battery health and give potential discounts or something. Or it could just be a monthly fee and you swap as many times as you need.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gonzo_gat0r",
                            "body": "I wish there were a happy medium, where there was an extra slot in the trunk for a mini battery that could give you 10 miles of range to the nearest charger.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Bullumai",
                            "body": "Taiwanese have been doing exactly what you're saying for many years now. For scooters \n\nChina too does this for cars",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Longjumping_Work3789",
                            "body": "It seems so obvious doesn't?? \n\nMy guess is that the reason it isn't viable is to do with two things. 1. The size of the battery that is needed is too large to make this practical 2. It would require too much up front cost because the system of battery stations would need to be constructed first.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "gonzo_gat0r",
                                    "body": "There’s also a fear of getting a degraded battery. Imagine being at a remote station and they only have 1 battery that severely cuts your range.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "phillipads",
                            "body": "Better Place tried this in Isreal a decade or so ago. Burned through half a billion before failing https://www.theguardian.com/environment/2013/mar/05/better-place-wrong-electric-car-startup",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Deadman_Wonderland",
                            "body": "NIO battery swap stations already exists.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "nerdnut",
                            "body": "Some early electric cars from the 1910s did this",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Blah-Blah-Blah-2023",
                            "body": "How many AAAs would you need, I wonder ;)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheStormIsComming",
                    "body": "> Somehow I picture the next step will be a giant super capacitor charging a car: hook up, please stand 10 meters away, KABLAAAAM, charged, GTFO.\n\nIt's probably written in the terms and conditions of use that you do so at your own risk.\n\nWould be interesting to check.\n\nProbably not something I would like to be using during a lightning storm.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "DonnerPartyPicnic",
                            "body": "Modern day natural selection",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "snoogins355",
                    "body": "1.21 gigawatts!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "doommaster",
                            "body": "Mega! You won't need a nuclear power plant to charge a car.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "snoogins355",
                                    "body": "Ford already incorporated it into my F150 EV. Why they call it the Lightning! /s",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pessimistoptimist",
                    "body": "I hear you. These articles making huge claim from Chinese companies come out at least once a week. Do we ever actually see the product? If we do see it does it ever work safely as advertised? It's like Temu.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "bannedByTencent",
                    "body": "NE\\\\ext step is hydrogen fuel cells. Toyota already knows it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "disembodied_voice",
                            "body": "Hydrogen isn't the next step, it's the past.  Toyota has tried pushing hydrogen for the past decade, and even their half-hearted offering of a bZ4X managed to outsell the Mirai in half the time.  There's simply no demand for hydrogen, and we need to stop pretending it's a viable alternative to electric.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "talldean",
                    "body": "Or just forklift off the battery, forklift on a new one, and thirty seconds to a full charge.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "turb0_encapsulator",
                    "body": "this is what they have for buses.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "en-aye-ese-tee-why",
                    "body": "F Zero style would be most fun.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "uMunthu",
                    "body": "Brother made ev charging funny. Nicely done 👌",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gruesomeflowers",
                    "body": "No the next step is one of the tech giants buys the technology, and then charges a much higher premium rate to quick charge your car...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Impossible_Angle752",
                            "body": "China wouldn't let that happen and BYD doesn't need to sell of it's parts.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AUkion1000",
                    "body": "I'm just waiting for something like a solar wrapped car thsts always ready to move.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "West-Abalone-171",
                            "body": "Aptera is the closest.\n\nThere have been a few more car shaped ones, but the idea is cursed and horrible seemingly unrelated (and not even suspicious/foul play type things) things always seem to happen to the companies and CEOs",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "G0trenx",
            "body": "Meanwhile in USA: WE GOING TO START USING COAL AGAIN!!!! 🥴",
            "score": 648,
            "replies": [
                {
                    "author": "WolfyTn615",
                    "body": "A coal powered car sounds interesting 🤔 day one buy",
                    "score": 69,
                    "replies": [
                        {
                            "author": "crashcarr",
                            "body": "Every car comes with a family sized iron lung",
                            "score": 56,
                            "replies": []
                        },
                        {
                            "author": "rounding_error",
                            "body": "[Looks kind of fun to drive.](https://www.youtube.com/watch?v=7CpY850MYx4)",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "UGMadness",
                            "body": "https://www.rfa.org/english/news/korea/charcoal-powered-vehicles-make-a-comeback-in-north-korea-12092016160533.html\n\nThis is the future conservatives want 🥴",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "WolfyTn615",
                                    "body": "O_O I was just kidding.. TIL this is and was a real thing",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "urghey69420",
                                    "body": "Hell North Korea has wood powered cars. Very based and cool\n\nHail Trump. Hail Musk.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Successful_Guess3246",
                            "body": "I have an mechanical engineers book from the 40s with instructions on how to test coal samples. I'll post the pages later on today",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Duster929",
                    "body": "The US car industry is doomed. These tariffs meant to protect them will only cause them to fall another generation behind their competition. I see the Trump tariffs as the death knell for the US car industry. It's over for them.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Nuzzleface",
                            "body": "Except when he bails out Tessler. The goal is to make them the only choice 🤮",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ghune",
                    "body": "To be fair, it's not just any coal, it's beautiful clean coal.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "0erlikon",
                    "body": "Fire up the traction engine boys",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "PolarWater",
                    "body": "Hey, hey, stop conducting research. That's WOKE and GEI",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SoftEquivalent2581",
                    "body": "Tesla new models don't require charging. They only need some grass 🫏",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TinKnight1",
                    "body": "Steam power or you're a pinko commie liberal fascist monarch!\n\n/s",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mrdarknezz1",
                    "body": "I mean China is doing that as well?\nEdit: not sure why anyone would downvote this since it’s common knowledge \n”Coal-fired power plants accounted for about 58.7% of China’s total electricity generation during the first ten months of 2024.”  https://www.powermag.com/coal-continues-to-lead-chinas-record-levels-of-power-generation/",
                    "score": -11,
                    "replies": [
                        {
                            "author": "AsterKando",
                            "body": "They’re replacing older and more inefficient plants, handling peak demand, and using it as a backstop while more renewable energy is installed. Unlike the US, China doesn’t have easy access to natural gas and has an increase in absolute energy demand. China’s coal use has already/is currently peaking. ",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "mrdarknezz1",
                                    "body": "Please don’t greenwash climate villains, the fossil lobby does that perfectly well themselves \n\nChina is not doing anything close to that, they currently have planned to add 315 GW coal while they phased out 9 GW coal. Adding renewables won’t offset the catastrophic damage from coal. Coal needs to be not used in the first place",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "linwelinax",
                                            "body": "They have to use coal as the baseload energy because they don't really have access to cheap natural gas like in the US. While they keep installing more and more renewables (and nuclear) every year (they've installed more renewable energy than all other countries combined last year). They simply can't \"just stop\" using coal, they do not have enough energy. Also as the previous poster said, a lot of the more recently built coal is used as backup when the energy provided by renewables is lower (for example they had droughts in 2023 which means they had less hydro power available so they had to make up the difference using coal).\n\nOn average, coal as a percentage of their total energy mix has been steadily declining over the last few years. It was around 75% in 2016 and it's now close to 50% with a downwards trend",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "NancyPelosisRedCoat",
                                            "body": "In 2024 alone they added [277 GW of solar and 79 GW of wind capacity.](https://www.spglobal.com/commodity-insights/en/news-research/latest-news/012425-infographic-china-solar-capacity-coal-electricity-renewable-energy-hydro-wind) Sure, they have coal plants, but they are also the lead solar panel producer, aren’t they?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "mrdarknezz1",
                                                    "body": "Adding renewables doesn’t make up for adding coal",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "NancyPelosisRedCoat",
                                                            "body": "They’re producing [80% of the solar panels in the whole world](https://www.reuters.com/business/energy/china-solar-industry-faces-shakeout-rock-bottom-prices-persist-2024-04-03/) or “practically all of the world’s equipment for producing solar panels” [according to NYT](https://www.nytimes.com/2024/03/07/business/china-solar-energy-exports.html), but it doesn’t offset the coal power plants they are planning to add? Sure.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "mrdarknezz1",
                                                                    "body": "No it does not",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "NancyPelosisRedCoat",
                                                                            "body": "Sorry, but this is one of the rare positive things about China. Their solar power production surpassed the world’s demand. Without their production, we would have a lot less renewable power at a much higher price. Solar power needed this boost.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mrdarknezz1",
                                                                                    "body": "It’s not a net positive to produce cheap solar using coal and slave labor",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "ImReverse_Giraffe",
                                                            "body": "Neither does having rolling blackouts because you can't meet energy demands.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "mrdarknezz1",
                                                                    "body": "Then you should not expand your industry based on coal expansion",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AsterKando",
                                            "body": "If all you care about is absolute figures, sure I guess? \n\nBut in this case, especially juxtaposed with the US, China is far from a ‘villain’. There’s an increase in absolutely demand and the country is projected to hit peak coal usage this year. China has objectively done well and continues to install the most renewable capacity and leads the industry. That’s not bad considering it produces half the world’s stuff. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "mrdarknezz1",
                                                    "body": "This is just straight up greenwashing",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AsterKando",
                                                            "body": "At this point you’re trolling lol",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "mrdarknezz1",
                                                                    "body": "You are literally trying to excuse massive coal expansion",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Darnocpdx",
                            "body": "There using less oil/gas, and have been making double digit gains in renewables as well.  Doing what most the rest of the world is also doing.\n\nIt's a transitional period worldwide. You can't just snap your fingers or wiggle your nose and blink and make stuff happen.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Seemoris",
                    "body": "Not defending the US here by any means, cause we shouldn’t be using coal lol. But China has been using coal for a long time and still are. \n\nhttps://climatefactchecks.org/china-and-its-massive-coal-consumption-fact-check/",
                    "score": -5,
                    "replies": []
                },
                {
                    "author": "idoitforhiphop",
                    "body": "~60% of China’s electricity production comes from coal.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "alleks88",
            "body": "I wonder how much heat is generated and how fast the batterie will degrade",
            "score": 298,
            "replies": [
                {
                    "author": "JesusIsMyLord666",
                    "body": "Usually this is achieved using higher voltage, which generates less heat overall.",
                    "score": 187,
                    "replies": [
                        {
                            "author": "greywar777",
                            "body": "yeah the article mentions that part of what makes this doable is the 1,500V charging system.",
                            "score": 128,
                            "replies": [
                                {
                                    "author": "ElkSad9855",
                                    "body": "Well, any resistance/shielding failures and anyone within a few feet of that charger is getting electrocuted.",
                                    "score": -94,
                                    "replies": [
                                        {
                                            "author": "dettrick",
                                            "body": "Na not really. You walk by, stand on and sit on higher voltages everyday and wouldn’t even notice.",
                                            "score": 98,
                                            "replies": [
                                                {
                                                    "author": "ElkSad9855",
                                                    "body": "I’m very well aware. This isn’t a transformer with 3 layers of shielding, preventing us from being anywhere near the voltage. \n\nIt’s a battery charger with movable and usable parts, with repetitive use. Wear and tear is inevitable and therefore so is shielding failure/deterioration.",
                                                    "score": -58,
                                                    "replies": [
                                                        {
                                                            "author": "spikejonze14",
                                                            "body": "And internal combustion engines are chambers of moving parts rapidly igniting explosions thousands of times a minute. Lots of our technology has risks, thats why we have engineering to minimize them.",
                                                            "score": 91,
                                                            "replies": [
                                                                {
                                                                    "author": "Iceykitsune3",
                                                                    "body": "But a gas pump springing a leak isn't fatal for the average person.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "ElkSad9855",
                                                                    "body": "Brother. The comparison is not the same, and it is clear you can’t recognize that. Lol I am speaking from an engineering point of view. Voltages that high are insane. If the conductors providing the 1500v to the car has ANY sort of failure such as puncture or insulation being stripped, instant death to anyone near or around that car. 1500V won’t jump any noticeable difference, but touch your car, the charger, the conductor - you are fried. And the people downvoting me simply don’t understand how electricity works. I am not saying this is a bad tech nor am I saying it doesn’t work. I am saying that the resistances required to contain 1500v to get 1MW is crazy high - you would need 700 amps of current to reach that power. The higher the voltages, the higher the risks. 600V will still kill you but it’s much easier to contain 600V over 1500V. \n\nMath ain’t that hard.",
                                                                    "score": -57,
                                                                    "replies": [
                                                                        {
                                                                            "author": "dettrick",
                                                                            "body": "Look dude, I’m an electrical engineer and 1500V isn’t that high of a voltage to be concerned about like you’re suggesting. Regular domestic 110/240V AC is already insulated up to 1000V, insulating 1500V is only marginally thicker. The same insulation and air gaps that protect you from being electrocuted in your home when you use your toaster and fridge apply to the car with only a few extra mm of insulation and an extra inch of air gap.",
                                                                            "score": 26,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ElkSad9855",
                                                                                    "body": "Look dude, if you were an electrical engineer you would know that we aren’t talking about 120V home service pushing 150amps. Regular domestic service is rated to 600v for THHN insulation. If we’re talking about the feeders, then we’re using MV cable rates for 1kv or higher. \n\nWhat is the point of your statement? We are talking about a handheld, flexible, highly maneuvered by human beings in any which way, hopefully properly insulated conductor capable of pushing 600+ amps at 1000+ volts. Not a #2/0 aluminum feeder…. We are potentially talking about a 1000 kcmil beefcake of an extension cord. These things should not be handled by the general populace.",
                                                                                    "score": -9,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "dettrick",
                                                                                            "body": "Because I’m an electrical engineer I understand that amps are irrelevant when it comes to insulation, it’s the voltage that matters. \n\nTeslas superchargers are 1000V and get used thousands of times daily around the globe. Are you hearing of mass incidents of people getting electrocuted?",
                                                                                            "score": 15,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Jewnadian",
                                                                                            "body": "EA already pushes 800V to all eGMP platform cars.  It's a solved problem. I don't know why you think you have any idea what you're talking about here.",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ElkSad9855",
                                                                                                    "body": "Because the difference between 800V pushing 150 amps and 1500V pushing 600+ amps is much different. I am not knocking the technology, it isn’t my fault you don’t have reading comprehension skills. YOU have no idea how what I am even talking about nor arguing about. Which is funny, because you’re one of the people I am talking about - your normal day consumer who doesn’t know shit about anything other than “it’s supposed to work!”",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Jewnadian",
                                                                                                            "body": "The fact that you say pushing for amps is enough for me, and actual working EE to know you're faking whatever expertise you pretend to have. That's not how any of that works. Which you would know but I'm betting your work in power as an HR assistant or program manager or some other non design career.",
                                                                                                            "score": 4,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ell-esar",
                                                                                                                    "body": "Yeah reading the thread it looks like someone that got the lingo, got the basic certification to navigate at-risk installation but has no understanding of electricity as a physics concept / engineering perspective",
                                                                                                                    "score": 4,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Jewnadian",
                                                                                                                            "body": "You nailed it, he later responded that he never claimed to be an engineer or a technical person and his job is customer facing. He knows just enough to explain to a customer why they should be paying for the required safety equipment. Which I'm not denigrating, that's important too.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "author": "ElkSad9855",
                                                                                                                            "body": "Hahaha. Seriously now? Explain to me how I don’t understand electricity, as a concept, as a practicality, as a theory? Go for it. Educate me on how I have made such a fool out of myself.",
                                                                                                                            "score": -1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "ElkSad9855",
                                                                                                                    "body": "Bahahaha. The ad hominem begins huh. Where did I say I’m an engineer pal? And I will not disclose my “authority”, even though I never once pushed said authority??? Or attempted to… But it truly doesn’t matter what I say to you, you’re an engineer. I know plenty, have many as friends and coworkers, I know how that degree makes most of you feel superior to those without. Let me ask you, do you have your PE? Do you have first hand experience dealing with power generation OR power generation design and implementation? Bet you don’t… Just because I don’t design a system doesn’t mean I can’t understand how it works, same applies to you. But let me break everything down for you so you can understand it all. \n\nWhen talking to people regarding electricity, who typically follow conventional flow, saying electricity is being PUSHED by the voltage is true enough for most people to understand. Similar to that of a water pipe and its pressure. Except once you get into resistances the water pipe analogy kind of goes out the window (larger conductor means less resistance means more current, the same isn’t true for water pressure).  \n\nDo the semantics truly matter? I think not tbh. You’re trying to call me out for something that I do know about, and it’s very easy for anyone who knows anything about electricity from an elementary engineering point of view to recognize the dangers of Human + Electricity = Potential disaster. Same applies for combustibles and other energy sources. Each have their own innate dangers and risks. Electricity and its risks have been solved as you stated, so why do people get electrocuted? \n\nSo if I am not an engineer, it therefore means I don’t design the systems correct? Agreed! That’s one thing we agree on, yay! Instead I ensure it is safe for the end user AKA the client, AKA the consumer. I am very well aware that engineers don’t typically think of the practicality of most of their designs or how they will be implemented. \n\nI am also NOT against EVs like this echo chamber of a sub somehow thinks I am. Just try to read what I said instead of getting upset about the potential dangers of holding the equivalent of a service feeder in your hand. Is there danger just by it being there? NO. That is not what I’m saying nor implying. Never once did I state that these will kill people just cause. My initial comment was regarding shielding failure.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Jewnadian",
                                                                                                                            "body": "Thanks for answering my question. You lack any relevant technical knowledge to be discussing this so we can safely ignore your input. That's what I suspected but I do appreciate you admitting that you're working from the knowledge level of \"anyone\" rather than the industry professional you implied you were. \n\nIf it matters the answer to your question is Yes I do have experience with power design. That's why your supposed expertise was so obviously overstated to me.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "ElkSad9855",
                                                                                                                                    "body": "Wow, I answered your question how? I am not an engineer so therefore my experience, knowledge, and factual responses are null and void? You need to go out into the real world kid. Typical engineer grads thinking they’re all powerful.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Jewnadian",
                                                                                                                                            "body": "I'm an actual working EE with 25 yrs experience. I do know what I'm talking about in this specific field. I won't tell you how to handle your customer accounts, that would be outside my professional expertise.",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "ElkSad9855",
                                                                                                                                                    "body": "I don’t handle customers :) nice try at another personal attack based on… nothing. I’m obviously just a custom service rep who works in an electrical field! You caught me!!! Boohoo.\n\nSo EE for 25 years - please enlighten me on the specific issues within my arguments that immediately lead you to the conclusion that I am not “in the field”. Is it my lack of engineering vernacular? Is it my accidental switching of terms in a sentence due to a brain fart? Or is it the multiple paragraphs of me explaining basic electrical theory to a supposed Electrical Engineer that can’t even correct a single thing I said “wrong”? \n\nOther than the ones I already have “tried” to state - but you ignored because of “I’m an engineer.” \n\nIt never once occurred to you that there’s people out there with more specialized knowledge than your overall electrical engineering education? The only reason I am not an “Engineer” to your standards, is because instead of going to school, I raised a family.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "ElkSad9855",
                                                                                                                    "body": "I’m not editing my comment for this one dumb thing, but the fact that you think using the term pushing amps over pulling amps as being enough to discredit my knowledge is hilarious.",
                                                                                                                    "score": -1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Jewnadian",
                                                                                                                            "body": "It's fundamental to understanding the physics behind designing any electrical system from a functional and safety related system. You keep claiming that you're right because you 'work in power which would be useful but you don't seem to actually understand how electricity works.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "ElkSad9855",
                                                                                                                                    "body": "I do understand the physics, just because I don’t have a degree doesn’t mean I don’t understand electrical engineering, nor physics, nor material science, nor did-electric corrosion, nor how to zip up my own pants, nor how to take a shit. I am sorry to burst your bubble pal, but there are LOADS of individuals who far exceed the experience and knowledge of engineers - without degrees. \n\nNow, your claim towards me is that I don’t know how electricity works. I disagree entirely, I can go into electricity with you all you want, from the physical basics, to ACvDC, to circuitry, to phasing, to distribution, to generation, to the PHYSICS of electron flow, to the characteristics of the materials we use as conductors and insulators, all the way to the characteristics of certain electrical components. My expertise stops once I reach the outlet. \n\nI am not claiming to be one of those people. I am not claiming to be right because I am simply stating where I work and what I do. I am only claiming to know what I know, and that I am then able to express and write out my knowledge base.  You trying to tell me what an engineer is almost leads me to believe you’re a chatgpt bot.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "author": "MarsupialWorth982",
                                                                                                                            "body": "There’s way more than one.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "ElkSad9855",
                                                                                                                                    "body": "Oh? Please, go ahead then. Educate me, I am always up to learn. Gotta learn something new everyday - go for it.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "MarsupialWorth982",
                                                                                                                                            "body": "Where should I send my invoice?",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "ElkSad9855",
                                                                                                                                                    "body": "To my bathroom please, as I wipe my ass with it.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "War_Dicklock_",
                                                                                                                                                            "body": "We both know you don't wipe.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "ElkSad9855",
                                                                                                                                                                    "body": "True… I actually am able to reintroduce my fecal matter back into my body by drinking it. I am able to drink it because the hair on my ass is so dense, by the time I push it through it has filtered out everything but water and essential minerals. Talk about going green right!!!",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": []
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "ABadLocalCommercial",
                                                                            "body": "Within the context of this article you are absolutely and totally wrong. If these were putting out 1MW consistently they'd be putting out enough energy to power hundreds of homes. Point blank they're not doing that. You need full on power plants to give that much output.\n\n\nThis video shows a person touching 200k volts with their bare hands grounded and ungrounded. They not only live, but give a full lecture on why they can do it.\nhttps://youtu.be/ubZuSZYVBng?feature=shared\n\nTake the L and move on.",
                                                                            "score": 35,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "dotancohen",
                                                                                    "body": "How much amperage is the current in that video? Now how much amperage is the current delivered to charge an EV battery in five minutes at 1500v?\n\nGP is expressing himself poorly because he is assuming that the reader understands electrical power and the relationship between power and voltage, without explicitely stating so. But he's still correct - 1500v is extraordinarily difficult to properly insulate, and certainly not within the realm of materials and components to be handled by Joe Public. And if we're charging an EV battery pack then we're probably somewhere in the range of 500 kW, at 1500v that's going to be about 300 amps and even with a DC GFCI device shutting it down quickly, you would not want to survive getting zapped by that.",
                                                                                    "score": 13,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "ElkSad9855",
                                                                                    "body": "My my my, ok my bad. My decade+ of electrical generation and distribution is clearly wrong. And thanks for the intro to voltage video! I will explain why this has nothing to do with anything we are talking about in just a moment. After reading the article again, and doing a little more research - the battery packs are 1000V and are at 810kwh. The chargers operate at 1000kw, AKA 1 MEGAWATT. Which is why it can charge 810kw in 5 minutes!!! Crazy huh. I know engineering is hard, so I don’t expect everyone to understand it. But did you know you can hold 1000000000000 volts and live! As long as you’re grounded, OR as long as the amperage is near zero and therefore has no power. Death by electrocution requires roughly 50 voltage (there are exceptions especially when you get to very high amperages or your skin is wet) to pass through our skin, and then a high enough current to cause damage, plus time exposed to said current. The video you posted had a man who was fully insulated from the ground. Do you think a standard citizen walking up to a battery charger will be fully insulated?",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Dragon--Reborn",
                                                                                            "body": "They could just make these not self-service. I believe there are 2 states where you can't pump your own gas (NJ and Oregon iirc). Why not have these chargers at a service station, driver and passengers get out of car and go to a waiting area, grounded technician charges car, driver and passengers get back in and drive away.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Iceykitsune3",
                                                                                                    "body": "It would most likely be a robot, because the average pump jockey would get themselves killed in short order.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "ell-esar",
                                                                                            "body": ">My my my, ok my bad. My decade+ of electrical generation and distribution is clearly wrong.\n\nIt apparently is. \n\n>But did you know you can hold 1000000000000 volts and live! As long as you’re grounded, OR as long as the amperage is near zero and therefore has no power\n\nAny basic electrical engineer would know current in the circuit has no effect on risk and damage when short cicuiting with human body. Only the current that traverse the body matters, and it's determined by circuit voltage and your internal resistance. That's why we learn that past 50V (in AC) the risk and danger is real serious, you don't learn it's past X amps.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ElkSad9855",
                                                                                                    "body": "Did you seriously just try to say that I was wrong and then within the same sentence proved me right? What was wrong with my statement of 1000000000000000 volts, as long as the amperage (the current) is sooooo low, once it does overcome skins resistance, it won’t kill you. Want to know a perfect example of this…. Well not 1000 blah blah blah volts, but static electricity. It is enough volts to literally cause an arc. 25kV+ at times. Thats plenty enough voltage to get through the skin. Why aren’t we all dead?! We’ve all been shocked by static electricity before right? \n\nYou can have 50v touch you and live, same with 200kv. It all depends on the path of the current (where it grounds), the exposure time to said current, and the amount of current flowing. If your power supply has a differential of 200kV but a power supply of microamps and you’re only exposed to it for fractions of a second - you’re totally fine! If you hold onto a 50v circuit and your power supply is rated to provide milliamps, or amps, you may as well be toast. \n\nThe CURRENT is what causes the damage, not the voltage. The voltage dictates the current but the current of the circuit can not be greater than what is being produced by the supply. It generally takes 50+ volts to pass through the skin barrier, once inside your body your resistance may as well be ZERO. But you keep going on with your googling bud. I’ll give you a tip, try looking up Van de Graaf generators. The voltages are crazy high with a continuous low current. If static electricity was continuous, we’d all be dead for sure. But thankfully that’s not how static works… Do you want me to also explain to you how static discharge is the flow of electrons from a more negatively charged source to a more positively charged?",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "ell-esar",
                                                                                                            "body": "Maybe you know some things but please calm yourself and read again what you write with a clear head. Nobody can counter-argument the diarrhea you spew at the moment and it's literally filled with nonsense. \n\nYour comment is in the land of [not even wrong](https://en.m.wikipedia.org/wiki/Not_even_wrong) argumentations. \n\nA power supply of microamps... Who can claim to know something about electricity and say something that stupid. Your power supply supplied voltage, your charge decide the current that's in your circuit. Your power supply is rated for a certain current and will fail if you ask of it more than it can give.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ElkSad9855",
                                                                                                                    "body": "Son. If you have any kind of lead off of your generation source, you indeed can have a power supply of microamps at high voltage. Like I just said in my comment, a Van de Graaf generator for fucks sake man. \n\nIf you have a power supply of a 9V battery - and you try to pull a load of greater than like… an Amp I think, maybe it was 0.1 I can’t remember, the voltage will drop heavily as power draw increases. But the point is the amount of total power in said battery isn’t much at all compared to the battery of an EV. So. Like my previous statement, if you had a MICROAMP POWER SUPPLY pushing HIGH VOLTAGE (yes I know I fucked up by switching the verbiage, sue me), but are only exposed to if for milliseconds if not nanoseconds, you can live no problem. It only takes roughly 0.2mA across your heart to kill you. That’s a 9V battery directly to the heart. If your voltage is high, and your amperage is high, time doesn’t matter. If your voltage is high, your amperage is low, time is CRUCIAL when figuring life or death.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "red-barran",
                                                                                            "body": "Dude don't worry about it.\nIt's weird you are correct about the risks of higher voltage, but Reddit is down voting you",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "kop324324rdsuf9023u",
                                                                                            "body": "Brother, there is serious EV cultists/tech bros in this subreddit. Just accept that you won't educate them with facts and enjoy your day.",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "spikejonze14",
                                                                            "body": "I’m not saying that there aren’t risks, I’m saying that engineering can make these technologies safely accessible to us. We will have to see whether the chargers are managed safely, but the possibility of failure isnt a reason to not try.",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "dotancohen",
                                                                                    "body": "That would need such a breakthrough in materials engineering that such a material would be more newsworthy than would the ability to charge an EV in five minutes.\n\nWhat materials are you familiar with, which you would feel comfortable letting your family members handle while it is delivering hundreds of kW at 1500v? And this isn't in some lab, it's in the hands of the public and all the abuse that entails.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "spikejonze14",
                                                                                            "body": "I wouldnt worry about my family using any of the electric trains in my city, which run at 25,000 volts. of course tesla high speed chargers already run at 10,000 volts but thats not an issue? how about getting an xray at the dentist? thats 150,000 volts right there. don’t pretend we don’t already employ high voltages technologies in our every day lives, have you ever looked up at a powerline?",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "dotancohen",
                                                                                                    "body": "Which of the above the general public can go up to and manipulate? I don't know what's going on inside the Tesla supercharger, but the part that the public can touch goes up to I believe 400 volts.\n\nAnd again, for the dental imaging device, how much current is going through that? It's not going to be hundreds of kW.",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Ok_Power1067",
                                                                                                            "body": "A typical Tesla super charger has a power output of 150-250 kW. Which at 400-480 volt DC charging, translates to 375-625 amps. If you feel comfortable using a Tesla charging station, the new BYD charging station is going to be fine.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Iceykitsune3",
                                                                                                                    "body": "Except that ar a supercharger there's a contacter in the base station that disconnects the high voltage conducters in the cord the public handles until it's communicated with the car being charged",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Ok_Power1067",
                                                                                                                            "body": "Most likely the Chinese engineers will implement safety measures in worse case scenarios. This is standard in engineering and design. ",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Ok_Power1067",
                                                                                            "body": "In most cases, voltage dictates how thick the insulation is and amperage dictates heat output. Per AP article, BYD supercharger output 1 MW @ 1500 volt. That's 666 amps. Compared to Tesla super charger v3 250kw @ 400 volt = 625 amps. \n\n\nBYD will require thicker insulation material and similar cooling rates compared to Tesla's supercharge v3.\n\n\nSource to AP article: https://apnews.com/article/china-byd-tesla-buffet-ev-63280ec09317d2c0a8e70449fd0e4a95",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "mikemac1997",
                                            "body": "Electrical breakdown of air is roughly 3000v per mm, unless you're half a centimetre away from the charged power whilst grounded, it won't spark to you. If you are, then you deserve it.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "ElkSad9855",
                                                    "body": "Lmfao. Where did I say the arc would jump? Everyone downvoting me is because of dumb comments like yours. If you’re touching a car charger and die then there’s something wrong with the car charger. We can both agree to that I hope? \n\nWhen you pull up to a charging station, what’s around you? Other cars usually, which means other people which means introduced variables such a water or any other conductive medium - and that’s not including environmental concerns such as weather. \n\nEveryone in r/technology should have some idea of how electricity works I’d hope. How many times have people died from electrocuting themselves off of electrical cords plugged into 120/200v at roughly 15 amps? \n\n1500V at 700 amps is 3 times the current and 10 times the voltage of a standard US residential service. Roughly 2 times the current and 4 times the voltage for standard storefront commercial outfits. The voltage is what’s scary in this application. But go off about arcing if you want - we aren’t dealing with transmission lines.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "UberGoober30",
                                                            "body": "\"Lmfao. Where did I say the arc would jump?\"\n\nRight here:\n\n\"Well, any resistance/shielding failures and anyone within a few feet of that charger is getting electrocuted.\"\n\nIn fact, you seemed to say it would arc several FEET, which IS pretty hilarious. \"Lmfao\" indeed 😂😂",
                                                            "score": 19,
                                                            "replies": [
                                                                {
                                                                    "author": "ElkSad9855",
                                                                    "body": "Where did I say arc? Kid I deal with electricity and power distribution every day. In the real world. With real humans. And real motors. And real transformers. And real generators. \n\nElectricity doesn’t need to arc through air in order to reach several feet. Every single gas station or EV station you’ve ever been to has had a soaking wet ground. Every EV station you’ve ever been to has adjacent metal surround it either architecturally, structurally, or as furniture. Critical thinking is hard - but don’t put words in my mouth, or text, whatever. Just because you decided to make an ass out of yourself :)",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "UberGoober30",
                                                                            "body": "As a Floridian, then, I risk death every time I use an extension cord! Oh wait, that's the same for everybody? It's almost as if we have engineers and hundreds of years of innovation to mitigate these risks. \n\nEverything will kill you. Water will kill you. Mosquitoes will kill you. \n\nWe need EVs to charge faster, period. Unless you want to charge with a cable the size of your thigh to cover the amperage, what the fuck do you want?",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ElkSad9855",
                                                                                    "body": "The entire point of everything I am saying flies right over your head doesn’t it? We aren’t talking about 120v extension cords pushing 5 amps man. We are talking exponentially higher. The risk of dying from an extension cord is VERY low. Even with the human ability to destroy that cord in every which way possible yet keep it working. Now, apply that same line of thinking to an extension cord that is literally able to power a whole house. Sure, as is, the cord is engineered and designed 100% to have no fault or error. I agree. I am not talking about the engineering or design. I am purely speaking of human error and interaction. The possibility for a human to trip over it, to swing it around like it’s a toy, or constant use such as bending or warping causing wear in the internal conductors causing a break which would melt the insulation quickly and once through, would shock and probably electrocute everyone nearby. \n\nWith power at this level, the risk is much higher compared to an extension cord. The current implementation for EV chargers is begging for death. Current EV chargers in America cause shocks and injury, but fail safes keep those cases as injuries and not death. When you crank the power up 10x, those fail safes need to be even more strenuous and bulky. Unless we discover some sort of new superconductor that takes up next to no space in which case - cool.",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "UberGoober30",
                                                                                            "body": "Okay bud, I'm not missing your point. I know high voltage is scary. But you don't need to let everything scare you! At this point it's less about the hypothetical charging station, more about your blood pressure. Maybe you should hop off the internet for a little bit and get your cardiovascular system back under control",
                                                                                            "score": 4,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "mikemac1997",
                                                            "body": "Because in the grand scheme of things, 1500v is not a lot. I have a lighter on my desk that is capable of 5x as much. \n\nThe only way you're going to get a shock is either if insulation is broken and you've used it anyway (stupid) or you have found a way to touch the spicy metal (more stupid).\n\nAlso, most other countries have far larger residential power services than the US.\n\nThe point about other vehicles and water puddles is straight out of a final destination movie.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "ElkSad9855",
                                                                    "body": "The point is that humans find every which way to fuck things up. It’s part of my literal job to prevent human fuck ups and death in power distribution centers.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mikemac1997",
                                                                            "body": "So how would a human hurt themselves plugging this in without the charger being defective and without doing something obviously negligent.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ElkSad9855",
                                                                                    "body": "I am not saying it’s possible whatsoever without those two variables being present. I am saying that the last variable of human negligence (and human maliciousness) magnifies the risk at a much higher rate compared to other chargers. The same risks all apply, but potential for death increases. And people have been electrocuted, shocked, etc when dealing with current 2024/2025 chargers. These operate at roughly 325w throughout America. It’s not hard to imagine a world where someone walks up to one, grabs the handle, plugs it in, and wakes up at the pearly gates because someone prior to them fucked up the charger. \n\nUnless charging distribution is redesigned to be touchless by humans, death will occur more frequently than before.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mikemac1997",
                                                                                            "body": "For example, filling a car with a flammable liquid in an environment full of explosive vapours and ignition sources? I'm yet to die doing that.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ElkSad9855",
                                                                                                    "body": "You’re thinking at a 5th grade level. I would leave this conversation if I were you.. It is clear this convo is much higher than your current education.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "mikemac1997",
                                                                                                            "body": "I'm currently at a PhD. level in STEM, specifically Aerospace Engineering, try me.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ElkSad9855",
                                                                                                                    "body": "LMFAO yet you can’t tell the difference between gas fumes and electricity? Why don’t we all die due to the levels of cyanide in food? Cyanide kills us!!! But cyanide is in fruit?!?! How are we not dead? \n\nIf you’re an Aerospace Engineering doctorate, I’m fuckin Albert Einstein.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "mikemac1997",
                                                                                                                            "body": "I can tell the difference, you're just unable to detect nuance in a counterargument. You stated that the only safe way would be without any human intervention, I disagree. I used the point of gasoline and its vapours as a casing point where the average populous can handle elevated risk without immediately hitting the stupid button. \n\nIf I were you, I'd check to see if there's any lead in your drinking water, maybe that can explain what's wrong with you.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "seanyseanyseanyseany",
                                                            "body": "Legit question what are they going to have to do to prevent killing customers in the manner you're suggesting? I'm not that well versed in the subject like. Are there steps to take to idiot proof the thing?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ElkSad9855",
                                                                    "body": "We are humans - it’ll be impossible to idiot proof it. But the best way would be to have a docking station that doesn’t require human intervention. That way humans can’t mess with the cords, can’t do anything to harm themselves or others. Either that, or have a 6” cable with 3 layers on insulation to prevent possible harm, with the addition of weekly full inspections - which sounds unreasonable.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "dotancohen",
                                                                    "body": "It would take a breakthrough in materials engineering to come up with a material that could handle abuse, and conduct 1500v at hundreds of amps safely.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Ok_Power1067",
                                                            "body": "In most cases, voltage dictates how thick the insulation is and amperage dictates heat output. Per AP article, BYD supercharger output 1 MW @ 1500 volt. That's 666 amps. Compared to Tesla super charger v3 250kw @ 400 volt = 625 amps. \n\n\nBYD will require thicker insulation material and similar cooling rates compared to Tesla's supercharge v3.\n\n\nSource to AP article: https://apnews.com/article/china-byd-tesla-buffet-ev-63280ec09317d2c0a8e70449fd0e4a95",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ElkSad9855",
                                                                    "body": "Yep, and with more power comes thicker insulation and thicker conductors. The thicker, the less flexible. The less flexible, the more susceptible to damage when it IS flexed. The more damage due to flexing, the higher chance of safety measure failure.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ok_Power1067",
                                                                            "body": "Agreed but that all engineering. Material, insulative properties, and design will dictate how susceptible to damage these chargers will be and maintenance frequency. We at Tesla are looking closely at how the Chinese engineers are going to solve this issue. We're most likely to adopt a similar technology in the future. ",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Jewnadian",
                                                            "body": "What **specifically** do you do in \"power\"? I know it's not engineering, or if it is it's some kind of mechanical, environmental or other non EE discipline. I'm curious exactly what authority you're claiming to be with that.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Leon_84",
                                            "body": "Just like all the gas stations with highly flammable liquids exploding all over the world daily!!!",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "ElkSad9855",
                                                    "body": "Imagine being this ignorant. Read my other comments. I am not downplaying EV, it is the future and honestly could’ve/should’ve phased out fossil fuels years ago. But gas stations aren’t anywhere near the same comparison.. I mean, you don’t explode when you touch gasoline, or oil. You can even put a flame right on it and it won’t ignite. It’s the fumes. But sure, electricity and gas are the same. Same same, but different!",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Leon_84",
                                                            "body": "Do you actually know how many 1500+V lines you walk by everyday without people dropping dead left and right? Electric safety is pretty much solved and it’s not like you have to hotwire five phases to charge your car.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Iceykitsune3",
                                                                    "body": ">Do you actually know how many 1500+V lines you walk by everyday without people dropping dead left and right?\n\nHow many if those are physically handled by the general public, like an EV charging cord would be?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "ElkSad9855",
                                                                    "body": "You’re trying to explain electricity to someone who works with power generation and distribution as their career. I am bringing up literal safety concerns. Just be quiet, you know not what you speak.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "drkspace2",
                                            "body": "Hyundai/kia/genisis' EVs use 800V and I don't know about any electrocutions with them.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "ElkSad9855",
                                                    "body": "Those chargers are 800V with 300kw output. These are over 6x the strength - in human hands. While the concept of holding a battery charger with voltage and current is the same, the risk doesn’t scale the same. With increased current requirements comes increased conductor size, which comes with increased insulation/shielding size. Current EV chargers use several failsafe features to prevent electrocution such as power won’t flow till fully seated, and locking ports etc. I’m sure as well as a basic GFCI somewhere in the mix. There have been many many many cases of people being shocked, and badly, by chargers of these sizes. They’re only shocked because of the safety features. I am NOT downplaying this tech whatsoever, I am very excited for it to work and be implemented properly. But if you try and hold a battery charger plug with 1500V with roughly 600+ amps running through it, it’ll be a much different experience than one 1/10th the size. A nick in insulation or a partial failure of the safety features on a 800v/300kwh charger can cause a shock. Imagine if it was 10x as strong. Anyways I’m done replying to everyone who thinks they know how electricity works.. Good day. Hope you learned a thing or two.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MrBeverly",
                                                            "body": "If I'm not mistaken, both the EVSE and car sides of the charger have redundant safeties in place and either can detect isolation problems anywhere in the HV system. If there is a problem it's very unlikely that both ends of the charge won't recognize there's something wrong. Furthermore, The EVSE cable is never energized unless it's plugged in, locked into place, and a car has started communicating. The initial communication is done over low voltage, and once the EVSE and car agree it is safe to charge, only then is the cable fully energized. The car tells the EVSE how much power to supply, and if the car ever stops telling the EVSE how much power to supply, it stops supplying power.\n\nI'm sure you know all this but I don't want people reading worst case scenarios and assuming that L3 chargers are constant high voltage beacons of death to anyone around them as if an engineer didn't already consider the possible dangers of handing end users a 10x concentrated Magic Smoke dispenser",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "ElkSad9855",
                                                                    "body": "And if I am not mistaken, people have been electrocuted and shocked with these safety measures in place. These safety measures are currently designed for a smaller gauge cable. Sure, it can be redesigned for a larger use, but when it comes to consumers - the larger, the more chances for error. \n\nBut I agree, to ANYONE reading this, chances are you’ll be 100% fine from here till your natural death when using EV chargers. I am only speaking of the elevated risk of introducing larger, movable, operable, bulky components to a standard consumers daily life. And then of course the exponential increase to the risk of death involved with larger power sources. \n\nIf using a 120v extension cord has an imaginary death factor of 1. A 240V doesn’t have an imaginary death factor of 2, it’s an exponential increase in risk. It’s the same concept of working with 10000V or 100V, the concepts are all the same. While I generally trust my fellow engineers, especially the ones who’ve specialized in these chargers - but I certainly do not trust the typical consumer. Period. Ever.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MrBeverly",
                                                                            "body": "Lol. At first I was like \"I've never seen a single article about someone being electrocuted while trying to charge their car, the way the standard is designed it's not even possible *in normal scenarios*\"\n\nWhat I HAVE seen articles about is junkies trying to cut cables off EVSEs that are in use... I would NOT want to be on the receiving end of that 1 MV zap lmao",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ElkSad9855",
                                                                                    "body": "I’m just of the belief that if a human has to touch it, it can go wrong. I believed it with the first chargers.. and that belief gets stronger regarding these chargers as the power rating increases. While junkies are known to not care about their wellbeing, a normal person could just as easily accidentally damage one of these enough to cause death. Can’t energize unless fully seated? What’s stopping someone from somehow bypassing that accidentally? Sensors can fail, control pilots and proximity pins can fail and or be accidentally bridged. All it takes is a small amount of resistance between the proximity pin and a ground to confirm proximity. Now…. The control point would be hard but still possible, just requires a specific amount of resistance in the circuit and BOOM the charger thinks it’s inserted and locked. Now, is this possible? Anything is possible. After prolonged use, wear and tear on materials equates to wear and tear on designed/engineered fail safes. It’s not a matter of if, just when. Now, it’ll come out in the news “EV station wasn’t properly maintained, wasn’t X, wasn’t Y, wasn’t Z.” \n\nBut we hear that everywhere with everything - just fortunately for us when maintenance isn’t maintained in just usually leads to a broken door knob, a hole in a roof, a pothole in the road, your rear differential freezing up (which tbh can be scary if driving). But to just instantly touch something, with no ill intent, and be poofed out of existence just makes my brain go “helllll no.”",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BlackSheep311111",
                                            "body": "1,5kv is like max 15mm where it can 'jump' over very humid air to a better electrical consumer.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ElkSad9855",
                                                    "body": "No one said anything of jumping or arcing. There are many other ways for electricity to reach something a few feet away.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "biscotte-nutella",
                    "body": "We'll know really only once early adopters have it for a few months. Maybe reviews.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "SilverBuggie",
                    "body": "I heard some Chinese car brands offer LIFETIME warranty on batteries. Don’t know if they are the ones offering these 5-min full charge batteries.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mum_Chamber",
                    "body": "the answer to both questions is yes",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "NimblePuppy",
                    "body": "we have been apparently on the cusp of safer lithium batteries for awhile , so wonder if that is in these ones. Also tech promising less run away fires etc \n\nSuppose we have basic data  to calculate the watts  needed - eg size of battery, capacity and time taken \n\nAssume not sodium batteries or some other tech \n\nWhen I backpacked in China mid 90s used a chinese charger for my alkaline AA batteries for my sony sportsman- wasn't that trusting near open window , never left unattended . checked for heat,  bulges - actually work surprisingly well for non-rechargeable batteries - still flipped them after say 5 cycles as still a bit paranoid",
                    "score": -11,
                    "replies": []
                },
                {
                    "author": "CarminSanDiego",
                    "body": "You think China manufacturers care about that?",
                    "score": -1,
                    "replies": [
                        {
                            "author": "alleks88",
                            "body": "If they want to sell to EU, yes. They would have to fulfill testing according to EU standards",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cookingboy",
            "body": "For context, this is not some prototype tech or demo, they are shipping these in passenger cars starting next month:\n\nhttps://carnewschina.com/2025/03/17/byd-han-l-ev-and-tang-l-ev-1086-hp-started-presales-in-china-for-37300-usd/\n\nYep. Less than $40k, 1000hp+ 2.5s 0-60 and 5 minutes charge to full.\n\nThey are so fucking ahead in the EV game.\n\nThank god for all intents and purposes we banned Chinese EVs in this country in the name of Freedom^TM. /s",
            "score": 595,
            "replies": [
                {
                    "author": "amakai",
                    "body": "> Less than $40k\n\n\nNice, as low as Cybertruck, which will cost the promised $39,999 any day now /s",
                    "score": 160,
                    "replies": [
                        {
                            "author": "butterbal1",
                            "body": "I mean... \n\nThey way people are trying to dump em before they are totally worthless you might actually be able to pick one up used for that in the next few weeks.",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "walrustoothbrush",
                                    "body": "You'll probably have to dispose of the mountain of dog shit in the trunk yourself though",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "butterbal1",
                                            "body": "Thankfully when the body panels fall off most of it should fall out.",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "itsSIR2uboy",
                                    "body": "Insurance premiums on those are skyrocketing currently, because of vandalism.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hellspawner",
                            "body": "Overpriced dumpster on wheels",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UGMadness",
                    "body": "Free market capitalism is God's gift to humanity until it costs a bunch of billionaires' money 🇺🇸🦅",
                    "score": 78,
                    "replies": [
                        {
                            "author": "theKman24",
                            "body": "lol. China is not free market capitalism.",
                            "score": -22,
                            "replies": [
                                {
                                    "author": "BoDrax",
                                    "body": "Is the USA?",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "mortalwombat-",
                                            "body": "It was until the government started selecting which companies succeed. Now it's a Command Economy.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "ksfst",
                                                    "body": "So it never was, gotcha.",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cat_prophecy",
                    "body": ">Yep. Less than $40k, 1000hp+ 2.5s 0-60 and 5 minutes charge to full.\n\nThis really is not the sort of performance I want in the hands of regular people.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Sufficient-Diver-327",
                            "body": "Most countries would force limits on that, anyways. Horsepower limiters already exist",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "LassyKongo",
                            "body": "Can't wait for every set of lights to be a drag race. People can't even control 100hp cars nevermind 1000.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "CoasterFreak2601",
                            "body": "EV or not, but I firmly believe there should be an additional driving test for anything with more than 300hp.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "MyNameIsSushi",
                                    "body": "And test what exactly? Acceleration from 0-50 km/h, which is basically every speed limit in the city anyway? What would you test?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "MyNameIsSushi",
                                                    "body": "> How about some training in what to do in a panic situation?\n\nUh, we already have that? Is that not a thing in the US?\n\nAnd where do you draw the line? 500hp? 800? 1000? What about safety systems? Does a 1000hp gas car with fewer and worse safety systems from 2010 get a pass but the 1000hp EV from 2025 doesn't? What about gas cars with equal/similar power and torque to EVs?\n\nHow would you even legislate that? Genuinely curious.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "CoasterFreak2601",
                                                            "body": "Genuinely we don’t, at least it’s not mandated in any fashion in the US. Most drivers testing is 4 right turns and parking in an empty lot. Maybe parallel parking.\n\nWe are talking acceleration so simply put, how about 0-60 time at max acceleration? Safety features are a great bonus but they aren’t a substitute for driver ability.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SemIdeiaProNick",
                                    "body": "This is specially needed for EVs. A normal car with 300hp is already way too much in the hands of the average driver, let alone something with 300+hp that can accelerate nearly instantly \n\nAnd lets not forget that EVs are heavier (and some dont have brakes that match the performance of the car), so good luck to any pedestrians, cyclists and motorcyclists in the way of those things",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "scyice",
                                            "body": "Your comment is ignorance manifest.\n\nWe have hundreds of cars with more power than EVs already, no special license needed.  We have hundreds of trucks heavier than EVs already, no special license needed.\n\nThese cars are no more difficult to drive than any other vehicle.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "urtlesquirt",
                                                    "body": "I think the point that person was trying to make is that this level of performance is significantly more accessible than it used to be. A $40,000 car that accelerates faster than the average hypercar IS a bit bonkers to wrap your head around. Yes, there is traction control. No, you should not be putting your car into launch mode and accelerating to 150 MPH on a residential road. But the fact that you *can* do that if you want is an interesting problem to think about.\n\nThese cars are just as easy to drive as \"normal\" car...if you are gentle on the throttle and are a good defensive driver who minds the rules of the road. On the other hand, if you stomp on the accelerator, you will find that driving a road car at 150 MPH is actually a lot more difficult than driving one at 70 MPH is!",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "theycallmeJTMoney",
                    "body": "The reason you have to limit imports is that the price of the car is heavily subsidized by the Chinese government. If you allow them to bankrupt all the domestic car manufacturers, it makes the country susceptible to being held hostage (even more so) for a commodity that in America has an enormous impact with how large and spread our the country is.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "DanielShaww",
                            "body": "You mean the way US subsidized/bailed GM, Ford and Tesla all these years? Only seems fair to me.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "theycallmeJTMoney",
                                    "body": "From what perspective? We have no legal or moral reason to allow another country to sell goods in the US. Is it fair for overseas manufacturers to drive all domestic manufacturing out of business by paying slave wages?",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "LeLefraud",
                                            "body": "Lol bc domestic companies DONT use wage slaves overseas\n\nOr tech companies that import all their workers to pay them less than an American, but are still considered \"domestic\"\n\nThey do the same shit they just charge you more because they have bloated executive boards demanding more and more",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "eatingkiwirightnow",
                            "body": "It makes sense when tariffs are used in conjunction with promoting domestic manufacturing and subsidizing the country's own EV supply chain and infrastructure. That doesn't seem to be the case in the US.",
                            "score": 68,
                            "replies": [
                                {
                                    "author": "Impossible_Angle752",
                                    "body": "What are the rebates for buying an EV?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Gapping_Ashhole",
                                            "body": "Subsidizing Tesla.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "eatingkiwirightnow",
                                            "body": "$7500 for new cars, half that for used cars. But components have to be sourced from US or allies, or use lease loophole. But that tax credit is not assured in the future as the Republicans may use budget reconciliation to remove it, as Trump has threatened.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "smoothtrip",
                                    "body": "The US would never do anything to help its people, only punish them and then giving themselves a pat on the back after doing it.  And the Americans clap while guzzling billionaires' shit.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "PigmyMarmeeble",
                                    "body": "Hey, a great usecase for tarrifs.\nI wish we used them more like this and less as a threat to our allies.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "steve290591",
                            "body": "Have a look into the amount of subsidies the US gives Tesla per year. \n\nIt’s hypocrisy, plain and simple.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "blastradii",
                                    "body": "Not just Tesla. US puts a lot of subsidies in other key industries like aerospace, agriculture, etc. It’s a common tactic for almost all governments. Reddit loves to vilify China even when something good comes out of it.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "theycallmeJTMoney",
                                    "body": "You may not like it and I would argue it’s a valid argument, but the fact of the matter is that domestic vehicle manufacturers can’t exist without subsidies.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "RudeMorgue",
                                            "body": "Unfortunately true. Also, if domestic manufacturers were driven out of business, it's not likely that foreign auto prices would stay as low as they are without any competition.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "dolphone",
                            "body": "I mean the US did that with many countries, I think it'd be fair turnabout.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "just_dave",
                    "body": "That's disingenuous. \n\n\nThe Chinese government _heavily_ subsidizes these EVs to make them more attractive and cheaper than US or European equivalents. Like, way more than the tax credit and other EV incentives in the US do. \n\n\nAnd they do it for the express purpose of driving non-Chinese manufactured EV makers out of business. If we didn't have the Chinese EV tariffs, it would be like when Walmart moves into a small town, artificially lowers their prices to drive the local mom &  pop's out of business, then slowly raises those prices back up over a year or so. \n\n\nBlanket tariffs are stupid (and so are Trump and Elon). Targeted tariffs that serve specific purposes and protect large domestic investments and manufacturing capacity from outside attack, like the US auto industry or Canadian Dairy, are useful tools for diplomacy and economy. ",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Noticeably-F-A-T-",
                            "body": "Tesla is also heavily govt subsidized.",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "just_dave",
                                    "body": "_All_ EV makers in the US receive the same government subsidies in the form of tax incentives, primarily for the consumer. \n\n\nWhat China is doing is way, way more. They are pumping [billions](https://electrek.co/2024/04/12/china-gave-byd-an-incredible-3-7-billion-to-win-the-ev-race/) in cash directly into the company. ",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "smoothtrip",
                                            "body": "The US tax credits are billions lol",
                                            "score": 28,
                                            "replies": []
                                        },
                                        {
                                            "author": "cookingboy",
                                            "body": "> In terms of business revenues, direct subsidies increased from 1.1% in 2020 to 3.5% in 2022.\n\nThat is virtually nothing. Even if the author’s claim is true, the total subsidy is less than BYD’s profit from last year alone.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "just_dave",
                                                    "body": "That's not including the supply chain subsidies, and the advantage they have on labor and materials, and that they don't restrict the use of conflict minerals. \n\n\nI'm not sure where to look for all of that data right now as I'm on a lunch break on my phone, so I can't provide much in the way of specifics. Let me ask you a question instead. \n\n\nDo you think that China is _not_ overly subsidizing BYD with the intent of undercutting US and EU manufacturers and collapsing our respective domestic car manufacturing capacity?\n\n\nIf not, then why have the US and EU both, independently, investigated the situation and decided that tariffs to rebalance Chinese government subsidies are necessary?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "cookingboy",
                                                            "body": "> do you think\n\nCorrect. I don’t think that was their intention, that is fear mongering.\n\nIf they wanted to do that, they could have done it with ICE cars years ago.\n\nIn fact, BYD and other Chinese EV companies have *higher* price in foreign markets than domestic ones, and they see other countries as profit centers.\n\nThat’s the opposite of the definition of dumping.\n\n> Why have the U.S and EU\n\nLmao the West (especially the U.S) never needed actual justifications to find ways to pick a bone with China. \n\nIn fact, against your argument, Germany, the biggest EU auto maker, is *against* that investigation and they are also against the tariff: https://www.reuters.com/business/autos-transportation/germany-vote-against-eu-tariffs-chinese-electric-vehicles-sources-say-2024-10-03/\n\nThat’s all the evidence you should need to show that the whole charade was politically motivated.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "just_dave",
                                                                    "body": "I don't think they could have done it with ICE cars. ICE cars are far more complex to design and manufacture and the West had far too long of a head start compared to China. \n\n\nI never said the decisions for tariffs weren't politically motivated. Of course they are. They are a tool of government to regulate markets and activity, and anything a government does is almost by definition political in some fashion. \n\n\nAnd yeah, I would expect that international prices are higher than their domestic ones when accounting for purchasing power. That doesn't change that they will undercut the prices of US or EU manufacturers in our own markets to make it non-viable for us to compete with them. It's smart business on their part, and the EV tariffs are a logical response. ",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tdrhq",
                            "body": "People keep saying \"heavily subsidized\", but I've never heard a number. Is it 5% below production cost, 20%, 50%? Is China just giving the US free money if we choose to agree to import it at those subsidized prices?\n\nIf China is subsidizing R&D (as opposed to subsidizing each production car), then clearly that subsidy has benefitted China and benefits the world in helping with climate change. The US subsidizes a lot of R&D here too (for instance grants to Universities, or defense companies/NASA etc.), and yes the world benefits from that subsidy too.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Noname_2411",
                                    "body": "According to some people China literally subsidises everything that China can make cheaply lol. Somehow the Chinese government can print infinite money and subsidises the consumers of the world and still has not caused hyperinflation. Indeed it’s heading into deflation according to some. Laws of economics just don’t work on China it seems.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "Admirable_Boss_7230",
                                            "body": "This is the funniest part of all. We know western prices are insanely bubbled (we literally live here) and we still accept media narrative pointing problems on others",
                                            "score": 17,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "just_dave",
                                    "body": "China subsidizes up and down the supply chain. Battery costs for their domestic EV makers are incredibly cheap. \n\n\nBYD alone, between 2018-2022 received $3.7 billion in direct subsidies, not including their supply chain or consumer tax incentives.  \n\n\nTheoretically, sure, you could allow Chinese EV sales in the US with no tarrifs and it would cost the Chinese government money. Money they would happily pay. \n\n\nA few years down the road, US auto manufacturing, including the suppliers surrounding the industry, will be out of business and millions of Americans won't have jobs. \n\n\nBut that's ok, you can drive your cheap Chinese EV, as long as you bought it in those first few years. After that, once we can't manufacture our own anymore, China has no reason to keep those prices so low. ",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "riksters1994",
                                            "body": "Is this not what the entire world has had to deal with from the big American tech companies and their products and services? I guess we should all tariff Google's, Apples, Meta's and Amazon and whilst we are at it any Hollywood or American produced media. Do you realise the entire free market concept has been pushed by America to ensure that American companies are the largest and most profitable. Wow it's such a shame for me that now China produces and wants to sell an affordable vehicle when so much of my life dominated my American products and services who have all massively put their prices up the last 5 years... I can't believe how blinded some of these right wing Americans are",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "just_dave",
                                                    "body": "I am far from right wing, so please don't insinuate that. \n\n\nAlso, I am all for other countries instituting regulations on American products for their own people. As an American, I can benefit from that too. A great case in point is USB-C ports in iPhones. That only exists because of EU regulations. \n\n\nI'm a huge fan of GDPR and wish we had politicians with the balls to implement something similar here. \n\n\nI've spent almost half of my life outside of the US. While I have believed, up until recently, that the US is the greatest country in the world for the opportunity it represents, it is certainly not the greatest _at everything_. \n\n\nUnfortunately, we are rapidly watching that opportunity evaporate before our eyes. ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "riksters1994",
                                                            "body": "No not regulations. Tariffs. Ban them from the market. Just like America is doing to BYD. \n\nI didn't insuiate that you are right wing, i said the rhetoric of only America is allowed to tariff countries because it's impacting their domestic market is what the right wingers all cry when they engage with those on the left of the political spectrum.\n\nThe amount of times any debate around EVs evolves into bah China bad when the entire world has dealt with America and America's companies for the last 60 years. Frankly I'm sick of it and looks like others are too. And to be honest it doesn't matter if you are left or right anymore, if you are American, you need to suffer. All of this has came about due to apathy because all Americans have ever cared about is themselves and making money.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "gruhfuss",
                            "body": "I would rather my government heavily subsidize carbon-cutting industries than wars in other countries.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "just_dave",
                                    "body": "I largely agree with you. We could more effectively spend a lot of our money, and could more effectively utilize the tax code to encourage positive behaviors. \n\n\nI am just trying to point out that making an apples to apples comparison between BYD and domestic EV costs and capabilities isn't possible without taking the actions and intents of the Chinese government into account. ",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "rapaxus",
                            "body": "Well, that is how a state capitalist country operates and what capitalism in general encourages.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "GuaSukaStarfruit",
                            "body": "I mean you forgot to take currency difference into account. The car in RMB is very unaffordable for average Chinese people earning 6k rmb per month",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cheesyandcrispy",
                    "body": "A state outperforming private companies. Good to see!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "blastradii",
                    "body": "Less competition means less innovation",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "el_guille980",
                    "body": "im just glad the b🍊z🤡 is trying to destroy the american ev industry, so that \"ghyna\" wins",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PaDDzR",
                    "body": "Can they start making it actually good car to drive? Seal is just behind. I'm hoping this will actually have quality of life stuff we see in budget car brands in EU.\n\nIf your car has no 1 pedal driving, it can fuck off.\n\nAt least they're starting to use camera display while turning, that's one thing they have added... But I did not like my test drive hence I didn't buy one.\n\n  \nHate on Tesla all you want, but their driving is just generations ahead of the competition. Sealion wasn't much better, it feels worse than Model 3 from 2018 for fuck's sake. And this is the best competition in UK right now, MG, ford, Kia, Volvo/polestar are all worse to drive in than what My model 3 does and it's from 2021, virtually the same car from 2018. It's unacceptable how bad the competition is. If something happens to my tesla, I'll buy another used one because there's simply nothing better on the market. I hope it's clear I'm open minded, I have actively went out and test driven their competition. It's worse across the board.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "02bluesuperroo",
                    "body": "fReE mArKeTs",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Impossible_Angle752",
                    "body": "A $40k car sold in China is almost guaranteed to never meet safety standards in a country where they exist.",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "ShavedPademelon",
                    "body": "In any car ever (outside supercars that no one has) I've never understood 0-60 as a metric. Most suburban roads you can't go that fast. If you do it at max you use extra charge/petrol so faster acceleration costs you money. It just seems a bit silly. \n\nAre we all having Biff/Marty style drag races at every set of lights?",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "HotelPuzzleheaded654",
            "body": "It’s so over for Tesla",
            "score": 670,
            "replies": [
                {
                    "author": "Actually-Yo-Momma",
                    "body": "“Uhhh Trump add more tariffs on all EVs outside the US by one MILLION percent”",
                    "score": 366,
                    "replies": [
                        {
                            "author": "peter303_",
                            "body": "Federal buildings have turned off their charging stations too.",
                            "score": 106,
                            "replies": [
                                {
                                    "author": "MueR",
                                    "body": "Wait until they are removed. They'll be replaced with tesla branded ones.",
                                    "score": 60,
                                    "replies": [
                                        {
                                            "author": "snoogins355",
                                            "body": "Well everyone is going to NACS anyway /s",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lupercal1986",
                                    "body": "Why keep charging stations if you fire the workers..",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "mrlotato",
                                            "body": "they've mentioned a couple times before the election that their goal is to fire all gov workers and replace them with loyalists. they all ready have their conservative linked in all set up",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cookingboy",
                            "body": "Unfortunately the 100% tariff on Chinese EVs was added by Biden, in the name of national security (he’s an old guy from the Cold War era), mixed with the desire to attract union workers’ votes (which didn’t pan out at all).",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "FormulaLes",
                                    "body": "I don’t think the Chinese car companies care. 96% of the world lives outside of USA, with a decent percentage being emerging markets, where their first car might a Chinese made EV",
                                    "score": 71,
                                    "replies": [
                                        {
                                            "author": "nankerjphelge",
                                            "body": "Exactly. BYD is already the #1 EV automaker in the world. It will only continue to further smash Tesla as the global EV leader, until Tesla is just an inferior local curiosity that only Americans still drive.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "mt0386",
                                                    "body": "Other day someone was saying Tesla number one some shit. Cheapest Tesla model 3 is 35k usd and to be shipped and sold where I'm at, it goes up to 135k local currency.\n\nByd suv is popular here at a fraction of that price so yeah as per your point, Tesla ain't gone make it globally. Hell even the Indian take on EV the Mahindra BE 6 is looking far sleeker than the dumpstertruck and wayyyyy cheaper.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Dvulture",
                                            "body": "I'm not from the USA, but my understanding is that these cars are so cheap that the tariffs just bring it to the Tesla price range, so it's still doable, right?",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "CavulusDeCavulei",
                                                    "body": "No, they are not so cheap in Europe, for example, because they must reach safety standards that makes base cars more expensive than Asian and South America markets",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "Bullumai",
                                                            "body": "And Europe puts 30-40% Tarrifs on Chinese EVs to make them more expensive",
                                                            "score": 13,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rapaxus",
                                            "body": "And the US car market is unique enough that enough manufacturers, even though they could be in the US, aren't. For example all the French car manufacturers, Skoda, Daihatsu and more just aren't in the US any more since the US market demands quite specific cars that most car manufacturers don't make (pickups and SUVs even larger than anywhere else).",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "binary101",
                                    "body": "This is just the same protectionism for the US car industry for the past 40 years, it happened with EU cars, Japanese cars and now Chinese cars, it also doesn't help that any time another country is challenging the US economically, it's seen as a threat, go look up old news clips from the 70s/80s about Japan, talking about taking American jobs, stealing technology (transistors at the time), and poorly made cars etc. Literally the same thing today just replaced with China.",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "Impossible_Angle752",
                                            "body": "It's been a lot longer than 40 years. \n\nThe \"chicken tax\" was rolled out in 1964.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "CompetitiveMetal3",
                                            "body": "America likes to tell everyone else to compete harder, thinking others are too dumb to do it.\n\nThen, when it's clear others *can* compete, America turns to accusing them of stealing their knowledge. They really assume they're the smart ones, and others can only match them by siphoning their smart juices.\n\nTurns out that others are now not only matching Americans, but blazing past them. And, in true American fashion, \"compete harder\" only applies when they are winning. Else, rig the game, all dirty tricks are in.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "Tuxhorn",
                                                    "body": "Clearest example of this was bikes from Japan. Quieter, more reliable, cheaper bikes from Japan were quickly hit with tariffs because Harley Davidson came crying to the government.\n\nSo much for the free market. We're not talking about the Japanese government subsidizing Kawasaki, Suzuki, Honda or Yamaha. These were just better products in 95% of cases.",
                                                    "score": 12,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "thegooddoktorjones",
                                            "body": "There is a significant political difference between the 80s anti Japanese sentiment and foreign policy with China over the last 30 years.  Japan has never not been an ally of the US since wwii and their main threat to US car industry was that Toyotas and Hondas were way better cars that people wanted.  No actual power was being lost, just some union jobs in factories.  Chinas unpopular political situation combined with a desire to establish itself as a superpower (and why not, many humans live there) and make aggressive expansive military moves have made it much more of a threat than Japan ever has been.  Outsourcing a ton of polluting consumerism to China was great for Americans who like owning junk but it’s not the only place you can strip mine and make crap.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "nankerjphelge",
                                    "body": "It wasn't mainly national security. BYD is subsidized heavily by the CCP, so the reason they can make their cars so cheap is massive subsidies from their government, so there's no way for automakers in the US (or EU) who don't get such subsidies to compete fairly on price.\n\nThe tariff in this case was to level the playing field so to speak, since the CCP has heavily put their thumb on the scale.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "cookingboy",
                                            "body": "BYD gets no direct subsidies from the Chinese government. They are profitable on a per-car basis.\n\nChinese subsidies come in the form of tax benefits and industrial policy investment, not unlike what we have here.\n\nThe whole “Chinese government pays BYD to sells cars at a loss” is utterly made up BS that’s not supported by reality.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "nankerjphelge",
                                                    "body": "You know, you could have done a quick Google search before responding to know that what you just said is wrong...\n\nhttps://electrek.co/2024/04/12/china-gave-byd-an-incredible-3-7-billion-to-win-the-ev-race/",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "cookingboy",
                                                            "body": "The author never provided any evidence to their claim, and even if that claim is true, the total amount is less than BYD’s profit for last year alone.\n\nWhich is to say the whole point is moot.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "nankerjphelge",
                                                                    "body": "The article literally linked to the study conducted by Germany showing the subsidies 🤦\n\nYou could choose to quit now while you're behind, but somehow I suspect you're going to keep doubling and tripling down on being wrong here, so I'm going to leave this conversation. If you're really interested in real facts and data, Google is your friend. Goodbye.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DagNabs",
                                    "body": "The tariffs on Chinese EVs are arguably warranted due to the fact that the chinese government has heavily subsidized production of these EVs, which allows them to (substantially) undercut american manufacturers who would not be able to compete with the chinese brands. If we bring in their EVs with no tarrifs, sales, production, and ultimately jobs for American manufacturers would nose dive (unless the feds start subsidizing the production, which won't happen). \n\n  \nI'm not necessarily defending it, but that's the line of thinking as I understand it at least.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MrPloppyHead",
                            "body": "The problem the US and the west has is that china controls most of the minerals required for new technologies. This makes the west more vulnerable to China as things like EV become more essential to the running of economies. This is why trump is on the one hand say, fossil fuels are the future whilst at the same time trying to steal Greenland. \n\nBut rather than pissing off the entire world he should be doing what China has done with Africa and woo countries rather than pissing them off. The west also needs to invest in r&d so that we are not so reliant on these minerals.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "riperamen",
                            "body": "“You got it boss”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Flashy_Ad_6345",
                    "body": "Not just Tesla, all EV companies that aren't in a JV with a big Chinese EV company is gonna cook in the coming years...",
                    "score": 44,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "Solusham223",
                                    "body": "your source even states Tesla & Toyota what's your point of every EV manufacturer is using the aluminium then why the price diff",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Solusham223",
                                                    "body": "Again what in the documents you're providing shows Tesla doesn't follow the same practice. Tesla is one of the largest EV car manufacturers are you telling me they don't purchase any of the lithium from them???",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Solusham223",
                                                                    "body": "that argument can only be raised if you know for certain that Tesla or other manufacturers aren't following suite. since your original statement was they can make it cheap because of the force labour hencefor it begs the question is Tesla free from these force labour claims",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[deleted]",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Solusham223",
                                                                                    "body": "are you saying Tesla manufacturing in China isn't exporting to other region?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "fufa_fafu",
                                    "body": "This is absolutely idiotic. Car factories in China are mostly automated. Not only that, EVs have 100x less moving parts than a gas engine, so they don't need massive linear assembly lines like gas cars do. So having \"forced labor\" is actually a burden lmao. This is cheap stupid propaganda that doesn't even make sense.\n\nWanna know why EVs are cheap as hell in China? Because their government actually cares for the industry - Chinese automakers have insane levels of vertical integration of ALL components, and they enjoy massive subsidies. Sounds like a western skill issue to me.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "fufa_fafu",
                                                    "body": "There is no \"proof\" at all in your link. Maybe actually [read the HRW report.](https://www.hrw.org/report/2024/02/01/asleep-wheel/car-companies-complicity-forced-labor-china)\n\n> Independent field research on labor transfers in Xinjiang is not currently possible due to Chinese government restrictions across the country and within Xinjiang specifically. However, Sheffield Hallam University and NomoGaia, a nongovernmental organization, and Horizon Advisory, a consultancy group\n\nHorizon Advisory is a consultancy group staffed by Foundation for Defense of Democracies, a neocon Republican think tank controlled by the US government. NomoGaia writes the US \"National Action Plan for human rights\". Find an independent source next time.\n\nFurthermore, automakers like VW/SAIC [have audited their plant in Xinjiang](https://apnews.com/article/china-volkswagen-xinjiang-uyghur-forced-labor-c505dac48bebe92b6f792bafdaae61f9) and found no evidence of forced labor. \n\nIn any way, your original statement is moronic regardless, because it only mentions aluminum, which doesn't even make up 5% of the costs of an EV, and therefore has negligible impact on its price after all.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "UndocumentedMartian",
                                            "body": "The slave labour is in their aluminium supply chain. Not the car factories. Regardless, I wouldn't take a country built on slave labour seriously. They're just malding that their slave labour didn't do as well.\n\nThe report that the other guy linked is from Human Rights Watch which is a decently credible source. \n\nPs: Slavery is horrible.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "Repulsive-Ad-8558",
                                                    "body": "I don’t take the US seriously either.",
                                                    "score": 14,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Wizzinator",
                                                    "body": "Slavery is horrible. But are you suggesting the US was/is not also built on slave labor?",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "JakeEaton",
                                                    "body": "Aren’t all Western nations built on slave labour in some way or other? Seems like stones in glass houses to me.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "fufa_fafu",
                                                    "body": "It's not. See my reply to OP.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Flashy_Ad_6345",
                                                    "body": "If you hate slavery, you should boycott Walmart and 7-11 or any convenience store chains. Last I heard, people were working 3 jobs to pay rent, that sounds like good ol' slavery, working 80 hours a week. Hmm... What you gonna do about slavery in the US?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "UndocumentedMartian",
                                                            "body": "Maybe hope that Americans sort it out. Maybe tone down their obsession with capitalism. I've got my own problems. Are you American? Have you done anything about it?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Flashy_Ad_6345",
                                                                    "body": "I'm not American, I'm from Asia, and we're doing okay. The recent one is Tibet practice slavery even after world war 2. Luckily China stopped them from continuing slavery and brought civilization to them.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "StKilda20",
                                                                            "body": "Tibet never had slavery…brought civilization to them? This is the thinking responsible for why China hasn’t won over Tibetans.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ambustion",
                                    "body": "Meh on my hierarchy I'll be honest, the country trying to invade me doesn't get much grace. I'd prefer China didn't use these people but if they ruin whatever plans musk and trump have, so be it. We can go back to fighting for human Rights abuses like we always do when our sovereignty isn't on the line.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -10,
                                    "replies": []
                                },
                                {
                                    "author": "UndocumentedMartian",
                                    "body": "That's a credible report. But the Uyghur labour is in the aluminium supply chain. Everyone mines aluminium and it's very cheap. Slave labour, which is still abhorrent, has nothing to do with the technological advantage they're quickly gaining. Maybe actually refer to your sources.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mo_Jack",
                    "body": "BYD already has a 100% tariff on them in the US. They have a pickup truck they are going to start selling internationally outside the US. Some of their biggest investors are Warren Buffet, BlackRock, Vanguard, Fidelity and many other US firms. It may be over for the US car industry as a whole if these technological leaps keep happening.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "cspinelive",
                            "body": "They also make electric busses and commercial trucks in the US. ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Gapping_Ashhole",
                                    "body": "I thought the BYD bus facility is actually in Canada.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "cspinelive",
                                            "body": "Lancaster, California\n\n[https://en.byd.com/news/byd-produces-400th-bus-in-lancaster/](https://en.byd.com/news/byd-produces-400th-bus-in-lancaster/)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Gapping_Ashhole",
                                                    "body": "Ohh, TIL. \n\nThank you.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tsarstruck",
                            "body": "I'm skeptical that broad-based index fund investment in a publicly listed company means much of anything.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ambustion",
                    "body": "Some idiot below conveniently nuked his comments when I brought up however bad China is, I'm going to support whatever actions or businesses are not propping up the government threatening to invade my country. I hope musk loses everything, and somehow the American people wake enough other citizens up to stop this madness before we lose Canada.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "Cirenione",
                            "body": "Yeah, I am also not a fan of Chinese cars and especially the Chinese government pumping billions into their industry to undercut the rest of the world. I want to see Tesla fail but as it is right now I also dont want Chinese companys succeed based on price dumping everyone else.",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "Ambustion",
                                    "body": "I think unless we get some very good trade deals going with Europe, vehicles are going to be out of reach for most Canadians, and that will be a huge paradigm shift given how sprawled we are. Believe me, I'm not exactly excited about this development but y'know lesser of two weevils or whatever.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Bullumai",
                                    "body": "China was the one that made things like Solar cells affordable and cheap. What's wrong with Chinese government subsidising the green energy & green tech sector? USA also subsidized Tesla",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Cirenione",
                                            "body": "My country (Germany) was the leading producer of solar and leading in terms of innovation driving prices down. Then the Chinese government pumped billions into their solar industry. They managed to dramatically undercut the prices on international markets which led to the death of our solar industry.  \nSubsidies are normal. Subsidies with the goal to be able to sell dramatically under production cost in order to beat foreign competition to the point of running them out of business isnt.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Metalsand",
                                                    "body": "> My country (Germany) was the leading producer of solar and leading in terms of innovation driving prices down. Then the Chinese government pumped billions into their solar industry. They managed to dramatically undercut the prices on international markets which led to the death of our solar industry.\n> \n\nI mean, two things here though.  As you said, China has pumped billions into their solar industry - but not subsidization, rather research and development.  They've been the top leader in renewable energy development for a long time now.  \n\nSecondly, they have a competitive advantage of being on the world's biggest and most accessible source of rare earth minerals.  \n\nIt more than makes sense for them to have overtaken everyone else in solar production in particular, considering this fact.  They do subsidize some industries to a degree, but the biggest challenge for other countries is just that their production capacity is so dang huge.  To put it into perspective, 1.4 billion population in China and Germany has 83 million.  For the sake of comparison, let's say normal production of solar panels uses 5% of the population to produce a number of panels to fulfill domestic needs or 4.15 million in Germany and 70 million in China.  Increasing production rate of panels in China by 20% would produce an additional 14 million, which would fill Germany's needs 3 times over.  Yet, Germany would have to dedicate their entire population to producing solar panels in order to do the same.  \n\nMy point being, large countries don't...actually need to subsidize their products in order to accidentally drown out domestic production.  Their size alone means that they need only slightly increase production to absolutely dominate foreign markets if it's something they are good at.  \n\nUSA hesitancy towards China is largely grown out of this happening in the Clinton years, when tariffs were suddenly lowered on China, and unlike with Japan or Korea, China's production capacity was on par with our own, and they were actually able to provide enough of a given product to choke out domestic production, when this wasn't possible before.  A lot of people remember losing their jobs, and aren't too thrilled out it.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Cirenione",
                                                            "body": ">I mean, two things here though. As you said, China has pumped billions into their solar industry - but not subsidization, rather research and development.\n\nExcept they did pump billions into undercutting prices. They also put money into research, of course, but that wasn't what pushed Germany out of solar and it also wasnt production capabilities. Otherwise Germany also wouldnt be one of the biggest players in the car industry. But when China decides to pump billion after billion into their industry to massively undercut other countries to the point of selling modules at half the production price in other countries then that isnt a free market situation any longer. There is a reason why the EU has also put up a lot of tariffs on Chinese products in fields where it's know that Chinese companies can only sustain their price point because the Chinese government is paying for it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "TossZergImba",
                                                                    "body": "Oh no, China made solar energy so cheap and abundant that anyone can buy them! So evil and cruel of them! How dare they! \n\nMaybe the question you should be asking is why your government didn't invest in making solar energy cheap, instead of criticizing other governments for doing something that's clearly good for the planet.\n\nNot to mention what you said isn't even true. China didn't subsidize solar power because they wanted to undercut others, they did it because the 2008 financial crises dropped demand heavily for solar so the government stepped in to save the companies and their jobs. Germany didn't bother to do that for their own companies (like Solon, Q Cells), so when the economy recovered, guess who was around to fulfill the demand again? \n\nDon't blame China for Germany's stupidity in refusing to support the solar industry. \n\nhttps://chinafocus.ucsd.edu/2021/02/16/solar-energy-in-china-the-past-present-and-future/",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "smoothtrip",
                                    "body": "If the US wanted to be competitive, they could have pumped billions into EVs made by US manufacturers too.  Besides the tax credits the US offers, they are currently trying to be the the most polluting country per capita.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Cirenione",
                                            "body": "Well, I am not American and dont care about their economy. I do care however how Chinese companies manage to run whole industries out of business by undercutting competition thanks to huge subsidies by the Chinese government.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "blastradii",
                                                    "body": "You do know that most countries have governments pumping money into key industries including subsidies right?",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "An_doge",
                    "body": "China is going to smoke the US on next generation tech. And they’ll steal whatever they don’t get ahead in, like ai. US barely has access to the minerals needed. Throwing so hard rn",
                    "score": 23,
                    "replies": [
                        {
                            "author": "smoothtrip",
                            "body": ">And they’ll steal whatever they don’t get ahead in, like ai.\n\nAs opposed to the American AI companies being sued for being thieves lol",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "An_doge",
                                    "body": "That's just because they're the motherland of IP, too. China has never cared about IP lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "notbadhbu",
                            "body": "I'm so pumped about it honestly. I thought the world would just stagnate. So glad to see someone is making the rest of us look like shit, maybe we will get our act together",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "dronz3r",
                            "body": "Time to buy hstech",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Impossible_Angle752",
                            "body": "North America, I can't comment on Europe, hasn't produced anything of value in the last 40 years and we couldn't innovate ourselves out of a paper bag at this point. \n\nNeo-liberal conservatism sold us out in the 80s and now we're so far behind it's all but over.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Bullumai",
                            "body": "Wait, if they steal American IP and Americans can prove it, they wouldn’t be able to sell their products outside of China in markets like the EU, North America, and the rest of Asia, right? American companies could sue them.\n\nJust like how an American company once tried to patent basmati rice and a variety of turmeric that were already available in India—but lost the case.\n\nI mean Patent & IP laws might not work inside China, but they do work in other countries right ?\n\nLike China can't sell rip off Nintendo products in USA or EU.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "AppleSlacks",
                                    "body": "Have you ever seen any devices on Amazon that play old roms?\n\nHave you never looked?  There are plenty of Chinese products, listed on Amazon that come preloaded with thousands of old games, owned by Nintendo and whoever else.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Gapping_Ashhole",
                                    "body": "Those countries like the US can make up something like national security to keep competition out. Canada did that with the US back in Oct with the Biden admin to keep out Chinese EVs with 100% tariffs.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "generalright",
                    "body": "I hate Elon Musk, but I’m pretty sure BYD is the supplier of Teslas batteries anyway. In either case, new tech is always adopted by rivals so I doubt this will have a negative impact on companies. Rather it’ll elevate the whole industry as it’s adopted by the brands.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Scigu12",
                            "body": "Im pretty sure Tesla is supplied by CATL.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Flipslips",
                                    "body": "Tesla is supplied by multiple companies. They build some in house, buy LG, Samsung, CATL, and BYD batteries.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "blackkettle",
                    "body": "My mom, who’s a dyed in the wool liberal and has owned an electric vehicle for the last 8 yrs or so recently told me she’s switching back to gas.  What sealed the deal:  she went to pick up her sister at SFO - a 2hr drive - and said the lack of easy to find chargers - in San Francisco mind you - was just too much hassle and too much cause for anxiety.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "GeneralPatten",
                            "body": "Hybrid would probably be a better choice",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "thelangosta",
                            "body": "We could have pushed so much harder on a national charging network but big oil still has plenty of money to spend in Congress. That and people don’t like change",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "odd84",
                                    "body": "Biden got that done. Part of the 2021 infrastructure bill he passed was $7.5 billion for a National Electric Vehicle Infrastructure Program (NEVI). It was just getting off the ground when Trump froze all \"green\" funds. NEVI would have put fast charging stations every 50 miles along every major travel corridor in the country.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "blackkettle",
                                    "body": "I mean they are literally tearing up federal stations that are already installed and working - so it’s even worse if you ask me.  I told I definitely couldn’t blame her.  She’s 75 and while pretty tech savvy that’s a lot of unneeded stress.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Explicit_Tech",
                    "body": "It's been over. So many better options now.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Justagoodoleboi",
                    "body": "Except byd will simply be banned from selling cars here. Telsa is working on a protection game here",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mastermind1228",
                    "body": "Does BYD sell cars in the US?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "scorchgid",
                    "body": "they need to have a larger market share.on chargers that can reach that limit. This is just showing they can, not.that it will work",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "el_guille980",
                    "body": "its always been so over for SHITsla... just that now the facade is **really** finally off...\n\nand now everybody sees what i have **always** seen/known 😎 never fooled by enron muskkkie, never hoodwinked😎 never drank the SHITsla koolaid😎\n\nyes, i am that c😎😎l",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JMurdock77",
                    "body": "Maybe he’ll expand his consumer base again with some more “Roman salutes?” Oh wait, unless Teslas become capable of rolling coal the MAGA crowd ain’t into them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ProfessorGinyu",
                    "body": "Maybe. But it will still remain the legendary car company that basically made ev mainstream.\n\nLike the model t of our generation.\n\n\nSo many parallels too. Problematic owner. Worker rights issues.  But still a legend",
                    "score": -16,
                    "replies": [
                        {
                            "author": "GeneralPatten",
                            "body": "I don't understand why you're being downvoted. I loathe Musk with every ounce of my being. Teslas have become dull and boring (or, downright hideous in the case of the Cybertruck). Their build quality and reliability ranks among the lowest of all car manufacturers. There are simply so many better options for EVs/hybrids now.\n\nThat said, Tesla absolutely revolutionized and mainstreamed EVs — in every way. Marketing, excitement, performance, style. I still have the first article I ever read about the  (1st gen) Roadster a new EV company called \"Tesla\" was coming out with. I was downright giddy that someone was FINALLY coming out with a modern, hot looking, high performance electric car. I told anyone who would listen about it, and how damned brilliant it was for this Musk guy to target the luxury, performance market. \n\nThen came the Model S. It looked and performed like no other family sedan on the market. It even broke the NHTSA crush testing machine on its way to scoring the highest safety rating ever handed out for a passenger car. When Musk announced that Tesla would make their patents open to the public — free to use — in 2014, it was absolutely revolutionary for the industry.\n\nAll this makes the company's decline — which, IMHO falls squarely on Musk — nearly as historic as its rise.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ProfessorGinyu",
                                    "body": "Because reddit is a western left wing cesspool. No different from what they say about their right wing counterparts.\n\nWe see through you guys.\n\n\nAs for your comment, sure, it fell off and rightfully. But it will always be remembered as the Model T of EVs. Maybe even bigger than Model T if EVs fully take over the world.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "GeneralPatten",
                                            "body": "Personally, I enjoy being part of a left-wing cesspool. It's fun knowing you're on the correct side of history.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "_suburbanrhythm",
                            "body": "Growing up in America pretty much the car that is synonymous with being the first ev is the Prius. ",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "tacobellbandit",
                                    "body": "I think he means popularized the idea of an EV. A lot of people consider the Prius to be dull, underpowered and kind of ugly. Earlier tesla made cars that were affordable and more stylized instead of the default concept that an EV has to look like a euthanasia chamber on wheels",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ProfessorGinyu",
                                            "body": "Pretty much this. \n\nI don't think non Americans understand just how much of the world thinks than ev= tesla.\n\nHere in India, all the native car companies started making evs well after tesla was basically the default name for EVs here.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "OldLondon",
                                    "body": "I’d also go Nissan Leaf before TeSSla",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "ProfessorGinyu",
                                    "body": "Expand your search. In india, china and much of Asia and Africa, EV = tesla, even now.\n\nSo much so that local car companies are trying to copy it as much as possible",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "smoothtrip",
                            "body": "The model T of our generation lol, unless Teslas are flying cars, it is nowhere as significant as the model T lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "iamtehryan",
                    "body": "God I hope so. The less of those ugly ass shit wagons I have to see the better.",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "NovelStudio565",
                    "body": "Until they announce their own version and it’s not. Plus, they just don’t work only on cars anymore",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jabber-Wockie",
            "body": "Trump will put an eleventy billion percent tariff on BYD to stop his mate Elon going bust.\n\nAnd it won't work.",
            "score": 106,
            "replies": [
                {
                    "author": "usedToStayDry",
                    "body": "Trump/Elon will brand you a domestic terrorist if you don’t buy a Tesla, better not risk it",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "francohab",
                    "body": "You can't buy chinese cars in US anyway, don't you?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Trenavix",
                    "body": "People will just stop buying cars I guess.\n\nWhy do you think he's obsessed with holding any federal aid to public transit projects?\n\nNobody wants the $100k dumpsters on wheels for sale. Thankfully a lot of states are funding their own regional transit so cheeto man and muskrat can go screw themselves.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mojo141",
            "body": "This is the company Tesla was supposed to be. What they could have been and were poised to become and what their ludicrous stock value was based on. BYD is the future and it's only a matter of time before they become huge in America too",
            "score": 30,
            "replies": []
        },
        {
            "author": "thegooddoktorjones",
            "body": "I have seen good arguments that the next war will hinge on drones and battery tech.  Good thing America chose an old asshole who hates windmills for no apparent reason and is sabotaging our entire science and tech pipelines.  The US is committing suicide by cult.",
            "score": 45,
            "replies": [
                {
                    "author": "glacialthinker",
                    "body": "> an old asshole who hates windmills for no apparent reason\n\nThe \"reason\" supposedly is that some particular wind turbines ruin the view from his golf-course. Therefore, they must all be hated.\n\nSo, yeah, lacking *reason*, and rather being an emotional grudge. Great leadership trait. :/",
                    "score": 7,
                    "replies": [
                        {
                            "author": "GuaSukaStarfruit",
                            "body": "Wind turbines depends on wind heavily. In the end, nuclear is the best option.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "baltosteve",
            "body": "While in America Trump is pushing coal powered steam vehicles.",
            "score": 21,
            "replies": [
                {
                    "author": "SteveBeev",
                    "body": "I hear you can hitch wagons to horses and ride them places! Bring back the horse travel industry!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hazelholocene",
            "body": "and we ban byd in canada why? lmao",
            "score": 48,
            "replies": [
                {
                    "author": "evilJaze",
                    "body": "Because our integrated auto manufacturing sector is lockstep with the USA and we go out of our way to protect those jobs so that we can all spend a goddamn fortune on cars made domestically.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "sniffstink1",
                    "body": "To bootlick America. At the time we banned it we didn't know yet that the US was a hostile regime bent on destroying us.\n\nFast forward to today: that ban needs to be lifted.",
                    "score": 66,
                    "replies": [
                        {
                            "author": "hazelholocene",
                            "body": "Yeah this exactly. We should've never neglected individual income stagnation, while only protecting corporate interest during globalisation, but hey that's just a theory. A geopolitical theory.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "CptCrabs",
                            "body": "It's not America's fault just the fat orange man and his minions. China will never be an ally or do anything to help canada. Hold your breath for 4 years maybe lol",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ezbior",
                    "body": "Because only america gets to sell cars >:(",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Highway_Wooden",
                    "body": "These cars would not be the same price if they came over to the US/Canada.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Impossible_Angle752",
                    "body": "Because if nobody has jobs, then they can't afford to buy anything.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "crazyeddie123",
            "body": "**Now** can we drop social promotion and actually educate our people?",
            "score": 5,
            "replies": []
        },
        {
            "author": "TheAlPaca02",
            "body": "Fantastic tech demo for sure, but these speeds are only achieved by charging at a rate of 400 to 600 kWh, with peaks up to 1 MWh (!!). A widespread roll out of the necessary charging stations to facilitate these rates, and the necessary infrastructure changes to, in turn, facilitate these the charging stations, will take a looong while still. At least in the EU and US.\n\nHell, here in Europe we are seeing current brand new fast charging stations with rates up to 300 kWh struggling to actually deliver up to 300 kWh when multiple cars are pulled up to a station and charging at the same time, simply bc the grid cannot deliver the required power. Especially next to high ways during holiday periods. And thats often after changes to the grid have already been made to facilitate the charging station...\n\nI'm all for what BYD has developed here. But unfortunately we have to be realistic. it'll be several years before we can take advantage of this tech en-masse.\n\nSee demo of the charging process with charging power over time;  \n[The EV That Charges as Fast as a Gas Fill-Up! 1,000 kW BYD Megawatt Flash Charge](https://www.youtube.com/watch?v=JOL2XSaYB8c)",
            "score": 35,
            "replies": [
                {
                    "author": "mr_poopie_butt-hole",
                    "body": "BYD is huge in mainland China though, and if anyone can push out massive infrastructure projects quickly it's the Chinese. As an example their high-speed rail.",
                    "score": 55,
                    "replies": [
                        {
                            "author": "CptCrabs",
                            "body": "You misspelled japan",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "TheStormIsComming",
                            "body": "> BYD is huge in mainland China though, and if anyone can push out massive infrastructure projects quickly it's the Chinese. As an example their high-speed rail.\n\nQuick massive infrastructure high speed project push out and safe. Wait, you didn't mention \"*safe*\".\n\nWhy does that make me feel nervous.\n\nWhen I think of high speed and safe, I think of Japan. For bonus points they also have themed trains, like Hello Kitty.",
                            "score": -42,
                            "replies": [
                                {
                                    "author": "mr_poopie_butt-hole",
                                    "body": "There's no indication that it's unsafe in any way. I think most places just end up wound up in endless bureaucracy. It's worthwhile looking into California vs China in the development of high-speed rail. They both decided around the same time to develop it. California has gone basically nowhere in 10 years because no one can decide how they want to start.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "smsrelay",
                                    "body": "The pure ignorance of this post. You certainly hasn't read anything meanful in the past 15 years",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "hlxino",
                                    "body": "I guess someone hasn’t been up to date for the past 20 years…",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cookingboy",
                    "body": "> it will be several years \n\nNope, they are shipping these in consumer cars starting **next month**: https://carnewschina.com/2025/03/17/byd-han-l-ev-and-tang-l-ev-1086-hp-started-presales-in-china-for-37300-usd/\n\nBYD is gonna build 4000 stations with this tech apparently.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "TheAlPaca02",
                            "body": "In China maybe, but in the Europe or US widespread roll out will take several years.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Lamuks",
                                    "body": "Europe and USA ar tariffing the cars, no chance whatsoever",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "n0rthern_m0nkey",
                                            "body": "No tariff on Chinese EVs in the UK...yet.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ksoss1",
                                    "body": "It's still impressive, even if it's only in China. Plus, this is great for the brand, even in markets where the technology isn't available yet. It positions them as a leader, and when it comes to expensive purchases, people naturally want to associate themselves with the best.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "polyanos",
                            "body": "Well, that they are going build the stations is one thing, but their infrastructure also need to keep up with such demand. Those local parts are the 'easy' part after all.\n\n\nBut nonetheless, I hope it works out and that China can give the EU a firm kick on their behind to go forward. ",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "WBuffettJr",
                            "body": "He’s not saying it will take several years for the cars to arrive, he’s saying it will take several years to be able to charge them as fast as they can handle because the power grid is the bottleneck.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "deantendo",
                    "body": "Rather than a direct from grid feed, could we not have large, slower charging capacitors or batteries at stations to trickle charge and then fast discharge? Same at home. A bit like a UPS for servers I suppose.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "amakai",
                    "body": "> struggling to actually deliver up to 300 kWh when multiple cars are pulled up to a station\n\n\nA hotfix could be a large enough battery buffer on the charging station itself. Expensive - yes, but would allow to somewhat circumvent the issue without redoing the underlying infrastructure.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "about0",
                    "body": "nevertheless still amazing. Even if its like 5 years away from the GA, the pressure would force carmakers to invest into EVs. Needless to say, that a famous nazi carmaker will definitely suffer from increased competitors which will deliver cheaper and better vehicles.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mortalwombat-",
                    "body": "This has been a complaint since the beginning of cars. People complained about gas powered vehicles not having a place to fuel up. I personally remember this argument when flex fuel vehicles first came out. Again when electric vehicles started rolling out. The vehicles come out first, which drives the need for the stations. Sure, early adopters have to deal with a bit more discomfort but it's never been a realistic argument against advancement.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "squarexu",
                    "body": "Also not many people know but China is I believe the only countries in the world that has completely upgraded to a high voltage electricity lines.  Not sure how related but China’s electricity grid is complete grade from rest of the world.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ElkSad9855",
                    "body": "Who we have figured out this problem a looooooong time ago with the invention of transformers and inducers. Power not reaching 300kwh has nothing to do with the chargers themselves and everything to do with the electrical service to said chargers. The only thing that limited us was safe charging at high power ratings. China “apparently” has it fixed but who knows how fixed.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Active-Pineapple-252",
            "body": "Future is now just not in America",
            "score": 6,
            "replies": [
                {
                    "author": "ksoss1",
                    "body": "And there is nothing wrong with that, especially when Americans themselves made it that way.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DeathMonkey6969",
            "body": "Pretty thin on details. My guess it's just a Level 4 1MW charger that's currently used for large electric vehicles like busses but used in a passenger car.  \n\nGoing to need water cooling for the battery and charging cable.",
            "score": 31,
            "replies": [
                {
                    "author": "cookingboy",
                    "body": "It’s actually not some prototype tech, they are shipping these in passenger cars **starting next month**:\n\nhttps://carnewschina.com/2025/03/17/byd-han-l-ev-and-tang-l-ev-1086-hp-started-presales-in-china-for-37300-usd/\n\nYep. Less than $40k, 1000hp+, 2.5s 0-60mph and 5 minutes charge to full.\n\nThey are so fucking ahead in the EV game.",
                    "score": 86,
                    "replies": [
                        {
                            "author": "UGMadness",
                            "body": "Meanwhile, the U.S. is still arguing over whether the new 250 mile range $75k+ Dodge Charger EV makes convincing fake vroom vroom sounds.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "Last_Minute_Airborne",
                                    "body": "The American market isn't nearly as subsidized by the American government as the Chinese market is. And BYD uses robots to build the entire car. No paying unions or workers to worry about. A lot easier to innovate and mass produce there. \n\nDodge is trying to match their current market of buyers for the charger. Dude bros who make their car go vroom vroom loudly to cure their ED.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "dont_talk_to_them",
                                            "body": "Yea but that's not China's fault, that's failed US policy. we allowed lobbyists to sway our leaders away from EV innovation, so now China is leading the pack.",
                                            "score": 13,
                                            "replies": []
                                        },
                                        {
                                            "author": "tacobellbandit",
                                            "body": "It would be nice if domestic manufacturers didn’t feel the need to make a concept vehicle an EV, and then slap either an older “fan favorite” model name on it or call it the muscle car model name + “electric” or “lightning” or something. Dodge did that with the hornet. I wasn’t alive for the times when the Dodge Hornet was popular, so the target audience is older people, who are going to get in that thing and realize “hey this isn’t anything like a Dodge hornet”. Same with me, I wasn’t very well off growing up so I took whatever car I could buy for dirt cheap. One of those was an older fox body Mustang and it ended up being one of my favorite shit boxes and I eventually upgraded to a 5.0 5th gen and eventually got rid of it. Go back into the car market just to see what ford has to offer, see the mustang EV, it’s ugly as hell but give it the benefit of the doubt, go to test drive, and it feels like I’m driving my shitbox CR-V",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bakfietsman69",
                            "body": "the thing I don't understand about all these EV's is, why does everyone and their dog need so much horsepower? Do you really want some 20 year old driving around with 1000hp? seems to me like these things are overpowered AF",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Sirlothar",
                                    "body": "You don't but if we really want EVs to replace gas cars, we are going to need to recreate the types of cars people buy.  \n\n\nThere is a segment of people that want their car to be fast, to be able to overtake, and if they were slower than gas cars it could be a turnoff.   Plus it's just easier to get more speed out of an electric motor.   \n\n\nNone of the EVs I'm looking at are much faster than my car and I'm ok with that.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Kawaiithulhu",
                                    "body": "Get enthusiasts on board, they talk about their cars a lot, and counter the primal ugga dugga feeling of a rumbling V8 with overpowering numbers 😀 \nSame reason for Hellcat to exist.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "dogegunate",
                                            "body": "Yea, all that horse power just to be stuck in the same traffic as someone's beat up 90's Honda Civic lol",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Metalsand",
                                    "body": "> the thing I don't understand about all these EV's is, why does everyone and their dog need so much horsepower?\n\nUnlike a gasoline engine which is largely limited in power based on the size of the engine itself, electric cars are more limited in how large the capacity of the batteries and how rapidly it can draw on it.  More batteries and range also generally make it not that much harder to add extra horsepower.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "buyongmafanle",
                                    "body": "Ride in a Tesla model 3 performance, then ride in a Hyundai Ioniq. The Hyundai is a nice car, but driving it is a chore. The Model 3 is a sporty as shit car and it responds exactly like you think it's going to. It's 100% due to the power available.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "happyscrappy",
                            "body": "No, it doesn't charge to full in five minutes. The spokesperson explained it well. There is a certain amount of range (over 300km) which can be added in 5 minutes.\n\nIt does not constitute a full charge or close to it.\n\nTo charge that fast you will have to charge starting from a very low state of charge (say 10%) and for only a short period. Charge longer or start charging sooner and it won't charge as fast.\n\nThis isn't new tech. You cannot charge a lithium ion (whether LFP or otherwise) battery to full in 5 minutes.\n\nRead your own link:\n\nThe Han L EV adopts the 1000V high-voltage platform and an 83.2 kWh LFP battery pack (the range is 601 – 701 km CLTC). This battery pack supports 10C charging via the BYD megawatt pile. It can add 400 km of range in 5 minutes.\n\nIt claims 601-701km CLTC (a very overstating test cycle) and \"only\" adds 400km range in 5 minutes. Not a full charge.\n\nAlso the AWD variant is the one that is 1000HP and it won't be less than $40K. The article gives a price range. Expect the AWD one to be at the top of the price range, not the bottom.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "DeathMonkey6969",
                            "body": ">It’s actually not some prototype tech,\n\nNever said it was. I said the linked article was low on details.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mr_Baloon_hands",
            "body": "When can we import BYDs they are apparently far superior to what we have.",
            "score": 14,
            "replies": [
                {
                    "author": "Airuknight",
                    "body": "They are… not even close. Every time I go to China I’m just like.. yeah they won the EV race",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Dangerous-Spring130",
                            "body": "Are you kidding? I've been to China 3 times 2024-2025 and ride in countless different EVs. Almost every local brand is a shitbox with nice paint",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "Airuknight",
                                    "body": "What models were they ones you rode? For sure I have had a very different experience, from ADAS to comfort they are well equipped. Don’t ask for the low end didi, go for the business one.. it’s just like 0.5usd more",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Dizzy_Humor4220",
                                    "body": "Clearly trolling",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Dangerous-Spring130",
                                            "body": "Clearly never ridden in the actual EVs on the road in China",
                                            "score": -8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Upbeat_Parking_7794",
            "body": "This would be very useful on peak season on highways.",
            "score": 4,
            "replies": []
        },
        {
            "author": "VegetaFan1337",
            "body": "Faster than swapping out the battery, I guess that is redundant now.",
            "score": 2,
            "replies": [
                {
                    "author": "Darnocpdx",
                    "body": "Unless there is a standardized industry wide battery design, it was never really a real solution.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "VegetaFan1337",
                            "body": "Sounds like something you a need a powerful centralised authoritarian government to achieve. China was doing it, I guess it's not necessary anymore. Much easier to install higher voltage charging points.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "proscriptus",
            "body": "I really want to know how many times it can do that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OneGate4953",
            "body": "First thought, Uncle Warren does it again. \n\nWhatever side of the argument you are on re Chinese tech, this is an “AI moment” for EVs. Any serious competitor/industry peer now has to show how they’re going to match or exceed the BYD benchmark.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ejsifheb",
            "body": "Even if this is smoke, we are getting leapfrogged technologically because of absolutely moronic this administration is.",
            "score": 3,
            "replies": []
        },
        {
            "author": "greywar777",
            "body": "and just like that, Tesla is crushed.  a 5 minute charge?  That is one of the huge issues for teslas is long charging times.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AcousticRegards",
            "body": "They look silly. They are too slow. They don’t have range. They are too expensive (Only in the US, they are cheap everywhere else). They take too long to charge. \n\nWhat will be the latest excuse, too quiet? Too practical? Too reasonable? Too much of a good value?\n\nThe only valid one is longevity, but time will tell, but let’s be honest, American’s cycle through cars very quickly. \n\nBTW, I credit Toyota -> GM -> Tesla -> BYD for getting us here.",
            "score": 3,
            "replies": [
                {
                    "author": "Darnocpdx",
                    "body": "The real reason, the US automakers would go bankrupt, and it'd spark massive hits against the oil/gas industries.  Likely dropping oil prices to where North American Tar sands aren't profitable.\n\nWhich would lead to catastrophic disruptions in most the rest of the economy.  Gas stations, service shops, parts stores boarded up, which would hurt commercial real estate, freight, and a slew of other obvious and less obvious industries in its wake.\n\n(I apologize, I clicked the wrong comment to reply to)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Any_Protection_8",
            "body": "Yes nice and all but who has the infrastructure to put out there 1MW chargers? They will need to build their own charging network too. Are they offering 1mw solutions? Or do they have multiple outlets? I am just wondering....",
            "score": 2,
            "replies": [
                {
                    "author": "junesix",
                    "body": "Doesn't matter who can provide a 1MW charging network today. The tech is evolving so rapidly. This kickstarts the demand side of chicken & egg problem. Soon enough, someone will fulfill the supply side.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BootlegWooloo",
            "body": "Think the interesting thing will be seeing them roll out chargers that can actually provide that power. \n\n\nEven if they do 1500V x 50A for a crazy fast charge it's 75000W. Forget residential, how many businesses have the wiring or capacity to support it?",
            "score": 2,
            "replies": [
                {
                    "author": "Tsarbomba_",
                    "body": "There's no way. This isn't some newly discovered breakthrough. The only difference is that BYD figured  it's a cheap enough PR trick to fool people into thinking BYD is innovative.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BootlegWooloo",
                            "body": "I mean it IS innovative but the rollout doesn't seem very practical unless it's new construction and you have a transformer nearby. I'd happily buy a car like this and go to for a similar \"gas station\" experience if it were easily installed on a widespread basis.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jewnadian",
                    "body": "Am I misreading this or are you suggesting that 75kW is an unreachable concept? Do you not know that the standard EA charger now is 350kW and there are 8 or more in Walmart parking lots all across the country?  My car regularly pulls 240kW while in a line of busy chargers in front of Buccees, that's a gas station not an industrial hub.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BootlegWooloo",
                            "body": "See above and previous side comment I made in this thread, maybe there is some midunderstanding. None of this is unreachable but I am commenting that this requires additional planning and may be difficult to roll out everywhere.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tom_Stewartkilledme",
            "body": "Inching ever closer to just having highways have big rainbow-colored strips on them that charge your car in seconds",
            "score": 1,
            "replies": []
        },
        {
            "author": "pessimistoptimist",
            "body": "Plot twist, it uses the leftover connector from old Anet 3d printers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chucara",
            "body": "So.. 5min charging (arguably much less in practice), 550km range, 1086bhp, 0-100km/h in 3.4, 100-200km/h in 6.2, in a roomy SUV for the price of a Skoda Enyaq entry model.\n\nI would buy this in a second if it doesn't turn out to be false. But this just sounds way too good to be true. Guess we will know in 2-3 months if they really are ready to roll them out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Seaworthiness4488",
            "body": "What's the real world diminishing life span of these super fast charging batteries?",
            "score": 1,
            "replies": []
        },
        {
            "author": "illuvattarr",
            "body": "How about the charging infrastructure? Is the grid ready for that?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Narissis",
            "body": "Every time I've talked to my dad about EVs in the last few years I've said that the real trigger for EV adoption to start skyrocketing will be a battery that charges as fast as a gas tank fills.\n\nLooks like that's arriving sooner than I thought.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mean_Photo_6319",
            "body": "My Kia has a 350kw charging platform and a 63kw battery, the most I've gotten out of any fast charger so far is 119 kwh and that charges the entire battery to its safe point of 80% in 15 minutes, so it's safe to say we already have that capability, but our infrastructure isn't there yet.  Neither is Chinas, more than likely.\n\n\nKudos to them for improving on the battery though.  The future of EV is pretty exciting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "supernovadebris",
            "body": "how's the battery feel about that?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xerceis",
            "body": "Is this using a new charging parameter? Would charging that quickly not cause concentration polarization due to the rapid charging? I’m only familiar at the ground level with how quicker charging operates. You increase voltage or current to charge faster but would charging this fast not cause a detrimental slowing of charging or damage to the battery due to forced charge acceptance by the battery?",
            "score": 1,
            "replies": [
                {
                    "author": "qualistempus56",
                    "body": "Good question I would imagine BYD is either addressing this or is negligent",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "spatenfloot",
            "body": "the US electrical grid is already in dire need of upgrades and no one wants to spend the money to do it. there's no way it could handle adding a bunch of these charging stations",
            "score": 1,
            "replies": []
        },
        {
            "author": "MosyMan80",
            "body": "I’m so angry that we can’t even have these here in the US because… reasons.",
            "score": 1,
            "replies": [
                {
                    "author": "HipsterBikePolice",
                    "body": "Free market capitalist don’t actually like competition despite their words",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "juststart",
            "body": "Remember when Tesla showcased how you could swap a battery in 20 minutes and that it would be like getting your oil changed? Even automatic! I do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Quothe-",
            "body": "Soon to be outlawed since it might be a competitor with Musk.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Phillie2685",
            "body": "OPEN THE MARKETS! STOP PROTECTING THESE COMPANIES AT THE EXPENSE OF THE CONSUMER!",
            "score": 1,
            "replies": []
        },
        {
            "author": "stickybond009",
            "body": "Note first that most of Tesla’s $7.1 billion in net income last year doesn’t even derive from selling electric vehicles, solar panels or battery storage. \n\n🪙Some $2.8 billion came from the sale of regulatory credits to other auto makers that need to comply with government EV mandates. As EV mandates have increased, so have Tesla’s profits from such credit sales.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Popular_Army_8356",
            "body": "Tesla tanking in 3,2,1",
            "score": 1,
            "replies": []
        },
        {
            "author": "zoki671",
            "body": "Its 2 chargeports right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "_mmmmm_bacon",
            "body": "Why aren't Americans leaving the US in droves to go live in countries that have real freedom?",
            "score": 1,
            "replies": [
                {
                    "author": "Cog_HS",
                    "body": "It’s not cheap or easy.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lurker512879",
            "body": "i guess that lives up to the company acronym... Bam You're Done",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crazypwner",
            "body": "Im fucking pissed we will never have BYD in the US",
            "score": 1,
            "replies": [
                {
                    "author": "cspinelive",
                    "body": "They already make busses and commercial trucks in the US. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AppleSlacks",
            "body": "Can we please have BYD in the States?",
            "score": 1,
            "replies": []
        },
        {
            "author": "GeneralPatten",
            "body": "If one were willing to pay the tariff on a BYD, could someone have one imported into the US?",
            "score": 1,
            "replies": [
                {
                    "author": "Xerceis",
                    "body": "You could have it in the US but to my knowledge you’d need a special tag for driving it or it’ll have to sit around as it doesn’t meet FMVSS and other safety standards required in the states. You’d also be paying the fees to transport the vehicle here not just the import fees.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mayank_j",
            "body": "Is BYD better than Hyundai at charging tech?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hyperion1144",
            "body": "If this is real, if it works, and if it works at commercial scale, then the end user problem is mostly solved all that remains is grid upgrades, grid hardening, and more and better maintained EV charging infrastructure.\n\nThese are significant challenges, but a nearly one-for-one replacement for standard refueling practices is a massive leap forward.",
            "score": 1,
            "replies": [
                {
                    "author": "Darnocpdx",
                    "body": "Grid updates?  They are needed but not specifically for electric cars.  Crypto mining and AI use way more power, and interestingly enough so does oil production and refinement.  The latter will go down as EV implementation rises.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Actual__Wizard",
            "body": "Okay well, that would be the final nail in the coffin of Tesla.",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_legend_of_me",
            "body": "Well I also can achieve levitation using excess amounts of Taco Bell.",
            "score": -10,
            "replies": [
                {
                    "author": "Bullumai",
                    "body": "No you can't. Something capable of levitating you, will rip your ass",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ModsCantRead69",
            "body": "*at least one time",
            "score": 0,
            "replies": []
        },
        {
            "author": "indywest2",
            "body": "I picture this killing batteries super fast.",
            "score": 0,
            "replies": []
        },
        {
            "author": "burner9752",
            "body": "Couple notes that no one seems to be making.\n\n-This is only possible in China due to there high voltage DC transmission. This wont be possible in NA or Europe without some major changes. No one is building charging stations with massive transformers and rectifiers to create 1500V dc at those current levels. \n\n-China does not use the same “EV-range” as US. They typically get about 70% of that rating in real world.",
            "score": -1,
            "replies": [
                {
                    "author": "GuaSukaStarfruit",
                    "body": "Is not just China, most part of the world don’t have these levels out of nowhere. And why people even downvote you",
                    "score": 1,
                    "replies": [
                        {
                            "author": "burner9752",
                            "body": "Because I went against the reddit hive mind…\n\nHeaven forbidden an engineer shares the actual truth about something and goes against people mob mentality… \n\nReddit used to be so much better than this…post pandemic has really gone to shit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sin_of_the_Dark",
            "body": "Atrioc is screaming somewhere",
            "score": 0,
            "replies": []
        },
        {
            "author": "vessel_for_the_soul",
            "body": "Big tariffs for them until Tesla can ~~copy~~ steal it",
            "score": 0,
            "replies": []
        },
        {
            "author": "kimmeljs",
            "body": "It's not far fetched. A 60 kWh battery charges from 400 V at 25 A in 5 minutes. The infrastructure needs to handle a slew of these cars at a go, though.",
            "score": 0,
            "replies": []
        },
        {
            "author": "kmurp1300",
            "body": "How did BYD become the world leader so quickly?",
            "score": 0,
            "replies": [
                {
                    "author": "WelshWarrior",
                    "body": "They didn't really, they've been building batteries for the best part of 20-30 years and cars for the over 10. The real question is why didn't anyone outside of China invest meaningful in battery tech when it was so likely to be integral to our net zero transition (which regardless of you political leaning was going to happen at some point in the next 20-30 years, the question was just how quick and how many people were going to have to die before we decided to transition)",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Flipslips",
                    "body": "The Chinese government gives them billions and billions of direct cash infusions.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Many-Ad9826",
                            "body": "So, like, tesla?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Flipslips",
                                    "body": "Tesla gets the same amount as any other US EV manufacturer. They only get the tax subsidies, not straight cash from the government",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "junesix",
                            "body": "So does every government, directly or indirectly. BYD is not unique, even among Chinese EV companies.\n\n\\* Consumer EV subsidies (benefits all Chinese EV manufacturers) -- same as US IRA  \n\\* R&D grants on EV battery tech (similar to CATL) -- same as US IRA  \n\\* State-backed bank loans (benefits all Chinese EV manufacturers, BYD prob gets bigger loans matching their volume/revenue) -- same as US IRA  \n\\* Cheap land for factories -- same as US states  \n\\* Charging infra subsidies -- same as US IRA  \n\\* Tax breaks on sales & factories -- same as US states and US IRA  \n\\* Government procurement -- same as US IRA\n\nUnless you have some evidence of direct cash infusions.\n\nA bigger key difference is Chinese government signals their overall investments in EV and battery tech a decade in advance and sticks to it. So whole industries can invest deeply in the sector without fear that the entire financial apparatus and policies will disappear. Unlike US manufacturers having to deal with money sources drying up or changing economic policies every few years.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Apprehensive-Stop748",
            "body": "Batteries are very exciting area of technology. They are a multidisciplinary area of research and if you look at the literature in improves regularly and steadily.",
            "score": -6,
            "replies": []
        },
        {
            "author": "griffonrl",
            "body": "Meanwhile Tesla are burning.",
            "score": -3,
            "replies": []
        },
        {
            "author": "No-Buy9287",
            "body": "BYD is the fascist run corp that everyone says Tesla is yet people here are gushing over the products. No boycott over BYD cars I assume",
            "score": -4,
            "replies": [
                {
                    "author": "Quagmire70",
                    "body": "Communism is not Fascism just sayin.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "No-Buy9287",
                            "body": "China is communist in name only",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "GuaSukaStarfruit",
                            "body": " China is not communist, if China invades Taiwan, will you still buy Chinese products?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "googleinvasive",
            "body": "Some chinese cars are made with cardboard outer shells.",
            "score": -9,
            "replies": [
                {
                    "author": "Bullumai",
                    "body": "CCP bots are downvoting you for being correct. So take this king 👑",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "PrussianHero",
            "body": "Big if true",
            "score": -1,
            "replies": [
                {
                    "author": "uspezisapissbaby",
                    "body": "They start shipping next month. I'd call it true.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "EducationallyRiced",
            "body": "Isn’t byd a Tesla clone from wish / china?\nThat Instant charge has to be the most scuffed and unsafe shit ever",
            "score": -1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -10,
            "replies": [
                {
                    "author": "skubasteevo",
                    "body": "Imagine not",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "vortexnl",
            "body": "Anybody can charge a battery fast... The challenge is making a battery last, and is there data on this? If your batteries die after 4 years, you're absolutely screwed.",
            "score": -2,
            "replies": [
                {
                    "author": "GuaSukaStarfruit",
                    "body": "You will only knows after years. Or maybe they expect you to switch the car every few years to keep the economy rolling",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "vixalien",
            "body": "am I the only one wondering what the catch is ?",
            "score": -3,
            "replies": [
                {
                    "author": "Whitewind101",
                    "body": "Made in China, that's the catch it's a tofu dreg car",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheStormIsComming",
            "body": "High voltage in the hands of the consumer. Should end well. \n\nEven car mechanics are afraid to work on these things. Then again, mechanics hate anything electrical. And airline pilots don't like these batteries in their cargo freight.\n\nYou should measure the EM radiation emitted by EVs. It's massive. It's not healthy to sit in that for long periods if it's your job.\n\nAs for driving an EV through water, considering lithium is water reactive. That wouldn't be my idea of fun.",
            "score": -34,
            "replies": []
        },
        {
            "author": "badgersruse",
            "body": "Don’t forget how EVs attract sharks when you are in the mountains!",
            "score": 25,
            "replies": []
        },
        {
            "author": "TheStormIsComming",
            "body": "> Don’t forget how EVs attract sharks when you are in the mountains!\n\nSold me on sharks on a mountain. 🎭\n\nImagine a sharknado.",
            "score": -2,
            "replies": []
        },
        {
            "author": "sniffstink1",
            "body": "Yeah but if you take those plugs that you put in every single electrical outlet of your house to to stop all that EMF radiation from coming out, and you just put like 1 or 2 of them in the USB outlets and accessory outlet then none of that EM radiation enters the passenger compartment. It all stays outside. Those plugs will keep you safe in there bro.",
            "score": 0,
            "replies": []
        }
    ]
}