{
    "title": "Over 400 celebrities sign letter opposing AI training on copyrighted works without permission",
    "author": "MetaKnowing",
    "subreddit": "technology",
    "rank": 17,
    "score": 134,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.techspot.com/news/107188-over-400-celebrities-oppose-ai-training-copyrighted-works.html",
    "id": "1je93qp",
    "selftext": "",
    "comments": [
        {
            "author": "FreddyForshadowing",
            "body": "If they really want to get their message through, create a deep fake video of Trump admitting to a lot of illegal shit like molesting Ivanka as a kid, raping E. Jean Carrol, and working as a Russian asset for decades. He'll go into full on panic mode and do everything he can to keep that sort of thing from happening again.",
            "score": 36,
            "replies": [
                {
                    "author": "selfdestructingin5",
                    "body": "Idk if that is valid. They had a law proposed to ban deepfake porn that everyone got upset about. Remember? \n\nDeepfaking a person and using copyrighted work to train AI is different but obviously related because of “AI”.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Evalo01",
                    "body": "What the fuck is wrong with people in this subreddit lol",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "thiccboikab",
                    "body": "You think trump will let them get away with it?",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "RectumBandit",
                    "body": "This is why y'all lost the election.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "Facts_pls",
                            "body": "Oh yeah. The democrats lost because they famously play dirty. Totally.\n\nNot sure what reality you are on",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "FreddyForshadowing",
                            "body": "Apology accepted",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fellipec",
            "body": "Sure they will take that in consideration in Shanghai",
            "score": 4,
            "replies": []
        },
        {
            "author": "Notmywalrus",
            "body": "AI Training is IP theft without consequences",
            "score": 12,
            "replies": [
                {
                    "author": "ithinkitslupis",
                    "body": "Unfortunately I think that ship has already sailed. Removing all IP would make shit models that don't compete with models from other countries that don't remove IP. Countries don't want to be at a disadvantage like that.\n\nWhat might be more interesting is the copyright on the other side of AI, works produced by AI. If laws/courts decide to take stricter approach that most works using genAI aren't copyrightable a lot of corps might avoid using it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrowFreeFood",
            "body": "But if you break up that work into its structural elements, it becomes common tropes and memes. So where are you prepared to draw the line between original idea and a reskin?",
            "score": 2,
            "replies": []
        },
        {
            "author": "RebelStrategist",
            "body": "Isn’t this response from the “celebrities” a little behind the times?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Caninetrainer",
            "body": "A signed letter should work fabulously",
            "score": 2,
            "replies": []
        },
        {
            "author": "anomalou5",
            "body": "The entire country of India signed a letter in opposition to this letter.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Edzard667",
            "body": "I see these people didn’t live in the same world like us if this is their biggest problem in the US right now.",
            "score": 4,
            "replies": [
                {
                    "author": "Facts_pls",
                    "body": "It's their livelihood and entire industry.\n\nYou would give a fuck too if your entire industry was being easily replaced by AI in front of your eyes using your work.\n\nThis is much more severe than placing any tariff and those people are talking about it everyday.\n\nI think you don't see their work as their profession. You think they just be having fun out there.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Frostemane",
            "body": "Oh no, not the poor celebrities!",
            "score": 9,
            "replies": []
        },
        {
            "author": "atampersandf",
            "body": "This is the hill they choose right now?  I mean freedom and liberty and all that, but AI?  I agree with them, but maybe use your voices for something a bit .. bigger.",
            "score": 4,
            "replies": [
                {
                    "author": "jerrrrremy",
                    "body": "Two AIs? ",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "knowledgebass",
                    "body": "You know that people can support more than one cause at the same time, right?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CompromisedToolchain",
                    "body": "They didn’t say shit about training on social media or anyone who isn’t getting paid for their likeness. Florist upset at rise of cheap flowers.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sniffstink1",
            "body": "Petition. How cute.\n\nWhat they really need to be doing is launching a class action against META and OpenAI (and include any other AI company that trains it's shit bots for free by leeching off of the intellectual property of others).",
            "score": 2,
            "replies": []
        },
        {
            "author": "ApprehensiveCheck702",
            "body": "That's why US and other first world countries will lose their lead and hold on markets too. You can't beat those who do what's necessary for progression.",
            "score": 2,
            "replies": [
                {
                    "author": "bingojed",
                    "body": "Why is it “necessary” for progression? Who decides that?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ApprehensiveCheck702",
                            "body": "If you haven't noticed China is becoming the leader in Technology and Manufacturing. 2 things dictate who decides it; not a person. Who can make the most the cheapest and who is more advanced. Everyone then naturally ends up relying on them for everything increasing their wealth, power, and control over all those that come to them. They aren't playing with petty rules and regulations. That's why all countries jobs are getting replaced by machines made in China and all parts/support is from china as well. Every other country needs to either do what they can to keep up or fall behind and be subservient accepting what happens to them. No matter what you will not have a job and you WILL be replaced either way. One just gives your country a chance of a foundation for a better chance at jobs staying there for a tech job or manufacturing job at least if you're the one's ahead.\n\nDoesn't matter about your morals and ethics it will continue without you and leave you in the past as everyone else around you progresses because countries like China is not gonna stop progressing technology. Look at all our old ass people crying about \"back in my day\" and everyone responds with \"It's not how it was back in the early 1900's anymore grandpa; stuff doesn't work like that anymore\". They got too ancient and complacent to adapt.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Playful-Ad4556",
            "body": "The rich have a right to steal from the poor. Seems. The rule of law is optional when you own the means pf production.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shawon770",
            "body": "Imagine AI doing a better impression of you than you can yourself",
            "score": 2,
            "replies": []
        },
        {
            "author": "shawnkfox",
            "body": "Why limit it to just AI?  I'm getting pretty tired of these actors just flat out stealing from all the great movies in our past and calling it their own creations.  Seems like if we had a law which prevented actors and movie directors from ever viewing a movie made by anyone else then maybe we could finally get some original work.",
            "score": 2,
            "replies": [
                {
                    "author": "RebelStrategist",
                    "body": "I would agree with you. The originality of story lines is next to none for the amount of movies being pumped out. Movie studios are pushing out as much as possible to make a fast dollar regardless if it is good.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Boxroonne",
                    "body": "I believe that making a law about the statement by you would kill the inspirations and artistic aspect. What are we talking about? Movement? Speech? Words from the script? However, AI straight up copies works of others (hence AI generated faces). I hope you get my point.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "RebelStrategist",
                    "body": "I would agree with you. The originality of story lines is next to none for the amount of movies being pumped out. Movie studios are pushing out as much as possible to make a fast dollar regardless if it is good.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "crosslegbow",
            "body": "Only 400? \n\nThat's too low",
            "score": 1,
            "replies": []
        },
        {
            "author": "anlumo",
            "body": "They should just spend their unimaginable riches on buying politicians like everybody else who can afford it",
            "score": 1,
            "replies": [
                {
                    "author": "armadillo-nebula",
                    "body": "The average celebrity has peanuts compared to the billionaires and trillion-dollar corporations buying politicians.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Replacement4702",
            "body": "It'$ about the art$",
            "score": 1,
            "replies": [
                {
                    "author": "Boxroonne",
                    "body": "Obviously unfortunate since we live in a capitalistic western world.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scalding_Hot",
            "body": "This is what they’re focusing their attention on? Give me a break! It’s not like there is anything else important going on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grughs",
            "body": "Bit late for that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sniffstink1",
            "body": "Petition. How cute.\n\nWhat they really need to be doing is launching a class action against META and OpenAI (and include any other AI company that trains it's ai for free by leeching off of the intellectual property of others).",
            "score": 0,
            "replies": []
        },
        {
            "author": "chief_yETI",
            "body": "I'm not sure that signing a letter here is going to do anything meaningful, but yeah it definitely is a concern.",
            "score": 0,
            "replies": []
        },
        {
            "author": "sniffstink1",
            "body": "Petition. How cute.\n\nWhat they really need to be doing is launching a class action against META and OpenAI (and include any other AI company that trains it's ai for free by leeching off of the intellectual property of others).",
            "score": 0,
            "replies": []
        },
        {
            "author": "Adventurous_Persik",
            "body": "Lol, of course they’re mad, AI’s out here doing their jobs faster. ",
            "score": -11,
            "replies": []
        },
        {
            "author": "RollingDownTheHills",
            "body": "The number of responses in here from people declaring their blind love for this AI trash is quite frankly pretty sad. Hate celebrities all you want but their stance against the exploitation of their work by AI is perfectly reasonable. Everybody except tech bros will lose in this AI infested cesspit of a future.",
            "score": -2,
            "replies": []
        }
    ]
}