{
    "title": "We have meteorites that landed on Earth from the moon and Mars, do we have any confirmed from other celestial bodies?",
    "author": "Satryghen",
    "subreddit": "askscience",
    "rank": 15,
    "score": 418,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.reddit.com/r/askscience/comments/1j8r0cq/we_have_meteorites_that_landed_on_earth_from_the/",
    "id": "1j8r0cq",
    "selftext": "",
    "comments": [
        {
            "author": "CrustalTrudger",
            "body": "The recent paper by [Brož et al., 2024](https://www.nature.com/articles/s41586-024-08006-7) is pretty relevant. As discussed there, a relatively small percentage of meteorites are linked to either the Moon (e.g., [Marvin, 1983](https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/GL010i009p00775)), Mars (e.g., [Treiman et al., 2000](https://www.sciencedirect.com/science/article/pii/S0032063300001057)), or [4 Vesta](https://en.wikipedia.org/wiki/4_Vesta) (e.g., [Thomas et al., 1997](https://www.science.org/doi/10.1126/science.277.5331.1492)) specifically. Brož et al. is arguing that a good chunk of the rest of the meteorites we have recovered (~70%) are from break ups of [Koronis family asteroids](https://en.wikipedia.org/wiki/Koronis_family), which is not surprising given the general long-standing idea that most meteorites come from the asteroid belt (see Brož et al. for various references to that effect).",
            "score": 186,
            "replies": [
                {
                    "author": "ahazred8vt",
                    "body": "We think we have meteorites from [Mercury](https://phys.org/news/2013-11-mercury-meteorite-world-rarest.html).",
                    "score": 12,
                    "replies": [
                        {
                            "author": "CrustalTrudger",
                            "body": "This is a good example of why 1 random write up from a news aggregator is not a great source for information. Looking up the meteorite referenced in this (NWA 7325) in journal articles highlights that while it is unique and clearly comes from some differentiated body (e.g., [Weiss et al., 2017](https://www.sciencedirect.com/science/article/pii/S0012821X17301620), [Archer et al., 2019](https://onlinelibrary.wiley.com/doi/full/10.1111/maps.13261), [Yang et al., 2020](https://onlinelibrary.wiley.com/doi/full/10.1111/maps.13559)), the idea that it is sourced from Mercury has been pushed back on based on various inconsistencies (e.g., [Weber et al., 2015](https://onlinelibrary.wiley.com/doi/full/10.1111/maps.12586), [Koefoed et al., 2016](https://www.sciencedirect.com/science/article/pii/S0016703716301375), [Cloutis et al., 2018](https://www.sciencedirect.com/science/article/pii/S0019103517304773)), though the possibility still exists (e.g., [Sutton et al., 2017](https://www.sciencedirect.com/science/article/pii/S0016703717300509)). I.e., the most fair assessment is that some people used to think we have a meteorite from Mercury and now must people are unconvinced but the evidence is ambiguous enough that we're not really sure of the exact source of this meteorite.",
                            "score": 54,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PM_ME_UR_ROUND_ASS",
                    "body": "Great summary! The Brož et al. paper is fascinating - I've been following how isotopic analysis has been improving our ability to trace meteorite origins. It's interesting that while we've confirmed moon, Mars and Vesta samples, we still haven't definitively identified anything from Mercury or the larger moons of gas giants. The orbital mechanics make those transfers much more unlikley, but I wonder if we've already found some without realizing their true origin.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 51,
            "replies": [
                {
                    "author": "quyksilver",
                    "body": "Any ejects from Mercury or Venus would need to overcome the Sun's gravity well, and likewise any ejects from a Jovian moon must overcome Jupiter's gravity well.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "geekbot2000",
                            "body": "Would be interesting to compare escape velocity vs impactor velocity distribution, given the vast majority of potential impactors originate from the astroid belt and thus have a relatively narrow v distribution. Compare that with the incidence of oort objects and their velocities, as well as rogue objs.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "hazysummersky",
                            "body": "Curiously, of all the planets, Mercury is the smallest average distance from Earth!",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ZhouLe",
                            "body": ">Any ejects from Mercury or Venus would need to overcome the Sun's gravity well, and likewise any ejects from a Jovian moon must overcome Jupiter's gravity well.\n\nThis kinda ignores the fact that you need to \"fight against gravity\" going both ways.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZhouLe",
                    "body": ">Afaik there are no samples from Venus or Mercury, maybe on account of the Sun's gravity well?\n\nThis is coming from an understanding of a gravity well as like a hole that you can effortlessly fall into, but it's not. Coming from Venus, you need to increase your orbital speed by around 3500m/s to intercept Earth, but coming from Mars you need to do the opposite and slow down your orbit by about 2500m/s.\n\nThis is why shooting stuff into the Sun is not feasible: it requires an incredible amount of energy to slow down an orbit enough to actually get close to the Sun.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "NorthernerWuwu",
                            "body": "Yeah, the common thinking is that you just fire it away from Earth and then the Sun will suck it in but that's not how orbital mechanics work. Even Black Holes have trouble actually getting matter past the event horizon, they tend to produce incredibly energetic orbits though!",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "588-2300_empire",
                            "body": "From the earth it would take more fuel to get a rocket to Pluto than the sun.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "ZhouLe",
                                    "body": "This is not true.\n\nThe Earth orbits at nearly 30,000m/s. In order to perform a Hohmann transfer that skims the surface of the Sun requires reducing that by nearly 26,000m/s. A Hohmann transfer to the orbit of Neptune requires only increasing that velocity by 11,500m/s.\n\nIn fact, you could go to Pluto (~11,600 Δv), speed up to rendezvous and land on Pluto (~4,000 Δv) for a vacation, then take off and reduce your orbital velocity to zero (~5,500 Δv) to plunge directly into the center of the Sun all for significantly less Δv (fuel) than it takes to go directly to the Sun from Earth (21,100 Δv < 26,000 Δv). The drawback to taking to Pluto route is that it would take around 60 years total and the direct shot would only be 65 days.\n\nIf you are willing to wait around ten thousand years, you could send a rocket to just below escape velocity, then give it a tiny nudge once it's way out there to fall into the Sun and it would only require 12,300 Δv.",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DesperateRoll9903",
            "body": "Some can be traced back to asteroid families. I learned this while expanding the wikipedia article for [2024 BX1](https://en.wikipedia.org/wiki/2024_BX1) (Ribbeck meteorite), which was an E-type asteroid probably originating from the Hungaria family (largest member is asteroid 434 Hungaria).\n\nI also liked the linkage to \"cosmic pears\" and the story about Ribbeck giving pears to children.",
            "score": 10,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 6,
            "replies": [
                {
                    "author": "DaddyCatALSO",
                    "body": "What was so great about their iron? And fullerenes are basically a carbon structure, how does that connect to supernovae?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Fullerenes are exactly not carbon structure, which is a rectangular lattice. \nFullerenes look like soccer balls.\nThis makes them unbelievably strong, and when you smith with it the steel gets much stronger and more flexible.\nFullerenes are only being created in a supernova, thats how they are connected.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "DaddyCatALSO",
                                    "body": "Nothign about supernovae in the Wikipedia article on Fullerenes, which si msotlya bout buckeyballs, which \\*are\\* carbon.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Wiki is not the only research resource online.\nOn earth, there are only few of them, in nebulae there are vast amounts.\nSo it's safe to say they come from nebulae, which are star cribs.\nTo produce them here needs high temperature and pressure.\nThey also come from candle light, flash impacts and from meteors crashing on our planet.\nThe high pressure and temperature means they come from a supernova, because our sun doesn't produce them, yet.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TylerTR95",
                    "body": "That’s cool, gonna look into this thanks",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "author": "Asteroth6",
                    "body": "Well, obviously a theoretical upper limit is formed by the age of the Earth vs the speed of the meteor. If it could not have reached here in 4.5 billion years, then it could not collide with Earth. \n\nSince the maximum speed a meteor could obtain in the real world if far, far slower than the speed of light, that number is obviously massively less than 4.5 billion light years. \n\nNo object from another galaxy has ever been spotted in our solar system. Even objects from other solar systems are extraordinarily rare. Look up “Oumuamua” for more details on that particular topic.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "worgenthal",
                    "body": "It's possible that you could get something ejected from a nearby star system. The nearest stars are lightyears away, but a meteorite would just keep chugging along till a few thousand or million years later it got here. It wouldn't lose momentum unless acted on by another body's gravitational field, or was massively slowed by interstellar gas collisions. So if it was going fast enough to exceed it's system's escape velocity, it would keep going at speed, although it would arc relative to the galactic center's gravitational influence. If it hit something though it would likely vaporize. \n\nSomething from say a star on the far side of the galaxy would be a lot less likely. Even the high speed of something ejected from its system is peanuts compared to the speed things are spinning around the galactic core. It would take billions of years to catch up, and would likely get influenced by many other celestial bodies in between.\n\nSomething ejected from another galaxy would have to go incredibly fast to break its galaxy's escape velocity. Our sun goes around the galaxy at 514,000mph, which is pretty fast, but escape velocity for the galaxy itself is around 1,200,000mph. Something flung out of the galaxy at less than that speed would be pulled backwards by the gravity of the entire galaxy as a whole, and that pull would be greater than it's forward momentum. If it did reach escape speed, it would have to cross a vast amount of space to actually reach our galaxy. There are a number of tiny galaxies that orbit the milky way that could feasibly be broken away from, but the nearest galaxy similar in size to ours, Andromeda, is 2.5 million lightyears away. At that speed it would take something ejected there about 1.4 billion years to get here, and it would have to have left the system at just the right angle to actually arrive here. Andromeda is actually coming to say hello in about 5 billion years, so that will be interesting. \n\nEven if it made it into our solar system the odds of it hitting earth are really low, and the odds of it surviving atmospheric entry even lower. If it didn't pass right through the system, it would likely be captured by the sun or jupiter.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Howrus",
                    "body": "Side note - viruses\\alien organisms that come from millions of light years away are not dangerous to us.  \n\nMost dangerous diseases come from animals that are very-very close to human biochemistry: pigs, cows, bats, primates, etc.  \n\nSomething that is very alien won't know a way to trick our immune system and would be destroyed on sight. Or even it will operate in completely different chemistry and won't be able to survive on Earth :]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "tech-slacker",
                            "body": "So you’re saying the aliens in War of the Worlds were humans with masks on or the movie was scientifically inaccurate?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}