{
    "title": "Does the microbiome of the human skin (eyelash mites, bacteria, yeasts, etc) get killed off when people do things like scuba diving to great depths, ice baths, extreme sauna or mountaineering into low oxygen conditions ?",
    "author": "ScissorNightRam",
    "subreddit": "askscience",
    "rank": 7,
    "score": 1516,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 105,
    "url": "https://www.reddit.com/r/askscience/comments/1janev9/does_the_microbiome_of_the_human_skin_eyelash/",
    "id": "1janev9",
    "selftext": "There are a lot of things that live on the human skin, and I'm wondering if humans can survive things they can't. Such as pressure, heat, etc.\n\nSo, for example, if you have a free driver who goes down to 100m, does that huge water pressure squasht all of a certain species in the dermal microbiome?",
    "comments": [
        {
            "author": "hexadecimaldump",
            "body": "Never completely killed off, but yes many things we do kill off large portions of our skin microbiome.  The biggest of which is taking a bath or shower.  \nBut the yeast and bacteria also live in our pores and other cracks and crevices of our skin that these activities can’t get to, so the microbiome does recolonize.  \nI listened to an interesting RadioLab episode about this where Robert talked about shaking JFKs hand when he was young and not wanting to wash it.  Then they did a science experiment where he shook DeGrass Tyson’s hand, and they did a swab of each to see what microbes moved from one person to the other. It was a pretty interesting episode.",
            "score": 1144,
            "replies": [
                {
                    "author": "Qopperus",
                    "body": "Yes I would suspect soaps and friction from normal bathing would be more significant.  The individuals may be less resilient than a human, but the microbiome as a whole is much tougher.",
                    "score": 147,
                    "replies": []
                },
                {
                    "author": "Abdiel_Kavash",
                    "body": "Now I am wondering about this experiment:\n\nPerson A shakes hands with person B. Person B shakes hands with C. C shakes with D, and so on. How long can you go and still find traces of person A's microbiome on the last person's hand?",
                    "score": 60,
                    "replies": [
                        {
                            "author": "trashedandtossed",
                            "body": "I don’t know about biologicals, but I know we have detection equipment for certain chemicals in the picogram range, which I was told is 100th transfer level. So A to Z almost 4 times.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fer_sure",
                            "body": ">How long can you go and still find traces of person A's microbiome on the last person's hand?\n\nAnd what about descendants of that person's microbiome?  What  famous historical figure's multigenerational handshake traces do I have?",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SomeAnonymous",
                    "body": "Apologies for the barrage of followups but this is something I'd never really considered before. \n\n> The biggest of which is taking a bath or shower.\n\nHow much of this is mechanical i.e. simply rinsing/abrasion, vs caused by soaps?\n\n> But the yeast and bacteria also live in our pores and other cracks and crevices of our skin that these activities can’t get to, so the microbiome does recolonize.\n\nDo we know how quickly this process happens? Minutes, hours, days (the poor participants testing *that* one)? \n\nAlso, how much does hair removal affect this? I could imagine that razors, waxing/epilating, or natural hair growth would all leave the skin looking quite different on a micron-scale.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "RestaurantJolly1794",
                            "body": "\n\nI’m a skin microbiologist! Soap plays a big role - it can (but not always) break down the bacteria’s cell membrane, killing them. Actually soap largely functions by washing away the microbes through encapsulating them in micelles, which causes them to wash away with water. Scrubbing on the other hand will help to remove dead skin cells, which microbes can be attached to. \n\nThe timescale for repopulation is generally hours. For example, when we perform skin microbiome studies, we ask participants to refrain from showering for ~12 hours so that there is sufficient microbial material to sample. But this is dependent upon skin site - regions like the armpit, groin, belly button are considered moist and occluded, which is optimal for bacterial growth. So these sites may repopulate much faster than say your forearm, which is comparatively drier.",
                            "score": 35,
                            "replies": []
                        },
                        {
                            "author": "buddahdaawg",
                            "body": "I would say it’s equally chemical and mechanical. The soap helps break down bacterial membranes, which are made of fats. Rubbing your hands together not only spreads and activates the soap, but also mechanically destroys microbes.\n\nDifferent bacteria have different rates of growth. Bacteria grow logistically meaning their population doubles after a certain amount of time. It’s hard to calculate exactly since each person’s flora varies. \n\nWaxing leaves your hair follicles open and vulnerable to infection. You’re advised to keep that area clean for the first 24-48 hours so the wounds close up. You also have bacteria normally living in your follicles, it’s only when harmful bacteria gain access to that area you may develop an infection (look up hot tub folliculitis).",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "DrOnionOmegaNebula",
                                    "body": "It just sounds like you're being speculative. Anyone can make intuitive guesses. \n\n> I would say it’s equally chemical and mechanical\n\nIt's unlikely both of these would just happen to be 50/50 contributors. \n\n> Bacteria grow logistically meaning their population doubles\n\nThis doesn't give me confidence lol.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "ratshack",
                                            "body": "“Bacteria grow logistically meaning their population doubles after a certain amount of time”\n\nYea but lets face it, confidence was already headed for the door after this hot take.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Yaver_Mbizi",
                                    "body": ">Bacteria grow logistically meaning their population doubles after a certain amount of time. \n\nThat's nonsense. Even if you meant \"logarithmically\", it's still nonsense, because you're describing an exponential function, y = 2^x.",
                                    "score": -12,
                                    "replies": [
                                        {
                                            "author": "Status-Arrival-3757",
                                            "body": "Logistic growth of bacteria is accurate. Sounds like you were simply unfamiliar with the term and assumed it was nonsense.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "mplang",
                                            "body": "Logistic growth typically starts as exponential growth before gradually slowing down as certain limiting factors take hold. I don't think /u/buddahdaawg was spouting nonsense at all.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "buddahdaawg",
                                            "body": "Congrats on catching a misspeak I don’t know what to tell you lol. Please do provide the correct equation then.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "KarlSethMoran",
                                            "body": "They said *logistic*, not *logarithmic*. Educate yourself:\n\n[https://www.khanacademy.org/science/ap-biology/ecology-ap/population-ecology-ap/a/exponential-logistic-growth](https://www.khanacademy.org/science/ap-biology/ecology-ap/population-ecology-ap/a/exponential-logistic-growth)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 35,
                    "replies": [
                        {
                            "author": "ss1325",
                            "body": "That’s true! Females are born with the exact amount of eggs so when a mother has her daughter in her womb, she essentially has her grandchildren as well. \n\nWas the horseshoe crab thing about their blood? \nI’ll have to check this podcast out.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "moonra_zk",
                                    "body": "\n>Females are born with the exact amount of eggs so when a mother has her daughter in her womb, she essentially has her grandchildren as well. \n\nTook me a bit to understand, although mostly because of how the person you replied to phrased it, which is definitely not right.",
                                    "score": 33,
                                    "replies": []
                                },
                                {
                                    "author": "Erior",
                                    "body": "However, while production of eggs is complete during embryonic development, with the remaining process being the post-puberty monthly maturation, the ammount of eggs produced VASTLY surpasses the number of periods that will happen between puberty and menopause.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "The100thIdiot",
                                            "body": "How many eggs are we taking? Does it vary much between individuals?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Erior",
                                                    "body": "https://en.wikipedia.org/wiki/Ovarian_follicle\n\n~250 thousand eggs. And lifetime menstruations are around 500, so pretty much only 1 out of every 500 eggs mature.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheStateofOregon",
                    "body": "Funky hand jive is one of the worst RadioLab episodes, and I’m willing to die on this hill.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Amphigorey",
                            "body": "What makes it one of the worst? I haven't listened to it but I've enjoyed (and been annoyed with, on occasion) RadioLab.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zmbjebus",
                    "body": "There are going to be some refugia that don't get washed or exposed to high temperatures in showers. Places like the belly button, inside the ears, nose, eyelids, under nails possibly. Thats in addition to pores/wrinkles/etc. \n\nNo idea how fast recolonization happens, but probably on a daily basis.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Margali",
                            "body": "5fu chemo and some interesting meds killed off most of my roomies, 5 years of no body odor or finger and toe prints was freaky. Still 4 years later my fingerprints aren't fully back.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SpiritGuardTowz",
            "body": "Soap will probably kill and get rid of far more of them than any of the listed conditions. The sauna may do something but at that point I'd worry more about your own wellbeing. That pressure is largely inconsequent at those scales, ice will slow them down a bit but you'd be in risk of frostbite before you kill a significant portion off and \"low oxygen conditions\" isn't low enough for these creatures some of which can also happily live anaerobically.\n\nEdit. This>these",
            "score": 219,
            "replies": [
                {
                    "author": "ScissorNightRam",
                    "body": "I just had a quick Google, and the highest “usual” sauna temp is about 90C (195F). Many people can tolerate over 100C though.\n\nThen you have this “cryo chamber” thing, where you stand in a little booth and get blasted with gas that’s cooled to about minus 100C.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "S_A_N_D_",
                            "body": "While the air temp might register that high, the outer surface of the body doesn't necessarily get that hot. \n\nYour body is a good heat-sink and it's surface is starting at a temperature of 33-35C. \n\nThe same goes for the cryo chamber. \n\nIf the outer layers of your skin were actually reaching 100C, you would be suffering severe burns to the dermal layers. \n\nSome hair might get that hot, but your skin is going to stay a lot cooler.",
                            "score": 125,
                            "replies": [
                                {
                                    "author": "Angry__German",
                                    "body": "You are right.\n\nIn direkt contact with a heat source, tissue damage starts at contact times of a few minutes at around 60° C if I remember correctly from a study I read a good long while ago.\n\nAt 70° C damage shows after under a minute,I think and time decreases rapidly, I think logarithmicly (is that a word?), the higher the temperature gets. \n\nAt 80°s and higher it was less than a second.\n\nThat all depends on the heat conductivity of the heat source you are in contact with. So you can tolerate being in air that is that hot for quite a while, but you'd literally boil/fry to death if your body would actually reach those temperatures.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "Modo44",
                                            "body": "You get first visible skin damage by washing your hands in hot tap water, which is typically 55° C or less. This \"low\" temperature only hits the outer layer, but will already stop a human from trying to burn any bacteria off.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Yaver_Mbizi",
                                            "body": ">and time decreases rapidly, I think logarithmicly (is that a word?), the higher the temperature gets.\n\n>At 80°s and higher it was less than a second.\n\n\"logarithmicly\" isn't a word, but \"logarithmically\" is, though it's obviously the wrong one, because things that are increasing logarithmically aren't increasing very rapidly at all. y = lg x is 1.85 for x=70 and 1.9 for x= 80.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Statesbound",
                            "body": "People can tolerate over boiling? I have trouble believing that.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "DreamEndlessOneiros",
                                    "body": "You sweat a lot and the air is mostly very dry at these temperatures. So yea, people tolerate it, in short time portions of <15 min its even enjoyable.",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "riptaway",
                                    "body": "It's definitely a thing, though not super common. But it's not like they're in boiling water, which would obviously kill or maim them quite quickly. Being in 100 degrees Celsius air temp is much different than being in boiling water.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "PickerPilgrim",
                                            "body": "> not super common\n\nIt is my understanding that it's fairly common for Russian and Finnish saunas specifically.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "SkoomaDentist",
                                                    "body": "Only for truly hardcore enthusiasts. The vast majority of people prefer temperature somewhere between 70 - 90 degrees.",
                                                    "score": 19,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Modo44",
                                    "body": "The air is hot, but the heat takes time to transfer, and your natural cooling kicks into overdrive, so you can withstand it for a short time. The human body is generally not happy anywhere above body temperature (some new studies suggest as low as 30° C is unhealthy), but we can live in it when the differential or the exposure time is low enough.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -5,
                    "replies": [
                        {
                            "author": "FFS_SF",
                            "body": "Nonsense: at a microscopic level the dipole in soap molecules tears the lipid structure of microbes apart - it literally dissolves their walls so they cease to be able to function. Don’t skip soap based on one anecdotal reproduction of one uncited study in a non scientific publication by a non-scientist.",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "epiphanyelephant",
                            "body": "Please don't spread misinformation. \n\n\"Using soap to wash hands is more effective than using water alone because the surfactants in soap lift soil and microbes from skin, and people tend to scrub hands more thoroughly when using soap, which further removes germs.\" \n\nSource: https://www.cdc.gov/clean-hands/data-research/facts-stats/index.html",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jawshoeaw",
            "body": "Your skin does have a microbiome but it’s not quite the same as say your colon or mouth. Your skin is an inhospitable desert. It’s dry and salty. It’s constantly flaking off too, which is instant death for anything attached to it. \n\nIn other words bacteria and yeasts are always dying on the skin. Going swimming, showering, using a sauna, all will remove or kill large numbers of organisms. But many of them were going to die anyway and they get replaced.",
            "score": 65,
            "replies": []
        },
        {
            "author": "Turtledonuts",
            "body": "Microbes are generally more resilient to harsh environments than your skin cells. They have less fragile cells and more complex defensive systems than a eukaryotic cell. If it doesn’t harm your skin, its generally unlikely to kill large amounts of microbes on your skin. \n\nFor example, microbes aren’t denatured by water pressure until far below the depths that a free diver can feasibly reach. If exposed to the kinds of cold temperatures that are needed to kill microbes, humans develop frostbite. Meanwhile, microbes can be defrosted and revive. Microbes have a lower and more variable metabolic rate, leading to lower oxygen requirements. \n\nOn the other hand, human skin is a lot more resistant to chemicals, to abrasion, and to high temperatures. Soak in a hot bath for hours and you might cook some microbes off. Soap and water does a lot of damage. Spray yourself with water and you’ll probably knock some off. Extremely hypotonic or hypertonic solutions can kill your skin microbes, as can fairly acidic solutions. I imagine a sunburn could cook off some microbes. ",
            "score": 20,
            "replies": [
                {
                    "author": "Qopperus",
                    "body": "Saltwater is very interesting to consider. I think a swim or soak in the Dead Sea would be very hard on microorganisms on the skin. Smaller organisms have a higher surface area to volume ratio, which may expose them more to desiccation. The resilience of water bears and other microrganisms aside, this seems like a stronger contender than heat, cold, or pressure.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "ScissorNightRam",
                            "body": "That’s really interesting. I had kinda thought about mud baths and how they could suffocate larger skin critters - well, parasites, like ticks. But hypersaline water is also totally something that people do recreationally that could kill a lot of stuff on their skin ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "bzbub2",
                                    "body": "you seem intrigued by a lot of things that sound a bit pseudo-sciencey",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ScissorNightRam",
                                            "body": "I’m intrigued by all manner of things",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PM_ME_UR_ROUND_ASS",
                    "body": "Fun fact: some skin bacteria like Staphylococcus epidermidis can survive in salt concentrations that would kill most other organisms (up to 25% NaCl!). These little extremophiles evolved alongside us and can handle way more enviromental stress than we can. There's even research showing certain skin microbes surviving in space-like conditions when NASA tested them. Our skin buddies are tougher than we give them credit for!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KwisatzHaderach55",
            "body": "Because several environmental and physicochemical parameters go beyond their tolerance gradient, like pressure, salinity, temperature, O2 levels...\n\nThey evolved sharing the same tolerance levels as their hosts, us. We go beyong the tolerance gradient, but for short periods of time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RestaurantJolly1794",
            "body": "One of the main purposes of the skin is to act as a barrier against the environment, which means that it can protect against a variety of aggressors. Like heat, water loss, UV exposure, chemicals, etc. So naturally the skin microbiome is partially protected via the nature of the skin.\n\nBut also, because the skin itself is a relatively harsh microbial environment, the skin microbiome is very hardy and robust. The microbes thrive not only on the skin surface but within hair follicles and sweat glands and even into deeper skin layers.\n\nSo under more extreme conditions, the surface-level skin microbiota may be washed away or killed (although you’d be surprised, bacteria can be extremely hardy and resilient), but they will quickly be repopulated as they multiply and are pushed to the surface with sweat/sebum secretion.\n\nInterestingly the skin microbiome was sampled from astronauts at the ISS and they saw that the microbiome changed over the course of the space mission. Whether that’s due to the impact of microgravity on microbial biochemistry or the conditions of the ISS (low microbial biomass/diversity, radiation, etc), it’s hard to know.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MilesTegTechRepair",
            "body": "Ecological Succession is the process by which any ecosystem (and we can consider each human body it's own distinct ecosystem) that loses some or all of the species living within it. A good number of the species living in or on you may indeed be wiped out, but will frequently return, or regrow to their previous numbers.\n\n\nI would be interested to hear about how our hygiene routines have affected the evolution of our various biomes. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dog_From_Malta",
            "body": "Tardigrades can survive extreme temperatures (from almost absolute zero to above the boiling point of water) , radiation and even the vacuum of space.\n\nI wish you good luck in remaining alive while experiencing an event that would put a dent in their population.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lurkylarko",
            "body": "You mentioned mountaineering. I’ve heard that spending time at extreme elevation can be detrimental to one’s mitochondria population. Not what we typically think of as microbiome, and applies to more than just skin, but it makes sense as those microbes are the essential component that metabolizes oxygen for cellular respiration.",
            "score": 0,
            "replies": [
                {
                    "author": "ScissorNightRam",
                    "body": "That’s pretty interesting too. Not sure if it’s pertinent, but I remember that the highest elevations of the Himalayas are a “death zone”. Basically once you pass a certain altitude, the countdown to your death starts ticking, and you have to either summit or turn back because you simply cannot “stay”. There is just no acclimatisation when you’re that high up.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}