{
    "title": "Why does HSV-1 Not Transfer to other parts of the body?",
    "author": "xerinab",
    "subreddit": "askscience",
    "rank": 3,
    "score": 631,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 169,
    "url": "https://www.reddit.com/r/askscience/comments/1jct6jj/why_does_hsv1_not_transfer_to_other_parts_of_the/",
    "id": "1jct6jj",
    "selftext": "I’ve had HSV-1 my whole life, I’m aware that it has the potential to spread to the genitals and through my paranoia came a question: \n\nWhy does the virus have to potential to spread to the genitals and not other areas of the body? Is it the nerves? The tissue difference?? Thank you in advance, tried to google but couldn’t find any straightforward answers \n\nEDIT: Wow. Thank you all so much for your answers, I’ve gone 23 years not knowing a whole lot about HSV-1 and your responses have truly been enlightening! Appreciate you all :) ",
    "comments": [
        {
            "author": "damnitcamn",
            "body": "I got my Ph.D. in HSV-1 biology, this is a really interesting question!  There have been some really good answers, too, so I won't re-hash what's been said about latent, long term infection and recurrence being a result of sensory neurons.\n\n  It can infect skin cells, but doesn't typically infect non-mucosal skin because that skin is protected by a layer of keratin to which the virus cannot bind nor can it infect.  This ability to infect skin cells has actually led to the development and approval of an FDA approved treatment for skin cancer using genetically engineered HSV-1!  \n\n  \n  Typically, the most common secondary location for HSV-1 infection is the eye (which also happens to be enervated by the same ganglia as the lips and mouth).  In the United States, for example, HSV-1 is the leading cause of blindness due to an infectious agent.\n\n  \nIf you have other questions about HSV-1 I would be happy to answer!",
            "score": 800,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 268,
                    "replies": []
                },
                {
                    "author": "sciguy52",
                    "body": "Separately, how are the various vaccine trials going?",
                    "score": 53,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "Last I saw the vaccine candidates were still struggling to demonstrate protective immunity. They’re a surprisingly tricky class of viruses to immunize against.",
                            "score": 74,
                            "replies": [
                                {
                                    "author": "sciguy52",
                                    "body": "Lots of factors at play making it hard for sure. Well fingers crossed one of these come through.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "damnitcamn",
                                            "body": "I agree! I hope they do, too! And I know it’s being researched, vaccines to prevent new cases and ways to help those already infected in a better way. It’s tough! These viruses have been coevolving with us for 11 million years",
                                            "score": 25,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "hematogone",
                                    "body": "Curious to hear from someone in the field - what makes them especially hard to vaccinate against? Are they highly mutated? Poor immunogenicity?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "damnitcamn",
                                            "body": "They're very poorly immunogenic, and they bind and get into cells REALLY fast (like, we do infections in the lab where we leave the virus in solution on cells for an hour and then rinse it off, and by then the virus is already inside the cells).  One other big challenge is that you need protection at the level of preventing infection at the skin, because once that happens, spread to the nerve happens basically from neighboring cells to one another.  So it's not exposed to the immune system very much, and has a number of ways to bind and get into cells.",
                                            "score": 22,
                                            "replies": [
                                                {
                                                    "author": "hematogone",
                                                    "body": "Wouldn't it see a bunch of Langerhans cells and a few T cells before reaching a peripheral nerve? Or is it still not enough because of their speed?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "damnitcamn",
                                                            "body": "So it certainly would!  All of the normal tissue immune cells would eventually be there, but the speed of viral replication, amount of virus produced, and how infectious it is means that it spreads faster through the tissue than those immune mechanisms can control before spread.  The very, very ends of the nerve cells are also nuzzled right up next to the epithelial cells, especially in highly densely enervated tissue like the lips, so they often can spread from skin cell to skin cell to skin cell to nerve with minimal time outside a cell.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "hematogone",
                                                                    "body": "Oh fascinating. Is that true of most herpesviruses or just HSV? I know the VZV vaccine is not the best, but still kinda works somehow?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "ZoeyKaisar",
                                            "body": "Viruses don’t eat; they’re basically just a recipe that your cells get tricked into following, which produces more of themselves instead of something the cells wanted to produce. This is why they are sometimes considered to not technically be “alive”- they rely entirely on other lifeforms to exist, and are thus parasites, in the same way that billionaires are basically parasitical of other humans while not demonstrating any other signs of life or intelligence.",
                                            "score": 37,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Jacobambus",
                                    "body": "Coincidentally, I just saw an article showing good promise https://jamanetwork.com/journals/jamadermatology/article-abstract/2831192",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "baltosteve",
                    "body": "Great info . Herpes 1 and 2 can also infect fingertips. The condition known as Herpetic Whitlow used to happen to dental and medical workers pre common  glove wearing era( think since 80s/ HIV appearance). It still can happen via  self inoculation or other means. Wash those hands!",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "salteedog007",
                    "body": "So how do I get it on my butt cheeks? and right below the waist line? I figured it was the type called wrestlers, and figured maybe from the change room at the Y? Have no idea....\n\n  \nwhoa! Quick edit- from the benches in the change rooms...",
                    "score": 21,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": " Especially if there were any even invisible tears in the keratin layer, it could be from contact with other wrestlers or infected sweat or blood or mucus in a spot with a microscopic rip.\n\nThe virus itself doesn’t stay infectious on surfaces for very long, but it’s a function of the virus particles drying out, so spit, sweat, or even blood can harbor infectious virus. Pair that with “oops got a mat burn during practice” and that’s all it could take",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "alockbox",
                            "body": "You might want to look whether this isn’t HS (Hidradenitis Suppurativa).",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Dependent_Ad7711",
                            "body": "It definitely can infect that area, hsv-1 or 2 and most likely you got sexually not from a bench at the gym",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Davemblover69",
                    "body": "Oh I have one. Ok so I had a theory that since hsv is a virus then there are mutations of it. I know I have it but I don’t have outbreaks. But if you have one can you still catch like another strain and so just having one doesn’t mean not to be concerned about catching more. So basically the question is about if it is like the flu in that there is an always changing virus?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "An awesome question. There are two parts to the answer.\n\n  First, viruses with DNA genomes mutate less rapidly than viruses with RNA genomes. Flu is an RNA virus, but herpes viruses have DNA genomes.\n\nSo rather than virus genome mutations, this brings us to the fact that every individual has some slight variations in how they experience infection and symptoms.  So for HSV it’s more about specific host variables rather than viral variation",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Davemblover69",
                                    "body": "Thank you, plus it gives me direction for interesting reading. You are a gem",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "VR76",
                    "body": "Can you tell me why I no longer get them at all on my mouth but only in nostrils and underside of my jaw? I’m so baffled",
                    "score": 7,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "I wish I could in any helpful sense! It may just be that the very specific nerve cells that enervate those specific parts of your skin are more prone to having recurrent reactivation of the virus. As of yet we still don’t know why that happens",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "mejustnow",
                                    "body": "How do you explain underside of the jaw if this isn’t mucosal tissue? \n\nWould you say the virus has memory to it? Like it will go to its last known location until it finds a new one? \n\nThanks in advance!",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "MurseMackey",
                                            "body": "Initial infection requires mucosal tissue for the virus to bind to and travel through, but in chronic infection the virus lives in the nerves of typically one dermatome. A lot of the nerves in your face connect near the ear, so the virus likely migrated to your mandibular nerve at some point. \n\nEdit: sorry, responding to u/VR76 via your comment.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kevnuke",
                    "body": "Is it true that most of the population has some form of herpes somewhere in their body and it's benign?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "bazoid",
                            "body": "Not the person you replied to, but the answer is kind of “mostly yes, but it depends what you mean”.\n\nHSV-1 and HSV-2 are the viruses we colloquially refer to as herpes. They are very very similar in terms of symptoms, but type 1 is more common in oral infections and type 2 is more common in genital. Both viruses tend to have more symptoms if you get them  at their “preferred” site. So for instance, you can get HSV-1 genitally, but your symptoms will usually be very mild. Many people will never experience an recurring outbreak after the initial infection.\n\nBoth are extremely common, but HSV-1 is even more so. I’m seeing around 67% of the population as a recent estimate. So I’d say that’s “most of the population”. But 2/3 is not  absolutely everyone.\n\nWhen people quote this statistic, I think they are sometimes including other viruses in the herpesvirus family that go by other colloquial names and have very different symptoms than HSV-1 and 2. For instance, chickenpox/shingles is caused by a herpesvirus and was extremely common until the rollout of the vaccine in the mid-90s. So just be aware that people don’t *always* just mean HSV-1 and 2 when they talk about herpesviruses. It’s also important to note that these viruses don’t have cross-immunity, so having one doesn’t make you less susceptible to another.\n\nThere’s also the question of what is “benign”. It’s true that many people who have HSV-1 or 2 never experience any symptoms and likely don’t even know they have the virus(es). And the symptoms themselves are, except in very rare circumstances, extremely inconsequential. It’s a painful, itchy rash that clears up within a few days with some cheap medication. There are studies ongoing into possible connections to other diseases and conditions, but nothing definitive has been proven to suggest that the average non-immunocompromised person is at risk of more severe health outcomes as a result of infection. (This is all regarding HSV-1 and 2; symptoms of other herpesviruses like shingles can be much more severe.)",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "waterjaguar",
                            "body": "No this is a myth. many people have no antibodies or have ever been exposed to HSV. Estimate is half the global population has HSV. It’s also not benign",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Dependent_Ad7711",
                                    "body": "It's not wrong, estimates are around 70% of adults have hsv 1 and almost 15% have hsv 2. \n\nMost of those people don't know they carry the virus and it is benign for most people, even the ones that have active infections many don't realize that itching is a herpes outbreak. \n\nThere's probably like 5% of people that have severe infections that prompts them to seek medical care.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thegoodtimelord",
                    "body": "Awesome. Thank you. Any evidence to the rumour that HSV-2 is now becoming more prevalent as oral herpes and HSV-1 more prevalent as an  ano-genital infection?",
                    "score": 18,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "Now that I’d have to check the statistics on. From a biology of infection stand point, the ways that could be true is if a society has recently had a change in the trends around oral-genital or oral-anal contact. The viruses CAN infect in each other’s typical anatomy, though not as efficiently. \n\nI mean, we are out here eating ass in 2025",
                            "score": 70,
                            "replies": [
                                {
                                    "author": "ChickinSammich",
                                    "body": "I don't know about the statistics but I know someone who absolutely learned the hard way that:\n\n1) If you have oral HSV-1 and you are performing oral sex acts on a partner who does not have any HSV, they can get genital HSV-1.\n\n2) Apparently you're super contagious in the days immediately *preceding* an outbreak.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Dependent_Ad7711",
                                            "body": "Hsv-1 is responsible for 50% of all new genital hsv infections. \n\n\nIt is typically less severe than hsv 2 infections though.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ChickinSammich",
                                                    "body": ">It is typically less severe than hsv 2 infections though.\n\nI feel like if I were to PM this to the person who got it, she would not be encouraged. :)",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Dependent_Ad7711",
                                                            "body": "It's the most common virus on the planet, the stigma is literally worse than the disease for 99% of people with it. \n\nMost people don't know they have it though because it's not standard STI testing. \n\nMost people get hsv-1 as children and if you rule those people out as partners you will be ruling out almost everyone. \n\nWho cares, literally not worth even worrying about.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FloppySpatula-",
                                    "body": "I really didn’t think that initial infection site determined that is where you would experience subsequent, long term outbreaks. I had thought the virus can infect the genital/anal area, or the mouth, or the eyes, etc, but ultimately its phenotype would guide it to settle in the nerve bundle most often associated with HSV 1/2. \n\nIs that not the case, then? If you get HSV2 in the mouth, it stays in the mouth? Ditto HSV1 on the genitalia?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "damnitcamn",
                                            "body": "It’s absolutely about where you got initially infected, unless you spread it to other parts of yourself! \n\nIf you contract either HSV-1 or 2 on the mouth, that’s where they would recur, and the same would be for any anatomical location. It infects and seeds the ganglia of the nerves for that specific part of your body.\n\n  Spread, from the primary infection site, is usually through touching the infected site then other areas either oneself or through someone else",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DontCensorReddit",
                                    "body": "I get recurring infection high in my nose like out of reach. But the day before or so I get migraine headaches behind my right eye. It doesn’t always lead to a full blown infection but I assume it’s connected. I also have pressure always in my right ear. Also I think it’s connected. Is this a thing?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "damnitcamn",
                                            "body": "I certainly couldn’t say for sure, but it’s absolutely within the realm of possibility!\n\n I wish I had a better answer for you on that one :/",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 6,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "Really good question, and unfortunately the answer is “it’s nearly impossible to predict”.\n\n  It’s actually very difficult to study this particular virus, so many questions which seem very basic about other pathogens are still unknown in HSV",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bazoid",
                    "body": "Ooh, I have a question for you. I used to work in medical research fundraising, which meant that I read and learned a ton about Alzheimer’s disease despite not being a scientist. At the time, one of our funded labs was looking at possible connections between HSV-1 and AD. But at least from my layperson’s understanding at the time, it wasn’t so much that the virus had a special relationship to AD. It was more that it’s an incredibly common infection, and as you age, your brain becomes less effective at protecting itself from pathogens. So while the lab was finding HSV-1 particles in a lot of brains of AD patients, they suspected this was probably just due to its high prevalence. \n\nRecently, I’ve seen some more news about this HSV-1/AD connection but I don’t often see the explanation that our researchers gave (i.e. it’s not that HSV specifically causes AD, it’s that AD might be partially caused by low-level infections in the brain more generally, and HSV is just a common culprit because it’s such a common virus). But I know the press often misses this kind of nuance when trying to translate science for a lay audience. And unfortunately I can’t go back to the researcher we were funding and ask him, because he’s passed away. \n\nThat was long-winded, sorry! Just wondering if you know anything about this? Does recent research suggest some more direct link between HSV and AD?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "HoneyBucketsOfOats",
                    "body": "Any truth to the rumor that hsv1 protects against hsv2?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "Sadly, not really.  Neither of those viruses elicits a protective immune response so any cross protective immunity is pretty limited at best. Definitely not something I’d put my confidence in.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "Sokodile",
                                    "body": "I definitely don’t know the answer but I wanted to expand on the rumor a bit \n\nI heard that people who contracted hsv-1 on the genitals are less likely to get genital hsv-2 since there is already a virus embedded in that area\n\nAnd also possibly less outbreaks since hsv-1 prefers the mouth? I tried searching up some definitive answers but for the most part, I don’t think I saw any concrete claims for this idea",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "HighOnGoofballs",
                                    "body": "Is there any prophylactic effect with acyclovir etc?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "johannthegoatman",
                                            "body": "Acyclovir suppresses replication but it's not thought to do much to stop an infection integrating into nerve ganglia. It's also inactive until activated by viral enzymes in infected cells, so it doesn't provide much protective effect. Some studies suggest that early administration of acyclovir after exposure (similar to post-exposure prophylaxis, or PEP, in other infections like HIV) might reduce the chances of infection or severity of initial symptoms. However, this is not as well-established as it is for other viruses. However if someone has HSV and takes it, it makes them much less likely to spread it (you probably already knew that part)",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 4,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "Cool hypothetical! The answer, based on how we understand neuroanatomiy, transplants, and also the virus is as follows:  \n\nIt would be highly likely that the transplanted tissue would show symptoms because the nerves that would grow into the transplant tissue are latently infected already",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "salamander_salad",
                    "body": "Question: I've had HSV-1 since before I can remember and I very rarely get cold sores these days, but I'm wondering if it's still possible to transmit it to my eye?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "danby",
                            "body": "Not really. Once you're infected at one site you will not get it at another site as you now have antibodies to prevent 2nd infections. However if you have HSV-1 you can still acquire HSV-2. You could get ocular HSV-2, that would be extremely rare as HSV-2 has a strong preference to infect genital mucus membranes (it isn't as \"promiscuous\" as HSV-1 is) and genital to eye contact isn't all the common (I think).\n\nIt is possible to become so immunocompromised you can get infections at 2nd sites though.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "salamander_salad",
                                    "body": "Thanks! That puts my mind at ease. Guess I have to stop having ocular sex, though.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "mejustnow",
                                    "body": "If someone typically got oral hsv-1, would it be unlikely for this to start presenting as genital? \n\nSeverity of outbreaks typically goes down over time, what makes the virus innervate a whole new area? \n\nThanks in advance!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "danby",
                                            "body": "If you have oral HSV-1 and you are healthy then it will never start presenting as genital. If at some future point you started having coldsores at your genitals the overwhelmingly most likely reason is that you have also picked up an HSV-2 infection.\n\n> Severity of outbreaks typically goes down over time, what makes the virus innervate a whole new area? \n\nNothing to my knowledge. You need a new HSV infection from the other type of HSV for a new area to become affected.\n\nTo my understanding the order of events is. If you are uninfected with either HSV strain (1 or 2)then it is possible but rare on first infection (before you have any HSV anitbodies) to pick up a multi-site infection but you'd have coldsores at all sites from day one. The most common infection pattern is to get an HSV infection at only one muscous membrane site. If you are healthy then the infection will be constrained only to the one site and you can not be re-infected elsewhere with the strain of HSV (1 or 2) that you already have. You can however pick up a second HSV infection elsewhere by being infect with the strain of HSV you do not have.\n\nBoth HSV-1 and HSV-2 can infect any mucous membrane but HSV-2 seems to have a strong preference for the genital mucosa. As I understand it there seems to be some inconclusive evidence that having one HSV strain infection gives you a mild but unreliable protection against the other strain.  I also understand that the the longer you go without outbreaks it seems people become less infectious but again the evidence here is poor and not well understood. It is certainly the case that you can pass on HSV1 or 2 without having a coldsore outbreak",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Positive_Riven_Kappa",
                                                    "body": "A lot of the replies further up say that ocular infection is most common through rubbing an oral outbreak and then touching the eyes. But you state that bringing the existing strain to a new site doesn't really happen because you're immune to that strain, how does that work?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "danby",
                                                            "body": "You can transfer an outbreak if the infection is new and you don't yet have antibodies",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rainbowcowrie",
                    "body": "As well as my nose and lips I sometimes get cold sores/HSV1 outbreaks on my philtrum which is non-mucosal skin. How was it able to infect here if it can’t bind to keratin? Also, were these different locations likely reinfections I gave myself as a child to multiple locations?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "Great question! Possibly either localize transmission as a result of a lip or mouth infection (usually require a split in the skin, but even chapped lips can do this) or maybe the infection happened in the nerve and so the philtrum infection occurred as result of a nerve or nerve body which bad both lips and philtrum nerves reactivating and spreading locally from within the skin.   So while the virus can’t infect keratinized skin from the outside, if it comes down an infected nerve into the skin at the surface of the face, then it bypasses that barrier.",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 7,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EchoRotation",
                    "body": "How does the HSV-1 lead to blindness? Is there a risk for carriers who only have oral symptoms?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "There is a risk, but primarily from what’s called “auto-inoculation” which is a fancy word for “I rubbed my mouth and then my eye”.\n\nThe blindness actually comes from scarring of the very thin layer of skin cells on the surface of the eye as a result of the virus infecting it and reactivating over and over again",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "eyesRus",
                            "body": "It can affect the eye in a few ways, but most commonly you’ll see blindness resulting from infection of the cornea that leads to scarring. Significant scarring of the cornea can be visually devastating. \n\nYes, people who have had only oral symptoms in the past can get ocular herpes. The virus can travel along nerves to get to the eye.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Disastrous-Capybara",
                    "body": "Is there any reliable test for HSV1 other than a swab when you have an outbreak?\nA blood test or so?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DanceApprehension",
                            "body": "There are blood tests for IgM and IgG that will show if you have antibodies to HSV 1 or HSV 2. Antibodies indicate exposure to the virus. ",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "damnitcamn",
                            "body": "As of right now there isn’t a better test that a salival swab, which looks for the genome of the virus present in saliva. The virus never enter the bloodstream or circulates the body nor does it cause a big immune response resulting in specific antibodies so a blood test unfortunately can’t reveal much",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "2mnycooks",
                                    "body": "If the virus never enters the bloodstream how does Valtrex stop outbreaks?",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Disastrous-Capybara",
                                    "body": "Thanks for the answer, really interesting!",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EEukaryotic",
                    "body": "Hi! I have a question unrelated to HSV-1 specifically. How did you get into this field? Are you a researcher? Im very interested in microbial research and would love to hear your story and experiences :)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "I fell in love with molecular biology as an undergrad, where I cut my teeth learning the lab methods in plants. From there I wanted to do a Ph.D. In something biomedical, and I was really fascinated by host-pathogen interaction at the level of inside the infected cell and how that works!  From there I was able to narrow down my interests to viruses, and an HSV-1 lab was looking for a student. And that’s how I found myself there! The need for a better and more comprehensive understanding of HSV-1 biology was huge at the time.\n\nI was in research for a while but departed for working in biotech, and I currently work in biotech/oncology diagnostics. I got into cancer through virology, because it turns out a lot of the things that viruses combat are also things that are broken in cancer.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "Great question!  Yes it absolutely is still possible to transmit the virus when not having an active sore or outbreak.  The virus can shed asymptomatically, though your chances of spreading it while having an outbreak are much higher since there's a lot more virus being made in the sore.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CrosbyAteHeathcliff",
                    "body": "Hello! I get an outbreak on the skin right above my knee. How could this have happened? It started in my early 20’s and I’ve maybe had about 10 or so outbreaks in the last 20+ years.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "vdreamin",
                    "body": "A question: Why doesn't it move to another location on your mouth? Like, why doesn't it just spread across your entire mouth/lips throughout the course of your life?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "damnitcamn",
                            "body": "Really fascinating question. I suppose it’s worth noting, first, that it does for some people but very much not for most. Why it is that recurrence is mostly a localized thing is a complex combination of the biology of nerves, the biology of the skin cells, and the immune system. The big reason is that it does cause a big local inflammation and so a bunch of immune cells are called in and they help suppress spread in a few ways. But this is a good question because we don’t yet know large pieces of the puzzle there!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RazorWritesCode",
                    "body": "You mention blindness as a result of an hsv-1 infection. \n\nHow does that happen? I typically refer to the reoccurrence of symptoms as a flare up. Can a flare up externally, something like the eyelid, lead to blindness? Or is there a specific, internal “flare up” that causes this? Or maybe I’m thinking about it wrong. Naturally, I think there’s a concentrated infection site when a flare up occurs. Does blindness happen quietly?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "crashlanding87",
                            "body": "Recurrent flare ups on the surface of the eye can cause scarring, which is what occludes vision",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "garrcixx",
                    "body": "I have another question, I know some people say you can’t be immune to HSV but others say you can, which one is true? I have never had any outbreaks, and I have no memory of my parents/brother ever having it, but my partner has and we’ve kissed and shared bottles etc while he had one, so what’s the science behind me not ever having an outbreak? Could i really be immune? Thanks!",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "gobliina",
                    "body": "Isn't chicken pox caused by HSV-1? If you had chicken pox, aren't you immune to other HSV-1 symptoms?",
                    "score": -8,
                    "replies": [
                        {
                            "author": "lobokart",
                            "body": "No, it is caused by a herpesvirus: HHV-3. There are several different ones.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "damnitcamn",
                            "body": "Previous reply nailed it: chicken pox and shingles are a herpesvirus, but not HSV-1 or HSV-2. That virus, called Varicella-Zoster Virus (VZV) is human herpesvirus 3.  Their are 8 human herpesviruses, and they also include the virus which causes Mono.\n\nHerpesviruses are a whole clade of viruses, and have normal hosts as disparate as bivalves like scallops to squirrels to humans and even reptiles.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "neuenono",
            "body": "Short answer: you develop immunity that is sufficient to stop infection at a new location (although it won't evict the original infection).  \n\nEdit: I now realize I didn't answer OP's specific question, which is more about which parts of the body are susceptible under *any* circumstances. Other replies covered that nicely. I hope my reply helps OP (and others) feel less anxious about self-transmission, though!  \n\nLonger answer: the process you're talking about is called autoinoculation, and there's a frustrating dearth of information about it (for HSV). [This article](https://www.stdcheck.com/blog/can-you-give-yourself-genital-herpes/) is dedicated to the topic, and it still fails to mention that it's very rare for someone to \"give themself\" HSV at a second site. When *does* it happen? Primarily two scenarios: (1) during an initial infection, when the person hasn't developed antibodies yet, and (2) when the person is severely immunocompromised (this is not a state that you simply wouldn't notice - you'd be incredibly sick and/or dealing with an actual immune disorder). For the latter case, [this article](https://www.bashh.org/_userfiles/pages/files/resources/hsv_2014_ijstda.pdf) (top-right on page 7) notes that eczema can impair skin's immune protection, making autoinoculation more common. I welcome additional links on this general topic - resources are scant. \n\nThis process of immunity & protection has implications for transmission *between* people as well. As oral HSV-1 has been in decline, rates of genital HSV-1 have increased in response. I believe [this image](https://www.researchgate.net/publication/331649399/figure/fig2/AS:735244898557964@1552307452759/Temporal-evolution-of-HSV-1-seroprevalence-in-the-US-a-Estimated-HSV-1-seroprevalence-in.png) captures the trend. In retrospect, oral HSV-1 was protecting lots of people from genital HSV-1. If two people both get cold sores, it's likely neither will ever get genital HSV-1 (low risk of oral-genital transmission).  \n\nThe real take-home here is that it's very important to be careful during an initial outbreak of oral HSV-1 (since getting it in your eye or your rectum would be drag). The first three months are the danger zone. After that, it's very unlikely that you'd give it to yourself, or to anyone else who already has HSV-1 *somewhere* on their body.",
            "score": 71,
            "replies": [
                {
                    "author": "tater_salad908",
                    "body": "Thank you for sharing these links! As someone with HSV and eczema, I have experienced this firsthand - blisters in seemingly random locations on my body. Most recently, my wrist developed a blister that was about the size of a quarter. Besides the location, they look identical to a cold sore.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "doc_cake",
                    "body": "if i have HSV 2 in my finger, does this mean is it extremely unlikely for me to ever get HSV 2 on my genitals?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "burning_hamster",
            "body": "1. Herpes viruses do transfer to other parts of the body. However, unlike neurons, most other tissues are not immunoprivileged. So when virions do infect other cells in your body, the immune reponse simply kills those cells with the viruses in them.  \n\n2. In the absence of wounds, new infections occur only through mucous membranes (mouth, genitals, eyes (!)), which are much easier to penetrate than your skin proper.",
            "score": 25,
            "replies": []
        },
        {
            "author": "PHealthy",
            "body": "HSV-1 escapes from the immune system by hiding out within nerve cells, namely the peripheral ganglia. Our nervous system is famously very bad at dealing with inflammation so the evolutionary balance that has been struck is for our immune system to basically ignore the inside of nerve cells.\n\nWhen outbreaks occur it's typically only within the innervated area of the ganglia they have infected. But you can always auto-inoculate yourself, i.e. physically spread the infection to other parts of your body.",
            "score": 55,
            "replies": [
                {
                    "author": "aggasalk",
                    "body": "But also more to the original question, after the initial infection, the immune system now has antibodies for the virus and generally can prevent infection of new cells",
                    "score": 20,
                    "replies": [
                        {
                            "author": "PHealthy",
                            "body": "And why CDC doesn't recommend general screening for HSV since the immune system largely controls the infection in most people.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "forbins",
                                    "body": "Because over half of the population is infected with it.  Additionally, what are you gonna do with a positive result?  Are you going to suppress over half of the population when only a small amount actually display symptoms?  \nHSV1 in most people doesn’t lead to severe disease. Screening is really only helpful when there is good treatment available, the disease has high morbidity or mortality data, it affects a  significant portion of the population, and treatment improves that data. \nTake hep c for example. We didn’t start screening the population for hep c until we had really good treatment available. Until that point,  there was little reason to screen those at normal risk and were asymptomatic.  Once there was a really good treatment available then screening made sense. \nComparing HSV to G/C, we screen for G/C because in asymptomatic young women, it leads to pelvic inflammatory disease and infertility, and treatment is simple and very effective. \nHSV is fairly mild in the grand scheme of public health in immunocompetent adults and there’s no cure, only suppressive therapy.",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jetztinberlin",
                    "body": "> Our nervous system is famously very bad at dealing with inflammation\n\n\nCan you say a little more about this, or point me to somewhere that does? This is a big point of interest for me!",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Ok-Office-6645",
                            "body": "Right?!!! Ong can we please get  new entire post about this. Fascinating !! I want to know so much more about",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Jetztinberlin",
                                    "body": "Well, I know a little (chronic inflammation being both a cause and an effect of many, many conditions and ailments) but it sounds like the OC knows more :)",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Ok-Office-6645",
                                            "body": "oh yes, chronic inflammation is no bueno. but inflammation is also a fundamental part of our bodies immune system…. We just have to keep it in check somehow. I’m curious about the central nervous system tho… curious if it involves gut bacteria in any way, or does the inflammatory process have to cross the bbb? Ir is it more like things that cross the bbb like alcohol/ or sleep deprivation /lack of exercjse, the CNS suffers chronic inflammation from constant ambush?",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ok-Office-6645",
                                            "body": "I want to know more!! I have lots of theories developing but they are based on purely my guesses of what stresses the CNS. But I feel like we have the least knowledge of CNS diseases like neurodegenerative like Parkinson’s or Alzheimer’s… or are we talking about strokes and their pathology… or autoimmune… or depression even. I’m so curious…\n\nLike even blood coming to and from the brain … so like sleep apnea & not getting enough oxygen? Gosh there is so much to know",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tryknj99",
            "body": "It also has the potential to ride a facial nerve into your brain and cause hermetic encephalitis. It’s similar to NMDA receptor encephalopathy, with awful hallucinations and feeling like you don’t exist. It’s often fatal. \n\nIt’s rare for this to happen. But it can. \n\nSide note: so many people have HSV-1 and don’t know it. You can be asymptomatic your entire life. Your body is usually good at dealing with it, but another disease can weaken you and cause a flare up. This is why chicken pox becomes shingles later in life.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Lkes5",
            "body": "Hijacking this, as this is my greatest obsessive fear - what is the realistic likelihood of transference of hsv-1 to another body part? For example, cold sore on lip in blister stage, touch with finger and then touch eye.",
            "score": 6,
            "replies": [
                {
                    "author": "PM_ME_UR_ROUND_ASS",
                    "body": "The risk of transfering HSV-1 from lip to eye is actually pretty low if you have had HSV-1 for a while. Your body developes antibodies that help prevent new infection sites. That said, during active outbreaks always wash your hands after touching a sore and avoid touching your eyes - it's just good practice even tho the chances are minmal.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Lkes5",
                            "body": "But that's what I want to know - how minimal? Otherwise I end up washing and using purell way too much",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Snuggle_Taco",
            "body": "It CAN spread to other parts of the body. Herpetic whitlow refers to HSV on the hands / fingers, typically associated back in the day before dentists regularly wore gloves. It just isn't as prone to spreading to areas it's not designed to infect. ",
            "score": 9,
            "replies": []
        },
        {
            "author": "NewOldSmartDum",
            "body": "Can HSV2 present orally? I’ve gotten cold sores occasionally since teen years (50s now) and have never had any genital issues, but I did the whole slate of tests after getting roofied a few years back and came back positive for both 1 and 2. Could they both be oral?",
            "score": 5,
            "replies": []
        },
        {
            "author": "quinndiesel",
            "body": "HSV1 is far more common with almost universal infection by late adulthood. It is typically seen on the mouth, but can erupt anywhere it initially makes contact (skin, rectum, lips, etc).  It is a far more common cause of genital sores than HSV 2.   Episodic recurrences occur anywhere initial contact was made. Either can cause sores anywhere.",
            "score": 5,
            "replies": []
        }
    ]
}