{
    "title": "Gravity Vs Electromagnetism, why do the planets orbit via gravity and not EM?",
    "author": "AshenCraterBoreSm0ke",
    "subreddit": "askscience",
    "rank": 2,
    "score": 24,
    "upvote_ratio": 0.56,
    "num_comments (reported by reddit)": 53,
    "url": "https://www.reddit.com/r/askscience/comments/1jee12l/gravity_vs_electromagnetism_why_do_the_planets/",
    "id": "1jee12l",
    "selftext": "So, this question has bothered me for the better part of a decade. Why is it that gravity, being a weaker force than EM, dictate the orbit earth? I have been told because the earth and our star are electrically neutral in a microscopic scale, but this doesn't make any sense to me. If you look at an illustration of the EM produced by our planet you can see the poles, in my mind this has always represented the positive and the negative. Is that incorrect? \n\nOur magnetic north pole has moved more in recent years than in recorded history, it now floats around Siberia, our climate is changing and has been changing even more rapidly since 2017 when the pole shifted over 300 miles. If you pay attention to the jet streams in our atmosphere and the \"unusual\" storms that are occurring across the globe, they actually line up with where they would be if we were orbiting via EM. \n\nSomeone please prove me wrong cause I'm tired of thinking about this every day and every resource and every person telling me I'm crazy for thinking this.",
    "comments": [
        {
            "author": "Weed_O_Whirler",
            "body": "So, the Earth and Sun are both electrically neutral, so there is no electrostatic attraction (or repulsion) between them. So, that leaves magnetism. And it is true, both the Sun and Earth have a magnetic field, so their magnetic fields should interact. However, the magnetic field from a dipole falls off at 1/r^(3), so at far distances ( and the Sun is ~150M km or ~90M miles away, which is really far), the force is very small. That is why gravity dominates, because even though gravity is the \"weakest\" force, gravitational attraction falls off at 1/r^(2) so at far distances, it can \"beat out\" magnetism.",
            "score": 1,
            "replies": [
                {
                    "author": "Xaxafrad",
                    "body": "Do any fields fall off at 1/r distances? Or 1/r^4 ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Weed_O_Whirler",
                            "body": "Kind of? Depending on what you mean. \n\nFor instance, the potential field falls off at 1/r, but potential fields are not directly measurable. And the gradient of the potential field is the electric (or gravitational) field (which is what turns that 1/r into a 1/r^(2). \n\nAlso, the electric field from an infinite line of charges will fall off at 1/r. Of course, you can never have an infinite line of charges. But, if you have a \"long\" line of charges, such that your distance away from the charge is small compared to the length of the line of charges, then a 1/r fall off will approximate the actual measured falloff.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Xaxafrad",
                                    "body": "I don't know what I mean, I guess. I'm kind of dumb, but not completely.\n\nYou said magnetism falls of at r^-3 while gravity falls off at r^-2 . To me, that begs the question of what falls off at r^-1 and r^-4 . I can understand if the nature of expressing geometric spacetime physics as math equations preclude a field falling off at r^-4, making it absurd to ask such a question.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DoisMaosEsquerdos",
                                            "body": "Falling off at 1/r2 is a natural consequence of living in 3D space, since it's the expansion rate or anything radiating outwards into space.\n\nIt follows from this that things that durably decrease at a smaller rate cannot represent physical quantities, while things that decrease faster are generally some form of differential between two or more competing forces, like the plus and minus sings of a dipole. It can definitely go beyond 1/r3: for instance, you get 1/r6 and 1/r7 factors in Van der Waals forces, and from what I recall the highest factor to ever appear in a physical formula is something like r^15",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bayesian13",
                                                    "body": "to amplify this, in case it's not obvious, it falls off at 1/r^2 because that is the surface area of a spherical shell (i.e. 4*pi*r^2). so if a force emanates from a point and spreads out in 3-d space, then at a distance r the force has to be spread out on the surface of a sphere of radius r.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SkoomaDentist",
                                                    "body": "So the real question is why does magnetism fall off at 1/r^3 instead of 1/r^2?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "matthoback",
                                                            "body": "Magnetism in the real world falls off at 1/r^3 because it's a dipole force. A magnetic north pole is always accompanied by a magnetic south pole. If magnetic monopoles existed, they would create a magnetic field that falls off at 1/r^2 just like the electric field does.\n\nElectric dipoles exist too. If you set up a situation where you have a bunch of positive charges separated some distance from an equal number of negative charges, you will create an electric field that falls off like 1/r^3 just like the magnetic field.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "laix_",
                                                                    "body": "iirc, dipoles fall off at r^3 because the two poles almost cancel out, but not quite, providing a sharper fall-off.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "SkoomaDentist",
                                                                    "body": "Since I can’t do the math from scratch right now, is that 1/r^3 for magnetic field also only valid in the far field like it is for an electric dipole? Ie. when the r >> the length of the magnet?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "matthoback",
                                                                            "body": "Yes. If r is much smaller than the length of the magnet but larger than the width or radius of the magnet, you can assume the magnetic field is created from two point magnetic charges and use an analogue of Coulomb's Law (which falls off as 1/r^2 ) instead of the dipole formula.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Ballsackavatar",
                                                                                    "body": ">but larger than the width or radius of the magnet, you can assume the magnetic field is created from two point magnetic charges and use an analogue of Coulomb's Law (which falls off as 1/r^2 ) instead of the dipole formula.\n\nAt a distance between r and r² would this fall off be linear?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "nelzon1",
                                                                                            "body": "In close proximity to a dipole the field is more complicated and not comparable to a spherical shell. It's a shape you can look up, but this is all to say, \"it's complicated\".",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Weed_O_Whirler",
                                                            "body": "It's not that magnetism falls off at 1/r^(3) it's that dipoles fall off at 1/r^(3). Electric dipoles also fall off at 1/r^(3). \n\nIf you found a magnetic monopole, you would (a) have a Nobel prize and (b) find that its magnetic field would fall off at 1/r^(2)",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ezekielraiden",
                                                            "body": "If you could get an isolated north or south magnetic pole, then its magnetic influence would decrease that way.\n\nSee, the arrangement of the parts matters for how the force falls off. As was mentioned earlier, if you could have a truly infinite line of electric charges, then the electric field from it would fall off as 1/r, rather than 1/r², because the little tiny contributions from all the infinitely many points of electric charge slow down the rate of fall-off.\n\nOther arrangements can make the falloff happen faster or slower. As an example, you can have an electric dipole, where you have a positive electric charge and a negative electric charge right next to each other. The electric field produced by this dipole will fall off *faster* than either charge alone, because they are partially cancelling out one another. You can think of it as the *positive* field falls off as 1/r², and the *negative* field also falls off as 1/r², but the two stacked on top of each other result in less excitation, exactly the same as if it were one single electric field falling off at 1/r³, at least when you're sufficiently far away. If you're very close, meaning the distance away from the dipole is of similar size to the distance between the two charges, the field is much more complicated.\n\nThe thing is, as far as we know, you can't have a \"magnetic charge\". *All* magnetism, as far as we know, always has both a positive pole and a negative pole. Hence, you can't have things like the infinite line of charges. You're stuck *always* having the magnetic dipole geometry, which causes the magnetic field to fall off as 1/r³ because the \"north charge\" (if such a thing existed) is partially cancelling out the \"south charge\", just like the electric dipole above.\n\nGravity cannot have such cancellations, however, because it doesn't *have* two types of charge. It only has one: mass. As far as we know, no forms of matter exist that have negative mass. As a result, you can't set up any form of cancellation, and thus gravity never has anything like a dipole that can reduce its measured strength.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "GraviTeaTime",
                                                            "body": "Because (to our current knowledge) magnetic monopoles do not exist, indicated by one of Maxwell’s equations (Gauss’ law for magnetism) that specifies the divergence of the magnetic field is identically zero. Both the electric and magnetic dipoles have a 1/r^3 dependence, but you can have electric monopoles that scale as 1/r^2 . There are also higher order terms in the multipole expansion that will have different scaling (1/r^4 for the quadrupole and 1/r^5 for the octupole). The monopole term will dominate at large distances if it is nonzero.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "kajorge",
                                                                    "body": "A shame that I had to scroll this far for this very direct answer to the question. I'm linking it higher up and crediting you.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Bunslow",
                                                            "body": "Click these images! https://en.wikipedia.org/wiki/File:Spherical_Harmonics.png and https://en.wikipedia.org/wiki/File:Sphericalfunctions.svg)\n\nIt's more precise to say that dipole forces fall off at 1/r^3, and that because there are no magnetic monopoles, any magnetic field is automatically dipolar or higher-polar.\n\nBy contrast, monopole fields fall off as 1/r^2, and monopole fields include \"normal\" forces such as electricity (due to net electric charge) and gravity (due to net gravitational mass).\n\nThe first rows of the images are the monopoles, with 1/r^2 scaling, the second rows are the dipole fields with 1/r^3 scaling, and lower rows are higher-order poles with weaker scaling.\n\nAt larger and larger distances, the higher-order poles become relatively weaker; get far enough away and only the dipole+monopole are measurable, and if you get further still, only the monopole alone is measurable. Planets and stars are at sufficiently large scales that any monopole field will dominate any corresponding dipole or higher-pole field -- only the first row of the images matter as far as planets' orbits are concerned.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Mechasteel",
                                            "body": "The r^-3 is an approximation of the difference of two opposing r^-2. You can see this if you work out 1/r^2 - 1/(r+1)^2 then cross out the smaller terms.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "spline_reticulator",
                            "body": "There are some very specific electric fields that fall off at 1/r. The electric field of an infinite line charge falls off at 1/r as you move away from the line. An oscillating electric dipole also falls off at 1/r when your very far away from it. But no fundamental force fields fall off at 1/r.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "kajorge",
                            "body": "See /u/GraviTeaTime's answer below ([linked here](https://old.reddit.com/r/askscience/comments/1jee12l/gravity_vs_electromagnetism_why_do_the_planets/miiwaga/)).\n\n* If you have a single electric charge like a proton, we call it a monopole. Its electric field falls off like r^-2\n\n* If you have a positive and a negative electric charge next to each other, we call it a dipole. Its electric field falls off like r^-3\n\n* If you make a square of alternating positive and negative charges, we call it a quadrupole. Its electric field falls off like r^-4\n\n* If you make a cube of alternating positive and negative charges (not unrealistic, this is basically what a salt crystal is, alternating Na^+ and Cl^- ), we call it an octopole. Its electric field falls off like r^-5\n\nAll of this applies to magnetic fields too, except that we have never found an isolated magnetic charge. There's never a north pole without a south pole - they always come paired. This means there is no magnetic monopole field, but there are still magnetic dipole, quadrupole, and octopoles. \n\nThese are all described as \"moments\" of a charge distribution. You can learn more about them in many standard electrodynamics text, though the math is a little heavy. Griffiths *Introduction to Electrodynamics* is the standard choice for undergrads. It's chapter 3, under \"Multipole Expansion\", terms that can also be Googled, though the resulting math soup may melt the mind for those not used to the notation.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Underhill42",
                            "body": "Not really.  Everything that propagates through 3D space falls off as 1/r².  Basically, the surface of the sphere (segment) that it passes through increases with r², and  since the amount of \"stuff\" spread across that surface remains constant, the amount over any unit of area falls off as the inverse of the total area the \"stuff\" is spread over. (the \"butter gun\" is a common example)\n\nMagnetic fields are a bit weird though since they're self-cancelling.  A magnetic monopole (e.g. a \"north pole\" with no \"south pole\" attached) would have mangetic field lines that extend to infinity, just like gravitational or isolated electrostatic field lines do, and would fall off with the same 1/r² as everything else.\n\nBut since they don't exist, and real-world dipole magnetic fields loop back on themselves, the further you get from the magnet the more magnetic field lines have a chance to loop back on themselves and cancel out, so there's fewer and fewer total magnetic field lines the further you get.  The total falls off as 1/r, and since the total is falling with distance, when combined with the same 1/r² for how much total surface area it has to be spread across, you get the \"weird\" 1/r³ result.\n\n(I should qualify this with the fact that the subatomic nuclear forces have their own REALLY weird things going on, and behave nothing at all like the macroscopic forces... but that's a conversation for another day, and is not really relevant to anything larger than a atomic nucleus anyway.)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PM_ME_UR_ROUND_ASS",
                    "body": "Also worth noting that the orientation of magnetic fields would actually cause planets to be pushed away from the sun rather than pulled into orbit, since magnetic dipoles create forces perpendicular to motion, not the centripetal force neccesary for stable orbits like gravity provides.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AshenCraterBoreSm0ke",
                    "body": "Thank you for the detailed answer! I am in no way around physicist or even educated, really. My math extends a little beyond what I need to know in construction. So, why is it that if gravity falls off at 1/r² and magnetism at 1/r³... that gravity is stronger over the longer distances? If the fall off distance between the two objects is squared vs cubed, wouldn't mannerisms fall off be a longer distance?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "andreasbeer1981",
                            "body": "it's not squared vs cubed, but 1/squared vs 1/cubed. the faster the number under the 1/ grows, the quicker it's diminishing.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Greyswandir",
                                    "body": "To give a concrete example image two objects one of which is 1 unit away from the sun and one of which is 2 units away.  The second object will experience 1/4 the gravity that the first object experiences but will experience 1/8 the EM forces.  The more we increase the distance the bigger that disparity grows.  Imagine the second object is 100 units away.  Now it experiences 1/10000 the gravity but 1/1000000 the EM forces.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "alcaizin",
                            "body": "The radius term is in the denominator of those calculations - 1/r^3 is smaller than 1/r^2 for any value of r greater than 1. So the effect of gravity will dominate over large distances. Let's say for the sake of a basic example the strength of both fields is the same and can be expressed as a simple number, and the radius can also be expressed as a simple number. If both fields have a strength of 10 units, and we look at a point 1 unit away from the center, then at that point each field would have the same effect - 10/1^2 = 10 = 10/1^3. If we chose a point two units away from the center, the gravitational field is stronger - 10/2^2 = 10/4 = 2.5, 10/2^3 = 10/8 = 1.25. If we chose a point 1/2 unit away from the center, the magnetic field is stronger - 10/.5^2 = 10/.25 = 40, 10/.5^3 = 10/.125 = 80.\n\nObviously a real-world example would be much more complex, and involve some unit conversions - hope this helps though!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RainbowCrane",
                                    "body": "Also, from a magnitude perspective even if there weren’t the difference in rate of falloff the mass of the earth is large enough that gravitational attraction exceeds magnetic attraction/repulsion from the strength of its magnetic field. Even maglev trains aren’t depending on repulsion from the earth’s magnetic field, they “levitate” using opposing magnetic fields in the track and the train. \n\nAt the surface of the earth the earth’s magnetic field has a strength of ~.25-.5 G.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ezekielraiden",
                            "body": "Since you mentioned construction, let's use some concrete numbers.\n\nImagine you have something pulling with a force of 100 pounds, reduced with the square of distance (in feet), while you have another pulling at 1,000,000 pounds, reduced with the cube of distance.\n\nClearly, when you're close by, the million pound force is way way bigger! But let's check what happens when we divide by bigger and bigger numbers.\n\n1 foot away: no change, because 1²=1³=1.   \n2 feet away: 100/2² = 100/4 = 25; 1,000,000/2³ = 1,000,000/8 = 125,000    \n5 feet away: 100/5² = 100/25 = 4; 1,000,000/5³ = 1,000,000/125 = 5000   \n10 feet away: 100/10² = 1, 1,000,000/10³ = 1,000\n\nAs you can see, even having moved only 10 feet away, the huge force has already dropped enormously faster than the small force. At the start, the bigger force was ten thousand times bigger. At ten feet away, it's only a thousand times bigger. If we go out to ten thousand feet...the two become *equal.* And beyond that point? The force that falls off as 1/r² will *always* be stronger.\n\nAs a result, gravity is the force that dominates over long distances. It is too difficult to get electrostatic attraction at large scale because matter is made of a mix of positive and negative charges. It's impossible to get strong enough magnetic attraction at large distances because magnets always come in paired north-and-south dipoles, which weaken the magnetic attraction at large distances like outer space.\n\nOnly gravity, which only has one \"charge\" (positive mass), can exert the necessary force at cosmic distances. It's the weakest of the fundamental forces, but all of the others cancel out or fall off too fast. Only slow-and-steady gravity holds things together consistently enough to allow stable structures like solar systems and galaxies.\n\nAnd, just in case you think this must mean gravity is truly strong, remember that a little tiny refrigerator magnet is strong enough to resist the gravitational pull of *the whole Earth*...over very short distances. But unlike the Earth, which has a gravitational pull that we have to go a huge distance to escape, even our most powerful magnets are totally imperceptible at a distance of a few km/miles.\n\nIt takes an Earth-sized object to do gravity at this scale, but that Earth-sized object has a reach that no other fundamental forces can match. A weak force, but one that eventually dominates at large distances.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "El_Sephiroth",
                            "body": "If r = 2, gravity falls at 1/2²=1/4=0,25 and magnetism at 1/2³=1/8=0,125.\n\nGravity =0,25 is superior to Magnetism=0,125.\n\nIf r = 3, G = 0,111 and M = 0,037. Etc...",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "kindanormle",
                            "body": "1/r2 = 1, 0.25, 0.11, 0.0625, 0.04\n\n\n1/r3 = 1, 0.125, 0.037, 0.016, 0.008\n\n\nAs you can see, by the time r is 5 the forces are 0.04G vs 0.008EM. Put another way G is over six times stronger at a distance of 5 units. Units can be whatever you want, inches, feet, miles, lightyears, whatever.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EricTheNerd2",
                    "body": "If Q snapped his fingers and the Sun became electrons with the same mass as the original Sun and the Earth became protons with the same mass as the original Earth, what would the new orbit look like?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "forte2718",
            "body": ">If you look at an illustration of the EM produced by our planet you can see the poles, in my mind this has always represented the positive and the negative. Is that incorrect? \n\nYes, this is very incorrect.  The poles (depending on exactly which ones you are talking about) represent the axis for Earth's rotation, or for the North and South poles of Earth's magnetic field.  They do not represent anything having to do with electric charge.  The average electric charge at each of the poles is zero, just as it is across the entire surface of the Earth.\n\n>If you pay attention to the jet streams in our atmosphere and the \"unusual\" storms that are occurring across the globe, they actually line up with where they would be if we were orbiting via EM. \n\nNo, they don't ... that's just a silly claim to make.  If we were orbiting due to electromagnetic forces, then we would expect to have spiralled into the Sun already by now, as well as for both the Earth and the Sun to have opposite, net electric charge (which they measurably do not).\n\nYou seem to be trending in the direction of a long-debunked, crackpot pseudoscientific idea known as \"[plasma cosmology](https://en.wikipedia.org/wiki/Plasma_cosmology).\"  The problems with plasma cosmology in explaining observations are serious, and exhaustingly large in number.  It is not taken seriously by any respectable cosmologists because it is simply wrong at face value and not even remotely compatible with observations.  Proponents of this pseudoscientific idea typically ignore most of the scientific evidence against it, focusing only on the few things which could potentially be explainable with it.  However, you cannot just ignore most of the cosmos when you are attempting to make a working model of the cosmos ...",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShelfordPrefect",
            "body": "> If you look at an illustration of the EM produced by our planet you can see the poles, in my mind this has always represented the positive and the negative. Is that incorrect?\n\nThat is incorrect - the north and south poles of a magnet are not the same as positive and negative electric charge - but even if they were charged that way, if they had the same magnitude, from a distance their effects would cancel out and the earth would appear electrically neutral",
            "score": 1,
            "replies": []
        },
        {
            "author": "pavilionaire2022",
            "body": ">I have been told because the earth and our star are electrically neutral in a microscopic scale, but this doesn't make any sense to me. If you look at an illustration of the EM produced by our planet you can see the poles, in my mind this has always represented the positive and the negative.\n\nThat's magnetic, not electrical. It's still quite weak. Drop a magnet. Which way does it go, north or down? If you carefully balance a magnet so it can't fall down and has low friction, then you can get it to point north, but magnetism decreases with distance even faster that electric attraction, so this has even less effect on the pull between the Earth and the sun.\n\nEarth has to be electrically neutral, or pretty close to it, because like charges repel. If Earth had enough unbalanced like charges to attract another celestial body, it would have enough like charges to blow itself apart.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PckMan",
            "body": "Your assumptions about the Earth's electromagnetic field affecting climate change and the \"unusual\" storms that \"line up\" with the Earth orbiting via EM is based on what exactly? Because pardon the bluntness but it's complete baloney and something you've probably read somewhere. \n\nThe simple answer is that yes gravity is weak but planets and stars are massive. Also despite it being weak there is nothing to oppose it, nothing to repulse such masses away from each other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spline_reticulator",
            "body": "Matter with an electrical charge isn't very stable. Most matter that is not electrically neutral will be attracted towards matter with the opposite charge and undergo a chemical reaction with it that leaves both pieces of matter in a closer to neutral state. This obviously isn't 100% true. Electrically charged matter does exist, but it's a deviation from the steady state, rather than the steady state itself. \n\nNegative matter/energy (while hypothesized to exist in certain exotic circumstances) for all practical purposes does not exist. So the same dynamic does not take place for gravity. This means gravity rather than electromagnetism is the dominant force on macroscopic distances.",
            "score": 1,
            "replies": []
        },
        {
            "author": "weather_watchman",
            "body": "Magnetic dipoles are electrically neutral. In near enough proximity the poles of each celestial body could interact, but not without interacting simultaneously with the opposite pole as well. As the distance between the bodies becomes sufficiently large (like some multiple of the smaller's diameter) the overall charge would act like a point charge with the total charge of the planet, which again is zero for dipoles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chassian",
            "body": "Does gravity affect EM, or does EM affect gravity? Well, if gravity can bend light, it would seem to suggest that EM is subject to influence from gravity. Gravity is the topology of space-time, EM comes from quantum states of matter, it's like one is water, and the other is the fish in it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "the-software-man",
            "body": "Gravity is a small force multiplied by great mass that influences over long distances. \n\nEM is a great force that works over very short distances. \n\nAtomic forces are even greater but only work over even shorter distances.",
            "score": 1,
            "replies": [
                {
                    "author": "Weed_O_Whirler",
                    "body": "EM has the same \"reach\" as gravity. The reason gravity dominates over long distances is because large bodies are electrically neutral. If you had charged objects separated by long distances, the EM forces would dominate over gravity.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}