{
    "title": "Hey r/movies! In 2020, we ran a city council campaign, leaked a sex tape to the media, and they all thought it was real. It was all part of this Borat-style comedy called Citizen Weiner. It's currently out on Tubi. We're Zack, Joe, Sarah (writers/stars) and Daniel (director). Ask us anything!",
    "author": "CitizenWeinerAMA",
    "subreddit": "movies",
    "rank": 0,
    "score": 0,
    "upvote_ratio": 0.42,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.youtube.com/watch?v=J_OO4OaUOvk&themeRefresh=1",
    "id": "1je405s",
    "selftext": "",
    "comments": [
        {
            "author": "BunyipPouch",
            "body": "This AMA has been verified by the mods. Zack, Joe, Sarah, and Daniel will be back with us at 3 PM ET to answer any questions :)\n\nInformation from the filmmakers:\n\n-------------------------------\n\nHey r/movies! We are the team behind Citizen Weiner, an indie comedy film that premiered at Slamdance and that's now streaming free on Tubi for a limited time. We are Daniel Robbins (director), Zack Weiner (actor/writer), Joe Gallagher (actor/writer), and Sarah Coffey (actress). We also made Pledge, which is on Hulu.\n\nAsk us anything! We will be back at 3:00 PM Eastern time today Tuesday 3/18 to answer your questions.\n\nWatch for FREE on Tubi (for a limited time):\n\nhttps://tubitv.com/movies/100032501/citizen-weiner\n\nTrailer:\n\nhttps://www.youtube.com/watch?v=J_OO4OaUOvk&themeRefresh=1\n\nOur verification photos:\n\nhttps://i.imgur.com/teDsafq.jpeg\n\nTalk to you soon!",
            "score": 1,
            "replies": []
        },
        {
            "author": "solidgoldrocketpants",
            "body": "Are you concerned that your movie will disappear because many people are sick of politics and may not want to watch a \"politicians are wacky and the media is complicit lol\" farce at this moment?",
            "score": 14,
            "replies": [
                {
                    "author": "swoopy17",
                    "body": "Disappearing implies it had any traction to begin with.  \n\nDon't need to watch a \"borat style\" political comedy when I can just turn on the news.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "CitizenWeinerAMA",
                            "body": "We have some traction! About eight comments at the moment but maybe more people will show up\n\nThis movie's a little different from Borat because Zack actually ran for city council in real life while we were making the movie. So it blurs the line between what's real and fake. Like when we have Colbert speaking about him it actually happened on his program (you can skip to 9:00 - [https://youtu.be/UMGwFunSl1Q?si=foncAEi-L7LBvszu&t=540](https://youtu.be/UMGwFunSl1Q?si=foncAEi-L7LBvszu&t=540) )\n\nHaving said that, I get not wanting to even touch politics with the news that's around us",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SeriousButton6263",
                                    "body": "> We have some traction! About eight comments at the moment",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CitizenWeinerAMA",
                    "body": "This is a great question and we were worried about this too. Zack and Joe actually came up with the idea after the first time Trump was elected. They felt like politics has become so insane and fake and wondered if there's anything left there. So the movie is less about \"look how whacky politics is!\" and more about \"Ok, yes it's crazy, but what can we do with that?\" And the answer at the end of the film seems to be to focus on local politics and our communities. In the film, Zack (the candidate) is so focused on getting national attention, but in the end realizes the best approach is to focus on his pocket of the world. Something that I know sounds corny might resonate more now that national politics are crazy once again - Daniel",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sadmep",
                    "body": "This is kinda my reaction as well.  I've got enough politicians behaving badly IRL that I don't know that I need to spend an hour and a half watching someone's film that plays it off like a joke.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CitizenWeinerAMA",
                            "body": "We agree. That's why the movie's just 80 minutes",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sadmep",
                                    "body": "I feel a bit bad that these are the responses you're going to get, I can tell the team believes in this movie and you've all put a lot of hard work into.  Good luck!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CitizenWeinerAMA",
                                            "body": "Thank you sadmep. It was made on a micro budget and we spent 101 days shooting (because the real life campaign spanned many months) and 2 years editing so we hope it shows",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fritzschmied",
            "body": "Sadly it seems geolocked :(",
            "score": 4,
            "replies": [
                {
                    "author": "CitizenWeinerAMA",
                    "body": "Send us a message and we'll get you a link",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Fritzschmied",
                            "body": "Done",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cmgr33n3",
            "body": "Is your next project going to be a Cops-style mockumentary where you pretend to arrest innocent people because America is craving the light hearted foolishness take on the systemic corruption coursing through the law enforcement system and you're just so zany?",
            "score": 4,
            "replies": [
                {
                    "author": "CitizenWeinerAMA",
                    "body": "Yes we're in discussions now",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bigfoot_Cain",
            "body": "I saw the trailer and this looks funny and well-made, so congrats!  \n\nHonest question: do you feel that Trump’s win in 2024 will take a lot of wind out of your project’s sails because whatever wackiness you portrayed in your candidate cannot compete with real life in 2025 after a literal convicted felon and adjudicated sex offender who ran on a platform of retribution against his enemies won the presidency?",
            "score": 1,
            "replies": [
                {
                    "author": "CitizenWeinerAMA",
                    "body": "Thanks for watching the trailer Bigfoot. We were worried about this but think the movie might work even better in this cilmate. The spirit of the movie is less about \"Look how crazy things are\" and more about \"Now that things are so crazy, what can we do?\" I hope the ending scene gets this across - Daniel . Also \"running on a platform of retribution\" would be funny in local politics, almost wish we used that but couldn't have predicted this",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CitizenWeinerAMA",
            "body": "Hey r/movies! We are the team behind Citizen Weiner, an indie comedy film that premiered at Slamdance and that's now streaming free on Tubi for a limited time. We are Daniel Robbins (director), Zack Weiner (actor/writer), Joe Gallagher (actor/writer), and Sarah Coffey (actress). We also made Pledge, which is on Hulu.\n\nAsk us anything! We will be back at 3:00 PM Eastern time today Tuesday 3/18 to answer your questions.\n\nWatch for FREE on Tubi (for a limited time):\n\n [https://tubitv.com/movies/100032501/citizen-weiner](https://tubitv.com/movies/100032501/citizen-weiner)\n\nTrailer:\n\n[https://www.youtube.com/watch?v=J\\_OO4OaUOvk&themeRefresh=1](https://www.youtube.com/watch?v=J_OO4OaUOvk&themeRefresh=1)\n\nOur verification photos:\n\n[https://i.imgur.com/teDsafq.jpeg](https://i.imgur.com/teDsafq.jpeg)\n\nTalk to you soon!",
            "score": -2,
            "replies": []
        }
    ]
}