{
    "title": "TF2 Weapon Discussion #5 - The Gunboats",
    "author": "_AirMike_",
    "subreddit": "tf2",
    "rank": 0,
    "score": 8,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 51,
    "url": "https://www.reddit.com/r/tf2/comments/1j9v21g/tf2_weapon_discussion_5_the_gunboats/",
    "id": "1j9v21g",
    "selftext": "Welcome to our Wednesday TF2 weapon discussion. Here, we'll discuss weapons (and reskins, if applicable) from TF2!\n\nToday's weapon is The Gunboats.\n\nWeapon Stats:\n- -60% blast damage from rocket jumps\n\nThe Gunboats were first introduced in the WAR! update. Interestingly enough, the in-game files mention `c_rocketboots_demo` due to the WAR! update being a competition between the Soldier and Demoman. Soldier received The Gunboats by winning the competition and killing more Demomen.\n\nGunboats are widely used to [Rocket Jump](https://wiki.teamfortress.com/wiki/Jumping#Soldier_jumps) as the Soldier to cross map distances very fast. Due to Rocket Jumping inflicting damage on the Soldier, The Gunboats are a great asset in reducing said damage and making sure his health doesn't drop during the traversal and before any potential firefights.\n\nFeel free to discuss the weapon here. Anything that you like/dislike, cool tips or strategies, interesting stories, etc. If you feel the weapon is not to your liking, feel free to express your opinions in a respectful manner.\n\nFor those who wish to learn more about the weapon, you can find the wiki page here:\n\n[The Gunboats, from the TF2 Wiki](https://wiki.teamfortress.com/wiki/Gunboats).\n\nYou can find previous weapon discussions in a nice overview [here](/r/tf2/wiki/weapon-discussion-archive).",
    "comments": [
        {
            "author": "bread-dreams",
            "body": "the goat\n\nthe funniest part is when you overestimate how much damage this thing protects you from then you proceed to rocket jump with 10 hp and explode yourself",
            "score": 12,
            "replies": []
        },
        {
            "author": "Tilde_Tilde",
            "body": "Feel like this and the Crusader Crossbow are incredibly busted but get to exist because they're fun and interesting to use. Doing a set of rocket jumps running someone down and still having 50-75% of your health. It's huge anti agency for other players. \n\nLegit makes him the best pick class in the game. Has only made the weaker classes feel worse Spy in particular.\n\nIt's fun to use but it's super bad for the game as a whole. Saying that I don't think I'd change it though.",
            "score": 8,
            "replies": [
                {
                    "author": "4Lukaska_SSB",
                    "body": "The game would be 100x worse without the xbow and boots lmao what.\n\nHow does the gunboats take away agency when soldier is the funnest class to fight against SPECIFICALLY because you have so much agency against him due to how rockets work.\n\nWith medic I could see a case for getting mad that some person you wanted to kill got clutched by an arrow but that it actually works out because it gives the medic agency. Which is actually a really good thing because med really lacks agency and it’s a big reason why he’s so unpopular. There’s also the additional upside of improving gameflow for other classes since they don’t have to stand idle doing nothing for 10 seconds every time they take damage in order to build crit heals (or even worse spend 30 seconds scouring the map for health packs or just dying and looking at the respawn screen).\n\nLike if the crossbow got deleted overnight I would frame 1 drop this game, both as a medic player and as a general player as well.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "dropbbbear",
                            "body": "The truth is somewhere inbetween both your opinions, Crossbow definitely makes Medic more fun/skilled to play... but it's also undeniably a buff in effectiveness to a class that is already mandatory to win.\n\nOn top of that, the amount of additional healing it pumps in is bad for the game in ways that become more noticeable at smaller playercounts:\n\n>There’s also the additional upside of improving gameflow for other classes since they don’t have to stand idle doing nothing for 10 seconds every time they take damage in order to build crit heals (or even worse spend 30 seconds scouring the map for health packs or just dying and looking at the respawn screen)\n\nDeath should not be considered a bad thing in an FPS. Sure, as a Medic main you want to keep people alive. But if nobody ever dies, the game never progresses, and the more skilled team doesn't get their reward.\n\nAs a result, healing *hurts* gameflow rather than helping it. Let's say both teams are at a stalemate waiting for Uber. Without Crossbow, if I deal 150 damage to a Soldier because I'm a better player, he has to either back up and go find healing, or die. Either of those options gives ground to my team, progressing the game, which is good for game flow.\n\nWith Crossbow, his Medic can wipe out that 150 I just did from the other side of the room if he just stands still for an instant behind cover. Now it's as if the last 30 seconds of fighting didn't exist, and my skill was made totally irrelevant, and neither of us got any closer to winning. By removing a pushable advantage, the stalemate was prolonged. That's *bad* for game flow.\n\nI would absolutely not remove Crossbow but I would change it to heal a more sensible amount, like a range of 50-100. To compensate for that, I'd buff the Syringe Guns a little to function more similarly to the Crossbow, so Medic has more choice in the slot.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Tilde_Tilde",
                            "body": "Saying that I don't think I'd change it though.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "4Lukaska_SSB",
                                    "body": "Xbow and gunboats aren’t anti-agency",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ScaredytheCat",
            "body": "I acknowledge their awesomeness, but they just aren't for me. I prefer either a banner or shotgun. I'm that boring, grounded Soldier that would rather group up with teammates than fly off somewhere and get a sick frag.",
            "score": 4,
            "replies": []
        },
        {
            "author": "A_Satanic_Fish",
            "body": "Simply put, one of a couple weapons that defines a whole class. \n\nThe gunboats are in a class of “this isn’t stock… but it basically is”.  The shotgun is great, but the gunboats opens up freedom for the soldier to play as aggressively as possible flying through the air. \n\n6s soldiers dropped the shotgun entirely and just fully jump around now (blame the medigun speed match change if you take issue with this)\n\nGood weapon, imagine Demoman with this and stickbombs",
            "score": 9,
            "replies": [
                {
                    "author": "AudiobookEnjoyer",
                    "body": "Do pocket soldiers not use shotguns anymore? ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "A_Satanic_Fish",
                            "body": "By no means is the shotgun dead - but at this point, both soldiers are roamers. The role of a pocket soldier died since scout can protect a medic with a better hitscan option and medigun speed matching. The value of sending two soldiers for a bomb over 1 is invaluable, especially if you are making space for the rest of your team.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "AudiobookEnjoyer",
                                    "body": "Wow, you stop following comp for six years and look what changes.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "lv8_StAr",
                            "body": "Many have moved to Booties. The reason is because Gunboats let you be basically *everywhere*: you can play Combo with the Combo Scout and Demo or you can immediately rotate to flank to assist the Flank Scout and Roamer. Booties let Pocket play a very versatile style that gives them both the ability to make space and support the flank like a Roamer but still be able to stick close to the Medic and Combo as the Pocket.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lv8_StAr",
                    "body": "Yomps was one of the last notable Shotty Pockets and even he used Booties the majority of the time. You still very rarely see Shotgun Pockets but they’re *so* rare.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "printial",
                    "body": "The gunboats are my favourite item in the game. Some of the early maps had tiny health packs or health packs half way between spawn and the action. Before gunboats this meant a soldier needed a medic or get killed before getting their health back, after gunboats it meant you could just roam around the map. \n\nIn 6es or highlander it's great - you can get to middle often faster than the demo with almost max health.\n\nA really fantastic weapon that changed how soldier could be played for the better. I feel soldier was always meant to win WAR, because demo with sticikies and no grenades wouldn't be nearly as effective (play TFC where demo has the gunboats).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sawmill_piss_sniper",
            "body": "I’m 100% wrong and biased here, but in alot of cases I’d rather have Conch. My flawed logic is that if I can just stay alive long enough, any damage caused by jumps would just get passively healed off anyways. Plus the actual banner pop is nice",
            "score": 3,
            "replies": [
                {
                    "author": "SaltyPeter3434",
                    "body": "It would take quite a long time to heal up the damage dealt by rocket jumping. I believe it's at least 30 without gunboats. That would take maybe 15 seconds to heal up, assuming you took 0 zero the whole time. With gunboats, you can certainly just jump to the nearest health kit which is faster than waiting around for passive heal.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pseudonym_741",
            "body": "For when the enemy med needs to be sacked and the 8 pick classes on your team can't get it done.",
            "score": 3,
            "replies": []
        },
        {
            "author": "trash-toter",
            "body": "Absolutely disgusting unlock that completely and utterly transforms the class from a selectively mobile power class to a hypermobile power/pick/flank monster. Shotgun and banners are all incredibly strong but gunboats shits all over them with just how FAST and HEALTHY you can be with them. Even a poor jumper will benefit from them because they can take and leave high ground without losing a huge chunk of HP, and then as your skill grows, their strength also grows. Insane that they even exist.",
            "score": 3,
            "replies": []
        },
        {
            "author": "cambodianerd",
            "body": "When placed in the wrong hands... Devastating.\n\nI prefer using the Backup much more, but the Gunboats are the pinnacle for mastering Soldier.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lv8_StAr",
            "body": "Ah, the eternal Banners versus Booties versus Shooties debate….\n\nTLDR: Gunboats really *are* the truth.\n\nI’m a trained Roaming Soldier and practiced Jumper, I LOVE the mobility afforded by only taking 20 damage from a rocket jump that Gunboats gives. A minimum of 40 damage from a normal jump no boots makes you a lot less mobile as a Soldier and to me Booties is like taking the weights off.\n\nAll of the Banners are good but Battalions in my opinion is the best: you have the most HP, you can use the resistance to jump away while banner is ending, and not being able to die from headshots is so impactful as a Combo Class (keeping your Medic and other teammates from being headshot is super important too). Soldier does a lot of damage already and has the mobility and heals while playing Combo to make it out of almost any engagement, but Battalions is the only thing in the game that lets Soldier be a real defensive force in addition to offensive.\n\nShooties are the Classic “get away from my Medic” weapon. Deathmatch Soldiers take the Stock Shotty and turn it into a dangerous midrange denial tool. There isn’t a lot to say about it, when you aren’t going to be jumping around the map and are gluing yourself to your Medic, there isn’t much better backup than Shotgun.\n\nGunboats falls into all this by giving Soldier his wings. Fully buffed and with the best mobility tool at his disposal, Soldier IS like an eagle: he flies in, gets the kill, and escapes into the wind. Two rockets are more than enough to kill almost any target short of a Heavy, but with the support of his teammates Roaming Soldier is one of the game’s most impactful chase and cleanup classes. Roaming Soldiers are also superb at drawing attention and making space, since a bombing Soldier is not only loud and attention-getting but also extremely threatening. Because the Gunboats let Soldier jump more freely, Roamers can execute complicated and technical rollouts to go for incredibly difficult to predict and avoid dive-bombs and can make it to the battlefield incredibly fast to take ground for the team to move in. Speed and skill in jumping make Gunboats Soldiers shine, and being able to fluidly move back and forth from the flank to the Combo when needed is what makes Gunboats such a strong and impactful tool.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MillionDollarMistake",
            "body": "I just think it'd be cool if they let Demo wear them now too. It's been over 15 years, I doubt there'd be a lot of people upset about the sanctity of the competition being ruined. \n\nI have no idea how balanced it'd be though. My first thought is it'd be fine. The grenade launcher is a great option and sticky jumping, while powerful, is more limited in some ways compared to rocket jumping. Or it'd turn demo into a hyper-mobile sticky spamming nightmare, one or the other lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "CannotSpellForShit",
            "body": "These are so much fun until the other team gets a competent pyro and I have to switch to a shotgun",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Hooters",
            "body": "I hate the fact that these exist, so much mobility for the cost of not having a shotgun. Now call me a salty heavy main, but the fact soldier can partially negate his health loss but heavy couldn't is beyond me considering Soldier's primary is hella strong. 112 close range damage is nothing to argue against.\n\nThen again I suppose heavy has the steak so technically he doesnt need to use the G.R.U and keep his 300 max health ready to go, but now he has no proper healing.\n\nIn any case I dont like them.",
            "score": 2,
            "replies": [
                {
                    "author": "dropbbbear",
                    "body": ">but the fact soldier can partially negate his health loss but heavy couldn't is beyond me considering Soldier's primary is hella strong. 112 close range damage is nothing to argue against.\n\nHeavy does *500* dps at that range, with no 0.8 second firing interval, and without needing to reload. His attacks are also unreactable hitscan, as opposed to reactable, surfable projectiles. He also has 100 more HP than Soldier.\n\nIf it wasn't for low mobility balancing him Heavy would be the strongest class in the game. GRU health loss is fine.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "No_Hooters",
                            "body": "You also forget he needs to rev up the mini gun and considering the damage and accuracy nerf they decided to give him, means even less damage at the very moment. Only negated if Heavy stays revved and is now slower.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dropbbbear",
                                    "body": "Those small things still wouldn't balance a heavy who could move around a lot faster than normal, so again GRU is fine",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "No_Hooters",
                                            "body": "I know it is but considering the speed and distance soldier can cover its ridiculous.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "dropbbbear",
                                                    "body": "Soldier can cover distance with massive speed, and not need to revup or ramp-up\n\nHeavy can have 100 more HP, nearly 5X as much DPS, hitscan attacks, more ammo, no reloading etc\n\nIt's fine",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "No_Hooters",
                                                            "body": "You're forgetting that the extra 100 health doesn't mean shit in TF2 when random crits, snipers, and spies are a thing.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "dropbbbear",
                                                                    "body": "What a ridiculous opinion. That extra 100HP makes you extremely resilient to Scouts, Soldiers, Pyros (especially,) Demos, Sentries, other Heavies, and Medics (ofc). Snipers are your dedicated counter, which you get in exchange for countering Pyro very effectively. Heavy is one of the most effective Spychecking classes as he can spray a large area with bullets. \n\nRandom crits, aside from not being that common, are actually an argument FOR why +100HP is so important; for example a crit rocket deals 270 damage, enough to oneshot any class *except* Heavy. Crit stickies are usually between 200 and 300 unless you're right on top of them. Grenades are the only thing that makes 300hp irrelevant. But all the other random crits are in low enough damage ranges that they won't kill Heavy, but having more health after taking the crit absolutely helps.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "No_Hooters",
                                                                            "body": "I main heavy and that extra 100 health ain't nothing, Scout's meatshot is over 100 damage, pipes are 100, rockets at close range is around 100.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "dropbbbear",
                                                                                    "body": "Scout has 125HP. He needs to land 3 meatshots to kill you, 0.6 seconds each.\n\nYou can kill him in point blank range in like *.35 of a second.*\n\nSoldier needs to fire 3 times, 0.8 seconds in-between, to kill you. That's 2.4 seconds. You can delete him in *half a second.*\n\nYou must do a pretty poor job of maining Heavy if you can't delete a Scout or Soldier at point blank range with 550DPS.\n\nI don't main, but do play, Heavy and I don't have issues with *any* unubered class at meatshot range.",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "No_Hooters",
                                                                                            "body": "I play any class thats needed but main heavy cause I like using a mini gun. Soldier can peek corners and scout has double jumps meaning he can jump over your head and considering it requires tracking that easier said than done.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "dropbbbear",
                                                                                                    "body": "And Soldier doesn't always have the opportunity to peek corners, and Scout often doesn't have the opportunity to jump over your head because he has to run into close range first (and probably get mowed down).\n\nThe fact that it's possible to beat Heavy through skill doesn't mean that his balancing weaknesses should be reduced.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "No_Hooters",
                                                                                                            "body": "Unless you're a brain dead player, most scouts and soldiers know to stay away to begin with so in the end Heavy has to deal with it.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "dropbbbear",
                                                                                                                    "body": "So why were we talking about meatshots in the first place - because if the damage is not high burst, Heavy's large health pool is absolutely relevant.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "No_Hooters",
                                                                                                                            "body": "Not really. You're not gonna convince me a simple extra 100 health changes much.\n\nDamage resistance on the other hand such as the Fist of Steel would be a better argument. Then again if Heavy has those out he ain't firing his mini gun so that \"effective\" health as players like to call it isn't as situationally good as they make it out to be.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "4Lukaska_SSB",
                                                                                                                                    "body": "That 100 extra health means that soldier has to empty his ENTIRE RL CLIP to kill him instead of 2 tapping most other people, a scout staying at mid range (which he will be if he actually wants to dodge other player's attacks) would have to fire FIVE out of his six shots instead of the usual 3. How is that not impactful lmfao. The fact that you have to dedicate so much firepower to kill one (1) fat bastard really speaks to his vitality.\n\nI think most people just try to play him like a moba tank so they just mindlessly jump rev into the open and then get focused fired and die because unlike OW you cant just live forever when someone is constantly shooting at you.\n\nThis isn't even taking into account overheal which just blows everything you said out of the water. A 450 health heavy is basically untouchable to any individual player and requires focus fire or a hardscope headshot to deal with.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "No_Hooters",
                                                                                                                                            "body": "Or a backstab, I can agree with the 450 being a lot. Random crits are just a big factor that I hate.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                },
                                                                                                                                {
                                                                                                                                    "author": "dropbbbear",
                                                                                                                                    "body": "> You're not gonna convince me a simple extra 100 health changes much\n\nSo basically you're just admitting that you're unreasonable and your opinion can't be changed by fact. You haven't advanced any new arguments, just \"nuh unh\".",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "No_Hooters",
                                                                                                                                            "body": "Glad you understand the definition of \"not going to convince\". I have over 700 hours on him I know what I deal with and man can a Heavy be just as screwed over as anyone else.\n\nBesides this post was about me hating on Gunboats anyways.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "dropbbbear",
                                                                                                                                                    "body": "Sounds like you need more hours, both on Heavy and on other classes, to get a better perspective of the game and how meaningful +100HP is.\n\n700 hours really isn't much in the scheme of things when you're dealing with some people in this community who have been playing Scout, Soldier etc for literally *multiple* 1000s of hours. They're beating you because they're more experienced players.\n\n\"Anyone else\" gets screwed over a lot quicker than Heavy does. Simple as. That's why he needs the lower mobility, to balance that.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "No_Hooters",
                                                                                                                                                            "body": "Considering I have over 7000 hours on this game and played every class enough to know their ins and outs, I doubt it. 100 health still isn't much in the grand scheme of things.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "dropbbbear",
                                                                                                                                                                    "body": "I would bet good money that 6000 of those are in idle/trade servers.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "No_Hooters",
                                                                                                                                                                            "body": "You bet poorly. Idle/trade servers are boring.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "dropbbbear",
                                                                                                                                                                                    "body": "So from a quick scroll through your post history, most of your hours seem to be spent playing Heavy/Medic and spending a frankly pathetic amount of time simping over fictional futanari images.\n\n\"I main heavy, and do other classes if I'm bored or need to cover a class we don't have...........so mostly medic lol\" - you\n\nSo in other words you don't have the experience playing against Heavy to understand why the game is balanced the way it is.\n\nThere's no need for you to lie on the Internet, especially when people can see everything you post.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": []
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Electric999999",
            "body": "They're pretty good, but competition is actually surprisingly stiff for Soldier secondaries.   \nThe banners offer some very strong team support, on top of decent passives on two of them.   \nThe shotguns are pretty high damage with hitscan and certainly help when you run out of rockets in your clip or a pyro is reading your mind.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thanks_breastie",
            "body": "waddle pocket is really fun but nothing really compares to just flying around the map roleplaying a predator drone",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReDAnibu",
            "body": "Single best unlock in the entire game other then crossbow",
            "score": 1,
            "replies": []
        },
        {
            "author": "Red_Distruction",
            "body": "%appdata%",
            "score": 0,
            "replies": []
        }
    ]
}