{
    "title": "Map Discussion Monday #6 - tc_hydro",
    "author": "A_Wild_Ferrothorn",
    "subreddit": "tf2",
    "rank": 1,
    "score": 4,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/tf2/comments/1jdo1kq/map_discussion_monday_6_tc_hydro/",
    "id": "1jdo1kq",
    "selftext": "# TF2 Map Discussion: **Hydro**\n\nWelcome to our Monday TF2 map discussion. Here, we'll discuss maps from TF2!\n\nToday's map is tc_hydro here.\n\nHydro is the last of the 6 release maps that will be covered here because we've done the previous 5 already. Hydro is the best official territorial control map in the game and that's because it's the only one so feel free to use this thread for also discussing about the game mode too because there's not going to be another opportunity. Hydro is a map divided into 6 points and each round will pit RED against BLU in a different point and the map just decides which ones it will do at random but they will always be next to each other. \n\nThis can get quite confusing.\n\nThe map is quite fun to play if you don't think about what you're doing too much and is required to play (and win) if you want to get every achievement in the game as Relentless Offense is gotten for winning the round without giving up a point and World Traveller is given for playing a round.\n\nHydro also appears in Expiration Data (sorta) and the Radar Dish point is based off the very real Arecibo Radio Telescope in Puerto Rico which makes it one of 2 maps in the game to feature this specific telescope.\n\nFeel free to discuss the map here. Anything that you like/dislike, cool tips or strategies, interesting stories, etc. If you feel the map is not to your liking, feel free to express your opinions in a respectful manner.\n\nFor those who wish to learn more about the map, you can find the wiki page here:\n\n[tc_hydro, from the TF2 Wiki](https://wiki.teamfortress.com/wiki/Hydro).\n\nYou can find previous map discussions in a nice overview [here](/r/tf2/wiki/map-discussion-archive)\n\nNext week the map will be ctf_well",
    "comments": [
        {
            "author": "AllSeeingAI",
            "body": "Tf2 classic reworked the mode into a 4 team domination map which is frankly a lot more fun.\n\n\nThere's decent architecture, it's just a bad game mode.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ToomaiGlittershine",
            "body": "The concept of TC is good. It's like Dustbowl and similar maps, but with a lot more variety. The issue is, Hydro is a frickin' huge map, especially if it picks a diagonal round (those connectors feel longer than the 2fort gauntlet). As a result, rounds take forever to finish, because unlike Dustbowl you can complete tons of rounds and make no progress (there's an overall timer but still). So I think if Hydro were smaller, it'd automatically be a lot better.\n\nOn the other hand, maybe what TC needs is to be continuous rather than round-based, more like 5CP maps. Cut off the diagonal links and allow access to everywhere at once. Might need to also shrink the map because it could lead to even more team splitting, but it'd be worth a try.\n\nA unique problem that Hydro has is its art pass. Because either team can hold any of the four areas, they all have to be neutral colours and architechture, which makes it pretty hard to make tham all distinct. I'd have liked to see the walls and/or props change colours every round (complete with \"wet paint\" signs everywhere), but that may have been too much for the 2007 Source Engine.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SuperstarAmelia",
            "body": "I've played Hydro once in a blue moon. It's far from a great map and game mode but it's not terrible to actually play on. It's kind of like Powerhouse where it will often devolve into a stalemate though.",
            "score": 3,
            "replies": [
                {
                    "author": "A_Wild_Ferrothorn",
                    "body": "Any time I've played it has been because someone on uncletopia has nominated it first and either annoys everyone into picking it or everyone just hits F1 instinctively. When it does get played it either gets stalematey or is over very quickly though.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dropbbbear",
            "body": "Hydro failed because Valve didn't account for the fact that people don't like frequent interruptions to play.\n\nIn Hydro you only need to capture 1 point to move to the next \"stage\". However when you move to the next stage, everyone gets sent back to the spawn room. So if one team is better than the other, and capturing control points in rapid succession, the whole game is frequently resetting. This causes high interruptions to gameplay for people who just want to frag, not get sent back to spawn every few minutes.\n\nIf that wasn't bad enough, however, Hydro also has short round timers. So even if both teams are evenly matched, you *still* get sent back to spawn frequently (somewhere between 5 and 10 minutes per point iirc).\n\nThis makes Hydro one of the most frequently interrupted play experiences in TF2. Compare it to something like 2fort, where you can frag for hours without interruption. \n\nI think this is a huge factor in the lack of popularity of Hydro - the other being its complexity. You're frequently being shunted from area to area, a map is shoved in your face at respawn you're expected to just understand.\n\nHydro usually boils down to cycling through a handful of narrow chokes over and over, with constant interruptions.\n\nIt's a shame because the concept of a \"frequently changing map you can play for hours\" is great, the aesthetics of a hydroelectric power facility are fantastic and beautiful, and some of the areas are well designed (though some are also brain-dead singular chokepoints).",
            "score": 3,
            "replies": []
        },
        {
            "author": "Illustrious_Pipe801",
            "body": "Don't get me wrong, it's fun for a bit and the gamemode is novel, but kind of wears thin as this map is so stalematey. \n\n\nThis map has had an interesting journey: was initially played a ton because of a limited map pool, died as better maps got added to the game, experienced a wave of rose-tinted nostalgia, got a ton of hype when it was reintroduced due to said nostalgia, and then once again petered out when people actually tried to play on it again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gorthok-",
            "body": "I'd probably have an opinion if I could load into a game of it...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tilde_Tilde",
            "body": "A map made to be less repetitive when people actually want to play same maps over and over. But still ends up being repetitive but not the repetitive people like.\n\nHydro is a stalemate map with bad deathmatching. Powerhouse is entirely better for this reason. While other maps have gotten the multi capping done better and then 5cp is generally the same thing but flows better match to match.\n\nAlways feels like stalemates happen in maps like this because of access to health being poor that you have to rely on your supply cabinet to even play.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Limozeen581",
            "body": "people debate the gamemode's viability but the reason it doesn't work is because this map is terrible. People say its huge, but in reality most of the fighting takes place in the tiniest of chokepoints. The stalemates on this map are ungodly because teams are forced to fight over openings the size of a nickel.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darkman_Bree",
            "body": "This map brings me some nostalgia.\n\n\nI remember an old time in 2007 when I was 7 and new to the game.\nEverytime I got full uber, I thought my medigun was broken due to the electrical sounds and particles so I couldn't heal anyone anymore that life, so I made sure to die to \"get a new medigun\". lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "MillionDollarMistake",
            "body": "Gameplay wise the map is whatever but I always liked a lot of the maps's visual flair, there's just a lot of neat architecture you don't see on many maps. The curvy road by the cliff and tunnel road, the security booths you can enter, the part where the road is lifted and there's that secret base underneath, the whole radar dish part.",
            "score": 1,
            "replies": []
        }
    ]
}