{
    "title": "[Schulz] The Bills removed a year from LB Matt Milano’s contract, making him a free agent after this season. He agreed to a $3M+ pay cut for 2025 but can earn it back through incentives.",
    "author": "Venomous_Raptor",
    "subreddit": "nfl",
    "rank": 9,
    "score": 686,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 97,
    "url": "https://www.threads.net/@jordanschultz/post/DHWEaFuxNp0",
    "id": "1je7uc4",
    "selftext": "",
    "comments": [
        {
            "author": "minusthetalent02",
            "body": "Mike White start sweating in 2026",
            "score": 320,
            "replies": [
                {
                    "author": "iliketuurtles",
                    "body": "He came to the Bills for a reason... and that reason might be leaving for 2026. Mike White will continue following him until one/both retires.",
                    "score": 67,
                    "replies": [
                        {
                            "author": "minusthetalent02",
                            "body": "Let’s be real. That might of been the hardest clean hit ever by someone in a bills uniform",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "allanon1105",
                                    "body": "I remember watching it live, it was brutal. Clean hit but he folded that man in half.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "fantasyshop",
                                    "body": "Nate clements",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SeaBag7480",
                    "body": "Help! These linebackers are trying to kill me!",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "ARM7501",
            "body": "McDermott is going to have to pull of a load management masterclass to keep both Bosa and Milano healthy and ready to go for when it really matters.",
            "score": 175,
            "replies": [
                {
                    "author": "Temporarily__Alone",
                    "body": "4 snaps/game till January",
                    "score": 75,
                    "replies": [
                        {
                            "author": "ARM7501",
                            "body": "Bosa only gets to play 3rd & 5+ for the first 12 weeks of the season, then slowly introduce him to 1st and 2nd down. Hide him in a cupboard for whenever there's a 3rd & 1/3rd & 2 and pray to God he doesn't get vicariously injured or some shit.",
                            "score": 31,
                            "replies": []
                        },
                        {
                            "author": "creatinee",
                            "body": "4 body part snaps between both",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "hamandjam",
                            "body": "Maybe just 4 snaps per season aka The Rodgers Special.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "raleighboi",
                    "body": "Good thing we have depth on the D line and nobody is stupid enough to get suspended for PEDs.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "ARM7501",
                            "body": "Theoretically you should be all set rolling 9-deep on the D-line... practically you need to invest at least 1 day 2 pick into a DE, and should probably try to snag one of the early 4th round DTs.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DayDrinkingVampire",
                                    "body": "It's probably going to be a defensive heavy draft for the Bills. DL, CB, and S. They might snag a WR in the mid rounds, but the D needs some TLC - tables, love, & care.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ARM7501",
                                            "body": "If you could somehow turn your 2 2nd rounders into an RB + one of the Iowa State receivers... oh boy.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dachshvnd",
                    "body": "His first major injury was a legitimate leg break. The second was a weird one with the muscle tear. Back to back seasons so it seemed like he was constantly hurt.\n\nHe was good in the playoffs and had his speed and flexibility back and made a bunch of good plays. (Tip pass on Lamar to cause an interception in divisional, sack on mahomes in conference championship stand out to me).\n\nI'm a Milano stan and I think he's got a lot left in the tank. With the Bills luck he'll play lights out this season and then get a huge contract with someone else next year lol",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Impossibills",
                            "body": "Let someone else pay him if he does",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "dachshvnd",
                                    "body": "Nah you forget how clutch he's been. I'm not saying overpay, but if he's back to form this year you definitely try to keep him around at a decent price.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Beren_Hearts_Luthien",
                    "body": "I mean Milano was injured with overlapping injuries this past year.  Other than that he's been as healthy as any other linebacker.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "DapperCam",
                    "body": "Milano tore his bicep in training camp last year. Didn’t even take a snap until December! Gotta wrap this guy in bubble wrap.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "tinywienergang",
            "body": "What happened to this guy? I thought he was really good, but I don't remember hearing his name all that much last year.",
            "score": 214,
            "replies": [
                {
                    "author": "Phantom_Nuke",
                    "body": "Well he's played 9 games pver the past 2 seasons, so injuries pretty much sums it up.",
                    "score": 319,
                    "replies": [
                        {
                            "author": "tinywienergang",
                            "body": "That'll do it",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "NunButter",
                                    "body": "He blew a bicep in camp last year and missed most of the season. The year before, he broke his leg in like Week 5",
                                    "score": 58,
                                    "replies": [
                                        {
                                            "author": "Xaxziminrax",
                                            "body": "Fuck that shitty international artificial field, man. That game was a fucking bloodbath",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PM_ME_SOMETHINGSPICY",
                            "body": "Anthony Rendon super happy he doesn't play football",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "TomNooksDirtyCock",
                            "body": "Injuries definitely sum up his career",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "mt8-5",
                                    "body": "You got that right, TomNooksDirtyCock",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "wshanahan",
                    "body": "Tore his bicep during training camp.",
                    "score": 86,
                    "replies": [
                        {
                            "author": "Optimal-Dog-8647",
                            "body": "Not to mention he literally crushed the top of his tibia vs Jacksonville the year before.",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "Chlorophyllmatic",
                                    "body": "The ol London special",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gaIvantuIa",
                    "body": "Two straight years with bad injuries",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "fusioncon",
                    "body": "he tore a muscle in camp, didnt come back until december",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "angelomoxley",
                    "body": "He was First Team All-Pro two years ago, for the record",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "BuffaloWilliamses",
                    "body": "Dudes amazing but can't stay healthy. He also will be 31 so the odds he will continue to perform at a high level for much longer is unlikely.\n\nI'm mad that Pepperidge Farms wasted a golden marketing opportunity to feature The Cookie Monster in his prime.\n\nEdit: changed age",
                    "score": 11,
                    "replies": [
                        {
                            "author": "LeoCrow",
                            "body": "He’s 30, will be 31 by season start.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "itakeyoureggs",
                                    "body": "Sucks he lost some pivotal years of his prime.. right after playing the best fb of his career.. was so hyped for him to ascend.. then poof injury",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "-SexSandwich-",
                                            "body": "Using fb as an abbreviation for football is just plain weird when fb is the accepted abbreviation for fullback, ya know, a position in football.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "itakeyoureggs",
                                                    "body": "Ok, cause fullback makes sense in that sentence.. I’ll be sure to remember next time so you can read it easier :)",
                                                    "score": -6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Expendable_Red_Shirt",
                            "body": "He may be a big name in Buffalo but nationally I think he’s mostly known to the geekier side of football fans.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "iliketuurtles",
                                    "body": "Absolutely not. Maybe a complete random that only knows QBs or a new fan wouldn't know him because of his last 2 injuries... but if you know a few players on every team, you know Matt Milano. My dad is a casual-ish WAS fan and we have definitely talked about Milano before. Knowing a 2022 all-pro LB isn't the \"geekier side\" lol",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Expendable_Red_Shirt",
                                            "body": "> but if you know a few players on every team, you know Matt Milano. \n\nIf you’re talking Bills famous players he’s way after Allen, then after Cook, Diggs (who isn’t on the team but was when Milano was really relevant)/Coleman, Hamlin, Shakir, Kincaid, then *maybe* Milano though I’d still put Oliver and  Rousseau ahead of him. He’s mostly talked about on the geekier networks outside of Buffalo. \n\n> Knowing a 2022 all-pro LB isn't the \"geekier side\"\n\nThis is why people need the /s because that sentence quite clearly is sarcasm to me but I have a weird feeling it wasn’t for you.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AvocadoHank",
                    "body": "Had two major injuries, broken leg and then a bicep tear so missed the majority of last season and the beginning of 2024. To be fair, when he came back in 2024 he was still good. But he’s getting up there in age",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Colonel_Wildtrousers",
                    "body": "All I know is I lost count of the amount of loads Romo blew over him in the playoff game against the Ravens",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BigAssSlushy69",
                    "body": "He's still really good just got two long term injuries back to back",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "anujsingh83",
            "body": ":(\n\nI get it and all but...sigh. Looking back at the accumulation of injuries to guys like him, Von, Tre'Davious, and Micah  can only leave me wondering what could have been. I get every team deals with them but the severity and length of injuries (to pro-bowlers, no less) gutted us.\n\nBut...window stays open until shown otherwise!",
            "score": 68,
            "replies": [
                {
                    "author": "minusthetalent02",
                    "body": "This is how I feel. But at least we have good memories and Dorian looks promising so it’s understandable",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Gengreat_the_Gar",
                    "body": "Yeah it feels like every time we've locked up one of our star defenders long term they immediately get their career ruined by injuries. Gotta think we'd have a super bowl by now if even just one of Tre, Milano, or Miller had stayed healthy...",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "SeanJuan",
                    "body": "Bills had a 4 year streak of losing their best defensive player for the year between these guys.  With that and coming so close every year, god.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "BigmoneymanT",
            "body": "Now he’s gonna have an all-pro year and make us regret it, isn’t he…",
            "score": 13,
            "replies": [
                {
                    "author": "Skimaster77",
                    "body": "Oh no, and All-Pro campaign on a team trying to make the Superbowl. What ever will we do? I feel like this works well for the Bills either way. If he goes off, we get one last good year then he can go get paid good money and we get a comp pick in 2027 when someone pays him his last big contract. If he has another season like the last 2, then this was the right call, can't be paying someone like that who isn't on the field.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "nickmdp",
                    "body": "Not a chance.  Shoot, for the APY that Milano would have been signed for next year, we could get basically any FA LB we want.  If we need to bring Milano back, we absolutely could, but if he walks, we can spend the cap space on someone younger.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "LeoCrow",
                            "body": "This doesn’t save us on the 2026 cap. \n\n * Old dead money charge in 2026: 11 mil\n * Old total cap charge in 2026: 16 mil\n * New dead money charge in 2026: very likely 14 mil, assuming the incentives are structured to be easy to attain. \n\nSo we can get a new linebacker that costs 2 mil a year with the savings.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "nickmdp",
                                    "body": "Man, I hate how confusing the NFL salary cap is.  Still confident that this is the right move, but there certainly is room to be worried about this backfiring.  I'd like to think that the Bills know far more than we do about Milano's long-term health prospects though.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LeoCrow",
                                            "body": "Yeah I think the Bills only do this if they really need the 3 million now, and/or really are worried about another lost season from him and want to hedge. It’s not a move they make if they’re reasonably confident he’s going to play at a high level the next 2 years.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "hexwanderer",
            "body": "Is he cooked or are the Bills being nice",
            "score": 37,
            "replies": [
                {
                    "author": "BobbysBottleService",
                    "body": "He's not cooked but he isn't the heat seeking missile he once was\n\nEdit: heat speaking would be sick",
                    "score": 99,
                    "replies": [
                        {
                            "author": "jre19",
                            "body": "He does not speak the same hot fire he once spoke",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "Letsgobuffalo2210",
                                    "body": "The man doesn't speak at all.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "seanwd11",
                                            "body": "What does his voice sound like because I've never heard him talk on camera in his entire career. It's odd.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "BobbysBottleService",
                                                    "body": "Soft spoken. There was a short/ig reel of him interviewing about his injuries, in practice gear on the practice field but i can't find it",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ExclaimLikeIm5",
                                    "body": "Die Lawn",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PotatoCannon02",
                            "body": "He was good when he was back",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeoCrow",
                    "body": "He was pretty damn good in the playoffs.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "wshanahan",
                    "body": "Tore his bicep in training camp and wasn't 100% when he came back from IR.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Mampt",
                    "body": "He's lost most of both of the last two seasons to injuries. Out for the season after week 4 2023, was out until week 13 2024 with a separate injury.  I think this is a prove it kind of situation where if he stays healthy and to the level he used to, he'll probably be back.  If not, Dorian Williams started in his spot most of the season and played pretty well.  I mean, hard to really replace a guy who was following up an all-pro season at the same level until he missed most of the next two seasons.  2021-early 2023 he was playing like a top 3 LB but injuries hurt",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "TheHypeTravelsInc",
                    "body": "A bit hard to say really, he started 2023 exceptionally well, could have been another potential All Pro season for him until he got injured in that London game.\n\n\nAnd then picked up a freak injury in training camp last season and didn't return until December. He probably just needed a few games to shake off any rust.\n\n\nIs he cooked? Really have no idea, but the 2 injuries have not helped his case. If he can stay healthy this year, it would be a better indication of whether he's cooked.\n\n\nWe also do have a very capable backup in Dorian Williams and we drafted a LB in the 5th round last year who was a healthy scratch all season, so there's not a shortage of depth this time around.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Livid-Survey6310",
                            "body": "I don't think he's cooked, given the two injuries were completely unrelated to one another and once MM was back in the fold he looked like he was back in business. \n\n\n\nIf he stays healthy this year I expect him to return to his all-pro form",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TheHypeTravelsInc",
                                    "body": "I would be over the moon if that turns out to be the case, I still miss his form from 2022 to the first 4 games of 2023, he was looking like an absolute monster during that time period.\n\n\nI am also content if it doesn't work out for Milano this season because we have a really deep LB room, probably our deepest LB pool in years.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SeanJuan",
                    "body": "He's still good, but there have been rumblings of this after they paid Bernard.  If he can stay healthy he's probably still got another contract of plus play in him.  It could even still be with the Bills.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Impossible_Age_7595",
                    "body": "prob his last year and he let the bills know",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Impossibills",
                            "body": "He had multiple years with big money due, so that makes no sense\n\n\nNext season he was a cut candidate and the Bills would have needed to eat money. Now they won't need to",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "iliketuurtles",
                            "body": "No way lol Honestly (and sadly) our GM probably threatened to cut him if he didn't re-work his contract. He is the 3rd player to take a pay cut in the past couple years that were \"overpaid\" for production that fans thought could/would be cut candidates due to their high $$$ and not high quality play.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MahomesBetter",
                    "body": "He's cooked but tbh I never thought he was all that anyway.",
                    "score": -41,
                    "replies": [
                        {
                            "author": "listen2lovelessbyMBV",
                            "body": "Two bad takes in one sentence, impressive",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "gregor7777",
                                    "body": "chiefs fan of course lol",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "austacious",
            "body": "Knowing nothing about the situation, this looks like malpractice on the part of his agent... Why would he agree to this? Not like any teams are going to be high on a 31 year old LB in FA",
            "score": 7,
            "replies": [
                {
                    "author": "LeoCrow",
                    "body": "Because although his cap number is high-ish, he isn’t due much new cash next year; if he has a good season he can cash in one last time. The incentives will also be considered not likely to be earned due to his playtime in 2024, thus saving the Bills on the 2025 cap, but in reality will be easy to reach so it’s just slightly deferred compensation if he plays at all like he expects.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "gregor7777",
                    "body": "Perhaps they would have cut him",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ShakirSZN",
                    "body": "He probably is doing the team a favor and if he gets injured again will retire",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Electronic_Shock6956",
            "body": "Im starting to realize our entire defense is made out of glass and I don’t like it",
            "score": 5,
            "replies": []
        },
        {
            "author": "Jonjon428",
            "body": "Damn, usually you see these types of players get one year contract extensions, not the opposite",
            "score": 11,
            "replies": [
                {
                    "author": "Expendable_Red_Shirt",
                    "body": "You see chronically injured players over 30 getting extensions?",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Goosedukee",
                    "body": "There’s no reason to believe in him play-wise or health-wise, I hope he can come back to full form but he might be cooked",
                    "score": -7,
                    "replies": []
                }
            ]
        },
        {
            "author": "iliketuurtles",
            "body": "Wow that is a surprise. 2 unrelated injuries to miss ~75% in back to back seasons have been tough for such an elite player, but he ended this season pretty strong.\n\nThis makes 3 players on the Bills officially taking pay cuts (Knox, Miller, Milano) and Allen talking about taking less, as well. I wonder what these conversations are looking like. Potentially Beane threatening to cut them if they don't or could just be culture? Who knows.",
            "score": 2,
            "replies": [
                {
                    "author": "LeoCrow",
                    "body": "It’s basically them agreeing to defer pay for cap reasons. Von and Dawson are counting higher on our 2025 cap due to what they did with their contracts last year.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "iliketuurtles",
                            "body": "We do not know what the likely to earn vs unlikely to earn incentives are though, do we? It will only defer the cap only if Milano will earn all of the unlikely to be earned incentives.\n\nEither way, that isn't what happened for Von and Dawson. They never received everything that they were guaranteed. Von Miller could have earned his money back (+ some) but didn't meet all of the incentive based milestones, so he didn't receive all of the money that he was guaranteed at his contract signing.\n\nHe was guaranteed \\~53M/3 years and BUF only paid him 47M total in 3 years. Von received 6M less than he was guaranteed because of the paycut/incentive based contract restructure - it wasn't just cap math.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Janawham_Blamiston",
            "body": "Love it, love everything about it. If I could make a suggestion though: just STAY FUCKING HEALTHY, Matthew. I love you dearly, but you had so much rust last season, it's a miracle you were on the field at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Much-Consequence8648",
            "body": "How does Moneyball convince all these players to take team friendly deals?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mackmoney3000",
            "body": "They are clearing space to sign Aaron Rodgers, of course.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StankWizard",
            "body": "Please don’t go the same way Tre White =[",
            "score": 0,
            "replies": [
                {
                    "author": "StankWizard",
                    "body": "Typo’d - please DONT go the same way as Tre",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ch19079",
            "body": "He was All Pro before he got hurt during the 2023 season. He was below average to start the 2024 season as he was still recovering from the injury. He was above average at the end of the 2024 season, but still not performing up to his cap hit. Based on his age, performance, and cap hit, he would likely have been cut after the 2025 season. This move saves cap now and he will know he will be a free agent after 2025 season.",
            "score": -3,
            "replies": [
                {
                    "author": "imsabbath84",
                    "body": "He never got to play at the start of 2024 due to the bicep injury.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Livid-Survey6310",
                            "body": "Yeah, and if you stretch out the games played his stats actually look pretty great:\n\n80 Tackles, 12 TFL, 6 sacks, 5 Fumble Recoveries \n\nWhich would rank him as around the 5th all around best linebacker in the league.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "couchjitsu",
            "body": "That's only fair, Milano removes a few games from his season every year",
            "score": -6,
            "replies": [
                {
                    "author": "iliketuurtles",
                    "body": "That's not true. lol He either misses 12+ games or like 1. Very rarely \"a few\" lol He only played 5 games last year and 4 games this past year, but 15 and 16 games the prior 2 years.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}