{
    "title": "Schefter: Aaron Rodgers Wants to Join Vikings; QB Has 'Resisted' Steelers and Giants",
    "author": "BreakfastTop6899",
    "subreddit": "nfl",
    "rank": 3,
    "score": 791,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 503,
    "url": "https://bleacherreport.com/articles/25172671-schefter-aaron-rodgers-wants-join-vikings-qb-has-resisted-steelers-and-giants",
    "id": "1jecqol",
    "selftext": "",
    "comments": [
        {
            "author": "FlowersByTheStreet",
            "body": "But do they want him? lol",
            "score": 647,
            "replies": [
                {
                    "author": "gotcam189",
                    "body": "God I hope not. The upside just isn’t there anymore. Absolute best case scenario, we probably win 11 games and get bounced in the divisional round? \n\nThen we’re back to a late 1st round pick with a soon-to-be third year QB that we have never seen take meaningful snaps. \n\nI have no idea if JJM is going to be good or not but I want to find out now and not kick this can down the road another year in favor of a 41 year old who hasn’t looked good and/or stayed healthy the last three seasons.",
                    "score": 368,
                    "replies": [
                        {
                            "author": "Deacalum",
                            "body": "He looked good the second half of last year. It takes a while to fully recover from an Achilles injury even if he was medically cleared. I think he has potential to still be a very good QB. Plus JJ might need another year to fully recover as well and not just be medically cleared.",
                            "score": 107,
                            "replies": [
                                {
                                    "author": "zenlume",
                                    "body": "If they felt like JJ needed another season to recover, why would they not just pay Darnold, he played really well for pretty much the entire season (unlike Rodgers), isn't expensive, and wont have to risk him coming in and destroying the culture.\n\nIf they go with Rodgers, that organization has officially reached clown territory.",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "author": "istasber",
                                            "body": "I agree, but devil's advocate would be that Rodgers is more likely to be a one year rental, Darnold played well enough to get a multi-year deal from someone.\n\nLetting Daniel Jones walk might be a better indicator that the Vikings are all in on JJ. Jones presumably knew for certain his path to playing time was easier in Indy, and that's a strong tell that JJ looks like he's ready to go.",
                                            "score": 49,
                                            "replies": [
                                                {
                                                    "author": "McPuckLuck",
                                                    "body": ">  Darnold played well enough to get a multi-year deal from someone.\n\nApparently not, Seattle can dump him after one year.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "istasber",
                                                            "body": "He has injury guarantees for 2026, and the deal requires the seahawks to make a decision well before free agency in 2026.\n\nThat's a better situation than signing another 1 year deal.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "zenlume",
                                                    "body": "I doubt that Rodgers would ever accept being a stop gap rental QB for a single year. I think he'd rather retire, and then come out of retirement if any starting QB goes down, or something like that.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "NeverSober1900",
                                                            "body": "I think the Vikings offer two things that are attractive to him:\n\n1) Best team situation to win a Super Bowl. Steelers are next up but the supporting cast of the Vikings is absolutely SB level. \n\n2) Great offensive talent to prove that last year was about Achilles recovery/Jets being Jets. He's probably not in love with the offers he had available in FA and so this is a chance to reset his market for next year if things go well.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Puk3s",
                                                    "body": "Couldn't letting Jones walk also be a sign for Rodgers?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "istasber",
                                                            "body": "I meant it more from the perspective that it sounds like the Vikings tried to retain Jones, but he ultimately decided to go to indy.\n\nThose reports could just be agent leaks and the Vikings weren't actually interested in keeping him, but the only real reason for someone like Jones to choose Indy over Minnesota (assuming those were his choices) is because he knew he was just gonna be a backup in Minnesota.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TheFishyNinja",
                                            "body": "Darnold probably wanted a longer term deal than Rodgers would be willing to take",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "Heikks",
                                            "body": "You can get Rodgers for one year, Darnold wouldn’t have signed for only one year",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "epheisey",
                                                    "body": "Franchise tag?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "-HawaiianSurfer",
                                            "body": "Because we all saw how Sam Darnold crashed in that playoff game. He looked abysmal in a vacuum, isolating him from any potential bad playcalling by KOC.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "scobbysnacks1439",
                                            "body": "Exactly my thought. If they truly thought JJ wasn't ready to take the reigns next season, Darnold would still be a Viking.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "cdub8D",
                                    "body": "Why would JJM need another year to recover?  It was a meniscus injury..",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "russh85",
                                            "body": "Because no one bothers to pay attention to the details. People act like his knee exploded",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "infernocobbs",
                                                    "body": "and the only reason we sidelined him for the season was that it occurred in the preseason when the Vikings had planned Sam Darnold to be QB1 anyway. It's great when rookies can play their first year, but there's no reason to throw them to the wolves after their first injury as a pro",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ihm96",
                                                    "body": "Meniscus tears aren’t usually that easy to recover from tbh",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SiphenPrax",
                                                    "body": "For r/nfl, especially in this case memes > logic.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "drummerboysam",
                                                    "body": "I remember him lighting it up his first preseason game and Vikings fans were on cloud 9.\n\nThen the next day he was shit down for the season. What an absolutely brutal rug-pull that must have been. Now rather than being excited for the young QB you're having the most disliked player in modern Vikings fans' memory being shoved down your throat. What a league.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "chillinwithmoes",
                                            "body": "Not /r/nfl once again acting like JJ McCarthy's leg was amputated",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Rad_platypus7",
                                    "body": "He looked a lot better, but he handicapped the offense so badly with his lack of mobility and refusal to run plays. He’d have a couple vintage looking throws, but besides that the offense played too slow and not in rhythm way too often. We didn’t score against you guys until late in the 4th Tyrod last time 😭",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "TheRealElvisPresly",
                                    "body": "JJ tore his meniscus and had routine surgery to fix it. It was the long term surgery so took longer to heal than the month long “repair” but he should be fully healed by OTAs and that has been backed up by the team and multiple Vikings insiders.\n\nIf we truly are looking at Rodgers as an option, which I doubt, it wouldn’t be based on McCarthy not being medically cleared. In my opinion that would make the Rodgers interest even worse as it means they would not be in on JJ going forward.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "paultheschmoop",
                                            "body": "This is such a weird take to me. \n\nThe team won 14 games last year with a “bridge QB”. I don’t know how much more “win now” you can get. Even if JJ is going to become the greatest QB of all time, it is undoubtedly a gamble to hinge your “win now” season on a QB who has never played a snap in the NFL. He is, more or less, a rookie. Teams don’t win SBs with rookie QBs, or at least they haven’t yet. \n\nI completely understand the rationale of “this team is ready to win now and we’re willing to sit our promising young QB prospect for another year for one year of an upgrade at QB”\n\nSo then the big question is, “*is* Aaron Rodgers at this stage in his career an upgrade at QB?” \n\nWhich, personally, my opinion of Rodgers as a player at this point is pretty low. But if KoC thinks he’s an upgrade, the move makes complete sense to me.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "istasber",
                                                    "body": "> The team won 14 games last year with a “bridge QB”.\n\nNot the same team, not the same schedule. Doesn't really mean anything.\n\nActing like this roster was a QB away from competing is madness. It'd be one thing if Rodgers clearly had multiple years left and there was some guarantee he was still close to his peak, but at this point it's too big a risk for a team that's starting to come together. The Vikings need JJ to hit well enough to finish the rebuild, and by then if JJ isn't the guy, we'll go out and spend big on someone.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "NeverSober1900",
                                                    "body": "Also having JJ sit behind Rodgers for a year and learn from a HOF'er has its own benefits. Love has been complimentary of his time behind Rodgers helping him prep for when he eventually got to start. You can even see the stuff he \"stole\" from Rodgers especially in regards to pre-snap",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "wehaddababyeetsaboy",
                                                    "body": "This is accurate. Betting everything on JJM is fine but we don't have to place that bet today.  We can place that bet next season after he's had a year to watch a HOF guy.  I like JJM and I think he's gonna be good but if you asked me who has a better chance to win a superbowl in 2025-26 the answer for me is overwhelmingly AR.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "w0nderbrad",
                                                            "body": "Yea I don’t know who was added/subtracted but Aaron Rodgers is probably still a top 10 QB in the league. Seems like he’s fully healthy now and I would not want to face the same Vikings team with Aaron Rodgers as opposed to Sam Darnold.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "cogginsmatt",
                                    "body": "Think about who the Vikings play 6/17 games against. I feel like every team in the NFC north could easily exploit Rogers’ age and slow reflexes, even if he’s fully healthy. They were starting to sniff him out near the end of his Packers tenure.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "whyyoudeletemereddit",
                                    "body": "He just cannot push the ball downfield well. The arm strength is clearly not there. I can see the vikings making up for that during the season but once the post season hits teams are just gonna take everything close away and make him throw deep and the underthrown balls are either gonna be PI or Int. I wouldn’t wanna take that chance but what do I know maybe the Vikings do it.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "wehaddababyeetsaboy",
                                    "body": "Honestly I think this is the right take.  Aaron Rodgers is pretty enigmatic and not well liked by lots of people but he's still a good football player and he should perform better than Darnold did in those last 2 games.  I don't like it but if this situation is just going to fall in our laps we should probably roll with it.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Rad_platypus7",
                                    "body": "He looked a lot better, but he handicapped the offense so badly with his lack of mobility and refusal to run plays. He’d have a couple vintage looking throws, but besides that the offense played too slow and not in rhythm way too often. We didn’t score against you guys until late in the 4th Tyrod last time 😭",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "monkeypickle8",
                                    "body": "He did not look good, I watched every game. The injury was definitely part of the problem and so was the coaching, he had a handful of ok games, and a handful of games that he really thrived in garbage time. He would be a lot better in the Vikings offense don't get me wrong, but if he mentors JJ like he did Zach Wilson he's not going to benefit at all from Rodgers being there.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AzorAhai1TK",
                            "body": "I can't stand Rodgers but his upside is still higher than Darnold for you guys.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "GuysOnChicks69",
                            "body": "As a Packers fan I am praying to god you guys don’t sign Rodgers. Considering how he ended the year and the fact he was playing for the fucking Jets means he will be unstoppable on the Vikings. Just like favre",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Rube18",
                            "body": "The upside is definitely there. We’re talking about one of the best, most talented QBs of all time. \n\nYeah, he’s coming off a bad season for the freakin Jets after coming off a serious injury at age 40. It shouldn’t shock anyone that he had a down year.\n\nI’m not even saying they should sign Rodgers, but to act like there’s no upside to Rodgers playing in this offense with this receiving core is blasphemous.\n\nJJM is coming off a season long injury himself and has never taken a snap in the NFL. If you removed the names and only showed their injury history and stats it would be a no brainer which one this team should roll with for 2025. People just aren’t able to set their feelings aside on Rodgers.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "gopac56",
                            "body": "Rodgers is 10x the QB Darnold is.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "LouieM13",
                                    "body": "If Rodgers aged like Peyton Manning, then definitely no. \n\nIf it’s like Tom Brady, then definitely yes lol. \n\nProblem is that we can’t accurately tell because the Jets suck.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "zenlume",
                                            "body": ">Problem is that we can’t accurately tell because the Jets suck.\n\nRodgers sucked his last year with the Packers too. \n\nHe didn't elevate the Jets above what they were with Zach Wilson. \n\nHe's 41 years old. \n\nI think we can pretty accurately tell that he's not what he was, which is normal for 41 year olds. People need to avoid falling into the trap of thinking what Tom Brady was able to do is a new norm, it just isn't.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "NeverSober1900",
                                                    "body": "> He didn't elevate the Jets above what they were with Zach Wilson.\n\nI mean while true the offense was leagues better. They were the 32nd ranked offense by DVOA with Zach Wilson. They were league average under Rodgers.\n\nThe win discrepancy is entirely because Wilson had a top 5 defense and special teams and Rodgers somehow ended up with a bottom 10 D and bottom 5 special teams. Zach Wilson and the offense were holding back those Jets teams. Rodgers and the offense were the highest ranked unit for his teams. \n\nIt's not the same situation",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "gopac56",
                                            "body": "One thing we can tell is that Darnold is not great.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "LouieM13",
                                                    "body": "Yea he’s average.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LameSignIn",
                                            "body": ">If Rodgers aged like Peyton Manning, then definitely no. \n\nMannings issue was injuries.  He changed his throwing motion to make up for the neck injury.  When he hurt is foot that took all his power away from his throws.  Brady was lucky enough to only have the one big injury early in his career.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Capt-Crap1corn",
                                            "body": "He doesn't like to show up to OTA's or anything and I get it at his age, but we don't need that type of distraction right now. It makes for a great narrative but if people want narratives like that, they should just watch the WWE.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "Capt-Crap1corn",
                                            "body": "He doesn't like to show up to OTA's or anything and I get it at his age, but we don't need that type of distraction right now. It makes for a great narrative but if people want narratives like that, they should just watch the WWE.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "NeverSober1900",
                                                    "body": "He showed up to all the voluntary OTA's he missed like 2 or 3 days of the mandatory ones. I honestly think the whole thing is overblown we had several guys miss ours and no one cared. It's just everything Rodgers does is under a microscope so in that sense maybe you're right about the distraction but think the media is more about it than what the player does",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Reboot-Bloody-Roar",
                                    "body": "In 2025? nah",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "noah3302",
                                            "body": "This is some crazy talk lmao even if he doesn’t start at least he’ll mentor JJMac a bit",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Floaty_Waffle",
                                    "body": "FAKE NEWS!!!",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kekehippo",
                            "body": "No he throws a game sealing INT in the NFCCG as the scrolls foretold.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Briguy_fieri",
                            "body": "Can kicking you say?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "drummerboysam",
                            "body": "Listen, the points VIkings fans make are all perfectly sound. They make sense. But you have to understand that you can cut flowers, but you can't stop spring.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Mvpliberty",
                            "body": "We could curse ourselves selling our souls",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Electronic-Island-14",
                            "body": "you didn't watch Rodgers this year then, because he started finding his groove late in the year.\n\nI want this to happen SO BAD. McCarthy can sit on the bench another year if we are going to go with Aaron FREAKING Rodgers",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "spazz720",
                            "body": "You guys are built to win now though. One thing if JJ was coming in fresh, but he’s coming off a major injury.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "gotcam189",
                                    "body": "Where did people get this idea that his knee injury was something catastrophic? He had surgery like 7 months ago, had normal maintenance with the injection, and there is no talk of him being behind schedule. \n\nIt’s a meniscus, not an achilles or even an ACL.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "DoubleDumpsterFire",
                                            "body": "I wouldn't be super worried about the knee. Relying on an unknown QB when you're built to win is a gamble. Id rather do that than deal with ARods bullshit.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "spazz720",
                                            "body": "It’s still a major thing to comeback from…especially when they’ve yet to take a single snap in a NFL game.",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "istasber",
                                    "body": "Whether or not we're built to win now depends on how well our free agency acquisitions wind up doing. Rodgers would fit into that since he's old and has been on the decline for a few years, but McCarthy also fits into that since he's coming off of an injury.\n\nI'd rather roll on the young guy with upside than the old guy who may be washed, but I wouldn't blame the coaches for thinking the old guy who may be washed might be a better choice at the right price.\n\nedit: What I mean to say is that our roster is filled with bets on guys who are either old or coming off of injuries so they were relatively cheap. It's not like we've got this young core that was a piece or two away last year and a QB would definitely push us over the top. So why put all our eggs into the Rodgers basket when there's no guarantee the rest of the roster is ready to make a push?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "spazz720",
                                            "body": "It worked with Farve…and if Rodgers is trash, you throw in JJ. It’s a smart roll of the dice cause you know Rodgers doesn’t want his Jets fuck up to be his denouement.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "istasber",
                                                    "body": "Because that's 40M you don't need to spend that could be better spent elsewhere. It's a massive risk for upside that will only really pay out if everything else goes well.\n\nMcCarthy has his own set of risks, but the upside will pay out over the long term if he pans out.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bigdumb78910",
                            "body": "*early first round pick.\n\nEdit nvm thought that was referring to JJM",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Pandamonium98",
                                    "body": "If they win 11 games and get knocked out in the divisional, they’d end up with a late first round pick",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Hiei2k7",
                            "body": "Oh yea, if you sign Rodgers, you also sign his entourage of purse-holders too.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "theamericandream38",
                            "body": "Aaron Rodgers played like dogshit last season, he is legitimately a worse quarterback than Zach Wilson at this point in his career. Dude is absolute ass and if he signs with the vikings they will not win more than 5 games",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "AMF505",
                                    "body": "Congrats on a completely moronic take",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "griffery1999",
                    "body": "That answer is complicated and we can’t answer it really. If KOC and the Vikings organization actually believe 100% in JJM, then going after rodgers is silly. \n\nBut if they aren’t sure or think he could be a bust then getting rodgers is the right move. As long as he doesn’t fuck up our cap situation. \n\nRodgers wasn’t as bad as people think he was last year, it could theoretically work. For the record I’m 50/50 on the idea.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "17_Saints",
                            "body": "It's not mutually exclusive that they believe JJM is the future and they bring in a QB that could (or would) start this year. He missed out on a full season of practice reps let alone game reps, buying him extra time would not be a bad thing.\n\nWhat they won't do is overpay or give out a multi-year deal. That likely means Rodgers would have to agree to a 1 year deal around or less than 30 mil. Probably won't happen.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "griffery1999",
                                    "body": "I don’t disagree, but then why not resign Daniel jones or go after a guy who did start like copper rush. We had the cap space, we just didn’t apparently.\n\nThe fact we haven’t signed anyone to be that kind of backup gives more legitimacy to the rodgers rumors imo.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "17_Saints",
                                            "body": "They did try to re-sign Daniel Jones, and that was likely plan A. Whether the Colts simply offered more money or Jones liked his chances to play there better, it didn't happen. Whatever Jones would have demanded to stay here was outside of Kwesi's price range and he likes to be flexible with his options.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "paultheschmoop",
                                            "body": ">why not resign Daniel jones or sign a guy like cooper rush\n\nI mean….they *will* sign a high end backup QB like Flacco if they decide not to go the Rodgers direction. Those guys will be clear cut backups. They’re evidently still deciding whether or not they can get a 1 year rental that is better than JJ first.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheSwede91w",
                            "body": "I think they can 100% believe in McCarthy and still think Rodgers might be the better shot at winning a super bowl this year.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "paultheschmoop",
                                    "body": "This is the reality, and it is honestly extremely frustrating to see other people say “omg they must think JJ is a bust if they want Rodgers!!!” \n\nNo. They know that super bowl windows can shut very quickly.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "aceluby",
                                    "body": "They would be fucking idiots if they thought that.  His last couple years were incredibly confrontational at Green Bay because he felt he wasn't given enough freedom to run the offense from the line (like Brady & Manning).  So he moves to the Jets where he loses a season, and the next season he gets a bunch of the coaching staff fired.  He then went on to have a mediocre season because he was never coached to be the OC on the field like Brady and Manning were.  Couple that with KOC being younger than Rodgers and this would be a trainwreck waiting to happen.\n\nI just don't see how this is anything but internet fantasy at this point.  The front office has been too competent the last few years to make this big of an obvious blunder.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "SiphenPrax",
                                            "body": "Yeah they’re out of their minds if they think they want to win now this year with Aaron Rodgers and forgo another year of starting JJ. It’s such a waste and people will question why they even drafted JJ in the first place.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheTaxman_cometh",
                            "body": "Rodgers' stats weren't as bad as the criticism he's taken, but if you actually watched his games, yes, he really was that bad last year.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "macc_aviv",
                                    "body": "I didn't watch the games, but in his last year in Green Bay he really just didn't feel like he had the same 'IT' factor anymore, and the front office was happy to pay him $40 million to play elsewhere. If he was willing to buy into the system I have no doubt he could probably still be could enough with MN/KOC, but he's always been somewhat stubborn about incorpating his way of thinking into an offense, which makes it difficult with him on the downside of his career.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "aceluby",
                                            "body": "Wasn't that the rub his last few seasons in GB?  He wasn't given enough freedom with the offense that caused friction between him and the coaching staff?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "1412believer",
                    "body": "I'd imagine not, and I couldn't imagine it'd make the now second year bench rider (who was planning to start as a rookie) very happy now halfway through his rookie contract.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Eagle4317",
                    "body": "Doesn't sound like it.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MLIC_Boss",
                    "body": "Schefter in the same interview says he doesn't think so. Twitter link can't post",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "AgnarCrackenhammer",
                    "body": "As a veteran presence to compete with but eventually sit behind McCarthy on deal on par with those expectations? Probably \n\nAs the default starter on a $30M deal? Probably not",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Consistent_Room7344",
                    "body": "I’ve taken everything that’s being reported coming from the Rodgers camp. If they had concerns about McCarthy, they would’ve made sure Jones or Darnold stayed.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "spazz720",
                    "body": "They haven’t come out and said no…so they’re obviously considering it.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "J-Fid",
                    "body": "That's the big question and why we're at an impasse.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "crazypyro23",
                    "body": "It's even funnier if they don't",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RadWalk",
                    "body": "If KOC gives him a tiny leash maybe",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Enough_Position1298",
                    "body": "That’s probably what he’s trying to figure out before signing somewhere.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "arrogantdesperado",
                    "body": "I mean, they're definitely open to it at a certain number or under certain conditions or the story would have gone away by now. I don't think he's just standing outside the stadium window with a boombox lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MITCalebWil1iams",
                    "body": "Not clear. It feels like if the answer was an obvious yes or no, Rodgers would have moved on or signed already.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "daeshonbro",
                    "body": "Probably not unless it’s dirt cheap and he promises to not do Rodger’s things off the field.  It benefits the Vikings to let it sit for awhile.  The more time they have to evaluate JJM in training/practice the better.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "jake3988",
                    "body": "I mean, if they wanted to overpay for a QB that's not their now 2nd year guy, they would've just stuck with Darnold.\n\nThere's no reason to say no to a 28 year old who just won you 14 games only to turn around and give EVEN MORE money to a guy turning 42.\n\nI feel like this is just social media gone wild over a joke and not anything actually rooted in reality.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "lego_tintin",
            "body": "If this happens, he just has to send unsolicited dick pics and steal millions of dollars in state funds to complete the Brett Favre arc.",
            "score": 820,
            "replies": [
                {
                    "author": "Beskinnyrollfatties",
                    "body": "“There’s nothing to be ashamed about when it comes to the human body. The media is just doing what they do and turning the human body into controversy! Anyway thanks for having me on Pat. I’ll send your money people the bill.”",
                    "score": 160,
                    "replies": []
                },
                {
                    "author": "sj1young",
                    "body": "And his home state of California will have a lot more funding to steal than Mississippi did. That’s gonna be one hell of a heist",
                    "score": 42,
                    "replies": [
                        {
                            "author": "MadManMax55",
                            "body": "\"Aaron Rodgers uses state healthcare funding to run a detox and hot yoga retreat for UC Berkeley athletes\"",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "rocksoffjagger",
                            "body": "But fewer Republicans in high places to facilitate the theft. The people who cry foul about people abusing welfare are ALWAYS the ones actually doing it.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Rodgers4",
                                    "body": "CA, IL gotta be two of the most corrupt states in the US. Swindling gov funds knows no political party.\n\n[Over the last 10 years in CA, 576 public officials have been convicted of federal corruption charges. Highest in the nation.](https://www.nytimes.com/2024/08/29/us/california-corruption-huizar.html)",
                                    "score": -3,
                                    "replies": []
                                },
                                {
                                    "author": "its_LOL",
                                    "body": "Louisiana says hello",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jake3988",
                            "body": "And again, for the 8000th time, Brett Favre didn't 'steal' anything.  He asked for it, they illegally gave it to him.  Which is why the guy in charge of disbursing those funds was the guy who was charged and sentenced to prison.\n\nCalifornia is far from perfect and has been going downhill a long time now, but they're not remotely dumb enough to do that.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Rodgers4",
                            "body": "That’s a long line to get in, robbing CA funds. It’s as much of a sub-industry as Illinois has.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ColoradoBrownieMan",
                    "body": "You joke, but if there’s anyone in the NFL that likely has already defrauded a state government, it’s gotta be Aaron.",
                    "score": 80,
                    "replies": [
                        {
                            "author": "august-west55",
                            "body": "Well, he certainly defrauded the Jets didn’t he",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "dianeblackeatsass",
                                    "body": "You can’t defraud something that’s there for anyone to take",
                                    "score": 19,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jizz_toaster",
                            "body": "I’d be surprised if he pays taxes",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "WagonWheel22",
                            "body": "Technically he robbed the shareholders of more Super Bowl rings",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "kirosenn",
                                    "body": "Id argue Brian bostick owes us one instead of him",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "WagonWheel22",
                                            "body": "Brandon Bostick is not the reason the offense only scored 6 points in the second half/OT",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stresstheworld",
                    "body": "Maybe he has already completed these tasks and is just waiting to check the final box",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "liverbird3",
                    "body": "Not just any funds though, state welfare funds intended for people that need those resources to survive. If he wants to 100% complete it he'll also have to have a child and use the stolen money to fund a volleyball arena at their child's college and then sue people for defamation when they call him out on it.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "2reddit4me",
                    "body": "He’s already sent the dick pics to RFK and I’m sure they’re working together already to steal funds.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "KnotSoSalty",
                    "body": "It’s really inevitable that one day we’ll wake up to Rodgers shilling some sketchy workout powder on the WH lawn.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Broad-Half3135",
                    "body": "As the prophecy has foretold",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ArcadianBlueRogue",
                    "body": "Come on now, be real. Rodgers isn't the dick pic type.\n\nIt'll be a pucker and the recipient will not surprise us.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "latman",
                    "body": "Tomorrow it's my turn to make this joke",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Ordinary-Depth-7313",
                    "body": "He will win the Super Bowl as a Viking, meaning he breaks the Favre arc and no longer has to send dick pics or steal state funds.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Wooden-Day2706",
                            "body": "He's cooked like roethlisberger was towards the end of his career. He's just in denial.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "TheWorstYear",
                                    "body": "A lot of fans on here in denial as well.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Ordinary-Depth-7313",
                                            "body": "Yeah, if you don't think Rodgers can still squeeze out another top 10 year like he did last year, you're just being a hater. Or a Packers fan dreading Rodgers finding success in Minnesota.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "Zoomun",
                                                    "body": "I'm interested why you think he was top 10 last year.  He threw a lot but wasn't close to top 10 efficiency wise.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "holdingofplace",
                                                    "body": "Who were you watching or what stats are you looking at? Haha his stats were pretty meh and matched his film - for every vintage Rodgers throw there was an absolute duck you wouldn’t have seen from him before last year. \n\nQBR 31st, comp% 34th, TD, INT, and sack %s just above league average, 5-12 record…maybe another year from the Achilles will help but that was no where close to top 10 haha",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "NeverSober1900",
                                                            "body": "PFF had him 11th maybe OP is basing it off that? A lot of the other stats don't grade well for him but you have to keep in mind the Jets were hte worst team in the NFL for drops and that impacts QBR and a lot of the other stats. \n\nAll signs point to him being league average-ish as far as I'm concerned so I agree top 10 is ridiculous but he's clearly a starting level QB still",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "holdingofplace",
                                                                    "body": "Ah ok I figured there was something out there, or hoped haha\n\nIdk if I can agree on the team point, coaching wasn’t great but it was Rodgers’ pick and there were much worse supporting casts last year. Can’t  argue about drops other than looks like Browns and Packers had higher drop %, browns had the most drops not Jets. I get they don’t help, but even handing him 10 free completions wouldn’t bring his numbers up too much when he’s at the bottom.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Threatlevelmidn1te",
                                                    "body": "Rodgers is doo doo.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lucky-Earther",
                            "body": "> He will win the Super Bowl as a Viking\n\nlol, imagine the Vikings winning a Superbowl",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cgio0",
                    "body": "We also interviewed Rex Ryan and he could have potentially taken over the Jets again with a defense with good players and no qb lol\n\nTime is a flat circle",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DoNotResusit8",
                    "body": "He’s probably got that covered already. We just don’t know about it yet",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tullyswimmer",
                    "body": "And get a Wrangler sponsorship",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Stubbs94",
                    "body": "Given the people he associates with, defrauding poor people is probably something he really wants to do",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zan9823",
            "body": "Can I buy my Jordan Love Jets jersey already ?",
            "score": 202,
            "replies": [
                {
                    "author": "Rushjordan",
                    "body": "In 2038",
                    "score": 59,
                    "replies": [
                        {
                            "author": "SiphenPrax",
                            "body": "Our dumbass owner will make sure of it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "20wall",
                    "body": "Not until we get our 1 appointed Super Bowl win (and then a decade plus of disappointments)",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "TimelessFool",
                    "body": "A “Jordan Love’s Jets” jersey doesn’t sound that god awful actually",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ill_try_my_best",
            "body": "If he plays for the Vikings for one year, they'd only have a one year evaluation of McCarthy before they'd have to decide tif they're picking up his 5th year option.",
            "score": 265,
            "replies": [
                {
                    "author": "Triple_Boogie",
                    "body": "The Jordan Love Method",
                    "score": 180,
                    "replies": [
                        {
                            "author": "dianeblackeatsass",
                            "body": "Love sat 3 years. JJ in this scenario would be sitting 2. Feels like 2-3 years starting to evaluate him before the second contract is plenty of time.",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "20wall",
                            "body": "Yup. And now we’re stuck with his mid ass until 2029",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ButtonedEye41",
                    "body": "A 5th year option isnt that disastrous.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "Next_Dawkins",
                            "body": "5th year option for a QB *without* a pro bowl is ~$25m.\n\nWith a pro bowl it’s like $35m, but if that’s the case there likely is no decision.\n\n\nIt would be pointless though - because if Rodgers plays for 2 years what’s your realistic plan for McCarthy.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "JPScan3",
                                    "body": "Damn all those AFC QBs dropping out made Drake Maye's 5th year option expensiveeeee",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Next_Dawkins",
                                            "body": "No to have the pro bowl enhancement you need to be on the original ballot not an alternate. \n\nThe other callout for JJ is the playtime modifier. He would need to play ~75% of snaps in 2/3 of their first seasons, or an average of ~75% over the first three.\n\nFor Kenny Pickett that the playtime modifier was only $22m vs $25m.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MikeFromSuburbia",
                            "body": "Especially when the ball is in the Vikings court (should that happen) to offer a cheap contract anyhow to prove it",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ill_try_my_best",
                            "body": "1 year ~25 million. Not terrible, but also not great",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Critical-Werewolf-53",
                                    "body": "By the time it hits it’ll be a steal",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ehtw376",
                    "body": "True but that’s not that big of a deal imo. Given how paramount and important the QB position is they’d do it regardless probably unless JJ is like Anthony Richardson level bad.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "ill_try_my_best",
                            "body": "A 5th year option for McCarthy if he doesn't start this year would be like 25 million fully guaranteed. If he plays average/mediocre in 2026, that's a lot for someone who's not playing well. \n\n\nBut as you say, QB is so important they might have to do it anyway, but do they want to complicate their future to sign Rodgers this year? imo only if they think they can win a super bowl with Rodgers but not with McCarthy ",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Siggi97",
                    "body": "They can try to give him a Jordan Love deal if necessary. More money for the 5th year, but less guarantess compared to the option.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "McSweetSauce",
                    "body": "One year of play time + two years on the bench behind vets and O’Connell. I don’t think it matters that much in this case",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TheSwede91w",
                            "body": "And the Vikings have their cornerstone offensive pieces signed well into the future, so it's not like McCarthy would be inheriting some mess. It won't take much to tell if he's got \"it\" or not because he won't have anyone to blame but himself.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "McSweetSauce",
                                    "body": "Yup. If the Vikes think Rodgers can get them deep in the playoffs, they should do it. If Rodgers stinks next year, just bench him and let McCarthy take over if you truly believe in the guy",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Matto_0",
                    "body": "Can't you decide to pick up the option after the player 4th year?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ill_try_my_best",
                            "body": "The deadline is like May 1 before their 4th year",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JonnyB2_YouAre1",
                    "body": "I hope they say no because it pretty much takes them out of the title mix if they need to roll with essentially a rookie QB who's best season in college was a 22TD campaign.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Triple_Boogie",
            "body": "he's been available for six whole days, who the fuck does he think he is having preferences as a free agent quarterback",
            "score": 314,
            "replies": [
                {
                    "author": "Intrepid_Panda9777",
                    "body": "You don’t understand Brady played after 40 and he’s only 15 years removed from a Super Bowl victory.\n\nAnd the only thing that’s happened since is just Brandon Grahams entire career.",
                    "score": 150,
                    "replies": [
                        {
                            "author": "Mecha-Jesus",
                            "body": "Aaron Rodgers’ only Super Bowl appearance is closer in time to the OJ Simpson trial than it is to today.",
                            "score": 114,
                            "replies": [
                                {
                                    "author": "ballknower871",
                                    "body": "Aaron Rodgers last Super Bowl appearance happened a few months after the release of transformers revenge of the fallen.  In that time 6 transformers movies have been released since. Dark of the moon, age of extinction, the last knight, bumblebee, rise of the beasts, and transformers one. \n\nEvery single one of these movies was just as unsuccessful at establishing the franchise as a household name as Rodgers attempts to join the Minnesota Vikings.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "GamingTatertot",
                                            "body": "Uh I’m not a big fan of the Transformers films, but two of those films made over a billion dollars. Also they’re definitely household names",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "UnderwhelmingAF",
                                            "body": "I hate to be the “akshually” guy, but Rodgers’ Super Bowl appearance was almost 2 years after the release of Revenge of the Fallen. (February 2011 vs. June 2009)",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "sherlock_traeger",
                                            "body": "Truly awful analogy",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "mm825",
                                    "body": "Print this on a T shirt and let me buy it ",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "jake3988",
                                    "body": "That's false.  His super bowl appearance was in February 2011.  The Trial was in 1995.  That's a span of 16 years.  Perhaps you could argue 15.5 years if you go with the end of the trial instead of the start of it.\n\nUnless it's secretly 2027, no, it's not closer.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "TheWorstYear",
                                    "body": "But it's not as old as a good slow speed Bronco chase",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Kind_Resort_9535",
                                    "body": "Oh shit ya, it is lol i was gonna argue.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "nameuser121212",
                                    "body": "Oh. Oh man :(",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Lucky-Earther",
                                    "body": "> Aaron Rodgers’ only Super Bowl appearance is closer in time to the OJ Simpson trial than it is to today.\n\nMy knees just started creaking while reading this.  Holy fuck.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "unexpectedreboots",
                                    "body": "Tom Brady and Aaron Rodgers have the same number of NFC Championships.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "jacoblanier571",
                                    "body": "Okay, now I feel old.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Knickstape08",
                    "body": "“Schefter reported Tuesday on his podcast that \"we can only surmise\" about Rodgers' mindset”\n\nThis is a garbage report with no basis. The definition of surmise is guessing with no evidence. This sub is being infested with literal speculation reporting being presented as fact.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "3rd-party-intervener",
                            "body": "Its schefter what you expect ",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "msf97",
                            "body": "Bro it’s every single day with these Rodgers posts💀!\n\nAnother Schefter filler podcast where he speculates being reported as fact by somebody else. Schefter as the tag in this is so misleading \n\nReinstate twitter please mods.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Knickstape08",
                                    "body": "It at least needs to be tagged as speculation because the way it’s presented on Reddit it’s as if this is a legit report. Once you actually click the link and read the article it’s just Schefter admitting he doesn’t know anything. Something needs to be done because this is garbage that’ll get high upvotes and comments that’ll shit on Rodgers when this is, literally said by the source, made up.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BlindWillieJohnson",
                            "body": ">  This sub is being infested with literal speculation reporting being presented as fact.\n\nWhat do you think Sports Media is in the pre-draft, post FA doldrums?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Knickstape08",
                                    "body": "The title makes it seem like it’s fact and judging by the comments on this post people think it’s true when Schefter said he’s just guessing. It’s formatted like he tweeted it when he’s just a bleacher report article about what Schefter said on his podcast. \n\nIf the title was true and said “Adam Schefter thinks Rodgers wants to be a Viking but doesn’t know” it doesn’t get the same engagement. My issue is more with the Reddit side of things, obviously Schefter is going to speculate but we can’t report it like it’s the truth. Especially when Schefter implies he has no evidence to back it up.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "BlindWillieJohnson",
                                            "body": "> My issue is more with the Reddit side of things\n\nWhy? It's BR's verbatim headline. The engagement farming is a whole industry problem when they have nothing to talk about.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JalensTinyPPHurts",
                    "body": "He is still a quality QB, and is the most accomplished one available.\n\nHe wants to go out with a ring, and the vikings are his best bet at doing that.\n\nIf the vikings want to compete, rather than potentially sacrifice a year of competing to develop JJ, Rodgers is their best bet at doing that",
                    "score": 33,
                    "replies": [
                        {
                            "author": "rob_var",
                            "body": "If he signed for a contract less than 10 million it would make sense. Right now the Vikings have an opportunity to compete and get the right pieces for JJ, why waste 30+ million dollars on Rodgers.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "JalensTinyPPHurts",
                                    "body": "Vikings cap situation is fine, and the depth chart is pretty solid rn.\n\n\nGuard/CB are probably the only significant needs (depending on when they get darrisaw back)",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "rob_var",
                                            "body": "That’s not the point, I’m saying why bring in Aaron when that 30+ million can get you a guard, cb, and any other upgrades needed. You drafted a guy in the first round for a reason either he is or isn’t your next qb no reason to do what the falcons did",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "JalensTinyPPHurts",
                                                    "body": "The vikings can afford all of that.\n\nThey have multiple restructures available they haven't even touched yet.\n\nIf the vikings suck this year with McCarthy, KOC's seat gets a lot warmer then he wants it to be (especially when you look at his lack of playoff success).\n\nIf JJ gets injured again, they also are likely screwed for the season ( Brett rhypen is the only backup rn)",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Smearwashere",
                                                            "body": "I prefer to think that JJ ends the season winning MVP and the Vikings win the SB. But that’s just me.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Transmaniacon89",
                                                    "body": "Are there any good guards/CBs still available?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "_AtLeastItsAnEthos",
                                                            "body": "Couple mid tier G and some slot corners that are good to great and a couple old heads",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "rob_var",
                                                            "body": "Some decent ones none over the top but with that much cap flexibility you could always inquire about trading for one on a team that needs to move money around",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ballknower871",
                                    "body": "If Rodgers really wanted to get one final shot at a ring he'd take whatever contract they offer",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "alienware99",
                                    "body": "The Vikings have a roster that’s ready to win now, and they know McCarthy better than anyone. If the organization doesn’t think he’s ready to start then it don’t think it’s crazy to redshirt him this year. Last year he was out with injury so he couldn’t really develop through reps or on field action.\n\nI think they’d be crazier to just roll with McCarthy if they think he isn’t ready, but still doing it because they feel like they have to since he was a 1st rd draft pick.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "scbtl",
                                    "body": "I do have to wonder if his contract requests are different per team. Like the Giants, sorry it's $100M basically GTD. Steelers is maybe a 2 year $60M front loaded so that he maximizes the gap in offsets. For the Vikings it may be a Russell Wilson esq vet minimum.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gengh15",
                            "body": ">He is still a quality QB\n\nBased on?\n\n>If the Vikings want to compete rather than potentially sacrifice a year of competing to develop JJ\n\nOkay so *if* Aaron were still a quality QB you could expect a year out of then what happens next year? Now we’re 2 years into JJ’s contract and still haven’t seen him. Do we bring in Russ to give us a “quality QB” and then end up paying JJ based on 8 weeks of QB play in year 4 like Love?",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "alienware99",
                                    "body": "Rodgers was 8th in TDs (28 tds) and 8th in passing yards last year. This was on a dysfunctional Jets team, with a coaching change mid season, and coming off an achilles tear the year prior. He’s definitely still a solid QB..maybe not a top 3 QB in the league anymore, but a solid QB non the less.\n\nThe Vikings are coming off a great season, but their QB from last year is now gone. The team is constructed to win now. If the organization doesn’t think McCarthy is ready, do you (as a Vikings fan) really think they should roll with him? I don’t think it’s crazy for them to redshirt McCarthy in his 2nd year, since he missed the entirety of last year with an injury. He was a 1st round pick, so they have him under control for 4 more years..he’ll have plenty of time left even if they roll with another QB this year.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "AKAD11",
                                            "body": "8th in yards but 2nd in attempts. You should throw for a lot of yards if you attempt almost 600 passes.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "cdub8D",
                                            "body": "Yes we absolutely should roll with JJM.  Get him actual game reps and see what he can do.  I am sick of stop gap solutions.  Let's see if we have a franchise QB in McCarthy or not.  If not then let's try drafting a guy again.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "amak316",
                                    "body": "There are about 4 QB's in the entire league that can drag most teams to the playoffs, there are another 6-7 that you could potentially win the superbowl with if you have the right team around them. You guys won 14 games last year and have added a bunch of talent this offseason, I understand the FO's hesitancy to hand over the team to the 5th QB taken in last years draft and hope he can immediately be a top 12QB in the entire league in his first year active.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "JalensTinyPPHurts",
                                    "body": "The goal is to win a Superbowl. If they think Rodgers gives them the best shot to do that, the future doesn't matter (or at least that's how you justify it).",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "SaddiqBae",
                                            "body": "McCarthy gives them a better chance at a super bowl than Rodgers does. He hasn't been a good QB in 3 years",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "dianeblackeatsass",
                                                    "body": "McCarthy hasn’t taken an NFL snap. Hilarious seeing people act like he’s without a doubt better than a solid QB",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "SaddiqBae",
                                                            "body": "...which still gives you a better chance than Rodgers, who is both washed AND too much of a narcissist to play effectively for the team.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "dianeblackeatsass",
                                                                    "body": "According to who? If the choice was so obvious like you’re acting like it is Rodgers would’ve been told no or the Vikings would publicly back JJ and this whole drama wouldn’t exist. They’re at least considering it",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SaddiqBae",
                                                                            "body": "According to the Packers, who let him go? Or the Jets? Or the fact that he still doesn't have a team? They might be considering it, but that doesn't mean it's a good move.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Triple_Boogie",
                                                    "body": "> McCarthy gives them a better chance at a super bowl \n\nwhat the fuck",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "SaddiqBae",
                                                            "body": "Rodgers gives them about a 0% chance, so",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "abris33",
                                                    "body": "McCarthy hasn't taken a snap, was the most raw rookie coming out and didn't practice all year. I could see why the Vikings think they're still contenders and would want to roll with Rodgers",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "DamianLillard0",
                                                    "body": "According to you. We’ve yet to see if that’s what the Vikings determine",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ModestTrixie",
                                    "body": "Tends to work for Green Bay.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Ordinary-Depth-7313",
                                    "body": "Based on being a top 10 QB last year lol.",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "bigdumb78910",
                                            "body": "In which metric?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Ordinary-Depth-7313",
                                                    "body": "Yards and TDs.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "Nijo32",
                                                            "body": "By that logic why not just extend Darnold, he had more yards and TDs than Rodgers? Rodgers is asking for the same salary as Darnold anyway.\n\nThe damning stat is QB rating. Rodgers has always been elite in this due his proclivity to taking sacks over throwing contested passes that could result in a turnover. He finished at a QBR of 90.5 in 2024, good for 21st in the NFL and the worst of his career, a full 12 points lower than his career mark of 102.6. He got to the yards and TDs as a volume merchant on a laughable 6.7 YPA which was outside the top 30.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Ordinary-Depth-7313",
                                                                    "body": "Because when the first seed, and then season was on the line, Darnold went right back to being the same ole Darnold and blew both games. Having to watch Dak Prescott, I know that is something Darnold will never get over. As for how much Rodgers wants, I'm sure he'll come down in price.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Nijo32",
                                                                    "body": "So your solution is 42 year old Aaron Rodgers, who’s on a sharp decline and at serious risk of not making it through the full season without injury, as your late season savior? I don’t think he has the mobility to make it through half the season in the Vikings’ long-developing passing offense, and his lack of mobility would cut into the team’s attempt to improve the rushing game by curbing the threat of play action.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "bigdumb78910",
                                                            "body": "His yds/att were near the bottom of the league, brother. He's in the neighborhood of Aidan O'Connell, Mason Rudolph, and Bo Nix. He had a top Ten passing yards season cause he threw it second most in the league.\n\nAlso, I'm not going to sell my soul for a guy who threw only 28 tds last year, on a passer rating the same as Joe Flacco and Kirk Cousins.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "stevecow68",
                                            "body": "lol",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Ordinary-Depth-7313",
                                                    "body": "Not an argument.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "stevecow68",
                                                            "body": "Didn't want to argue with you; just laugh. Clearly you don't care about arguments based on all the amount of replys dunking on you and your 2 sole cherry-picked measurements just for you to go ghost lol",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BlindWillieJohnson",
                            "body": "> If the vikings want to compete, rather than potentially sacrifice a year of competing to develop JJ, Rodgers is their best bet at doing that\n\nThis is silly. JJ McCarthy might actually be able to move around in the pocket. Which, by the by, is not an unimportant skill in KOC's system.\n\nThey also know a lot more about where McCarthy's at than you, and frankly, I think they've earned the benefit of the doubt as to who gives them the best chance to win.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "JalensTinyPPHurts",
                                    "body": "Rodgers mobility was fine at the end of the season",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DupreeWasTaken",
                            "body": "He's also friends with Kevin O Connell.\n\n\nI don't think it will happen. But I can absolutely see why he's hoping they will give him a job for one last run",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Prozzak93",
                    "body": "Why do you think this is wrong? I assume just because it is Rodgers. If he wants to go there and they have indicated they are thinking about it I don't see why he wouldn't wait (or resist going elsewhere). \n\nIt's the end of his career. He doesn't need the paycheck. It should be more about finding a fit he agrees with and imo it makes sense to wait if he thinks the Vikings are the best option.\n\nedit: I missed the sarcasm/joke. My bad.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "smokeymicpot",
                            "body": "Based on the vikings subreddit and nfl subreddit. Rodgers is asking for 40 million and to burn down everyone’s houses. \n\n\nIn reality no one knows shit and everyone is guessing.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Triple_Boogie",
                            "body": "The way reddit formats comments it's hard for me to tell whether you're responding to me or someone else (that's on me, I'm kinda dumb) but I'm 100% joking if that wasn't obvious",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Prozzak93",
                                    "body": "Ah, no I meant you but my sarcasm detector was broken. Thought you were being serious lol my bad.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Triple_Boogie",
                                            "body": "nah you good, that's always the risk of being sarcastic lol, i thought \"six whole days\" would be a dead giveaway",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Prozzak93",
                                                    "body": "On reading it again that should have been.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Meltedcoldice0212",
                    "body": "Rodgers is an attention seeker",
                    "score": 2,
                    "replies": [
                        {
                            "author": "timid1211q",
                            "body": "OK and terminally online redditors love that because they can post countless unhinged comments about him and get thousands of upvotes. He's a vessel for the seething hatred and jealously of thousands of basement dwelling losers. It's a match made in heaven honestly.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rallar8",
                    "body": "I mean he’s got the money, if he only wants to play football if it’s the Vikes, idk I hate the guy but it’s a valid point when you don’t need to play anymore",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "spazz720",
                    "body": "I mean he kind of does…the teams can easily just not sign him and locked in other options.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JavaTheeMutt",
                    "body": "I think that's why this story keeps circulating. Rogers clearly wants to play for the Vikings, and is having his representation use their connections to make it clear he wants to play for them. Whether or not the Vikings do is another story...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "amak316",
                    "body": "He’s got options, he could just retire since he’s old as hell. I get why people hate Rodgers, but trying to land in a spot with a real shot at a title for his last season seems pretty reasonable.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pandarancher",
            "body": "Please Vikings. The memes will feed us for an entire offseason.",
            "score": 198,
            "replies": [
                {
                    "author": "Serallas",
                    "body": "Trust me when I say the nfcnorth meme war sub would be ESTATIC (including me)",
                    "score": 54,
                    "replies": []
                },
                {
                    "author": "tannerjameslasswell",
                    "body": "Its written in the stars Vikings. This has to happen. Resistance is futile Rodgers will be a Viking.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "sportsworker777",
                            "body": "I'm ready for NFC Championship heartbreak again",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "notimprezaed",
                                    "body": "Hey now, Rodgers was always more efficient than Favre, you’ll get a Super Bowl heartbreak instead!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Isphet71",
                    "body": "For 20 offseasons. Not just this one.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Demetrios1453",
                            "body": "And then Love can start them all over again!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jiggins96",
                    "body": "I fucking loathe Aaron Rodgers, but I absolutely love memes. So I say bring it on. NFCNMW will have a field day and I wanna see it.\n\nOn a serious note, the talk of the Vikings supposed interest doesn’t make much sense, unless there’s something more to JJM’s rehab that we don’t know? In that case, Rodgers for 1yr to let JJM keep rehabbing, and hopefully learn a little something, isn’t the worst thing",
                    "score": 14,
                    "replies": [
                        {
                            "author": "mgw777",
                            "body": "It’s a meniscus injury, not like he tore a ligament. Would be highly unusual to need anything more than 6 months for a full recovery.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "thrice1187",
                                    "body": "Why are Vikings fans so against this? Isn’t their roster more on the win-now side? They have the 2nd oldest roster in the entire NFL. \n\nRodgers actually looked solid the second half of last season. Why waste a season or two of Jefferson’s prime hoping that a rookie QB pans out?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "mgw777",
                                            "body": "Why trade up to draft a QB in the top 10 if you’re not going to play him on the rookie contract (which is the whole reason we can sign these players)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "thrice1187",
                                                    "body": "You still have multiple years of JJ on a rookie contract after this season. \n\nRodgers is way more of a sure thing for a team that’s built to win now.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "mgw777",
                                                            "body": "Is he a sure thing? His last good season was 2021. KOC has a system that is proven to work. Rodgers has proven that he does things his way or no way. KOC has created an amazing culture and I don’t want to ruin it for a has been that’s gonna demand we sign Allen Lazard and take ayahuasca vacations.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "thrice1187",
                                                                    "body": "Rodgers isn’t an absolute sure thing but he’s more likely to help the Vikings win this season than JJ in my opinion. \n\nTrotting JJ out there is a bit of a gamble for the second oldest roster in the NFL that’s built to win now. \n\nJJ will still be there the next year and he’ll still be dirt cheap for multiple seasons.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Jiggins96",
                                    "body": "Oh I agree, it’s just the only thing I can think of to justify the interest in Rodgers instead of handing the keys over to JJM\n\nUnless Rodgers is open to being the backup and would be coming on with that explicit understanding that he is QB2 to start the season",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mgw777",
                                            "body": "I think people in the media just want this to be a thing. If we had interest he’d already be signed.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Drunken_Vike",
            "body": "Brother, have you ever read that book \"He's Just Not That Into You?\"",
            "score": 158,
            "replies": [
                {
                    "author": "ExpectedOutcome2",
                    "body": "Why don’t they tell him that?",
                    "score": 15,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "dianeblackeatsass",
                                    "body": "They could stop all this noise with one public statement about how JJ is their guy. But they haven’t. Not sure if it happens but feels like it’s at least a conversation",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "jimbo831",
                                            "body": "They wouldn't even need to make a public statement. Teams don't usually make public statements about players they're not going to sign. But they do \"leak\" things like that to their friendly media moles to disseminate it as \"breaking news.\"",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "jimbo831",
                                                            "body": "Yes, and not a single one of those is a definitive statement. They are all couched and leaving the possibility open which tells me it is still an open possibility in the organization.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ExpectedOutcome2",
                                    "body": "Then why is he still trying to go there and no one from the Vikings has come out and declared JJ “the guy”? This is a cope",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MelfromMilwaukie",
                    "body": "Yea man, I know the fanbase isn’t interested but clearly your FO is. This whole thing could have been dismissed over a week ago by the Vikings. The fact that they haven’t put cold water on Rodgers coming to town speaks volumes.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Drunken_Vike",
                            "body": "I guess I just don't get why everyone is taking the word of one reporter when all the other reporters have said mostly the opposite\n\nfrom my perspective this seems like a very obvious Rodgers' agent is feeding the one reporter situation but I will admit later if I am proven wrong",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ItIsYourPersonality",
            "body": "Why does it feel like Aaron Rodgers and the NFL are colluding for force him onto an unwilling Vikings team?",
            "score": 53,
            "replies": [
                {
                    "author": "bigdumb78910",
                    "body": "When you're a star, they let you do it",
                    "score": 45,
                    "replies": [
                        {
                            "author": "jawni",
                            "body": "grab em by the purse strings.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "ZroDgsCalvin",
                            "body": "As long as I live, I’ll never understand how that wasn’t the end of it",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "icecubetre",
                                    "body": "For me, it was when he mocked the disabled reporter. \n\nBut I also thought they'd change things after Sandy Hook, so what the fuck do I know",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "daeshonbro",
                    "body": "Because Rodger’s wants to go out with a bang, in a good way, and the Vikings are one of the best spots to do that.  It also gets the juicy storyline of him potentially doing what his predecessor couldn’t.  The media wants it because it’s juicy and gives them an easy storyline to get attention.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "LederhosenSituation",
            "body": "Giants and Steelers banging down Rodgers' door but he ain't home. He's banging down the Vikings' door, but they ain't home.",
            "score": 13,
            "replies": []
        },
        {
            "author": "SEYMOURASSES66",
            "body": "He’s a hoe and I wouldn’t trust him to create a garden.",
            "score": 87,
            "replies": [
                {
                    "author": "thisusedyet",
                    "body": "That is a hell of a phrase",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Warbuss",
                            "body": "People have been throwing out banger phrases this FA season. \n\nWhen PHI picked up AJ Dillion a Packers fan commented “He’s really good at picking up one yard unless you need one yard.” Been thinking about that for a week now lol.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "PrestigiousWave5176",
                                    "body": "Good thing the Eagles will never need him to pick up one yard. That's half the issue gone.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cold_Entry3043",
            "body": "Please no one sign this man and just let him walk",
            "score": 12,
            "replies": []
        },
        {
            "author": "Pah-Pah-Pah",
            "body": "Can he just retire so we don’t have to hear about this anymore?",
            "score": 11,
            "replies": [
                {
                    "author": "GalacticMoss",
                    "body": "It'd be way funnier if he just doesn't get signed and finds himself sitting on his couch during training camp",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Pah-Pah-Pah",
                            "body": "He’d just be on that talk show all the time since he probably would be lost without all the attention.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ana_de_armistice",
            "body": "aaron buddy it’s 1:25 am, the bar is closing in half an hour. they already turned the lights on. you do not get to sit here and say “maybe anne hathaway is gonna show up”",
            "score": 48,
            "replies": [
                {
                    "author": "Lamactionjack",
                    "body": "🎶 closinggg tiiimme 🎶",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bujweiser",
                    "body": "What if she did though?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "gmb96",
            "body": "So upon reading the whole quote this, much like every other Rodgers FA article, is just guessing what is going on. For all we know Rodgers is retired somewhere in South America filming an Amazon Rainforest Cryptids doc with Tom DeLonge but didn't feel like he needed to tell anyone.",
            "score": 11,
            "replies": [
                {
                    "author": "bujweiser",
                    "body": "> South America filming an Amazon Rainforest Cryptids doc with Tom DeLonge\n\nSign me up",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lamactionjack",
                    "body": "I dunno Schefty  is basically the most connected man in football I’m sure he’s heard something. He says as much in the article too, this isn’t just speculation on his part. He covers his ass first of course but then says:\n\n>but the general impression around the NFL is the four-time MVP “would like to sign with the Minnesota Vikings.” To that end, he has “balked” at interest from the Pittsburgh Steelers and “resisted their overtures.”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bubblecuffer13",
            "body": "You can't resist the prophecy.",
            "score": 42,
            "replies": [
                {
                    "author": "BearsFan3417",
                    "body": "Dread it, run from it, the prophecy will not fail!",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Senator_Workholeface",
                    "body": "it has been decided",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "oryxherds",
            "body": "does he think that we haven’t watched him the last few years and think he’s still in 2021 form??",
            "score": 7,
            "replies": []
        },
        {
            "author": "NoLimitSoldier31",
            "body": "As a Vikes fan I’d be more into it if he could just shut the fuck up for a season.  Team JJ.",
            "score": 15,
            "replies": [
                {
                    "author": "djkstr27",
                    "body": "You know that he will never shut the f*ck up.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "dianeblackeatsass",
                            "body": "Funny enough all this drama is because he is shutting up. Hasn’t said anything since FA started. These are all random speculations from reporters.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheRealJohnMara",
            "body": "I’ve been ashamed of the Giants for everything they’ve done the past decade but this is up there for the most pathetic things. Why are we waiting on our knees for a 40 year old headache QB that is making it obvious we are not his first choice?",
            "score": 9,
            "replies": []
        },
        {
            "author": "Sanders058",
            "body": "This guy is acting like he’s in his prime and coming off of an mvp year",
            "score": 12,
            "replies": [
                {
                    "author": "AvocadoHank",
                    "body": "He clearly thinks he is lol",
                    "score": 3,
                    "replies": [
                        {
                            "author": "that_guy2010",
                            "body": "Don't think anyone's accused him of being the smartest guy in a room.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Happy-Initiative-838",
            "body": "And people try to claim Favre wasn’t mentoring Rodgers.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Killahdanks1",
            "body": "This just in from Minnesota. No.",
            "score": 5,
            "replies": []
        },
        {
            "author": "TheHypnoRider",
            "body": "Is he that much obsessed of his predecessor?",
            "score": 4,
            "replies": []
        },
        {
            "author": "DirectTV_AndrewLuck",
            "body": "Just do it! Don't let your dreams be dreams!",
            "score": 11,
            "replies": []
        },
        {
            "author": "sbroll",
            "body": "no",
            "score": 8,
            "replies": []
        },
        {
            "author": "boomosaur",
            "body": "you can try to resist, try to hide from arthur smith... but you know but you know that you can't fight the limelight\n\nretreat to the dark, and surrender to art, but you know but you know that you can't fight the limelight.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AngryBillsFan",
            "body": "Holy hell I’m sick of this guy",
            "score": 3,
            "replies": []
        },
        {
            "author": "ContinuumGuy",
            "body": "He understands THE PROPHECY",
            "score": 3,
            "replies": []
        },
        {
            "author": "EmpiricalAnarchism",
            "body": "Lolololol",
            "score": 2,
            "replies": []
        },
        {
            "author": "Swing-Too-Hard",
            "body": "Its like Poetry. Started his career in Farve's shadow and wants to end it there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "frozenish",
            "body": "This article is pure speculation and clickbait \n\nI wonder which player becomes the media’s next target for clickbait after Rodgers retires? I bet it’s Shedeur Sanders.",
            "score": 2,
            "replies": []
        },
        {
            "author": "scfoothills",
            "body": "I'd like to see this and have the Bears complete his Favre career arc.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rude-Combination-412",
            "body": "So is this like the classic story line where the “hot popular girl” can get any guy, gets rejected by the “half way cool kinda nerdy guy” and she wants him so bad since he rejected her now. Only swap the hot girl with a problematic HOF QB, and the nerdy guy with KOC and the Vikings?",
            "score": 3,
            "replies": [
                {
                    "author": "Rude-Combination-412",
                    "body": "It feels like , Rodgers is Jennifer Anniston, and the vikings are Charlie day from horrible bosses",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DireSickFish",
            "body": "Yet another non-story.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PronouncedEye-gore",
            "body": "The prophesy... it's happening.",
            "score": 2,
            "replies": []
        },
        {
            "author": "inquesoproblem",
            "body": "He’s just gonna retire when the Vikings rebuff his interest, then go on a conservative media tour on how the league blackballed him because he’s such an intellectual",
            "score": 2,
            "replies": []
        },
        {
            "author": "burywmore",
            "body": "Imagine that.  Aaron Rodgers doing something weird.  This time it's trying to exactly duplicate Brett Favres career exactly.   Why?   Well that's why it's weird.   Did they even get along while Brett was still a Packer?",
            "score": 2,
            "replies": []
        },
        {
            "author": "wolfTectonics",
            "body": "I’d rather see JJ start tbh",
            "score": 2,
            "replies": []
        },
        {
            "author": "WildinBham",
            "body": "No thank you",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThePlatinumPancakes",
            "body": "Aaron Rodgers wants to spike JJ McCarthy out of nothing but sheer pettiness and ego",
            "score": 2,
            "replies": []
        },
        {
            "author": "LordVader1995",
            "body": "I'm so sick of this fucking guy",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ass_Infection3",
            "body": "The prophecy as foretold",
            "score": 2,
            "replies": []
        },
        {
            "author": "thatoneguy889",
            "body": "My cousin and I joke about him signing with the Vikings to do the \"Full Favre\", but now I want it to happen more than ever.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Upbeat_Flan",
            "body": "It's weird that the Vikings haven't picked up a veteran backup yet if they truly do plan on rolling with jj, and the fact that Rodgers hasn't signed yet makes me nervous.",
            "score": 2,
            "replies": []
        },
        {
            "author": "cherry_monkey",
            "body": "The prophecy is not something that can be meddled with. The Vikings, Giants, Steelers, and Rodgers himself, have but the illusion of free will. It is written in the annals of time, past, present, and future. It cannot be changed, it cannot be tamed, it cannot be tampered, like Cousins. PJV. Packers, Jets, Vikings. Primordial, Juxtapose, Veritas. The truth laid near from the beginning. Resistance is futile.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MurDoct",
            "body": "Fuck this douche",
            "score": 5,
            "replies": [
                {
                    "author": "BaronsHat",
                    "body": "☝️",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Grizkniz",
            "body": "Just retire already",
            "score": 4,
            "replies": []
        },
        {
            "author": "BuffaloWilliamses",
            "body": "[Cool.](https://media.tenor.com/LsT9MK5Z55cAAAAM/johnoliver-cool.gif)",
            "score": 2,
            "replies": []
        },
        {
            "author": "PCP_Panda",
            "body": "Steelers and Giants sound like they’re resisting Aaron Rodgers",
            "score": 1,
            "replies": []
        },
        {
            "author": "leddead24",
            "body": "It’s definitely gotten weird how long it seems to be taking for Minnesota to make a decision, from the outside looking in really seems like they’re genuinely split on this decision in the front office",
            "score": 1,
            "replies": [
                {
                    "author": "Wernershnitzl",
                    "body": "Tbh I really don’t think it’s that deep. It’s probably unlikely if they haven’t “agreed to terms” yet even.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ScruffMixHaha",
            "body": "Giants I understand, but the Steelers seem like a great spot for Rodgers honestly. Playoff contending team and pretty secure job.\n\nIf things start to go south in Minnesota, people will be demanding JJ start. I dont think people will really be pounding the table for Mason Rudolph in Pittsburgh.",
            "score": 1,
            "replies": [
                {
                    "author": "Big_Wy",
                    "body": "Because Mike Tomlin isn't going to let Rodgers step all over him. Not saying Kevin O'Connell is a weak coach but, Tomlin is just different.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PatientlyAnxious9",
            "body": "Please just go away",
            "score": 1,
            "replies": []
        },
        {
            "author": "cougfan12345",
            "body": "We don't need this BS. Just resign Russ, he wants to be a Steeler.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGhostWithTheMost2",
            "body": "Rodgers has yall and the media in his hand as usual.\n\nDudes a shit QB at this point, why do people care where he goes?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fools_Requiem",
            "body": "the Vikings (and especially KOC) would be smart to not bite on A-A-Ron.\n\nExcept for the memes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jonjon428",
            "body": "Schefter didn't say this as a fact. Also this article says the Vikings traded Sam Darnold to Seattle lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "RageDayz",
            "body": "Tomlin is a QB slut",
            "score": 1,
            "replies": []
        },
        {
            "author": "iKhan353",
            "body": "Please Ricky Bobby don't you put that evil on me",
            "score": 1,
            "replies": []
        },
        {
            "author": "belizeanheat",
            "body": "Obviously an old man would rather play indoors",
            "score": 1,
            "replies": []
        },
        {
            "author": "TesticlesSpectacle",
            "body": "THE PROPHECY MUST BE FULFILLED",
            "score": 1,
            "replies": []
        },
        {
            "author": "00nonsense",
            "body": "Homeboy needs to realize that that they are not that into them. This turd needs to be flushed",
            "score": 1,
            "replies": []
        },
        {
            "author": "jtd2013",
            "body": "Rodgers better hope he wins a playoff game with the Vikings if he does go there, otherwise he isn't even the best QB to do the \"Win multiple MVPs in a row and a single SB for GB -> Go to NYJ -> Finish with MIN\" career route which is so specific it's kind of embarrassing to not be #1.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperFakks",
            "body": "Prophecy fulfilled",
            "score": 1,
            "replies": []
        },
        {
            "author": "PretzelMan96",
            "body": "The wording here gets me. He \"resisted\" them as if they're trying to force him to come there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wernershnitzl",
            "body": "At this point, I think if we wanted him, we would’ve made an offer already and “agreed to terms”. \n\nI also think management/ownership is taking business trust into account. While a big star name, how would this impact the fanbase and ticket sales? Many have expressed disinterest in the drama that comes with that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hbk268",
            "body": "He wants to throw to Justin Jefferson. That’s all",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExitVelocity66",
            "body": "1 year with Rodgers and then handing the team over to JJM is not a bad play. Vikings are loaded. You're putting a fuck ton of pressure on a 22 year old rookie by starting him AND expecting a playoff berth right away\n\n\nSitting JJ behind a hall of fame QB (who he apparently idolizes) for a year is probably better for his development anyway",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuqwon",
            "body": "I don't get why the Vikings aren't jumping at the chance to pay a 41 year old Rodgers with limited mobility $50m a year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutographedSnorkel",
            "body": "The Vikings promising him the starting job only to pull the bait and switch and make JJ McCarthy the starter would be the funniest thing ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spazz720",
            "body": "I don’t blame him…they have the team built to win now. I’m kind of surprised Min hasn’t signed him. To give up on Darnold and hand the ball to JJ who hasn’t played a snap AND coming back from an ACL? He’s the best option available to give them a chance to win now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Happy-Dream7300",
            "body": "Ya know what. Fine. Just do it and rip the band aid off",
            "score": 1,
            "replies": []
        },
        {
            "author": "aa93",
            "body": "bet",
            "score": 1,
            "replies": []
        },
        {
            "author": "TampaTrey",
            "body": "Dude. Going from the resurgence of Darnold to 40+ year old broken down Rodgers is just utterly baffling. Surely the Vikings can do better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ciderhead",
            "body": "Surprised he's not interested in the Steelers, that feels like it would be a great fit.\n\nAnd I'd be surprised if the Vikings were interested in him , that seems one of the worst fits. Surely everything they've been doing the last year has been geared around rolling with McCarthy. If they weren't going to do that, why would they let Darnild go in the first place?",
            "score": 1,
            "replies": []
        },
        {
            "author": "tgcm26",
            "body": "I'm so glad the Raiders aren't caught up in this.  Make it end!",
            "score": 1,
            "replies": []
        },
        {
            "author": "realfakejames",
            "body": "Oh yeah wonder why Rodgers wants to join his former teams rivals who had 13 wins last season",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rich-Past-6547",
            "body": "If by “resist” you mean the other two have made fair and final offers and aren’t chasing every trial balloon he floats, then this is probably accurate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MisterrAlex",
            "body": "Rodgers has accepted his fate in the prophecy",
            "score": 1,
            "replies": []
        },
        {
            "author": "genesiskiller96",
            "body": "But do the vikings feel the same way?",
            "score": 1,
            "replies": []
        },
        {
            "author": "emelbee923",
            "body": "Does he just want to play for the Vikings to fulfill 'the prophecy'? Or does he *really* just not want to go back to New York, even if its the other one OR have to play nice with Mike Tomlin in Pittsburgh?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Demetrios1453",
            "body": "Stock up on Jordan Love Vikings jerseys now, and you'll make a forutne in a decade or so...",
            "score": 1,
            "replies": []
        },
        {
            "author": "opposite_of_hotcakes",
            "body": "Do the Vikings know?",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhaleSexOdyssey",
            "body": "Kerby Joseph: yes please",
            "score": 1,
            "replies": []
        },
        {
            "author": "tinywienergang",
            "body": "Did JJ have a setback or something? His knee should be more than good to go by OTA’s, and bringing in a QB like Rodger’s would insinuate the org’s wavering faith in JJ. \n\nI just don’t see how the Vikings are even on the table outside of the memes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TCGDreamScape",
            "body": "On one hand, he probably won't choke in the playoffs like Darnold. On the other hand, does he have the juice to make it another season and do the Vikings have the line to protect him?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting_Sir7983",
            "body": "Smokescreens of the offseason…this is just agents doing their work…",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcanthaceaeOld241",
            "body": "Please sir go away and stop harassing us",
            "score": 1,
            "replies": []
        },
        {
            "author": "PeterG92",
            "body": "He is aware that the Vikings don't seem to want him? Right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BobbysBottleService",
            "body": "While I'm pretty sure he'd be bad, his old helmet in the Vikings throwbacks would be criminally cool",
            "score": 1,
            "replies": []
        },
        {
            "author": "mcolwander90",
            "body": "If this happens, can we at least get a video of Rodgers being [hit in the groin by a football](https://www.youtube.com/watch?v=svwOAk6fRmI)? To fully complete the prophecy?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProdigalSheep",
            "body": "I’ll be rooting for another team if Rodgers is at the helm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TurboNerd",
            "body": "It is written in the prophecy",
            "score": 1,
            "replies": []
        },
        {
            "author": "MagicC",
            "body": "He really wants to fulfill the prophecy...",
            "score": 1,
            "replies": []
        },
        {
            "author": "ilikepie145",
            "body": "I'd laugh if the Vikings did this",
            "score": 1,
            "replies": []
        },
        {
            "author": "dccorona",
            "body": "At this point I think he is aware of the memes and wants to fulfill them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Twicebakedpotatoe",
            "body": "I’m not sure why the Steelers and Giants would even want to have an old man Rodgers who doesn’t want to be there as their QB, I’m sure there’s no way that could blow up in their faces…",
            "score": 1,
            "replies": []
        },
        {
            "author": "dcwinger12",
            "body": "Please end it lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnthonyBarrHeHe",
            "body": "I know there is always dumb, repetitive stuff in the off season but this was in especially more annoying lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "RugerRedhawk",
            "body": "Thank you Adam for the useless info we have already read fifty times and intuition confirms as likely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "--GrinAndBearIt--",
            "body": "Justin Jefferson in shambles",
            "score": 1,
            "replies": []
        },
        {
            "author": "cammontenger",
            "body": "Fuck off, cheesehead. We're closed",
            "score": 1,
            "replies": []
        },
        {
            "author": "Parking_Ebb389",
            "body": "He’s dead meat in this division",
            "score": 1,
            "replies": []
        },
        {
            "author": "neovenator250",
            "body": "QB wants to play for a good team that needs a QB rather than an average team that needs a QB or a bad team that needs a QB.  Shocker.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TemporaryOk9310",
            "body": "Do it do it do it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cee-Bee-DeeTypeThree",
            "body": "Isn't he late for a darkness retreat?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gway22",
            "body": "If the Vikings wanted him..why isn’t he a Viking?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electronic-Island-14",
            "body": "he better be willing to take a major discount because we can't afford a QB over $25 million for a year.\n\ni want this so bad. he should be much healthier going into this season, and he always played great indoors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pulze_",
            "body": "do it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jayicon97",
            "body": "Why would the Steelers or Giants want him, either? I mean what’s the point? Is Aaron Rodgers going to take either of those teams to the Super Bowl? Certainly not the Giants. You’re better off taking a flyer on a rookie, or finding a development project like Milton / McKee / etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "in_da_tr33z",
            "body": "I have been pretty open to the idea of adding him but it would be really fucking funny if we ended this dudes career by slow fading him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BigAssSlushy69",
            "body": "Get ready to learn couch pal",
            "score": 1,
            "replies": []
        },
        {
            "author": "youvebeengreggd",
            "body": "GO AWAY \n\nGOD",
            "score": 1,
            "replies": []
        },
        {
            "author": "WabbitCZEN",
            "body": "I am convinced every little fuckin bit of news the media is drip fed, comes straight from him. He's the one who wants to drag this out, man can't breathe without attention on him constantly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stranger828",
            "body": "Hilarious timeline. How long until he send a dick pick and steals welfare funds from home state (CA) to build a volleyball arena at Butte Community college?",
            "score": 1,
            "replies": [
                {
                    "author": "drummerboysam",
                    "body": "It'll be a different thing but the same flavor. My bet is public Crypto rug-pull scam or full-on right wing grifter. The first seems below him but the 2nd is actually pretty likely.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thegroovemonkey",
                    "body": "I don’t need him to steal welfare funds but I think we all want to compare their hogs. ",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rushjordan",
            "body": "I want this to happen just for the sweet poetic justice of Florio having to root for Rodgers.",
            "score": 2,
            "replies": [
                {
                    "author": "Wernershnitzl",
                    "body": "Lmao he’d sooner be an Eagles fan as he’s stated recently",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Upset_Researcher_143",
            "body": "Sounds like the Vikings are trying to resist him!",
            "score": 2,
            "replies": []
        },
        {
            "author": "alien88",
            "body": "Makes sense. In a choice between the gauntlet of the AFC or playing in the weaker conference where you get two games against your former team it’s a no brainer.",
            "score": 1,
            "replies": [
                {
                    "author": "siblingofMM",
                    "body": "Weak?! I’ll have you know the NFCNorth had three teams make the playoffs (they didn’t win a single game, but whatever, who’s counting)",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "NBCaz",
            "body": "Every day we get at least two reports that  \"Aaron Rodgers prefers (fill in the blank) team. Usually hours after the first report, just with a different team named. Maybe at some point the \"insiders\" don't really know what AR wants, or are just being fed what their reps want them to publicize. Crazy, I know.",
            "score": 0,
            "replies": []
        },
        {
            "author": "beerncheese69",
            "body": "Kinda shocked if this is true. Didn't think he would want to continue to mimic the Favre route for his legacy. I understand Minnesota is probably his best chance to win but the Jets was already a disaster",
            "score": -1,
            "replies": [
                {
                    "author": "brianstormIRL",
                    "body": "There is zero doubt in my mind a small part of him wants to do it just to say fuck you to the Green Bay FO as well. He is that petty lol",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hyperboreer",
            "body": "What are the Steelers going to do? Rodgers in 2025 is not exciting any more, but at least it's a starter. All other options are gone at this point. They can't trade up for Ward or Sanders, it's too far.",
            "score": -2,
            "replies": [
                {
                    "author": "Beskinnyrollfatties",
                    "body": "I mean… what do they wanna give for 6?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "DirectTV_AndrewLuck",
                    "body": "Jaxson Dart possibly? That or ride it with Rudolph for a year and draft one in 2026.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Beskinnyrollfatties",
                            "body": "Dart potentially can be the best QB in this draft and I’m basing this just on the killer QB name of Dart!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "dkviper11",
                            "body": "I'd like them to play Skylar fucking Thompson for the year and be in a good position to actually draft a QB next year.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DirectTV_AndrewLuck",
                                    "body": "He would be an excellent tank commander lol.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DupreeWasTaken",
                    "body": "Mason or Russ. Much more likely Mason.\n\n\nI think outside of Rodgers they are just going to save their money and invest everywhere else and draft QB in 2026 where draft is in Pittsburgh, they should have 11 or so draft picks comp picks projected \n\n\nAnd move on.\n\n\nThey will not trade up or at least a future first for a QB this year. Excluding the fact it's a bad class. I can't imagine ownership wanting to host the draft next year without the hype of a first round pick",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Alucitary",
                    "body": "Isn't Carson Wentz still out there? Not the most impressive, but he did lead eagles to playoffs before Hurts took over.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Odd-Collection-2575",
            "body": "Please for the love of memes, make this happen",
            "score": 0,
            "replies": []
        },
        {
            "author": "rebelyusoul",
            "body": "if they bring him in, i'd be concerned for JJ. and honestly, the fact that they're even considering it makes me feel like they think he needs more time to develop.",
            "score": 0,
            "replies": []
        },
        {
            "author": "KiteStringPopped",
            "body": "Schefty is mining clicks again.",
            "score": 0,
            "replies": []
        },
        {
            "author": "kerkcuzins",
            "body": "if he does it on the cheap im fine with it",
            "score": -1,
            "replies": []
        },
        {
            "author": "owlwise13",
            "body": "The Viking's GM needs to make sure they cover their drink if Rodgers is around them.",
            "score": -7,
            "replies": []
        },
        {
            "author": "yeahwhoknowsidk",
            "body": "did rodgers big ben somebody too or is this a just a bad joke",
            "score": 3,
            "replies": []
        },
        {
            "author": "drummerboysam",
            "body": "If he's dead set on following Favre's footsteps... best to just be ready for anything. Weird guy on a track that goes to some bad places.",
            "score": 1,
            "replies": []
        },
        {
            "author": "owlwise13",
            "body": "A bad joke because he doesn't seem to understand the word NO. I also didn't realize how many Rodgers simps on this sub.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDadThatGrills",
            "body": "Life as a Vikings fan would be tragic if it wasn't so funny",
            "score": -5,
            "replies": []
        },
        {
            "author": "Natearl13",
            "body": "At least we have funny, chaos, and epic meltdowns, you’ve pretty much just been tragic until recently",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDadThatGrills",
            "body": "Oh for sure, I've been a fan since we wasted Barry Sanders",
            "score": 1,
            "replies": []
        }
    ]
}