{
    "title": "Trump doesn’t seem to know why he launched a giant trade war",
    "author": "raistlin65",
    "subreddit": "politics",
    "rank": 20,
    "score": 3773,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 364,
    "url": "https://www.vox.com/politics/402530/trump-tariffs-canada-mexico-explanation",
    "id": "1j42ckn",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fochlucan",
            "body": "Has anyone else had a supervisor at work, who didn't seem to understand your job, and when you got in trouble for doing something (that was a part of your job), and you had to explain to them why some step/activity/process was necessary to get your job done, and the supervisor responds with \"I don't like being questioned\"?  He and his people all remind me of that type of supervisor.  Hired and promoted above their skill/knowledge level, but they are able to BS their way up the ladder, while you have to work extra hard to do your job in spite of them, because you care about doing a good job/providing good service.",
            "score": 830,
            "replies": [
                {
                    "author": "duckbrioche",
                    "body": "With Trump it is far far worse. Trump is a complete moron, a very stupid person, and a sociopathic narcissist on top of that. He doesn’t understand and doesn’t care. He seized upon the soundbite “xxxx will pay for the tariffs” long ago. It sounds good to him and he is going to use it. It is just like the wall that Mexico is going to pay for. It is just a fucking soundbite.\n\nAs for its origin….it is likely because he thought NAFTA was due to Obama, even though it started with Reagan.\n\nRemember with Trump the soundbite comes first. Any reasons or details come later and are often lies made to fit the soundbite.",
                    "score": 252,
                    "replies": [
                        {
                            "author": "patentattorney",
                            "body": "The biggest problem isn’t trump. It’s all his supporters that know better (trump is a huge problem). \n\nBut imagine a flat earther was elected president - and forced it upon everyone- and all the news sources played along. That’s what the current gop is. It’s nuts. \n\nEveryone knew this was bad. The gop ran with “he is using it has a negotiating tactic.” But it’s horrible for the US. This is like a negotiating tactic of a partner saying “I can’t live without you. If you leave me, I may harm myself”",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ohnoherewego13",
                                    "body": "Even worse than that crazy partner, Trump says \"I'll hurt you too!\" He doesn't care who he hurts so long as he gets to be Mister Big Man.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "flimflammed",
                                    "body": "Agreed. It is literally the modern equivalent of the fable about the emperor's new clothes.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "KarlUnderguard",
                                    "body": "I am picturing this scenario and watching liberals hold up globes during his speech in protest instead of actually doing something.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "patentattorney",
                                            "body": "The liberals at this point in congress have very little power. Everything is being done by executive orders. What needs to be done (and is being done is the lawsuits, so if this is ok, a dem can do the same thing). \n\nOther than making noise, there is little that can be done.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "zubbs99",
                            "body": "I recall him saying \"tariff is the most beautiful word in the English language.\"  Wtf does that mean.  It's like a child reading through an Econ 101 textbook and picking out a fun word to say.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Viperlite",
                                    "body": "[“Francisco!  That’s fun to say.”](https://youtu.be/n1qjgOmt4gc?si=GOZj2mkq1nhsPxrT)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "jimmygee2",
                                    "body": "He believes that ‘Asylum Seekers’ come from Mental Institutions. He has the vocabulary of a 7 year old.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Redbaron1960",
                                            "body": "Just like his belief that others pay the tariff, illegal immigrants from mental asylums are coming into the US. It doesn’t matter how many times you tell him they are asylum seekers and that we pay for the tariffs he keeps repeating the lies.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "B_Booker",
                                    "body": "It’s short for tariffic!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "thisoneismineallmine",
                            "body": "That's fascism. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GBinAZ",
                            "body": "Jesus, very well put. I always stress the fact that Trump is an absolute moron, full stop. People give him too much credit as a con man, but the guy is dumber than bricks, just surrounded by a bunch of yes-men who know better but go along with the insanity, anyway.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RabidGuineaPig007",
                            "body": "> Trump is a complete moron, a very stupid person\n\nwho convinced 77 million to vote for him. Twice. USA has a moron problem, it's not Trump.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "VRGIMP27",
                                    "body": "Trump is the embodiment of that George Carlin bit where he says \n\n\"look at the dumbest motherfucker in the room, and realize that at least half of the people in the general population are dumber than that.\"\n\nIf your pre-born you're cool, if your preschool you're fucked",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "thisoneismineallmine",
                                    "body": "Agree! ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Shady9XD",
                            "body": "It’s not even that. Someone who worked with him basically said: “he doesn’t know what he’s going to say until he starts speaking and he BELIEVES what he says is true.”",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BiscuitsMay",
                                    "body": "I mean, that’s pretty fucking clear.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RoflCopterLuls",
                    "body": "I left my job last year for this exact reason. My new supervisor didn't even know the tools we were using. It was pathetic. He also looked down on me because I was a shift worker. Whenever I had a question he would stammer and stutter though it only to have me more confused than when I asked him. I loved my job. But a fool making decisions about what I'm doing doesn't jive with how I want to live my life.",
                    "score": 84,
                    "replies": [
                        {
                            "author": "postmfb",
                            "body": "Same rolling out terrible product that made my other two jobs (supporting and maintaining the stack) impossible as management simply didn't understand concepts like testing. I am sure they were great at the HR role they were promoted from but I have never worked at a place that hated money before. ",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "RoflCopterLuls",
                                    "body": "I just wish I was so lucky to fail upward like a lot of these managers. It just feels like this has become a culture in America where they just promote people because they don't know their role. I feel it's because if they did they would push back on their managers which they don't want. Stack your team full of yes men and you magically fix all your problems. Imagine that.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "postmfb",
                                            "body": "After two dream jobs ruined by venture capitalist I'm just trying to find somewhere still doing actual work and not dismantling successful businesses. Wish you luck my friend.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "RoflCopterLuls",
                                                    "body": "Same. Absolutely ruined my well paying dream job. Good luck to you too friend!",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "damik",
                                            "body": "To fail upward you need to have no concept of shame and not care about throwing others under the bus. Being a parasitic tool that brings everything and everyone down around you needs to be built into your DNA.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheOGRedline",
                    "body": "I worked for a narcissist once… \n\nIf she had an idea, it was a good one because she was smart. If you argued you were therefore stupid… nothing could sway her. Not experience, expertise, outside opinions, direct evidence… \n\nFortunately her boss was weak and the narcissist played her like a fiddle until she angered the board and got fired. The newly hired boss had worked with the narcissist before and ran her off.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "hoeassbitchasshoe",
                            "body": "Lol I imagine the new boss came in on their first day saw her ass and said \"hell fucking no now go on and get\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheOGRedline",
                                    "body": "Exactly! I’ve gotten to know him pretty well since. He says he told them not to hire her in the first place!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "i_give_you_gum",
                            "body": "Gotta love that having any kind of difference of opinion with some bosses is considered \"arguing\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Downtown_Ham_2024",
                    "body": "I’m currently working for someone like this.  They are threatening to fire my team for not doing things outside of their job spec, and when I stood up for them that was turned around to be my failure.  What’s now being asked has the lowest skilled employees in my organization doing the highest risk work, and the highest skilled team members doing routine, borderline administrative tasks.   I apparently am at fault for not preemptively arranging things that way and have no doubt it will be my fault if things go wrong under that arrangement and we get rightfully sued for negligence.\n\nI’m looking for a new job obviously.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "oldbastardbob",
                    "body": "Yep, I had about 40 years of exactly that.\n\nWith the tariff thing, there's a bunch of Republican businessmen who think they know economics advising Trump that no taxes on businesses and tariffs are what made some refer to the late 19th century in America as \"the Golden Age.\"\n\nMost of us call it \"the robber baron era.\"\n\nThey then go on to tell him that income taxes, begun in 1912, were the cause of The Great Depressio, not the Republican reductions of income tax rates and tariffs causing trade wars around the glode along with the Roaring 20's \"irrational exuberance\" of throwing barrels of money at a huge market bubble that was going to make everybody rich.\n\nSo these geniuses have him convinced that the trade wars were a great idea and it would of worked if the Depresdion hadn't happened. In other words it was a great idea if reality was different and a different result occurred.\n\nAnd that \"irrational investing\" thing?  Anybody wanna buy some Tulip Bulbs to go with that crypto wallet?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RickyHawthorne",
                            "body": "You've got some good points. Now fucking spellcheck this shit so other people will take you seriously.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mysuperfuntime",
                    "body": "Because Trump inherited a small family business worth hundreds of millions of dollars. He never had to get any job ever based on merit. \n\nHe would be a nobody loser if he wasn't born rich. \n\nIt's actually a strong argument for complete wiping of large generational wealth. \n\nWhy does anyone deserve the high score somebody else achieved through merit?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Gerald_the_sealion",
                    "body": "Do you work with me? Because that’s my director. It’s infuriating when they question my work and I have to literally justify and explain the process to someone making probably double my salary.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "violiav",
                    "body": "My last boss was like that. “Why do I have to sign that?” Because you’re the general manager bitch, that’s why. “Why can’t you do x” because I have to be the one who has to audit this shit, so I or you can’t be in the cash handling process. The type of person that reads through the financials and doesn’t actually understand them. Ugh.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Boomer70770",
                    "body": "\"The Peter Principle, also known as the “Peter Principle of Incompetence”, is a human resource theory that suggests employees are promoted based on past performance, not leadership potential. The theory states that employees will continue to receive promotions until they reach a level where they are incompetent and stop being promoted.\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MyDayFuckingSucks",
                    "body": "Haha yes but i quit. The ones who stayed where the ones too careless to do their jobs from the beginning so now the place is complete disaster. Blinds leading the blinds something something.. Its like watching my old job burn but this is a bigger dumpster fire.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "goldenflash8530",
                    "body": "Yes. I also feel like the sane half of the country is in this position.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BigDuke",
                    "body": "It’s the Peter Principle, and it’s a byproduct of a meritocracy, even well functioning ones. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WineCoffeePizza",
                    "body": "This is a fantastic comparison.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "VZV_CZ",
                    "body": "Yeah but he didn't have nukes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "deadzol",
                    "body": "Shit rises to the top.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "oblivionbaby",
                    "body": "Yep and being asked to explain what you did and justify your work and time",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ArcadiaFey",
                    "body": "This was all essentially nepotism",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MLeek",
            "body": "He knows. He knows he can’t say it. It’s the last one. It’s money. \n\nIt’s a national sales tax. It’s a regressive tax to that he hopes will cover for the massive tax cut he’s given the wealthy, while also allowing the wealthy to buy the dip. \n\nDoes he also want a peace prize? And a legacy of empire building? And to keep Putin happy? Of course, but more than anything he wants money and he wants it out of the pockets of the 99% of Americans who are not his billionaire buddies. There is only so much he can get out of Medicare and Social security.",
            "score": 837,
            "replies": [
                {
                    "author": "BeltOk7189",
                    "body": "I wouldn't actually be surprised if he doesn't know.\n\nThe vast majority of what he's done in the last month was planned and crafted by other people and just put in front of him to sign or spin some talking points on. Neither of which take a deep understanding of it. He's just the face of it all.",
                    "score": 396,
                    "replies": [
                        {
                            "author": "HumanWithComputer",
                            "body": "Exactly. Why I feel the people pulling his strings should be getting a LOT more attention. Find out who they are. All of them. Expose them and attack them in whichever way possible. They like operating in the shadows so shine as bright a light as possible on them.",
                            "score": 122,
                            "replies": [
                                {
                                    "author": "SERVEDwellButNoTips",
                                    "body": "They lurk in the swamp that is spreading fast.",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "author": "Inevitable-March6499",
                                            "body": "False, the USA has already destroyed over 60% of its wetlands and is losing 400,000 acres per year currently and that number is increasing annually due to agriculture, development, and rising sea levels.\n\n\nStop giving swamps a bad name. These are just evil fuck heads who crave power above all else. Americans need to stop spending money domestically, vacation abroad if possible, support small businesses, and just hoard money. 66% of the USA economy is propped up by consumer spending.",
                                            "score": 41,
                                            "replies": []
                                        },
                                        {
                                            "author": "Flopdo",
                                            "body": "Ya, no sht... and Trump doesn't know because he's just following Putin's orders:\n\n[https://theherocall.substack.com/p/putins-trade-war](https://theherocall.substack.com/p/putins-trade-war)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "oninokamin",
                                    "body": "Someone please shine a giant glaring, inescapable spotlight on *Peter Fucking Navarro*.",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "arahzel",
                                    "body": "Seeing a 60 second summary of Trump's address, and watching those turds *feverishly* give those standing ovations. 🤮",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "izzitme101",
                                    "body": "That will most likely be the people behind the heritage foundation.\nThey have been trying to get a foothold in the uk for a while now to",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Swackhammer_",
                            "body": "Yep. There’s a reason he’s gotten more done in one month than his whole last term. If he weren’t being double fisted in the ass and used like a puppet, he would be playing even more golf",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "gizajobicandothat",
                            "body": "Just following orders, where have we heard that before in History? I'm sick of commentators in the press ( UK, and US) saying he has a plan, or 'it's how he negotiates'. No, that's really not it!",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "NoWayRay",
                                    "body": "> I'm sick of commentators in the press ( UK, and US) saying he has a plan\n\nTBF, he does have a plan - (1) screw the maximum possible benefit to himself personally out of the situation and (2) avoid every and any possible consequence from the pursuit of (1). It's been a lifelong standard operating procedure for him.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DannyDOH",
                            "body": "He’s been advocating for blanket tariffs since Carter was president.\n\nThe bigger issue is his complete lack of economic understanding.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "RabidGuineaPig007",
                                    "body": "Economists were the ones who suggested Free trade agreements in the 80s and the US economy thrived on them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Conan4457",
                            "body": "Very true. These are the ideas of Steve Bannon, Steven Miller, Peter Navarro, Elon Musk, and a bunch of other far rightwing nuts that wrote project 2025. Trump is the grifting front man, just like he was when The Apprentice was developed by Mark Burnett.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "julianriv",
                            "body": "I am coming to believe this is the real scenario. His support wants to believe he is smart and he desperately wants us to think he is smart. He inherited a ton of money, he managed to bankrupt 3 casinos, which is not easy to do. I remember reading about him way before he ran for president that he was basically depending on money from The Apprentice to keep everything else afloat. He has obviously gone to great pains to not let anyone talk about his school records. He talks in sound bites, mispronounces words forgets who people are.\n\nIt seems like the image of a genius business man may be more curated image than reality.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Lysafleur",
                                    "body": "I can’t even listen to him talk. He has the vocabulary of a ten year old, and that’s being generous.\n\nI sort of get that he’s this blank canvas for a lot of Americans to project what they want onto him but how on Earth are they able to look past the complete stupidity?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "neutrino71",
                                            "body": "Propaganda is one hell of a drug ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "stepho999",
                                    "body": "Dude he can’t even read.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "raistlin65",
                            "body": ">I wouldn't actually be surprised if he doesn't know.\n\nHe was talking about the tariffs over and over and over again during the election. \n\nSo this issue is not like the Project 2025 orders Trump is signing which were not a major part of his campaign platform. Which undoubtedly, many he might care less about.\n\nMoreover, for decades, Republican leaders main motivation for what they do has been (1) reduced taxes for the wealthy and big corporations and (2) reduced business regulations. \n\nWhen one of those things is the possible reason for an action they take, it's almost always the answer.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "ProtoplanetaryNebula",
                            "body": "See Trump's interview where he says he wants the \"RAW earths\" deal with Ukraine to be signed, anyone who doesn't know the name of \"RARE earths\" literally doesn't know the first thing about them, because the name is literally the first thing to know about them.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "julianriv",
                                    "body": "Which of itself is a joke. What he really wants is to punish Zelinsky and Ukraine for refusing to investigate Hunter Biden back during the 2020 election.  It also happens to play well with his desire to cozy up to Putin.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "phluidity",
                                    "body": "These are the same people who complain the scientists are spending millions of dollars studying transgender mice, when what they are studying is transgenic mice, i.e. those that have a specific gene added or removed and are a critical step in understanding new areas of research in virology and immunology.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DowntimeJEM",
                            "body": "Dude! There are too few that realize that once he’s done all the hate taking for the puppeteers, they’ll just let him die and the cycle continues but with new faces and even less accountability than there was.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Jhtpo",
                            "body": "Too many different plots and plans are in motion for one man to have insight into it all. Too many people fired and replaced by loyalists for Trump to have vetted and picked them all. Too many nuanced avenues of destruction for Trump to have understanding of all the different fields.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "fenne153",
                            "body": "I agree. What I've been wondering though is, whether that makes it any better: A narcicist idiot with the intellectual capacity of a 10 year old but with undeniable reality tv capabilities being manipulated by a bunch of alt-right billionaire cronies with domination fantasies and psychopath tendencies due to an abusive childhood.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "belliJGerent",
                            "body": "I do agree with this, so much so, that I’m not even sure exactly which head of the snake should be cut off first. There’s a chain of command, where you can remove trump, but that’s not going to end the problem.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "p001b0y",
                            "body": "They want to get rid of the IRS and all of the taxes associated with it in order to switch to a national sales tax. They keep throwing around a 25% figure for what that sales tax will be. I think a lot of what is happening now is to move towards that.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "kittenTakeover",
                            "body": "I think MLeek is probably right considering that Trump has been specifically talking about replacing taxes with tariffs for years as part of his campaign. He's hoping that he can convince voters that the money recieved in tariffs is a substitute. Once that money starts coming in, he will point to it to claim it offsets the tax cuts he's giving to the wealthy. I don't know if it will work or not, but it might. Voters have shown themselves to be very ignorant about risks and reality in general.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "therealtaddymason",
                            "body": "This is the most correct. Reagan v2.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Groot746",
                            "body": "Exactly. It's Occam's Razor here: he's not playing five dimensional chess, he's just a moron.\n\n\nI mean, he also seems to think asylum seekers are *literally people who escaped from asylums,* so let's not give him too much credit, yeah?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RabidGuineaPig007",
                            "body": "The most dangerous person in America is Stephen Miller. He's got his hand far up Don's ass.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "3MATX",
                    "body": "Not a single mention to corporate or billionaire tax breaks which are plentiful and generous. ",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "goodybadwife",
                    "body": "With his health, I really wonder how much longer he can keep up with all this.  He has Elon, the Reublicans, Putin, the Dems, the American people, Canada, Mexico, Europe, billionaires, his MAGAs... all these people who want something from him in some manner and are putting pressure on him to do *something*.  What that something is varies by group; but I manage a staff of around 50, and at times it makes me want to scream when seemingly everyone wants or needs something at the same time.  Idk if he can handle much more because he has much higher stakes than ever before.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "gizajobicandothat",
                            "body": "It doesn't really matter. When dementia Don keels over or takes his pants off in the oval office and his health woes can no longer be hidden, Vance will take over. Don stayed out of prison by winning, he's richer and can play golf when he likes, so I don't think he cares what happens next.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "StanDaMan1",
                                    "body": "Here’s the thing though: nobody actually *likes* Vance. He only got where he is because Peter Thiel purchased the position from Trump. Trump, shit head he is, has a few qualities that Vance doesn’t, and it’s chiefly the fact that people are enamored with him. Vance, at best, comes off as a toady.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Icy_Pass2220",
                                            "body": "Once the Constitution is on fire in a trash can, once all the alphabet agencies are brought to heel, once they’re positive the military is onboard… \n\nWhether Vance is likeable or not, won’t matter.  ",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "gizajobicandothat",
                                            "body": "I don't think that will matter soon. Donnie is already threatening protestors and politicians who disagree with him. Is it likely Thiel invested in Vance so he could stay as VP? I doubt that too.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "RuneiStillwater",
                                            "body": "That's the biggest thing here. Trump's cult of personality dies with him, the cult will likely do violence against random targets cause 'their guy's died, but the insanity loses its main driver.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MagnaFumigans",
                                    "body": "We could not know about that for months with the proper flood the zone and AI work. Think about THAT. Remember all the accusations about Biden? Imagine how far Reps will go to hide an incapacitated Trump",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "gizajobicandothat",
                                            "body": "I think they would definitely do that. It would be naive to think people like Thiel, Musk and Vance have not thought about Donnie being towards the end of his life. Life expectancy in the US is around 79 and he's 78 with signs of dementia. They might even be banking on him kicking the bucket.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "MagnaFumigans",
                                                    "body": "I think they’ll hide it as long as possible. They’re well aware of how important a figurehead he is. Expect a long delay on finding out and then them MILKING the ever loving fuck out of it with medical updates and fluff pieces until it’s untenable",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ynotfoster",
                                                    "body": "I'd be happy to Door Dash him lots of Big Macs with large fries.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "chmod777",
                                            "body": "> Imagine how far Reps will go to hide an incapacitated Trump\n\nto be fair, they already are.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MagnaFumigans",
                                                    "body": "Sure, but I’m talking full on he could be dead in the dirt and they’d be using ai and brainwashing Shane Gillis",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fross370",
                            "body": "Have you tried to be a narcissist psychopath who cannot feel shame or empathy? Then it becomes much easier.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "goodybadwife",
                                    "body": "You know... I haven't.  \n\nToday is a new day!  I'll try it out and let you know how it goes 😂",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "iwanderlostandfound",
                            "body": "He doesn’t care and he’s not paying attention. He has a fleet of people taking care of him as if he was a toddler. That’s why he’s not even bothered with people saying Elon is president. He’s checked out he doesn’t even want to be president he just wanted all his problems to go away nothing else matters to him now that he’s won. He’ll sit at his desk when they tell him to and sign executive orders, golf and watch the news.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Gecko23",
                            "body": "If he was managing any of it, it would be a burden. \n\nHe isn’t doing any such thing. He’s golfing, sleeping and they trot him out for short speech or to sign some paperwork and then he’s back to taking it easy.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Notcoded419",
                    "body": "I don't really agree. I think Trump just wants power. He's not one of the ruthless tech bros or industrialists who have spent decades building sprawling empires of expansions and acquisitions. He's never seemed to care that much about money, more about the appearance of having it and the accompanying notoriety. He honestly seemed to enjoy the attention he got when losing it almost as much.\n\n\nIf I had to guess, DT has heard \"hail to the chief\" playing in his head every time he walked into a room since he was a kid. I don't think he wanted or cared to win his first election, just enjoyed the trolling and thought he could make a quick buck off his voters after. But once he got into office and that started happening in real life along with people standing, saluting, applauding, he liked THAT. In his mind, the presidential pomp is how it always should have been and should be for him.\n\n\nHe's not one of the hyper capitalists, he just desperately wants their validation as one of them without doing the work, which is why Elon running the country doesn't bother him at all. He's always made his money via marketing: NY tabloid developer, reality TV star, top twitter troll shilling branded products, candidate.\n\n\nI think the people running the show are the same and it's not about the money for them anymore either. It's about power and domination. They don't like what they've seen from a large, educated middle class in Europe that demands thing. The shift in the power dynamic after covid infuriated them. It's not about them getting more, it's about us getting less. Thats why markets are spooked outside the federal sector. It's a war on workers, OSHA, benefits and the safety net, the 40-hour work week, child labor restrictions, etc. The rhetoric is all about lazy work from home leeches. Now even having a job doesn't shield you from being a taker, it has to be the \"right\" kind of job, ie. A blue collar dirty job. Nobody else deserves what they're making.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WriggleNightbug",
                            "body": "I think its like he doesn't want to hear \"No\".  He doesn't even care about hearing \"yes\" as much as not being stopped.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "raistlin65",
                    "body": ">He knows. He knows he can’t say it. It’s the last one. It’s money. \n\nYes. I think you're right. \n\nAnd all of the other reasons are meant to distract the press, his political opponents, and voters from that reason.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "stomp-a-fash",
                    "body": "He doesn't know shit about that. \n\nAll he knows is he didn't want to die on house arrest, pissing into a cup for a probation officer every couple months. \n\nHe accomplished that, now he golfs and has young soulless Ivanka look alikes fluff him, and rage watches cable news while the monsters who stole the election for him loot the country. \n\nThat's what he knows.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "anacondra",
                    "body": "Plus I think he's legacy building. He wants to go down in history as a President that added territory. Maybe Greenland, maybe Canada, maybe someone else. Who cares as long as he's getting his head carved into a mountain.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "kredditwheredue",
                            "body": "Don't forget winning a Nobel Peace prize!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BlackEric",
                    "body": "He has told us why. He wants Canada as the 51st state. This isn’t a joke. He doesn’t have a sense of humor. He is working on his casus belli. Eventually something that Canada does will be his excuse for physical action. He has less than two years to get this done so it’s going to happen quickly. He also knows that if he’s at war he’ll have the pretext to cancel elections. He gave this away when he called Zelensky a dictator. He’s not smart. Someone explained this all to him as a way for him to make it happen.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Ms_KnowItSome",
                            "body": "While the US would undoubtedly win a quick \"hot\" war with Canada and defeat their military, it is a massive landmass with tens of millions of Canadians who do not want to be part of the US. This is assuming you could even get US military personnel to fight a war like that, I have serious doubts you'd get air force officers to drop bombs on Canadian targets.\n\nCanadians, as long as they watch their accent, are indistinguishable from Americans. The amount of terrorism they can lay against US targets is immeasurable. They've already lit the White House on fire once and I don't doubt they'd do it again.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OwnedLiberal",
                    "body": "The grifter is hoping for bribes in some form or another, legal or otherwise, to remove tariffs. That seems to be the main goal for him personally.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Probable_Bison",
                    "body": ">It’s a national sales tax. It’s a regressive tax to that he hopes will cover for the massive tax cut he’s given the wealthy, while also allowing the wealthy to buy the dip.\n\nI doubt he gives a single damn about the money he costs the US with his tax cuts for the wealthy.\n\nI also doubt that he's smart enough to make a plan like that.\n\nHe just wants to \"own\" other countries like he \"owns the libs.\" He wants to threaten them and for them to at least seem to capitulate to him.\n\nAfter engaging in a trade war with china and sucking up to Xi in his first term, all he got was the start of a trade deal that China then didn't fulfill.\n\nFive seconds of thinking tells one that he's angry about the trade deals that he negotiated the last time he was President, which seems like a self own until one realizes that all that matters is that anger is directed outside of the MAGA tent instead of inside.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "alabasterskim",
                    "body": "Nahhh, it's to destabilize the US economy. When you're a foreign asset, that's a simple answer.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Equivalent-Excuse-80",
                    "body": "He may honestly not truly understand the things that are asked of him from his masters. He doesn’t understand the fundamentals of. . . anything. All he knows is how to run a three ring circus and it’s something at which he has always excelled.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "The_Humble_Frank",
                    "body": "The strategic advantage of the stupid, is precisely because they are irrational. They will spontaneously not only act against their self interest, they will act against every ones' self interest.\n\nTheir actions cannot reliably be predicted by rational opponents, and frequently leave them in shock at the choices made because they themselves can find no reasonable course of thought that led to such a stupid choice. The rational opponents' mistake is using reason itself to predict what to prepare for next, because the stupid do not always reason in their adjudication.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Successful-Sand686",
                    "body": "Putin wins",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "dmillerksu",
                    "body": "The only way he thinks he can get people to the table and favorable business terms is to be hostile.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "zeromussc",
                    "body": "He could implement a much smaller federal sales tax without the inflationary impact that tariffs bring and without damaging, if not out right destroying, long standing international relationships with America's closest allies.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "pgc22bc",
                            "body": "He could never get that done. GOP forever mantra is NO NEW TAXES. He would have to get Congress and Senate to write and ratify new taxation laws. MAGA Republicans only know how to deny, obstruct, object, depose and get all their ideas from FOX NEWS. \n\nThe Billionaire Oligarchs bought the country for Trump. Trump gets to pretend that a Tariff is not a form of taxation and keeps insisting the other country pays. It's total bullshit just like everything he says...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BigPickleKAM",
                    "body": "Money yes but money for him and his family.\n\nWant to bet the concessions and exemptions to the tariffs all depend on which industries contribute the most money to his charity or however he is laundering all the money he is grifting from the world right now?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ynotfoster",
                    "body": "I think he is letting Putin drive this.  trump and his enablers are not this stupid, they are purposely destroying the US the way the same way USSR fell.  They will privatize most of government and create more oligarchs in the process. The rest will be peasants.\n\nThis is Putin's revenge.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "costabius",
                    "body": "It's simpler than that.  He did it because someone told him too.  \n\nSome idiot over a game of golf told him the entire government could be funded on tariffs and he made it a core belief. He is not a smart man.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DoubleRah",
                    "body": "And since the money isn’t taxes, he doesn’t need to get approval from Congress to use the money how he wants.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tiny-Albatross518",
                    "body": "That wasn’t that hard. Why can’t the press get here?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Suspect4pe",
                    "body": "It's all written out in the Project 2025 playbook. It's been the conservative dream forever now. A flat tax, which benefits the wealthy, as you say.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "wonderwoman-1947",
                    "body": "What is he going to do with money if he lives for another 3-4 years?\nHe's 78+ and that's a lot lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "coconutpiecrust",
                    "body": "Also it makes good television. And Trump knows good television.\n\n/s",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "big_thundersquatch",
                    "body": "That, or he’s being told what to do by Putin and the oligarchy while enacting it all without actually knowing or understanding why.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DonkeyPunchCletus",
                    "body": "I think he wants some kind of legacy so he is swinging around wildly trying to do SOMETHING.\n\nLike trying to annex Greenland or Canada. I think Ukraine is also part of that. He wants credit for ENDING the war. It doesn't matter how. Supplying arms to Ukraine and having them fight isn't going to get it done in time. He needs it NOW. So he chose to let Russia crush Ukraine quickly, then sign an agreement with Russia and a beaten Ukraine. Bada ding bada boom war over. Didn't he do the same thing with Afghanistan?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "vahntitrio",
                    "body": "Does he know though? I think he honestly believes tarriffs are just other countries handing us money.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Challenfer1960",
                    "body": "I anticipate that he will now “entertain “ industries approaching him and requesting exemptions.  If approached correctly, could be lucrative for certain parties.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Icy-Indication-3194",
                    "body": "I think it’s more simple than that. I think Putin tricked him.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HerezahTip",
                    "body": "“Putin recommended a lot of great things”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kupomu27",
                    "body": "Elon Musk is telling him to do that. President Musk can stop this anytime.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Imaginary-Clue1162",
                    "body": "Do you mean he wants money for himself and oligarh gang or he wants to transform USA in the richest country in the world? Just asking to clarify, I am not defending anyone",
                    "score": -3,
                    "replies": [
                        {
                            "author": "raistlin65",
                            "body": "Why would you think it might be the second? \n\nHe has never shown that he cares about this country. Trump only cares about enriching himself.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Dave3048",
                            "body": "Big delusion to think USA going to be richest all by themselves. And why would the general public like this as they will definitely not be sharing in the wealth?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "gizajobicandothat",
                                    "body": "Indeed, the Trump/ Musk/ billionaire approach is like a US version of Brexit on steroids.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Prior_Coyote_4376",
            "body": "> All this raises the question: Why has the US president chosen to upend trade relations on the North American continent?\n\nBecause he’s siding with Putin, because Republicans have decided they like Putin better",
            "score": 126,
            "replies": [
                {
                    "author": "wildweaver32",
                    "body": "This is it. Lots of people keep wondering, \"Why would Trump do this?\" when it comes to any of the things he is doing. \n\nBut all of them suddenly make so much sense and are obvious when you ask, \"What would Putin want to happen?\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "finalattack123",
                            "body": "He is doing it because he promised to do it during the election.\n\nThe question is why did people vote for it to happen?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jonathanrdt",
                    "body": "Trump went bankrupt. Russia bailed him out. He does what Putin wants.\n\nIt's surprisingly simple and seemingly obvious.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "masklinn",
                            "body": "It’s the bit that shocks me most really: having attained the most powerful office in the world, trump can’t even abuse it right, he’s selling out the first economy in the world to the 11th, a formerly developed country entirely reliant on natural resources and crimes. Instead of getting Putin killed, he licks his boots.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DeanOnFire",
                            "body": "To be honest, if that was the case (and it probably is), it's not like anything would happen if he called Putin's bluff from the office of the President of the United States. His public standing won't be affected, his supporters would still love him, hell he probably has raised enough money to pay Putin back if it was a personal matter. But he could at any point say he won't comply with Russia's agenda and tell Putin to pound sand.\n\n\nHe'd still be carrying out the same economic policy here: Tax breaks for the wealthy, make the lower classes pay for it, fumble international relations while doing it. Maybe he'd be more indifferent to Ukraine but seeing as how DOGE has been running amok and international aid is being regarded as a waste of money, I'd wager that thread was going to be cut without Russian interference anyway.\n\n\nHe's a moron and a puppet of a larger plan.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "finalattack123",
                    "body": "Why did Americans CHOOSE to elect a president who promised to upend trade relations?\n\nEvery economic paper and journal warned of the consequences.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Group-4504",
            "body": "I mean... Isn't he the one who put the trade deals with Mexico and Canada into effect during his last term?",
            "score": 43,
            "replies": []
        },
        {
            "author": "greenway-blackington",
            "body": "Because Russia asked him to destabilize all friendly relationships. When you look at him like a Russian asset, it all makes sense.",
            "score": 43,
            "replies": []
        },
        {
            "author": "Final_Toe1779",
            "body": "The answer is depressingly simple. He is a malignant narcissist who is also an idiot. He grabbed on to the idea years ago that tariffs were a genius idea, and every time anyone since then has told him that blanket tariffs will not work he has become more and more set in his thinking. Because people said blanket tariffs are stupid, he takes that as a personal insult to say that *he* is stupid. He desperately wants to prove to everyone that his genius idea will work. It won't, and everyone else will pay for his folly. \n\nHe isn't supposed to have the power to impose tariffs under the USMCA without congressional approval, unless there is a national security emergency, so fentanyl and illegal immigration are his \"legal\" excuses for being able to issue the tariffs as an executive order.\n\nThe 51st state thing supposedly was just a joke at first, but when he heard Canadians would never agree to that, it became serious. He's a rapist. Someone telling him no is not acceptable to him. \n\nHe's not playing 4D chess. He's not a brilliant businessman. He is a very stupid, insecure, cruel man. And millions of people voted for that.",
            "score": 28,
            "replies": [
                {
                    "author": "_jetrun",
                    "body": ">He is a malignant narcissist who is also an idiot ... He's not playing 4D chess. He's not a brilliant businessman. He is a very stupid, insecure, cruel man. And millions of people voted for that.\n\n\nI think that's pretty much it. Nothing more, nothing less. And unfortunately he became the President of the most powerful and prosperous state and \"A clown with a flamethrower, still has... a flamethrower\".",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Niibler",
            "body": "Old man with memory issues, just normal.\n\nBut he seemed to know that US farmers would have fun with tariffs.",
            "score": 19,
            "replies": []
        },
        {
            "author": "E1M1_DOOM",
            "body": "Does congress understand why they're letting him do whatever he wants? \n\nIn the words of Old Ben Kenobi. \n\n\"Who is more foolish. The fool or the fool who follows him?\"\n\nBTW, this quote applies to republican voters as well. While trump carries a lot of blame, so do the people that put him there after he already tried to destroy democracy.",
            "score": 23,
            "replies": []
        },
        {
            "author": "CheetahReasonable275",
            "body": "To shift taxes to the poor.",
            "score": 15,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": "Yep. This is it. \n\nFor decades, Republican leaders main motivation for what they do has been (1) reduced taxes for the wealthy and big corporations and (2) reduced business regulations. \n\nWhen one of those things is the possible reason for an action they take, it's always the answer.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "itsekalavya",
            "body": "There is a kind of a way Trump talks that makes people think he probably knows what he is talking about.\n\nIt’s talking in extremes. But look for details and there will be none.\n\nMassive, massive frauds. \nWhat kind of frauds and who did it for what reason? No details.\n\n\nHorrible, Horrible CHIPS act. \nWhy is it horrible and what’s the reasoning for it ?\nNo details.\n\nBest economy ever.\nHow will it be possible ?\nNo details.\n\nMost beautiful word in the dictionary is Tariffs.\nHow and why ? What are some instances that it worked ?\nNo details. \n\n\nTalking in extremes will easily make one think that he probably came to that opinion after a lot of insight but anyone can bullshit their way like this. All his minions will start claiming that he is doing some 8-dimensional chess which is not very easy to get it immediately. \n\nThe weave.\n\nThe most stupidest idiotic nonsense that anyone with an IQ of a jellyfish can figure out. But the fucking morons will still believe him and bend reality to justify their stand.\n\nRussia has done a fantastic job of making American people distrust their own media, their fellow countrymen, their own family members. \n\n\n\nEveryone wins in this - Trump, Republicans, Billionaires - super rich folks, Russia. \nExcept the working class Americans who live paycheck to paycheck. \nWe are all royally screwed and there is no looking back.",
            "score": 1,
            "replies": [
                {
                    "author": "cookycoo",
                    "body": "Its the BBQ theory all over again. The person talking with the strongest opinion’s at a BBQ making everything seem simple or  black or white, knows the least on the topic. Stupid people quickly learn to act smart by having strong opinions. Smart people are quieter with less obvious opinions, knowing that everything is complicated and multifaceted with nuances and multi-orders of consequences.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cute-Ad2879",
            "body": "Like a kid just pushing buttons. \n\n\nKeep the big red one away from him please.",
            "score": 8,
            "replies": [
                {
                    "author": "Vapur9",
                    "body": "The button doesn't work, he fired the maintenance guy.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "LaMarr-Bruister",
            "body": "He knows why….so America will be “forced” to trade with Russia",
            "score": 8,
            "replies": []
        },
        {
            "author": "phosdick",
            "body": "From the articles list of reasons:\n\n1. Trump’s tariffs on Canada and Mexico are meant to secure America’s borders\n\nThis is nonsense, of course - trump's only motivation for anything is to assert dominance - to compenaste for his knowledge that he is a weak, small minded, failed loser.",
            "score": 7,
            "replies": []
        },
        {
            "author": "55redditor55",
            "body": "I’m convinced Musk and him have very strict and specific orders from the Kremlin. ",
            "score": 8,
            "replies": []
        },
        {
            "author": "MagicianHeavy001",
            "body": "Putin probably didnt tell him why.",
            "score": 7,
            "replies": []
        },
        {
            "author": "bonsai1776",
            "body": "He's using the trade war to push Canada into doing something he can retaliate against with force. He wants to invade. Because he's a moron.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ViciousKnids",
            "body": "Because his Vladdy Daddy told him so.",
            "score": 6,
            "replies": []
        },
        {
            "author": "zehn78",
            "body": "He expected the other countries to just roll over and take it. Thats what his victims usually do.",
            "score": 5,
            "replies": []
        },
        {
            "author": "jertheman43",
            "body": "Putin told him it's the best way to punish the world for defying him.",
            "score": 6,
            "replies": []
        },
        {
            "author": "metal0060",
            "body": "The moron started a trade war with 2 countries he signed a NEW TRADE AGREEMENT WITH. Dudes a simpleton, plain and simple.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Prodigalsunspot",
            "body": "Putin wants the US separated from our closest economic allies. Full Stop. Kremlin apparatchik in the Whitehouse. Temu Manchurian Candidate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TintedApostle",
            "body": "He did and the he knows why.  It doesn't make sense, but he knows why he did it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "corectlyspelled",
            "body": "that he has been enriched by russian dealings says all. he is trying the same behaviour they treated him with on zelensky. he has grovelled to the kremlin. and knows that they have access to him of a very personal radioactive tea type nature which is why he is ok acting in this manner.",
            "score": 5,
            "replies": []
        },
        {
            "author": "thelonelyvirgo",
            "body": "Trump has drop foot and can barely talk coherently. Trump had a stroke during his last term (the “mysterious emergency” that was pushed under the rug). He looks terrible. He often looks confused about where he is or what he’s doing. His handlers push papers in front of him to sign. Someone agitates him and he spews off a firestorm of incoherent nonsense.\n\nHis followers then eat this up because that’s the Trump they love! Sure, he doesn’t make sense most of the time, and he’s even more crude now, somehow. (That’s not his fault, it’s probably dementia finally taking over.) His handlers smile knowingly; they know they can’t do this without him. He’s a puppet and nothing more.\n\nWhen he dies, his fanfare will die with him. The dust of his presidency will settle. Americans will finally start to pick up the pieces. JD Vance is not well liked, even by his own party. \n\nYou’re seeing a fragile old man fight his way through cognitive decline, heart disease, and rampant narcissism (the latter of which has existed for decades). \n\nAmerica will heal, I have faith in her.",
            "score": 4,
            "replies": []
        },
        {
            "author": "wranglero2",
            "body": "It’s about tax breaks for billionaires! Why don’t they want to pay their fair share of taxes? And his greed they pay him millions of dollars to have dinner with him at maralogo! This is crazy why don’t they put their money where it would do some good.  Like looking into lowering health care costs.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ProofNo9183",
            "body": "It’s to destabilize the US, make our allies leery of us and diminish US standing in the world. He’s an idiot that is being used by russia.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DadBreath12",
            "body": "Dementia. My dad when he started going down hill would always forget why he did things or where he parked.",
            "score": 3,
            "replies": []
        },
        {
            "author": "WardenEdgewise",
            "body": "He’s running the US like it’s a Trump Casino.",
            "score": 4,
            "replies": [
                {
                    "author": "SquirrelMost7063",
                    "body": "If you mean letting the Russians have at it,  then you're dead on.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SavageDegenerate",
            "body": "He tipped his buddies off so they could all short bet on the markets! It's all so obvious and he'll go down as the most corrupt politician in American history if people can WAKE UP to it",
            "score": 4,
            "replies": [
                {
                    "author": "Fidget11",
                    "body": "Yeah if they haven’t woken up by now it won’t happen any time soon. It’s going to take it getting a whole lot worse before people actually do what’s necessary to remove this shitstain from office",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WorkdayDistraction",
            "body": "Under the guise of fentanyl, what doesn’t make sense to me is that the only people dying of fentanyl are opioid addicts. This would be the first time the Republican Party has demonstrably given a shit about drug addicts. \n\nI assure you no innocent bystander is walking down the sidewalk in suburban America getting stuck by a crazy person with a syringe full of fentanyl.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Virindi",
            "body": ">Trump doesn’t seem to know why he launched a giant trade war\n\nJust ask Putin for the details. These tariffs destroy the social & economic relationship we've built with our neighbors and further isolates America, which is great for Russia.",
            "score": 7,
            "replies": [
                {
                    "author": "Dead_Cash_Burn",
                    "body": "If true this could backfire for Putin. Germany is now ramping up military production. We are talking about the country that started 2 world wars. With global warming and advancing technologies, Russia can no longer hide behind its winters. Putin could learn soon to be careful about what you wish for.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RCG73",
            "body": "Putin said so.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LordMashie",
            "body": "He wants more taxes but without having to call them taxes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Aware-Chipmunk4344",
            "body": "His role model is Mckinley, whose age totally different now, so Trump's blindly imitating of him bound to fail miserably and drag down America's economy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fuckgod421",
            "body": "He a fat kid with a dirty diaper and fetal alcohol syndrome on the playground. Thats how they act",
            "score": 3,
            "replies": []
        },
        {
            "author": "reiddavies",
            "body": "This is an excellent article! Thanks for sharing it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gabemiami",
            "body": "He’s just getting back at the country that prosecuted and made fun of him. Of course, he knows what he’s doing. He’s snatching defeat out of the arms of victory, intentionally.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Captain_Quinn",
            "body": "To help Russia",
            "score": 1,
            "replies": []
        },
        {
            "author": "sillywienie",
            "body": "He and Putin have a plan. With trumps help Putin will take over western and eastern Europe. With putin's help trump will take over North America and China will take over Asia. The world is fucked.",
            "score": 4,
            "replies": []
        },
        {
            "author": "spirit-mush",
            "body": "He knows why.",
            "score": 2,
            "replies": []
        },
        {
            "author": "YJSubs",
            "body": "How I wish his supporters reading this article.  \nBut then again , they probably only read the bullet point, without bother to read why it doesn't make sense.",
            "score": 2,
            "replies": []
        },
        {
            "author": "smaugofbeads",
            "body": "Fucking genius [s]",
            "score": 2,
            "replies": []
        },
        {
            "author": "CurrentlyLucid",
            "body": "For attention, he is very needy, has to be the star.",
            "score": 2,
            "replies": []
        },
        {
            "author": "cjwidd",
            "body": "I don't think anyone can articulate how any of Trump's foreign policy moves benefit anyone besides Putin explicitly.",
            "score": 2,
            "replies": []
        },
        {
            "author": "xerthighus",
            "body": "Because Russia told him to.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CompleteBuilding1156",
            "body": "I think there's a reasonable chance that he is attempting to manipulate the stock market. Announce tariffs, stonks go down, friends/family buy dip, then say tariff war is off. Easy money.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Automatic-Guide-4307",
            "body": "He wants a collapse in the uZa like the soviet union in the 90's so the rich can buy everything for pennies on the dollar and really OWN YOU!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Catspaw129",
            "body": "I've got a (probably) stupid question.  Here we go!\n\nLet's say I -- a USA person -- order a Twinkie over the internet.  Let's say the Twinkie was made in Canada.  So I've got to pay a tariff, right?\n\nLet's say Canada has also imposed tariffs for merchandise coming from the USA.\n\nNow, let's say I am displeased with the Twinkie and return it.  Does the Canadian supplier of the Twinkie have to pay a tariff when the Twinkie returns to its country of origin?",
            "score": 2,
            "replies": [
                {
                    "author": "WhatRUHourly",
                    "body": "Would depend on the Canadian laws/regulations on duty/tariffs but more likely than not I would imagine that they would consider that the Twinkie was manufactured in Canada and since it is a return that it would not have a tariff/duty on that item.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hectorpukki",
            "body": "Yes he does. He does whatever he can to help Putin. Cuck-Trump.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NeanaOption",
            "body": "His brain is rotted by toxic narcissism and dementia. At this point the neo Nazis in control are guilty of elder abuse.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChaskaChanhassen",
            "body": "Trump himself is completely addled. He does whatever Pootie tells him to do. Russians want revenge for being disrespected for so many years.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Crestina",
            "body": "Putin gave him the notes. Dumb orange mouthpiece just passes it on.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HBRWHammer5",
            "body": "The deep state is the heritage foundation and the federalist society",
            "score": 1,
            "replies": []
        },
        {
            "author": "huuaaang",
            "body": "Was it not clear that he wants to soften up Canada for invasion and annexation? The whole \"51st state\" stuff? Nothing mysterious about this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheUrPigeon",
            "body": "Because his Russian handler informed him that it was time to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Just_Campaign_9833",
            "body": "He knows why, it was on the script Putin gave him...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spirited_Cod260",
            "body": "The Alberta labour leader's statement rings true:  *\"... what he really wants is to either dominate Canada or take it outright.\"*\n\nTrump and supporters desire to bully the entire world into submission.  They must be resisted at every turn.",
            "score": 1,
            "replies": [
                {
                    "author": "_jetrun",
                    "body": "I think he just hates Trudeau. He's on a bit of a revenge tour.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Only_Ad8049",
            "body": "He wants to crash the economy so he and his rich buddies can buy up more low price stocks and properties. \n\nHe'll probably try to give big corporations some government bailout checks while adding new taxes for the American people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brotorious420",
            "body": "Easy. Because Putin told him to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ritwikjs",
            "body": "i've got a bridge to sell to anyone thinking this puts even a dent into fentanyl in the united states. there's ALREADY a critical mass of it in the country, and newsflash, a majority of it has been brought in my AMERICAN CITIZENS",
            "score": 1,
            "replies": []
        },
        {
            "author": "eugene20",
            "body": "This was written up in 2018, [The Authoritarian Regime Survival Guide](https://verfassungsblog.de/the-authoritarian-regime-survival-guide/) there is a high chance it is correct and the game is isolationism.\n\nThere is also the possibility their intent is utterly decimating the American economy so the rich can short it and make money as it goes down, and then buy again to profit from it's recovery. This is what some were doing in the UK over Brexit (The MP Jacob Reese-Mogg worked hard for Leave, and made millions from the chaos caused on the stock market).",
            "score": 1,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": ">There is also the possibility their intent is utterly decimating the American economy so the rich can short it and make money as it goes down, and then buy again to profit from it's recovery. This is what some were doing in the UK over Brexit (The MP Jacob Reese-Mogg worked hard for Leave, and made millions from the chaos caused on the stock market).\n\nYes. A lot of the rich get richer off a a recession. \n\nBut a majority probably don't want to decimate it and create something like the Great Depression. Some did get richer during the Great Depression. Other of the wealthy got poorer. Too much unpredictability as to how to end up on top from an economic apocalypse. \n\nThat being said, Musk and some of the other fascists probably also want a global recession for another reason. Because that will create more opportunity for the rise of the far right in other democratic nations.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "xXBassHero99Xx",
            "body": "It's probably just because he thinks \"tariff\" is a beautiful word",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brief-Pair6391",
            "body": "He was told to. My bet is it was part of a script he's been following",
            "score": 1,
            "replies": []
        },
        {
            "author": "BanjoSpaceMan",
            "body": "Just wanna add this here to really nail home how stupid he is\n\n“Justin Trudeau, of Canada, called me to ask what could be done about Tariffs. I told him that many people have died from Fentanyl that came through the Borders of Canada and Mexico, and nothing has convinced me that it has stopped. He said that it’s gotten better, but I said, “That’s not good enough.” The call ended in a “somewhat” friendly manner! He was unable to tell me when the Canadian Election is taking place, which made me curious, like, what’s going on here? I then realized he is trying to use this issue to stay in power. Good luck Justin!”\n\nDude has 0 idea how the country that boarders him does elections. That is all",
            "score": 1,
            "replies": []
        },
        {
            "author": "O8ee",
            "body": "Well in fairness he also shits himself regularly-we’ve all seen the diaper-and he’s been a grade A moron and grifter since the 80s…so maybe temper our expectations about what he knows/doesn’t know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rare-Peak2697",
            "body": "this is what happens when a narcissist can't admit they're wrong. long-winded speeches and doubling down is standard behavior",
            "score": 1,
            "replies": []
        },
        {
            "author": "edatx",
            "body": "Everyone assumes this is for the money.  It’s not. \n\nPutin owns Trump.  Putin wants nothing more than to destroy the United States.  Killing our reputation, destroying our friendships and alliances, and turning us against each other are the top priorities— not money. \n\nTrump is doing a great job for his real boss.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Davesnothere300",
            "body": "It's to destabilize the nation and our currency to benefit russia",
            "score": 1,
            "replies": [
                {
                    "author": "AdmirableCountry9933",
                    "body": "I believe this is a push for crypto currency. But I know nothing about it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lunar_adjacent",
            "body": "Being as that California’s 2 biggest trading partners are Canada and Mexico, and with the stuff he pulled with the fires and flooding farms, I am beginning to think this is personal against California being the 5th largest economy in the world.",
            "score": 1,
            "replies": []
        },
        {
            "author": "raftsa",
            "body": "> Simply put, Trump has decided to make the peoples of the United States, Canada, and Mexico poorer for no good reason.\n\nIt’s true\n\nBut it’s also not really narrowing down on the truth:\n\nHe can because he wants to and no one around him will prevent it.\n\nHe wants to be a dictator or King….to say stuff and for it to happen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chockedup",
            "body": "I'll go with #5.  Trump has a cabinet of billionaires, and the wealthy have told the citizenry they don't want to pay taxes, their political arguments and actions are always for lower taxes for the wealthy, and no matter how low tax rates go, they still want them lower.  Their argument seems to be that rich people should pay no taxes, as that is the natural endpoint of their advocacy.\n\nMost people spend all their money every month on basic survival needs, so by moving to tariffs, in which taxes are factored into the costs of goods, the tax burden is shifted away from income or wealth to consumption, and thus average citizens will bear more of the total tax load.",
            "score": 1,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": "Exactly \n\nFor decades, Republican leaders main motivation for what they do has been (1) reduced taxes for the wealthy and big corporations and (2) reduced business regulations. \n\nWhen one of those things is the possible reason for an action they take, it's the correct answer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Georgi2024",
            "body": "Trump has an extremely basic understanding of geopolitics and the economy. So many stories of him needing basic concepts to be explained multiple times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AndTheWitch",
            "body": "Because Putin told him to",
            "score": 1,
            "replies": []
        },
        {
            "author": "moreflywheels",
            "body": "He also doesn’t know his ass from a hole in the ground",
            "score": 1,
            "replies": []
        },
        {
            "author": "BioticVessel",
            "body": "Me. Me. Me.  I know why. I know why.  It's because he's a fucking toddler and constantly needs attention.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jaylotw",
            "body": "I mean, a month ago tariffs were just a threat to get Canada and Mexico to do border security stuff, according to MAGA, and Trump wasn't going to actually implement them.\n\nNow?\n\nWell, now they've all got to contradict themselves, which has never been a problem for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "en_gm_t_c",
            "body": "Oh I've had the displeasure of speaking with several people that only consume Sean Hannity and Fox News all day, so let me explain what they say:\n\n\"The government used to not levy taxes and was instead funded completely with tariffs\"\n\nWhen they say Make America Great Again, they're referring to the pre-Civil War government being almost non-existent.",
            "score": 1,
            "replies": [
                {
                    "author": "_jetrun",
                    "body": ">The government used to not levy taxes and was instead funded completely with tariffs\n\nAnd that's true ... And if you get rid of Social Security, Medicare and all the other entitlements and cut the defense budget by 90%, you'll be able to fund everything with tariffs again.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "en_gm_t_c",
                            "body": "Bingo.  That's what they want, to roll back the New Deal and bring the size of the state back to early 19th century\n\nNevermind that the country was tiny then and the world wasn't globalized as today.  None of this is thought out, and they didn't run on it.  But they are doing exactly that nonetheless",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Balbuto",
            "body": "Because Putin told him to do, it’s to take revenge on every country that supported Ukraine",
            "score": 1,
            "replies": []
        },
        {
            "author": "Harbinger2001",
            "body": "He genuinely thinks tariffs are a great source of revenue with no downsides. He also knows Canada and Mexico are very dependent on the US for trade so he thinks they can be intimidated to accept the tariffs. \n\nI think Canada has very effectively shown that the US is critically dependent on Canada. The “pause” on autos is just the first backtrack by the administration. More to follow. \n\nThere’s a funny report today that Lutnick called Premier Ford of Ontario to try to bully him into backing down on his threat to levy an 25% export tax on Ontario electricity. Ford told him not only will he not back down but he’ll increase it if they retaliate. In a press release he said he’d turn off the power completely if the US imposes new tariffs April 2nd. ",
            "score": 1,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": "Yep. He said during the campaign how much he likes the tariffs of the 1890s. \n\nWe know that's because the robber barons didn't pay income tax. Because the federal government was funded by tariffs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lefty_22",
            "body": "So Trump is either senile or regarded. Choose one. There is no other choice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "steveparker88",
            "body": "Trump doesn’t seem to know [*put a word or phrase here*]",
            "score": 1,
            "replies": []
        },
        {
            "author": "777MAD777",
            "body": "He's getting rich from it. Trump is nothing more than a sleazy con-man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "---Spartacus---",
            "body": "Something, something, fentanyl.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blue_wat",
            "body": "Ummm he absolutely dies, he's following orders from his boss.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1-800-WhoDey",
            "body": "The dog that caught the car.",
            "score": 1,
            "replies": []
        },
        {
            "author": "giacco",
            "body": "Well obviously Putin just ordered him to do it without going into detail as to why.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JungliWhere",
            "body": "Once Trump has destroyed all the government systems in the US and alienated all of its allies, China will have a pretty clear run at the US ... And Russia isnt going to return the favour that Trump seems to be doing for it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Spot-9917",
            "body": " He surely know how to bankrupt thing",
            "score": 1,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": "Yep. Trump's idea of running the federal government is that it's a pump and dump scheme.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "R_Lennox",
            "body": "Because his minders told him to, that is why.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gigap0st",
            "body": "Advanced dementia.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dog1234cat",
            "body": "If your grandpa took the car and started driving and when you called him he said he has no clue where he’s driving to you’d take away the keys.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dmp2you",
            "body": "He knows, he doesn't care ..",
            "score": 1,
            "replies": []
        },
        {
            "author": "d7zero",
            "body": "Oh he knows. The answer is sitting in the Kreml*n",
            "score": 1,
            "replies": []
        },
        {
            "author": "nydjason",
            "body": "Cruel for the sake of being cruel.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spicymoo",
            "body": "He launched it because Navarro told him to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rjross0623",
            "body": "Because Vladimir told him to. He’s too dumb to realize he’s a Russian asset.",
            "score": 1,
            "replies": []
        },
        {
            "author": "simplym666",
            "body": "Prom pulls the chain and Trump barks",
            "score": 1,
            "replies": []
        },
        {
            "author": "kdeff",
            "body": "Because Putin wanted him to",
            "score": 1,
            "replies": []
        },
        {
            "author": "DonPitotes",
            "body": "He does stupid shit like this because he loves the attention that the power gives him to do so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Afraid_Print1196",
            "body": "Really good explanation of the all the angles he could be coming from and why none of them make any sense.  And why idiots should not be allowed to run for office in a democracy as there are too many idiots who will vote for idiots and then were all screwed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "extremekc",
            "body": "For any question, ask yourself **\"What Would Putin Do?\".** \n\nIt works everytime.\n\nPutin wants the US to break ties with all of its allies and trade partners.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LycheePrevious7777",
            "body": "If a villain reveal his hand too early,goodguys would use it to their advantage.Trump gotta play the slow game until America is poorer,sicker,and defunded before announcing a dictatorship.I wonder how Democrats holding up with the lecturing,and finger pointing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Traditional_Key_763",
            "body": "he did it because he was going to do it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoneDocHammerTime",
            "body": "Tariffs screw up complex economies by forcing now suddenly uncompetitive industries to make production domestic. They either close or adapt, shifting the costs to the people. But now the remaining larger producers buy up all the smaller ones, monopolizing. Centralizing power and influence in a smaller group of people. Privatizing the country’s resources. The US will probably start a war over other resources soon, and not be as impacted by sanctions or trade deficits as a result of today’s trade war. All while Americans sit by, either too stupid to do anything but support it, or too good to get in the dirt and play the game like those traitors do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Global-Tourist1089",
            "body": "I don't know why either. He can't expain why. It's like running a business and just deciding one day to multiply all your prices by 10 and wondering why your sales went down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thederlinwall",
            "body": "I still think he doesn’t know what a tariff means, much like he kept going around talking about Hannibal lector and asylums, conflating seeking asylum with “insane” asylums. \n\nI want off of this ride.",
            "score": 1,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": "Trump stated during the election he wanted tariffs like the 1890s. He knows that's the time of the robber barons, who didn't have to pay any income taxes because tariffs were the source of revenue of the federal government.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MisterStorage",
            "body": "He also is oblivious to the long term damage he’s inflicting on America. He’s permanently alienated our former best friends, who will never trust us again and will do what they can to develop other trading partners. We are all poorer for his recklessness and cluelessness.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AllTheyEatIsLettuce",
            "body": "To distract from the intentional, internal degradation and devastation of the Federal government itself. Donnie and Donnie's goon's goons are swinging a braid of dead cats. They don't give half a single fuck how much the dead cats stink or who gets hit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gix_Neidhaart",
            "body": "Because he’s a petty piece of shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Great_Dadvid",
            "body": "He definitely missed his calling as a 🤡",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real-Adhesiveness195",
            "body": "He’s an effluent mill",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brief-Pair6391",
            "body": "I'd bring charges, i think. That's surely assault, no ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "operarose",
            "body": "You could fill ten libraries' worth of books with the shit he doesn't know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "williamgman",
            "body": "Just ask the Flaired Users. They say they know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "masstransience",
            "body": ">Because the other countries will pay for it. \n\nAnd the real answer is because Putin told him to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mlc885",
            "body": "You aren't allowed to mention that you did it to destroy America, so he can't say the reason. Just like how we keep threatening to invade Canada and Mexico despite that only hurting the US. The point is very possibly hurting the US. (See: \"no puppet, no puppet, you're the puppet!\")",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bannonpants",
            "body": "To collapse the economy and then parcel into his rich friends to control and skim money off of",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aesyric",
            "body": "Yes he does. He just doesn't want to say it to the public.\n\n\nHe did it to intentionally cripple the economy to an insane degree so that organizations fail and the government nearly collapses\n\n\nThen his billionaires buddies can buy it all up and we can enter a government run by corporations instead of politicians.\n\n\nJust like Curtis Yarvin has been preaching. Just like project 2025 wants to accomplish. Just like russian Oligarchs did to Russia, and now - surprise! - they are getting gold card free citizenship over here. I wonder what all of this will add up to...",
            "score": 1,
            "replies": [
                {
                    "author": "ResignedFate",
                    "body": "https://bsky.app/profile/jennycohn.bsky.social/post/3ljnh5idr422y\n\nTesting the waters in weaker legal realms.\n\nThe law should be front and centre in everything he does in the US. And the members of the Supreme Court that vote against the actual constitution and law in his various appeals need to be called out for exactly that.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Aesyric",
                            "body": "Oh my god that is terrifying. More people need to see this.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sparda204920",
            "body": "Can I be honest, might be a stupid reason but I really think it's because Ivanka and Melania are attracted to Trudeau.  He's full on jealous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sliding-into-tomorro",
            "body": "He needs the tariffs so he can fund his sovereign wealth fund and then steal the money through corrupt crypto deals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xxxxx420xxxxx",
            "body": "If he said \"I'm destroying the economy as a favor for oligarchs keeping me out of jail\" that might not be received well by 330,000,000 Americans",
            "score": 1,
            "replies": []
        },
        {
            "author": "StartlingCat",
            "body": "His entire strategy is to completely fuck everything up and destroy it so he can rebuild it in his image.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DRagonforce1993",
            "body": "Where the hell are the trump supporters who can coherently explain to me why this was necessary using facts and real world examples of why there was this trade imbalance?!?!?!???!????",
            "score": 1,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": "They are in that other reality they live in. lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pillsburydinosaur",
            "body": "If a Russian asset became President and wanted to destabilize a country this would be a good way to do it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Berserker76",
            "body": "Because his Russian handlers told him to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScoobyDone",
            "body": "He uses money to fuck with people and gain the upper hand.  He wouldn't pay his contractors, then he would promise to pay if they gave him extra stuff, when he got the stuff he would stiff them anyway.\n\nHe is too stupid to realize that unlike contractors, you can't replace trading partnerships built over decades with a phone call.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tooandto",
            "body": "He was ordered to. If his master Putin told him to do the opposite, he’d obediently comply. Acting as if Fascist47 makes his own decisions at this point is absolutely wild.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SickARose",
            "body": "Saving billions, cutting costs, removing financial aid internationally, etc.  Okay, so what’s the plan for all the saved money?  How is it going to help the economy, nation, citizens?  Is it paying down our debt? Do we need to raise the debt ceiling?  It goes into his pockets, end of story.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ytrewq9000",
            "body": "Trump is an old senile moron.  He’s complaining about the USMCA which is a treaty that he pushed for and signed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Timothy303",
            "body": "I assure you Trump *doesn't* know why he launched a giant trade war. Which makes this all the more infuriating.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PassionStrange6728",
            "body": "It's to stop fentanyl, no it's the trade deficit (ignoring that Canada gets shafted by Americans on the trade of goods), no it's to bring manufacturing home, no it's...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anti_shill_cannon",
            "body": "Can you imagine if a Democrat did this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdmirableCountry9933",
            "body": "So my question is.... does the stock failing make crypto currency better? If so, is the plan of demolition of dollar value push crypto?",
            "score": 1,
            "replies": []
        },
        {
            "author": "coffee_mikado",
            "body": "In daily conversations, please make sure to say the words \"Trump started the trade war\" in some way, shape or form. Drill it into every normie's head that this trade war, inflation, recession is because of Trump.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zazen_Satori_Gaming",
            "body": "Until we see mass protests and work stoppages from you guys, for our own safety & sovereignty, we must assume the American People are generally endorsing, by inaction, President Trump/Musk, therefore don't wish to stop him/them/antichrist.\n\nSo far, all I've seen is a lot of pissing & moaning followed by a lot of nothing...Either get serious about saving your country or order a MAGhAt online and join them. It will help us figure out which to shoot, if you guys try to invade us.\n\nPissing off all Canadians is a feat bordering on a holy miracle, we're very hard to piss off as a people. But, somehow, you found Trump/Musk, who apparently, are uniquely qualified for that particular job. Well done...I guess?...\n\nAmericans and Canadians have spilled blood together on many battlefields , and this is the thanks we get. Fix your shit ASAP, before global economic collapse, preferably,, please and thank-you, from your very worried and concerned friend, Canada..\n\nNo one else can save you, but yourselves...So, Don't wait to be saved...It'll be too late..You guys got yourselves into a nightmare no one else but you can pull yourselves out of. You allowed the wrong sort of people to acquire too much power. (root cause = \"Citizens United\").\n\nI suggest brushing up on Ghandi's, \"Passive Resistance\" movement for starters. Blue states control most of the USA's strategic naval facilities, (Naval Power being the foundation of military power projection since WWII, putting naval blockading red states on the table)), 2/3 of the US economy and more than half its population. Trump/Musk can't control you if you don't allow him to.,\n\nDon't be sheep waiting meekly to be sent to the slaughterhouse, we see where that got the Germans and Japanese under similar circumstances....Find a way to leverage whatever power you have remaining while you still have it....Your children's future literally depends on you right at this very moment in time. Future historians are watching closely, and ALL of you will be judged accordingly based on your actions or inactions.....There's no such thing as an \"innocent by-stander\" anymore...",
            "score": 1,
            "replies": []
        },
        {
            "author": "timpham",
            "body": "Because that’s a directive from Kremlin",
            "score": 1,
            "replies": []
        },
        {
            "author": "fishsticks40",
            "body": "This whole plan is based on the idea that America is so powerful that we should throw our weight around more. But of course we're powerful BECAUSE we have allies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HedRok",
            "body": "Distraction",
            "score": 1,
            "replies": [
                {
                    "author": "HedRok",
                    "body": "Flooding the zone in a more resonant and longer lasting way.   Media runs with it. Boom, tax breaks for the rich. All of this goes back to the money.  People who  have a lot of money know what I’m talking about. It’s intoxicating to make even more than you are already making.  Especially when it doesn’t cost you anything. Just my opinion about Trumps shenanigans.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Independent-Guess473",
            "body": "The real reason is that Putin told him to. This failure of a businessman only knows how to be a reality TV star.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lazy-bruce",
            "body": "He can't exactly say, because Putin told me to can he.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IAmJohnny5ive",
            "body": "Hey now. What good is presidential power if you don't wield it? Like a 3 year old in the candy aisle when their parents have just said no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "p-values",
            "body": "Oh he knows!\n\nHe wants to force all industries to go back in the USA in order to have a strong internal economy. That's the goal. After that, he can invade other countries without worrying too much about the sanctions of other countries.\n\nJust like Russia!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dorkseid1687",
            "body": "Because he’s a Russian asset",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweet_Nothin",
            "body": "Just because he has instructions from Putin doesn’t mean he understands them",
            "score": 1,
            "replies": []
        },
        {
            "author": "paulbram",
            "body": "This isn't rocket science. Of course we know why he did it. His boss told him to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ennuiinmotion",
            "body": "This is my biggest problem with his trade policy. Usually there is some method to the madness (I think we all should grudgingly admit that he usually starts from a real idea and then just completely misunderstands and fucks it up). I can’t tell what this is all for, so while I’m confident it’ll all fail, part of me still wonders if I’m just not seeing the endgame.",
            "score": 1,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": ">I can’t tell what this is all for, so while I’m confident it’ll all fail, part of me still wonders if I’m just not seeing the endgame.\n\nThe last item in the article. Revenue from tariffs. \n\nFor decades, Republican leaders main motivation for what they do has been (1) reduced taxes for the wealthy and big corporations and (2) reduced business regulations. \n\nWhen one of those things is the possible reason for an action they take, it's almost always the correct answer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RiseDelicious3556",
            "body": "He has no thought-out plan engineered by economists. He just waves his scepter and issues edicts like some deranged Papal envoy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lastburn138",
            "body": "That's because he's a fucking moron",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jrnail88",
            "body": "I guess Putin never explained it to him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mike5473",
            "body": "Demented…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Georgi2024",
            "body": "He does know, he can't say. It's in the interests of the Kremlin to crash the US economy, and Trumpski is under orders. Otherwise he'll get novichocked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "perchfisher99",
            "body": "Trump the genius businessman is the only one able to see the logic in this.  We are all too stupid in comparison to his brilliant brain!  /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fightingkielbasa_13",
            "body": "He doesn’t know how to shut up.   The last person that talks to him gets to dictate world policy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Red_Wing-GrimThug",
            "body": "Cant wait for the kid’s Mystery Van to pull the head off the giant Fentynol pill",
            "score": 1,
            "replies": []
        },
        {
            "author": "llyrPARRI",
            "body": "Because the real answer is that \"someone\" told him to start it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nalabu1",
            "body": "Because he’s a MORON. Look at his past business practices and compare them to the way he’s running the US. See the similarity? If you look even future down the road you’ll see the head light of BANKRUPTCY coming towards us. Thanks MAGA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "camiknickers",
            "body": "Good article, which shows that Trump is either a Moron (that is well known), or that there is a real reason that does make sense, but would be unpopular. Something along the lines of his billionaire tech bros making a lot of money by shorting the economy. Or sucking up to Putin. There is obviously no good reason that benefits America.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unique_Jackfruit_166",
            "body": "Old timers setting in peeps",
            "score": 1,
            "replies": []
        },
        {
            "author": "Trey33lee",
            "body": "He's playing the wildest game of Red Light Green Light ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ButWhatAboutisms",
            "body": "Trumpers voted for a regressive tax policy on themselves because billionaires managed to exploit their ignorance on what a tariff is. You know, it's good being the most wealthy nation in the world and forcing your trading partners to pay you a tribute, right? Devoid of morality as they are ignorant.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nubator",
            "body": "He’s an idiot. That’s why.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JodiS1111",
            "body": "Russian operative and also a buffoon",
            "score": 1,
            "replies": []
        },
        {
            "author": "twitch_delta_blues",
            "body": "It’s too late. They can never admit error, let alone a simple misstep. Having said he would do this he now has to lest others perceive him as weak. That’s more important than actual consequences for 300 million Americans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwinupthetowel",
            "body": "Why or *that*?",
            "score": 1,
            "replies": []
        },
        {
            "author": "tastyemerald",
            "body": "Well he's not about to admit its because Putin told him to now is he?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent_Teach247",
            "body": "I don’t know why at this point we blame Trump for anything happening right now. He has been very transparent about what he will do and people just chose him anyway. \n\nIf the country chose the path of self-destruction and the person to execute that will, why are we blaming the person just realizing people’s wishes?",
            "score": -8,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": "But American citizens didn't \"choose the path of self-destruction.\" Less than 1/3 of eligible voters voted for Trump. \n\nAnd don't bring up the fact that 90 million people didn't vote as somehow Trump is what they wanted. Contributing to the cause of a thing through inaction is not the same thing as wanting that thing or choosing it..\n\nPlus, voter apathy or confusion in this case is a result of decades of Republican propaganda. \n\nWhere they have been taught to mistrust government, mistrust politicians. That all Democrats are crazed radical leftist lunatics. And that their vote doesn't matter. While Republican state laws have been enacted to discourage their vote.\n\nSo their inaction is a result of Republican propaganda and lies.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "eightNote",
                            "body": "all the non voters put their vote for this too. only the harris voters voted against the self destruction\n\nreally its two third of voters that approve of having trump in power",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "raistlin65",
                                    "body": ">really its two third of voters that approve of having trump in power\n\nNo. That's just in your twisted point of view.\n\nAnd it makes you part of the problem, not part of the solution.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WhatRUHourly",
                    "body": "I think those who voted for him and who have just fallen for everything he has said (especially those who violently defend it) are culpable as well, but Trump still carries a lot of blame because he gained a lot of the support through manipulation or outright lies.  He has been truthful about wanting tariffs, but certainly not about what they actually are and what effect they might actually have.  He continues to lie about who is going to pay them.  Prior to the election he didn't mention that there would be some amount of time where things will get bad, but then will get better.  He waited until he won the election to drop that little nugget.  Instead, he told them he'd be fixing things on day 1 and that he'd wave his little magic mushroom and everything would be 'great again.'  Yes, they're idiots for believing him, but I'm not going to let him and the GOP walk for their lies, manipulation and deception.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Intelligent_Teach247",
                            "body": "Well, if people can vote for him given the track records in his first term, I don’t think it is Trump being a good liar but those people are just as dumb as the doornails. \n\nPeople were hoping to “take a chance” and that is why he won. Sure he didn’t make this obvious enough or he now is doing what he said he wouldn’t do. But given his record, why would people still choose him? Just because he is a good liar? Really?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WhatRUHourly",
                                    "body": "Unfortunately, many believe his lies, in part due to propaganda.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EatKaleSometimes",
            "body": "We’re 36 trillion in debt he’s trying to reduce trade deficits",
            "score": 1,
            "replies": [
                {
                    "author": "Tichrimo",
                    "body": "You do know that debt and deficits are different things, right? And that budget deficits and trade deficits are different things, right?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -12,
            "replies": [
                {
                    "author": "Cute-Ad2879",
                    "body": "Can you add some context then?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "BaronGrackle",
                    "body": "Would you care to explain the reasons for tariffs on Canada? Because I've listened to Trump explain it.\n\nHave *you* listened to Trump explain it? You claiming \"I watch all his speeches\" while still supporting him, believing him coherent even, is extremely suspicious.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "No-Obligation1709",
                    "body": "Thank goodness guys, “buttfuckkker” knows what’s really going on.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "buttfuckkker",
                            "body": "The hero you all deserve",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "No_Package7950",
                                    "body": "Why'd you delete your comment? Brave, but your feet won't stand?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "buttfuckkker",
                                            "body": "I didn’t delete it",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "veggeble",
                    "body": "You realize the headline is from Vox, not reddit, right?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "buttfuckkker",
                            "body": "Yea I know what vox is. Doesn’t really matter what source it is at this point",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "veggeble",
                                    "body": "Well it kind of does when you’re criticizing reddit in response to a Vox headline",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "buttfuckkker",
                                            "body": "Mostly it’s in response to the incoming circle jerk I know I’m about to read in the comments",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "veggeble",
                                                    "body": "In *response* to something you haven’t even read yet? So you already came to a conclusion before you’ve seen what was said?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "buttfuckkker",
                                                            "body": "I would be extremely shocked if it was anything but what I’m expecting and just checked… yea it is",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "veggeble",
                                                                    "body": "There are a couple of replies to you, asking you to provide better context. But so far, you've failed to do so. So all you've done is jump to conclusions that conform to your biases and offered no counter argument at all, let alone one based on facts. And you think you're in a place to criticize others?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "buttfuckkker",
                                                                            "body": "Look at the rest of the comments in this post and tell me I wrongfully jumped to conclusions",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "veggeble",
                                                                                    "body": "I *did* look at the comments. As I told you, a number of them asked you to provide better context, which you still haven't done. Can you provide that context or not? Because all you've done so far is jump to conclusions and offered no real counter argument.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "buttfuckkker",
                                                                                            "body": "What exactly are you talking about. Do you want me do 4 hours of work to dig up quotes with compare and contrast for some fuckers on Reddit?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "veggeble",
                                                                                                    "body": "Again, you admitted your comment was made *before* you read any comments on reddit. So you don't need to provide a contrast to other comments, because they didn't factor into your initial claim. You complained about the headline of the article (and ascribed it to reddit, rather than Vox). Can you provide literally *anything* that shows Trump knows why he launched the trade war? Because you've been asked a number of times, and you've provided nothing.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "buttfuckkker",
                                                                                                            "body": "lol you win the internet. I’m too sleepy to argue with you",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "veggeble",
                                                                                                                    "body": "So you have nothing? That's what I figured.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "buttfuckkker",
                                                                                                                            "body": "You got me Mr Holmes",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "veggeble",
                                                                                                                                    "body": "You realize you make Trump supporters look like fools, right?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "buttfuckkker",
                                                                                                                                            "body": "Anyone who cares what they look like is a fool",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "veggeble",
                                                                                                                                                    "body": "Okay, well you make Trump supports look like fools anyways. So whether or not they care that you make them look like fools is irrelevant. But it's clear that logic isn't one of your strengths. Of course we already knew that, considering you're a Trump supporter.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Iowa_Dave",
            "body": "Trump straight-up lied when he said China would pay import tariffs.\n\nI work for a company that imports some product from China and we own it the minute it leaves the factory door, *we* pay the tariff.\n\nSure, I'm all for bring manufacturing back to the US, but remember the reason Chinese products are so cheap - The average assembly wage in China is $5.20 an hour.  If you bring manufacturing jobs to the US you'll have to pay American labor rates, completely erasing the price advantage and likely increasing prices even more.",
            "score": 48,
            "replies": [
                {
                    "author": "raistlin65",
                    "body": "Yep. And Trump doesn't really care about bringing back manufacturing to the US. Or he wouldn't be going after the CHIPS act",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "WhatRUHourly",
                    "body": "The 'bringing manufacturing job back to the US,' argument for tariffs is just wishful thinking in my opinion.  I think what is much more likely is that US companies will raise their prices and increase their profit margins to continue to make record profits while foreign companies raise their prices to cover the tariff.  So, the price difference between the two products (US v. foreign) may not change much if at all.  The foreign producer might lose a bit of demand, but probably not enough to warrant building production plants in the US.  Meanwhile, the US consumer will pay higher prices regardless of the point of origin of the product.    \n\nThose that move some production to the US likely already had plans to do so and aren't going to be forced into it by tariffs.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Scared_Refuse_7997",
                    "body": "I'd argue its a lot more than wages. If we invested the amount of time and resources into production like china has all these years, we would be able to pay people and still keep prices down. No one ever wants to admit that China knows what they are doing when it comes to manufacturing just about anything. You cant just pay people less money to keep prices down.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Venator850",
                            "body": "The US is the second largest manufacturer in the World. It's crazy that all the propaganda about offshoring work has people thinking we don't make anything here anymore.\n\nThe thing is; to make EVERYTHING here you'd need a population far larger than the US currently has. We don't have enough people to make all the stuff we consume.\n\nChina doesn't either. They import almost as many goods as they export despite a massive manufacturing base.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Scared_Refuse_7997",
                                    "body": "We still have no where the investment and capabilities that china has though. But you actually hit the true problem right on the head. Americans consume too much. American culture needs a deaperate overhaul if things are to truly change, and personally I have no idea how you would even go about that.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "vahntitrio",
                    "body": "I remember we made a product, marketed as made in the US and our cost per unit to make it was roughly $11 (not retail price, cost to manufacture it). China was able to reproduce the product, albeit inferiorly but still serving the same function, and SELL it for less than $3. They could make the same item for less than 1/4 the cost - and our US made product was killed on the spot.\n\nThe price difference in cost to manufacture in a lot of areas is so much more than 25% that a 25% tarriff still won't bring any production to the US, it just increases costs here. And in an example like above, many of the electronic components we used for that $11 part were from China, so our cost to manufacture would have been $12, so it wouldn't even close the gap.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}