{
    "title": "Canada Won’t Scrap Tariffs Unless All US Levies Are Lifted, Official Says",
    "author": "bloomberg",
    "subreddit": "politics",
    "rank": 25,
    "score": 1625,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 128,
    "url": "https://www.bloomberg.com/news/articles/2025-03-05/canada-won-t-scrap-tariffs-unless-all-us-levies-are-lifted-official-says?sref=xuVirdpv",
    "id": "1j45shn",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "LaMarr-Bruister",
            "body": "Another world leader kicking Trump's ass in negotiating.  What a common theme this is becoming.",
            "score": 1,
            "replies": [
                {
                    "author": "silicondali",
                    "body": "Trudeau gets dunked on all the time for his career as a junior high drama teacher, but this is the core skill set needed to deal with Trump.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TraditionalClick992",
                            "body": "I generally have not been a fan of Trudeau's government, but he really does shine in a crisis. He was fantastic in the early days of covid.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "VeterinarianJaded462",
                                    "body": "Pretty neutral on the guy, but yeah, he rises to the occasion. Nice Trudeau is a punching bag. Angry Trudeau has real pedigree.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BarnDoorQuestion",
                                            "body": "Gets it from his father. One of our greatest Prime Ministers of all time (and I’m Albertan, so you can trust me on that). JT has been giving me plenty of [“Just watch me”](https://m.youtube.com/watch?v=XfUq9b1XTa0) energy and I am here for it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RedFox_Jack",
                                    "body": "Honestly “idgaf Trudeau” is when he’s at his best especially in a crisis and it’s all the more fun to joke about him cucking Donny",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Thirdnipple79",
                                    "body": "Yeah.  Him and Doug Ford are actually solid when shit hits the fan.  It would be great if we could just use them when there's a global emergency and then put them away again until the next one. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Radix2309",
                            "body": "He was a math teacher. He filled in for the drama teacher for a semester because she was on maternity leave.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Bazonkawomp",
                                    "body": "It was all very dramatic.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "WiglyWorm",
                                            "body": "It just makes me want to set myself on fire.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MenacingGummy",
                            "body": "He went full teacher yesterday with “Donald…”. I hope Donald felt an inch tall when he heard it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Kracus",
                                    "body": "That would require introspection.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sharp11flat13",
                            "body": "Trudeau was a teacher for a few years. He’s been a Member of Parliament for 16 years and Prime Minister for 10. The “drama teacher” thing was just another weak slur by our pathetic Conservatives who have no policy ideas that would actually help Canadians, so they have to resort to Trumpian smear tactics to rile up the base.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hot_sushi",
                                    "body": "It's also a classic conservative move to think that calling someone a teacher would be a slur. These are people who revel in their own ignorance and inability to learn.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "clue2025",
                                            "body": "One of the most obstructive Rs is a fucking football coach from backwater Alabama. That will always be worse than a teacher.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "sharp11flat13",
                                            "body": "Good point.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "gnrhardy",
                                            "body": "It's also particularly laughable coming from a party that repeatedly elects leaders with zero experience outside politics while simultaneously railing against insiders and elites.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "moop44",
                            "body": "Also a math teacher, but right wingers really just hate educators.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "flux8",
                                    "body": "Guarantee the right wingers who hate educators were terrible students when they were in school.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "eladts",
                            "body": "Experience as a kindergarten teacher would be even better to handle Trump.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AnoAnoSaPwet",
                            "body": "Trump is abject failure #1 politically. He hasn't done anything good for anyone.\n\n\nEven I have have good things to say about Trudeau, despite the amount of corruption the Liberals do in Canada.\n\n\nTrudeau stood up for Canada during Trump's first term too. It's why Pierre Poilievre is tanking brutally in the polls right now (he went from having a gift-wrapped Conservative majority government, to the Liberals having a good chance at forming a majority government). ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "brushpickerjoe",
                    "body": "Now we need Mexico to close the border until the US stops exporting guns for the cartel terrorists.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sarcasmgasmizm",
            "body": "Canada doesn’t start wars but we sure don’t back down when in them! Elbows up! United we stand",
            "score": 1,
            "replies": [
                {
                    "author": "slingsandstones",
                    "body": "Ferda.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CanIBathYrGrandma",
                    "body": "I agree wholeheartedly as an American but what does ‘elbows up’ mean? Is it a hockey expression?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sarcasmgasmizm",
                            "body": "It’s from the legendary Gordie Howe and means protect yourself, it’s time to fight back",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CanIBathYrGrandma",
                                    "body": "Ok thanks",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Bazonkawomp",
                                            "body": "Let’s do that hockey.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Zombie_John_Strachan",
                                                    "body": "The horn just sounded, and you know what that means.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BaileyRose411",
                            "body": "Yes.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "17to85",
                            "body": "Basically it means if you're along the boards and you get your elbow up so the guy trying to hit you has a good chance of taking an elbow to the face for his trouble. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sharp11flat13",
                    "body": "Hear hear, eh!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SabrinaR_P",
                    "body": "I doubt the conservatives wouldn't cave like a castle made of cards.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "awkwardlyherdingcats",
                    "body": "Don’t play chicken with geese. Team Canada is united",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "backseatwookie",
                    "body": ">Canada doesn’t start wars but we sure don’t back down when in them!\n\nMakes me think of MandatoryFunDay and the [Geneva Checklist.](https://youtu.be/Xwsb7N0LOfI?si=1REvf_q1V2BOMOSO)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "trogdor1234",
            "body": "Look at Trudeau promising stability. You can’t add and remove tariffs every single day.",
            "score": 1,
            "replies": [
                {
                    "author": "BrianBurke",
                    "body": "Good for business.   A stable democracy brings investment.  Whatever the fuck they are pulling down there is going to going to just make capital flee",
                    "score": 1,
                    "replies": [
                        {
                            "author": "USSCerritos",
                            "body": "That's what they want",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BaileyRose411",
                    "body": "It shows trump doesn’t know what he’s doing. No more of this shit. He started it….let him live with. And no more of this 51 state shit.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DrizzlePopper",
                            "body": "I’m convinced he’s crashing the stock market so rich fuck billionaires can buy on the cheap",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "17to85",
                                    "body": "I think that's an unintentional consequence. I think this is just Trump's idea of negotiating. He's spent his whole life whelching on deals and not paying and then using his superior wealth to outlast his opponents in court... which doesn't really work in this case because it relies on average joes to be ok with the hardship.... which they won't. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "USSCerritos",
                                            "body": "If you're familiar with Curtis Yarvin and Peter Thiel and their links to JD Vance, you would not believe it's unintentional. This is what they want.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "17to85",
                                                    "body": "Yeah but this is shit Trump's been doing anyway. Like I said, others may want that, but Trump is just trumping along pretending he's  mob boss and this is all still new york real estate.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Bananajackhamma",
                                            "body": "*rUn It LiKe bUsInEsS*\n\nSays those who either watched or heard or by some miracle READ how drunpf does \"business\" and still feel as though any of what he did, or is currently doing can be any level of good business. Dude crawfishes better than any I've ever seen and has not ONCE gotten punched in the FUKKEN teeth for it. Dammit in the face I want off this ride.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HappierShibe",
            "body": "I would argue that Canadian Tarriffs should remain in place until all US levies have been lifted for 30 days.  \nThere needs to be real pain as a response for this treachery.",
            "score": 1,
            "replies": [
                {
                    "author": "amensista",
                    "body": "YES!!! Totally agree and if the US tariffs start up again - even ONE.  Then the reprisal tariffs starts and the 30 day timer resets.  So it is in the interests of the US to end them as quick as possible because there is always a 30 pain period after.\n\nHell yeah.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Miller4103",
                            "body": "I would do it for 6 months minimum. Fuckem.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "amensista",
                                    "body": "But that hurts alot of people that didnt vote for this human garbage president.  You want it to be enough to show strength not enough to cause global damage beyond whatever damage has been caused.  30 days is way more then enough.\n\nBut what you could do is stack.  30 days 1st set of tariffs.  then when they come back anytime within 12 months - 60 days with 10% added.  then when they come back within 12 months - 90 days with additional 10% added.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Miller4103",
                                            "body": "Agreed but just about half of america wants this, or at least they voted that way. He will be president for 4 years.\n\nI do agree ur proposed solution is way better than mine though.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bryan-healey",
            "body": "good.\n\nhell, they should keep their tariffs in place even **if** the US tariffs are lifted.\n\nwe're just gonna be back here again in a month.",
            "score": 1,
            "replies": [
                {
                    "author": "trogdor1234",
                    "body": "That would be a baller move.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KevRose",
                            "body": "We should be “put in the timeout corner” for 4 years. With hopes we even get to vote in another president after, which is sad I’m even saying I hope we can even do that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TicTacTac0",
                    "body": "As a Canadian, the very angry part me wants to say fuck yes to this. On the other hand, I'd rather us not cause needless economic harm. \n\n\nI'm comfortable enough to handle these tariffs, but I don't think the people already living paycheck to paycheck would appreciate it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DeliberatelyDrifting",
                            "body": "Sadly, it's not needless.  It will be harder and harder to stand up to it the longer trumps placated.  The sooner they get on with it, the sooner they find new partners and adjust.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SizzleMoon",
                    "body": "If anything, I hope they don't put the U.S. alcohol back on the shelves too soon.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "gnrhardy",
                            "body": "It was already sitting on the shelves collecting dust in a lot of places last month anyway. Even if they put it back on the shelf it doesn't mean consumers will be buying it in anything near the previous volumes.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Prior_Coyote_4376",
                    "body": "They should raise the tariffs if the US ones get lifted. The US has clearly exposed a weakness if they lift a tariff. Canada should exploit that and double down.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pokeshack",
                            "body": "And continue the momentum of removing provincial trade barriers. We need to take this as a huge wake up call and become more self reliant, and where necessary, find reliable, like minded trading partners.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "suckyousideways",
                                    "body": "This. Look first within Canada, then to Mexico, Europe, and other places that aren't the USA. There should be delegations of Canucks headed to a dozen different countries THIS WEEK to establish new connections and strengthen existing trade agreements to support our producers.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TraditionalClick992",
                            "body": "Canadian here. I would impose export taxes on anything Trump exempts. All or nothing. He's going to exempt items that open him up to domestic pressure. We need to press him to the max.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SizzleMoon",
                                    "body": "Absolutely! He wants to make easy for himself.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Droidaphone",
                            "body": "I mean, these counter-tariffs hurt Canada too. A trade war has no winners just like any other war. But I don’t know how you wrangle any stability or long-term promises from this admin, so I guess I don’t have a better suggestion.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hannibal_Spectre",
                                    "body": "They do but much less so than a blanket tariff because they are specifically aimed. Oh well I can’t buy Kentucky bourbon or Florida OJ, I’ll get equivalents somewhere else. As opposed to say aluminum and potash on the US side, which might be hard to source. \n\nWhat’s more interesting is the amount of “buy anything but made in USA” that is being practiced by a large swath of Canadians these days. There’s even an app, and many grocery stores have helpful signage in their stores. That has the potential to be very damaging to US exporters as well as the very real US tourism cancellations that are happening through Canada. These are going to be there whether or not the tariffs stay. \n\nHowever mad you think the average Canadian is right now, you have almost certainly underestimated it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CelticSith",
                    "body": "Keep the tarriffs in place and shut off the lights",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mizmaggie54",
            "body": "If I was the PM of Canada, I wouldn't believe the US ... I'm sure our prime minister won't.  I would stay the course now.  No more slackening off.  Keep Canadian tariffs in place and let the loud orange one deal with it.  Of course I am no politician.  Still, I would gladly tighten my belt and sweat it out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bloomberg",
            "body": "From Bloomberg News reporter [Brian Platt](https://www.bloomberg.com/authors/AVhsUwCy8eU/brian-platt):\n\nPrime Minister Justin Trudeau is not open to lifting Canada’s full package of retaliatory tariffs if US President Donald Trump leaves any tariffs on Canada in place, according to a senior Canadian government official.\n\nTrudeau and Trump are scheduled to speak later Wednesday morning, said the person, speaking on condition they not be identified.\n\nThe official said Trudeau’s government is cool to the idea of a “middle ground” settlement in the trade war [floated](https://www.bloomberg.com/news/articles/2025-03-05/trump-to-decide-on-canada-mexico-relief-today-lutnick-says) by US Commerce Secretary Howard Lutnick. In particular, any scenario where Canada has to fully rescind its [retaliatory tariffs ](https://www.bloomberg.com/news/articles/2025-03-03/canada-is-ready-to-retaliate-against-us-tariffs-foreign-minister-joly-says)in return for a partial rollback of American tariffs will be rejected by Trudeau, the official said.\n\nThe official did not comment on whether Canada would scale back some of its retaliation if Trump pulls back on some US tariffs.",
            "score": 1,
            "replies": [
                {
                    "author": "Efficient_Career_158",
                    "body": "Haha they want us to fully rescind Canadian tariffs in exchange for PARTIALLY rescinding the US ones? \n\nFuuuuuck that. Is that the process now? America inflicts tariffs on parties one at a time then tries to negotiate a partial clawback of American tariffs, leaving some in place? That's what's called \"a total loss\" for trading partners\", and assumes that we can't call other countries on the phone. \n\nGuaranteed that Canada's strategy will be at least reflected in Mexico and Europe's responses to this. I would even wager that we've been talking to our Chinese counterparts, as well.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "manticore16",
                            "body": "“Meet me in the middle,” says the dishonest man. You take a step forward, he takes a step back.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Yukonhijack",
                            "body": "It's because Trump realizes he made a massive mistake imposing these (whether he admits it at all or not), but still cannot be seen as capitulating without Canada giving in.  He has a frail ego and cannot stand to \"lose\".",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "InnerLychee",
                    "body": "Wait.  Canada has to remove all our counter-tariffs for a \\*partial\\* rollback?  F that.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PlatformVarious8941",
                            "body": "Nah, it’s Trudeau saying they will outright refuse that scenario. It hasn’t been proposed.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "gnrhardy",
                                    "body": "I'd assume secretary Licknuts proposed it since they felt the need to comment on it at least.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tarlack",
            "body": "I would rather die a poor Canadian, and not a rich American.  We are tired of Trump trying to strike a bargain with a gun to our heads.",
            "score": 1,
            "replies": [
                {
                    "author": "jimmydog65",
                    "body": "Well said.. I might borrow that line!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "berger3001",
                    "body": "But it’s a gun that may or may not be loaded, and there’s just as much of a chance that he’s going to maim himself with that gun before killing anyone else. Hell, it could be a water gun for all we know",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tegurd",
                    "body": "I’m afraid your choice is poor Canadian or poor American.  \nWould you care to reconsider?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sharp11flat13",
                    "body": ">I would rather die a poor Canadian, and not a rich American\n\nOh, that’s good. You should be marketing t-shirts.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hayes4prez",
            "body": "This is how you deal with bullies. \n\nI wish the Democratic Party understood this.",
            "score": 1,
            "replies": [
                {
                    "author": "niche_user35",
                    "body": "Me too",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "theoriginalbabayaga",
            "body": "Canada should enact 500% tariff on new teslas, and 1000% tariff on all tesla parts. Make it so not only does he not sell new, people actively get rid of the old. And then Canada should buy all the traded in Teslas and make a video showing them being crushed to scrap one by one. Obviously, the recycling needs to be done first, but ultimately think how awesome that would be to see thousands of teslas crushed.",
            "score": 1,
            "replies": [
                {
                    "author": "Prior_Coyote_4376",
                    "body": "Tariffs on teslas, discounts on every other EV.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sharp11flat13",
                    "body": "The next move should be a 10% export tax on energy. Trump put a lower tariff on our energy for a reason: to lessen the impact of his tariffs on his supporters. Let’s not let him get away with this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TripleDoubleFart",
                    "body": "Why do we want to get rid of old Teslas?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Droidaphone",
                            "body": "Realistically, because they’re pretty dangerous. The nazi thing also sucks, but before that became clear, teslas already has an extremely poor safety record. They are notorious for exploding, getting stuck accelerating, and accidents related to the “self-driving” mode.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bgrnbrg",
                                    "body": "They may be \"notorious\", but that's more due to it being international news every time something happens.  \n\n[Broken Down: NHTSA Data for Fires and Engine Issues 2015-2023 ](https://www.reddit.com/r/cars/comments/188maw0/broken_down_nhtsa_data_for_fires_and_engine/) (using National Highway Traffic Safety Administration data) suggests that overall, and particularly when adjusted for market share, Tesla vehicles have among the lowest instances of fires of all of the manufacturers.  My personal option (without any data to back it up) is that accidents involving self-driving have a similar issue.  I'd be interested in see a comparison of accidents per million miles driven between Tesla \"self-driving\" mode and a few classes of driver.  I suspect you're a lot safer in a car being driven by Tesla software then you are in a car being driven by the average 17 year old male.\n\nThere are lots of reasons to not buy a Tesla right now.  I don't think safety is one of them.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Droidaphone",
                                            "body": "[The cybertruck in particular is more fatal than the famous exploding ford pinto.](https://www.planetizen.com/news/2025/02/134273-analysis-cybertruck-fatality-rate-far-exceeds-ford-pinto)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ClydeOberholt",
                                    "body": "What are you on about? I hate Musk as much as the next guy, but you're literally making shit up. Tesla don't spontaneously combust, lol.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Droidaphone",
                                            "body": "I think it’s less “spontaneously” and usually more “took a speed bump too fast and hit their undercarriage” but [they do combust quite a bit](https://boingboing.net/2023/05/05/tesla-fire-tracks-the-companys-spontaneous-combustion-problem.html)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "OldLondon",
                            "body": "Don’t get rid of them, donate them to DEI and LGBTQ+ charities",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "theoriginalbabayaga",
                            "body": "Eradication, that's why. Something should happen that makes him so incredibly furious he can't contain himself...and an entire country flipping the bird would be a good place to start.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PunfullyObvious",
            "body": "This is how you deal with a bully.  It's a shame the Democratic Party, and frankly, the Republican Party can't figure that out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exotic-Woodpecker247",
            "body": "Excellent. No more negociations with this garbage. He can’t be trusted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stang1776",
            "body": "I went to Aldi and bout some maple syrup that is a product of Canada. I don't even need maple syrup.  It was less than $6 so why not? \n\n Maybe reddit can buy all the Canadian Maple Syrup from Aldi.  Small way to show our support to Canada and the EU I guess.",
            "score": 1,
            "replies": [
                {
                    "author": "xpromisedlandx",
                    "body": "It’s a good replacement for sugar if you’re making a salad dressing or sauce that requires some sweet.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Stang1776",
                            "body": "When my i was visiting my folks years ago, my mom made a sauce consisting of vinegar and maple syrup.  I thought it was weird until I tried it.  She put it over pork tenderloin and I was impressed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mostuselessredditor",
                    "body": "They’d prefer to see us in the street doing something about this. Not buying syrup.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Stang1776",
                            "body": "Buying goods from Canada supports them.  I've already called all 3 of my reps in DC.  When I see that there's a peaceful protest in my city then I'll hit up for sure.  I'm not going to stand on the corner of a Circle K by myself though.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SickARose",
            "body": "Good, keep increasing them just because.  He is threatening you, act until he backs entirely off. Every month = new tariff unless he addresses he no longer wishes to annex you. Time to become the aggressor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "clickmagnet",
            "body": "And why the hell would he? People who think Trump is a genius strategist, including Trump himself, are basing it on his lifelong habit of people letting him win, or of daddy covering his losses, so he doesn’t have to think even one move ahead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FeRooster808",
            "body": "Smart choice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LimitFinancial764",
            "body": "Sort of seems like the best option for Canada would be to produce and then seize their own fentanyl at the border? \n\nI mean, I don't know how else you demonstrate progress on a problem that doesn't exist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LimpDisc",
            "body": "Good. Stop playing games with this clown.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bambino2021",
            "body": "Absolutely right.  Many Americans can’t be reasoned with and so need to be punished like children.  Sometimes collective punishment is necessary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LongDongFrazier",
            "body": "Should do incremental relief. Start with blue states and leave on the red ones.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_Ad_8731",
            "body": "Respect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-disaster2022",
            "body": "Art of the deal: keeping America accountable to the treaties it's signed by Trump",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "This submission source is likely to have a soft paywall. If this article is not behind a paywall please report this for “breaks r/politics rules -> custom -> \"incorrect flair\"\". [More information can be found here](https://www.reddit.com/r/politics/wiki/index/#wiki_paywalls)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Not_Cartmans_Mom",
            "body": "Good. Mexico should follow suit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThirdDimensionGate",
            "body": "Good as an American who will be affected and can’t afford it —GOOD someone needs to smack down Traitor Trump and our politicians are spineless and corrupt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JaVelin-X-",
            "body": "awesome!",
            "score": 1,
            "replies": []
        },
        {
            "author": "narrauko",
            "body": "Of course not! Why should they?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neo808",
            "body": " 🇨🇦 hold fast.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FriskyDingos",
            "body": "Hold the line, Canada!",
            "score": 1,
            "replies": [
                {
                    "author": "sharp11flat13",
                    "body": "We thank you for your support.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FriskyDingos",
                            "body": "I think we need to convince every other country that is not the USA to start buying Maple Syrup en masse.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sharp11flat13",
                                    "body": "Yes! High tariffs on maple syrup to the US. Discounts for everyone else (except Russia).",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "FriskyDingos",
                                            "body": "well so much for my low-sugar diet - I'm gonna take one for the team!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "sharp11flat13",
                                                    "body": "Lol! We appreciate your support.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ryan1980123",
            "body": "The orange clown will claim victory know matter the outcome of the tariffs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "EnvironmentalEye4537",
                    "body": "I’ll just past an earlier comment of mine because it addresses this:\n\nConservative media has gotten latched onto the idea that there’s a 270% tariff from Canada onto American dairy, which is wildly untrue. It’s just a simple anti-dumping measure. It was negotiated in NAFTA, reaffirmed in USMCA. Canada imports a set amount of American dairy to fit into the existing national supply management system. After that set point is hit (something agreed upon by both countries), the 270% tariffs are imposed and trade stops. No actual dairy products are being tariffed at 270%. America has a >$1B dairy trade surplus with Canada, great deal for America. Yet this is being framed as exploitation and abuse by Canadians of American dairy farmers.\n\nLike I knew Trump and Republicans lie about essentially everything, but damn, it really is an art form for them.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Fistsofheaven",
                            "body": "But you just go caught in a lie for your alleged facts… Pot meet kettle. As others have said maybe do a little more research. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "EnvironmentalEye4537",
                                    "body": "Same thing. It’s all a matter of flow control. Bovine/meat, cheese, butter, sausages, eggs, etc.. are all part of Canada’s [supply management system](https://en.m.wikipedia.org/wiki/Dairy_and_poultry_supply_management_in_Canada). It’s discussed [here, under allowable quotas](https://www.unifor.org/sites/default/files/legacy/attachments/usmca_uniforanalysis_oct2018_eng_0.pdf). It’s simply a method to discourage American exporters from selling more to Canada than is agreed upon by both countries. I can find no record of any tariffs on TVs, vehicles, and others. USMCA [maintained and expanded NAFTA zero tariff policies](https://www.trade.gov/usmca-overview). What I [HAVE found](https://www.trade.gov/fta-tariff-tool-search) was that 45% of a vehicles parts need to come from Canada, US, or Mexico to qualify for the tariff free status. All three countries agreed what does and does not apply for free trade. There is nothing that Canada or Mexico is doing that Trump himself didn’t negotiate. Americans can trade freely with Canada up until agreed upon quotas. That’s about all there is to say about it. \n\nTldr: None of it is true, or is at best a wild misrepresentation of the truth. Canada and Mexico have abided by the free trade agreement trump himself negotiated in 2020.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "WippitGuud",
                                    "body": "Look at this logically.\n\n\nIf Canada allows a country 10x its population to have unrestricted trade on everything, eventually there will be no Canadian companies. There needs to be protection to make sure our industries still exist.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MalevolentTapir",
                    "body": "Do you have a source for these numbers?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CrazyCanuck88",
                            "body": "[It's mostly misinformed bullshit. USMCA has negotiated tariffs, THAT ALL THREE COUNTRIES HAVE IN PLACE. There are permitted tarrifs as part of the deal. When NAFTA has been renewed/renegotiated, the permitted tariffs are altered. So I'm not sure if their percentages are correct but there are tariffs.](https://ustr.gov/trade-agreements/free-trade-agreements/united-states-mexico-canada-agreement/agreement-between)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MalevolentTapir",
                                    "body": "I knew it was BS I was more curious where he was even getting it from, or if he could even find it's origin. I've seen this list shared a few times.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}