{
    "title": "AITA for asking my fiancé to stop calling me at work",
    "author": "Captain-Cannoli",
    "subreddit": "AmItheAsshole",
    "rank": 15,
    "score": 3297,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 218,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1jdfuol/aita_for_asking_my_fiancé_to_stop_calling_me_at/",
    "id": "1jdfuol",
    "selftext": "My fiancé calls me at least once sometimes twice during the workday. She works from home at a call center and will call me either during her break or after something like work drama happens. I enjoy talking with her and love it when she tells me about her day, but I'm at work and am in a small office with what is essentially my manager. Granted, where I work is a small non-profit and pretty laid back, but I feel weird being on the phone just shooting the breeze next to what is essentially my boss. \n\nShe just called me again to tell me about something funny that happened at work and she was laughing the entire time she was telling me the story. I figured I needed to put this to bed, so I told her that I love hearing about her day, but I am at work and I would rather hear it from her in person, at home, after work. I asked her if that makes sense and she said yeah, but you never ask me about my day anyway. I honestly didn't know what to say because she is right, I don't verbally ask her how her day is but I've said in the past that I love nothing more than to hear about her day even if it was shitty",
    "comments": [
        {
            "author": "Judgement_Bot_AITA",
            "body": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked my fiance to stop calling me at work. I guess she probably thinks that I don’t care about her or her day\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n[Check out our holiday break announcement here!](https://www.reddit.com/r/AmItheAsshole/comments/1h3wnsj/aita_monthly_open_forum_december_2024_a_holiday/)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "LiveKindly01",
            "body": "NTA for asking here to not call you at work.  Everyone's work situation is different and she clearly has the time and space/privacy to call you but you don't really have that.\n\nSo...I feel like you've kind of got your answer here.  She seems to have reasonably understood what you were asking and has in turn verbalized what she's lacking from you.  Great on you for not getting defensive and actually listening to what she has expressed to you.\n\nDo you live together? Make an effort to talk about each other's day while making dinner/eating dinner or whatever, but yes, please make a point to ask about her day.  Some days there will be stories, some days not much, but that is such a HUGE HUGE thing about relationships. You need to show interest in what the other feels, experiences, etc.",
            "score": 1441,
            "replies": [
                {
                    "author": "Economy_Ad_2291",
                    "body": "Wanted to add in some advice from my personal experience if you’re like me, because I can relate to getting caught up in work and then forgetting about others around me. It can take conscious, intentional effort to really pay attention to the important people around you, as stupid as that might sound to some people. Meditating before coming home for a minute to reset your mind could really help.",
                    "score": 173,
                    "replies": []
                },
                {
                    "author": "SophisticatedScreams",
                    "body": "Or OP could call her on his way home from work. Might be a nice moment to connect before the supper rush.",
                    "score": 83,
                    "replies": []
                },
                {
                    "author": "Humble-Network5796",
                    "body": "NTA. I don’t fault him for not asking about her day. She has already called him twice with a report.  What more can she say? \n\nAdded NTA",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Captain-Cannoli",
            "body": "I know it’s barely been an hour but thank you to those who have commented. I’ve been an asshole even though I wasn’t intending to and I’m going to do better for the girl I don’t deserve\n\nEdit: Just an update to the whole thing. We talked after work and we both willingly admitted that there was fault on both sides. I wasn’t making the effort after work to communicate and that resulted in her trying to reach out during work, but she understood why I said what I said about calling during work. We both agreed that we would drop everything when we both get out of work to communicate, not just about work but stuff in general to reinforce the bridge between us.\n\nBoth sides of the argument make great points, although the label “asshole” might be a little intense, but I think it ultimately came down to poor communication which we are going to work on. Thank you all for your help, I might stick around the subreddit to help out or if I have any other issues",
            "score": 575,
            "replies": [
                {
                    "author": "ThrowRA_Cat_stare",
                    "body": "I love this. My kink? Guys who show accountability and growth.\n\n(Don't worry OP I'm not hitting on you, I just think you're awesome)",
                    "score": 66,
                    "replies": []
                },
                {
                    "author": "Livid-Gap-9990",
                    "body": "> I’ve been an asshole even though I wasn’t intending to\n\n??? Almost no one here is calling you the asshole. You did nothing wrong",
                    "score": 15,
                    "replies": [
                        {
                            "author": "CulturalCicada4629",
                            "body": "There were a few early posters calling him one. Then, the normal people started balancing it out with common sense takes.",
                            "score": 128,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "clockstrikes91",
                    "body": "Uhh wtf dude you did nothing wrong. Your fiancee should know better than to interrupt you at work just to shoot the shit, it reflects poorly on you in front of your manager. \n\nShe certainly doesn't need an invitation to repeatedly call you during the day, no reason for her to feel like she does when you're actually free at home.",
                    "score": -29,
                    "replies": []
                }
            ]
        },
        {
            "author": "friendlily",
            "body": "NTA for asking her to not call you at work and you did it in a really kind way.\n\nYTA if you don't start asking about her day. You tell her you care how her day is but you don't actively show that (from her perspective). So she told you exactly how she needs you to show care, and you're acting like you don't want to do that.\n\nShe's telling you what she needs - do it.",
            "score": 836,
            "replies": [
                {
                    "author": "aarongo93",
                    "body": "Why would he need to ask her about her day if she's always calling him at work to talk about it and then some?",
                    "score": 184,
                    "replies": [
                        {
                            "author": "Kitchen-Purple-5061",
                            "body": "Bc he has now set the boundary that he cannot take calls about her day while he is at work. So he needs to find a new time for them to have those conversations.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "mack2mack_",
                            "body": "Literally came to comment this. \n\nNTA",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "Ballbag94",
                            "body": "Maybe she started doing it because he doesn't ask about her day? \n\nThe whys and why nots aren't all that important though. OP said \"please wait until I get home\" and she said \"sure, but please ask me about my day\"  \n\nSeems pretty solved to me",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Tight_Jaguar_3881",
                            "body": "She sounds very needy and not aware of professional behavior.",
                            "score": -11,
                            "replies": []
                        },
                        {
                            "author": "Jcdoco",
                            "body": "I used to have a girlfriend that would call me on her way home from work.  On her way home, to where I was waiting.  Didn't really ever understand why she couldn't just wait 20 minutes to talk to me when she got home, but I guess that's why she's an ex",
                            "score": -134,
                            "replies": [
                                {
                                    "author": "kindof_apocalyptic",
                                    "body": "she had a long day and the first thing she did when she was done was check up on you. thats honestly so sweet imo and you didnt deserve her anyways",
                                    "score": 166,
                                    "replies": [
                                        {
                                            "author": "Douchecase",
                                            "body": "My dad always called my mom to tell her that he was coming home from work, and now that he's retired, he'll still call to tell her that he's coming home from various activities he gets up to. \n\nI've picked his habit up and I always call my boyfriend on the way home from work (he doesn't always pick up because he's usually still at the office, but he picks up when he can, and he knows I'm on the way home by the call notification). He's picking up on the habit as well. \n\nIt's so nice. My boyfriend and I talk to each other all the time anyway, but it's a great way to get the nitty-gritty shit from work out, or to tell each other some funny story from work or wherever before we forget, or just to say that we're thinking of the other and that we love them.",
                                            "score": 62,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lazyycalm",
                                    "body": "Idk why everyone’s downvoting, I would hate this too. People have limited time to themselves and consuming someone’s time when you’re about to see them is inconsiderate. And just shows that the person is so needy they will cling to you literally the second they have the opportunity",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "author": "Jcdoco",
                                            "body": "Thank you!",
                                            "score": -20,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 4999,
            "replies": [
                {
                    "author": "Captain-Cannoli",
                    "body": "Honestly, thank you for not sugar coating it and being brutally honest",
                    "score": 2205,
                    "replies": [
                        {
                            "author": "elgrn1",
                            "body": "If you truly feel the calls during work are inappropriate, that's a reasonable boundary to have. \n\nBut you have to show interest in her and her life outside of working hours if you expect to be in a happy and healthy relationship for the rest of your lives. \n\nShe clearly still wants to connect with you so make the change now and things will be great for you both.",
                            "score": 2015,
                            "replies": [
                                {
                                    "author": "Captain-Cannoli",
                                    "body": "I understand and I’m going to do better. Thank you again, truly",
                                    "score": 206,
                                    "replies": []
                                },
                                {
                                    "author": "LimpSomewhere2479",
                                    "body": "I think most adults know you don’t call someone when they’re at work.",
                                    "score": 675,
                                    "replies": [
                                        {
                                            "author": "AlexCaslavka",
                                            "body": "This happened to my mom long before cellphones were a thing. She had a boyfriend who either didn't work or worked at a job that didn't have a set schedule (not really sure) while she worked a 9-5. He would call her constantly in the middle of the day just to say \"I was thinking about you\" or ask \"What are you doing?\" Um...working? You know this. Stop calling me. Needless to say, that relationship didn't work out, but the story always makes me laugh.",
                                            "score": 28,
                                            "replies": []
                                        },
                                        {
                                            "author": "EffectiveScallion692",
                                            "body": "Everybody calls me at work and even though I can step away to answer the phone, it’s still a job and I wish they’d just respect it. Mostly my mom. I had to take her off priority for DND.",
                                            "score": 85,
                                            "replies": [
                                                {
                                                    "author": "SmileParticular9396",
                                                    "body": "Yeah I get a lot of calls during work especially when people know I’m wfh but also even when I’m in office. I generally don’t answer and say I’ll call you at lunch / after work.",
                                                    "score": 35,
                                                    "replies": [
                                                        {
                                                            "author": "EffectiveScallion692",
                                                            "body": "When I miss the call or dodge it on purpose, they still see it as an opportunity to text me. It’s usually asking me to do something for them. I don’t get why it can’t wait until I get home. It’s never an emergency.",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "SmileParticular9396",
                                                                    "body": "My mother used to text “911” and it was NEVER an emergency.",
                                                                    "score": 12,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Unfair_Finger5531",
                                            "body": "I think many people do call others when they are at work if they know the person has a job that allows them to talk. And OP seems to have that kind of freedom, from his girlfriend’s pov. But I think it’s weird to pretend that people don’t call their partners at work. Especially when you are actually calling their cell phone most of the time.",
                                            "score": 289,
                                            "replies": [
                                                {
                                                    "author": "StillAFelon",
                                                    "body": "But once or twice a day?? Idk, man, seems excessive. Also, personally speaking, why would I ask about your day if you're giving me a play-by-play? I already know what happened. Do we need to re-hash it two or three times just so they feel validated, or am I off the mark here? The original commenter is giving her way more grace than I would because you should only call someone at work if it's actually important. Otherwise, it's time theft. Honestly, what is this thread?",
                                                    "score": 91,
                                                    "replies": [
                                                        {
                                                            "author": "Unfair_Finger5531",
                                                            "body": "I think some people do call one another once or twice a day at work. I guess it depends on your job and your dynamic. If you have that kind of freedom in your job, maybe it’s okay. I don’t think it is uncommon. But OP does not have that kind of freedom, and he doesn’t want this kind of dynamic with his girlfriend. So, it’s not okay in this particular situation. It sounds as if she started calling regularly and OP didn’t put down any boundaries, so she felt it was okay. But honestly, I can also imagine couples who check in once or twice a day during work hours. Again, if that is the dynamic a couple has, so be it. My husband calls me in between classes sometimes to tell me something that could wait, and I text him sometimes to tell him something that could wait. But we are okay with that and our jobs allow this.",
                                                            "score": 38,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Gone_Green2017",
                                                            "body": "My husband and I both call each other multiple times a day while he's working. He's able to do that and wants to. Everyone, and their working environment, is different.",
                                                            "score": 12,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "puppies4prez",
                                                            "body": "Fucked up workplace if you can't take 2 minutes to talk to your partner without it being called time theft.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "worldsaway2024",
                                                    "body": "That is just insane.  A basic part of adulting is to work.  You’re not at work to gab on personal phone calls - at the least it makes someone look less professional.   People can’t go 8 hours without calling to shoot the breeze??? I mean I get it if it’s important stuff like it’s about kids, change in plans, etc but otherwise that’s just nuts calling your partner several times a day at work.",
                                                    "score": 64,
                                                    "replies": [
                                                        {
                                                            "author": "Unfair_Finger5531",
                                                            "body": "> I mean I get it if it’s important stuff like it’s about kids, change in plans, etc but otherwise that’s just nuts calling your partner several times a day at work.\n\nRight. This is calling your partner at work. It happens all the time. People often need to call their partner at work to coordinate things. My point was that people do call their partners at work sometimes. \n\nAnd I’m sure people can and do go 8 hours without talking to their partner. But people also do call their partners at work sometimes, even if it’s just to check-in. This is not abnormal in any job I’ve worked. I think it depends highly on the type of job you have. \n\nI am not suggesting that OP is wrong or his gf is right. I was just saying that plenty of people call their partners at work. When I was a student, I worked in the provost’s office, and he had his wife on the “always disturb” list. She called once or twice a day. My colleagues often check in with their spouses in between classes. My husband calls me sometimes in between classes. It happens.",
                                                            "score": 23,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "MissKitty919",
                                            "body": "I know so many people at work that always seem to be on their phones. I wonder sometimes how they even get any work done. Once in a while, or emergencies, I can understand. But multiple times a day, every day, just to chit chat? I don't get it.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "cdnmtbchick",
                                                    "body": "I work at an assembly plant, most jobs are so repetitive.  I use headphones to listen to books or podcasts.  But some people are on the phone talking ALL day.  Like who are you talking too, and what are you taking about for 7 hrs.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Jaded-Reporter",
                                            "body": "I don’t think it’s weird for adults to call each other at work, especially those in relationships. My husband and I work the same job now, but when we didn’t we’d usually try and schedule 1 break we could take together so we could talk about our days or about any drama or stressors that would be too long to text or tone might get lost over text.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "IdkNotAThrowaway8",
                                                    "body": "Idk why you're getting down voted lol. Some jobs allow you that freedom. My partner currently does delivery driving (much more flexible, especially if you have earbuds so you can be hands-free) and we've settled into a routine now, but he started out calling ME from work on his breaks, even continuing the conversation once he went back to work. Now it's more like a call once a week instead of every shift",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "puppies4prez",
                                            "body": "Ugh I hate this most adults bullshit. Everyone grew up different. What's \"common knowledge\" is never actually common in different societies. Maybe she grew up seeing her mom do this with her dad and thought it was a sweet way for them to connect with each other. It's fine to have this as a boundary, not to call your partner at work, but don't conflate this with being an adult. Everyone has different experiences. Just because something's normal for you doesn't mean it's normal for someone else. Just because someone doesn't have the same exact social cues as you doesn't mean they're not an adult.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "AlecMcDonald3",
                                            "body": "I know three examples in my, laid back office setting, where this is completely false. I have 2 coworkers that talk to their spouse all day everyday because it is allowed.\n\nNTA but please be honest and just tell her you are uncomfortable talking at work and make an effort to ask about her day.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "SilverNightingale",
                                            "body": "You can call someone if they’re on break, or if it’s an emergency that can be handled by a quick phone call if they step out of the vicinity and are not disturbing colleagues.\n\nMaybe your workplace is different though.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "andromache97",
                                    "body": "there's really no mature excuse for her calling him repeatedly at work instead of simply trying to connect with him at home where they live together",
                                    "score": 168,
                                    "replies": [
                                        {
                                            "author": "Full_Committee8867",
                                            "body": "It's possible that she feels that she connects more with him because he answers and actually seems to listen and care about what is going on with her.  She may just be starving for his attention that he isn't showing her at home.  Hopefully OP does better about communicating with her at home.",
                                            "score": 63,
                                            "replies": [
                                                {
                                                    "author": "andromache97",
                                                    "body": "the fact that she only mentioned this problem she has with his lack of communication at home after being asked to stop calling him at work is odd to me. It seems to me the adult thing to do is bring the problem up to my partner BEFORE I begin calling them every day at work. Like, not calling my partner at work unless it’s an emergency is just common sense to me.\n\nY’all are legit infantilizing this woman.\n\nETA: did she even apologize and acknowledge the inconvenience of her calls before deflecting the blame to OP?",
                                                    "score": 90,
                                                    "replies": [
                                                        {
                                                            "author": "YourAddiction",
                                                            "body": "This is the first time she's had any indication from her fiance that calling him at work is an issue. She needs time to process the fact that these conversations that she thought were appropriate ways to connect actually make her partner uncomfortable. Then she can provide a legitimate apology.\n\nShe responded to his statement that he wants to hear about her day at home. That isn't deflecting blame, it's providing additional information that he didn't have before. We know he didn't have it because he's surprised by it.\n\nOn the other hand, he's known this was a problem the entire time, and rather than bring it up in the calm, relaxed environment of their home where he could gently break this news and provide emotional support, he interrupted her while she was telling a story that brought her joy to tell her that these conversations are an inconvenience to him. And he presumably did this within earshot of his boss and/or other coworkers, given his description of his work environment. What a slap in the face. Now she gets to finish her shift likely feeling alienated from her partner and embarrassed, all because he chose not to communicate his problem at a reasonable time and in a reasonable environment. The onus is on him to express himself, not on her to read his mind.",
                                                            "score": 41,
                                                            "replies": [
                                                                {
                                                                    "author": "Jonathan-Strang3",
                                                                    "body": "No one \"needs time to process\" that someone can't/shouldn't take non-emergency calls at work. This is basic common sense.",
                                                                    "score": 22,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "andromache97",
                                                                    "body": "again, imo, all of this is infantilizing a grownass adult woman who should know that interrupting her partner with calls at work is inappropriate. like, it's weird that she assumed that it's ok instead of the opposite.\n\n>and rather than bring it up in the calm, relaxed environment of their home where he could gently break this news and provide emotional support\n\nagain, this is ridiculously infantilizing. imagine needing to comfort your partner like a child because you've very kindly asked them not to call you at work.\n\ni hate to say it, but this is really a post where if the genders were reversed, i think some of these answers would look a lot different.",
                                                                    "score": 59,
                                                                    "replies": [
                                                                        {
                                                                            "author": "YourAddiction",
                                                                            "body": "This rhetoric is permeating this thread for some reason. People seem to be forgetting that not everyone's job is the same. Her job is obviously flexible. OP stated that he works in a relaxed environment, and he hadn't told her previously that the calls were a problem. She didn't know. No one should be expected to read minds when there are channels of communication available.\n\nCaring for you partners emotions is not treating them like a child. Being empathetic and compassionate to the person you intend to spend your life with will build a stronger relationship than pretty much anything else. That doesn't mean coddling them, but it does mean bringing up problems at times where they're most likely to be resolved. Interrupting your happy partner to tell them they're doing something you'd rather they didn't will always create a bigger issue that takes longer to resolve than telling them you'd rather they didn't do that thing at an otherwise relaxed time.\n\nI'd be saying the same things if the roles were reversed, but you're entitled to your opinion.",
                                                                            "score": 30,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Full_Committee8867",
                                                                                    "body": "Not to mention if her calling him at work was really a problem he didn't have to pick up.  He could have texted her saying he will call her back when he has time or talk with her at home.  We are all adults if we don't have time to talk on the phone we communicate that.  The blame doesn't fall solely on OP or their partner they BOTH need to communicate their needs better.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Unfair_Finger5531",
                                                                            "body": "This is not infantilizing. The fact is people do call their partners at work. It is not unusual. She probably calls his cell phone and assumes he can talk because he actually *does* talk to her while he’s at work.\n\n(Edited typo)",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DesperateSmell7342",
                                                                                    "body": "plenty of people do. don’t generalize and assume you speak for everyone.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Unfair_Finger5531",
                                                                                            "body": "Actually, that was a typo. I meant to say plenty of people DO call their partners at work.",
                                                                                            "score": 5,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "SilverNightingale",
                                                                    "body": "*Has* he known this was a problem and something she needs? The post reads that “My GF keeps calling me at work and I feel like this is inappropriate and I didn’t know this was her way of connecting *with me*, but I can’t do this at work.”",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "YourAddiction",
                                                                            "body": "He's known that her calling him at work is a problem for him, yes. That's what my third paragraph is referring to.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SilverNightingale",
                                                    "body": "Okay, maybe she is starving for his attention since she works from home.\n\nShe should bring this up *outside* of work (when he is off work and home) and tells him how she feels and they should, ideally, come to an agreement together.\n\n(This is nothing personal at you, I just get so tired of reading WhatAboutIsms in relationship posts where the people don’t know how to express themselves.)\n\nInstead of her saying “But you never ask me about my day”, she should say “I feel lonely when I work from home, so I call you to talk about my day, let’s schedule a time when you’re at home and I can connect with you. Please ask about my day.”",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Full_Committee8867",
                                                            "body": "We don't have the full story so we can only speculate and when outsiders speculate we tend to project.  We don't know the full story. If he doesn't want to talk with her on the phone at work he could just not answer and text a response saying he will either call her later or talk with her at home.  \n\nIf she wasn't aware he didn't want to talk to her on the phone while at work (maybe because he always answers and has never indicated that he doesn't want to chat) why would she feel she shouldn't call.  \n\nAgain I say OP and their partner need to communicate better.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Successful-Doubt5478",
                                                    "body": "I wager no.\n\nShe could also just be bored or wants to flex to colleagues that she has a great bf.\n\nWork is,work.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Vast-Fortune-1583",
                                    "body": "I'm going to respectfully disagree with you. Any mature adult knows better than to call her bf at work.",
                                    "score": 192,
                                    "replies": []
                                },
                                {
                                    "author": "SophisticatedScreams",
                                    "body": "Also, texting is a thing? Like, don't be on your phone all day, but I suspect this gf would be happy with with a few texts throughout the day",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "Dandelient",
                                            "body": "I'm wondering why she doesn't just text him. He could respond when he's able and it wouldn't be so intrusive.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "SophisticatedScreams",
                                                    "body": "Yeah-- I would be annoyed af about someone calling me in my workday, but if someone has a funny text to send me during my day, I'll be happy about it",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "KillerKane714",
                                                    "body": "1 or 2 calls a day at work from the person you are supposed to love is intrusive ?? what are you smoking ?",
                                                    "score": -5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "stuphgoesboom",
                            "body": "I'd like to add on that by actively asking her how her day went when you get home, you're providing the opening that you're receptive to hearing/talking about it at that time as well. She could be uncertain of when is a good time to talk, just want the continued indication that you're interested, or get caught up in the mundane things like \"what's for dinner\" and feel like her window to talk has been lost.\n\nI personally need to decompress for quite a while when I get home from work and had to set a rule with my husband not to talk to me until I talked to him first so he knew I wouldn't be a snappy mess in response to perfectly normal chatter. I often reopen conversation by asking how his day went even though I won't understand half of it because of the type of work he does.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "kllys",
                            "body": "Honestly, this \"brutally honest take\" is a toxic one. I am more inclined to say ESH. You should have had this conversation with her outside of work. Setting boundaries is important, but she was caught off guard mid fun phone call, from her perspective.\n\n\nHowever, I also do not think it was appropriate for her to immediately blame you for not asking about her day at home. Firstly, if she calls you during the day to tell you stories, why would you need to ask about her day after work?\n\n\nSecond, why can't she just tell you about her day when you're both home? Why does she need you to ask about it? It isn't as if you would ignore her if she started telling you about her day.\n\n\nBut my perspective is also colored by having a toxic ex who also called me daily at work for instant gratification any time she wanted to share or needed to process an emotion, and even after I tried to set boundaries she would guilt me for not talking to her during my work day. ",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "swillshop",
                            "body": "What? NO! You are not an AH for not wanting to talk while you are at work!\n\nYour fiance sees you as her work-break buddy. Her instant gratification when she wants to share with someone. You are not.\n\nYou do listen to her and care about her day. You just don't want to do it WHILE YOU ARE BEING PAID TO WORK.\n\nI've been married 25 years. I've been the worker-bee and the SAHM. I never just 'chatted' with someone during my workday, and I didn't call my husband to just 'chat' about stuff during his workday. Yes, I talk to him some when he is at work, but not just to chat because I assume that my breaks are supposed to be his breaks, too.\n\nPlease talk to your fiance. Ask her to understand that you don't work in private the way she does. You work around other people. You are expected to be working. And even if you have breaks, they don't naturally line up with her breaks.\n\nYou can also tell her that you are happy to ask her about her work day - once you both are home -and spend a little time just sharing your days with each other. You can tell her that you realize you are asking her to make a change to meet your workday needs, but you are also ready to make changes of your own to make clear that you want to hear about her day and you care about what happens in her life.\n\n(I didn't know for sure if you meant that you don't ask her about her day on these phone calls (understandable if you are trying not to prolong the call) or if you don't ask her about her day even at home. I am assuming that you meant even at home. That is definitely something you need to fix.)",
                            "score": 94,
                            "replies": [
                                {
                                    "author": "Sufficient-Candy-835",
                                    "body": "I disagree with the last bit. Why would he have been asking about her day when they're at home, when he already heard all about it why he was at work?\n\nI agree that in the future this dynamic will need to change, but I'm surprised at how many are pointing the finger at OP for not asking, when he's already got all of the details of her day/",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "Kaff-fee",
                                            "body": "It sounded like she started calling him to talk about her day because he doesn't listen/doesn't ask when she does it after work. Maybe I'm reading too much into it and I think he's NTA overall, but he could have communicated better during the last phone call and while they are both home.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TruthImaginary4459",
                                    "body": "Yes, I agree with the work thing\n\nEveryone has needs that are not being fed.\n\n[Try this](https://youtube.com/playlist?list=PLr_oEhRRNKcNVk1dy5JIeRQ1zkWGhBkr5), it's an audiobook about the 5 love languages.\n\nYeah, technically it's quackery, but there's a lot of validity to what you guys are experiencing.\n\nNormally, people get told \"listen to a chapter a night\" or \"listen to one chapter a week\" whatever works for you.  \"Listen to an hour a time is also tolerable.\"\n\nListen to it together and talk about it.  If you have time at the end of a night, or together at some point, carve this out.\n\n\n\nTo end my \"sales pitch\": her love language is something like conversation or quality time, investment in her.  Your love language is something different, acts of service or gifts maybe.  You guys don't have the same love language and she's feeling unheard.  You may be feeling this way too.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "iamatworknowtoo",
                            "body": "I mean, you've heard about her day pretty much all day. She calls you with constant updates.\n\nShe just needed to something.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "AnnaE75",
                            "body": "You are nta but you DO need to make an effort in talking to her after work and asking how her day was and if something funny happend she wants to share with you. You are a bit of ah for not connecting with her when it’s obvious that she needs that connection and communication.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "marcus_frisbee",
                            "body": "Funny I think OP's GF needs advice. OP should tell the GF to fuck off during business hours. This is the behavior of a GF not a fiancé.",
                            "score": -66,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Karydia86",
                    "body": "OP doesn't need to ask because she already told everything in the calls 🙄",
                    "score": 103,
                    "replies": []
                },
                {
                    "author": "CaptainTwinkleNuts23",
                    "body": "She has no problem telling him about her day when they're not at home so why does he NEED to ask when he gets home. Why can't she just tell him about her day like a normal person? He already said he enjoys hearing about her day so why doesn't she just tell him about it when he gets home? My wife and I NEVER ask about each other's days yet we somehow miraculously hear about each other's days every single day. Calling him an AH for not prompting her is ridiculous",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "AngusLynch09",
                    "body": ">She's desperately trying to connect with you and you're rejecting her. \n\n\nShe can do that after work.",
                    "score": 73,
                    "replies": []
                },
                {
                    "author": "FormSuccessful1122",
                    "body": "That’s nonsense. She has no problem interrupting his work day to tell her stories. But she needs to be invited to tell them once they’re at home? BS. She was annoyed he doesn’t want her interrupting him at work and was looking for a way to turn it around and blame him.",
                    "score": 428,
                    "replies": [
                        {
                            "author": "byedangerousbitch",
                            "body": "I probably wouldn't ask about my girlfriend's day if she already called me twice at work to give me a play-by-play either. Like what is there left to ask about?",
                            "score": 442,
                            "replies": [
                                {
                                    "author": "FormSuccessful1122",
                                    "body": "That too!",
                                    "score": 63,
                                    "replies": []
                                },
                                {
                                    "author": "Matchymatching",
                                    "body": "Ding ding ding ding ding! Exactly.",
                                    "score": 40,
                                    "replies": []
                                },
                                {
                                    "author": "TheNightTerror1987",
                                    "body": "I was thinking the same thing.  Of course he doesn't ask, he heard a running commentary of her day?",
                                    "score": 28,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SmileParticular9396",
                            "body": "Agree with this. She sort of manipulated OP a bit by not addressing that calling him at work is pretty inappropriate, and then tried to goad him into feeling bad. Like if she’s calling him multiple times to tell him work stories/highlights of her day it DOES make sense that he won’t really ask about her day when they’re both home.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "shelwood46",
                                    "body": "I dunno, it's telling that he never spoke to her at home, face to face, about this, just waited for another phone call. Their communication seems to suck, ESH",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "FormSuccessful1122",
                                            "body": "Why should he have to? She called and interrupted him. He then asked her to stop. So it’s ok for her to interrupt his work day for nonsense but it’s not ok for him to ask her not to at the same time? WTF?",
                                            "score": 14,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "vaneeelaney",
                    "body": "Communication needs balance. Set work boundaries kindly, but actually ask about her day at home. Win-win!",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "SignificantMatter771",
                    "body": "Nope,  nope and nope.... her stories can wait. She's going to cost him her job. IF he's not asking and giving her the due time when together, than he's absolutely the AH.  BUT if she's already getting that and shes still calling.. she's def in the wrong and needs to chill. That's just needy",
                    "score": 164,
                    "replies": []
                },
                {
                    "author": "OkTaste7068",
                    "body": "one thing to consider is... why would he ask about her day if she already told him all about it during the day?\n\nmaybe if she stopped calling him at work, he'd ask when he gets home instead?",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Sohailian",
                    "body": "I have to ask ... do you hate the OP b/c presumably OP is a man?  This is such a bizarre take.  Why does the GF think it's ok to connect with someone during work time?  Why can't the GF wait until after work to connect?",
                    "score": 114,
                    "replies": []
                },
                {
                    "author": "DistinctNewspaper791",
                    "body": "I mean, if she is calling at least once a day to talk about it then whats there to ask? But yeah communicate more at home so she doesn'T call you",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Specific_Will8648",
                    "body": "This is not all on OP. Don’t call anyone out of their damn job to chitchat. WTF? What did she 12?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "pbblankgirl",
                    "body": ">Eventually she'll stop talking to you all together and you'll be one of those idiots coming to reddit to ask why your once chatty fiancé doesn't speak to you about her life and seems miserable all the time. \n\nThis is so unnecessary. Why are you going in on someone looking for help?",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Jake613",
                    "body": "Yeah, I’m reminded of that Billy Joel song “Tell Her About It”",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "CaptainTwinkleNuts23",
                    "body": "This is my most hated top comment I've ever seen on reddit. You just seem like you're most likely a man hater. Your comment makes no sense with the context OP gave.",
                    "score": -7,
                    "replies": []
                },
                {
                    "author": "Free-Pound-6139",
                    "body": "But I go straight on my ps5 when I get home.",
                    "score": -7,
                    "replies": []
                },
                {
                    "author": "KathyKatKathleen",
                    "body": "I don't have to respond to his post I love what your response 👏",
                    "score": -28,
                    "replies": []
                }
            ]
        },
        {
            "author": "OverKookie_Crumble",
            "body": "NTA\n\nI am curious about the comment she made about you not asking her about her day.\n\nDo you not ask her, because you feel like you already know how her day went, since she calls you in the middle of work?\n\nIf so, I can understand. However now that you’ve expressed those mid shift calls makes you uncomfortable, you should definitely start asking her, and being more attentive.\n\nYou don’t want it to get to a point where she stops talking to you all together, and doesn’t feel like she can be open and expressive with you",
            "score": 44,
            "replies": []
        },
        {
            "author": "Own_Opinion_446",
            "body": "NTA but you need to ask her about her day more often. You saying \"I dont mind hearing it\" dont really matter to be honest. If you love hearing it ask for it every single time. \nYall will go through this, this is a minor issue.",
            "score": 169,
            "replies": []
        },
        {
            "author": "gringaellie",
            "body": "NTA but you need to start asking her about her day when you get home.",
            "score": 83,
            "replies": []
        },
        {
            "author": "Dicecatt",
            "body": "NTA. Why would you ask her about her day later if she already called you and told you multiple times? Maybe as a compromise you could suggest she text first to see if you're free to chat.",
            "score": 48,
            "replies": []
        },
        {
            "author": "Basic_Lynx4902",
            "body": "NTA. Why would you ask about her day? She calls you anytime anything happens! \n\nMy partner will go on a work trip for two weeks and call me maybe once or twice. At first I was a bit put out, but now I've realized that I hate talking on the phone. Thanks, honey!",
            "score": 64,
            "replies": []
        },
        {
            "author": "Blackh3t",
            "body": "NTA. My wife works from home as well and calls multiple times a day and on my commute home(30 minutes). Anytime something happens or bothers her she calls. I spend at least 1-2hours of my day on the phone with her. When I sound uninterested she gets upset. She then will say we don't talk alot in the evening. No shit we have been talking all day there is nothing to tell me about at this point. You don't want to here about the details of my day because you find it boring. You want the 10 second version with no details, but I need to hear about yours with excruciating detail.",
            "score": 10,
            "replies": []
        },
        {
            "author": "SavingsRhubarb8746",
            "body": "NTA. It is really not appropriate to have random personal calls at work, or to make them to someone at work (barring an emergency like someone dying or rushed to hospital). She can tell you her stories when you are both home - and it wouldn't hurt if you asked her when you get home how her day went.",
            "score": 16,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy fiancé calls me at least once sometimes twice during the workday. She works from home at a call center and will call me either during her break or after something like work drama happens. I enjoy talking with her and love it when she tells me about her day, but I'm at work and am in a small office with what is essentially my manager. Granted, where I work is a small non-profit and pretty laid back, but I feel weird being on the phone just shooting the breeze next to what is essentially my boss. \n\nShe just called me again to tell me about something funny that happened at work and she was laughing the entire time she was telling me the story. I figured I needed to put this to bed, so I told her that I love hearing about her day, but I am at work and I would rather hear it from her in person, at home, after work. I asked her if that makes sense and she said yeah, but you never ask me about my day anyway. I honestly didn't know what to say because she is right, I don't verbally ask her how her day is but I've said in the past that I love nothing more than to hear about her day even if it was shitty\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 3,
            "replies": []
        },
        {
            "author": "NooOfTheNah",
            "body": "Calling someone to chat whilst at work isn't good. It should be for emergencies or REALLY important stuff. Save it for after work. I used to date a guy who called me every break he had... Mid morning, lunch, afternoon smoke break and then texted in between. Didn't matter how many times I asked him not to because it pissed off my colleagues. Eventually I just ended it because grown ups respect that if you have a job where calls are frowned on then they shouldn't keep pestering you to risk getting you in trouble. It's not high school. Surely she can exist without clinging to you for several hours.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Freydis34",
            "body": "Why wouldn’t you just not answer the phone, though? If I call someone and they pick up, I assume they’re free to talk. I don’t understand people who pick up and then say they’re busy. If there’s an emergency, she’ll say it in a text as well as call.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Platypus_Neither",
            "body": "Why would you ask her about her day when you already know everything before you get home because she is constantly calling you at work? Seems like she didn't bother to think about that before trying to guilt you.\n\n\nNTA.",
            "score": 37,
            "replies": []
        },
        {
            "author": "cosmicdancer84",
            "body": "INFO- Can you call her during your lunch break? Maybe ask her about the rest of her day when you get home?",
            "score": 16,
            "replies": []
        },
        {
            "author": "Vast-Fortune-1583",
            "body": "NTAH The gf sounds weird. Any grown person knows you don't call people at their job to shoot the breeze. This is not OP's fault. Are we all so fragile that unless our partner specifically asks: how was your day? We go to pieces? We can't just start a conversation like: Hey, guess what happened at work today. Sorry, anyone blaming OP for his gf's lack of realizing this is just wrong is just off base.",
            "score": 18,
            "replies": [
                {
                    "author": "Ok_Variation9430",
                    "body": "Idk, some people when they get home kind of check out or do their own thing. OP has admitted to not making an effort to connect after work. \n\nIf that’s the situation, I can see how the gf was trying to connect in other ways.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Vast-Fortune-1583",
                            "body": "He doesn't connect because she's already called him a couple of times at work to give him a blow by blow of what's happening. I stand by what I said.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Ok_Variation9430",
                                    "body": "Fortunately OP views it differently.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Vast-Fortune-1583",
                                            "body": "He clearly stated he'd love to hear about her day at home. So how's the view different. He doesn't want to be called at work.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MaxFourr",
                            "body": "i check out/do my own thing for a bit when i get home sometimes bc i need to decompress from the stress of work. that doesn't mean that my partner can't approach me or start a conversation about their day after a few minutes, i'll ask them after a short period of rest when im ready, but i'm certainly not going to ask them in that decompressing time. nor would i ask if i heard it play-by-play through the day bc i don't need to hear it twice. i also really dislike having to ask EVERY single day (i don't mind asking most days!!). it feels forced to me and i'd also appreciate having conversation start more naturally/fluidly if that makes sense.\n\nzero issues with texting, text away! i can read stuff on breaks or down time at work or later on when we're together and i can ask questions about it to get her to explain more and it's fun!\n\nthe idea of making it an every day thing to chat on all my breaks or throughout my lunch is also terrible to me tbh. i work a very social-oriented job, some days i just need everything and everyone to shut up and i need some quiet time or just wanna watch videos on my phone to relax and don't have much in the social battery to chat with people beyond maybe a text. i wouldn't want to set the precedent that my breaks are hers and come off like an asshole when i simply just don't want to talk to anyone at that moment, not just her! but i always take time at the end of the day to ask or hear her out.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ok_Variation9430",
                                    "body": "The key is communication! If he lets her know that he needs the decompression time and then he’s happy to talk later, that would solve a lot of issues. She might’ve tried to talk during that time and gotten shut down, and then not tried again. \n\nAnd I’m with you on the texting; I’d much prefer that to phone calls while I’m working, as long as the texter understands that I’d reply when available and not necessarily immediately.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zestyclose_Public_47",
            "body": "NTA for not wanting her to call you at work if it's not an emergency. But she's obviously trying to connect with you and you're not meeting her halfway",
            "score": 15,
            "replies": []
        },
        {
            "author": "Tortietude0",
            "body": "NTA. And i don’t get how she thinks you not asking her about her day means she needs to call you at work to tell you about her day. Why doesn’t she just tell you when you get home?",
            "score": 10,
            "replies": []
        },
        {
            "author": "damaya0351",
            "body": "NTA",
            "score": 4,
            "replies": []
        },
        {
            "author": "Ok-Memory9085",
            "body": "Start asking her about her day after work please make it a habit",
            "score": 7,
            "replies": []
        },
        {
            "author": "pumpkaboo111",
            "body": "How do you ask someone about their day when all they do is bombard you with calls about every single update in their day. NTA people don’t realize how draining that is when you’re trying to get work done",
            "score": 2,
            "replies": []
        },
        {
            "author": "Motor_Dark6406",
            "body": "NTA, As someone who has worked in a call center before, she is basically having you fill in for the co-workers she would normally vent to because she works from home. the call center job requires a purge haha, but that shouldn't be your role.",
            "score": 2,
            "replies": []
        },
        {
            "author": "newoldm",
            "body": "Here's a question for you:  why are you answering your phone at work?",
            "score": 2,
            "replies": []
        },
        {
            "author": "IHaveNoUsernameSorry",
            "body": "NTA. If the shoe was on the other foot, and you constantly called your fiancé to chat about your workplace, I’m pretty sure her boss would pick up on the fact that she’s not answering work calls.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ElGato6666",
            "body": "You are not obligated to answer your phone when it rings. You are not obligated to bag your own groceries just because you bring your own bags to the store.  You are not obligated to return a text message within 10 seconds.",
            "score": 9,
            "replies": []
        },
        {
            "author": "glassfury",
            "body": "NTA\n\nI'm boggled by these top responses. whether or not you guys talk about your day or the quality of your conversation is at home, there is no reason to take up your partner's work time. It's unprofessional and unnecessary. Also, speaking as an introvert, NO ONE has that much to say that's that important and interesting for hours that can't wait til later. \n\nMy general rule is there's an inverse relationship between how much people have to say vs. how interesting or important it actually is.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Princesshannon2002",
            "body": "Why would you need to ask about her day when she already calls you twice to tell you about it?  What would be the point?  How many times will you need to hear the same series of events retold to make it meaningful?  \n\nI’ve never understood assigning so much meaning to asking someone a rote question about meaningless events.  A work day is…work.  Recounting a timeline isn’t meaningful conversation.  I don’t get the emphasis placed on that.\n\nNTA.",
            "score": 10,
            "replies": [
                {
                    "author": "so_much_boredom",
                    "body": "It’s about talking with someone you are supposed to like.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Princesshannon2002",
                            "body": "So talk about something other than rote work tasks. Talk about something that energizes an invigorates both of you! If something exciting happened at work, then share it. I just think that time is better spent actually talking to your partner rather than recounting a days worth of work tasks. One is talking to someone and the other is talking at someone. It’s the difference between quality and quantity.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "svenson_26",
            "body": "NAH - I see your perspective. If it would really mean that much to her to call you during the day, then as a compromise you should try to schedule a call with her on your break.  You can step out for a few minutes to take the call if you feel awkward fielding a call while at your work station.",
            "score": 4,
            "replies": []
        },
        {
            "author": "marcus_frisbee",
            "body": "Dang man I feel sorry for you. My wife, then girlfriend, learned it was wrong to call the other at work when we were about 18, we are now 60. There isn't a thing that can't wait until they see you at home.",
            "score": 5,
            "replies": []
        },
        {
            "author": "waluigiwaaaah",
            "body": "Interesting that you chose a time when she was laughing the entire call to tell her not to call you at work. Why not tell her when you're both at home?",
            "score": 2,
            "replies": []
        },
        {
            "author": "GloomyIce8520",
            "body": "NTA - if she needs to tell you right now, she can text you. It's not an emergency. \n\nBut also, are you able to sometimes take a break when she does so she can have that call AND you don't feel weird?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NexusNerd12",
            "body": "Tell her to text instead bro it's not hard",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent_Net_261",
            "body": "NTA, you explained very politely that you like to hear from her but you are at work and that means you can’t always be on the phone, also if she’s calling all day to fill you in on things that have happened then you probably don’t assume to ask about her day because she’s involved you in it already. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "AngusLynch09",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "EffectiveScallion692",
            "body": "NTA, but now you know to ask. Also, if that’s the case, she still tells you about her day unprovoked when you’re at work, so she very well could’ve done so at home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Candid-Ad-3694",
            "body": "NTA. You also don’t have to ask her about her day, because she tells you before you get home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NalaIDGAF20",
            "body": "NTA for wanting to have these conversations after work. However, your fiance is trying to connect with you. She can't read your mind and see that you love hearing about your day. Show her that you do by asking her to tell you about her day. And if she asks you about your day, don't just say it was good, but share something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Double_Complaint_900",
            "body": "NAH 100%\n\nThese are two different issues.\n1. Stopping calls during work time.\n2. Verbally asking how her day was.\n\n1. she needs to respect OP's boundaries. Calls in work time are not OK once OP has voiced their concerns.  \n\n2. Has she actually mentioned previously that this is an issue? I know I wouldn't be asking someone how their day was if they had called me repeatedly all day.  Why would I? I already know! \n\nNow you know and can ask. You are in no way an AH, I'm assuming here... but you ate not a mind reader and didn't know there was a problem? \n\nYou would only become one if after requesting the work time calls to cease you now didn't ask about each other's days. But OP, it's not 100% on you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Own_Plastic1201",
            "body": "If you aren't verbally expressive, send her a text as you leave work saying you're on your way home and would love to know how her day was, when you get there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_Ariyeh",
            "body": "NTA. It is about boundaries at certain times of a given day. Ask her to text you at work instead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "originalkelly88",
            "body": "NTA. We have a rule that works for us - we can text all we want knowing the other will respond when we can. We do NOT call while the other is at work unless it's an emergency. \n\nYou need to address the real issue here and it's that you're not communicating with her outside of work enough. She's calling you because it's the only time she feels she can get your attention. So do better and talk to her outside of work. And lay down the rules for when you are at work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sticky_sweet962",
            "body": "NTA calling at work to tell you about a random story is unprofessional. She can wait till you get home to tell you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaptainTwinkleNuts23",
            "body": "NTA. You are not obligated to talk to her while you are on the clock in front of your coworkers. Obviously she wants to talk to you more but that top comment about how she is starved for attention blah blah blah. If she wants to tell you about her day then she can tell you about your day when she gets home. You don't NEED to ask. When she is talking about her day though you need to listen and it seems like you don't have a problem with that. Listening is how you show you care. Not by asking about their day. I never asked my wife about her day and she never asked me about mine, but we talk about what happened anyway without that dumb little prompt",
            "score": 1,
            "replies": []
        },
        {
            "author": "cheesyechidna",
            "body": "INFO: can't y'all like, text instead?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrostingPowerful5461",
            "body": "NTA. Work mode is work mode. Unless it’s an emergency.",
            "score": 1,
            "replies": []
        },
        {
            "author": "curlyben",
            "body": "Just wear an earpiece and when she calls say \"sorry I can't talk right now \\*audible wink\\*\" and let her do the talking",
            "score": 1,
            "replies": []
        },
        {
            "author": "lemothelemon",
            "body": "Why would you ask when you hear about it as it happens during the day?",
            "score": 1,
            "replies": []
        },
        {
            "author": "zeno_22",
            "body": "NTA for the situation and asking her to not call you \n\nY T A for never asking her about her day because you just never think of it. If you had said something like, \"I never ask about her day, because she tells me all about it when she calls\" I would have given you a pass (even then you should still ask though because something could have happened with her day after she called you)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Working-Bench-1751",
            "body": "why would OP need to ask her how her day was when they get home?\n\nshe already called once or twice to tell him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shimpy2",
            "body": "NTA and make it a point to ask her about her day when you get home. She's told you that's what she needs, you've told her what you need, good communication, now each do your part to honor it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wayward_painter",
            "body": "ESH you ask her how her day is when you get home, like a partner who gives a shit. And she doesn't call you at work, like a partner who respects your job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Admirable_Let_4197",
            "body": "I’d say you’re NTA for asking her not to call you at work but it sounds like your fiancé feels a little neglected. I’d probably try to make more of an effort to ask about her day at home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wgilrq",
            "body": "If your job uses slack, create a boring sounding slack and get your fiancee in it. That way she can be more low key and asynchronous about her day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "First-Industry4762",
            "body": "NTA while you should ask her about her day from now on, I find it a weird leap of her to take it to mean that she should be calling you at work instead. \n\n\nNot asking about her day equals permission to call twice a day at work for chitchat and gossip? Unless you literally sit with your headphones on at home why she wouldnt just tell you then. Also what if someone at her job overhears her gossiping/talking about colleagues? I think this is weird behavior.",
            "score": 1,
            "replies": []
        },
        {
            "author": "forte6320",
            "body": "I would never call my spouse at work unless it was an emergency. He's working!! I barely text him during the day. Even those tend to be only things that can't wait until dinner time. \n\nVery rude of her to interrupt your work day with idle chatter. \n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-Competition8210",
            "body": "NTA unless it is a dire emergency there is no need to disturb your loved one at work. My suggestion to you: put your phone on do not disturb.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OrallyObsessed8",
            "body": "NAH unless you too fail to change. If you want to separate casual conversations from your work day then you need to initiate them when you’re not working.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Putrid_Performer2509",
            "body": "NAH. It honestly just sounds like you need to both communicate better. So get off Reddit and talk to her. Tell her that, while you don't directly ask about her day, you enjoy listening to her tell her stories but feel it's more appropriate to do that in person after work, and ask how she feels/what can be done to help that situation. Just like, talk to each other about it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sizzlinsunshine",
            "body": "Omg NTA. You probably don’t ask her about her day because she’s calling you all day to tell you about it. Who tf calls anymore, and especially at work?",
            "score": 1,
            "replies": []
        },
        {
            "author": "WildBlue2525Potato",
            "body": "I seldom called my husband at work and vice versa. We would catch up after work most of the time. Occasionally , we needed to call one another during work hours but not often. \n\nAfter all, we were paid to work, not to be taking personal phone calls. And that's why I try not to have any personal calls during work time. \n\nWhen I was a supervisor, however, I did make exceptions for parents of latch key kids. The cost of daycare, even if just after school, was staggering. (This was many years ago and I understand it's even worse now. Sigh.) So, they basically got Carte Blanche; however, it wasn't ever abused. I felt compassion for them because it had to be tough raing their children by phone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sorry_I_Guess",
            "body": "\\*fiancée. \n\nA \"fiancé\" is, by definition, a man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Micro_Bitt",
            "body": "NTA - to not hurt her feelings, I’d blame it on the boss or coworkers saying they’re calling you out for spending work time on personal calls.  Personal calls during work hours should be reserved for one off, urgent situations.  Plus, it’ll make dinner time more enjoyable to share your stories of the day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Buddha176",
            "body": "YTA only slightly. You say you don’t have a strict office and it’s pretty relaxed….. I don’t know anyone that goes all day without breaks or shooting the shit with coworkers. \n\nYou don’t sound like you don’t enjoy the conversation you just sound like you’re paranoid about your boss…. That’s why it’s a YTA situation. Now if she was calling too much or maybe you just said can we limit it to 1 a day or a specific time or at break then I would agree with you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WxlkingDisxst3r",
            "body": "Okay! Compromise time! She stops calling and you express interest in her day so she doesn’t feel the need to tell you immediately. Sounds like she’s just trying to find a way to connect with you. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoingElephant82",
            "body": "It's hard to ask someone about their day, if they tell you about their day after every single instance in real time.\n\nBecause why would you ask about it if someone already told you everything about it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlaxFox",
            "body": "NTA - Why would you ever need to ask her about her day when she calls to tell you as soon as something happens? You can start asking now that you've established a boundary and she's set that as an expectation, but it's stupid to ask about someone's day if you already know everything that went down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pzykotom74",
            "body": "NTA, but you should apologize for not asking her about her day more often. It should be what you talk about as you prepare dinner or sit down to eat. You love to hear about her day and I can tell you from first hand experience when it's gone it sucks. Me and my wife would always talk about the dumb stuff we encountered at work. Even when she was ill and not working just talking to her about my day was good, but now that she is gone I miss that. Please don't forget to ask her everyday and just enjoy the time. Good luck and please update",
            "score": 1,
            "replies": []
        },
        {
            "author": "pink_soaps26",
            "body": "I was dating somebody for a couple months, it was still a newer relationship and his job requires him to be on the phone a lot. Around the holidays we were both in separate towns and I wanted to call him to ask about his holidays and how it was going, we had a nice chat but before hanging up he said “btw this is a one time thing, don’t expect for us to talk on the phone all the time it’s super annoying” I was taken aback. I brought it up later and he got really defensive saying he was just really honest and he doesn’t want me to expect that type of thing because he’s not going to change. The logic behind not liking phone calls is fine and he was being honest which I appreciate but I told him it made me feel weird and kind of sad that he didn’t want to talk to the person he’s dating. Work is definitely a boundary where you can’t be distracted but honestly she’s probably just excited or bored and wants to talk to her favorite person. Don’t be mean but you also don’t have to keep answering, just say you’re busy and you’d love to talk after work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tarahlynn",
            "body": "NTA It doesn't sound like she's ever given you the chance to ask about her day. She's literally calling you to tell you about it live as it happens. IMO the rule is this: If its not an emergency there is absolutely no justification for calling anyone at school or work. PERIOD. Its rude, disrespectful and frankly really ridiculous. I don't know how old your gf is but that's a rule most people should know before they hit adulthood.\n\nI would say though, it would have been better to tell her in person that night or, even better, just suddenly start getting real busy at work that you can't take her calls.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dante2377",
            "body": "NTA for not wanting this.  I'd just stop answering.  text her back, \"hey on the phone\" or \"boss chatting with me\".  \n\nI can see why you don't ask her about it at home since you're already getting the scoop in real time, but if you stop answering, then you definitely need to chat about her day at home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Matchymatching",
            "body": "Why would you ask her about her day, when she's already called twice in real time to discuss it? There's no need, you already know about her day. \n\nThat was my first thought. \n\nTell her it's lovely and you enjoy it, but you're starting to look unprofessional in front of your boss and think you need to hear it all off the clock. Then, you know, fookin' ask her about it and show you're interested to close that loop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "saccharinekitty",
            "body": "Nta for this specifically but I do think maybe you should put some effort into asking about her day after work and maybe just have a more in depth boundary discussion at home too. Its normal and fine to not feel comfortable with the work calls, you just have to make sure you are still giving her a good chance to talk about her day and i think showing some interest would go a long way as far as \"so what happened with so and so at work today?\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Preparation_3069",
            "body": "NTA I think it's fine to set a boundary here if it isn't suitable to chat on the phone at work. I do think that she is trying to connect with you, and you will have to hold up your end of that connection if you wish to keep the relationship going. I have had work situations where I could accept calls daily, and some where I really couldn't. I think the way you presented the situation is what is important, since she obviously didnt realize prior to this conversation that it was awkward for you. You could either set a time when you take a break to check in with each other, or you could just connect at home.  Clearly she wants to talk to you, and is thinking about you during the day. You now know that it would mean a lot to her if you just asked how her day was.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agostointhesun",
            "body": "NTA - If she keeps calling you, she's going to get you fired. Why can't she wait and tell you her stories after work? Or just call during YOUR lunch break? \n\nINFO: Has she ever worked in a non-remote position? If she has always worked remotely, she might not understand how disturbing her calls are.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Professional-Cry-339",
            "body": "NTA I am guilty of not asking about how someone's s day is or promoting conversations like that. I just feel that most of the time they are going to tell me anyways so why should I ask. I don't do it to be rude.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HopeAndGracePens",
            "body": "NTA. Adults know work time is work time, urgent matters aside. Not saying this is OP's situation, but my live in gf used to call me at work even after repeatedly telling her not to. Later realized she was just making sure I was not about to come home and bust her with whoever she was screwing that day. A friend finally told me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bjorkenstocks",
            "body": "NTA.\n\nShe's fine calling you in the middle of the workday to tell you these stories. There is no reason she needs you to personally tease them out of her after work by asking about her day. That is misdirection.\n\nThe problem is that your girlfriend craves *coworkers* - someone to talk to during the workday. Some people are not built for WFH, and she's one of them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sea_Department_1348",
            "body": "This is not a battle you are going to win.  Not to say you are wrong.  Call her during your lunch break.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IceBlue",
            "body": "Ask her about her day then. Problem solved.",
            "score": 0,
            "replies": []
        },
        {
            "author": "sketchanimal",
            "body": "Gentle YTA, but not because you set boundaries about her not calling at work. I always ask my fiance about his day when I get home, even if I'm beat and I don't really want to talk, because I know he appreciates it and it shows that I care. The same way I frequently say \"I love you\" even though he obviously knows I love him. I agree with a few other Redditors- I think she's trying to find new ways to connect with you... But I think you both may benefit from a sit-down conversation to establish expectations or something. I am always a proponent of having conversations to make sure everyone is on the same page in a relationship vs hearing occasional feedback from the other person.\n\nEdit: glad y'all talked it out and you are taking the constructive criticism. :)",
            "score": -1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -2,
            "replies": [
                {
                    "author": "Captain-Cannoli",
                    "body": "Yeah there was this whole this that happened during a meeting",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "sab222",
                    "body": "Her boyfriend told her a funny joke",
                    "score": -17,
                    "replies": []
                }
            ]
        },
        {
            "author": "HelpfulAfternoon7295",
            "body": "Yta because you never ask her about her day. Even my children live to say to us how was your day....it's a family thing people do for those they love. We ask how their day was. ",
            "score": -7,
            "replies": [
                {
                    "author": "aarongo93",
                    "body": "Why would he need to ask her if she calls him to tell him about it? I'm sure you're not calling your children during school/working hours to tell them about it",
                    "score": 7,
                    "replies": [
                        {
                            "author": "HelpfulAfternoon7295",
                            "body": "My children are not my life partners. If something interesting happens at work I do message my husband sometimes. Regardless of messages or lunch time cals that we do, we still ask each other how was your day. Because we care. So sorry you have no one who cares about you. Hope you find a good relationship. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PerspectiveWhore3879",
            "body": "Cool, just always ask her about her day from now on. Easy peasy, problem solved! NAH",
            "score": -1,
            "replies": []
        },
        {
            "author": "Simple_Lavishness460",
            "body": "YTA. Honestly, you need to take an active interest in what happens during her day. Maybe set aside 20 minutes after you get home to just sit down with each other and talk about your days.",
            "score": -10,
            "replies": [
                {
                    "author": "KiratheCat",
                    "body": "Why ask when she's already told OP everything about her day *during* the day? Like what is there left to ask about if OP gets a call every time something happened? What is he even supposed to ask? \"What'd you do in the however long it took for me to get from work to home?\" She's literally creating a reason for him to not ask about her day by giving him a play by play every time something happens. Its literally cause and effect.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "acee_0916",
            "body": "lol people aren’t getting it. “Why would you ask her about her day if she already calls you?” His GF calls him at work BECAUSE he doesn’t ask her about her day. She does it because she’s trying to communicate with him since he’s shown he doesn’t do it at home… OP, glad you two communicated and saw both sides!",
            "score": 0,
            "replies": [
                {
                    "author": "Lachiko",
                    "body": "he doesn't ask her about her day during work and that didn't stop her from calling and telling him, she could do the same after work.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "acee_0916",
                            "body": "OP mentioned that he’s disinterested in talking to her after work. We don’t know if that prompted her to call him during his work day. I’m not saying her calling is ok, but there’s obviously a reason she started doing it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AsparagusOverall8454",
            "body": "Bruh. All she’s asking is for you to talk to her. Which you admit you don’t do.\n\nSo do that.",
            "score": -13,
            "replies": [
                {
                    "author": "None",
                    "body": "That's not all she's doing, she's also calling him twice a day at work.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "whatiflee",
            "body": "YTA. your girlfriend is obviously trying to connect with you because you’re not trying with her.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Kooky-Situation3059",
            "body": "YTA\n\nI was expecting all day hassling, continue this attitude and she might become your ex.\n\nMaybe consider texting.",
            "score": -6,
            "replies": []
        },
        {
            "author": "NotTheReal16",
            "body": "Idk how this is bad. Bro just keep doing you king. You did the right move in this situation",
            "score": -1,
            "replies": []
        },
        {
            "author": "costolisk",
            "body": "Just pull up them pants and start asking her about her day after work. Problem solved",
            "score": -1,
            "replies": []
        },
        {
            "author": "so_much_boredom",
            "body": "My long term boyfriend at the time told me “you don’t have to call me every day” and it broke my heart. I really liked talking to him for a minute or two. Things went downhill after that.",
            "score": -1,
            "replies": []
        },
        {
            "author": "RoastShop",
            "body": "Is it an American thing not to call your significant other at work? Everywhere I’ve worked my colleagues have rung or answered calls from their partners most days of the week, usually they can walk off to have a conversation and come back five minutes later.",
            "score": -1,
            "replies": []
        },
        {
            "author": "UnusualCoconuts",
            "body": "What a Fboy AH.  Only child or youngest OP?",
            "score": -1,
            "replies": []
        },
        {
            "author": "Economy_Vegetable_24",
            "body": "I would say that you are both AHs, you and yout fiancé.\n\nShe on one hand is disturbing you while you are working and crossing your boudndary.\n\nYou on the other hand don't show her that you like talking to her after work. Saying it one time in the past is simply not enough.\n\nSolution? A deep conversation to talk about all of this and learn from your mistakes, simple key to healthy long lasting relationships. Wish you the best to you both!",
            "score": -1,
            "replies": []
        },
        {
            "author": "SockPirateKnits",
            "body": "I mean, I understand not wanting to take personal calls at work. That's sort of unprofessional.\n\nBut make an effort to ask her about her day at home. Do it verbally, every day. Listen. Then, tell her about *your* day. It's good to establish that habit of give and take, and she'll *really* appreciate you asking her, *in words*, how her day was.\n\nNAH? But do better.",
            "score": -1,
            "replies": []
        },
        {
            "author": "KillerKane714",
            "body": "Dude you are working at a non profit, stop pretending like you are curing cancer. Ask her about her damn day. Dont be these idiots in the comments who dont take calls during theirs jobs. Dont live to work mate",
            "score": -1,
            "replies": []
        },
        {
            "author": "PTLTYJWLYSMGBYAKYIJN",
            "body": "YTAH YTAH YTAH and you don’t deserve a woman in your life. Men like you are awful.",
            "score": -1,
            "replies": []
        },
        {
            "author": "1568314",
            "body": "YTA That's a conversation for at home. \"Hey I've been feeling uncomfortable about how much I'm on the phone at work next to my boss. I think it's best if you don't call unless it's my lunch break.\"\n\nBut we can all tell, just like her, that the real issue is you simply don't like hearing her talk.",
            "score": -1,
            "replies": []
        },
        {
            "author": "R4eth",
            "body": "YTA. You set a reasonable boundry. It's super inappropriate to call your so at work for a non emergency. However, what makes you an ah is because she's only doing that to freakn talk to you. So, here's a small compromise: my wife and I both work. We keep our phones on us, on silent. When we have a min, we'll text each other throughout the day to check in, *with no expectation of an immediate response*. When we're on break or lunch, we'll have a full on convo, outside of that, it's expected that there will be no response because we're freaking working. When we get home, we catch up in person while playing with our 1yo and making dinner.",
            "score": -6,
            "replies": []
        },
        {
            "author": "CapoExplains",
            "body": "Soft YTA. I get where your wife is coming from, because WFH means a lack of the socialization you normally get in the workplace and that can be tough, so she's reaching out to you for it. At the same time, totally fair for you to want to save that for after the workday because you need to focus on *your* job, both professionally and socially.\n\nThe soft YTA comes in because maybe she wouldn't feel the need to call you at work if you talked to her about her day when she came home. Like I was much more on your side up until that point but you can't just say \"Can't we just save this for when I get home\" but then not actually do it when you get home.",
            "score": -11,
            "replies": []
        },
        {
            "author": "Particular-Way8018",
            "body": "Unless you are in the middle of saving someone's life your whole day, one call a day won't destroy your work ethics or productivity. She is trying to share her day with you, be lucky about that. Or one day you'll wake up and you unknowingly pushed her away because you did not have time to listen to her talking about her day.",
            "score": -6,
            "replies": []
        },
        {
            "author": "Centrist808",
            "body": "No!!!!!!!",
            "score": -2,
            "replies": []
        },
        {
            "author": "Good_Narwhal_420",
            "body": "STOP ANSWERING THE PHONE? like you have COMPLETE control of this situation💀",
            "score": -2,
            "replies": []
        },
        {
            "author": "joysaved",
            "body": "Your wife wants you to show interest in her life",
            "score": -1,
            "replies": []
        },
        {
            "author": "Extension_Climate471",
            "body": "ESH.  Op for not taking more of an interest in your partner.  The partner for constantly calling you at your workplace.  Not only is it not professional, you answering all the time could be considered time theft.  I didn't care how laid back your workplace is,  it's a fireable offense.",
            "score": -4,
            "replies": []
        }
    ]
}