{
    "title": "AITA for refusing to give up my college fund to help my parent with their debt?",
    "author": "yosuw",
    "subreddit": "AmItheAsshole",
    "rank": 2,
    "score": 2624,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 432,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1jdzzfq/aita_for_refusing_to_give_up_my_college_fund_to/",
    "id": "1jdzzfq",
    "selftext": "I just started college this year. ever since i was little, my grandparents set up a college fund for me, and it’s the only reason i can afford school without taking on massive debt. my parents always knew about it, and it was always meant for my education.\n\nrecently, my parents have been struggling financially due to bad investments and overspending. They sat me down and asked me to use my college fund to help them pay off their debts. they said that since they raised me, it’s only fair that i help them now that they’re struggling.\n\ni said no. i told them i was grateful for everything they’ve done, but this money was specifically for my education, and i wasn’t going to throw away my future. they got upset and said i was being selfish and ungrateful. my mom even cried, saying she never thought her own daughter would turn her back on them.\n\nNow my parents barely talk to me. i feel horrible, but at the same time, i don’t think i should have to sacrifice my future because of their financial mistakes.\n\naita for refusing to give up my college fund?",
    "comments": [
        {
            "author": "Judgement_Bot_AITA",
            "body": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I didn't want to give up my college fund (2) I am not sure if I suppose to help them or not.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n[Check out our holiday break announcement here!](https://www.reddit.com/r/AmItheAsshole/comments/1h3wnsj/aita_monthly_open_forum_december_2024_a_holiday/)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Keenhail",
            "body": "NTA - That money is for YOUR education and it’s their own fault for overspending or making bad investment decisions… pretty rich coming from them saying your selfish also given they’re asking their own child sacrifice a good education because they made mistakes financially",
            "score": 704,
            "replies": [
                {
                    "author": "Organic-Coconut-7152",
                    "body": "Especially since she will inherit all the weird stuff they spent their money on.",
                    "score": 100,
                    "replies": []
                },
                {
                    "author": "Opposite-Employer-28",
                    "body": "Yeah, they made financial mistakes and now want their daughter to make financial mistakes.",
                    "score": 87,
                    "replies": [
                        {
                            "author": "LucyBarefoot",
                            "body": "And I can't help thinking they've had money problems before.  You don't just start overspending.   That's a lifelong habit.   So what did they do in the past when they got in a bind?  I'm guessing her college money just became available and they put their hands out right away.\n\nThe most she should do for them is to use a bit of that money to get financial management counseling.   Honestly though, I probably wouldn't even do that.  The grandparents had the forethought to realize the parents weren't going to set aside for her college and they took care of it and she should honor their wisdom.",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "DefinitelyNotAliens",
                                    "body": "You can start suddenly overspending. It comes from a sudden adjust in income without a reduction in spending and lifestyle",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nerdyguytx",
                    "body": "Financially unstable because of overspending means they are prioritizing their wants over OP's need, education.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "dalealace",
            "body": "NTA. They had a legal obligation to the coat of raiding you. Your grandparents specifically set that money aside for your education, not for your parents emergency debt relief. I assume they must be pretty desperate but this is not money they are entitled to and you don’t owe them for raising you well.",
            "score": 2804,
            "replies": [
                {
                    "author": "mca2021",
                    "body": "Exactly.  They chose to have kids. It's their responsibility to take care of them into adulthood.  You don't \"owe\" them for that.  \n\nOP focus on your future.  You can always help them out when you graduate and have a good job but beware... keep your finances to yourself.  There's some families that constantly try to mooch off their kids or siblings since you have money and \"family helps family\"",
                    "score": 771,
                    "replies": [
                        {
                            "author": "Valuable-Release-868",
                            "body": "To add to this, if they continue to give you grief, ask them if they would like to go with you to your grandparents' and have a conversation about you giving up your college fund to help them out of their overspending problem.  See how fast they stop!",
                            "score": 135,
                            "replies": [
                                {
                                    "author": "Reasonable_Ruin_3760",
                                    "body": "GREAT answer this !",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 167,
                            "replies": [
                                {
                                    "author": "FoundationFormal3183",
                                    "body": "100% this.  Bailing them out will enable them to continue the same behaviors.  I don’t believe they are taking any responsibility for their actions, and if you help them they will likely find themselves in this position again.",
                                    "score": 104,
                                    "replies": [
                                        {
                                            "author": "Wynfleue",
                                            "body": ">if you help them they will likely find themselves in this position again.\n\nAnd with the added pitfalls of:\n\n1.) OP has set the expectation that they will help out\n\n2.) OP will not have the means to help out because they will either have massive debt of their own (from student loans) or they won't have as lucrative of a career because they sacrificed their education (and therefore earning potential) to bail their parents out.",
                                            "score": 33,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "brokenstone79",
                                    "body": "And the chaos bad choices can bring upon them.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Sea_no_evil",
                                    "body": "That's right, play the long game.  Failure to do so is exactly what got your parents into this mess.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GardenSafe8519",
                            "body": "Agree about keeping finances to herself but disagree about helping after graduation. Once money exchanges hands then it will be a neverending cycle.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "mca2021",
                                    "body": "I phrased it as an option if she so chose but with that comes the burden of them come knocking again and again with the hands out",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Agile_Menu_9776",
                                    "body": "Yes, this is exactly right. Her parents will continue to depend on her to make up for their careless spending and poor decisions. They've already shown that they think she \"owes\" them for raising her when in fact that was their responsibility. I hope OP stays strong.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ahnotme",
                            "body": "Sidney Poitier had some memorable lines on this in “Guess who’s coming to dinner”.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Purple-Gap2522",
                            "body": "I agree with this, except that I do not believe OP has any obligation to help them in the future, either, especially during early years when they are trying to establish their own life, and perhaps their own family. Surely the parents can turn to their own parents or siblings, or take out a personal loan or second mortgage, before turning to their child!",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Dense_Dress_1287",
                            "body": "You don't owe them for raising you, they choose to have kids, and part of that decision is to feed and cloth and house you, you didn't ask for any of that.\n\nJust like you didn't ask or make them choose bad financial decisions, and you probably didn't have any say when they went and spent money on stupid toys or expenses.\n\nSince they were the ones making all these decisions, they are the ones who are responsible for the bills. Just because you happen to have some money that was gifted to you, doesn't give them the right to it.\n\nThey can ask, but if you say no, that's the end of it.\n\nI agree with other comments, you should call up grandparents, and ask them what they think you should do about your parents wanting your college funds. Let them rip your parents a new one",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "swadsmom2023",
                            "body": "Geez, if I hear the expression \"family helps family\" I'll light my hair on fire. My motto to myself has become \"if I can't afford to lose it, I can't afford to lend it\". I've lent many a dollar to family and finally realized that they had no intention of paying me back. Am I popular? Hell no. Do I care about their bad decisions, not in the least. Your poor planning is not my emergency. NTA",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "mca2021",
                                    "body": "Agree.  I hate the expression \"family helps family\", especially when the one asking is irresponsible and wants to be bailed out. Then you get extended family involved pressuring them, but they never seem to want to step up and help themselves.  Hypocrites\n\nThe most I'd do for anyone asking is pay for a financial planner to help them with budgeting\n\nI lent my sister money.  She ended up going on a 2 wk trip, which really upset me since she should have used the money towards her debt.  My brother told me I was being judgemental towards her.  I told him that if you owe me money and are being irresponsible, then yes, I'm going to judge.  She eventually paid me back and I no longer cared how she lived, as long as she didn't come to me for money",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Stock-Cell1556",
                    "body": "Yeah, that money was earmarked by OP's grandparents for her college expenses. They did NOT save up this money to bail out their financially irresponsible son or daughter and their spouse. They may very well have established this account because they were aware that OP's parents would be unlikely to be able to help her with college. If they still maintain any control over this money, they may take it back if OP tries to use it to help her parents.\n\nI plan on paying for several young family members who I know will not have a chance at any education outside of high school without financial assistance. In case I die beforehand, I have it in my will that eduactional expenses are to be paid directly to the college, trade school, etc. They can get any kind of further education they want--from cosmetology school to a PhD. in astrophysics--and as long as they're in school, their tution will be paid, as well as other living expenses as deemed suitable by the trustee. But if their rent is being paid while they're in college and they move anyone else in with them, it will stop. I want my young family members to have the best chance for success, but I'm not supporting any moochers.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "slendermanismydad",
                            "body": "Your family members will also be moochers in this context. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Stock-Cell1556",
                                    "body": "The parents or the kids?\n\nI'm mostly worried about the kids' parents trying to get ahold of any money I give them if I were to give them funds directly, plus I'm not entirely sure I'd trust the kids themselves not to misuse the money, they didn't exactly have the best role models. This is why I'll only pay the tuition directly, also rent, utilities, books, etc while they're in school. But they can't move a parent or a boyfriend/girlfriend in unless that person takes over half the rent. \n\nI don't think of the kids as \"moochers.\" I'm offering, and it's no different from a grant or a scholarship. I just want them to have a chance to get ahead and not end up like their parents. Not that their parents are \"bad\" people, they're just bad with money--earning it, saving it, and spending it wisely.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SenpaiSamaChan",
                    "body": "Gee, I wonder if there's a reason it was set aside by the grandparents for OP, and not given to their parents to set aside. The world may never know.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "thrace75",
                            "body": "Yeah. That’s exactly what I was thinking.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "schattentanzer",
                    "body": "If the OP is in the USA, and the grandparents set up a 529 college fund, it can only be used for education expenses. \n\nCannot withdraw money for anything else without financial penalties.",
                    "score": 93,
                    "replies": [
                        {
                            "author": "fdar",
                            "body": "That's two conditionals and a big caveat (\"without financial penalties\"). OP should absolutely not do it, but this isn't why.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "Learning-evryday",
                            "body": "Doesn't sound like Op's parents would care if she incurred the financial penalties on that!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Putrid_Performer2509",
                    "body": "Also, like... They're adults who have run their household together for years. They knew they were overspending and either a) didn't care or b) assumed OP would fold and bail them out. You don't get to that level of debt without knowing what you're doing.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "rocketeerH",
                            "body": "I was looking for this comment. My bet is that they intentionally over spent for years believing that they could eventually make up the shortfall by raiding OPs college fund. As she said, they knew about it the whole time. I think this was planned.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Krohm2",
                    "body": "Yep raiding kids is hard, there always pulling agro and taking stacks, as parents you just gotta carry them through that first clear and hopefully they learn from there mistakes for the next time 😂😂😂😂",
                    "score": 71,
                    "replies": [
                        {
                            "author": "MizStazya",
                            "body": "My kid is broken, he just always stands in the damn fire.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "SinfulPanda",
                                    "body": "That's what the coat is for, to beat out the fire!",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Boz0r",
                                    "body": "Just stay out of the goddamn whelps",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gullible-Fan8484",
                            "body": "Perfect MMO reference for reality 👌 🤣",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Future-Crazy-CatLady",
                            "body": "😂😂😂 The commitment to the coat is strong here...",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "rbrancher2",
                            "body": "Piss on them. Damn newbs. Learn like I did, by dieing and having to pick up my pieces and crawl back to town to get rezzed.....",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ailweni",
                    "body": "Exactly. It’s on the parents to *jacket* the responsibility",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Future-Crazy-CatLady",
                            "body": "Yeah, they can't expect her to give them the *shirt* off her back...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "songoku9001",
                    "body": "Coat of raiding? That's sounds more like a quest item from something like D&D",
                    "score": 6,
                    "replies": [
                        {
                            "author": "dalealace",
                            "body": "Right? Autocorrect didn’t have my back on this one since coat and raiding are already words. Either way OP’s parents have their coat of raiding on now.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aethermist88",
                    "body": "If this money is the only way OP can go to college without massive debt, and OP's parents want to use it to get out of their debt, one of two things are happening.\n\n1. They want OP not to go to college, or,\n2. They want OP to go into massive debt just to get them out of debt.\n\nEither way, selfish behaviour from the parents.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bookworm-1960",
                    "body": "Spellcheck, please.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ButterflySilly2340",
                    "body": "The grandparents knew what they were doing. They knew how op's parents are, and they made sure op would have her future covered.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ok-Knowledge9154",
                    "body": "NTA your parents are horrible for even asking this! Enjoy the break they're giving you guilt free and make sure you tell your grandparents about their ask. I would ream my kids out for trying to steal money I put away for my grandkids!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Several_Razzmatazz51",
                    "body": "Sounds like the grandparents knew their children pretty well and wanted to shield their grandchildren...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PageFault",
                    "body": "I took me 4 reads to translate \"coat of raiding you\" to \"cost of raising you\".",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jacintaleishman",
            "body": "It’s not your money, not really. It is your Grandparent’s hard work and sacrifice. They went without specifically so you could be educated and thrive. You are beholden to them to use that money only for the purpose it was intended for. I’m sorry your parents are suffering, I’m a parent of three adult daughters. I’d rather declare bankruptcy than jeopardise any of their education and financial security. ",
            "score": 453,
            "replies": [
                {
                    "author": "Decent-Secretary6586",
                    "body": "if your grands “set up” a college fund in your name, i would guess it is a tax free account that only can be used for college expenses. other people withdrawing $ for personal expenses could have some serious $$ penalties. Talk to an accountant or banker.",
                    "score": 138,
                    "replies": [
                        {
                            "author": "smileycat007",
                            "body": "She doesn't need to talk to an accountant because she is, very intelligently, not giving her parents the money.",
                            "score": 89,
                            "replies": []
                        },
                        {
                            "author": "Usrname52",
                            "body": "She shouldn't give the money anyway, but a lot of people use \"college fund\" to mean a savings account expected to be used for school. \n\n\nShe doesn't need to talk to an advisor about the type of account, because it doesn't matter what the account \"can\" be used for.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "fdar",
                            "body": "Not that serious, even if you're correct that it is a 529. Penalties are paying taxes plus 10% on the gains, which is likely not that much given OP likely has a low income.\n\nOP should still not do it at all, but this isn't why.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "lbl951",
                                    "body": "This is certainly a factor on why not to do it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "66Hslackerpro",
                    "body": "Same here",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SarkyRevenger",
                    "body": "Wish I could upvote this more.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "stilettopanda",
                    "body": "I love this take. It's so true.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sharp-Shine-583",
            "body": "NTA\n\nIf your mother was crying I would assume that they are desperate, and you should take steps to safeguard that money like getting electronic statements and setting multi-factor authentication on the account.",
            "score": 132,
            "replies": [
                {
                    "author": "Pavlock",
                    "body": ">If your mother was crying I would assume that they are desperate\n\nOr just manipulative.  In either case, your advice to protect the college fund stands.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "DeliciousBeanWater",
                    "body": "If i were OP id also get a place to live lined up for semesters off. I dont get the feeling theyll be able to stay where theyre living now and if they treat their daughter like that now, i can see them either not letting her stay w them or trying to charge her hella rent",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Raspberry7884",
            "body": "NTA. Where are your grandparents? If they’re still alive you should tell them what your parents are demanding. Also, depending on how the fund was set up could still be their money (legally) and you’re just a beneficiary of it if you go to college. It might not even be yours to give away.\n\nIf they just put it in a regular bank account it’s yours but you should keep it and use it for the purpose your grandparents saved it for.",
            "score": 177,
            "replies": [
                {
                    "author": "haveabunderfulday",
                    "body": "This. We've all seen stories of how parents have screwed over their kids by stealing their college fund for one reason or another, speak with your granparents if you can and the financial institution where it's being held and make sure it's protected.\n\n**FREEZE YOUR CREDIT!!** Parents who want to steal their children's college funds will almost always take out credit cards in their name. \n https://www.experian.com/blogs/ask-experian/credit-education/preventing-fraud/security-freeze/#:~:text=Quick%20Answer,your%20credit%20reports%20for%20free.",
                    "score": 110,
                    "replies": [
                        {
                            "author": "lemonfeelingway",
                            "body": "THIS ⬆️ I know it seems far fetched but freeze your credit.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "elangomatt",
                    "body": "NTA all the way. From the sound of it, if the parents had any right to take the money they probably would have done so already. Now that OP can access the funds for college they see their chance to get their hands on it.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tiny_Incident_2876",
            "body": "Please  lock down  your  credit information",
            "score": 61,
            "replies": [
                {
                    "author": "neighborhood_mabel",
                    "body": "Came here to say this as well.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Azzbolemighty",
                    "body": "Yup. Desperate people will resort to desperate measures",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Salmon-Bagel",
                    "body": "Yes freeze your credit. Otherwise they could take out credit cards in your name, and that sounds like something they would try to do given that they see themselves as entitled to that money",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dangerous-WinterElf",
            "body": "NTA. \n\nListen. If a parent pulls out the \"I raised you....\" they are almost always the asshole in the scenario. Unless it's the rare you did something where them saying \"I raised you better than this\" is warranted.\n\nChildren did not ask to be born. The parents chose it. It's their obligation to feed the child, clothe the child, keep a roof over their head, and all the other stuff that comes with having a child. \nIt's not the kid taking out a loan where the parents can cash in when the child turns 18. \n\nYou do not owe them for raising you. \nNot even a single cent. And I say that as a parent myself. \nYour grandparents set those money aside so you didn't have to start your adult life with debt. To help you get the education you want, and get a good start on life. And if there's money left after school. It's still yours. Use it for further education. A saving towards a home. \nYour parents are not entitled to that money.",
            "score": 115,
            "replies": [
                {
                    "author": "WeasleyGeek",
                    "body": "Oh, the comparison (or anti-comparison) to a loan is such a helpful way of framing it. Like, it really resonates with me and my parents didn't even do the financial stuff - more the type who made an emotional investment, and expected me to start repaying it by offering myself up as an emotional punching bag, when I failed at making sure they could feel good about themselves through being parents. So it's a really versatile and simple way of summing up this wrongheaded entitlement mindset that parents get about their own decision to become parents, whichever variety of renumeration they're expecting.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neat-Character-9894",
            "body": "NTA, it is really unfair of them to put you in this situation. They made the decision to have you, you don't owe them for raising you. Trying to guilt you into rescuing them from bad financial decisions is wrong.",
            "score": 49,
            "replies": [
                {
                    "author": "External_Taste8616",
                    "body": "This is exactly where my head went. I understand being in dire straights financially, it sucks and is scary. But that is a very manipulative stance and does not in any way demonstrate regard for you.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rox4540",
            "body": "So THEY’LL be debt-free, despite poor financial decision-making and OP will be saddled with massive debt because she wants an education? \n\nYeah, lovely. OP should just repeat the same thing back to her feckless mother- someone is definitely selfish here. \n\nNTA.",
            "score": 33,
            "replies": []
        },
        {
            "author": "Kris82868",
            "body": "NTA. Your grandparents set up a college fund for you. Not an overspending/bad investments fall back fund for your parents.",
            "score": 48,
            "replies": [
                {
                    "author": "Green-Eyed-BabyGirl",
                    "body": "Perhaps your grandparents knew their kids…and that’s one reason why they set up their money this way. Use the money for what it was intended to be used for…your education which is hopefully setting you up for a more successful future without a debt burden.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "Opposite-Employer-28",
                            "body": "I wouldn't be a bit surprised if the grandparents have already helped op's parents out of debt in the past.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Green-Eyed-BabyGirl",
                                    "body": "Exactly.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlternativeDue1958",
            "body": "Your parents raising you wasn’t them doing you a favor, it was them being responsible for their choices. You didn’t ask to be born. Their financial problems have absolutely nothing to do with the $ your grandparents left for you. They’re not even offering to pay you back. NTA!",
            "score": 21,
            "replies": []
        },
        {
            "author": "Karma-Chameleon_",
            "body": "NYA- I’m sure your grandparents would rather you get a good education and set yourself up for a great career than pay off your parents frivolous debts",
            "score": 20,
            "replies": []
        },
        {
            "author": "Emmyxo212",
            "body": "If your parents are bad with money already then all you would be doing is putting your college fund down the drain. I’ve read so many stories of people giving in to the guilt, paying off family debts, only for that debt to accumulate again down the track. Put it to your parents that it’s either your debt or theirs- how is that a fair ask of their child? NTA.",
            "score": 16,
            "replies": [
                {
                    "author": "ShinozSnow",
                    "body": "I know people who paid off their parents debt more than once before they realized the parent just didn't give a crap about controlling their spending.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bubbleman96815",
            "body": "I suggest you never tell your parents what your future hourly wage or salary is.   Seems like the less they know about your finances the better off you’ll be once you enter the working world.",
            "score": 15,
            "replies": [
                {
                    "author": "Ornery-Newspaper-631",
                    "body": "Completely agree with this. It’s not their business and they will continue to try to manipulate you over the years. Don’t even tell them your starting salary, bonuses, anything.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Clerk_6960",
            "body": "NTA and don’t even think about it! Continue your education! Don’t feel guilty. Your parent’s financial  mistakes are not your emergency! They don’t get to take your future to solve their problems. Continue school and then live your life guilt free.",
            "score": 13,
            "replies": []
        },
        {
            "author": "RevenueOriginal9777",
            "body": "Your parents issues aren’t your issues. The money wasn’t meant for them. Let them know if they don’t drop the guilt you will go NC with them.",
            "score": 13,
            "replies": []
        },
        {
            "author": "LeaveInteresting3290",
            "body": "NTA - you don’t owe your parents for the money they spent raising you. \nThat’s every parents responsibility. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "WomanInQuestion",
            "body": "NTA - everything they “did for you” was their obligation to you as a parent. No child EVER owes their parents for being raised.",
            "score": 7,
            "replies": []
        },
        {
            "author": "AttemptOverall7128",
            "body": "If you give them the money then you’ll be in debt instead, how does that make any sense. \n\nThey are adults and should have their shit together by now. It’s great your grandparents stepped up where your parents should have by saving for your education.",
            "score": 6,
            "replies": []
        },
        {
            "author": "fenryonze",
            "body": "NTA\n\nIts likely that your parents are in the financial position theyre in because they expected you to bail them out.\n\nThe selfish ones here are your parents who think its acceptable to make their child go into debt to pay off their shopping sprees. It was their responsibility to raise you and you owe them nothing in return",
            "score": 6,
            "replies": []
        },
        {
            "author": "khuddukhi",
            "body": "NTA, but time and time again, this money and relationships, one tough issue.",
            "score": 4,
            "replies": []
        },
        {
            "author": "literallynotoji",
            "body": "Your grandparents set up the college fund explicitly for your education, and your parents always knew this. Their financial struggles, caused by bad investments and overspending, are not your responsibility to fix—especially at the cost of your own future.\n\n\n\nYour education is an investment in your life, and using that money for anything else could leave you struggling with debt for years. It’s unfair for your parents to guilt-trip you into sacrificing your future because of their poor financial decisions. While it’s understandable that they are in distress, their reaction—calling you selfish and giving you the silent treatment—is manipulative and unfair.\n\n\n\nYou are not turning your back on them; you are simply protecting the opportunity that was set aside for you. If they need help, perhaps you can support them emotionally or suggest alternative financial strategies, but giving up your education fund should not be an option. Stay strong—you’re making the right choice.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Fianna9",
            "body": "NTA- your grandparents set that money aside for your education. Your parents raised you as it was their duty as parents. \n\nThat money is to help you get a better start in life. And it sounds like your grandparents knew just what they were doing giving it to you and not to your parents to use\n\nAnd depending how the fund is set up, and how it was left to you (in a will or just a trust or such) it might not even be legal for it to be used for anything but education",
            "score": 4,
            "replies": []
        },
        {
            "author": "Mmm_Lychees",
            "body": "NTA\n\nRegardless of their weak argument; that’s your grandparents money. They need to be the ones to approve any changes to the fund. And I’m guessing your grandparents would tell them to take a hike! ",
            "score": 5,
            "replies": []
        },
        {
            "author": "_Terryist",
            "body": "NTA - They made the choice to make you, not the other way around. Your grandparents made the decision to provide you a college fund, not a bail out your parents fund.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Adventurous-Term5062",
            "body": "NTA. Parents who claimed they are “owed” just for providing the basics are bad people. I am sorry your parents are these people.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SadLocal8314",
            "body": "NTA. Your grandparents meant the money for college. Since your parents don't seem to have access to the fund, it looks like your grandparents had concerns about their choices.\n\nAnd I cannot stress this enough, WTF?! Parents are obliged to raise their children. The child does not have an obligation to save the parents from the consequences of their own actions. There are many options for them -debit consolidation or bankruptcy come to mind. \n\nSo, NTA. Go to school, get the education your grandparents helped provide for. And then move out of state and go NC. As the old Scots I went to church with used to say: \"Let them drie their ain weird.\"",
            "score": 4,
            "replies": []
        },
        {
            "author": "TickityTickityBoom",
            "body": "NTA - you are following the wishes of your grandparents, setting up a solid foundation in education and life. Your parents debts are their issue. Your mother and father can get second jobs to pay it down, not ransack your piggy bank",
            "score": 4,
            "replies": []
        },
        {
            "author": "Dry-Lake4777",
            "body": "NTA They are being selfish. Prioritizing overspending over their kid's future",
            "score": 4,
            "replies": []
        },
        {
            "author": "underwater-sunlight",
            "body": "NTA\nYou say they are in trouble from their mistakes (investments, overspending)\nIf it was a scenario where someone was made redundant, or a medical bill came through that wasn't fully covered by insurance, I would be more inclined to help out but this is your money for your future which you have looked after.\n\nWhat else are they doing to improve their finances? Extra hours? Different jobs at a higher salary? Second jobs?\nIf they aren't working on it, expecting someone else to bail them isn't fair",
            "score": 6,
            "replies": []
        },
        {
            "author": "Old_Inevitable8553",
            "body": "NTA. You don't owe them anything. As your parents, it was their obligation and duty to take care of and provide for you. So they have no right to expect something in return for that. They're the ones that are being selfish for even thinking that.",
            "score": 3,
            "replies": []
        },
        {
            "author": "bookishmama_76",
            "body": "NTA - you do not owe your parents for choosing to bring you into this world. They made that choice and therefore it was their responsibility to raise you. You absolutely should be grateful for that but it doesn’t mean you owe them your college savings",
            "score": 3,
            "replies": []
        },
        {
            "author": "LavenderPearlTea",
            "body": "Do NOT give up your college fund!!! It’s an investment in YOUR future. It sucks that your parents are trying to steal your future. If they mismanaged their money, they’re just going to blow through yours. They have other options, including debt consolidation.\n\nIs the account in your name? Is it in a 529 account? Can your parents access the money? If so, they might just take it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "_lefthook",
            "body": "NTA. They took the risk on the bad investments. Its their problem.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RubyTx",
            "body": "The raised you and so you owe them money?\n\nThat's their definition of being a parent.\n\nThey did what they were legally required to do.  \n\nYou are their child. Not an investment",
            "score": 3,
            "replies": []
        },
        {
            "author": "sanityjanity",
            "body": "Absolutely NOT.\n\nNTA.\n\nDo not give your parents one red cent.  Your grandparents set up this fund for your education.  It has been literally set aside to keep it safe for you and your education.\n\nYour parents are adults who made these financial decisions.  \n\nAnd here's a secret you should learn now:  people who are in debt now will be in debt again later.  Giving them money won't fix the problem.  They got into debt through behavior and circumstances.  If they don't change their behavior or circumstances, they'll just be in debt again later.\n\nIf you'd like to help them, then you could \\*consider\\* offering to pay a small amount of rent over the summer while you live with them.  But that's only if you are planning to live with them over the summer anyway.\n\nAnother kind of help that you could offer them, is that you could offer (when you are on break) to help them go over their bills with a fine toothed comb, so you can help them find any and all subscriptions that they have and might want to cancel.  (Rocket Money is one tool that can help, but you can do this yourself as well).  \n\nYou may discover that they are overpaying for phone service, streaming services or other things that would help them to keep their costs down.",
            "score": 3,
            "replies": [
                {
                    "author": "Agile_Menu_9776",
                    "body": "I can almost guarantee the parents won't want her help if it is helping them to be more responsible for their money. All they want is her money.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sanityjanity",
                            "body": "I'm sure you're right.  That said, it's the only help she should offer.  Not one penny in cash.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bopperbopper",
            "body": "They see many times on Reddit if one person has a pot load of money that’s designated for something someone else thinks it’s available for them.\n\nTwo thoughts.\n\nFirst, someone looking for money/support will review their options from most convenient to least convenient. When you’re asked by someone in a hard position, it may feel like you’re the difference between their chance to succeed and their chance to fail. But you’re really just the next stop on the list...there was an easier one before you and there will be a harder one after you.\n\nSecond, “What appears to be a crisis is often the end of the illusion that things were working.” It’s rare that someone is actually in a situation where they were OK before and they’ll be OK after, if they can just resolve one immediate issue.\n\nLearn to say “I don’t have anymore money to lend”\n\n(you might have more money, but not to lend)\n\n“ mom dad I’m sorry this happened to you but grandma and grandpa designated this money for me to use for my education so I can launch my life without further asking you my parents for college money who if you think about it should be the ones paying. Have you talked to a financial advisor?“\n\nI’m guessing your grandparents gave you the money because they knew your parents couldn’t and if they had it, they would spend it on themselves.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Dimgrund71",
            "body": "NTA.  If your grandparents set you up, and they were smart, then that fun has to be used to pay for your college if it gets drained for any other purpose there could be serious tax liabilities. Sit your parents down and tell him this. Your college education was planned for and budgeted for since you were a baby and you will not be putting yourself into debt just because your adult parents couldn't figure out how to budget wisely. Tell them that you'd be happy to sit them down and work on their budget but you are not willing to sacrifice your future for their mistakes",
            "score": 3,
            "replies": []
        },
        {
            "author": "Number9Hare",
            "body": "It's wrong of them to ask for money that has been yours since you were little, and has a clear and intended purpose. If they were even halfway decent parents, they wouldn't ask, whatever their circumstances. How upset your grandparents would be if they knew!\nNot to mention the guilt tripping they're attempting as part of the process of trying to part you from your education. Use the money as it was meant to be used, and refuse to accept the guilt they're trying to hand you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Turbulent_Guest402",
            "body": "You don’t have to be grateful, they didn’t something for you when you were born, they did have a child for them. Raising you was their responsibility for having a child. And your education and future are important, their bad choices don’t have to affect you, that‘s something they have to deal with too. NTA",
            "score": 2,
            "replies": []
        },
        {
            "author": "Significant_Bet_6002",
            "body": "One fact will develop, they will blow your money in no time, and all if you will be in the same boat.  Look at it another way. Go to school, become successful, and help them in their assisted living years. But never just hand them cash. They've already shown a lack of common sense.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sharkeatskitten",
            "body": "NTA.  \n  \nGiven that your plans are to go to college you've likely got a path in mind that requires a degree, so if you helped them out and turned around and pulled student loans, you'd have taken on that debt to free them of theirs. You'd likely graduate and have to live with them until you became a little more financially stable because even gainfully employed people WITHOUT student loans struggle to make ends meet. This poor planning is how they landed in this mess and there's no reason to think you wouldn't be asked to bail them out again later. This is kind of a cycle for parents who become financially dependent on their child before their child has the life experience to know what's being asked of them. Check your credit score and if you have a bank account they can access, fix that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PielSucker69",
            "body": "NTA\n\nYour parents are awful to ask this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Educational-Bid-8421",
            "body": "NTA. Your parents are out of line asking for your college fund. Don't give in out of guilt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DirectorDysfunction",
            "body": "**NTA!!! Your parents are selfish, manipulative assholes. If you give them your college fund, I guarantee it will be gone in no time and they will be no further ahead. And…you will be FUCKED**",
            "score": 2,
            "replies": []
        },
        {
            "author": "FollowingLumpy187",
            "body": "NTA they overspent, if you give them the money what stops then from doing it again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sharontoo",
            "body": "The money was invested for your education by your grandparents. Your parents are all grown up and should figure out their financial issues on their own. That’s pretty shitty of them. I suspect they’ve planned for quite some time to take your college fund. Their financial difficulties didn’t just suddenly happen.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DynkoFromTheNorth",
            "body": "NTA. If you help them out now, you'll _never_ see the end of it, until they've passed away. And perhaps you'll even inherit their debt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "teresajs",
            "body": "NTA\n\n\nYou did the right thing.  Also, tell your grandparents what's going on.  They should know that your parents are trying to take their money.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gaymer7437",
            "body": "NTA \nthey should have been more responsible with their money instead of thinking they could take advantage of you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HoldFastO2",
            "body": "NTA. You don't \"owe\" your parents for raising you - that's their basic obligation. They brought you into this world, they're responsible for your care (up to a certain point), not the other way around.\n\nThey can work out payment plans, they can borrow money from (other) family, they can file for bankruptcy... plenty of options that don't involve your college fund.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rare_Sugar_7927",
            "body": ">since they raised me,\n\nSince they fulfilled their legal obligation to house, feed and clothe you. \n\nNTA don't give them a cent and make sure your credit is locked or whatever you have to do in your country to make sure they can't take out loans in your name. Protect yourself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "notevenapro",
            "body": "NTA. Use that college so you do not end up being a parent who begs from their children.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Absolem1010",
            "body": "NTA, you were absolutely right. Do not throw away your future because of your parents shitty spending behavior. You don't owe them for raising you, that was the choice they made for having kids. Go to college and take care of you, like your grandparents wanted. If they wanted to leave your parents money, they would.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ircinraq907",
            "body": "No! You are not an asshole. You are a female human being. Your parents are buttcheeks thats been flatulating shit left and right. Guilt tripping and emotional manipulation because you said no to their ridiculous demands. I would tell your grandpappy and grandmammy about this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Agitated-Dish-6643",
            "body": "NTA! I couldn't imagine trying to take my child's education away from them. So tacky.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI just started college this year. ever since i was little, my grandparents set up a college fund for me, and it’s the only reason i can afford school without taking on massive debt. my parents always knew about it, and it was always meant for my education.\n\nrecently, my parents have been struggling financially due to bad investments and overspending. They sat me down and asked me to use my college fund to help them pay off their debts. they said that since they raised me, it’s only fair that i help them now that they’re struggling.\n\ni said no. i told them i was grateful for everything they’ve done, but this money was specifically for my education, and i wasn’t going to throw away my future. they got upset and said i was being selfish and ungrateful. my mom even cried, saying she never thought her own daughter would turn her back on them.\n\nNow my parents barely talk to me. i feel horrible, but at the same time, i don’t think i should have to sacrifice my future because of their financial mistakes.\n\naita for refusing to give up my college fund?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loud_Banana_59",
            "body": "Nta but I'm sure I read this exact post last week",
            "score": 1,
            "replies": []
        },
        {
            "author": "77x88x88x77",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "RogueWedge",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "blessedgoodbegood",
            "body": "You are NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit_Try_2657",
            "body": "What jerks! I’m a mom, my kids are nearing college age, I’ve set aside funds for them since birth for college.  I am a little in debt right now but I would NEVER think of using the money I saved for them let alone the money someone else saved for them!\n\nI’m so sorry your parents are barely taking to you but let that be for awhile and keep going to college.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HuffN_puffN",
            "body": "Its not their money so they have no right to it.\n\nIts not your money, you only have a right to it for study’s.\n\nIts your grandparents money and they saved for your school. That’s it.\n\nYour parents are horrible for pressure you on this subject. It’s fair to ask for help but that’s it.\n\nSadly money creates new problems more often then not, even with close family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MKMK123456",
            "body": "OP,  NTA.\n\nUnless your parents had a life changing unexpected expense such as an accident or medical emergency they should have planned and budgeted better.\n\nTheir overspending and I'll considered investing will continue even if you halo them now.\n\nDon't set yourself on fire to keep others warm!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LavenderPearlTea",
            "body": "BTW my ex and I are paying for both my kids in college so they won’t any debt. That’s what parents are SUPPOSED to do. We are also paying for my oldest’s master’s degree so she won’t have any debt. I try to buy her work clothes so she has a work wardrobe. My ex gave her his used car. I don’t cry and try to make my own daughter feel guilty while I effing steal from her. Your parents are shit parents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cute_Newspaper_8507",
            "body": "Nta, Cut the selfishness from them off and move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turqu0iseTort0ise",
            "body": "You're grandparents gave you that money for your future, not your family's debt, they maybe struggling a bit but that doesn't mean you should go in debt because they made pore choices, you set boundaries and stick with them you're parents shouldn't be taking from your future because of their past, your parents are being childish by letting the money affect your relationship with them.\n\nHead up OP! you get that education and make your grandparents proud whether they're with us or not!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "tinkerbell_2369",
            "body": "NTA. You should definitely inform your grandparents about this and let them know exactly what’s going on. Tell your parents there are programs to help people with debt reduction and they should look into those. Also mention that your grandparents would be ashamed of them demanding their child’s money, much less money that’s earmarked for your education. Tell them (in front of your grandparents if you can) that your college fund is off limits to them, this topic is closed for discussion and they are never to bring it up again. Best of luck to you",
            "score": 1,
            "replies": []
        },
        {
            "author": "Full_Campaign5430",
            "body": "NTA but your parents must be desperate to be doing this to you.\n\nWould love to know if they begged your grand parents for funds but we're promptly told to jog on. Hence their desperate please to you",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fitz_2112b",
            "body": "NTA And you needed to make sure that your parents have absolutely no way of accessing those funds",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lovemybee",
            "body": "Do not light yourself on fire to keep others warm!!! NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "incospicuous_echoes",
            "body": "NTA. They’re taking advantage of you after making bad decision after bad decision. You don’t owe them anything just because they fulfilled their legal and moral duties as people who chose to bring a child into the world. Stand your ground. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "melissa3670",
            "body": "NTA. As a parent of two college students, I couldn’t even understand taking money from my kids education fund.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otherwise-Topic-1791",
            "body": "NTA. Will giving them this money cause them to make better investments or stop them from overspending? NO. Your money/education would be gone for nothing. Don't throw your money down their money pit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Liss78",
            "body": "NTA\n\n>my parents have been struggling financially due to bad investments and overspending.\n\nThey dug their own graves and expect you to bail them out by sacrificing your future.  Nope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medical_Onion_3500",
            "body": "I honestly can’t believe their audacity to ask their child to fix what they broke",
            "score": 1,
            "replies": []
        },
        {
            "author": "cassowary32",
            "body": "NTA. You are still in college. They are basically asking you to take on their debt which is a selfish and unreasonable request. They should be grateful that you aren’t coming to them for help. \n\nFinish college, get established in life, learn not to make the same mistakes your parents made with money. That’s all you need to do to honor your grandparents wishes for that money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "akelita",
            "body": "NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "wlfwrtr",
            "body": "NTA  It's surprising that they didn't have money troubles until you left the house. Talk to grandparents. Wouldn't be surprised to hear they've been giving them money all along while you were in parents home to help raise you or if they've been taking money from college fund all along if they had access to it. If parents want your help then offer to help them sell some of their belongings online. They can also downsize their house.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spaceylaceygirl",
            "body": "NTA- your parents chose to have a child. They are responsible for the cost of raising you until you are 18. You don't owe them a penny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Complex_Storm1929",
            "body": "NTA.  If it was your parents money that they saved for you I might say maybe splitting it would be the right thing to do.  However, in your case it was your grandparents money.  Not theirs.  Your parents mistakes are their own and taking from their 19 year old daughter is sick.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MeltedWellie",
            "body": "Easy NTA\n\n  \nDid your parents put *any* money away for your future education?\n\n  \nI would understand them asking for help if it was an emergency, unforeseen situation like a medical issue - but even then, they would have to accept the answer 'no' then too. However, that is not 'bad investments and overspending'. So they have spent and squandered their money, not provided any assistance to your future education and are now demanding the money set aside for your education by your grandparents? Ah hell no!\n\n  \nTell them to go and kick rocks!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SavingsRhubarb8746",
            "body": "NTA. This money was set aside by your grandparents for your education, and you do not have any other way (barring large loans) to pay for your education. If we're discussing your family as a whole, you parents are asking for the family debt (that they ran up) to be replace by other family debt (that you will have to pay). The family as a whole will not benefit, the only change would be who is legally responsible to repay the money - your parents or you.\n\nTell your parents that you must respect your grandparents' intentions for the money, and even if you wanted to be so disrespectful as to ignore that, you cannot afford to repay their debts, which is what you will have to do if you take out loans for your education after using your education fund to pay their debts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hootah",
            "body": "NTA.  Ask your parents how they think your grandparents would feel about their asking this of you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DirigoJoe",
            "body": "NTA- this story made no sense until I got to “daughter”",
            "score": 1,
            "replies": []
        },
        {
            "author": "your-mom04605",
            "body": "NTA\n\nYour parents are awful and manipulative. \n\nIt’s your money, use it for your future. We have an obligation to raise the children we make. You didn’t ask to be born. You don’t owe them a thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thin-Pie-3465",
            "body": "NTA Tell your parents that if they expect you to succeed in your life, then they should not hinder it by taking away what was given to you to ensure that success. Which is what your grandparents intended and wanted. Tell them they are grown azz adults and should be responsible for their own debts. Tell them that when you become successful and rich, you will take good care of them in their twilight years. Until then, you expect them to behave like the adults they are and fix their own problems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Parasamgate",
            "body": "NTA. You being born wasn't a contract where you agree to pay later. \n\nYou have to understand from their point of view whatever gets them the money is morally right, they can worry about their justifications later.  So don't think you're a bad daughter because you broke some moral code of theirs.  You didn't.  \n\nYou're doing the right thing, but as long as you are around your parents they will make it seem like it's the wrong thing.  We all come to a point where we realize our parents are just some people that got here before us. They were smarter and almost magical when we couldn't see behind the curtain but it turns out they have their ways they suck too. Wish it weren't so but that's the way it is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tasty-Dust9501",
            "body": "NTA it is money practically not available for covering your parents’ debt since it is covering your education. You don’t have the means to help them out; if you did have money sitting around, you’d perhaps consider differently. Your parents aren’t being reasonable by putting this as you turning your back on them, that is not the case",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThelVlilkman",
            "body": "NTA. There’s a reason why your grandparents setup that account and not your parents. Clearly they knew your parents would’ve dipped their hands in and emptied it out a long time ago. Your parents found themselves in this mess and they can dig themselves out. You weren’t born because you wanted to: they brought you into this world because they wanted a child, you have no obligation to help them just because they raised you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Acceptable-Original",
            "body": "No wonder your grand parents helped you! Keep that in mind before you feel guilty!",
            "score": 1,
            "replies": []
        },
        {
            "author": "snootnoots",
            "body": "NTA. They want you to sacrifice your future to save them from *the consequences of their own actions*, and they have the gall to call *you* selfish?\n\nThis is almost certainly going to ruin your relationship with them, no matter what you choose to do, but I’m going to go out on a limb here and say that if they’re the sort of people who would seriously consider taking your college fund to pay stupid debts, let alone actually *ask* for it, I don’t think there’s a good relationship there to ruin.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Purple-moon-234",
            "body": "NTA.  They’ve known about it and always intended to get it from you if you let them.   Go to school!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ra3ra31010",
            "body": "NTA \n\nThey’ve had decades and you’re just getting started \n\nThat’s your grandmas money to help you get a good start \n\nYou’re parents have been able to work for years\n\nPlease protect your grandmas wishes \n\nShame on your parents for trying to convince a teen to bail them out with money that clearly was for your future and not their present\n\nDo not go into debt so your parents can be out of debt",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Individual_672",
            "body": "NTA Your parents didn’t save money for your education, your grandparents did. I’m guessing your grandparents had a good idea of your parents’ fiscal irresponsibility.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RINewsJunkie",
            "body": "NTA. That money was specifically saved by your grandparents for your college education. Plus I bet even if you gave your parents money they would just waste it just like they have wasted money in the past. You owe them nothing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Boobookittyfhk",
            "body": "These people are bad with money. They’re just gonna blow through your money as well. You need to protect yourself because this is for your future. Your grandparents could’ve given the money, but they chose not to and they probably did it because they probably given the money over the years and they squandered it. \n\nThey have other options. They should not be asking money. That is just manipulative.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cardabella",
            "body": "Why should you be in debt not them? Student loans don't go away if you go bankrupt so they can take bankruptcy and get square but you wouldn't be able to\nYou don't owe your parents and certainly not 7ntil you're  at least as well set upas them with a home you own even if mortgaged, a degree, and a job. You're still a lot less well off than them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Technical_Quarter_99",
            "body": "NTA your parent's financial decisions are not your responsibility. Also, you don't owe them anything for them raising you. That's the responsibility they took on when they had you. your grandparents did the right thing by specifying money for you for your education. please don't sacrifice your future to bail your parents out. They'll likely waste the opportunity and go back into debt. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Public_String_8363",
            "body": "NTA. Tell them to grow up and put on their big boy and girls underwear",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhereWeretheAdults",
            "body": "NTA. The classic lie financially abusive parents use on their children \"we raised you so you owe us.\" Nope. Your parents chose to have a child. Once they made that choice, they owed you food and shelter at a bare minimum. Anything else, they chose to provide for you. You owe them nothing for raising you. That's what all parents do. What good parents don't do is try to manipulate their child out of money that is rightfully theirs.\n\nYour grandparents did not save to set up a \"bail their child out\" fund, your grandparents saved to set up a college fund for their grandchild. Honor their wishes, go to college, be a success.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redd1tmadesignup",
            "body": "I HATE that phrase. “We raised you it’s the least you could do” \nMy mums husband tried this on my 12 year old when they got birthday money. “Ohhh you should give all that money to your mum for raising you, you owe her.” My child looked horrified at those words. I looked my child in the eye (ignoring the husband) and said “NO, you don’t owe me or ANYONE anything for raising you. It’s a privilege and honour for me to be your mum and provide for you. It was my choice to have you. Do you understand?” They looked relieved and nodded. But the husband tried to back track with it was a joke. Not in this house it’s not, you know him my child takes everything literally and has zero inference skill (working on this with their paediatrician) stop saying this to your kids. We don’t owe you shit and we’re not your debt relief or retirement plans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dncrmom",
            "body": "They raised you because they CHOSE to have children. That is a bare minimum requirement. They didn’t contribute to your college fund, they are not trying to make your life better. They are selfish & trying to rob you of your future. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neat-Ostrich7135",
            "body": "NTA\n\n\nThey are trying to phrase this as you turning your back on them,  but what they want to do is transfer THEIR debt to YOU",
            "score": 1,
            "replies": []
        },
        {
            "author": "New-Duck-6401",
            "body": "This is why your grandparents set up your college fund and not your parents,seems to me they’re useless with finances.\nGood luck in college learn well earn well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "raekle",
            "body": "NTA.  Your grandparents left that money to you for college, not to bail your parents out of debt.  It hurts to see your parents suffer, but your grandparents made the decision how that money will be spent, not your parents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strain_Pure",
            "body": "NTA\n\nThey had you, so they had a moral and legal responsibility to care for you, so any \"we raised you\" shit should just be ignored, and they're in this situation of their own making because they kept racking up debt and spending when they should have been saving, so if you paid off their debt for them nothing will change, they'll just continue spending, and you'll have wasted your grandparents money and the opportunity for education on people that will at most say \"thank you\" after you give them the money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KlaudjaB1",
            "body": "Good for you. Tell them that by getting a good education now you are going to set yourself for a good future and may be able to help them when they're really old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PiesAteMyFace",
            "body": "NTA. Honey, I say this as a parent. They're not doing right by asking you this. I'd give my left hand for such a fund for my kids.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few_Acadia7686",
            "body": "NTA\n\nComing from a parent, I'd take on even more debt to put my kids through college if necessary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "indipit",
            "body": "NTA.  Your grandparents likely set up that fund because they knew your parents would never be able to save enough money to send you to school.\n\nThis IS your future.  Your parents should never have asked you for the money, and you are most wise to hold onto it for your college education.\n\nIf it's a 529 account or other specifically college bound type fund, you will be heavily penalized in taxes if you don't spend it on education.  Your parents likely would not help with that either. \n\nYou are doing the right thing, even though it hurts.  Stay strong!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LilBoo2019TR",
            "body": "NTA. They are trying to manipulate you into damning your own future due to their own financial decisions and bad choices. You do exactly what you plan to do with your education. They can figure it out themselves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeirdPinkHair",
            "body": "NTA Two points on this one. \n\n1. You are under zero obligation from them raising you. They chose to have you and hence took on the responsibility and cost of raising you. That is a legal as well as moral obligation.\n\n2. The timing of them asking you for money is no coincidence. You just started college,  i.e. you just got access to your money. As soon as you got acces they came to you to try and emotionally blackmail you into giving them all your money. The timing is not a coincidence. They've been waiting for this and expected you to just give them your money. That's probably why they kept spending cause they expected you to cover it. Now they're left with debts of their own making and the golden goose they were expecting ain't laying.\n\nThat money was always for you, for your education. You are in no way responsible for their assumptions or stupidity. The fact that they saw your money as theirs and don't care about your future it very telling. Stay low contact. Unfortunately you now see your parents for what they really are.",
            "score": 1,
            "replies": []
        },
        {
            "author": "similar_name4489",
            "body": "NTA they didn’t pay a dime into that fund and it's for your education not general spending/debt relief. \n\nYou do not owe them for raising you period. They chose to have a kid, and they’re legally required to raise you unless they gave you up.\n\nThey over spent, they invested poorly, it’s their fault and their problem. They don’t get to take from you to make up for their own shortcomings. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "spid3rham90",
            "body": "ask them to show you where you asked to be born and asked for this life. They chose to have you knowing what it took to raise you, parents who expect soemthing back from that are fucking disgusting",
            "score": 1,
            "replies": []
        },
        {
            "author": "randomrants",
            "body": "NTA it's your money from your grandparents for your education. Did you recently get control of the money? Interesting that they have \"always known\" about this money and are having a financial crisis shortly after you gained control of it. If you did give them money, you would end up taking on student loans for the same amount. So the debt wouldn't magically go away, it would be yours instead of theirs. Your parents are massive As for trying to guilt you into paying off their debts and taking on students loans to pay for your college.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-Cherry-8143",
            "body": "NTA what kind of parents are they, that they think they are entitled to ruin their childs education by trying to get hands on her college fund, ask them that!\n\nBad investments / overspending not your choice but the choices of 2 adults. You are choosing responsibility by using the money what it was intended for.\n\nIt is not fair to have a child clean up the mess his/her parents made",
            "score": 1,
            "replies": []
        },
        {
            "author": "Confident_Tea_587",
            "body": "Fuck them. They have pissed in their own cornflakes, they will have to eat them. Focus on your education and ignore them",
            "score": 1,
            "replies": []
        },
        {
            "author": "Artistic_Bit_4665",
            "body": "Tell them you would be happy to help them with their debt once you are finished with your degree and working.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lazy-Instruction-600",
            "body": "NTA. It was never their money. It was your grandparents who set up that fund for you. Effectively relieving your parents of the burden of saving for your college expenses. They SHOULD be in a great financial position but, their own mistakes have led to consequences. That should not impact you. It’s your parent’s job to insulate you from their financial woes, not shift the burden to you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDuke13",
            "body": "NTA. Start going to your grandparents when you go home and get ready to be on your own straight out of college. That’s no contact behavior.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MmaRamotsweOS",
            "body": "NTA Their finances were messed up by them, not by you. They are the ones that need to fix them, not you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Automatic_Project388",
            "body": "I will say it until I am blue in the face: It is not normal for parents to try and take money from their children. Period. They ran up lifestyle debt. It’s time for them to work extra to pay it off like you’d do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "83poolie",
            "body": "NTA\n\nParents don't get to screw their own finances and then expect you to bail them out. \n\nTell them you cannot help as the funds saved are for your education. Don't tell them, but perhaps consider giving them a small amount AFTER you finish studying if there is anything left. \n\nParents chose to have kids, they don't get to guilt a child into saying they had to spend so so much on raising them so therefore the child \"owes\" them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RIPRIF20",
            "body": "Do not feel horrible, they are guilt tripping you.  Your parents are literally asking you to alter the course of your entire life because they're bad at money management.  I don't know your situation, but I can PROMISE you one thing 100%, if you pay off all of their debts and sacrifice your entire college, THEY WILL BE RIGHT BACK IN THIS POSITION AGAIN AND WILL ASK YOU FOR MONEY AGAIN.   Absolutely do not bail them out.  They'll feel better about it when you have a comfortable job and can support them more in a few years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeidiDover",
            "body": "I have a feeling this ain't over. Also, it would be interesting to know the gender of the OP. Over the time I have been reading AITA, it seems to be more of an issue with people wanting a girl's education money than with a boy's money (for any reason).",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaybeitsMe0617",
            "body": "NTA- your parents chose to have a child and thus chose to take on the responsibility and burden of raising said child. You don't owe them for the fact they followed through on their obligations and didn't neglect you. I'd posit this, if you took out a credit card (as a lot of young college kids do) and ran up more than you could pay off, would they cover it for you? I'd doubt it. They were irresponsible. The consequence to that should not be further irresponsibility. Your grandparents set you up for success, and they are trying to manipulate that away from you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MelG146",
            "body": "NTA. Are your grandparents still alive? If so, tell them that your parents are pressuring you for the money THEY set aside for your education and let them handle it. \n\nYou owe your parents nothing. Zip, zilch, nada. THEY CHOSE to have you. THEY CHOSE to raise you. Their financial position is nothing to do with you, it's all in them and the decisions they have made over the years. Good luck with school!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spiritual_Ad_7162",
            "body": "NTA.\n\nDon't let them guilt you into giving away your future. That money is yours, and they're the selfish ones for requesting it in the first place. \n\nYou don't owe them anything. They chose to have you, therefore it's their obligation to provide for you growing up. Demanding you pay them back is ridiculous. \n\nIt sucks that they're not talking to you, but it's their problem. They need to be adults and solve their own problems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lopsided_Ad2082",
            "body": "Nta. There was a reason your grandparents set this up for you. If they are still around, speak to them about it.\nYour parents are adults and need to learn about consequences and deal with their own problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tomboynik",
            "body": "NTA. Your parent’s bad choices are theirs. They are TA for even considering that you should sacrifice your future to fix their self inflicted problems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Individual_Metal_983",
            "body": "NTA you are not responsible for their bad spending habits and children do not owe parents repayment for having them.\n\nYour grandparents saved this money for your education not your parents' debts.\n\nThe tears and silence are pure manipulation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alibeee64",
            "body": "NTA.  You need to look out for yourself and your future.  A solid education will help with that.   And frankly, you’re likely just throwing good money after bad, as your parents could easily slip back into bad spending habits once their debt is cleared and end up back in the same boat in the future.  They have other options such as declaring bankruptcy, so don’t set yourself on fire to keep them warm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "frys_grandson",
            "body": "NTA, ask them what's worse, having a debt that can be cleared with bankruptcy or one that can't?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Due-Many-8120",
            "body": "t sounds like you're in a tough spot, and I can understand why you're feeling conflicted. From what you've shared, it seems like your college fund was specifically set up for your education, which is something your grandparents clearly intended for you to use for that purpose. While your parents' financial situation is difficult, it's not fair for them to ask you to sacrifice your future, especially since you've been relying on that fund to pursue your education without going into debt.\n\nIt's completely reasonable to prioritize your future and stick to your boundaries, especially when it comes to something as important as your college education. You're not being selfish for wanting to protect your opportunities and well-being.\n\nIn this situation, you're not the one in the wrong. You're simply looking out for your future, which is what your grandparents intended for you to do. It's unfortunate that your parents are upset, but ultimately, their financial difficulties aren't your responsibility to fix. You can still offer emotional support, but you don't have to give up your education to help with their debts.\n\nYou’re NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guardiancomplex",
            "body": "I'm burning with rage at your parent's behavior and it's twice as hot given your mother's absurd hypocrisy and projecting. \n\n\nNTA, and editorializing: THEY are the selfish ones for even asking you something like this. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "runningoutofnames57",
            "body": "NTA - Your grandparents probably knew your parents were financially irresponsible, and specifically set this money aside for you for that very reason. They (grandparents) would definitely not want you to use that money to bail out your parents from their financial mistakes!",
            "score": 1,
            "replies": []
        },
        {
            "author": "DueStatistician3704",
            "body": "If you give up your college fund, you are making the same bad financial decisions your parents made.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Opine65",
            "body": "NTA.  You need to break the cycle of poverty your parents are in.  If you give them money to get out of debt now, in a few years they’ll be back in debt and you won’t have money or an education.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HistoricalInaccurate",
            "body": "NTA - Any parent that uses the “we paid everything for you growing up, now you need to repay us” have a special place reserved in the hell.\n\nDo not give into their emotional manipulation and use that for your education.\n\nThey made the poor choices to overspend, most likely on things that were wants and not needs.\n\nIf they keep pushing. Tell them they can take out loans on their name for your college and they can repay them if they need your money so badly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "12DarkAngel15",
            "body": "NTA you don't owe your parents anything. They did their JOB as parents. Don't sacrifice your future for their mistakes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ajames54",
            "body": "All else aside if you are in the US you can't really clear student debt in a bankruptcy the way your parents can clear their debt.\n\nStudent loan debt can be an anchor around your neck for life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Megmelons55",
            "body": "You didn't ask to be born, so any parent making this comment as an argument for how we \"owe them\" is absolute bullshit. NTA, and make sure that money is in an iron tight place they can't touch no matter what",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImAmandaLeeroy",
            "body": "NTA- my grandparents trusted my mom with the college funds they set up for me and my brother... I was always counting on them, the scholarships I got in high school were only a fraction of what I needed and when I asked my parents about what my grandparents had left me she was like- oh that's gone, sweetie, we needed it. \n\nI never went to college because I was scared of debt... and I'm still bitter about it 20 years later. If they are anything like my parents, they will always ask for more ... My husband and I still help them with bills. \n\nIf you come to be in a position to help them, sure do that- but don't let them guilt you into sacrificing your future. It's wrong and selfish of them to expect it of you. Parents who sabotage their children's livilihoods are parents in names alone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkMacaron7345",
            "body": "I am a grandparent of two 21yos.  Shame on your parents for projecting guilt onto you for their bad financial choices.  Yes, as family we should be there to support, love and help if able.  So unless you have personal savings/$ to offer them a LOAN, then no you are not an A---ole.  Your parents are scared.  Are there other things that you can do to support and help them without using what your g'parents set for education?  That's how you loving support your parents in the best way possible.  Help them out, not bail them out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiny_Incident_2876",
            "body": "You must be very careful,  if you live at home and in the USA  go to Target  or Best Buy get a small  safe put your important  paper  in lock  and key in your luggage  or trunk ,you can't  trust  no one in your family  best to be safe than sorry",
            "score": 1,
            "replies": []
        },
        {
            "author": "chik_w_cats",
            "body": "NTA and don't let them sway you!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "caryn1477",
            "body": "Absolutely not, and your parents are being terribly crappy for treating you like this. I'm so sorry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDarkHelmet1985",
            "body": "NTA.. your parents are trying to manipulate you into doing what they want. \n\nThey put themselves in their position. Its interesting to me that your parents would ask you to pay off their debt while forcing you to put yourself into massive debt for college. That is not a fair tradeoff. THey are basically saying that they think its better for you, someone who has no other assets, to go into significant debt so they can continue to over spend and live outside their means. \n\nI would write them a letter explaining how disappointed I was in them for their request and how they are so willing to put me into debt so they can be debt free. I would then go LC with them until they learned a lesson. Despite their actions, I bet they will be the first to bitch if you decide not to spend a holiday with them or a birthday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "houseonpost",
            "body": "NTA: Any future discussions about your college fund should be directed towards your grandparents. I'm sure they'd be livid to hear what one of their kids is doing to you",
            "score": 1,
            "replies": []
        },
        {
            "author": "CatPawSoup",
            "body": "NTA. If you bail them out, they're not going to learn (although honestly, it sounds like they might not learn either way). They're just going to overspend again. Do you really want to sit and watch your college fund be used for them to go out to dinner and on fancy vacations? That's not what your grandparents would have wanted. I'm wondering if your grandparents have had to bail them out before, and that's why they set up this college fund for you- because they knew you weren't going to have support any other way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "denys5555",
            "body": "They won’t change if someone bails them out. They’re middle aged and still spend like drunken sailors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ifeelnumb",
            "body": "NTA.  You don't have to set yourself on fire to keep someone warm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jthomas287",
            "body": "NTA. \n\nYou owe your parents nothing for raising you. THEY chose to have a kid. \n\nThey need to get their finances under control",
            "score": 1,
            "replies": []
        },
        {
            "author": "Victor-Grimm",
            "body": "NTA-Take it at face value that your Grandparents made the fund because they knew your parents wouldn’t do it.  Easy no for that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Col2543",
            "body": "NTA. Your parents didn’t work for it and worse, they probably adopted irresponsible financial habits assuming you’d bail them out, considering they knew about the fund.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bumbling_through",
            "body": "NTA. 1. Kids do not choose to be born, and unless you live in China, are not obligated to help them. 2. The fund, if specifically set aside for your education, may be in a specific type of account where if you use it for anything other than education or education related costs, it will make you pay a penalty. 3. Even if you give them the money, that doesn't fix the habits and behaviors that got them into this position in the first place. Who's to say if you do give them the money, and the debt is cleared, they won't just end up getting into more debt. 4. If grandparents wanted to, they could help out financially, if they are deceased, what happened to the inheritance? 5. Why are they asking the young adult child who needs that money for education and not other family members? 6. Remind them that they are two able bodied adults with jobs and so long as they fix their behaviors theirs a chance thy can dig themselves out of that hole.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tnvols32",
            "body": "NTA. Good parents don't ask their children to sacrifice their education to pay for the parents poor choices.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Potential-Power7485",
            "body": "NTA. \"recently, my parents have been struggling financially due to bad investments and overspending\"  No this is not a recent event which is why your grandparents did this for YOU!!!  This has been going on your entire life and/or they have hid it from you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Winter_Raisin_591",
            "body": "Nope, NTA. They better file for BK (if you are state side) and learn to budget their money. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wise_Date_5357",
            "body": "NTA. If it was money THEY had saved it would be a different story but they have NO claim on this money. If your grandparents are still around they I’m sure would put a stop to this, and if they’re not I’m sure in some sort of will or document it would have been earmarked for your education. You would be going against their wishes. \n\nI’m so sorry this is happening OP but they shouldn’t have asked in the first place, this is in no way a problem you can solve.",
            "score": 1,
            "replies": []
        },
        {
            "author": "edibleflowersrgood",
            "body": "NTA- I wonder what your grandparents would think about that? As parents, they should want what's best for you and learn how to take responsibility for their own bad decisions. Now to top it all off, they're withdrawing from you as a tactic to make you feel guilty and force you to take back your decision. That's absolutely unacceptable and absolutely calculated. They probably planned to do this ahead of time.\n\nIf you want to be nice and reach out first, look up a few resources they might benefit from or discuss money management tactics that could help them get their shit together. Make it clear that you care about them, but you can't support them financially. That is NOT your job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AboveGroundGrandma",
            "body": "As a boomer parent whose children had to take out financial aid for college, my opinion is you are in no way, shape, or form, the A. Please do not let them guilt you into handing over YOUR money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kid_comet86",
            "body": "NTA your parents are for trying to gaslight you into throwing away your future. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "One-Pudding9667",
            "body": "NTA. stay strong and finish college, lest you end up financially struggling like they are.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Honestyonly22",
            "body": "Hell NO",
            "score": 1,
            "replies": []
        },
        {
            "author": "Van1sthand",
            "body": "NTA and ALSO legally you can’t use 529 money for whatever you want. It’s for school expenses. Like, how would they even justify that on paper?",
            "score": 1,
            "replies": []
        },
        {
            "author": "and1att",
            "body": "You are right, they made decisions and want to drag you down with them. That’s not the action of loving parents. They owe you everything for bringing you into this world, not the other way around. Don’t cave in as this money is for the investment in  your future .",
            "score": 1,
            "replies": []
        },
        {
            "author": "braintumorbombshell",
            "body": "Look up the word “narcissist”! NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "TryingtoAdultPlsHelp",
            "body": "NTA - the money is yours, period. You don't have to justify not giving it to them at all. However, they sound like they are going to be butthurt about it, so sadly there are consequences. Just like them not having money is a consequence of their own financial decisions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry_Meaning_3129",
            "body": "Nta. Parents are selfish for this",
            "score": 1,
            "replies": []
        },
        {
            "author": "IndividualEye1803",
            "body": "U didnt ask to be born.  U were their gift to themselves.  People are “selfish” when they have kids and more charitable adopting.  \n\nGuilt tripping ur own kids, who u forced to be here, but were too broke to where they already need to start taking care of you by 18 is diabolical and i will never understand parents who do this.\n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "newoldm",
            "body": "No, you're not.  Your parents made stupid financial choices so now the consequences are solely theirs.  And that \"I-raised-you-so-you-owe-me\" schtick doesn't work.  What they did was their obligation as parents and for which they receive no compensation.  It was their duty and if they didn't exercise it they could have faced going to jail.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kristmaus",
            "body": "NTA.\n\nYOU. OWE. THEM. NOTHING.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Latter-Refuse8442",
            "body": "NTA. Your parents' mistakes are not yours to fix. They got themselves in this situation and bailing them out will enable them to do it again. Furthermore, this did not happen overnight. My guess is they buried their head in the sand until it got very bad. That means they chose not to fix it and stop their spending when if could have helped.\n\n\nDon't sacrifice your future to fix their mistakes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "illbebacknow",
            "body": "NTA, this was a gift from your grandparents. Do not give in under any circumstance. I hope you live at university so you do not to deal with them as much. Maybe get a little job to pay for a place to stay in summer or take summer school to finish early.",
            "score": 1,
            "replies": []
        },
        {
            "author": "snakesssssss22",
            "body": "NTA! They can take out loans to secure their future, just like they are asking you to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glinda-The-Witch",
            "body": "NTA your parents were legally obligated to put a roof over your head, feed and cloth you. They don’t get to guilt you in to giving up your college education due to their irresponsible behavior.\n\nIf they are unable to manage their way out of debt, they should look into a debt management class or consider bankruptcy.\n\nTell your parents you are appalled that they would expect their child to pay their debts and you are sad that they are willing to punish you for prioritizing your education and future. Remind them they are destroying your relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrical_Page_1136",
            "body": "I’m so sorry they put you in this position. Based on your description of how things went down (and based on my own personal experience), I’m sure this isn’t the first time they’ve been garbage at being parents. \n\nI lived off aid, loans, and working multiple jobs during college. My parents were essentially destitute by the time I was about 20 years old. I wanted for nothing when I was young, but my parents squandered every last dime to feed my mother’s shopping addiction. \n\nThey would always come sniffing around when my loan check paid out my tuition and deposited the rest in my checking account. One time, their fridge was on its way out. They asked for $800 for a fridge (a hefty sum 20+ years ago) and I gave it to them. Months later I went home for spring break and lo and behold, they still had the old fridge with an internal temp of around 55 degrees. Where did the money go? Who the fuck knows? \n\nThey ultimately lost everything and went bankrupt. Yours likely will too, whether you help them or not. Keep your head up and make a good life for yourself. There will come a time when you are established in your career and will probably have to help them in some way when they are elderly and sick. But by that time, you will be in a far better financial situation. (Not saying anyone is ever obligated to help an aging or sick parent simply by virtue of being born, but a lot of us do it regardless).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Commercial_Ball5624",
            "body": "There are so many things wrong with what your parents are doing here, and I want to add that if the money is already in some type of college fund trust account it probably can’t even be withdrawn for the purpose of helping your parents",
            "score": 1,
            "replies": []
        },
        {
            "author": "MattGorilla",
            "body": "NTA. The reality is that they're not asking you to pay off their debt, they're transferring their debt on to you. It's even worse than that, because student loans aren't discharged in bankruptcy, so while that may be an option for them, it won't be an option for you.\n\nStand your ground.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible-Kale-904",
            "body": "Your grandparents KNEW\n\n\n\n\nYour grandparents and you are:\n\n\nN\nT\nA",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZipBoxer",
            "body": "They're not just asking for your college fund, they're asking you to take on debt to pay for theirs. Every dollar you give them from that fund means a dollar you'll have to get as a loan and pay interest on . NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minute-Actuator-9638",
            "body": "NTA and freeze your credit, protect yourself.  My father stole my college savings after I refused to give it to him.  Protect yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SameEntry4434",
            "body": "NTA. Hold on to your decision and prosper in school",
            "score": 1,
            "replies": []
        },
        {
            "author": "Floating-Cynic",
            "body": "Putting aside the fact that your parents had a legal obligation to raise you and you were likely not able to consent to paying them back- they actually have a lot of options available to them to get out if this and are choosing not to utilize them. It's not uncommon for people to be embarassed and ignorant of the type of help available.  They can file for bankruptcy, downsize the house, sell the car for a cheaper one, contact United Way for a financial counselor,  utilize food pantries and throw the money they would soend on food at debt. Financial distress isn't easy, but there's not a lot of situations that justify asking your child to take on the burden.  So no, you are NTA. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Peppered_Rock",
            "body": "NTA. I dont know if theyre genuine or not in their distress, but it seems to me like they're trying to guilt you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Any-Abalone8047",
            "body": "NTA. \n\nI just started college too. Surprisingly, my mom told me to keep my money despite me offering it to her because I told myself that’s the first thing I’d do with my funds but my sister called me a bitch for not giving them money lol. \n\nAfter the reassurance from my mom, I went on to explain to my sister that the money given to me is to solely go towards MY education/needs. I was not responsible for anything she had and paying it off for her would be unfair to me and my future. \n\nIt’s difficult being put into this spot but putting yourself first will help you and your future out in the long run.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RioAzul2015",
            "body": "NTA, it is not your responsibility to bail your parents out for mismanaging their money. Then they try and guilt trip you using the since we raised you line…that wasn’t your choice it was theirs since they chose to have you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CitationNeeded69",
            "body": "NTA. Something similar happened to me when I was 18, and I let myself be manipulated out of a life changing amount of money to “help” my parents out of a financial hole, all in the name of “keeping the family together”. It’s ruined our relationship, I spent years feeling ashamed, and our entire family has fractured because of it. Don’t do it. Stand up for yourself and stay strong. Don’t make the same mistake I did. You are under no obligation to bail out adults who should be in control of their finances, and adult children should be sent a bill for being raised.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Resource_8530",
            "body": "My parents did almost the same thing. Only they didn't ask, they took. Gave my college money to their golden child(older sister), to get married and move to Germany.  I joined the Navy because I had read up about the GI bill. When I got out, they sent me home with a little over $10,000. My mother decided I should give that money to, you guessed it older sister, because she now had 2 kids and needed help. I told her I needed to go to the bank to cash the check. On the way home I  rented an apartment  and bought a car. Oh well, money was all gone. TAKE CARE OF YOUR SELF!! P.S. Only one in my family with a college education.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xoxoyoyo",
            "body": "giving that money will likely only lead to more bad investments and overspending without solving the core problem or fixing the debt problems. I am guessing your grandparents must have either passed away and left money which your parents spent already or refused to help them. anyway toxic people not talking to you is not a bad thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gamerfreak20",
            "body": "NTA… op they legally had to take care of you they just doing what my mom does and tried pulling the victim card. Focus on your future. If it were your grandparents that were struggling I’d say help them cause they helped you with the college fund. \n\nDon’t talk to your parents ever again simple as that",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd_Task8211",
            "body": "NTA. Good parents would not spend all their money and then try to spend the money your grandparents set aside for your education.  If you agreed, they would piss away that money too, then when you are out of school, come to you for more money. They need to learn to control their spending.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Apprehensive_Repeat2",
            "body": "Def NTA, that money was saved for you. Now, if there is money left over after you are done with school, that's a different conversation to have.",
            "score": 1,
            "replies": []
        },
        {
            "author": "letuswatchtvinpeace",
            "body": "NTA  \nNTA  \nNTA  \n   \nDo not sacrifice your future because your parents are bad with money. They have lived this long they can make it further without your money.  \n  \nThey are now trying to manipulate you into giving them the money, this is emotional abuse, don't fall for it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eaulivia",
            "body": "You are NTA at all. My grandparents helped me and my parents with an education fund. My parents kept saving separately for my education as well. And now I've become a parent. In this country (the US) that's something you think about as soon as you child starts walking and talking, if not earlier, 'how will I pay for my child's education?' It's a huge weight off my mind that my parents are going to help us with an education fund for my baby.\n\nBecause your grandparents set that up for you, your parents didn't have to factor it into their financial decisions. They were already given a wonderful gift of not having to worry about how you were going to be able to go to college.\n\nThey have already benefitted from that fund for years.\n\nIn this moment of panic, they may be thinking that's an easy solution. But they have other options and should be meeting with a financial advisor to discuss, not you. You deserve the chance to start your life without debt hanging over you as your grandparents intended.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radiant-Excuse-8762",
            "body": "They screwed up. You are not obligated to fix their mess. Your grandparents set up that fund for *you*. \n\nThey chose to have a child. It was their legal and moral obligation to raise you, not some great gift that leaves you indebted to them. \n\nNTA. Go to college and live your dream!",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Plantain_1699",
            "body": "NTA - why would they want YOU to be saddled with a lifetime of debt?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrGreyJetZ",
            "body": "NTA.  \nYou do not owe your parent anything for raising you - that is what they are legally obligated to do.  \nThey made bad investment's, they over spent, they created the problem and need to fix it themselves. \n\nYour college fund was setup by your grand parents specifically for education. \n\nTake time to let your parents petty childish behavior sink in. You maybe better off being LC. I would even ask your grandparents to let you stay with them over breaks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoHorseNoMustache",
            "body": "'they said that since they raised me, it’s only fair that i help them now that they’re struggling.'\n\nThis is always 100% incorrect.  They are the ones who decided to give birth to you and once that happened it was *their* responsibility to pay for you, you owe them nothing for doing what they were obligated to do.  You should not have to sacrifice your future because they're bad with money.  \n\nNTA, stand your ground.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wp3wp3wp3",
            "body": "I'm guessing they overspent because they thought they could guilt you into giving them that money. Nope. Their lack of responsibility is not your problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "isane20XX",
            "body": "NTA. This is good practice for your awareness, the silent treatment that you are getting is a manipulation tactic that your parents are using to get you to do something that makes zero sense. People will try this on you, especially if it works, so you need to be able not to let the silent treatment bother you. Your parents are not able to make intelligent financial decisions, and this will not be the last time they come to you to bail them out. Keep up with your studies and make sure you make good financial decisions but don’t tell your parents about your finances.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ingodwetryst",
            "body": ">due to bad investments and overspending.\n\nSounds like a \"them\" problem a good life lesson to you of what NOT to do with money.\n\nNTA, 100%.  Do not give them a dime.  They created you, that obligated them to raise you.  You owe them $0.",
            "score": 1,
            "replies": []
        },
        {
            "author": "West-Improvement2449",
            "body": "Nta. They probably would of just taken it if they could. It is not their money",
            "score": 1,
            "replies": []
        },
        {
            "author": "yellowjacket1996",
            "body": "NTA. NEVER give up your college fund. NEVER sacrifice your education for other peoples’ poor planning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aghzombies",
            "body": "I'm a mum. I'm sure there are things my kids can be grateful to me for - I do my best to be a good mum and to provide things they want as well as the things they need.\n\nThat is literally the job though. They owe me absolutely nothing. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "joeyraffcom",
            "body": "They’ll just fuck up their finances again after you bail them out. Then you’ll all be screwed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AgathaM",
            "body": "There is a reason why your grandparents set it aside for your access only rather than putting your parents on it. I guarantee that they have had money problems in the past and the grandparents saw the writing on the wall. Parents wouldn’t be able to help you go to college and would probably spend your fund had they been given access earlier. \n\nYou are NTA for not sharing it with them.  They have to deal with their own failures.  You bailing them out would be a short term fix and not a long term fix. They are looking for the easy way out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aDirtyMartini",
            "body": "NTA. They are horrible parents. DO NOT give them the money. Make sure that they don’t have access to the account.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooPets8873",
            "body": "NTA they aren’t in a dire situation, just a difficult one and one of their own making at that. Had you said: my mom needs $20k tomorrow for surgery or else she’ll die, yeah I might encourage you to consider helping because many people would give every cent they have to have their mom or dad back in their life. But this isn’t a life or death situation. They might have to live a harder, more limited life. But they’ll survive - there will be food there will likely be shelter if they haven’t completely fucked up. But their likely temporary fix isn’t worth your ability to finish your education and start a career.  Hope you take this as a lesson for yourself on what not to do though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlikely-Sleep-9352",
            "body": "Your college funds will keep them afloat for a few months, but they will keep you afloat for your whole life.  College is a great investment. Just be sure to go to class and do not get a history degree like me , I had to go to grad school to get a good job.  ( I do love history, though, and i got a good GPA, which helped me get into grad school)",
            "score": 1,
            "replies": []
        },
        {
            "author": "RaisedByBooksNTV",
            "body": "NTA. I did and it ruined my life. It took me almost 2 decades to crawl back to the starting line.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AIWeed420",
            "body": "If the subject comes up again ask about their life insurance. Maybe your dad has one through his company and would be willing to make that sacrifice for his family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "juggalotweaker69",
            "body": "NTA. And your parents are assholes for asking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aware-Initiative3944",
            "body": "NTA and they've probably always been reckless with spending knowing that you have money and were sure that you would give it to them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MidnightHeavy3214",
            "body": "Parents are ment to lift their kids up. Not tie them down with their own selfishness. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "volcanicsunset",
            "body": "NTA. I've been down that road- my mother guilt tripping me because of her bad money decisions and I gave in and now my credit is still shot 6 years later. Your grandparents set it up for you, not them. They'll figure it out but it isn't your problem and don't feel like it is",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loritrudo",
            "body": "NTA for sure! I hate that every time someone declines to hand over money, they’re labeled selfish!! How about the selfish people thinking they have a right to what’s yours?!?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MasterK999",
            "body": "NTA. Kods do not owe an obligation to parents. Period. You did not ask to be born. Any parent who pulls that crap is full of crap.\n\nIn this case it is even worse. Not only did your parents not save for your future, they want to take away the education that your Grandparents worked to provide.\n\nI can tell you that them taking away your future will not solve their money problems. The only thing that will do that is them coming to terms with their financial reality. They should learn to live well within their means and seek out help with debt. There are credit counseling non-profits that do a good job and can help negotiate debt into manageable payments without new high interest consolidation loans. I did that after my divorce a decade ago and it saved me financially.",
            "score": 1,
            "replies": []
        },
        {
            "author": "feralfarmgirl1",
            "body": "Nope definitely not. They knew that was for you for school, they need to figure it out themselves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cheska1234",
            "body": "NTA   Do NOT change your mind. You are right. You need this to keep moving forward. Tell them you’re using it for your education and you can talk about helping them out long term after you graduate. Note I said talk about it not do it. It might help you work on them realizing what they are ultimately asking you to give up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RipRepresentative977",
            "body": "NTA. It's YOUR money, and that's THEIR debt. The child, who never asked to be born, does not owe the parents for raising them. They are not entitled to the college funds your grandparents gave you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeartUpstairs",
            "body": "NTA. DO NOT GIVE THEM ANYTHING. \n\nDo not compromise your education to bail your ADULT parents out of their POOR CHOICES. Especially if they overspend and have always had bad habits. They will not change. Your money will be wasted and you will be left with lots of debt after graduating if you can still afford to go. Do not co-sign on any loans with them to “help them” either. It will destroy your credit if they stop paying and weigh you down if you aspire to purchase a home or auto loan in the future. \n\nHaving $$ for education is a huge asset when you have graduated and are looking to support yourself. Instead of having large monthly payments for school, you can instead put that money into something that provides you with a stable foundation to start your life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Artz-RbB",
            "body": "NTA. Keep up those firm boundaries. It wasn’t fair of them to ask.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Optimisticatlover",
            "body": "Tell them to stop buying coffee and start cooking at home",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infamous-Purple-3131",
            "body": "NTA. Helping out someone who has gotten themselves into debt through bad financial choices is like giving alcohol to an alcoholic. Your giving them money won't fix the problem. The only solution is for THEM to change. Their wanting you to give up your college fund to fix their problem is selfishness.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KaySinceTBC",
            "body": "NTA.  \nThey chose to have a child, and everything that comes with it.  I'm speaking as a parent, children don't owe parents anything.\nThat money was a gift, you shouldn't give it away (except for the intended purpose).\nYou'd be enabling their bad decision making.  For your sake and theirs, don't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jealous-Ad449",
            "body": "NTA. I am sorry your parents are trying to guilt you, and make you feel that you are being selfish. You are at a point in your life where it's okay to start prioritizing your own needs and well-being. Your parents made the decisions they made and should have never thought your college fund was a safety net for them. Maybe in the future, when you are done with school and in a stable career, you can offer to help your parents with debts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ruffled_heart",
            "body": "NTA Your parents should be glad that your future isn't at risk because of their mistakes. Your grandparents were smart in setting up the fund for you.\n\nPlus, you will be better positioned to help your parents (if you choose!) in the future once you have an education and the career opportunities it will bring. Asking you to give that up is the same short-sighted approach that was likely part of getting your parents into financial trouble in the first place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandomSupDevGuy",
            "body": "\"my parents always knew about it\" and \"due to bad investments and overspending\" if both are true sounds like they always expected you to be there as a safety net and now trying to guilt trip you into giving them money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dante2377",
            "body": "NTA.  Grandparents set money aside for this in this manner, specifically not giving it to the parents, because they want it used for a certain thing (education) and not general house funds.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Srvntgrrl_789",
            "body": "NTA.\n\nThere are so many other ways your parents can pay off their debt that don’t involve you giving up on your education.\n\nIf they keep harassing you, remind them that it was your grandparents who set up the fund, not them, and I’m certain they’d not want to see that money go toward paying off their debt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Leg_6429",
            "body": "NTA. You're LUCKY They Barely Talk to You. When you graduate, get a job and launch into the world, they will be back for more money.\n\n\nAs a father of three, I would be embarrassed taking money from my kids. You are Supposed to take care of your kids, they are not supposed to take care of you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pariah164",
            "body": "NTA\n\nYour parents had a legal obligation to raise you from when you were born, to when you were 18. You don't 'owe' them anything. Stand your ground and don't feel guilty. Give them NOTHING.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MagpieSkies",
            "body": "NTA - your parents choose to have you. They took on that financial responsibility. They are being incredibly emotionally manipulative by inplyong that you owe them and are somehow ungrateful for them providing for you as a child. \n\nI never understood parents that have this mentality. Yes thank you mom and dad, for letting my 3 year old self free load off of you! I owe you so much! You let me stay at your place for free, fed me, and did judge me while I was a totally an unemployed loser for those first 15-20 years. Like wtf were you supposed to be doing?!?! Working 9-5 when you were a kid, paying your share? THEY MADE YOU! It was their responsibility to provide for you. Not fucking guilt you for having basic needs, after the fact, and expecting MONEY back for not letting you starve or die of exposure. Jesus christ. \n\nLet them not talk to you. You are being incredible mature. I am proud of you, and I am sure your grandparents are as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whole_Database_3904",
            "body": "🧑‍🔬🧑‍⚕️🧑‍✈️OP's future salary is a great investment choice. 🤯🤯🤯Rescuing financial fools is a stupid investment choice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OwlUnique8712",
            "body": "NTA- Do NOT fall for their GUILT TRIPS! Your grandparents saved that money for you, and did NOT give your parents access to it for a REASON!! They knew they would spend it and waste your entire future. Do NOT go against your grandparents wishes and allow them to have that money. Your Grandparents worked hard for that money and they choose to set it aside for your education for a reason.. if your grandparents wanted your parents to have it to spend it, It would have been given directly to them. Stand your ground and don't dishonor your Grandparents wishes and hard work for people who are greedy and who will do nothing but guilt trip you to get what they want. YOU OWE THEM NOTHING.. ESPECIALLY YOUR GRANDPARENTS MONEY! Do right by them they loved you enough to put a future for you aside for years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "msmame",
            "body": "NTA for all the reasons everyone has listed here!\n\nI would like to add that the fund, if in the USA, is probably a 529. If those funds are used for anything other than qualifying education expenses, there are tax penalties for withdrawals - 10% federal + income tax on interest + any state penalties.  In addition, parents would be obligated to pay income tax on any funds received.\n\nParents are being very short-sighted and financially irresponsible (again).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Motor_Dark6406",
            "body": "NTA, DO NOT EVEN CONSIDER THIS.\n\nF that noise, you do not \"owe them\" for raising you. They are essentially asking you to go into debt in their place, and its disgusting. They're poor financial decisions are their own problem, and if money is the only thing that keeps them in your life they are not worth it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lovenorwich",
            "body": "When your grandparents died, did your parents inherit?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capable-Fisherman-79",
            "body": "do not give them that money! They have spending problems, and if you give them that lump sum, I PROMISE you they will blow it in a week. Do not give up your education because your parents cant control their spending.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KiriYogi",
            "body": "NTA- your parents can go get financial counciling and extra jobs",
            "score": 1,
            "replies": []
        },
        {
            "author": "PoisonedBerryAddict",
            "body": "You're NTA; \"but we raised you, it's only fair!\" is manipulation at it's finest. They're obligated to raise you or put you up for adoption the moment you come out of the womb, and they chose the former. Their problem, not yours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Endora529",
            "body": "NTA. They were probably banking on taking some of your college fund. That’s why they were overspending. You aren’t responsible for their financial situation. Your grandparents left that money for your college not to bail them out. Besides, you would probably have to pay a penalty if you didn’t use it for your education. Your parents need to start adulting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chance-Contract-1290",
            "body": "NTA.  They need to work on their finances without dragging you or anyone else down.  It’s their problem to fix.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Independent_Push_690",
            "body": "As a mother of 5 I could never even think to ask any of them that. Your parents are in this position because of their own choices, leave them to pull themselves out of it. Your grandparents wanted you to have that money so honor their wishes. I would also strongly suggest you going low contact with them for a while. \n\nEdited because I forgot to put NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sensitive_Jelly_5586",
            "body": "NTA.  Don't help out people that overspend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Putrid_Performer2509",
            "body": "NTA. Firstly, your parents are adults. *They* made bad investments and overspent, they can deal with that.\n\nSecond, raising you is the bare minimum expectation of parents. It's not something they get to lord over you and use to manipulate you. It's what they're SUPPOSED to do.\n\nDon't feel bad. Don't fall for their manipulation. Don't give them any money",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dreyygo_Leyy1128",
            "body": "“Yeh mom, and I never thought my own parents would guilt trip me into paying for their problems they created, by giving up literally my only way and chance to get an education. But,  here we are. So I guess we’re both a bit shocked at the moment”\n\n“The only part I had to play in being born into this world was when the sperm swam towards the egg.i didn’t ask to be here nor be raised you yall. You both made that choice to keep me. I didn’t sign a damn thing saying that I “owed you” for being born and being alive.\nYou bought me clothes food and shit that I needed, BECAUSE THAT WAS YOUR JOB!… You guys did the bare fucking minimum that parents are SUPPOSED to do… So I dont “Owe” you anything…”",
            "score": 1,
            "replies": []
        },
        {
            "author": "hawken54321",
            "body": "Yes, Mom and Dad,  I am selfish and ungrateful and it isn't fair.  You were selfish with stupid money decisions and  my money is from my GP.  Taking that money from me isn't fair, either.  Have you heard the term crocodile tears?  You can pretend to cry to get your way and dad can use anger to manipulate me, also.  You want me to acquire large debt in student loans.  Goodbye.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiktak0765",
            "body": "Absolutely not the ah. Grandparents probably suspected your parents to be selfish overspenders; don't give in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NomadicusRex",
            "body": "NTA - Your parents would steal your future due to their bad planning. Your grandparents saved that money for YOUR education, if they wanted to bail out your irresponsible parents, they would do that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Upstairs_Corner",
            "body": "Don't do it. They're being the selfish ones. Are your grandparents still alive? Can they back you up?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ivy-less",
            "body": "If it's a 529 plan, not only will it negatively affect you, but your grandparents will get taxed to the tits on that money if it's used for something other than school. So, good on you. Stand strong and protect your future and your grandparents' present.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blackwillow-99",
            "body": "NTA what was there plan after? You get whatever job or massive debt? I wouldn't stress and just focus on studies and internships for experience and start working when you can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rigbysgirl13",
            "body": "NTA\n\nThey f*ed up, but you DO NOT have to sacrifice your future for them. Don't let them guilt you with \"all they've done for you,\". They did what pare is are *supposed* to do, and get no cookies for it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comfortable-Hat-1083",
            "body": "NO YOU ARE NTA!!!! And don't let anybody convince you otherwise.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ohio_Magpie",
            "body": "Refer them to a  consumer counseling service.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Equal_1312",
            "body": "NTA but you better make sure they can’t access that money and take it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bonzodmunky",
            "body": "NTA. And more importantly, lock down your credit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AndJustLikeThat1205",
            "body": "Most definitely NTA! \n\nYou need to take care of your future because obviously they’re not going to help you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pie_12th",
            "body": "NTA. That's your grandparents money, and your folks aren't entitled to a single cent of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheRealStevo2",
            "body": "I don’t know why parents act like because they raised you that means you then have to throw your life away because of that. YOU decided to have kids, YOU decided to make choices along the way that fucked up your situation. I’m not obligated to fix that. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "tossaside272",
            "body": "Nta raising you was their responsibility not a debt you had to pay back. I can guarantee you that if they cant pay their debts they definitely wont pay you back either with the excuses that family should help family and not be expected to pay back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CwJ60",
            "body": "Nope, you’re using the money for what it’s meant for. Your parents are old enough to make their own decisions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Psychological_Sky_12",
            "body": "NTA even if you helped which you shouldn’t they would most likely be in the same situation again if they can’t manage their money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Nature2803",
            "body": "NTA. I would be sure to always remember this moment and hopefully learn from their mistakes because I assure you in the future if you ever need anything, your parents will not be there for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whooptidooh",
            "body": ">“Since they raised me” \n\nOooooooh HEEEEEEELLL NO. ***They*** were the ones who decided to have kids and THEY were also the ones who thought it would be a good idea to spend money they didn’t have on investments. This is THEIR shit to deal with, not yours.\n\nMake sure that they can’t touch that money, and also make sure that they’re not going to be able to take out any loans in your name.\n\nBig **PHAT** NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Full_Committee8867",
            "body": "Your grandparents saved that money for you and your education (probably because they knew your parents weren't going to). Your parents probably thought they could manipulate you into giving them that money so they spent their money with that in mind.  It's not like it was an unforeseen emergency or something, they overspent.  NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "your-ok",
            "body": "Do not give them money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aMars79",
            "body": "NTA. Very telling that the grandparents set up the college fund so the parents weren’t in charge of the money. I feel like they spent all of their money because they were relying on you giving up the fund since go.",
            "score": 1,
            "replies": []
        },
        {
            "author": "twistOffCapsule",
            "body": " NTA. Parents need to live within their means, not overspend then look to you for more $$",
            "score": 1,
            "replies": []
        },
        {
            "author": "FairyFartDaydreams",
            "body": "NTA and mute them on your devices. Do not set yourself on fire to keep them warm. They can file for bankruptcy if it is that dire",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent-Price-39",
            "body": "I bet the grandparents set that aside in a specific way so OPs parents could not access it. Hard NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blau-Bird",
            "body": "NAH\n\nAbsolutely not. Your grandparents set it up for you likely because they knew your parents weren’t financially responsible. That’s your college fund, use it well.\n\nParticularly if your parents are overspending, you bailing them out won’t change their behavior, they will just wind up back in debt anyway. IF they had suffered some tragedy or medical problems, or had bailed YOU out of debt and if THEY had saved the money for your college, you could consider helping them out, but absolutely not like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "opine704",
            "body": "NTA\n\nThat's not your parents' money. It's not even really your money.  It's your grandparents' money.  They set that money aside for your education.  Using it for anything other than your education would be wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cat_o_meter",
            "body": "Nta if you give them money you'll be screwing yourself over.\nThey'll just be in debt again in a year or two. Why waste it",
            "score": 1,
            "replies": []
        },
        {
            "author": "drhagbard_celine",
            "body": "My daughter is starting school in the fall and my brother’s girlfriend just stole all my dad’s money. Guess who they’re looking to for help?  The fact that I’ve been able to save for her school has been a miracle. There’s nothing else. They told me she can get loans.  NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brother-Cane",
            "body": "NTA.  Don't set your future ablaze to keep someone else warm now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArmadilloNext9714",
            "body": "NTA. your parents can file for bankruptcy if they truly need to get out of the situation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "meekonesfade",
            "body": "NTA. That is a gift your grandparents gave to you.  I assume your grandparents set it up as a tax free education fund, so it would cost quite a bit to use it to pull it out as cash.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soggy-Slugie",
            "body": "Definitely NTA. It's not your job you don't owe it to them they decided to have kids, children aren't there to ease burdens and that mentality is disgusting. Them asking that from you is deplorable. That's your future! They would be setting you up to fail taking that away. Absolutely NTA. I don't understand how any parent could expect that from their child let alone want their child to go without because of their own mistakes!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MessageMePuppies",
            "body": "NTA, that money is yours to use for your education and nothing else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Many_Worlds_Media",
            "body": "Unless your parents are about to be homeless and starving without your help, you’re NTA - and what’s more, they’re being incredibly short sighted. If you don’t have a college fund, you’re either going to be in the job market without a degree (so - unlikely to be able to support them in old age), or they’re going to have to co-sign student loans that will effect their credit negatively - and saddle you or all of you with payments for - in all likelihood - the rest of their lives. \n\nIf they are about to be homeless and starving without your help, then I think helping them for a couple of months makes sense while they get things sorted - but that does not look like handing over your whole college fund, or maintaining their current lifestyle. Keeping them from imminent death may be your responsibility, but preventing them from experiencing the consequences of their actions all together certainly is not. \n\nIt sounds like your folks came from money, but never learned to support themselves. So they’re looking at your college fund as the last of the money that they have always felt entitled to - even though they didn’t earn it. It’s kind of pathetic, frankly - they never became adults. Since you *are* becoming an adult now, you’re going to surpass them. That’s going to be weird AF, but you can do it. Don’t let their nonsense make you doubt yourself, you’re the grown up in the room.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiny_Profile_9616",
            "body": "Gently remind them you did not ask to be born but because they choose to have you they were legally required to raise and take care of you but that does not give them the right to try and take advantage of you nor to sabotage your higher adult education. That being said if you still live with them as an adult rent free maybe offer to pay a nominal amount of rent. So if there are rooms available to rent in your area for say $700 offer to pay like $400 a month for rent but let them know that is it no utilities or anything else (even if you have to get a job that sometimes is a part of life even as a full time collage student), but tell them that you must see them cutting back to help themselves too or you will just go live with the grandparents (if they are still around) or apply for collage housing scholarship/loan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Initial_Potato5023",
            "body": "NTA  I don't get parents who believe their children owe them for raising them.  They CHOSE to have kids which involves caring and raising them.  Do not budge on this.  NOT your fault they can't get THEIR finances in order.  YOUR grandparents saved that money for YOUR education not to be used as a bail out for your parents BAD financial choices.  Stand you ground",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kathrynlena",
            "body": "Your parents didn’t do you a favor by raising you. They chose to have a child and then they fulfilled the legal obligations that go along with making that choice. They’re manipulating you and trying to take advantage of you. They should want you to have the best chance at a great future. They’re bad parents for trying to make you feel responsible for their own bad financial choices.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shot-Ad4643",
            "body": "Your parents are losers. They have poor finances because they used bad judgment.  Parents are expected to financially support their children without an expectation of reimbursement.  Moreover, your grandparents provided you with that money for a very specific purpose: to obtain a college education. Using any portion of the money to bail out your parents is disrespectful to your grandparents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Business_Chart_5733",
            "body": "As a parent myself I can't imagine robbing my kids college fund.\n\nDo not give them any money.  These kinds of people will take you right down with them and not give it a second thought.\n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kooky-Situation3059",
            "body": "NTA\n\nParents don't get money from children for \"raising them\", that little nugget they dropped on you is ridiculous.  A parent's job is to support their child, to expect some type of reimbursement for doing the responsible thing, is both idiotic and immature.\n\nHere is a little thing to pay attention to in the future, I am not sure if you are in the US, but the last time I checked you do NOT inherit your parent's debt, their estate will cover it, if it cannot cover the whole debt it will go unpaid, so if this threat was levied against you, please be aware. That is not to say that covers another country's laws, or if the law was changed in your state, do your due diligence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Complete-Toe-8213",
            "body": "Their poor money management is not your problem. Its not your job to bail them out. They should know that you will be able to sue that money to get an education and improve your lot in life. I'm not saying don't ever help them out. Hell maybe when you have the degree you can help them if you choose, but with your college fund?? Hell no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ditzy091313",
            "body": "NTA...\n\nNow I try to stay neutral and look at all sides. If they asked, you said no and they said ok, I wouldn't blame you for giving him a few dollars just to help out.\n\nBut their reaction to you saying no is unacceptable & selfish.\n\nI really cannot understand how parents think they have kids just to have the kids bail them out. I can see a healthy parent/child relationship and a parent ask for a favor: helping after a health issue, helping with a house issue, maybe a small loan. But EXPECTING, GUILTING OR BEING MANIPLUTIVE with thier children is unacceptable!",
            "score": 1,
            "replies": []
        },
        {
            "author": "californiawins",
            "body": "NTA! Protect your college fund. They will just piss it away way more easily than they did with their own hard earned money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RhubarbExpensive7092",
            "body": "NTA. And this is coming from a poor woman who worked hard to set aside money for my daughter for college. A LOT of money. After paying rent, I barely have money even for f8. Never would I EVER dream of asking for that money!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Place6262",
            "body": "NTA. It’s so sad they’re choosing to treat you like that and hope your relationship gets repaired one day. A lot of families, especially from lower income backgrounds, act like that and try to guilt trip their children into feeling bad for them about how they made mistakes in their life and now need their children to sacrifice their own future to help with said mistakes. If you’re grandparents are still with you, please have them secure those funds in a way where your parents have zero access to it. Furthermore, you should consider having your credit freezed so they can’t take out credit cards or open up accounts dealing with credit in your name as that often happens to kids of financially irresponsible parents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DixOut-4-Harambe",
            "body": "NTA. \n\nYou'll be in far better shape to help them later when you have an education and you're not in crippling debt. \n\nUntil they, they could learn to budget and balance their checkbook. \n\nDon't set yourself on fire to keep others warm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imaginary-Friend-228",
            "body": "This may be a new problem from your perspective but I guarantee they have been bad with money for a long time. You are correct that this is not your responsibility. Don't get caught in the poverty/debt cycle",
            "score": 1,
            "replies": []
        },
        {
            "author": "rikarleite",
            "body": "NTA, you shouldn't pay for their mismanagement.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wthjh",
            "body": "NTA welcome to adulthood where your parents might hate you. A lot of parents end up being entitled to any upper and you have in life. Really, you should be left to grow and succeed, and once you are established you can see what you have to help them. I NEVER help with straight up cash. I put them on my cell phone bill, I buy groceries occasionally, I cover car insurance. That's about all I can do. Parents sometimes have to realize they need to retire and it won't be pretty for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "joolster",
            "body": "Yeah grandparents knew exactly what they were doing. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lmmontes",
            "body": "Just curious if one of the reasons they saved the money was knowing your parents wouldn't be able to save considering their spending. NTA regardless.",
            "score": 1,
            "replies": []
        },
        {
            "author": "irenehollimon",
            "body": "NTA\n\nThat money was meant for your education. That’s where it should go.\n\nAlso, if your parents are in debt because of overspending and bad business choices, the money you give them would only help out temporarily. Their behavior towards money isn’t going to change. Once you fix your problems for them, they will go back to overspending and making bad business choices. \n\nYour education however, is forever. Take care of your future. Let them be responsible for their past  mistakes. Just because they raised you doesn’t mean you owe them your education and your future.\n\nThe silent treatment is emotional manipulation. Don’t give into it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IrreverentIceCream",
            "body": "NTA. A child does not owe their parent for being a parent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Travelchick8",
            "body": "I assume they want you to then take out loans to pay for school. So essentially, they are asking to you swap their debt for your own. You have terrible parents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GiftShopExit",
            "body": "NTA!! Don't you dare give your college money to those spendthrifts! Don't even discuss it with them. Start looking for another place to stay if necessary. These people would run through your college fund in a heartbeat and STILL be broke. Put your own mask on first!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chaos1957",
            "body": "There are other ways of addressing debt than taking your child’s education fund.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThanosSnapsSlimJims",
            "body": "People that are bad with finances will ruin their future and then are willing to destroy someone else's future thinking they can fix their own. Don't do it.NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GiftShopExit",
            "body": "NTA!! Don't you dare give your college money to those spendthrifts! Don't even discuss it with them. Start looking for another place to stay if necessary. These people would run through your college fund in a heartbeat and STILL be broke. Put your own mask on first!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MikeyMBCA",
            "body": "NTA.\n\nSounds to me like, from the very beginning, your parents have made bad financial decisions (risky investments, taking on excess debt) with the thought in mind that they could always use your college fund as their emergency rescue plan.\n\nGood on you for telling them no.\n\nThey have a responsibility to raise and care for you.\n\nYou do NOT have any responsibility to rescue them from faulty assumptions and bad choices.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChampionshipBetter91",
            "body": "Obviously, you say no. And I wonder if this was your parents plan all along: \"Doesn't matter what we spend, we've got OP's college fund!\"\n\nIt all depends on how this fund was set up, too, about whether or not you can \"give\" it to them, anyway. If it's a trust, then a trustee is in charge of disbursements - doesn't sound like the trustee is a parent, and a trustee usually pays the bills directly. If it's a 529 or the like, you can ONLY withdraw the money for educational purposes; otherwise you incur massive penalties. Also, the recipient of the 529 is in charge of it; your parents didn't set it up, so they can't withdraw it.\n\nIt sounds like you're in charge of the money. I'd safeguard the hell out of it. Get a safe deposit box where you put all your important papers: birth certificate, SS card, bank info, educational fund info. AND LOCK DOWN YOUR CREDIT NOW. If your parents are desperate, they'll commit ID fraud/theft. If you're living at home, move into a dorm ASAP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "plantprinses",
            "body": "Nope. Bad investments is one thing, overspending another. You're not turning your back on your parents, you're making them take responsibility for their own actions. You didn't cause the debt; they did. Therefore, they are responsible for getting rid of it. Why would a parent, who wants the best for their child, make the child responsible for what is not their fault?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpaldingPenrodthe3rd",
            "body": "NTA. Don't let them get to you. It's their own fault they are in that situation. And your parents have to legally take care of you until you are 18.  They want credit for something they were supposed to do.\n  You have to understand that you can't give in no matter what they say. If you do this when will it stop ???  Especially if they don't change their habits.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotSoAverage_sister",
            "body": "NTA\n            \n\n\n              \nObviously, this is a ridiculous request. But more than that, it's an example of their bad financial planning. \n                    \n\n\n\n\n                  \nChildren who grow up and have a good relationship with their parents and who are financially healthy will often bear the burden of the care of their parents. Often, this is willingly done because of the love and appreciation they have for their parents. \n                    \n\n\n              \nIf they take your college fund, not only will you resent them, thereby causing a strain on your relationship, but they will be crippling your financial future. What's going to happen when they need help to take care of themselves? Home health care isn't cheap, not are assisted living facilities. How are you going to help pay for that (assuming you are willing) if you are paying off student loans?\n                 \n\n\n            \n          \nYou aren't required to help your parents in their old age, but my parents did it because they wanted to. And they were financially able to do so.\n                         \n\n\n               \n\n\nYour parents' request is solving today's problem by causing future problems .",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlackiePipeSprings",
            "body": "NTA. Please don't give them the money!  Your grandparents know your parents are financially irresponsible. When you have an education and a well-paying job then maybe you can consider helping them. Although giving them money will never end.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Content-Army2384",
            "body": "NTA. Tell them they've already received the support of being freed from the obligation to help with your college fund to begin with. If they wasted that extra money too, that's on them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hurling-day",
            "body": "NTA. They have been counting on having access to your money, hence the overspending.",
            "score": 1,
            "replies": []
        },
        {
            "author": "loganmn",
            "body": "Nope. Nta.  Your parents made their choices.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoapGhost2022",
            "body": "NTA\n\nThey got themselves into debt with their bad decisions, it is not your responsibility to take them out. All they will do is get right back into it again, and your money would have gone to waste.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Creepy_Push8629",
            "body": "NTA. Tell them to file for bankruptcy like every other adult that fucks up like they did.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChooseKind24",
            "body": "NTA. Poor choices on their part doesn’t mean you should follow suit. Without your education, your choices become limited. I’m sure you can find a way to help without sacrificing your education, but knowing the expense of education, they should not expect you to fix it for them. They are not destitute, homeless, or starving, are they?",
            "score": 1,
            "replies": []
        },
        {
            "author": "alphaphiz",
            "body": "First how much debt? If your self saved college fund could cure their problems Im guessing less than 50k. Next how old are your parents?",
            "score": 1,
            "replies": []
        },
        {
            "author": "nofaves",
            "body": "It would be one thing if your parents suffered a crippling loss due to an unexpected calamity. But they're asking you to rescue them from their own misdeeds, and that's not fair.\n\nThey possibly have financial options like bankruptcy to fall back on, but those options mean giving up all the credit cards and selling off things of value. They may be attempting to enlist your help in order to avoid having to sell off the second car and to be able to keep their credit lines open.\n\nStand strong. They'll figure out something, and while they're working out their financial difficulties, you'll be building a stable future. Good luck.\n\nNTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jjjunooo",
            "body": "NTA. They're the ones being selfish. It's insane to try to make you give up such a great opportunity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tzweezle",
            "body": "You didn’t ask to be born. You shouldn’t have to give up your ticket to a better life to help them out of their poor choices",
            "score": 1,
            "replies": []
        },
        {
            "author": "Due-Compote-4723",
            "body": "NTA. They will get over it when they realize that your future is at stake here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnnonmousinONT",
            "body": "NTA..so because they overspent they now expect you to take on massive debt and they don't see that as selfish? Your parents are very manipulative and please don't let them quilt you. The money isn't theirs it's from your grandparents for school not to get them out of their debt ",
            "score": 1,
            "replies": []
        },
        {
            "author": "FatherSonAndHolyFuck",
            "body": "NTA - consequences arent just for children, not sure why so many parents think so",
            "score": 1,
            "replies": []
        },
        {
            "author": "harbinger06",
            "body": "NTA. They’re adults and they made their choices. You aren’t responsible for that. They raised you. They were legally and morally *obligated* to care for you, that does not come with a debt. Your grandparents were very generous in providing for your education, and it’s a good thing too since your parents cannot manage their finances appropriately.\n\nBailing them out would not change their habits. If they overspend, they will continue to do so but with your money. Make sure your credit is locked down so they cannot take out loans/accounts in your name. If your parents quit talking to you over this, rest assured they will be back the next time they need money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UniquelyInspired",
            "body": "NTA your parents should be proud of you for being mature and responsible enough to not want to get yourself into a situation like they’re in.  That is our number one job as parents.  If they’re not? just know that you have a stranger, Internet mama who is very proud of you.!!!! 💜",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deep-Okra1461",
            "body": "NTA Don't do it. For one thing, if they got themselves into this much debt, what good is giving them more money? They will just go right back into debt again. Your parents are just looking for a quick and easy solution and taking money from would be the easiest thing for them. You don't owe them for raising you. Raising you is a basic requirement of being your parents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "andmewithoutmytowel",
            "body": "NTA because frankly, it's not their money, your grandparents set it aside for you, it was their gift to you for the explicit purpose of your education.  Your parents were wrong to ever ask for it. I set up college funds for my kids, and they have close to $60k in each of their accounts, but that's their money, I'm just holding onto it for them until it's time to use it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HobartTasmania",
            "body": "\"bad investments\" I could possibly maybe forgive, but definitely not overspending.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Limp_Buy_4016",
            "body": "NTA You can help them more in the future by having a secure future.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Matelot67",
            "body": "NTA, that was left for you. You are not responsible for their irresponsible financial behavior.",
            "score": 1,
            "replies": []
        },
        {
            "author": "uTop-Artichoke5020",
            "body": "NTA  \nYour parents are the ones who are being exceptionally selfish. They are willing to put you in a position of either quitting college or taking on massive debt yourself. Not decent parent would ever conceive of doing that to their child!!   \nThat they would say you actually owe them disgusts me. When we have children, we are making a commitment to care for and provide for them until they are at least 18. Many of us do our best to get our kids through college to give them a debt free start to adulthood. You owe your parents absolutely nothing, not even your respect if they continue to freeze you out!!  \nYour grandparents provided for your future. It's not even money your parents sacrificed as you were growing up!! They have no right to ask for that money.  \nStay strong, do not let them rob you of your future.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mini6cakes",
            "body": "NTA. Your grandparents set up this fund and gave it to you because they knew your parents, couldn’t be trusted with the money. Good luck in college 👍",
            "score": 1,
            "replies": []
        },
        {
            "author": "WholeAd2742",
            "body": "NTA\n\nThis is likely why your grandparents set it up a separate fund for your education versus giving your parents the money directly.\n\nThey have made their own poor financial decisions and consequences. That's not your responsibility to fix for them",
            "score": 1,
            "replies": []
        },
        {
            "author": "EternallyGrateful115",
            "body": "NTA, and I hate their reasoning here. Feel free to remind them that raising you is something they were legally and ethically obligated to do, because THEY'RE YOUR PARENTS. They chose to have a child, and that comes with a requirement to then raise said child (you).   \nThere is no world where you are then required to take care of them- you're welcome to, and it's often looked upon favorably when an adult child does so, but that's also something that shouldn't be coming into play until you're a whole bunch of years older and have had time to build a good career and take care of yourself first.  \nIf you're feeling generous, you could try to help them learn to budget better or something- given their financial situation, I would be willing to estimate that they aren't great at it themselves. Maybe help them learn a side hustle or something, so they can try and get some extra income to deal with some of their debt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LetMeBeAngry",
            "body": "NTA and make sure you tell your grandparents about this, as they’re the ones who set up the fund and it’s their money sitting in it\n\nAnd as an aside: parents choose to have children, but children do not choose to be born. You don’t owe your parents anything for raising you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LetMeBeAngry",
            "body": "NTA and make sure you tell your grandparents about this, as they’re the ones who set up the fund and it’s their money sitting in it\n\nAnd as an aside: parents choose to have children, but children do not choose to be born. You don’t owe your parents anything for raising you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gcot802",
            "body": "Absolutely NTA\n\nYou do not owe your parents a tab for raising a child they chose to have.\n\nThat money is also not yours to give away. It’s your grandparents, which they are gifting you to help with school. This shouldn’t change ESPECIALLY if they are no longer with you. They said what they wanted to money used for, so that’s what it should be used for",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleepingrozy",
            "body": "NTA.  It sounds like your grandparents knew your parents were bad with money, that's why they saved and managed the account for you. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "PessimiStick",
            "body": "NTA.\n\nYou have no responsibility to help your parents.  They have every responsibility to help you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PoppysWorkshop",
            "body": "Buy them the book from Dave Ramsey, The Total Money Maker Over.... They are adults, and should be adults and get themselves out of their self induced problem.  And that is NOT by ruining you.\n\nThey should not be taking your college money and putting your financial future at risk.  This is selfish on THEIR part, and an extension of their bad financial decisions. NOT YOUR PROBLEM!\n\nNTA\n\nPS: My father did this to me when his alcoholism controlled his life and he was living on social security. He wanted me to ay for his apartment, even though he was spending more than $500/mo on booze.... He said \"I owed him\"... that was one of the last times I ever spoke to him.  It was more than 20 years that we were estranged from one another, as I went Zero contact, to the day he died.  And he died alone in a VA nursing home.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ardara",
            "body": "NTA ",
            "score": 0,
            "replies": []
        },
        {
            "author": "VantamLi",
            "body": "YTA. Blood is thicker than water.",
            "score": -12,
            "replies": [
                {
                    "author": "ButterflySilly2340",
                    "body": "Why don't you tell that to the parents who ask their child to sacrifice her future for them?",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}