{
    "title": "AITA For giving up on my friend?",
    "author": "ArmyITDuvall",
    "subreddit": "AmItheAsshole",
    "rank": 17,
    "score": 53,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 46,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1je1xwr/aita_for_giving_up_on_my_friend/",
    "id": "1je1xwr",
    "selftext": "I’ve tried for literal years to help my friend get his life together. \nHe can’t get away from the alcohol and cigarettes. \nIt’s like he wants a pity party everyday of his life.\n\nI’ve spent 2 thousand dollars taking him on a vacation to try to spark a little light on him to realize what life could be like if he got it together \n\nI’ve filled up his car, bought him groceries when he had no money. I made his resume and applied for so many jobs. \n\nI finally got him an interview and he doesn’t go to it because of “the depression”.\n\nLife doesn’t stop because you’re depressed. And despite almost dying, getting arrested. He can’t give up the alcohol yet refuses rehab\n\nI’m tired of trying. \nI feel horrible for him because he has no family but he’s a grown man. \n\nAs God as my witness I’ve tried for years. \nTo get him to do something with his life. \n\nBut I need to move on with own. \nI’m heartbroken. \n\nSorta a rant but oh well. AITA?\n",
    "comments": [
        {
            "author": "Judgement_Bot_AITA",
            "body": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I gave up helping my friend\n2. He has no other family to rely on\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n[Check out our holiday break announcement here!](https://www.reddit.com/r/AmItheAsshole/comments/1h3wnsj/aita_monthly_open_forum_december_2024_a_holiday/)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "MeatGRips",
            "body": "You cant help someone who doesn't want to help themselves, i know they are your friend and its hard to just watch someone close to you destroy themself but at this point it sounds like your doing harm to your life just being involved, also sounds like your the only reason he hasn't hit rock bottom which is something maybe this person needs.",
            "score": 91,
            "replies": [
                {
                    "author": "Majestic_feline00",
                    "body": "Dude you took the words right out of my mouth",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Barnabeo",
                    "body": "Totally true!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "chonz010",
                    "body": "Yup",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LaughingAtSalads",
            "body": "Go to Al-Anon. You accidentally enabled him, which is what almost all friends/family of alcoholics do. Not your fault. NTA. But get support for your correct and painful decision.",
            "score": 30,
            "replies": [
                {
                    "author": "No_Builder7010",
                    "body": "Upvoting bc AlAnon would really help you thru this. You don't have to cut him off but you also don't have to take on the responsibility of curing him. I wish you both the best!",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Glad_Ostrich_9709",
            "body": "Depression and addiction are a tag team that can thoroughly ruin lives. While a tragedy every time it happens, it doesn't mean you need to join the person in their abyss. You come first. In every aspect of life, no matter what you do, always consider yourself first and foremost. Literally nobody else will. \n\nYou tried, OP. If it wasn't enough, then it wasn't enough. Sometimes walking away is all you can do, even if it's painful. \n\nNTA. I hope you can heal from this in time. Take care of yourself.",
            "score": 14,
            "replies": []
        },
        {
            "author": "NeitherBartNorBert",
            "body": "NTA. You clearly value this person. You tried, you spent a lot of time, effort, and money. You didn't need to do any of these things either, you would still not be the asshole. It really feels like it is the time for you to just let him go.  \n  \nA horrible truth about life is there are millions of people you would desperately want to help if you knew them personally. But you can't help everyone. Think of it this way: maybe he emotionally relies on your support, and he needs to lose it to realize he must act.",
            "score": 7,
            "replies": []
        },
        {
            "author": "JustStuff03",
            "body": "NTA. Traveled down this road with my eldest brother, have another brother doing the same stupid thing - even though we both watched lives and families destroyed by this addiction. You're not giving up on the person, as much as you are realizing your efforts are a crutch to a problem only they alone must make the effort to solve/manage. Some people cannot stop using their addiction as their excuse for inaction. Some people cannot stop using their depression as a justification for continuing the addiction. These two default coping mechanisms become so deeply ingrained, all other healthy behaviors fail to take root. \n\nWhen you have a hammer(alcoholism) every problem looks like a nail(reason to drink).\n\nYour friend needs professional help. At the most, you could offer to sit through sessions with them if they thought it would start a healthy trend. But it's not your responsibility to do so. You've extended yourself well beyond what's required. It's perfectly fine to step away from this, knowing their wellness isn't based on your efforts or desires but their own.\n\nIt's not a bad idea to find a little bit of therapy for your own wellbeing. Surviving as a witness to addiction can be just as traumatic as supporting a terminally ill patient. There is guilt, frustration and grief as you watch them struggle. If an unfortunate end to their story comes, it's helpful to have processed and prepared a portion of the tidal waves of emotion that come with.\n\nGood luck to you. This is one of those life decisions that is always easier said than done. I hope you are kind to yourself as you find your way.",
            "score": 4,
            "replies": [
                {
                    "author": "chonz010",
                    "body": "Well said",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Majestic_feline00",
            "body": "NTA. It’s hard wanting to help someone who isn’t ready to receive it. He has to be willing to help himself too",
            "score": 4,
            "replies": []
        },
        {
            "author": "SeleneWish",
            "body": "You’re not the asshole. You’ve dumped years, money, and heart into pulling your friend out of his spiral, but he’s a grown man who keeps picking booze and self-pity over every chance you’ve handed him, walking away isn’t you failing him, it’s you saving yourself.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Roam1985",
            "body": "NTA\n\nCan't do more than you can do.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SavingsRhubarb8746",
            "body": "NTA. Sounds like he's an addict and (as is the case with many addicts) also has mental health problems that he's either treating with alcohol, or are caused by alcohol, or both.\n\nEventually, you need to realize, having tried everything, that this is something you can't fix. Go to Alanon, or some similar resource for people who are friends or relatives of alcoholics, for information on dealing with alcoholics when you aren't one yourself. \n\nMaybe, when he's ready, he will take advantage of some form of treatment - support groups, rehabs - and, probably after numerous relapses, recover. Maybe he won't. Many addicts die before they recover, or admit that they need to recover. But that's not your fault - you've done what you could, it hasn't worked, and that's not your fault. You are not all-powerful, and addiction, with its tendency to involve relapses, is an incredibly difficult thing to deal with. People who've never been that bad, who've merely used more or less socially and then stopped, think all drinkers (or drug users) can do the same and just stop. But people who are seriously deep in addiction can't, and you can't make them stop or help them change.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’ve tried for literal years to help my friend get his life together. \nHe can’t get away from the alcohol and cigarettes. \nIt’s like he wants a pity party everyday of his life.\n\nI’ve spent 2 thousand dollars taking him on a vacation to try to spark a little light on him to realize what life could be like if he got it together \n\nI’ve filled up his car, bought him groceries when he had no money. I made his resume and applied for so many jobs. \n\nI finally got him an interview and he doesn’t go to it because of “the depression”.\n\nLife doesn’t stop because you’re depressed. And despite almost dying, getting arrested. He can’t give up the alcohol yet refuses rehab\n\nI’m tired of trying. \nI feel horrible for him because he has no family but he’s a grown man. \n\nAs God as my witness I’ve tried for years. \nTo get him to do something with his life. \n\nBut I need to move on with own. \nI’m heartbroken. \n\nSorta a rant but oh well. AITA?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible-Most-366",
            "body": "Just get him to a professional. If you can. He needs help beating your possibilities, but I am thankful in this world for people like you. NTA if you reached your limit. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "amelia611",
            "body": "NTA, you've done what you could, but you also need to take care of yourself. It's honestly best to just move on because you can't help him any further.",
            "score": 1,
            "replies": []
        },
        {
            "author": "starksdawson",
            "body": "You can only do so much. You tried. What I’ve learned in 3 years of working in substance use and mental health is that someone is not going to stop or get help unless THEY want to. You can’t help them if they don’t want it.\n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Individual_Metal_983",
            "body": "The fact is you cannot save him. He has to want to save himself first.\n\nThat starts with going to the doctor and a support group for alcoholics. Alcohol is a depressant. \n\nIf he won't do that you have to do what you must do for your own sanity. \n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldSaggytitBiscuits",
            "body": "NTA at all, you did more than most. Addiction is tough, and there does come a point where you just can't do any more. Be there if he decides to get help, love him from afar, but it's time to protect yourself and your heart. It doesn't mean you don't care for him, it just means you can't do anything to help without him helping himself. God bless.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hexor-Tyr",
            "body": "Walk away.\n\nLeave him with a suggestion for therapy, then walk away.\n\nGive him an ultimatum, and walk away if he doesn't agree.\n\nEither option works, you have no obligation to help him, especially when it comes at the risk of your own life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wesmorgan1",
            "body": "NTA - you can't set yourself on fire to keep someone else warm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BigGreenBillyGoat",
            "body": "Until he it’s rock bottom, he won’t change, and maybe he won’t change even then. By inserting your assistance into his willfully crumbling life, you’re delaying the point that he hits rock bottom. In other words, you’re not doing him the favor of letting it all crash down on him so he HAS to decide to get better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chonz010",
            "body": "NTA. It sucks watching people go down this hole but my former roommate was the same way. It’s frustrating because I’m not trying to diminish the existence of depression but it’s not the “get out of jail free” card to evade consequences of their actions. I cared about this person so much but they were making horrible decisions and I had to step back. It started to affect me mentally and I just couldn’t do it after so much time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "live2begrateful",
            "body": "You can help those that don't want the help.  You are actually enabling them.  If you stop, then they might get the help they need.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible-Kale-904",
            "body": "Am wishing I had a friend like you\n\nYour life matters\n\nBuild yourself and your healthy happy dignified prosperous worthy LIFE\n\n\nN\nT\nA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mythandros1",
            "body": "NAH.\n\nI've been where your friend is. It was a long time ago and I'm fine now, but I've been there. Depression is vicious. It makes you not want to do ANYTHING. It makes you feel tired and hopeless. It makes you not want to change anything because what's the point and nothing is going to change, at least that's what it feels like.\n\nThe help of a friend is always good but can be very difficult to accept, especially when you think nothing is going to change.\n\nAt some point, your friend needs to grow tired of being depressed and take those first steps mentally.\n\nIt's like the old saying: You can lead a horse to water, but you can't make it drink.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blaiddyd_enjoyer",
            "body": "NTA, you can lead a horse to water but you can't force it to drink. Your friend is a hydrophobic horse",
            "score": 1,
            "replies": []
        },
        {
            "author": "Velvet_Samurai",
            "body": "Everything you did up until this point was great, but if you keep doing those things after you realize he's not going to change it's called enabling.  Walking away is literally your only option.  I hope you can move past this decision, I know it's hard.  And without you, who knows, your friend might actually get the help he needs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drazilou",
            "body": "You can take a horse to water, but the horse has to drink. So unless the horse *wants* to drink, stop taking it to water. \n\nSo:\n\nGive up on taking the horse to water. \n\nDon't give up on the horse.\n\nLet him know you'll be there for him whenever he needs you. By being there for him when *he* needs you, not when *you* feel he *should* need you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrGreyJetZ",
            "body": "NTA.  \nI had a friend like this.   \nHe and I were like brothers in college. He got an MBA, would get great jobs, then drink it away.   \nWe grew apart. He contacted me a few years ago to say he was sober but wanted to move to a larger city that had more opportunities. I asked my wife who agreed we could help him out for a few months.\n\nHe showed up drunk.  \nNeeded to go to the ER to dry out  \nThen got a job, but quickly lost it do to drinking again. \n\nI dropped him off at a shelter, washed my hands of him. He is in jail now for OWI and theft.",
            "score": 1,
            "replies": []
        },
        {
            "author": "forreasonsunknown79",
            "body": "If your friend is a true alcoholic , then rehab is the best option. Depending on how much alcohol they drink each day, it can be deadly to quit col turkey. Be careful with it. I highly recommend a treatment center that is qualified to deal with this. Should you give up? No, but you should disassociate from him and let him hit his bottom. I say this as a recovering alcoholic and addict with 20years of sobriety.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Awkward_Un1corn",
            "body": "NTA but\n\n>Life doesn’t stop because you’re depressed\n\nFor some people it does. \n\nDepression isn't simply a state of mind or an emotion, it is a problem with your brain chemistry. For a lot of people depression sucks the drive out of them, the will to live and fight. \n\nYou cannot help someone who doesn't want to be helped but don't for a second think that mental health can be solved by powering though or by a good day. He needs a doctor, not a vacation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LunaPerry1980",
            "body": "It's the horse and water number. You can lead a horse to water, but you can't make it drink it. It's like your friend is the horse, and you're the water. You're trying to do everything in your power to help him with his problems, but he will not accept it. The best situation you can do is walk away and let him hit rock bottom. Then, and only then will he be able to reach out for help. Continue being his friend, not his anchor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slap-a-frap",
            "body": "NTA - you're setting yourself on fire just to keep him warm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HandBananasRevenge",
            "body": "NTA. \n\nIt is not your job to parent or be a caretaker to this friend. \n\nSome people prefer chaos to order, even if they say otherwise. \n\nThink of all the energy you can put into yourself or into other friends who aren’t losers. \n\nAre you a loser, OP?  Seems like you are not. So why would you associate with one?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jetro-2023",
            "body": "NTA- you have done more than most people would have done in your situation. It is true you can’t help someone who doesn’t want to help themselves. Unfortunately I think that’s the situation you are in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoizenberryPie",
            "body": "NTA.\n\nTo be frank, there's only so much you can do. Find a local Al-Anon group to go to, you'll be able to talk to other people in your position. You might also benefit from seeing a counsellor, just to help you process some of these things.\n\nSometimes it takes hitting rock bottom for people to make realistic changes. At some point there has to be internal motivation as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gothicel",
            "body": "Stop helping, let him start deciding for himself if he wants to swim or sink.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strap-on-Pigeon87",
            "body": "NTA, in circles of people that do programs for alcohol you're known as an enabler. You are helping him maintain his addiction without realizing it, giving him aid for gas, groceries, looking for jobs,  in a way you're giving him the ability to keep drinking by doing this. It sucks but he needs to hit rock bottom in his own. The sooner you let him fall then hopefully the sooner he can bring himself back up out of this hole. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nyx-by-night",
            "body": "YTA. I understand you’re frustrated and you’re massively out of pocket, but he is mentally unwell and clearly has an addiction, which is also a form of ill mental health. He doesn’t need your money, he needs your support. He doesn’t need holidays, he needs treatment. You are well within your rights to walk away from this friendship, I understand this has taken a toll on you. But please remember that poor mental health and addiction are choices people have made, they are situations they sometimes find themselves in.",
            "score": -1,
            "replies": [
                {
                    "author": "chonz010",
                    "body": "Nah I disagree. It’s so much easier said than done. OP isn’t a professional and it’s not their job to seek help for somebody who won’t comply. Taking them on a nice trip to decompress, giving them groceries and a little cash is beyond kind.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "greenthumbgal924",
                    "body": "Scrolled too far to find this. OP sounds like a martyr who is mad his clearly unwell friend doesn’t give him a pat on the back for trying to help his, as OP put it, “depression”",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "khuddukhi",
            "body": "NTA  \nYou know there is a limit on how much you can try. You have a duty to yourself. Dont be heartbroken. I think you didnt give up on him. You have done your part.",
            "score": 1,
            "replies": []
        },
        {
            "author": "First-Industry4762",
            "body": "YTA, kindly, go talk to a therapist and figure out why you have this saviour complex. Because this:\n\n>I’ve spent 2 thousand dollars taking him on a vacation to try to spark a little light on him to realize what life could be like if he got it together\n\n> I made his resume and applied for so many jobs.\n\nIs really an unhealthy amount of time and effort to put into someone who doesn't even attempt to get better. \n\n\nYou have been basically throwing your money and time into a fire. I think from your side you should have called it quits years ago. The fact that you kept spending effort and money despite zero attempts from his side makes this really unhealthy from your side.",
            "score": 0,
            "replies": []
        }
    ]
}