{
    "title": "AITA for refusing to invite my fiancé’s cousin’s brand new boyfriend to our wedding?",
    "author": "Desperate-Ease-9637",
    "subreddit": "AmItheAsshole",
    "rank": 9,
    "score": 190,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 139,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1je34wl/aita_for_refusing_to_invite_my_fiancés_cousins/",
    "id": "1je34wl",
    "selftext": "We are getting married and I (33F) am paying for a good chunk of the wedding. \n\nI personally wanted to elope at this stage of life and take a long vacation in Europe. My fiancé (37M) wants to have a blow out wedding. We decided to compromise and have a wedding in our home state and keep the guest list to 80 and under. Especially since I’m paying for a majority of it out of pocket. \n\nHis mom started out this wedding planning process saying, “ You should do whatever you want. It’s about YOU. Don’t let anyone influence your decisions.” Turns out she means that as long as SHE is the biggest influence on our wedding. Beyond insisting she wear a CREAM colored dress, sharing our wedding website with people without asking if that was ok, wanting her son’s hair to be styled a certain way… she’s been extremely difficult. \n\nHer latest endeavor has been inviting people to the wedding without our approval. She’s invited 5 of her friends without asking and her excuse was that “I just assumed that they were invited. They invited me to their children’s weddings.” \n\nThe newest problem is that her niece (40F) who lives across the country just broke up with her boyfriend in October of last year. I’ve met the niece a handful of time and she’s a great girl and we want her at the wedding. But her ex boyfriend was awful and I was happy that they broke up tbh. \n\nShe let us know that the niece is dating someone new and she should be given a plus one. I refused to give her one and told my fiancé: NO. He’s been telling his mom no, and she’s saying we’re not being very nice and that the cousin will be alone. \nMy argument was that we’ve never met this new person, they just started dating, and she will NOT be alone she will be around family. I guess her siblings are all married, so in that sense she will be alone. I also am trying to save us as much money as possible and never wanted to have a huge wedding anyways. So one less person is a win in my book. \nBut I still feel like my justifications are sound and I’m right for not budging on this. \n\nAITA?\n\n\n",
    "comments": [
        {
            "author": "Judgement_Bot_AITA",
            "body": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for not giving the cousin a plus one for her new boyfriend?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n[Check out our holiday break announcement here!](https://www.reddit.com/r/AmItheAsshole/comments/1h3wnsj/aita_monthly_open_forum_december_2024_a_holiday/)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DinoSnuggler",
            "body": "NTA.  Time for your fiancé to have one final conversation with his mom letting her know that she doesn't get any input in the guest list or anything else, and if she oversteps she's going to lose her own invite.  She's already going to look pretty silly when all these randos she's invited don't end up getting invitations.  Because you're not sending them invitations, right?  RIGHT?",
            "score": 522,
            "replies": [
                {
                    "author": "60moonchild",
                    "body": "Your 37 yr old partner wants a big blow out wedding and your paying for it??? And his Mom is walking all over him ( and you)!  A taste of your future- MIL with no boundaries AND a husband with no spine. Fun times. Good luck.",
                    "score": 402,
                    "replies": [
                        {
                            "author": "OkeyDokey654",
                            "body": "Does he want this big blowout, or does his mother want it?",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "kaldaka16",
                                    "body": "That's my question too. I understand a compromise when two people getting married have different goals for how their wedding goes but I'm seriously questioning how much of this is from him and how much from his mother. \n\nThis is not letting him off the hook at all, I think it's actually *worse* if he's insisting because that's what his mother wants than if it's what *he* genuinely wants.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "OkeyDokey654",
                                            "body": "Oh yeah, it’s still a problem. Just a different problem.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kaldaka16",
                                                    "body": "Neither scenario makes him look good but I'd have a little more respect for him if he actually truly wanted all of this *himself*.\n\nNot a lot, but a little more than if it's just bowing to whatever his mom wants.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Responsible-Kale-904",
                            "body": "Yup\n\nI would be running AWAY",
                            "score": 76,
                            "replies": [
                                {
                                    "author": "Peet1076",
                                    "body": "Fast and far far away...",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Stock-Cell1556",
                            "body": "Yeah, I don't get this either. She's paying for a wedding she doesn't want and getting steamrolled over every decision as well!\n\nI'd take back my money and take that trip to Europe she wanted--solo. Maybe she'll find someone on her travels who'll treat her better, or at least learn how to treat herself with respect.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "Intelligent-Price-39",
                            "body": "Yep, screams shitshow and OP, if your 37 year old fiance can’t stand up to his mother now…NTA",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "OneTwoWee000",
                            "body": "Yeah, that rubbed me the wrong way. He wants a big blow out but isn’t willing or able to pay for it? Then they should be eloping.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Desperate-Ease-9637",
                    "body": "Thank you so much. I thought I was just so buried under my anger that I wasn’t thinking clearly. I was literally just thinking if all these random people show up they won’t have a place to sit LOL. I told my fiancé, because he has such a hard time enforcing boundaries with her and deciding on his own, he should give her a # of people she can invite on her side. That includes EVERYONE- her friends, family, whatever. That way she can make her own decision on who to cut. But that number cannot under any circumstances be changed. Even if I had the $, I wouldn’t want strangers there that hold no meaning to us?",
                    "score": 103,
                    "replies": [
                        {
                            "author": "AccountMitosis",
                            "body": "> he has such a hard time enforcing boundaries with her\n\nThis is a problem. And this isn't a problem that's suddenly gonna become magically better once you've tied the knot; a fiancé who can't say no to his mother becomes a husband who can't say no to his mother. A ring and ceremony *will not* change who he is, what he is capable of, and what he is willing to do.\n\nSo, you need to keep in mind that you are *staring down your future* right now. It IS possible for people to change for the better-- but only if they actually *try* to change, and seek out effective methods of changing. Events like weddings and honeymoons, though, don't change people. So what you see IS what you get, and what you get is what you will have *forever,* unless he dedicates himself in good faith to changing that. \n\nImagine buying a house together. Imagine having children.  Imagine getting seriously ill or losing a close loved one or having any number of other terrible emergencies. And then imagine what all of those things could look like if your fiancé's mom wants to insert herself into the situation and he refuses to say no to her.\n\nIt might be wise to put a pause on wedding planning for a little bit while doing some premarital counseling (and probably individual counseling for him too), so you both can work on healthy techniques for establishing *and maintaining* boundaries in the face of your impending nuptials. You don't wanna marry a guy BEFORE he learns how to say \"no\" to Mom. \n\nDon't marry a tiger and then end up like \"I wish this tiger didn't have so many stripes though.\" See if the tiger can do something about the stripes *before* making a difficult-to-exit legal, social, and/or religious contract.",
                            "score": 163,
                            "replies": []
                        },
                        {
                            "author": "FullBlownPanic",
                            "body": "Why are you paying for a wedding you don't even want to man who doesn't respect you enough to prevent his mother from bullying you? \n\n\n\nHow are you going to feel when his mommy invites her friends to watch you give birth?",
                            "score": 62,
                            "replies": []
                        },
                        {
                            "author": "Kokospize",
                            "body": "As you join in the chorus, \"because he has such a hard time enforcing boundaries with her and deciding on his own,\" do you really understand what you're admitting? You're willingly marrying a man who can't contribute towards his own wedding but wanted a \"blowout wedding,\" a man who is incapable of standing up to his mother or preventing her from walking all over him, a man who can't prevent his mother from mistreating you and a man who is tied to a future MIL from hell.  Good luck, indeed.",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "Alisa-Stoll",
                            "body": "I would not even  give her a # of people as her choices might not be your (as a couple) choices.",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "Jumpy_Succotash_241",
                            "body": "He has an interfering mother, he can't make decisions for himself or set boundaries.... and you are financially paying for most of this wedding you didn't even want? I'm sorry but why are you marrying this guy? At this point if it was me, there would be no wedding. I could not have this for the rest of my life. YTA to yourself for allowing this. ",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Desperate-Ease-9637",
                            "body": "But you RIGHT 😂😂😂",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "bobhand17123",
                            "body": "Well, that means she could invite the new BF, and that cousin might have a type (ie. awful!).\n\nNTA. Good luck.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Desperate-Ease-9637",
                                    "body": "Sorry for not being clear- My stipulation was that she was still not given a plus one! \nI’m staying firm and still trying to find little ways of compromising with this woman.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "kaldaka16",
                                            "body": "Why? You're already compromising with your fiance so much, why do you need to compromise with someone who isn't either of the people getting married *at all*??",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "boredoma",
                            "body": "Tell him to hold that line or you are eloping with him or someone else!  That old saying...Start as you mean to go on.  I don't think you want to go on being walked all over.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "newoldm",
                            "body": ">he has such a hard time enforcing boundaries with her and deciding on his own\n\nYou, your fiance and his mother just might qualify for TLC's *I Love A Mamma's Boy*.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "LobsterLovingLlama",
                            "body": "Time to have a come to Jesus about HER guests and tell her to pick another color for the wedding. Or tell her the guests can come and you take Venmo.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Commercial-Place6793",
                            "body": "Fuck all of this and do your elopement plan. This all sounds like a headache you don’t need.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "naivemetaphysics",
                    "body": "I would so be ready with red wine as well since she’s wearing a cream dress against the bride’s wishes. \n\nI hope if my kids get married I don’t overstep. I have two sons and I already know I won’t get to do things like dress shopping for a brides dress.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hdgal63",
            "body": "What I don’t understand is why are you the one paying for a wedding that your husband wants? If he’s the one that wants the blowout wedding, he should be the one paying for it. Also I would tell your mother-in-law that if she wants to invite anyone to this wedding then the cost of their meals should come from her pocket. Don’t budge and make your husband pay for the damn wedding he wants. Or give him the option to elope and take a wonderful vacation.",
            "score": 168,
            "replies": [
                {
                    "author": "Desperate-Ease-9637",
                    "body": "That’s exactly what my parents are saying. \nI love traveling, so it was really heartbreaking. \nI might just use the rest of the deposits to escape to Europe tbh.  \n👁️👄👁️",
                    "score": 109,
                    "replies": [
                        {
                            "author": "rainaftermoscow",
                            "body": "DO IT. Girl you are basically funding a day for your monster in law to make herself the center of attention. If I were you I'd see what deposits I could get back, and then I'd be giving my man an ultimatum: you can fund a party for your mother, I'm heading to Europe. You can come along and we can get married, or you can stay under her thumb for the rest of your life.\n\nIf you go through with this I guarantee your monster in law will shit talk you and/or do something ridiculous to make sure all eyes are on her.",
                            "score": 120,
                            "replies": [
                                {
                                    "author": "AccountMitosis",
                                    "body": "That \"cream\" dress is gonna end up being suspiciously colorless... and with a train, and sparkly beading, and a fancy tiara...\n\nThe Mother of the Groom dance will have her turning into a sobbing wreck with the utmost dramatic flair, to the point of nigh emotional incest.\n\nAnd her toast? An utter *fiasco.*",
                                    "score": 62,
                                    "replies": [
                                        {
                                            "author": "Wootleage",
                                            "body": ">That \"cream\" dress is gonna end up being suspiciously colorless... and with a train, and sparkly beading, and a fancy tiara...\n\nAnd hopefully a big red wine coloured stain down the front 😈😈😈",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "AccountMitosis",
                                                    "body": "And loud, pointed comments, decidedly within earshot (of the MIL, but NOT the bride), about \"Woooooow, how *embarrassing* that a grown woman decided to wear a wedding dress to someone else's wedding-- and she must be TWICE my age, at least! Bless her heart, do you think she *knows*? Well, good thing the groom's finally escaping her-- it'll be good for him to live with a REAL woman, one who has some manners! It's just so *weird* that it looks like she's marrying her own son. Isn't it *weird?* It's sooooooo *weird.*\"",
                                                    "score": 13,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Stock-Cell1556",
                                            "body": "And OP is forgoing her dreamed-of trip to Europe tp fund this tribute to MIL (and \"her Baby,\" but mostly MIL).",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "AccountMitosis",
                                                    "body": "It's not too late to cancel the wedding and decide to go to Europe instead-- even a miserable trip through Charles de Gaulle airport at its most \"under construction\" would be less of a slog, I think! And then once you've gotten through the airport, you're in Europe, rather than in a stressful marriage to a mama's boy.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Responsible-Kale-904",
                                    "body": "Excellent comment",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PanicAtTheGaslight",
                            "body": "Totally DO IT!\n\nCancel the wedding you never wanted and 1 of 2 things will happen. \n\n1) You and fiance will elope and have a kick ass honeymoon without all the stress and controlling behavior from people who are not footing the bill. MIL will learn that when you push too hard, you definitely DON’T get what you want and fiancé will hopefully learn how to stand up to his mom via actions. \n\n2) You and fiancé will break up, which will be sad, but at least you won’t have to put up with being with someone who can’t stand up to his mommy, you won’t have wasted a ton of money on a wedding you didn’t want, you won’t have given in to MIL’s demands and you’ll console yourself with a kick ass trip!\n\nLet’s face it….going through with whatever version of the wedding you have now is only going to lead to more misery and deep regret on your part. You know this was never what you wanted. You know this isn’t what you want to spend your money on. You know you don’t want to be with someone who can’t make his own decisions without his mommy. Don’t compound your misery by having the wedding your fiance/MIL want. If you do, the resentment will eat at you and you and fiance will likely end up divorced. Save yourself the hassle.",
                            "score": 42,
                            "replies": []
                        },
                        {
                            "author": "AuggieNorth",
                            "body": "Listen to your parents. They have a point.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "BriefHorror",
                            "body": "I’d love to point out that your escape to Europe is way cheaper than a divorce",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "domestipithecus",
                            "body": "Are you sure it's him and not MIL that wants the big blowout wedding??\n\nedit - also, is this how you want to live your life?",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "hdgal63",
                            "body": "Girl that would be a deal breaker for me!  Don’t spend your hard earned savings on something you don’t want!!!!  you need to have a sit down with your fiancé and really work this out, because if you don’t, you were gonna start resenting him for putting you through all of this. You are not going to enjoy this wedding you don’t even want this wedding. Don’t start your married life with resentment.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "iamasturdlevinson",
                            "body": "Make him not only pay for it but do every single bit of planning. You’re taking on not just the financial burden but the stress too. For an event that you don’t want. Eff that, darlin! Get your deposits back and tell him y’all are going to elope or he’ll be the one on the hook for this shindig. And that includes reining in his mommy. As cliche as it is, remind him of that old saying “happy wife = happy life”.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Green-Eyed-BabyGirl",
                    "body": "NO. Do NOT open the door for your future MIL to have ANY financial ownership in your wedding.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "hdgal63",
                            "body": "Not the MIL, the finance is the one that wants the wedding so that fiancé is the one who should pay for it",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Afraid-Pin5652",
                    "body": "> Don’t budge and make your husband to be pay for the damn wedding he wants.\n\nThis isn't what people say when it's the wife who wants big wedding tho.\n\nI do agree about what ya said about the people hubbies mom invited.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lycamm",
            "body": "NTA Girl, you are already paying for a wedding you didn't really want and your fiance can't control him overbearing mom? Are you sure you want to go ahead with this?",
            "score": 115,
            "replies": [
                {
                    "author": "Desperate-Ease-9637",
                    "body": "I thought I was head over heels all these years. This entire process has been awful, but eye opening. I think I was really choosing to overlook a lot of his issues, but now I feel like for my own sanity I need to seriously reflect.",
                    "score": 111,
                    "replies": [
                        {
                            "author": "AccountMitosis",
                            "body": "If you ignored all the past years, all the history, and just looked at who he is *today* and who you are *today*, and what you will both do in the future... would you marry him?",
                            "score": 55,
                            "replies": []
                        },
                        {
                            "author": "sable1970",
                            "body": "Based on this response alone OP you need to take a step back and reevaluate.  Especially if you still have time to get your deposits back.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "kj_eeks",
                                    "body": "Even if OP can’t get the deposits back. It’s much cheaper to cancel the wedding.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "icecreampenis",
                            "body": "You've got one life girl.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "squirrelsareevil2479",
                            "body": "It's a lot easier and less costly to back out now then it is to marry him and divorce later. This won't get better. Mommy dearest should have been completely shut down over the cream dress. She doesn't care about the colour, it's a power move to show you that fiancé will always side with her. Get out now before you spend too much money that you would rather travel with.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Rooney_Tuesday",
                            "body": ">This entire process has been awful\n\nThat’s the wedding industry in a nutshell. Even if you have a planner, it’s still time-consuming and expensive and there are a million decisions to be made. Unless you happen to be someone who likes that sort of thing, it’s hell.\n\nAnd you don’t even want a wedding like this in the first place? Lady, don’t throw away the whole man for this but do have a serious conversation about the wedding and his mom. Your MIL said it was YOUR day? Then you and fiancé come up with a wedding you BOTH want and are happy with. Maybe elope and just throw a giant party afterwards? Would he be okay with that? Or is he set on a formal ceremony with everyone he knows in attendance?\n\nDon’t proceed until you’re happy with the way things are going. Don’t let them steamroll you. Good luck.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "sharpcj",
                            "body": "Have you...read the r/JUSTNOMIL page? \n\nYou might spend a little time there getting a glimpse of your future. It's time to think hard about how you want your life to look.\n\nI have a grown son that I love very much, but he's been told since his teen years that he is not to live his life for me or my approval. The thought of zamboni-ing my way through his wedding and relationship makes me feel sick, and I would fully expect him to shut me down if I tried. I'm just honoured to be part of his life in any way possible.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Stock-Cell1556",
                            "body": "A solo trip to Europe would give you plenty of time to think!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tinkerbell_2369",
                    "body": "THIS!! ⬆️⬆️⬆️ I would definitely rethink this whole thing. Is this what it’s going to be like when you buy a house, have kids? What, she’s just going to dismiss your thoughts and feelings and just take over parenting your kids while your husband “says no” but doesn’t back it up with anything. What are you going to do then? Please update soon. Best of luck to you",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "deux-peches",
            "body": "Why are you bankrolling your fiancé and his mom's dream wedding? This doesn't bode well for your marriage. Let his mom finance the wedding.",
            "score": 39,
            "replies": []
        },
        {
            "author": "AccountMitosis",
            "body": ">insisting she wear a CREAM colored dress\n\nGurl.\n\n>She’s invited 5 of her friends without asking\n\nGuuuurl.\n\n>I’m paying for a majority of it out of pocket. \n\nGUUUUUUUUUUURL.\n\nNTA. \n\nWhy the hell are you even *planning* this wedding? Fiancé wants it, so fiancé should plan it. Fiancé should also help *pay* for it, but I'm assuming that's not economically feasible for whatever reason-- so you both must recognize that you are essentially giving him a reeeaaaally big monetary gift by funding this big event that he wants so much. This is not a gendered thing; Partner Who Wants Big Wedding is generally responsible for securing funding for it, and if they receive that funding from someone else, then Partner Who Wants Big Wedding should be grateful toward their patron-- even, or especially, when the patron is their future spouse. \n\nFMIL should *not be your problem to deal with.* Why the hell is this even being put on your plate? The person who wants the big, expensive wedding is the one who shoulders the burden of planning it, regardless of gender. And the planning of a wedding includes fending off intrusive relatives. \n\n\"No\" is final. If your FMIL can't respect your \"no,\" then she needs to go in communication time-out until she's ready to communicate like an adult talking to adults. And your future husband needs to be the one implementing and enforcing the time-out. \n\nAlso, parents who want any say in how a wedding goes need to be helping with *funding* that wedding. If FMIL doesn't want to pony up, then it needs to be made clear to her that her sole obligation is ensuring that the rehearsal dinner goes well, IF you deign to allow her to host it. Of course, you're well within your rights to not accept any money at all, if you don't wish to have any strings attached... but if you're gonna have strings anyway, then at least get paid for them!",
            "score": 78,
            "replies": []
        },
        {
            "author": "No_Forever_1675",
            "body": "1st. Repeat this to your soon to be MIL. \"You should do whatever you want. It's about YOU. Don't let anyone influence your decisions\"\nIt was after all, her own words. \n\n2nd. It's YOUR wedding. $ out of YOUR own pocket. But at this stage with all the interferences and \"suggestions\", mine would be to revert back to your original plan. Elope. If your fiancé wants a wedding, he can plan it on his own, with his side chipping in.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Number-2-Sis",
            "body": "NTA... stop all wedding planning\nLet them know the planning will only resume under the following conditions\nA) MIL will NOT wear a cream color d dress\nB) the five people your MIL invited ARE NOT invited to the wedding\nC) cousin does not get a plus one, there will be plenty of family there so she will not be alone.\n\nIf these conditions are not met, cancel all wedding plans, elope, and enjoy a nice honeymoon",
            "score": 15,
            "replies": []
        },
        {
            "author": "ThinkingXL",
            "body": "NTA\n\nFMIL is walking a fine line of being disinvited in favor of her neices plus one because in what world did she find the audacity to not only invite her own entourage *but also* think that she could wear 𝘾𝙍𝙀𝘼𝙈? That is some \"its also my special day too\" bullshit.\n\nSomeone uncork the red wine and fill the glass. Posthaste.",
            "score": 27,
            "replies": []
        },
        {
            "author": "Desperate-Ease-9637",
            "body": "HA 😂 my sister is on it 🙏 \n\nFMIL said “my friends told me the dress I want to wear is too white and only the bride is supposed to wear that color. I told them I’ve never heard of that.”   ………….. \n\nHis parents are divorced and she never moved on, so I feel as though she’s using this as her ‘moment.’",
            "score": 41,
            "replies": [
                {
                    "author": "amber130490",
                    "body": "Sounds more like she's mentioning the conversation to you in order to get your blessing to wear the white shade. What did you respond to her?",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Desperate-Ease-9637",
                            "body": "I sent her an option of a dress that looked exactly like the one she wanted but was more beige and said “what about this option instead? This color would be more cohesive with what everyone else is wearing.” Her response was “it’s not the right color.” And then I never responded back. I know I should have told her I agreed with her friends, but I thought she would get the implication. That’s on me. \n\nMy original colors for my sister and mom were going to be green and she said “I don’t like green and don’t look good in it, I’m not doing that.”",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "EmploymentOk1421",
                                    "body": "Your reply might be that you are disappointed that she will look like she’s not really a family member in the photos .",
                                    "score": 20,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ratchet_gurl24",
            "body": "Just remember, the more you cave to others demands, the more they’ll demand from you. This is you and your fiancés special day. YOUR WEDDING. I’d suggest someone checking the genuine invitees in to your wedding. If mil has invited anyone she wants, they’ll have trouble accessing the wedding.",
            "score": 9,
            "replies": []
        },
        {
            "author": "imamage_fightme",
            "body": "NTA but if you are marrying this man in the manner more in line with his wishes, he needs to reel his mother in. If he is unwilling to manage her during this wedding, get ready for a lifetime of her overstepping your boundaries.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Chefblogger",
            "body": "i am so sorry for you - but you have a husband problem not a mil problem\n\nNTA",
            "score": 6,
            "replies": []
        },
        {
            "author": "ladyofthelogicallake",
            "body": "If you don’t put your foot down now, you’re in for a lifetime of her thinking that she calls the shots. \n\nTell her right now that cream is white, and it’s inappropriate to wear for your wedding, and that she will be asked to leave if she shows up in white (or any variant of it). Then tell your MOH to be on the lookout.\n\nTell her that the guest list will be determined by you and your SO. She can suggest extra people to invite, but IF approved by you, she will be required to cover the extra charge since you’re working on a budget. $150/person should work.\n\nMake no mistake: she’s testing boundaries right now. Establish them, or lose them forever.\n\nNTA.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AJLNTZ",
            "body": "NTA. You should have went with your first instinct to elope and have a blow out vacation. Is it too late?!",
            "score": 3,
            "replies": []
        },
        {
            "author": "ChemistOdd3406",
            "body": "ESH. You shouldn't be paying for most of the wedding, especially since you want to elope. Having decided to invite his cousin, you don't get veto power over who she dates or brings. As for the suggestion that you would deprive another adult of a plus one, if that's how you feel then just don't invite her. At this point I would be questioning the entire wedding. This has very little to do with the cousin or her dating choices and a lot more to do about the dynamic between you, fiancee, and his mom, as well as some money issues that I see in the distance. If you really want to call the bluff and tell them they can invite whoever they want but they have to pay 100% over the 80, which they should share 50/50 with you. I would go to the mat on this and not get married at all if they won't become more reasonable. But let the cousin bring her damn boy toy to the wedding.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Coneofshame518",
            "body": "NTA. How common is it for men to be super invested in having a blow out wedding? Are you sure it isn’t his mother who is super into it and he’s pushing the wedding because he’s such a titty baby?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Responsible-Kale-904",
            "body": "Your fiancee can thus SHOULD be defending YOU\n\n\nThe wedding industry is also a heartless greedy scam \n\n\nNobody should be FORCED REQUIRED to spend money upon useless stuff or things they simply do NOT want need use,,\n\n\nNOBODY should ever be FORCED into DEBT \n\n\nYou are ALLOWED to marry this person and his family \n\n\nYou are NOT required to marry this person and his family \n\n\nHis forcing you to spend on wedding ceremony that you do NOT even want; along with his family's behavior and his NOT properly DEFENDING YOU is concerning \n\n\nYou however are :\n\n\nN\nT\nA",
            "score": 4,
            "replies": []
        },
        {
            "author": "Famous_Account272",
            "body": "NTA - it's YOUR wedding do what YOU want, MIL does not get a say unless she is paying the bill!",
            "score": 8,
            "replies": []
        },
        {
            "author": "No_Noise_5733",
            "body": "Ask your stb MIL.which of her friends is she going  to drop so cousin's Bf can come?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Top_Butterscotch8394",
            "body": "A cream mother of the groom dress?  WTF!!!!  NO!  Just no!",
            "score": 3,
            "replies": [
                {
                    "author": "Fickle-Positive-3718",
                    "body": "when you put it like that it has incesty vibes, like in a way she wants to be the bride, which I hadn't even considered, eww.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "khuddukhi",
            "body": "NTA, You havent met him, no invite.",
            "score": 6,
            "replies": []
        },
        {
            "author": "LLD615",
            "body": "We initially were only going to give plus ones to engaged or living together couples (obviously married couples). I had two bridesmaids who were in new relationships who both just assumed their new boyfriends were invited (invitations had already gone out and RSVPs back, but I hadn’t sent the final counts in). Because they were bridesmaids I let it go. Both relationships were over within a month of the wedding. \n\nWeddings are expensive, don’t let someone bully you into adding to the guest list, especially since you don’t know the person! Not only are you paying for those guests but they show up in photos and the video. \n\nSome advice if you lose the battle with the cousin’s boyfriend. Tell your photographer in advance about the situation. Usually they will be the “bad guy” for you and say things like “ok can I have the dates step aside for a moment” to grab a photo of just the family. That way you won’t have to photoshop anyone out later.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Evening-Cry-8233",
            "body": "NTA but you do have a bigger MIL and finance problem.  You need to tell your fiance to rein in his mother or she’ll open up a spot for the wedding and the first step is changing her dress.  Tell her in no uncertain terms that if she shows up in a cream\nDress, she’ll be escorted out or at minimum, not be in any pictures.  \n\nAs far as the cousin, talk to her directly and explain things. She’ll get it.  If not, there’s another spot open.  Tell MIL these people are only invited if those on your original list decline.  AND that she has to pay $100 each for them as you’re not covering their costs.  Keep the invitations very close to you and make sure you send them directly.  It would be really bad manners to show up at a wedding you weren’t officially invited to by the bride and groom.   Not an offhand invite from the MIL.",
            "score": 2,
            "replies": []
        },
        {
            "author": "itsnotlikewereforkin",
            "body": "r/raisedbynarcississts",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mythological-Chill36",
            "body": "NTA, and you really should sit down with your fiancé and talk about whether YOU are still comfortable with the level this wedding is getting to.  YOU are the one footing most of the bill, so I don't understand why anyone but you is getting a say in anything.  Why is he not paying for this if he's the one who wants the wedding this way after you said you wanted to elope?",
            "score": 2,
            "replies": []
        },
        {
            "author": "QuietCelery7850",
            "body": "There are so many things wrong with this, as others have pointed out.\n\nI will just address the MIL’s guests issue.\n\nIt is likely that MIL was invited to her friends’ children’s weddings because her friends were hosting and paying, and that the bride and groom were young people being launched into the world.\n\nThis is an entirely different situation. You are an adult, paying for your own wedding. MIL should get no say.\n\nReconsidering things is a good idea. How do you want the rest of your life to go? Will you always have to defer to his desires and fund them? Is this indeed a partnership?",
            "score": 2,
            "replies": []
        },
        {
            "author": "meagancavell",
            "body": "NTA\n\nCancel the wedding and elope. Or else fiancé pays.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Suitable-Park184",
            "body": "Your compromise is that you’re having a big wedding you don’t want and you’re paying for most of it?   That doesn’t sound like a fair compromise.  \n\nI think YTA on the invites though.  Push for the smaller wedding.  Don’t invite the cousin at all if you don’t want to give a plus one.  Or cut the list elsewhere. \n\nA plus one is something you provide as the host, like food of drinks, to make the event enjoyable for your guests.  A guest spends a considerable amount of time and money to be with you to celebrate your wedding.  This is something you do for them.  Cull the list in pairs if it’s too many people.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe are getting married and I (33F) am paying for a good chunk of the wedding. \n\nI personally wanted to elope at this stage of life and take a long vacation in Europe. My fiancé (37M) wants to have a blow out wedding. We decided to compromise and have a wedding in our home state and keep the guest list to 80 and under. Especially since I’m paying for a majority of it out of pocket. \n\nHis mom started out this wedding planning process saying, “ You should do whatever you want. It’s about YOU. Don’t let anyone influence your decisions.” Turns out she means that as long as SHE is the biggest influence on our wedding. Beyond insisting she wear a CREAM colored dress, sharing our wedding website with people without asking if that was ok, wanting her son’s hair to be styled a certain way… she’s been extremely difficult. \n\nHer latest endeavor has been inviting people to the wedding without our approval. She’s invited 5 of her friends without asking and her excuse was that “I just assumed that they were invited. They invited me to their children’s weddings.” \n\nThe newest problem is that her niece (40F) who lives across the country just broke up with her boyfriend in October of last year. I’ve met the niece a handful of time and she’s a great girl and we want her at the wedding. But her ex boyfriend was awful and I was happy that they broke up tbh. \n\nShe let us know that the niece is dating someone new and she should be given a plus one. I refused to give her one and told my fiancé: NO. He’s been telling his mom no, and she’s saying we’re not being very nice and that the cousin will be alone. \nMy argument was that we’ve never met this new person, they just started dating, and she will NOT be alone she will be around family. I guess her siblings are all married, so in that sense she will be alone. I also am trying to save us as much money as possible and never wanted to have a huge wedding anyways. So one less person is a win in my book. \nBut I still feel like my justifications are sound and I’m right for not budging on this. \n\nAITA?\n\n\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Green-Eyed-BabyGirl",
            "body": "NTA…there’s a difference between a wedding and a reception. What seems to be getting augmented is the reception. And of course, that’s where the expense comes in. Have you considered having 2 receptions? Idk how much you have planned and/or what is changeable but it’s not unheard of for there to be more than one receptions. I know this sounds odd but it’s something to explore. You could have your wedding and your smaller party following and have a separate blow out reception.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldSaggytitBiscuits",
            "body": "NTA, why do people think it's their right to dictate the conditions of an invitation to a wedding they are not hosting or paying for? If you've never met the person, your wedding isn't an opportunity to bring some rando around and introduce him to the family. Same with her friends. Your future MIL is way out of line, and your future husband needs to set her straight and tell her no one is coming that you two don't approve. This is one of those relationship-defining moments, and will set the tone for your marriage. If he doesn't stand up to his mom now, you're going to have a very long, miserable time with your in-laws, and probably your husband.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LSPureTemptation",
            "body": "So your MIL went from ‘do whatever you want’ to acting like she’s the wedding CEO? 😂 If you’ve never met this dude and they just started dating, there’s no reason to be paying for his steak dinner. Your wedding, your rules. She’ll survive one night without a date—she’s there for you, not for a plus one audition.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few_Employment5424",
            "body": "Ask MIL if she's willing to pay for the extra people she has added if not cousins +1 is out of budget",
            "score": 1,
            "replies": []
        },
        {
            "author": "Think-Treat-3309",
            "body": "NTA people don't have the right to tell the host who the guests will be.  Future MIL needs etiquette lessons",
            "score": 1,
            "replies": []
        },
        {
            "author": "houseonpost",
            "body": "NTA: You have a few options. Insist your fiancee call off his mother. No more consulting her or listening to her views. And just the two of you plan what you want. \n\nOr tell your fiancee the budget and that you will have nothing to do with the planning. He can do whatever he wants as long as he stays within budget. And that you will show up the day of the wedding. \n\nOr have a heart to heart with fiancee and agree to go to your original plan to elope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Better_Specialist721",
            "body": "NTA If she wants all these random friends and new boyfriends of 3 weeks of family members to attend, she can pay for them! This is, of course, if you don’t mind them attending.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Open_Kaleidoscope345",
            "body": "Nta. I will never understand why so many people want to have a say in other persons Weddings. It is your Wedding. I hated it during my Wedding planning. \nIs your MIL really that naiv or is she playing the victim to get what she wants. Ether way nta.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LawyerDad1981",
            "body": "NTA .... but why haven't you shut down this woman and her nonsense long ago? \n\nMore importantly, why has her son not shut down this woman and her nonsense long ago?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kontraband7480",
            "body": "NTA. \nOn a side note, my wife and I had a huge wedding with hundreds of guests, and our biggest regret is throwing a wedding reception. It was so damn stressful, filled with tons of drama, which basically ruined what should have been a wonderful day. It was also a colossal waste of money. \nIf we could do it over, we would only do a small cake and punch reception at the church hall. Just a 45 minute thing and that's it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impressive-Value-153",
            "body": "NTA. A fairer way would be for your MIL to at least pay for her guests.  Why are you paying for this wedding if you don't want it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "anonymous33456789",
            "body": "NTA. You sound just like me - I’m 32 and just married in December. I also wanted to elope…. Fiancé wanted a huge wedding… wish I had pushed back more but it’s over now. I also had in law problems with the guest situation. I found out the day before there was a ‘swap’ of guests; one family member too sickly to attend and instead the cousins new gf who I had never met was to take his place…. And no one ran it by me to even make sure it was ok with me. Really peeved me off on top of the constant increasing guest list (I eventually started saying no). It’s your wedding and if you’re paying a bulk of it you have every right to dictate who will be there. I hope you have a beautiful wedding day",
            "score": 1,
            "replies": []
        },
        {
            "author": "Warlock1807",
            "body": "Mom said “You should do what you want. It’s about YOU. Don’t let anyone influence your decisions”. Remind her of that and tell her that is exactly what you plan on doing, both now and in the future as it is your marriage and lives.",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwawtphone",
            "body": "NTA\n\n\n\nSo do what you want, seriously. \n\n\n\nI have never met anyone who was excited about attending anyone's wedding but their own or their kids.  People go to them because of social obligation reasons and the free food and drinks.  No one really is sitting around all excited about so and so upcoming wedding. \n\n\n\nSo if you are not excited about your own wedding yourself,  why are you doing this to yourself?",
            "score": 1,
            "replies": []
        },
        {
            "author": "veebee93",
            "body": "Personally I’d let the MIL invite people as long as she pays for them. NTA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HootblackDesiato",
            "body": "NTA.\n\nI have the feeling that it wasn't your fiancé's idea to have this blowout wedding.  You have a SO problem, so expect his mommy to be up in your business until he grows a spine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Not_Good_HappyQuinn",
            "body": "NTA, if he wants a big blow out he should be paying for just as much (if not more) than you are. He should be handling his mother. \n\nAt this point I’d be telling my fiancé ‘you either handle your mother and keep firm to OUR boundaries or the wedding is off and we can elope like I wanted’",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sprogpaws",
            "body": "NTA\n\nWhy are you the one making all the compromises, doing something you don’t want to do, being expected to put someone else’s wishes ahead of your own AND being expected to pay for it?  This is only the start … is this what you want for your life?  What about if you have kids?  \n\nI’d be ditching the whole big wedding at this point, and possibly the fiancé too if he doesn’t buck up his ideas.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItWorkedInMyHead",
            "body": "Tell your MIL the niece won't be alone. She can sit with her, since the five friends she invited won't be there either, and they can keep each other company.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd_Task8211",
            "body": "NTA. Let your future MIL know that the cost of the reception is X. She may invite whoever she wants, once she provides a check for the cost.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alda_ria",
            "body": "Do you understand that he wants this wedding because his mom wants this wedding, right? \n\nYou are funding her wedding for her, where she will be in 'cream dress' near her son with his hair styled like she wants it, and near her walking ATM... Oh, I'm sorry. The bride. And he allows her to do it to you.  \n\nNTA,  and think hard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "obscure3",
            "body": "NTA\n\nWelcome to the rest of your life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeginningBluejay3511",
            "body": "Let your fiancee and his mom have their dream wedding.  On his dime. Put things on hold . Take your money and go on a European vacation to think! Get out Girl!  You're better than this!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weekly_Village3628",
            "body": "Why are you paying for a wedding that your fiancé and his family wanted? But your dress & is whatever else is important to you and call it a day… or better yet don’t marry this man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "viimoo",
            "body": "NTA. I have been invited to my boyfriend’s cousin’s wedding in October. I’ve never met the cousin or his partner (hoping to correct that before the wedding) and on that basis alone I wouldn’t expect to be invited. I’m delighted they have but equally it would have been fine and understandable if they hadn’t. But I definitely wouldn’t expect an invitation if we’d only just met - that’s insane.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "lilpikasqueaks",
                    "body": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"How does my comment break Rule 1?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Leg_6429",
            "body": "Your future husband and his family will try to make decisions for forever and have their hands in your pocket the entire time. You wasted any leverage you had when you you paid for wedding.\n\n\nI would make sure I lived a long way from your In-Laws.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Billros23",
            "body": "It's your guy's wedding you can decide who is and isn't invited \nThat beung said that doesn't sound like much of a compromise, he still gets a bigger wedding and you get no trip? Plus his mom keeps trying to push boundaries and has a hard time standing up to him. It's not something that's a quick fix but hopefully that's something he can work on and you can handle in the mean time. NTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "Immediate-Vanilla-45",
            "body": "NTA but please please don't go through with this wedding. Or at least put it on hold. EVERYTHING will be a battle in the future:\n\nNew job that means moving away from MIL? You'll be guilted for abandoning her or she'll end up moving with you and around all the time because she doesn't have friends in a new town.\n\nIf you decide to have a baby, she'll be all up in your sex life with \"tips\" and snarky comments. She'll want to be in the delivery room.\n\nI can provide more examples. Ask me how I know. 😉\n\nSincerely, Someone who stayed married in a threesome with a spineless man and his mother for way too long",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-Association-8711",
            "body": "> “I just assumed that they were invited. They invited me to their children’s weddings.”\n\nUgh, my mom tried to do this with some of her cousins, who I have never met. My husband and I still joke to each other \"But what about the O'Brians? We can't do this without the O'Brians!\" every time we have a get together. We put our foot down that we weren't going to give up spaces for our friends so that strangers could come. If its not a blanket \"everyone gets a plus one\" rule then you don't have to extend an invitation. \n\nNTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "MidCenturyMayhem",
            "body": "My husband and I eloped at a bed and breakfast on a lake. It was marvelous. It was inexpensive. It was drama free.\n\nNTA. Cancel this mess, get your deposits back, and future MIL can cry about it wearing her cream colored dress while you're enjoying Europe.",
            "score": 1,
            "replies": []
        },
        {
            "author": "newoldm",
            "body": "Stand your ground.  You have no idea who this guy is - he's nothing to you so why should he be at your nuptials?  As for cuz being \"alone,\" that is such an asinine excuse for letting an extra mouth to feed barge in that no one knows.  She is not going to be alone - her family, including her pushy aunt, is going to be there.  There will be more than enough people there she knows to converse and do whatever else with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "doggynames",
            "body": "NTA. put MIL on an information diet. She doesn't need to know anything about the wedding or your guest list if she's not financially contributing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mishy162",
            "body": "YWBTA to yourself if you go ahead with this wedding that you don't actually want, especially with you being expected to foot the bill.  I'd be seriously rethinking your whole relationship, it's going to only get worse after you are married.  Cancel the wedding and use the money on a vacation for yourself to Europe.\n\nNTA for the no invite for cousin's new bf.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hawken54321",
            "body": "You should accept everything they tell you and do everything they demand.  What is wrong with you?  Loneliness is better than misery.  GYOW out of this.  Who gives a crap if some woman you are not related to is alone?  Yes One less person is a win.  That should be the groom",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few-Tone-9339",
            "body": "wtf. Whose day is it? His mom or yours? I’m confused. YOUR day, YOUR way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleepiest-vaper",
            "body": "Do not marry this man. NFMIL (narcissistic future mother-in-law) has clearly got some serious “boy mom” problems (saw your comment that said she got divorced and never moved on, which is her prerogative, but the solution to that isn’t showing up at her son’s wedding looking like SHE’S the bride…in addition to being creepy and incestuous, it’s also delusional and sad and makes her look like she never recovered from a serious head injury) and it’s INSANE that she’s trying to make all of this about her. Trying to get you to say it’s okay for her to wear anything REMOTELY resembling white during YOUR wedding that YOU ARE PAYING FOR?? I would’ve cut and run when she started inviting HER friends to YOUR wedding on YOUR dime. That’s insane behavior and she has terrible boundaries, which she’s passed on to her son (and I am SO SORRY, but your fiancé is effectively middle-aged and has never learned to stand up to his own mom?? My fiancé is also 37m and if he tried this shit he’d be out on his own within minutes). This will be an uphill battle at every single milestone and event you have in your life until she dies or you leave. Since killing people is a crime, I suggest you RUN, don’t walk, away from this cluster. Let him learn the hard way that he doesn’t get to side with his mom against his future wife and expect to still HAVE a future wife. It’s even more embarrassing that she’s behaving this way and HE IS LETTING HER while you’re paying for it. What will you bankroll next, her hair and makeup for YOUR wedding? Listen, you only get to live once (that we know of). Do you REALLY want to swallow your dreams and goals for this pathetic old woman to make her power plays and eclipse your joy? You could be in Europe RIGHT NOW and you’re planning a wedding you don’t want instead. I saw that you were trying to “compromise” with her — honey, THE WHOLE WEDDING IS A COMPROMISE and that should be that! If she has any demands, she can host her own event to celebrate herself (doesn’t seem like she has anything about herself to celebrate, but people like her can delude themselves into thinking they do) — you are already paying for a wedding you don’t want instead of a vacation you actually want to have. Let this go. You will regret marrying someone who doesn’t put you first. And standing up to your mom should NOT be that hard for a person who’s almost 40 years old. He’s acting like he crawled out of her body yesterday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ath0ros",
            "body": "NTA but for the love of god please put your foot down your fiancé about this. You don’t even want a wedding, why are you footing the bill? Or even trying to compromise with your FMIL? I’d laugh in her face the first time she tried to overstep her boundary on my dime. \n\nPersonally I would get your deposits back and tell your husband he can make one of two choices. Europe and elopement or single with his mother while you enjoy your vacation. Having a wedding anyway with all of these problems on his end is NOT a compromise with him, it’s bending to his mother’s will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sorry_I_Guess",
            "body": "YTA for referring to a 40-year-old woman as a \"girl\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "MildlyAmusedHuman",
            "body": "NTA. MIL is seriously overstepping and boundaries need reinforced. Time for fiancé to take a spoonful of cement and harden up.\nYour wedding, your guest list. \nThere may be a compromise for any guests MiL wants she can pay for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Regular_Giraffe7022",
            "body": "NTA, but you really need to talk with yours fiance about boundaries with their mother or you're gonna have so many issues in the future.\n\nShe'll expect to be in the delivery room if you have children. She'll expect a say in baby names. She'll make every event about her. \n\nI wouldn't marry someone who didn't have a backbone.\n\nAlso, why isn't paying for the wedding a joint venture? Why are you funding his and his mother's desires, especially when it doesn't fit in with your own?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TightAustinite",
            "body": "#Momzilla\n\nfuckin bleh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Outrageous_Tea_8048",
            "body": "NTA Future hubby & MIL can invite whoever she wants if she ponies up -in advance. Why are you paying for the majority when he wants the blow out?",
            "score": 1,
            "replies": []
        },
        {
            "author": "dannon0731",
            "body": "Cancel everything. go on that trip to Europe alone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "skippymood",
            "body": "NTA   How much is your husband contributing to this wedding? How are you dividing expenses?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MidwestNormal",
            "body": "Updateme",
            "score": 1,
            "replies": []
        },
        {
            "author": "mauwsel",
            "body": "NTA it's your wedding, not your future MILs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deep-Okra1461",
            "body": "NTA Now you know why your fiance wanted a blowout. You don't think any of this is a surprise to him, do you? That's why his mom is being such a pain. He cleared the path for her. Good luck because this is just the start.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Usrname52",
            "body": "Your MIL is an AH. And your fiance to some extent. She is completely overstepping, inviting people without notice, etc. I think push back on the friends is completely reasonable. And a lot of the other things.\n\n\nBUT, the cousin recently broke up with her ex. She is dating someone. AND she is traveling alone. So many factors that make this the type of person you extend a partner invitation to. Otherwise she is just sitting there alone, while everyone else has their partner with them, and she has no one to dance with.....while expected to be there celebrating someone else's relationship. And she has to travel alone.\n\n\nAll the backstory, and everyone else is an AH, but, and I know this is an unpopular opinion, I think you are the \"AH\" for this particular question. ESH",
            "score": 0,
            "replies": []
        },
        {
            "author": "Reclinerbabe",
            "body": "Anyone who is flying across the country should be allowed a plus-one.  Always.  Why?  To travel together, to share hotel expenses, to hang out with.  Even if other family members will be there, most of the time will be unscheduled and on-your-own time.  \n\nWE KNOW YOU'RE PAYING FOR MUCH OF THE WEDDING, but don't be cheap.  Be a thoughtful host/hostess.\n\nYTA if you aren't thoughtful.",
            "score": -1,
            "replies": []
        }
    ]
}