{
    "title": "Mod Announcement: Game Recommendation and Tips Thursday - User Input Sought",
    "author": "RobbieNewton",
    "subreddit": "FinalFantasy",
    "rank": 0,
    "score": 5,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/FinalFantasy/comments/1j9fjr8/mod_announcement_game_recommendation_and_tips/",
    "id": "1j9fjr8",
    "selftext": "Hello to all our users, and those who may visit.  This thread comes off of the back of a wave of user reports, as well as some mail into mod mail.  As many of you may be aware, [linked here](https://www.reddit.com/r/FinalFantasy/comments/1guw9zf/advice_megathread_which_final_fantasy_game_should/) we have a game recommendations megathread which is pinned, this can be used for people seeking recommendations for which game to start with, which game to go onto next, or just tips in general about games.\n\nAs you are also no doubt aware, we are seeing a lot of posts each day outside the megathread looking for which game to start with.  We are also as a mod team aware that to use a more modern term, the megathread can quite often be dead - looking at it this morning for example, the last recommendation request that was answered was 21 days ago - betwene 21 days and now we have had a variety of people asking for recommendations etc but haven't got a reply.\n\n\n\nAfter some internal discussion off the back of user suggestions, we would like to trial having a \"Tips Thursday\" style.   How this would look, and we are happy to take input from yourselves - would be the megathread could be retired, and in its place, posts about game recommendations or tips for games would be freely allowed on Thursdays only.\n\n\n\nTO that end, if you could please use the poll options to choose what you, as a community, would like to see happen, we will leave this running for 3 days in order to get as much input as possible.  Please also use the comments section to share your views, thoughts, and again, any suggestions you have as to hwo this could look, or if the current method works best.\n\n  \nEdit: To be clear about terminology \n\nGame Recommendations - For those either new to the series looking for first game, or those who have played some games and wanting to know which to go onto next\n\n  \nTips - For those who are playing, or looking to play a game looking for tips and ideas to help enhance their experience. \n\n[View Poll](https://www.reddit.com/poll/1j9fjr8)",
    "comments": [
        {
            "author": "Adamantaimai",
            "body": "Just my 2 cents: As someone with a lot of moderator experience I would do neither. \n\nIt is pretty much a given that unless your subreddit is about a topic for which new things to talk about happen constantly, your most dedicated users will grow tired of the most posted topics. This is understandable but at the end of the day it is not always a real problem. People who browse your sub multiple times a day every day will grow tired of the most posted about topics no matter what these topics are. Sometimes you may want to do something about it, in the case of the Tifa-cosplayers I understand, but you don't need to do it all the time because then you will get stuck in a loop of creating new rules for whatever is the most commonly posted about topic after you suppressed the last one.\n\nThe people who ask about what game they should start with are not people who commonly browse this subreddit. So a lot of them will not know about all the rules, posts that are only allowed one day per week and megathreads. They are also not likely to put asking their question here on their calendar for next Thrusday if they just missed one. You will want to keep using the subreddit as intuitively and simple as possible, and these rules that only apply one day of the week kind of go against that.\n\nI would expand the megathread into a broader 'quick questions' thread, that way regular browsers might enjoy reading it more because it won't be the same question asked every time. Meanwhile I'd just let the separate posts be, unless they reach seriously oppressive quantities. Unlike all the Tifa-cosplays, these threads are not very likely to drown out the frontpage anyway. And yes this would maybe upset some users who get tired of seeing the same questions all the time, but you can't make everyone happy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "phunie92",
            "body": "I always liked the megathread but I’m certainly guilty of not making it a point to go visit and see if there was anything I could answer. I used to keep up with it but a while back Reddit redesigned the mobile layout and pinned posts became less conspicuous, and so I sort of forgot it existed.\n\nI’m certainly open to seeing how a trial goes, but I do still think there is value to a megathread for recommendations or other quick questions. If any of you modfriends also have interest in retaining a megathread, I might suggest refreshing it weekly so that it reappears to regular users to remind them it exists and, in theory, keep the queue of questions to a reasonable size.\n\nJust wanted to toss in my two cents there. Always appreciate your work!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "RobbieNewton",
                    "body": "[https://www.reddit.com/r/FinalFantasy/comments/1guw9zf/advice\\_megathread\\_which\\_final\\_fantasy\\_game\\_should/](https://www.reddit.com/r/FinalFantasy/comments/1guw9zf/advice_megathread_which_final_fantasy_game_should/) If you pop that in there for us.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}