{
    "title": "Clive’s “Job” Debate",
    "author": "Pagan_Joker",
    "subreddit": "FinalFantasy",
    "rank": 10,
    "score": 39,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 97,
    "url": "https://www.reddit.com/r/FinalFantasy/comments/1je9f7t/clives_job_debate/",
    "id": "1je9f7t",
    "selftext": "Settle a debate in my local friend group. If we were to classify Clive from FF16 in a traditional “Job” or “Class” (while other debate going on), what would he be? I think he’s closest to Blue Mage, as he pulls magic and Eikons from his enemies to gain strength. One friend says he’s a Red Mage, since he uses melee based combat mixed with black magic, and my other friend insists he’s just a Black Mage with a sword. \n\nWhat do yall think? ",
    "comments": [
        {
            "author": "Able_Ad1276",
            "body": "Freelancer",
            "score": 1,
            "replies": [
                {
                    "author": "Alf_Zephyr",
                    "body": "This is the one",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Exuin",
            "body": "https://preview.redd.it/wtzfg9s1mhpe1.jpeg?width=858&format=pjpg&auto=webp&s=5758591d05c0314a6678d85c529563393759f031\n\nFFTCG has him as a unique dominant job.",
            "score": 1,
            "replies": [
                {
                    "author": "No_Heart_SoD",
                    "body": "well wat do you know",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Watton",
            "body": "Blue Mage.\n\nHe steals enemy abilities, and in FF5, Blue Mages were okay in melee as well.\n\nRed Mage has healing / white magic as a requirement, and Clive has none of that.",
            "score": 1,
            "replies": [
                {
                    "author": "Auctorion",
                    "body": "Clive is a blue mage, Joshua is a red mage.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Watton",
                            "body": "Red mage, blue mage\n\nOne mage, two mage",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Piratestorm787",
                                    "body": "I would give this an award if I wasn't poor",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "fluffybottompanda",
                                            "body": "I gave them one in your honor",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RedXIII304",
                    "body": "I think most Blue Mages are good in melee.  \n\nStrago isn't but Quistis, Quina, and Kimahri all could be. While FFTA's had sabers. \n\nIdk enough about XI and XIV, though I'm pretty sure they can deal physical damage.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "shadowfalcon76",
                            "body": "XI is a monster in melee with a sword, XIV uses a cane and is all mage. XIV BLU has some spells that are melee range only, but they are definitely not any sort of melee powerhouse.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Raven123x",
                                    "body": "Final sting isn't a melee powerhouse?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "shadowfalcon76",
                                            "body": "No, because I'm talking about the BLU swinging around swords and doing crazy damage with them alongside their spells.\n\nXIV BLU is just tapping foes with a near-statless stick.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Yeseylon",
                    "body": "BLU being decent in melee is pretty standard.  Quina in IX, Kimahri in X, commonly used to melee in XI, etc",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Razmoudah",
                            "body": "I think FFXIV is the only Blue Mage who can't hold their own in melee.  Even in FFTA/2:GotR they are good in melee, and the FF adjacent properties by SE keep that true for Blue Mage styled classes.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "themanbow",
                                    "body": "Strago in FFVI is not good with melee.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Razmoudah",
                                            "body": "Ehhhh.......ultimately just about everyone is better with magic than melee in FFVI.  Unless you keep the right Magicite equipped to give a boost to Power when you level, and then you can make anyone good with melee.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "themanbow",
                                                    "body": "If you were to look at default stats only, Strago is not naturally good with melee.\n\nIn other words, compare apples to apples to keep this in good faith.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Razmoudah",
                                                            "body": "Going by default stats, most of the cast from FFVI is at least as good, if not better, with magic than melee, particularly as almost no weapon compares well to the power modifier for second tier magic, much less third tier.  Further, by Level 50, all but one character has a high enough Max MP to make concerns about the costs of the stronger spells mostly academic.  Thus, relative to the game he's in, he still holds his own in melee.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Petrichordates",
                    "body": "He doesn't learn abilities from enemies, it's not blue magic.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OriDoodle",
                            "body": "'if he can do it so can I' \n\nHow is stealing Eikon abilities NOT learning abilities from enemies?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "NewJalian",
                                    "body": "So many FF characters have learned summons by defeating the summons, it doesn't make them Blue Mages. Every single character in FF6 would be a Blue Mage if learning magic from Espers made them so.\n\nCid, Joshua, and Jill were also certainly not Clive's enemies. Blue Magic is about learning magic from common monsters, not just any enemy or summoned deities/primals/eikons/whatever.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Solitaire_XIV",
                                            "body": "Eh, the actual mechanics of 'learning' are different title to title. Clive absorbs the power of each Eikon (outwith Phoenix) and learns multiple abilities from that absorption. \n\nSounds about as plausible as Quina eating, Kimahri magic absorbing, Quistis breaking an item, or BLU in FFXI drinking their blood.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "NewJalian",
                                                    "body": "Sure, but at no point did they learn summoner abilities... he is much closer to an alternative Summoner than an alternative Blue Mage. Channeling summoner abilities through himself even has precedent already with FF14's summoner",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OkNeedleworker8334",
                    "body": "Well he has a healing with one of his phoenix ability so i think it count",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OkNeedleworker8334",
                    "body": "Well he has a healing with one of his phoenix ability so i think it count",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MartinInk83",
                    "body": "But Clive has healing magic if you build for it and his limit break heala him.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tenorsounds",
                            "body": "He has healing *abilities* tied to him evoking the eikons, but he clearly can't cast white-magic like Joshua can.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MartinInk83",
                                    "body": "Yeah you're right.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Watton",
                            "body": "Though,  without the accessory from the DLC\n\nThe self-healing takes about...453 hours to restore him to full",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "shadowfalcon76",
            "body": "Warrior/Evoker or Freelancer who mastered said jobs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exuin",
            "body": "https://preview.redd.it/ku71g681mhpe1.jpeg?width=858&format=pjpg&auto=webp&s=c3491ed41c9a033e24f7d861aa693a2c9a5e1231\n\nFFTCG has him as a unique dominant job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tenorsounds",
            "body": "\"Protagonist\" :D\n\nBut honestly, the closest thing he seems to me is a summoner with a sword. All of his power outside of his melee combat is tied to evoking the power of the Eikons.\n\nEdit: Other commentors mentioned \"Evoker\", which I forgot was an actual job and might be closer than summoner for Clive since he never fully summons an Eikon (outside of, arguably, Ifrit)",
            "score": 1,
            "replies": [
                {
                    "author": "Yeseylon",
                    "body": "Evokers aren't really melee either though.  The idea that he's a more specific Blue Mage is a better fit since they have a history of melee work.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tenorsounds",
                            "body": "Eh, he's an Evoker with a sword :P",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Razmoudah",
                    "body": "Hmmmm.....that may actually be a rather good fit for him.  Too bad someone else posted that FFTCG has an official job of \"Dominant\".  I'm not entirely sure what the difference is supposed to be, as for the most part he just invokes abilities learned from the Eikons, which just seems to be another new term for Summons like Eidolons was.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Razmoudah",
                    "body": "Hmmmm.....that may actually be a rather good fit for him.  Too bad someone else posted that FFTCG has an official job of \"Dominant\".  I'm not entirely sure what the difference is supposed to be, as for the most part he just invokes abilities learned from the Eikons, which just seems to be another new term for Summons like Eidolons was.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "setzerseltzer",
            "body": "He’s just a jack of all trades. He doesn’t really fit into any specific class  like the other MCs do imo.",
            "score": 1,
            "replies": [
                {
                    "author": "Yeseylon",
                    "body": "So Onion Knight",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReaperEngine",
            "body": "Just because he absorbs the powers of eikons doesn't make him a blue mage, not when he doesn't do so to any other enemies in the game, which is the true hallmark of the job. He's not a red mage because despite using a sword and magic, he doesn't know a bevy of black and white magic, he can't even use Cure. Similarly, he's certainly not a black mage either, just because he can cast some magic. All of these are far too shallow.\n\nYou could maybe argue a case that he's a summoner to some degree, but it's probably just that he's a warrior with special abilities tacked on. Or he's just his own brand of unique job because of the mixture of his melee and magic and eikonic powers, the same way characters in FFXIV have been things like the acadamecian, sorceress, and intrepid.\n\nCould just call Clive an **eikonoklaste** for how much he is one as per the game's definition.",
            "score": 1,
            "replies": []
        },
        {
            "author": "T-Goz",
            "body": "He just has a wide open sphere grid",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProfessionalPlan3526",
            "body": "Evoker",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Heart_SoD",
            "body": "Summoner, clearly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Naive_Mix_8402",
            "body": "I've tended to think of him as a dark knight, since he has a large sword, chonky armor, violent magic, and dark, brooding vibes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xThetiX",
            "body": "Anyone saying blue mage is absolutely incorrect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shadowfalcon76",
            "body": "Warrior/Evoker or Freelancer who mastered said jobs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IllustriousSalt1007",
            "body": "I don’t really agree with him being a blue mage, since he can’t learn enemy skills, the hallmark of the job. He can only learn how to summon certain summons, and even then, it’s a small number and very specific. However he is still clearly absorbing enemy talents in some way. He’s kind of like a cross between a special blue mage and a summoner, who also has solid melee skills. So I don’t think he would fit into any traditional classes we have already. \n\nFun topic. Thanks for sharing",
            "score": 1,
            "replies": []
        },
        {
            "author": "brett1081",
            "body": "I think a Dragon Quest Class fits him better. He really is just a hero class. He’s pretty much a one man show the majority of the game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnInfiniteArc",
            "body": "He’s like a summoner version of a Mystic Knight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Creative_Pilot_7417",
            "body": "He has a FFTactics style “special” job and his is as much bullshit as TG Cids Holy Swordsman class that has all the knight sword moves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirLockeX3",
            "body": "He's the first melee Summoner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hangedman1984",
            "body": "I don't think Clive cleanly maps on to any specific ff job, instead having traits from several jobs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zaelliariffic",
            "body": "I jokingly called him War/Smn for most of the game, though it's realistically closer to Evoker since he doesn't fully summon Eikons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoldenGouf",
            "body": "Let's not beat around the bush here, he's a Warrior/Summoner hybrid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fluid_Aspect_1606",
            "body": "🔵",
            "score": 1,
            "replies": []
        },
        {
            "author": "westraz",
            "body": "he is an Elmetol knight, this is a real class in old FF, or he is a Samurai, that one is more likely, I think maybe it is a mix of these two",
            "score": 1,
            "replies": []
        },
        {
            "author": "Antonolmiss",
            "body": "Freelancer yo! Best of the best!",
            "score": 1,
            "replies": []
        },
        {
            "author": "blazeblast4",
            "body": "Diet Demon Hunter from Devil May Cry. His basic attacks are basically some of Nero’s attacks and Limit Break is diet Devil Trigger. He also has a handful of Dante abilities and Devil Bringer as Eikon abilities. And lastly he has a handful of Kindom Hearts style of abilities. \n\nAs for Final Fantasy jobs, the closest he gets to is a mix of XIV Red Mage and Summoner. XIV Red Mage is a mix of Magic and one handed sword with dashes while Summoner gets abilities to use based on the primal after doing a summon. \n\nThough to be fair, only Cecil and Zidane had direct previous jobs. WoL doesn’t line up with game options from I. Firion was a no jobs game where anyone could be built into anything. Luneth, Bartz, XI Adventurer, and XIV WoL all change jobs. Terra was an Esper, which was unique to her. Cloud, Squall, and Vaan were incredibly free form due to game mechanics (and all end up as unique classes when crossing over). Tidus is a type of quick hitter that doesn’t line up with anything. Lightning is a combo of a sword, gun, and magic, also being a rapid hitter, and later gets job changing, though Paladin arguably fits for her Valkyrie base. And Noctis is a teleporting weapon master.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unlimitedblack",
            "body": "It's reasonable to point out at this point that \"Gunbreaker\" wasn't really a distinct job until FF14 adapted Squall and Seifer and made it one. Prior to that, Squall's style as a dude with a nonsensical sword-like weapon and the ability to cast magic would have given him the same properties of being a \"Black Mage with a Sword\" or \"Red Mage without healing\". \n\nIn the same sense that Mystic Knight is an actual Black Mage with a sword, while Rune Fencer is a Red Mage with a defensive focus, Clive is a distinct concept unto himself, in that he, like Terra, can enter an empowered mode that grants him the power of an Eikon, but unlike Terra, he can customize that mode as he gains access to different Eikons. \n\nWhile 16 and the FF TCG call that concept \"Dominant\" I think it's entirely reasonable we could see the concept repurposed, either in 14 or elsewhere, and given a new name, in the same way that Squall and Seifer were never called \"Gunbreakers\" in FF8.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accel5002",
            "body": "Ok idk how everyone's first thought isn't the Magic/Mystic Knight job? I see people mentioning Red Mage as a job that combines magic with sword play, but the Red mage uses white magic. Clive feels like the final evolution of the idea behind Mystic Knight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PanthersJB83",
            "body": "There is probably a reason he.doesnt fit nearly I to any other games job/class system but I can't think of why that might be...oh wait because he isn't in those games.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baithin",
            "body": "I’d say he’s his own special job — Dominant. \n\nHe’s not just a melee Summoner, because he transforms/uses their powers directly rather than summoning them. \n\nLike an Invoker, opposite of Evoker. \n\n“Invoker/Dominant” would actually be a cool job going forward for later installments in the series.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spinosun",
            "body": "Mystic knight, he can use a sword and magic",
            "score": 1,
            "replies": []
        },
        {
            "author": "hyperzeal",
            "body": "Eikon Tickler",
            "score": 1,
            "replies": []
        },
        {
            "author": "VulpineTranquility",
            "body": "Summoner. He's not learning monster abilities like a Blue Mage, he's collecting summons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "roonzy94",
            "body": "He is a dominant(class), its like an esper like 6 except without demi forming you just straight up turn into a eikon at will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StriderZessei",
            "body": "Edgelord. \n\n\n>!/s!<\n\n\n>!Kinda.!<",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrMoroPlays",
            "body": "Blue mage doesnt describe it well. Blue mages use typical non-black/white magic enemy techniques. What Clive does is much more like megaman Where he learns/steals abilities from major bosses rather than, say, mighty guard or white wind.\n\nhes definitely a dual Class that’s fighter first but idk what to classify his subclass as.",
            "score": 1,
            "replies": []
        },
        {
            "author": "noseusuario",
            "body": "In a hybrid system like FFV:\n\nMystic knight main, blue mage subclass.",
            "score": 1,
            "replies": [
                {
                    "author": "AliasForWhom",
                    "body": "I was thinking Mystic Knight main, Evoker subclass. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "noseusuario",
                            "body": "Yep, I agree I've just chosen blue mage over evoker because he only \"summons\" as last resort.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Haruki_nu7",
                    "body": "I totally agree with you and I'm surprised people are not saying Mystic Knight more.\nHe fights (kinda) like a Mystic Knight but obtains his skills in a way more similar to a blue mage.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SilverGecco",
            "body": "Just a Warrior.\n\nHe doesn't steal magic because there is no magic on this game, only \"new melee techniques\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "Relaxtoughguy",
            "body": "Mystic Knight from FFV",
            "score": 1,
            "replies": []
        },
        {
            "author": "conspiracydawg",
            "body": "He doesn’t have one/he has a unique job/eikonoCLASSt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Petrichordates",
            "body": "Blue mages pull from enemies, Clive would be a summoner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slusho55",
            "body": "I’m surprised no one has said summoner? He seems like an obvious summoner since his abilities are pretty much dependent on the eikons",
            "score": 1,
            "replies": [
                {
                    "author": "UChess",
                    "body": "He doesn’t *summons* anything though, besides arguably Ifrit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ignimortis",
            "body": "Knight, but with White Magic switched for a weird version of Summon. Story stuff is more along the lines of a special character command, like Terra's Trance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HairyDadBear",
            "body": "I see him as a warrior primarily. A summoner hybrid would be appropriate I guess",
            "score": 1,
            "replies": []
        },
        {
            "author": "Douglasqqq",
            "body": "I think your local friend group need jobs of their own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StatikSquid",
            "body": "Dominant",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yeseylon",
            "body": "\"Black Mage With A Sword\"\n\n\n> Did you mean Red Mage",
            "score": 1,
            "replies": []
        },
        {
            "author": "Environmental_Dot837",
            "body": "It seems pretty clear that he doesn’t fit into any of the jobs too cleanly, but I’ve always headcanon’d that he’s a Blue Mage myself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "john_2099",
            "body": "Bard",
            "score": 1,
            "replies": []
        },
        {
            "author": "MagicCancel",
            "body": "Each icon is essentially a job: \n\nPhoenix - Warrior/White Mage   \nGaruda - Ninja   \nRamuh - Black Mage   \nTitan - Monk   \nBahamut - Summoner   \nShiva - Time Mage   \nOdin - Samurai   \nLeviathan - Gun",
            "score": 1,
            "replies": [
                {
                    "author": "wyvernacular",
                    "body": "this is a much better way to think about it than trying fit Clive into a one job.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WindBear44",
            "body": "i see Red and Blue mages mentioned here, so how about Purple Mage?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NewJalian",
            "body": "He seems like the post-Shadowbringers FF14 take on Summoner, but with a Sword",
            "score": 1,
            "replies": []
        },
        {
            "author": "shuuto1",
            "body": "Ignoring eikons he’s a red mage",
            "score": 1,
            "replies": []
        },
        {
            "author": "rocketsneaker",
            "body": "I would say red mage, since he's adept in melee and magic. But maybe a new off-shoot of redmage that can summon as well. Orange mage?",
            "score": 1,
            "replies": [
                {
                    "author": "Tenorsounds",
                    "body": "If he was able to cast white magic more consistently then I'd see Red Mage, but he never gets Cure or Esuna or what-have-you.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rocketsneaker",
                            "body": "Crap, good point",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Maya_Manaheart",
            "body": "Traditionally Blue Mages had swords, so I'm a proponents of him as Blue, Joshua is Red",
            "score": 1,
            "replies": []
        },
        {
            "author": "VellDarksbane",
            "body": "He’s a Red Mage with the ability to turn into a kaiju. Or Blue Mage with the ability to equip like a Red Mage and the ability to turn into a kaiju. Both are acceptable, as it would depend on how you see his gain of new “spells”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Iskhyl",
            "body": "Joshua is the classic red mage, that's for certain. Clive imo is blue mage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TrickNatural",
            "body": "Machinist. He fights with a riffle and his physical stats overshadows his magical stats, so its a perfect fit.",
            "score": 1,
            "replies": []
        }
    ]
}