{
    "title": "Recently fell in love with Final Fantasy. Think I went overboard?",
    "author": "Gold_Seaweed",
    "subreddit": "FinalFantasy",
    "rank": 2,
    "score": 524,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 161,
    "url": "https://i.redd.it/zr0m7bl9pipe1.jpeg",
    "id": "1jegpm3",
    "selftext": "Not included are my PS1, PS2, and PC copies. \n\nStarted with 7 and 16, but after I complete 7 I'll be playing them in numerical order. I intend to watch a video that covers 11. I'll probably skip 13, 14, and 15. ",
    "comments": [
        {
            "author": "EagleEyedTiger7",
            "body": "No such thing as overboard when it comes to Final Fantasy lol, enjoy many hours of playing.",
            "score": 1,
            "replies": [
                {
                    "author": "bicthemagnificent",
                    "body": "Amen",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "afroman420IU",
                    "body": "Agreed",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WiserStudent557",
            "body": "If you’re not into MMOs that is understandable but I wouldn’t advise skipping XIII or XV. At a certain point you’ll have played all the other FF available anyway…not that I’m saying those are bottom tier games for me. I found XV much better than people said and I’m a big Lightning fan and enjoy the XIII world.",
            "score": 1,
            "replies": [
                {
                    "author": "Ser_falafel",
                    "body": "I tried so hard to like 15 I just couldn't get into it. Tried 3x farthest I made is was like 9 hours >< ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WiserStudent557",
                            "body": "I get it, I think I was able to deal with some of its flaws because of the number of open world RPGs I’ve played but also I didn’t get past pushing the car scene the first time (did do the tutorial) and then I didn’t even try the game again until I was looking for something to balance the grind on Crisis Core between Remake and Rebirth. Then I ended up appreciating both Crisis Core and XV more than I thought I would.\n\nIt’s definitely flawed but it’s a solid open world map and the guys are all pretty good characters. The biggest issue is the story was too big so it’s a bit weak in game and then that also leaves so many good NPC characters too uninvolved beyond Noct and the crew. I absolutely loved Aranea Highwind for one.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Rigar_",
                            "body": "What kept you from going further? In its original state. 9 hours in is about half way through the game lol",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mr-senpai",
                                    "body": "I finished it because I was obsessed with the concepts surrounding VS XIII, kept up with development for years, and I wasn't ever angry it got changed to FF15.\n\nThough I'd never replay the game, now when I try, I get about 9 hours in and stop 😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MaleficentToe8553",
                    "body": "13 isn’t mmo your think of xi and xiv",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Entrire",
            "body": "Better pick up tactics war of the lions for that psp",
            "score": 1,
            "replies": []
        },
        {
            "author": "Saeplour",
            "body": "Get Dissidia for the PSP, both the first and second one. They provided me with WEEKS of play time",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "It's a priority on my list. I wanted to play through 12 before playing Dissidia just so I could really enjoy the characters",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Heliosis",
                            "body": "Honestly you just need the second Dissidia (Duodecim) on PSP. It has all the story content from the first one included",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "I did know that, but I can't lie, the first one has such cool box art. I've been halfway tempted to get both just because of that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Heliosis",
                                            "body": "There are some balancing changes to characters movesets they made between the two games so if that helps tip the scales for you at all it’s another reason to own both haha",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Sancti186",
                            "body": "You are so on the money. Well done with the plan",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Baithin",
            "body": "Why skip 13, 14, and 15?",
            "score": 1,
            "replies": [
                {
                    "author": "TimmyGreen777",
                    "body": "Looks like they are handheld gaming so that would be impossible unless they also have a Steam deck",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Gold_Seaweed",
                    "body": "I've heard that 13 isn't very good and that Square was experimenting with some new stuff. 15 seems really strange to me. I'm open to playing it if someone here recommends it, but I figured I wouldn't make it a priority. As for 14, just where it's an MMO. I'll probably do what I'm doing with 11 so that I can know the story.\n\nI picked up 16 because of the visuals. The art really drew me in and I'm enjoying it so far. It definitely has issues, but I like it!\n\nhttps://preview.redd.it/c3fw4ftmripe1.png?width=300&format=png&auto=webp&s=0aa47999cd7c25ffb21a6f23700ce60f794de298",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rom439",
                            "body": "FfXIV: Heavansward is one of the best stories put into a game I'll live in eternal regret that I'll never experience it blind again.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "That's incredibly high praise. I'll definitely check it out. Someone said most of the content could be done solo, which makes it a lot more appealing to me.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "KuChiPractitioner",
                            "body": "Honestly don't skip 15. I'm like 20-30hrs into 16 so far and am having fun, yes. But I personally had so much more fun with 15. And that was when it first came out, I haven't played any of the DLC yet, but one of these days I will.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "Yeah 16 has been pretty easy and linear to be honest. I don't personally mind it, but I can understand why others might not. I like that characters of 16 a lot though. \n\nI will definitely try 15 out, people seem to like it pretty well. I had heard bad things, but I guess they were unfounded!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TakeoKuroda",
                            "body": "I like 13. I like 13-2 as well, but not as much. I couldn't play 13-3 due to the time limit(anxiety), so i watched a play through.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ReservoirDog316",
                            "body": "13 is an odd duck but I like it. It’s great if you ever feel like playing a linear JRPG. It’s actually amazing that it invented the stagger bar too.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AtlosAtlos",
                            "body": "13,14 and 15 are good games! Don’t skip them without knowing what you’re missing! 13 is linear but still great (+ there’s two sequels), 14 can be basically played as a solo RPG (In fact, 6 solo RPGs with the amount of content…) and 15 has some great team bonding moments and a big world. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "JayPetey238",
                            "body": "People were upset about 13 being different. Just like they were upset about 7, 8, 9, 10, 11, 12, 14, 15 and 16 being different. SE has always changed things up each game. Sometimes it hits, sometimes it misses, but it is always quite solid in the end. Plus, I'd stick 13 WAY above so many of the others. I actually loved the combat and.. well.. characters aren't great I'll admit but even the worst (Hope) is still so much better than Vaan (FF12). \n\nUltimately, Final Fantasy can suffer from a similar fan base problem as other IPs like Star Wars. We love them so much we're offended when things aren't exactly what we expected. But ultimately ALL the games are great, even the awful MMOs. But for those, yeah, just find a \"game movie\" on YouTube. Just cutscenes and important moments, etc, no grind for 14 is still over 40 hours. I don't have the time or patience (or social skills) to deal with actually playing those.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "cqt88",
                            "body": "the gameplay of 13, 13-2 and 13-3 are hit-and-miss, but still worth playing through in \"easy mode\" setting (if they have that) just for the storyline and characters.  \n  \nsame sentiment toward 15",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "spartanss300",
                            "body": "15 is incredible man. It's got a 'going on a road trip with the boys' adventure vibe that is unmatched.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Tanthiel",
                            "body": "> I've heard that 13 isn't very good\n\nYou've heard wrong.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "So I've heard",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ticklefight87",
                            "body": "13 isn't a bad game. Actually, 13-2 might be my favorite in the series ahead of OG 7. 7 even comes with the huge nostalgia factor. The first bit of 13 can kinda feel slow, but the game does really open up and allows you to experiment with its unique combat system.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "Wow, that's really high praise. Everyone here is saying to not skip it. I just read online about it, but I'll definitely try it out. I've not even seen a single bad comment about them so far.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ticklefight87",
                                            "body": "The most negative thing I think people say is its linearity. Which, to be fair, the beginning really is. Other games in the series are as well, though. To me, it doesn't ruin the overall game though. Cool story, cool characters, possibly the best sound track, and the combat gets really fun once you have to start utilizing all its functions.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Gold_Seaweed",
                                                    "body": "What's the best way to play it? I prefer physical media when possible.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ticklefight87",
                                                            "body": "I've never played the Steam versions, but I've *heard* they have issues. Not sure where that's at these days though. Within the last couple years they finally became available on the Xbox store, but I don't think they're available on the original versions of the last Gen. So your 3 options are really just steam, Xbox store, or grabbing a 15 year old physical copy...which I think was an Xbox exclusive if I remember correctly?\n\nLong answer short, Xbox store. If you can find a physical copy then that'll work too I suppose. I know FF13: Lightning Returns ran backwards compatible that way.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Gold_Seaweed",
                                                                    "body": "Sweet, thanks for sharing man. I'll have to get an Xbox to play it haha",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ChaosPhoenixGX",
                            "body": "15 had some weird plot points but other than that, it was amazing. Trust me you won’t regret it, highly recommend it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nuryyss",
            "body": "I understand skipping 14, but why 13 and 15? they are great",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oryyn",
            "body": "I wish the FF anniversary edition for the psp was on something modern. I loved the endgame bonus dungeons!",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "That's what I had read about it. I was intending to play the PSP versions and then the PS1 versions of 5 and 6, but read online that the Pixel Remaster of 5 and 6 were better. That's how I've ended up with all of these lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Oryyn",
                            "body": "Ya the pixel remasters are technically better, just doesnt have the extra content. Its a shame really but honestly theyre all good so its fine 🤷‍♂️",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TakeoKuroda",
                    "body": "dawn of souls was my fav version until AE came out",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Abusive_Truth",
            "body": "You picked 3 good ones to skip. 13 and 15 are horrid... 14 is not as fun as 11 was (is*). Hope you enjoy them all.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Thanks! I really appreciate it. I will be surprised if I don't enjoy the journey. \n\nSee, that's what I have heard about 13 and 15, but everyone here is saying that I shouldn't skip them. I'll at least try them out now based on what everyone is saying",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unlikely-Sleep-9352",
            "body": "Final fantasy tactics is awesome and has one of the best stories",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "It's 100% on the list",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DealerConstant1589",
            "body": "Nah, but dont skip 15! One of my favs. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "jwf239",
            "body": "And you are still missing the best one!",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Oh no, which one?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "finalresting",
                            "body": "Final Fantasy Tactics",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "It's definitely on the list! Just waiting for a deal!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "labsab1",
            "body": "You're like those first time ski/snowboarders who show up with top of the line brand new equipment.  \n\nThe games won't disappear don't buy them right away.\n\nPersonally I can only play 4 onwards as 1to 3 is too old-school for me",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "You're so right lmao\n\nI was only intending to buy the PSP versions at first (1-4), but I heard that 5 and 6 weren't that great on PS1. That's why I decided to get the pixel collection. People were saying to play the remastered version of 8 over the OG, so I figured I might as well just get the double pack. Then 9 was the same way, I already planned to get 1-8 on Switch, as well as 10 and 12. It just seemed odd not to pick it up. \n\nI only wish I could get 11 on Switch, but I know it's an MMO. \n\nBut yes, you are right. I am just like that lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rabdosstar",
            "body": "Not at all. Good job!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dungeonsandbeards",
            "body": "I have so many fond memories of so many games, but no other franchise has kept me hooked for 3 decades. Final Fantasy 6 was my introduction to the series and I will never forget the countless hours I sunk into that game. I will say that 15 and 16 were kind of disappointing for me and I don’t play the online games, but the fact that FF7 Rebirth is still pulling me back after well over 100 hours is a testament to the franchises sustainability. Trust me, you did not go overboard; just enjoy the wild ride!\n\nFFX is probably my favorite in the series btw.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "\nI think it's beautiful that a franchise can go on as long as it has and be as loved as it is. My journey started with me wanting to play the Remakes. My brother convinced me to play OG7 first and man, now I'm in love. \n\nI played a lot of FFX as a kid, but I don't remember it all that well, except that I fell in love with it. I can't wait to experience it again.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rocketsneaker",
            "body": "... welcome brother!!!",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Happy to be aboard! o7",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CommentAgreeable",
            "body": "You are living the dream",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "I traded and sold a bunch of my other collection to afford it. It came at a fair price my brother in arms.\n\nhttps://preview.redd.it/93rbojjv3jpe1.jpeg?width=1356&format=pjpg&auto=webp&s=3d7c6de2faf3b3151f0b7e240a6aa60d8f959f44",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "asha1985",
            "body": "Why skip any?  Try each one.  They each have redeeming qualities.  Each one is someone's favorite.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "I have learned that. A lot of people especially love 13 it seems!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Virtual_Search3467",
            "body": "Sure did! \n\nBut don’t worry about it, it’s normal. At least you didn’t go and grab some first edition Japanese ps3 plus the entire numbered version list that’s available for ps1 2 and 3 … in Japanese… because you disliked the localization and the early ps games were all (almost all) region locked. \n\nEh… speaking for a friend, obviously. 😇",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Hahaha this is hilarious. Not yet* at least",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MaleficentToe8553",
            "body": "Nah there’s a lot to catch up on",
            "score": 1,
            "replies": []
        },
        {
            "author": "saltyartra",
            "body": "This is the appropriate response. Good job OP",
            "score": 1,
            "replies": []
        },
        {
            "author": "Skybuilder23",
            "body": "I have never heard of a fan who regretted playing XIV even if it's just the story.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "That's awesome. It looks great, I just wasn't sure how I felt about the MMO aspect. Someone said you could mostly solo it so I'll definitely check it out",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Skybuilder23",
                            "body": "It's made to be the most Soloable MMO out there, as the devs said it's \"a final fantasy game first\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pablo55s",
            "body": "i can play 12 forever",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "I've heard really good things",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AlwaysCid",
            "body": "Yeah those games that say switch will not work on that console I believe.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Lmao",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ultimatespiderfan",
            "body": "I see no issue with this",
            "score": 1,
            "replies": []
        },
        {
            "author": "AfraidAd1880",
            "body": "No, definitely not. Good job my friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zombieboyfiend",
            "body": "You are missing Final Fantasy Tactics: Was of the Lions",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Not to worry, it is on the list of games to pick up alongside Dissidia!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bell247",
            "body": "Now buy the art books",
            "score": 1,
            "replies": []
        },
        {
            "author": "bell247",
            "body": "Now buy the art books",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "You don't understand, my wallet...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bell247",
                            "body": "True, but the Ultimania Archive books are pretty cool though",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kausdebonair",
            "body": "You did right kid, you did just fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Visual-Chapter-6649",
            "body": "Nope",
            "score": 1,
            "replies": []
        },
        {
            "author": "StormRanger28",
            "body": "i want this collection fr",
            "score": 1,
            "replies": []
        },
        {
            "author": "thateffincasual",
            "body": "Just follow the dopamine, my friend.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Lmao this is too real",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "doubledoubletwotimes",
            "body": "Crisis core is the best final fantasy game",
            "score": 1,
            "replies": []
        },
        {
            "author": "waffle198",
            "body": "I feel that! I recently just bought every FF game on steam lol I've been marathoning them (currently on my favorite 9) and it's been a blast! Happy gaming and have fun!",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Thanks my friend, and you too! I've heard 9 is peak Final Fantasy",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Purest_Prodigy",
            "body": "No, where's Tactics",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Do not worry my brother, I will definitely be picking it up! It and Dissidia!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pyrostark",
            "body": "This is just a normal reaction to discovering FF",
            "score": 1,
            "replies": []
        },
        {
            "author": "INeedAMedKit",
            "body": "Now you need ff14",
            "score": 1,
            "replies": []
        },
        {
            "author": "Daxxon",
            "body": "Wait to get to the point where you want the game characters in real life, and you start buying statuettes. Then, the realness begins.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Lmao I actually found some really cool polygon 3D print models of the FF7 crew. I was going to see if I couldn't work on that tonight but got busy. I'm already crossing the threshold...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FloTheDev",
            "body": "Seems I’m in need of some more Switch games!",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Yes! All in one place. Cannot be beat! I'm hoping Switch 2 gets 16 and potentially 17 when it releases",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Enough-Scientist1904",
            "body": "Not overboard but onboard, welcome",
            "score": 1,
            "replies": []
        },
        {
            "author": "RyuNoKami",
            "body": "Where the plushies at?",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Give me a couple of months",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zealousideal-City-16",
            "body": "Do they still make the psp and psp games?",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Unfortunately not. Everything is secondhand. FF3 is Japan exclusive but I've heard it has English subtitles",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JayDee20XX",
            "body": "You're missing Final Fantasy Tactics War of the Lions. There's a rumor that a remaster or remake is in the works but definitely don't skip it. The story is excellent. \n\nAlso the XIII trilogy is, in my opinion, way better than most people seem to think. XV could have been better too but still worth a playthrough.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fallingtetrominoes",
            "body": "The psp alone is a huge flex",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Thank you brother. I searched and searched to find a console in good condition. I sold my old 2DS XL to get the money for it. So worth it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fallingtetrominoes",
                            "body": "Dude the 3ds market is insane right now. A month ago I got the itch to re-obtain one (I’ve actually had 2 that I sold at different points in the last few years). Had NO idea how much they were going for used these days and let’s just say the hunt for a fairly priced one has been never ending :/\n\nBut don’t let me bring down your awesome pickup! So many great games. X is in my top 3 fave games ever. Cheers.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "Absolutely, it's crazy out there. Keep your eye on r/GameSale I use it quite often and sometimes you can find some great deals on there. Worth checking out. \n\nThanks again, and good luck on your search!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ooojaeger",
            "body": "If you love final fantasy so much, why don't you marry it",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Something like that has been considered\n\nhttps://preview.redd.it/0k05mujkpjpe1.png?width=597&format=png&auto=webp&s=74131418765fdd67c5ceba5e87463ba61fe3e951",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Turbulent-Sugar2410",
            "body": "Not at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dr-blaklite",
            "body": "Ya you did. But that's OK. Just make sure you play them all instead of looking at them ;)",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Absolutely! I am very excited.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheWinnerTakesItAll3",
            "body": "There's never too much of it",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Not at all! What a great collection 🔥",
            "score": 1,
            "replies": []
        },
        {
            "author": "StumptownRetro",
            "body": "Now get the WonderSwan games",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "I have never heard of them. I'll have to look into it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Drooks89",
            "body": "Man, how much did you drop on that pap? It's gorgeous!",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "I was looking to just buy the PSP, but a lot of them were scratched or well-loved. I went on Mecari and a Japanese seller had it listed CIB for $200. After taxes, shipping, and fees, I got it for $250. I was pleased!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Drooks89",
                            "body": "That sounds very affordable... I don't need it...",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "That's how I felt too, and here I am lol! It looks great man. I wanted a PSP anyway so once I found out about it, I just couldn't resist the temptation.\n\nLucky that I wasn't in LotR",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DrainedPatience",
            "body": "Hah, nice collection. I bought all the available cartridge versions for the Switch back in December and January along with Collection of Mana.\n\n\nI've played through 1 & 2 so far and working on Final Fantasy Adventure.\n\n\nI may have gone a bit overboard. It's a lot of Final Fantasy, but it'll keep me busy for a long time.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "That's how I feel, too! It's so funny. It all started with me wanting to play FF7 Remake. My brother (who hasn't played FF7) highly recommend I play the OG first. Now, I'm in it for the long haul. I want to explore these games and invest time into their stories and characters. I'm really looking forward to it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "immastillthere",
            "body": "The lack of Tactics for the PSP amongst all of that is saddening. OP I can’t stress enough how good Tactics is.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Honestly just waiting to find it on a good deal. Just before I made the dive someone was selling it for $10 locally, and I just missed it. I'm hoping to find that again. \n\nDon't worry, that and Dissidia will be added to the collection!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Major-Check-1953",
            "body": "No. This is just right.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YunalescaSedai",
            "body": "Depends, if in 3 months youve found a new obsession and never look back - then yes.\n\nI have a close family member that always goes ALL IN everytime they discover a new thing/hobby and it only lasts for a few months until the next thing catches their eye. You can probably guess I'm the saver and they are the spender. I play a game for years and waffle on a $20 purchase haha",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "I respect that. I am hoping that won't be the case! I have forsaken all of my other backlog to do this.\n\nI'm about 37 hours into FF7 and 20 hours into FF16. After I complete 7 (I am pretty sure I'll beat it first) I intend to play 1 on PSP. I hope I stick to it. Being on handheld really helps since they are portable.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "YunalescaSedai",
                            "body": "Oof I did completely forget to say that I hope you love it forever and ever though. It's been a lifelong thing for me and I love new people coming into the fold",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "endymzeph",
            "body": "Completely normal phenomenon",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "This made me laugh",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PastaVeggies",
            "body": "FFXIV?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lubby11",
            "body": "crisis core was on psp????",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Yes! Originally. I was planning to buy a PSP anyway. People were saying to pick up Crisis Core before the Remakes, so it all just fell into place",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lubby11",
                            "body": "love that! im currently playing on ps4 right after ff7 remake and had no intention of loving it so much!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RealMrTrees",
            "body": "Work a little Dirge of Cerberus in there",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Worth playing? Before or after Crisis Core?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RealMrTrees",
                            "body": "It’s a lot of fun, more of a 3rd person shooter which is a fun twist. I want to say before crisis core but they’re also very close together on the timeline I think",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RealMrTrees",
                                    "body": "It’s a Vincent prequel",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "afroman420IU",
            "body": "Not overboard at all but you can probably skip the 13 trilogy. 14 is multiplayer and if you're gonna watch a video about 11 might as well watch one (or many) about 14. As for 15, your milage may vary because it is not a traditionally done final fantasy game. I will vouch for it that it is worth it. 15 has a companion movie i would recommend watching before playing the game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shantotto11",
            "body": "Damn right you did! Half of those games aren’t even for PSP!… /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "ethman14",
            "body": "Is that FFIII the 3D one they did for the DS? Ooohh boy that brings back old memories. That version of that FF doesn't fuck around. One of my actual favorite versions of an older FF and one of the primary reasons out of the NES games, III has always been my favorite.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kizenny",
            "body": "I mean it looks like a good start, but you have plenty of room to grow 🫡 play through those and then play 14, it is a masterpiece and a love letter to all those that came before it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaelumTheWolf",
            "body": "I’m Jealous of the Pixel Remaster physical copy",
            "score": 1,
            "replies": []
        },
        {
            "author": "AltFischer4",
            "body": "Nooo dont skip 13! It is actually really awesome graphics (especially for that time!) and the story is classic Final Fantasy as well :) the battle system takes a little time to get used to but besides that, it offers such a huge world to dive into and it's also fairly forgiving if you have an ADHD brain like myself as the way is always clear and straight ahead :)",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "I have only heard praise so far, I'll be playing it for sure now. It's funny, looking it up people were saying it's bad, but on here I've seen nothing but praise.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sigmund05",
            "body": "13 is probably one of the most underrated FF games out there. It received a lot of hate because they didn't go the usual FF formula of open world, similar to how 16 is getting hate because it didn't follow the usual formula of turn based party system.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Yeah so many people here have said it's good. I am really enjoying 16, so I'll try 13 out",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Imthatguyatthebar",
            "body": "Dont skip 13. I hated it the first time around (I remember posting a comment about how much garbage it was) but it gets a million times better when you play it again and notice all the details. It's still not the best. But it's good enough to play at least twice.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "That's pretty high praise. Other people have said nothing but good things. I'll definitely be trying it out",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Imthatguyatthebar",
                            "body": "Its just such a damn shame they never made a Final Fantasy 15... Too bad... But it doesn't exist... You can't skip it cuz its not there...",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gold_Seaweed",
                                    "body": "😂 I wonder if this is an inside joke or hate. Either way I suspect I'll find out as time goes on",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rocketsneaker",
            "body": "You may as well playb14 if you're playing through all of them.you did the work to play through all the games and see all the references. You may as well cash out on that and play 14 to enjoy how much of a \"FF series playground\" it is. \n\nBut references aside, XIV is regarded as probably one of the *best* FFs in the entire *series*. \n\nI'd suggest just making a free trial account and just playing through the story solo.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "Wow, seriously? I will definitely check it out then. Best in the series in extremely high praises.\n\nIs it a subscription based MMO?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rocketsneaker",
                            "body": "Yup! The high praise is definitely deserved. There's a reason XIV joined the other 3 most popular FF's (VI, VII, and X) in representing the series when Magic the Gathering recently made 4 commander decks based on the FF series. \n\nAlso yes, unfortunately it is a subscription based MMO. The free trial will net you all content that exists in the base game and the first 2 expansions, and if you want to play further than that, yes, you will have to pay for the game. \n\nBut to be fair, the base game and first two expansions have a TON of content that will keep you occupied for weeks, if not a few months, if just playing casually. Playing through the story alone on the free trial would be the same as playing through 3 FF games.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "itsrue",
            "body": "I'm a big FF fan and have been since I was a kid. Please don't skip 13 and 15, and if you have the time definitely give 14 a try too (a majority of 14 can be enjoyed solo besides some earlier dungeons and bosses that need to be cleared with a party that the game will match you with. But you certainly may find yourself enjoying the MMO part of 14!).\n\nThey are some of my favorites even as a diehard traditional FF fan, I just value them for trying something new, which is always a good thing in a long-standing franchise like FF :) Wouldn't wanna get stale!",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "No doubt! Everyone has been telling me I'm making a mistake skipping them. I'll be playing all three. At least trying 14!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "itsrue",
                            "body": "That's great! 13 and 15 have some of my favorite cast of characters, so please enjoy!\n\n14 has slow momentum throughout the first story arc but it's foundational and important for the rest of the game, so definitely take your time to enjoy it! Once you hit Heavensward and beyond it will be a once-in-a-lifetime experience and well worth the hours spent. \n\nPersonally though I would try to finish the other mainline titles that you have first before you start 14, as 14 has a lot of references to other FFs that will be great for you when you get there! 14 is a big love-letter to the series.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "byronicbluez",
            "body": "I think 11 is soloable.  If you are ok with outdated mmo mechanics the game is great.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mooncubus",
            "body": "I don't see any reason to skip 13 and 15. And 11 and 14 can both be played solo for the most part.\n\nAlso get Stranger of Paradise. Today is its 3rd anniversary and it's on sale.",
            "score": 1,
            "replies": [
                {
                    "author": "Gold_Seaweed",
                    "body": "If 11 and 14 can be played solo, I actually might play them! I didn't know that. \n\nIt seems like everyone is saying 13 and 15 are good games, so I will likely play them!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Mooncubus",
                            "body": "Yeah for 11 you get access to Trust npcs which basically act as party members. So you can solo pretty much everything except endgame content. Rhapsodies also reduces the grind significantly by giving xp buffs and letting you just buy quest items you previously had to grind for as drops.\n\nFor 14 they added duty support to all required dungeons, which is similar to 11's Trust but you can't use them in the overworld. Your chocobo can be used in the overworld to fight with you though so it's fine. Some required trials can also be done with duty support, but there are a few you'll need to play with actual people. They go quick though.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}