{
    "title": "Why do they pour lime on dead bodies?",
    "author": "BLOODYBLADE238",
    "subreddit": "TooAfraidToAsk",
    "rank": 8,
    "score": 33,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 29,
    "url": "https://www.reddit.com/r/TooAfraidToAsk/comments/1jecl1b/why_do_they_pour_lime_on_dead_bodies/",
    "id": "1jecl1b",
    "selftext": "I've watched several movies where they dump lime on dead bodies and I gave it a Google search and nothing shows up I assume because they don't want people to be expert body disposers or something. \n\nI've seen it in Full Metal Jacket, Goodfellas and The Wire. No clue why they do it but I'd like to know ",
    "comments": [
        {
            "author": "mapsedge",
            "body": "Ya'll: LIME, not lye. Chemically similar, but two different things. Calcium hydroxide vs. potassium hydroxide.\n\nLime has been used for centuries to keep the smell down, discourage predation, and serve as a disinfectant. It doesn't help to break down the bodies as some believe: soil bacteria need a pH of between 4 and 10, and lime is much more alkaline than that.\n\n[Read all about it](https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=8b8862db9765dabf047901d0b6c973af85ceb5de).",
            "score": 171,
            "replies": [
                {
                    "author": "Wiggie49",
                    "body": "Did not know about it actually slowing down decay. Do you think it may have prevented diseases from leaching into ground water in the case of mass graves?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "wwaxwork",
            "body": "Lime is to stop smell.    It helps keep bodies hidden or makes them easier to live around like on a battle field.",
            "score": 52,
            "replies": [
                {
                    "author": "Loggerdon",
                    "body": "“You’re gonna dig the hole. I got no lime.”\n\n“I’ll dig the fucking hole, I don’t give a fuck. What is it the first hole I dug?”",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kiyohara",
            "body": "Lime keeps the smell down. That way you don't have to dig too deeply, you can just go deep enough that someone won't accidentally dig it up when planting a shrub or something. If not, you need to dig really deep (like six feet or more) or else the smell can rise up and clue someone in something's wrong.\n\nIt also has the benefit of fucking with any DNA evidence you leave behind. Any hair or blood would be contaminated with lime residue and make it hard to be used in court against you since, supposedly a good defense attorney could use the contaminant to introduce doubt.",
            "score": 43,
            "replies": [
                {
                    "author": "LemmyKBD",
                    "body": "This guy buries bodies and avoids prosecution.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "fordag",
            "body": "Fresh squeezed lime gives a nice flavor and covers the taste of beginning rot.",
            "score": 21,
            "replies": [
                {
                    "author": "AnthemWild",
                    "body": "I like to salt the rim too",
                    "score": 12,
                    "replies": [
                        {
                            "author": "theydotcom",
                            "body": "And they say that necrophilia is a dying art",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mlstdrag0n",
            "body": "Gives it a nice citrusy scent!\n\nJokes aside it hides the smell",
            "score": 7,
            "replies": []
        },
        {
            "author": "BriefStrange6452",
            "body": "Lime makes everything taste better!",
            "score": 3,
            "replies": [
                {
                    "author": "WannaBeA_Vata",
                    "body": "Midnight margaritas!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "c_author",
            "body": "Try searching for \"lye\".",
            "score": -9,
            "replies": [
                {
                    "author": "horsetooth_mcgee",
                    "body": "That won't do much good when they're talking about lime.",
                    "score": 44,
                    "replies": []
                },
                {
                    "author": "sweetmercy",
                    "body": "Why would they search for lye when they're taking about **lime**? It was thought for a long time to accelerate decomposition, and it does mask the odor of it, but it's now known that it actually slows decomposition.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "xdrymartini",
                            "body": "Likely misheard the term on his / her tv.  Lye is what’s commonly used on dead bodies. Helps break them down.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sweetmercy",
                                    "body": "Lye is not what's used in burials. Lime, either slated or quicklime, is what's used. And it isn't to break them down, though it was once believes it accelerates decomp, it's to mask the smell of decay. Lye is used in the cremation process, however.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Randylahey2884",
            "body": "Smell maybe",
            "score": 1,
            "replies": []
        },
        {
            "author": "Still_Apartment5024",
            "body": "Lye makes things decompose faster. They use it, among other reasons, to strip flesh off of animal skin when they make leather. So if you're trying to hide a body, covering it in lye would reduce it to just bone faster.",
            "score": -13,
            "replies": [
                {
                    "author": "sweetmercy",
                    "body": "Lime. Not lye, *lime*. Hydrated lime and quicklime have both been used in clandestine burials and mass burials of both humans and animals. It was thought in the past that it accelerated decomposition, but it actually slows it. It also masks the smell, which is a big part of the reason for it's use. \n\nLime is also what's used in leather production, and it's used to separate the hairs from the hide. It's also used in the lime splitting process, which separates the hide into the upper layer (full grain leather, known for its suppleness) and the secondary layer (crust leather, used for more affordable leather because of its less supple and versatile nature). \n\nLye is used in soap making. Diluted good grade lye is also used in some cooking, such as pretzels or processing corn into maize and masa, but it's used as a soak to break down tough fibers (like the skin of the corn kernels) and to give food like German pretzels their distinct texture.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "sneezhousing",
            "body": "It for lack of a better word eats the body up.   It breaks it down fast, destroying DNA evidence. So it makes it harder to identify the body when and if found, how they were killed and possibly who did it.\n\nAlso lye not lime",
            "score": -25,
            "replies": [
                {
                    "author": "Fairwhetherfriend",
                    "body": "No, lye and lime are different things, and they're both used for *different* purposes when it comes to handling bodies.",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mean_Rule9823",
            "body": "To break them down faster",
            "score": -21,
            "replies": [
                {
                    "author": "mapsedge",
                    "body": "Nope. Lime is too alkaline for that: it inhibits the activity of bacteria in the soil.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Chance_Key8659",
                            "body": "Lye then?",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "sweetmercy",
                                    "body": "No. Lye is used in cremation sometimes, more often with animals than humans but quicklime is used in burials. It was thought at one time you accepted decomposition but it slows it. What it does do, however, is mask the smell of decay.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -12,
            "replies": [
                {
                    "author": "sweetmercy",
                    "body": "No. Just... No. Lye and lime are two different things. Lime, usually quicklime, is used in burials because it covers the odor of decomposition. Lye is not lime. Diluted food grade lye is used for German pretzels, olives, and some other food production. It's not typically used in burials or tanning unless someone is very confused like you are here. Lime is used in tanning leather to remove hairs from the hide and to separate full grain leather from the crust leather.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}