{
    "title": "I want him to wear a mask during sex?",
    "author": "kitty-84",
    "subreddit": "TooAfraidToAsk",
    "rank": 13,
    "score": 13,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/TooAfraidToAsk/comments/1jei871/i_want_him_to_wear_a_mask_during_sex/",
    "id": "1jei871",
    "selftext": "\nOkay so I have a small, niche kink of masks? I like (some) purge masks, ghost mask, scream mask but probably balaclavas and ski masks the most! I know it’s a little strange..\n\nI like a ski mask and black examination gloves combo the most \n\nI just wonder if maybe anyone else has this or if this would be a dealbreaker in the bedroom for most people? Or maybe where this stems from?\n",
    "comments": [
        {
            "author": "OrdinaryQuestions",
            "body": "Its quite a common kink\n\nJust ask, it isn't unsual or something to be embarrassed about",
            "score": 23,
            "replies": []
        },
        {
            "author": "Opposite_Lettuce",
            "body": "I cannot stress to you how common this is. I remember working at Spirit Halloween a few years back, all the Ghost masks were gone in a flash and the vast majority were girls buying them for their boyfriends for that exact purpose lmao \n\nMasked thirst traps are an entire genre! Go wild! (assuming your partner is on board)",
            "score": 16,
            "replies": [
                {
                    "author": "kitty-84",
                    "body": "Ok good to know!!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "FrostyManOfSnow",
                    "body": "How the hell did you find out that's why they were buying them? I can't imagine them all sharing that info when buying a mask lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Opposite_Lettuce",
                            "body": "Groups of giggling girls, talking about the tiktok thirst traps are... not quiet",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AnyImpression6",
            "body": "![gif](giphy|fcbkCxKMMNrcQ)\n\nWhat about The Mask?",
            "score": 9,
            "replies": [
                {
                    "author": "kitty-84",
                    "body": "Ewww no!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CycleofNegativity",
                            "body": "Idk…",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LusciousofBorg",
            "body": "I have a thing for men wearing full helmets that cover their heads, like welding helmets or motorcycle helmets. You are not alone and sounds normal!",
            "score": 5,
            "replies": []
        },
        {
            "author": "AdmirableAd7753",
            "body": "When did you first realize this was a thing for you?",
            "score": 1,
            "replies": []
        },
        {
            "author": "refugefirstmate",
            "body": "Some might find it weird, some might enjoy it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AttentionRoyal2276",
            "body": "I think it's common.  I found it hot when women wore masks during covid",
            "score": 1,
            "replies": []
        },
        {
            "author": "TexasScooter",
            "body": "If you enjoy it and it doesn't hurt anyone, then why not try it?  I would think that most guys would be open to it, or some deviation.  They may ask for you to dress up a certain way that they like too.  You never know what this could turn into.",
            "score": 1,
            "replies": []
        },
        {
            "author": "poppinwheelies",
            "body": "Super common. I indulged in a bit of this with an ex girlfriend and have to say, it was pretty damn steamy 😮‍💨",
            "score": 1,
            "replies": []
        },
        {
            "author": "hagendasz1",
            "body": "I'm surprised at everyone saying it's common. I've never heard about anyone having that fetish!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capital-Designer-385",
            "body": "Curious if you’ve read “lights out” yet.  Ask him to listen to the audiobook with you.  He might get the idea himself",
            "score": 1,
            "replies": []
        },
        {
            "author": "HareevHajina",
            "body": "If my gf suggested this I’d immediately think it’s because she no longer likes my face.",
            "score": 1,
            "replies": [
                {
                    "author": "kitty-84",
                    "body": "I get that, but that’s absolutely not the case",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}