{
    "title": "Tucker Carlson on Trump's possible war with Iran. Trump is following Benjamin Netanyahu's orders, it's 2002 all over again.",
    "author": "roflroll",
    "subreddit": "JoeRogan",
    "rank": 17,
    "score": 907,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 359,
    "url": "https://i.redd.it/idgmw5uzjcpe1.jpeg",
    "id": "1jdt1hj",
    "selftext": "",
    "comments": [
        {
            "author": "No_Size9475",
            "body": "I hate when I agree with Tucker, but here is one of those instances.",
            "score": 488,
            "replies": [
                {
                    "author": "ballzstreetwets",
                    "body": "I came here to say this",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "dieno_101",
                    "body": "he's truly anti war",
                    "score": 90,
                    "replies": [
                        {
                            "author": "brokemac",
                            "body": "No one who works for Putin is \"truly anti-war\". It's an absurd proposition.",
                            "score": 114,
                            "replies": [
                                {
                                    "author": "Epyphyte",
                                    "body": "And likely Qatar. We all know what \"Neo-cons\" means at this point.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "allthemoreforthat",
                                    "body": "He supports ruzzia so… no.\n\nEdit: it appears that I replied to the wrong comment lol downvotes well deserved. This was meant to be a reply about Tucker.",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "author": "jadrad",
                                            "body": "And Russia needs Iran to make suicide drones to bomb Ukrainian schools and apartment blocks, so Tucker has his mouth around Putin’s ballsack as always.",
                                            "score": 43,
                                            "replies": [
                                                {
                                                    "author": "mwa12345",
                                                    "body": "Nah. Russia produces it's own drones now. They licensed .\n\nYour propaganda is about 3 years old",
                                                    "score": -18,
                                                    "replies": [
                                                        {
                                                            "author": "seenitreddit90s",
                                                            "body": "They do both. \n\nYour propaganda is inaccurate.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "mwa12345",
                                                                    "body": "Yes. Putin tells you exactly how much he buys and how many he builds \n\nMeanwhile.. Trump blows Benji \nWhat a moron!",
                                                                    "score": -3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "dopef123",
                            "body": "I think he's just in the pocket of Russia. Iran is their ally. China is sorta their ally but also one they want to weaken.",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "cugamer",
                                    "body": "This is the answer.  Please daddy Trump, don't start a war with daddy Putin's buddies!",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "mwa12345",
                                            "body": "No. Do It  for daddy Netanyahu.  The rightful master!",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "telefawx",
                                    "body": "Bahahahaha your coping is so weird.",
                                    "score": -13,
                                    "replies": [
                                        {
                                            "author": "BoltUp69",
                                            "body": "Wait, you think Tucker went to Russia and promoted their janky supermarkets for free? You think he’s extremely anti-Ukraine…for free?",
                                            "score": 47,
                                            "replies": [
                                                {
                                                    "author": "Frosty-Beans",
                                                    "body": "Come on man, he was there to take putin out. He landed the interview, and then got recruited by the CIA.\n\n![gif](giphy|qxtxlL4sFFle)",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Expensive-Shelter288",
                                                            "body": "Dude I loved it why the downvote!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Frosty-Beans",
                                                                    "body": "because everyone here is a serious political operative. no laughing allowed!",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "telefawx",
                                                    "body": "How much did Tucker make?",
                                                    "score": -13,
                                                    "replies": [
                                                        {
                                                            "author": "BoltUp69",
                                                            "body": "Shiiiit the Russians were paying Tim Pool, Dave Rubin, and Benny Johnson $400K/month EACH. Imagine Tucker lol.",
                                                            "score": 27,
                                                            "replies": [
                                                                {
                                                                    "author": "steddy24",
                                                                    "body": "Cool proof",
                                                                    "score": -18,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lt-Dan-Im-Rollin",
                                                                            "body": "https://www.npr.org/2024/09/05/nx-s1-5100829/russia-election-influencers-youtube\n\nIt’s proven they took Russian money and made videos including Russian talking points, but they deny knowing the money came from Russia. \n\nReal “I did not have sexual relations with that woman” energy. \n\nCombine this with the mueller report, it’s pretty hard to deny at least some republicans are being paid to push Russian propaganda",
                                                                            "score": 26,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "steddy24",
                                                                                    "body": "I said proof. Not allegations. The fuck",
                                                                                    "score": -13,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Lt-Dan-Im-Rollin",
                                                                                            "body": "Did you read the article? It is proven. Russians paid American influencers to push their talking points. It’s just that the influencers deny knowing the money came from Russia and are claiming they are a victim of the Russian propaganda scheme. They are not denying they got paid to push certain talking points, which coincidentally are also Russian talking points. \n\nAlso the mueller report has tons of proof that republicans were knowingly paid by Russians",
                                                                                            "score": 8,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "WhiteRoseRevolt",
                                                                                            "body": "Tucker consistently spreads pro Russian talking points. He knows these are incorrect, but spreads them nonetheless.\n\nThat's not anti war. It's pro war.\n\nAlso. His texts indicate he's an absolute charlatan. Saying one thing on air and discussing others in private.",
                                                                                            "score": 4,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "steddy24",
                                                                                                    "body": "Show me the video of trump being pissed on. Been waiting since 2015",
                                                                                                    "score": -8,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "MeThinksYes",
                                                                                                            "body": "hey dude there’s plenty of piss work available online, take your pick. Not sure you can afford the trump ones when they come out. #ppv\n\n but for the love of trans-Christ could you keep  it to yourself?",
                                                                                                            "score": 6,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "WhiteRoseRevolt",
                                                                                                            "body": "Nice. So let's talk about tapes Russia is holding on trump.\n\nWhy do you think a Russian oligarch spoke directly with trumps lawyer Michael cohen, who remarked they had \"stopped the tapes from. Coming out of Moscow but we're not sure if theres more\"\n\nWhat do you think that conversation was about?\n\n(try to response without whataboutism and stay on topic)",
                                                                                                            "score": 5,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "dopef123",
                                                                                            "body": "The US judgment department publically came out and outted them for doing it.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "BoltUp69",
                                                                            "body": "Lmao did Bill Clinton diddle with underage girls with Epstein?",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BarnesWorthy",
                                                                                    "body": "Likely. Did Trump? Also likely.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "VanDammeBigelow",
                                                            "body": "He made about as much as the Epstein flight log list… you’ll never really know!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dopef123",
                                            "body": "I’m not coping with anything. He got a private interview with Putin and then made a bunch of weird pro Russian videos while he was there. He is anti Zelenskyy.\n\nLots of conservatives are promoting Russia heavily. Tim pool was caught recently taking millions from Russia.\n\nDo you think all these things just happened because he’s an amazing journalist?",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Alieuu",
                                            "body": "They side with one thing and they’re Russian puppets if they side with the other then their Israel’s puppets it’s a lose lose for libs",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "NJcovidvaccinetips",
                                    "body": "Who cares he’s right",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "moodytenure",
                            "body": "Anybody know what he thought about the Iraq War by chance?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ThiccBoy_with3seas",
                            "body": "I think he would cheer on conflict with China, we will.have to see",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Kuriyamikitty",
                                    "body": "He’d be more interested in keeping China afraid and on the back foot than all out conflict, but if there is make it hurt so much they back off immediately.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Entire-Enthusiasm553",
                                            "body": "Ahh the old Hiroshima Nagasaki combo!",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Temporary-Alarm-744",
                            "body": "No he isn’t. He’s a Putin talking piece and Iran is a useful Putin piece",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Bearynicetomeetu",
                            "body": "He isn't, he's pro Russia.\n\nRussia aren't direct allies with Iran, but they don't want the west to go to war with them",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "vvashabi",
                            "body": "He is NIMBY War",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "HarwellDekatron",
                            "body": "No, he isn't. He'll support war with Canada if Dear Leader says we need to do it to \"stop the wokeness\" in Canada or whatever.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "EntrepreneurFunny469",
                            "body": "I think he’s just pot stirring",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SrCoolbean",
                    "body": "Gotta admit, he does think for himself (for better or for worse)",
                    "score": 14,
                    "replies": [
                        {
                            "author": "mydaycake",
                            "body": "Tucker is following Putin’s lead. Russian doesn’t want the USA bombing Iran",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "LDL2",
                                    "body": "So Trump attacks...follows Putin.  Tucker wins follow Putin...you poeple are so dumb.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "NJcovidvaccinetips",
                                    "body": "The USA shouldn’t wang the USA bombing Iran. Tucker is a chode but he’s right about this",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "NormalEntrepreneur",
                                    "body": "Bomb Iran is helping Russia because you are not giving the bomb to Ukraine.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dustmuffins",
                                            "body": "Ukraine isn't getting the same bombs that would be used on Iran. We wouldn't be using old cold war shit to hit them.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "mwa12345",
                                    "body": "Nah. Russia wouldn't mind. Less missiles for Ukraine.\n\nBenji would love it. Benji owns trump .",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "smellmywind",
                            "body": "No chance, he is paid by someone to say this. Who is allied with Iran?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Rus_Shackleford_",
                                    "body": "I can’t tell if you are serious or not. You think someone needs to pay a right wing guy to say a war with Iran at the behest of Israel is bad for America? Are the Russians in the room with us now?",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "smellmywind",
                                            "body": "Right wingers don’t have opinions unless there is money involved, and they have whatever opinion that highest bidder tells them to have.",
                                            "score": -17,
                                            "replies": [
                                                {
                                                    "author": "BeamTeam032",
                                                    "body": "This is why dems continue to lose. You could have easily been much sneakier about this. But you couldn't last more than 1 prompt. You could have asked if Turkey paid him. Tucker is a HUGE fan of Turkey's government. \n\nFuck man, no wonder the west is collapsing. You can't even troll correctly anymore.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "ThisisMalta",
                                                            "body": "Lol because there are varying opinions amongst people left of center? It isn’t some giant monolith, most adults can move on past someone when they don’t agree with their analysis of the situation.",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "WholeMilkElitist",
                                                            "body": "This comment has me dead lmfao",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "postdiluvium",
                                                            "body": ">This is why dems continue to lose.\n\nBecause someone said something on Reddit? You fragile snowflake.",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "BlitheringObligation",
                                                    "body": "Right wingers don’t have opinions unless a blonde bimbo or some bloviating yelling guy on Fox News tells them what their opinion is.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Rus_Shackleford_",
                                                            "body": "Weird. I have opinions and yet I don’t watch any of those things.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "heroes-never-die99",
                                    "body": "Proof?",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "BeamTeam032",
                                            "body": "Tuckers interview with Putin. It even has historical easter eggs that the dumbies missed. The entire point of the grocery store, was because the USSR came to America and raved and freaked out about Americas grocery stores because he's never seen so much food. \n\nBut ya'll missed it. Because you get your history from Podcasts.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "mwa12345",
                                                    "body": "Yet. It was to show that Russia is not like the old Soviet union....",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "heroes-never-die99",
                                                    "body": "You have proof that tucker’s paid by someone to say this stuff??",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PromiscuousMNcpl",
                                                            "body": "No signed affidavit triple notarized. But considering how must right wingers feel about evolution and climate change there is no threshold of facts capable of changing your mind.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "heroes-never-die99",
                                                                    "body": "I’m right wing?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PromiscuousMNcpl",
                                                                            "body": "You’re JAQ-ing off.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "smellmywind",
                                            "body": "Proof is that he is tucker carlson, right winger.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "Birdflower99",
                                                    "body": "So.. just your feelings. Typical argument, lacking facts",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GOPequalsSubmissive",
                            "body": "He’s doing what he’s told, bro",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BenderRodriguez14",
                    "body": "Don't worry, if Trump does go ahead and do it Tucker will be right there with all the other propagandists lying to you about how it has to happen, is a good thing, but is also the left's fault and utterly catastrophic. ",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Rus_Shackleford_",
                            "body": "I don’t think so. He’s spoken a bunch of times about how much he regrets supporting the Iraq war and how mad he is that he helped spread their lies leading up to the war. He seems pretty sincere about this. If you want to talk about a guy who will say whatever and lie about how it has to happen, Sean hannity is the guy.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "BrainsAre2Weird4Me",
                                    "body": "We learned from the Dominion lawsuit Tucker called Trump a “demonic force, a destroyer” and said there was no upside to his term in office and that they should stop pretending there was. \n\nSomehow, I don’t think Tucker’s private opinions matters much when push comes to shove.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "TheyGotShitTwisted73",
                                            "body": "I was just thinking about that. This just might be too unhinged for even Tucker to entertain. I'm a little shocked tbh.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Rus_Shackleford_",
                                            "body": "As a right winger, I don’t see much to celebrate this far with trump either. I want a destroyer, but so far all I see is a bunch of Israel firsters where it counts. Sure, them sending a couple plane loads to El Salvador prisons is both a good thing and hilarious, but those numbers are basically meaningless.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ThisisMalta",
                                    "body": "This isn’t exactly a brave position to take on the Iraq war. Politicians and talking heads on the left and right all say this now that it’s the safe position.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "chickennuggetscooon",
                                            "body": "Yes, but then they go ahead and support any and all wars since then. At least Tucker actually learned the lesson instead of just saying he did like every other talking head.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ThisisMalta",
                                                    "body": "What wars are the all supporting now? What invasions are they supporting?\n\nI don’t see any evidence Tucker has learned his lesson anymore than every other politician and taking head who fully supported the Iraq war and are now saying “whoops  😊 “. Like I said, it’s low hanging fruit and pretty common place to admit that now. He’s not showing himself to be any different than litany of others taking this position now.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "chickennuggetscooon",
                                                            "body": "The bombing of Gaddafi, the bombing of Assad to include the strategy of \"tunneling\" where ISIS was not bombed or attacked where there lines are near Assads, our current to this day operations in Iraq and Syria, the funneling of arms to Ukraine to prolong that war.... really every single conflict since 2003, Washington completely agrees with getting involved in. Despite claiming to have learned the lesson from Iraq.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BeamTeam032",
                    "body": "When the absolute worst person makes a point you agree with. \n\nSometimes it happens. lmao",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Shakewhenbadtoo",
                    "body": "He had his chance, chose to bullshit for more money he never needed, and lost.  Tissues for the tears won't stop the outcome.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Secure_Run8063",
                    "body": "I am missing something - did Trump say that he is going to war with Iran? What is the impetus for the response from Tucker Carlson?\n\nOh, it's connected to the Houthi attacks. I see, now. This is kind of a mixed message as isn't he also trying to start negotiations on the nuclear treaty again?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Barbiegrrrrrl",
                            "body": "Also rumors that the US attacked an Iranian naval ship.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "friedreindeer",
                    "body": "You are a wise person to agree based on facts rather than feelings. The world needs more of that. I hate to say that even Trump might be right sometimes (just way too little to be justified acting as president.)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mwa12345",
                    "body": "Better to have truths spoken by the likes of tucker than wallow in silence (or lies) from the propagandists.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "erickbaka",
                    "body": "What are we agreeing to here, exactly? Save a few billions and maybe a thousand lives now, sounds good! But then Iran gets nukes. So the next time they threaten US it will be as a nuclear superpower. Wat do then? Hide head in radioactive sand and give in to their crazy demands?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fuzztooth",
                    "body": "I'm sure once it starts tuckher will be one of its strongest cheerleaders.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dadrph76",
                    "body": "Ditto. Wtf is the world coming to.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "leftrightside54",
            "body": "It's begun. Gaza ceasefire is over since Israel resume bombing in GaZa.  US is  bombing Syria, and Yemen already. Two more carriers moving in (prob an attack on Iran).",
            "score": 110,
            "replies": [
                {
                    "author": "wfg5416",
                    "body": "Born too early to fight in the Middle East, too late to fight in the Middle East, and just in time to fight in the Middle East.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "gaytorboy",
                            "body": "Stealing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fuzztooth",
                    "body": "Remember though, every conservative hog repeated their free thinking thought that donnie is \"anti war\" and \"no new wars\".  \n\nAlways bullshit from the magats.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "SalmonSuitHATER",
                    "body": "Israel wants war with Iran just like they wanted war with Iraq.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "BBAomega",
                            "body": "Iran wants it too, well the crazy mullahs do",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SalmonSuitHATER",
                                    "body": "I don’t think Iran wants war with America",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "BBAomega",
                                            "body": "I'm talking more about the mullahs",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "SalmonSuitHATER",
                                                    "body": "Even the mullahs don’t want war with America. They hate Israel tho",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdvancedAerie4111",
                    "body": "Where are you seeing that we are moving more carrier attack groups to the ME? I only see the USS Harry S. Truman Carrier Strike Group in the region.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TreeP3O",
                    "body": "It's over because Hamas didn't fulfill it's obligations, but I bet you knew that.",
                    "score": -30,
                    "replies": [
                        {
                            "author": "MrTurtleHurdle",
                            "body": "Isreal has not adhered to any ceasefire fully no matter Hamas actions . That's no secret. You don't have to defend Hamas to realise the fact isreal has been the higher volume killer who has committed higher rate for warcrimes ignoring ceasefire deals and blocking mandatory aid this entire conflict",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "TreeP3O",
                                    "body": "That is all nonsense.  Israel was attacked and you wanted them to lose,  so your waste time online trying to make them the bag guy.  \n\nHamas never should of attached Israel.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "MrTurtleHurdle",
                                            "body": "I wanted? Bro I'm Australian I didn't want anything. If your moral grounding starts and ends on October 7 you're clearly unable to see the wider picture. Neither side is innocent here but one has far more blood on its hands and that's isreal. We could go back and forth on who started it but isreal is the one who has ignored multiple ceasefires and is blocking aid and outwardly state they are blocking aid to starve the remaining population of Gaza which is an international war crime. Don't put that as what 'i want' that's what the goddamn international criminal caught has found to be factual for months. Go run defense for warcrimes if you like and don't put words in my mouth. The footage, words of Israeli war mongering  politicians  the ICC is public for all to see. I didn't once defend Hamas I just pointed out isreals actions",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "iminabed",
                                            "body": "You ignoring the fact that PRIOR to October 7th, 2023, 2023 was the deadliest year for Palestinian children. Again PRIOR. As if this all started on the 7th. Israel has been systematically attacking Palestinians for generations and pushing propaganda for just as long. Go to a pro Palestinian protest and you’ll find just as many Jews as Arabs protesting against Israel.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Spiders-From_Mars",
                                            "body": "Your brain is detached for your head. Israhell has been attacking Palestine for over 70 years. There was never peace to begin with\n\nPalestine has the right to defend itself.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "leftrightside54",
                            "body": "Of doing what? Source it as well.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "nadav183",
                                    "body": "Returning the hostages on time? Giving the humanitarian aid to the citizens of Gaza? Returning the body of Shiri Bibas instead of a random corpse?\n\nSources:\nhttps://www.cbsnews.com/news/hamas-israel-gaza-ceasefire-violations-hostage-release-delayed-qassam/\n\nhttps://www.nbcnews.com/news/world/israel-gaza-war-aid-trucks-theft-prices-soaring-rcna180761\n\nhttps://www.cnn.com/2025/02/21/middleeast/shiri-bibas-body-gaza-israel-intl-latam/index.html",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "wrld_news_pmrbnd_me",
                                            "body": "Your source literally described how Israel did not fulfill their obligations",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "nadav183",
                                                    "body": "No, they describe how Hamas claims they didn't.\nBoth sides claim the other didn't, but Hamas is still holding, torturing, starving and killing hostages. Their ridiculous ceremony giving the hostages a fucking gift bag and parading them like some fucking trophy is terrorism at it's finest. Giving a random corpse instead of Shiri's corpse is putting extra torture on her poor husband after they already murdered his wife and two baby children in captivity is reason enough to kill every last human that identifies as part of that organization.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "wrld_news_pmrbnd_me",
                                                            "body": "Israel has killed 100k+ people, mostly innocent. They claim every male is Hamas and justify it to the world that way, but everyone knows their lies now. Today alone they killed 400 innocent women and children. Nothing justifies that. Get your head straight man it’s sick what Israel is doing, war crimes that will be cemented in the history books.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "nadav183",
                                                                    "body": "Any source for these ridiculous numbers?",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "wrld_news_pmrbnd_me",
                                                                            "body": "What number are you okay with? It’s common knowledge that true death count is at least double but you can find your sources right on wiki https://en.wikipedia.org/wiki/Casualties_of_the_Gaza_war",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "BBAomega",
                                                                    "body": "No one will know how many have died and who was innocent or not long after the war unfortunately",
                                                                    "score": -5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "leftrightside54",
                                            "body": "Here is what happened since you left out quite a bit on the negotiation. Israel did not want to go to phase 2, so they tried to extend phase 1. When Hamas did not agree, they broke the ceasefire by withholding aid for two weeks then resume their attack.\n\n>Israeli officials have indicated their desire for phase one to continue rather than moving on to the more difficult negotiations in phase two. An Israeli source familiar with the matter told CNN earlier in the week that Israel was trying to prolong the first phase of the agreement “by as much as possible” in the hope of releasing more hostages.\n\n>Netanyahu is under tremendous pressure to return to war. His finance minister, Bezalel Smotrich, has threatened to withdraw from the governing coalition if Israel doesn’t restart the war and Itamar Ben Gvir quit his post as national security minister over the ceasefire.\n\n[source](https://edition.cnn.com/2025/03/02/middleeast/israel-halts-gaza-humanitarian-aid-intl-hnk/index.html)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JakeInTheJungle",
            "body": "Love the few hours/days of honest reactions after Trump does something stupid, but before the pundits get the “correct” messaging from the top and do a 180.",
            "score": 59,
            "replies": [
                {
                    "author": "mwa12345",
                    "body": "Nah. Tucker has been pretty consistent on this and in general, the middle east  - since the Iraq war .",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "ObservantWon",
            "body": "Can we please get the fuck out of the Middle East all together?  Israel included. Let them all handle there disputes themselves.",
            "score": 63,
            "replies": [
                {
                    "author": "WhiteRoseRevolt",
                    "body": "This is unfortunately what Americans voted for.\n\nPlus. Donald needs a distraction since he's getting cucked by Putin this Thursday.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "SalmonSuitHATER",
                            "body": "They were lied to that orange clown",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BBAomega",
                    "body": "Not that simple, geopolitics",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "LorenzoCampoGrande",
                    "body": "Their",
                    "score": 1,
                    "replies": [
                        {
                            "author": "buzzerbetrayed",
                            "body": "Feel better?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "LorenzoCampoGrande",
                                    "body": "Honestly, yes",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SwitchCube64",
            "body": "For once you're not wrong Tucker. Maybe you could call up your buddy in the WH and let them know",
            "score": 119,
            "replies": [
                {
                    "author": "cannot_walk_barefoot",
                    "body": "Tucker doesn't believe in anything other than money and power. The Russian are aligned with Iran, they don't want Iran threatened by the US. This is why Tucker is saying this on their behalf. Not out of the goodness of his heart or worry for the troops around the world",
                    "score": 46,
                    "replies": [
                        {
                            "author": "SwitchCube64",
                            "body": "It doesn't need to be out of the goodness of his heart for it to be correct lol",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "pickledswimmingpool",
                                    "body": "I say stuff like 'lets not invade Iran/Pakistan/Saudi Arabia' all the time. Why don't I get all you guys huffing my nuts? \n\nWhy are you guys giving this dude an ovation for not tripping over the lowest bar possible?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SwitchCube64",
                                            "body": ">For once you're not wrong Tucker.\n\nthat's a nut huffing ovation?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "cannot_walk_barefoot",
                                    "body": "I didn't say he was incorrect. I'm saying he's proven his loyalties lie elsewhere other than the west so the reasoning he's giving in the tweet (worried about US troops or terrorist attacks in the US) isn't the reason why he's saying what he's saying.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SwitchCube64",
                                            "body": "k",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "mwa12345",
                                            "body": "Tucker loyalty is not to the west?\n\nInteresting take. If anything, he seems more \" survival of the west\" type of Paleo von than all the war mongering neocons - who care about Israel primarily.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "atworkobviously",
                            "body": "If Tucker said rape was wrong because the Russians told him to, he would still be right. The motive doesn't matter if the message is correct, and it really doesn't matter if the message is important. It's gross to say it, but Tucker is right on this one.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "WhiteRoseRevolt",
                                    "body": "The intent does matter.\n\nLook. The war against Iran will be awful. But it's also the same candidate Tucker helped elect. Acting surprised now is kind of ridiculous.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "mwa12345",
                                            "body": "Not sure if it is acting surprised.\n\nRemember Kamala also said Iran was the biggest geopolitical threat to the UD. Not Russia/China etc.\n\nThe neocons have been pushing these ears and both parties are for it for varying degrees.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhiteRoseRevolt",
                                                    "body": "No. Both parties aren't for it. Trump is clearly more pro war",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mwa12345",
                                                            "body": "Yes. Biden was a peaceful.\nThe man who claimed he is a Zionist and funded the genocide for several months.\n\nThe system is owned .\n\nIf Trump bombs, you think Schumer will stop funding ?\n\nFetterman?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "WhiteRoseRevolt",
                                                                    "body": "Yes. Biden was the better option for Gaza too. He placed limits on weapons sent (something Trump lifted on day 1) and also supported a two state solution.\n\nContrast that against Trumps plan to literally \"clean it all out\" and his desired to make it a resort. And couple that with Bibi also having a clear preference for Trump.\n\nYes. Biden wasnt perfect. Neither was Kamala. They were still better than Trump. And what we are seeing now.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mwa12345",
                                                                            "body": "I think you fail to see how much the parties are ear mongers.\n\nPretending one is slightly better than. The other is moot and pointless .\n\nBiden didn't really stop too many weapons. Pages and pages \n\nTrump ostentatiously restarted one item that Biden had stopped \n\nBut all that is show - Biden stopping and trump restarting.\n\nThe genocide started under Biden . And it will continue under  Trump.\n\nEither way, you vote for netanyahu.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "WhiteRoseRevolt",
                                                                                    "body": "This isn't all show. Bibi and Trump are literally working in tandem now. That wasn't the case previously.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Oktaz",
                                                                                            "body": "Bibi and the US work together. Doesn't matter who the president is. Israel is untouchable at the moment.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "WhiteRoseRevolt",
                                                                                                    "body": "It does matter. Bibi specifically waited for a ceasefire and gave Trump this win. This was a strategic decision to get Trump elected.\n\nIt's cynical and it sucks. But that's politics.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "mwa12345",
                                                                                                            "body": "Think the ceasefire happened*after*  trump was elected?\n\nAgree Trump and Benji are working together.\n\nSame as Biden , when he had any faculties left \n\nMost others, it seems blinken ran the show.\n\nIf Kamala had won, it would have been almost the same...just minor differences and maybe some occasional feigning if concern for the women and children bombed to smithereens. But no real change.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "glk3278",
                                    "body": "But the intent does matter. If a pedophile is a grooming a kid, and they build trust by slowly introducing more and more sexually explicit dialogue, and part of that trust is instilling the idea that \"rape is wrong\" and he would never do that. Well, don't you think the motive their means something? He's angling for an outcome where he can rape a child with the least amount of pushback, all while espousing how horrible rape is...",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "cannot_walk_barefoot",
                                    "body": "I don't think anyone deserves props for saying something as obvious as 'don't rape someone' or 'don't bomb another country'. Seems like common sense",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "mwa12345",
                                            "body": "You would think. But the amount of vitriol for saying \"don't bomb country x and start a war\" ...is something that cannot be said  on US media ..it seems",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Carlson-Maddow",
                            "body": "Reddit is so far gone.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Rus_Shackleford_",
                                    "body": "It is. They make these assertions based on *absolutely nothing* other than what their fellow travelers on the internet say. It’s truly pathetic.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "DropsyJolt",
                                            "body": "Also the things that Tucker has done himself. Like straight up propaganda in a Russian grocery store. But you know, ignore all that since it doesn't fit your fantasy of it all being about what other people say.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Rus_Shackleford_",
                                                    "body": "To this day I fail to see what was wrong with what he did. The coverage on Russia, Russians, and Putin as some kind of marvel universe villain was so over the top as to be cartoonish. All he did was go around with a camera and look at stuff.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Frigorific",
                                                            "body": "Putin killed his largest domestic political rival in prison less than a week after Tuckers fluff piece.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "Rus_Shackleford_",
                                                                    "body": "To this day, there is zero evidence he killed that guy.\n\nFrom a real politic prospective, there was no reason to kill him, and plenty of reasons not to. Whatever you want to say about Putin, he isn’t stupid.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Frigorific",
                                                                            "body": ">To this day, there is zero evidence he killed that guy.\n\nLmao. Who exactly is supposed to be getting this evidence?\n\nYou seriously think there was no political reason to kill the figurehead of Russian political opposition during a time of instability?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Rus_Shackleford_",
                                                                                    "body": "It wasn’t a time of political instability. He has just had a productive meeting with his foreign opposition, he was getting more or less what he wanted, so it makes no sense to do something like this thay is guaranteed to get him more international condemnation. \n\nNalvany wasn’t an actual threat to Putin or his rule. In that way, he was the perfect opposition figure. You don’t kill those people. The biggest threat to Putin is hardliners who want to take a more aggressive stance against the west, not some CIA/state department put up stooge like nalvany.\n\nPutin didn’t benefit from that in any way. Plus, the lack of evidence. ‘Putin bad, therefore Putin killed him’ isn’t an opinion sober adults who form opinions based on logic would hold. That’s for people who are governed by their emotions.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Frigorific",
                                                                                            "body": "You are seriously saying 2024 was a politically stable year for Russia? While they had terrorist attacks in Dagestan and were in the middle of their highest casualty war since WWII?\n\nThe fuck are you smoking? lol.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Rus_Shackleford_",
                                                                                                    "body": "Yes. Those two things don’t mean the government was in danger of being overthrown. Nalvany was in prison, and was never a threat to Putins rule. You seem to not understand the power structure there - the threat to Putin comes from the opposite direction as what Nalvany represented. Nalvany wanted to kowtow to western rule. The biggest threat to Putin is hardliners who want to take a tougher stance against the west.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Carlson-Maddow",
                                                    "body": "How is going to a Russian grocery store propaganda? The grocery store was stocked by his producers or something to look bountiful? Do you believe that lmao",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "SwitchCube64",
                                                            "body": "You guys are too cute",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Carlson-Maddow",
                                                                    "body": "You guys literally never have any logic or  evidence. Leaderless too",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SwitchCube64",
                                                                            "body": "😂 baby needs a king\n\nWhat was the purpose of Tuckers little Russia video?",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "VladimirSochi",
                            "body": "But I thought Trump was a Russian asset, so why would he want to push against Iran, if what you are saying is true? Or is he somehow both an asset of Russia and Israel?\n\nI don’t like Trump but the dots you are trying to connect don’t make much sense.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cannot_walk_barefoot",
                                    "body": "Trump is for sale. He literally has stocks and crypto foreign nations dump money into, and that's not including his hotels. All the different entities have different goals. The Israel lobby and war hawks in his cabinet want war with Iran. That will conflict with his Russian and Chinese funders. He's not smart enough to placate them all, which is why he's so wishy washy about tariffs on Canada and China one day and then not, then back again. He doesn't know what he's doing. He's a moron. He listens to the last person that spoke to him and acts, because they all know how to work his ego. Call him a strong smart boy that knows what to do (while mentally pushing him towards their goals) ",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "VladimirSochi",
                                            "body": "He’s not a good guy but he’s not a moron. Your arguments here contradict plain and simple. That’s my point. Dismissing it as “he’s too dumb to know what he’s doing so he just does whatever” doesn’t check out.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "mwa12345",
                                                    "body": "Well said",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kismadel",
                            "body": "Exactly. A strengthened Russian alliance is the real foreseeable threat.\n\nIt's hard to say why Tucker has so much allegiance to Putin but it's pretty irrefutable at this point that he supports him.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mwa12345",
                                    "body": "BS. We are 37 trillion in debt and China is the manufacturing hub of the world \nThat is a bigger threat .\nThis is just  neo con  propaganda  to start middle east wars for their favorite genocidal regime - Israel",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ok-Memory4682",
                            "body": "It’s funny how all of his points are very pro American but he’s paid by Russia lol",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "justinpollock",
                    "body": "nice try",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "MyFavoriteSandwich",
                    "body": "Conor?  You want him to call Conor?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Beneficial-Piano-428",
                    "body": "What account are you on now?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "SwitchCube64",
                            "body": "huh?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Beneficial-Piano-428",
                                    "body": "Only 190 days into Reddit eh? You seem like a pro bro",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "SwitchCube64",
                                            "body": "👈😎👈 thanks",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Beneficial-Piano-428",
                                                    "body": "That’s not a compliment and your game is clear. But keep getting banned or suspended.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "SwitchCube64",
                                                            "body": "#🤓",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "truespaghet",
            "body": "But he’s the anti war president! Liberals are all blood thirsty war mongers! Don’t you remember guys?",
            "score": 101,
            "replies": [
                {
                    "author": "jadrad",
                    "body": "Hey look! \n\nTrump’s putting into action the Iran war plan he asked the Pentagon to whip up in 2020, then stole from the government after leaving office so he could falsely accuse General Milley of being a warmonger.\n\nThe same General Milley who stopped Trump from deploying the US military on home soil in June 2020 to gun down peaceful protesters.\n\nIt’s almost like Trump was a lying sack of fascist shit the whole time, but folks like MAGA Joe Rogan just refused to see it, and now that Trump doesn’t need to run for re-election again, the hoods are coming off and the Heil Hitlers are on full display.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "HarwellDekatron",
                            "body": "\"But he's SO FUNNY! Jamie, play that clip of Trump shitting his pants during that press conference!\"",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Necessary_Win5111",
                    "body": "War bad when stopping fascist caucasians in Europe.\n\nWar good when bombing brown religious extremist in the Middle East.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "telefawx",
                    "body": "I remember Democrats cheering on wars the last 4 years, yes.",
                    "score": -28,
                    "replies": [
                        {
                            "author": "I-run-in-jeans",
                            "body": "If you don’t want to help Ukraine, just say that. Saying anybody wants war is so disingenuous",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "PromiscuousMNcpl",
                            "body": "Democrats aided an ally against an enemy invader. \n\nIt’s amazing how you all misframe reality so aggressively.",
                            "score": 32,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -42,
                    "replies": [
                        {
                            "author": "truespaghet",
                            "body": "No no no, you got it all wrong! Trump is the president of peace. The liberal war machine had to be stopped by any means necessary. He’s also saving the economy and deporting all the dog eating immigrants!",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "Strange_Law7000",
                                    "body": "lol Trump sucks and neoLiberals are funded by THE BIG WAR MACHINE, you child",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "author": "truespaghet",
                                            "body": "Sarcasm doesn’t come natural, huh?",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "justinpollock",
                                                    "body": "you are lame",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Selfket",
                            "body": "“bit of a stretch”\n\nso the no new wars slogan you guys touted never happened then? cope harder",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "truespaghet",
                                    "body": "You don’t understand! There would have been no new wars is everyone on earth just bowed to emperor trump and did whatever he said, in spite of their own people.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "SwitchCube64",
                                            "body": "and no Tariffs too! The rest of the world just needs to become one big beautiful 51st state 👐 Think of it. [The United Planet Trump of America](https://youtu.be/KRbrTwq7Zy8?si=QStokrozcVAplXQ8&t=18)",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Strange_Law7000",
                                    "body": "who are you talking to?  did you get excited and think I was a Trump supporter?  not a chance, moron",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Selfket",
                                            "body": "gotcha okay, also in case you delete this comment great job on switching to an alt definitely nothing you are hiding bud 👍👍👍\n\nhttps://preview.redd.it/8u3bxzfuwcpe1.jpeg?width=1170&format=pjpg&auto=webp&s=b76b837e5840ef274b5dd1d9b309516cfc47b3e4",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "beyeond",
            "body": "Ww3 on the horizon and Rogan is just banging Tony hinchcliff like it's 12/20/12",
            "score": 40,
            "replies": []
        },
        {
            "author": "Kiwiana2021",
            "body": "Trump seems to be on a mission….. to send America into turmoil",
            "score": 7,
            "replies": [
                {
                    "author": "mwa12345",
                    "body": "Nah. Miriam adelson paid money and trump is pleasing his owners - Benji and co.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "know_comment",
            "body": "\"conservative\" spaces on reddit are starting to advocate for:\n\n\\- censorship\n\n\\- war\n\n\\- attacks on civil liberties in America.\n\nwhen you see this, look at the profiles of the accounts promoting it. I've noticed that thay ALL have something in common. the exactly same thing as the accounts that have been promoting a certain genocide for the past year and a half.",
            "score": 49,
            "replies": [
                {
                    "author": "OrinThane",
                    "body": "I want to also add that most of the major conservative players in the space are starting to shift their talking points to how “deranged” the left is, how there is “no reasoning with these people”, they have a “mind virus”, etc..\n\nMy point is it is a shift in language to attack the opposition as deeply character flawed and different than their base. The conversation has already started to shift from the left being wrong to the left being the problem  and… well I’m just worried. This shift in language is generally used as the first step in rationalization of an action.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "truespaghet",
                            "body": "Be ready when the time comes. These people are the enemy and I think we’re past the point of trying to keep it civil.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "PromiscuousMNcpl",
                            "body": "MN just had its first brush with criminalizing TDS. Which is such an “every accusation is a confession” moment it’s flabbergasting.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "StealUr_Face",
                            "body": "A lot of the right leaning people I’ve listened in on are actually starting to critique Israel and their influence on domestic and foreign policy",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Due-Pineapple-2",
                    "body": "It’s no use when I pointed out how weird that both the Epstein files and the jfk files had to through pro Isreal tiktok influencers and Epstein lawyer himself I was called an antisemite",
                    "score": 8,
                    "replies": [
                        {
                            "author": "know_comment",
                            "body": "that's the go to tactic for silencing critics. all that anti hate speech legislation comes from the Israel lobby.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "StealUr_Face",
                                    "body": "What are we going to / able to do about this",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "know_comment",
                                            "body": "for one, you can stop supporting Zionists. a concept that they're trying to criminalize.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "StealUr_Face",
                                                    "body": "I think we need to uncover the insane influence that Israel has in our own govt and remove the stigma in calling this out. Once that happens I think calling out and ending Zionist atrocities will follow\n\nAnd I see the former happening more and more every day",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "know_comment",
                                                            "body": "shut down anyone who screams antisemitism when you call out trends and behaviors of zionists",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "StealUr_Face",
                                                                    "body": "Is acknowledging the influence they have over media, politics, business antisemitism?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "know_comment",
                                                                            "body": "yes, any criticism of zionists is antisemitism. haven't you ever heard of the Holocaust or do you think that's fake too?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kismadel",
                    "body": "In 50 years, we'll look back at the dawn of social media as the Wild West.\n\nI'm not advocating against anonymity but a system to at least verify that the account is a real citizen seems absolutely necessary.\n\nA foreign country spending $100M on military is nothing. Spending $100M on bot/trolls could destabilize the entire country, install a president, or win them a war.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "BenderRodriguez14",
                    "body": "Starting to? They've been very much for these things consistently for my entire life (born 1986) and has only ramped up over time. Some gobshites just bought into their rice paper thin lies about that not being the case, despite all the evidence to the contrary. ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "PromiscuousMNcpl",
                    "body": "They want all of Reddit to be their safe space like C, Facebook, Truth, etc etc. Anything but total and complete groveling acceptance will be considered “non partisan and well balanced”. \n\nJust like with most other abusive families trying to keep abusive daddy happy and knowing it’ll never really work.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "thekekboi",
                    "body": "![gif](giphy|Rhhr8D5mKSX7O)",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "plainoldusernamehere",
                    "body": "Both sides have advocated for all of those things moron.\n\nAlso, right libertarians have always been anti war and against any loss of civil liberties.  They voted for trump as there were no other options.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "truespaghet",
                            "body": "No other options because they were too afraid of a black woman leading them.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "maztron",
                                    "body": "Give me a black woman who is a viable candidate, can explain her stances on issues without kackling and wasnt shorhorned in the last minute during the election cycle.  I'm pretty sure there are TON more black woman that could at the very least meet the criteria I had just specified.  It was an insult what they did not only to Kamala but to the black populous as a whole.  You had four years to come up with a candidate,  you knew Biden wasnt going to do another term and yet they doubled down in such a pompous manner bringing her to the forefront at last minute..... that's really your response? \n\nStop with your phony bullshit because that's all it is.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "plainoldusernamehere",
                                    "body": "The democrats have openly said they hate white men. Why in the actual fuck would I ever vote for a democrat?  Even if I wasn’t white, why the fuck should I support transparent racism?  It doesn’t just stop with white men, they openly hate all men. I’ll consider a Democrat when their policies aren’t racist, sexist, and utterly insane.  \n\nKamala Harris was absolutely not a viable candidate.  She was laughably bad in the primaries and then just rammed in without anyone actually voting for her candidacy.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "Appropriate_Pop_5849",
                                            "body": "“The democrats”? Or just random nobodies on the internet or a school campus?",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "PromiscuousMNcpl",
                                            "body": "Please quote a democrat saying something like “we hate all white men”. That’s what someone on Twitter told you that AOC said oe some other bullshit.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "truespaghet",
                                            "body": "“The brown immigrants are coming to your neighborhoods and eating your cats and dogs”",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "maztron",
                                                    "body": "Thats not what was said.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "PromiscuousMNcpl",
                                                            "body": "They said Haitian and listed a specific town.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "WeedNWaterfalls",
                                            "body": "Weird. White man here and never once has a Democrat told me they hate me. And I'm a scary leftist! It's almost like you're full of shit 🤔",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "plainoldusernamehere",
                                                    "body": "Maybe you should be more aware of what your ideology pushes then.",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "WeedNWaterfalls",
                                                            "body": "My ideology is you lying? Lol that makes sense",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "plainoldusernamehere",
                                                                    "body": "Leftist policies don’t push DEI nonsense?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PromiscuousMNcpl",
                                                                            "body": "DEI nonsense like recognizing the Navajo Wind Talkers?",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "WeedNWaterfalls",
                                                                            "body": "Define DEI. I'm dying for your insight",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "plainoldusernamehere",
                                                                                    "body": "Giving preferential treatment to people based on skin color, gender, sexual orientation, etc. Exactly what DEI is said to be.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "WeedNWaterfalls",
                                                                                            "body": "Oh, then no, because that's not what DEI is or does. You just eat propaganda with no critical thought or investigation of your own. Saying you can't fire someone strictly because you find out they are gay isn't DEI \"nonsense.\" Saying you can't intentionally omit someone from a candidate pool simply because their name looks foreign is not DEI \"nonsense.\" Saying you can't intentionally omit job postings from minority communities is not DEI \"nonsense.\" There is no law amyway that says you are required to hire someone because they are black, or have to ignore someone for being straight. Learn what you're actually upset about, please.\n\nEdit: aaaaand insta-blocked. Another tough free speech warrior! I'll just assume your reply was admitting you were wrong and you have no clue what you're even mad about since you can't stand by it.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "plainoldusernamehere",
                                                                                                    "body": "Weird….\n\nhttps://www.resumebuilder.com/1-in-6-hiring-managers-have-been-told-to-stop-hiring-white-men/",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Selfket",
                            "body": "But have you considered both sides brah..?",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Due-Pineapple-2",
                            "body": "Sorry which is the other side? Pretty sure the genocide they’re taking about was advocated by the dems too.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "plainoldusernamehere",
                                    "body": "Both sides are war mongers.  The Dems are seething any idea of peace in Ukraine and the Republicans will support any war that Netanyahu wants.  Dems are mostly on board with Israel as well since both sides are little bitches of AIPAC.  \n\nI was assuming I was talking to a dem who somehow doesn’t see their hypocrisy of being for the Ukraine war because Rachel Maddow and Don Lemon said Putin man bad.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "EthicalHeroinDealer",
                                            "body": "One country was invaded, and the other just wants to use the U.S. to do the heavy lifting for their genocide. You don’t see the difference? The Trump administration wanted Ukraine to accept an agreement on Putin and Trump’s terms, and Ukraine wasn’t even involved in the negotiations. The deal they outlined was terrible for Ukraine. How are those two even remotely similar in your book?\n\nIf they had involved Ukraine in the negotiations and drafted an agreement that didn’t just benefit the U.S. and Russia, then of course everyone would want Ukraine to sign it. I don’t know if you’re just this uninformed or purposely spreading disinformation here.\n\nIf Russia invaded the U.S. and Ukraine came to us with an agreement they negotiated with Putin without our representatives even present and it involved the Russians keeping the entire West Coast while Ukraine taxed our future resources, would you accept that?",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "waylonwalk3r",
                                            "body": "I want to be polite with you but you're not nearly as smart as you think you are. To say the dems position on ukraine is warmongering. Good lord.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "plainoldusernamehere",
                                                    "body": "They surely aren’t calling for peace, now are they?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "PromiscuousMNcpl",
                                                            "body": "“Please stop invading us and killing our people, we give up and just become Russia again because it’s better to be oppressed by a colonial power than be at war. The AMERICANS said so. \n\nFuck outta here with this cowardly, deceitful, and anti-American pre-capitulation cuckery.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "know_comment",
                            "body": "you misunderstood me, but I got censored on a libertarian sub the other day for pointing out that a poster advocating for the rendition of anti genocide protesters seemed to be idf",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DrAndeeznutz",
                    "body": "Here he is! The jew hater.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SA1NT_F3AR",
            "body": "Broken clock alert.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Formal_Dare_9337",
            "body": "This guy is spot on",
            "score": 3,
            "replies": []
        },
        {
            "author": "Starquest65",
            "body": "And our allies will tell us to eat dicks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HistoryOnRepeatNow",
            "body": "War with Iran is scarier than war with Russia",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zestyclose_Card6014",
            "body": "He has to be impeached. The only supporters of this are crazed people who hate other Americans.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RandomUser3438",
            "body": "So when Trump starts a new war, are all the Anti-War Conservatives going to actually name and shame Trump? When Biden was in control, it was always \"Biden\", \"The Dems\", \"The Left\" love war, they specifically name them. But when a Conservative is in Power, they've either just do a 180 and love War again or they criticise \"The Government\" instead of just saying Trump, like \"The Government\" is this vague idea, rather than a group they voted for.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Cramson_Sconefield",
            "body": "Who is pumped to go die for Israel?! If we don't go to war with Iran, then poor Israel may never get to complete its genocide.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Deezrntz_87_87",
            "body": "Def feels like the Zionist regime at work here. Crazy to think ol'donny is pulled back and forth by his masters bb-putin .",
            "score": 3,
            "replies": []
        },
        {
            "author": "Qanonjailbait",
            "body": "Why do we want to strike Iran? Oh yeah for Israel, the genocidal foreign master of America.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ConfusedKanye",
            "body": "Anti war right?\n\nCant wait for more Americans to be senselessly fucking killed over bullshit that has NOTHING to do with us. Thank you for being a blood thirsty pro total war president trump.",
            "score": 3,
            "replies": []
        },
        {
            "author": "hoosier06",
            "body": "If there is a place in iran that needs a bomb dropped, I’m sure Israel already has an CONOP for it. No need to drag the US into more dumb shit.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Shoehornblower",
            "body": "Wonder if Epstien gave those Trump videos to Mossad and now Trump is doing Israels bidding?  Just a thought…",
            "score": 7,
            "replies": [
                {
                    "author": "Due-Pineapple-2",
                    "body": "Trump gave the Epstein files to Epsteins favourite lawyer Dershowitz himself and no one has said a peep",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shadowthron8",
            "body": "Little late to realize Trump is a fuckin douche Tuck",
            "score": 4,
            "replies": []
        },
        {
            "author": "firedbytheboss",
            "body": "I don't know what kind of war we are talking about, but boots on the ground in Iran would probably be the worst foreign policy decision in US history. Iraq was a catastrophe for us, Iran is a whole different level,  much larger, bigger population, more powerful. It would end Trump's presidency if it git that far. \n\nLimited bombing would be far less catastrophic.",
            "score": 2,
            "replies": []
        },
        {
            "author": "drs10909",
            "body": "He needs to say the man’s name and actually admit publicly what he said about him privately in those texts and emails",
            "score": 2,
            "replies": [
                {
                    "author": "mwa12345",
                    "body": "That won't really help. He is hoping trump gets the message, I suspect.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impressive_Meat_3867",
            "body": "The worst person you know made a good point lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "JuniperKenogami",
            "body": "Well,the man has a point.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Current-League426",
            "body": "I will give him some credit he’s been pretty consistent on his stance against war since being ousted at Fox.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lively420",
            "body": "I called this over a year ago",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ubiquitous1984",
            "body": "It’s odd how America is now best buddies with Russia, who are Iran’s main ally.  \n\nOr maybe it’s not odd: perhaps the American betrayal of Ukraine is to get a concession from Russia that they won’t stand in America’s way if they go ham on Iran?",
            "score": 2,
            "replies": []
        },
        {
            "author": "danielid",
            "body": "Tucker is constantly spewing russian propaganda and this makes me distrust the hell outta him. \n\nHowever, it seems to be pretty logical that an attack on a nuclear site will be retaliated against...",
            "score": 2,
            "replies": []
        },
        {
            "author": "ReturnOfCNUT",
            "body": "I can't stand Tucker Carlson, but he's not wrong here.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SpecialStructure597",
            "body": "Why would anyone want this war ? It’s going to put us all back 200 years. It’s insane",
            "score": 2,
            "replies": []
        },
        {
            "author": "flashgreer",
            "body": "Tucker has pretty much always been anti-war.",
            "score": 4,
            "replies": []
        },
        {
            "author": "brandan223",
            "body": " Broken clock",
            "score": 4,
            "replies": []
        },
        {
            "author": "Hikingcanuck92",
            "body": "Wait, as a Canadian, would this somehow force me into a Finnish style Alliance with Iran? This timeline is wild. \n\nTrump is running foreign policy like he’s hosting Whose Line is It Anyway. Where the alliances are made up and threats of invasion don’t matter.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tydyjav",
            "body": "The houthis are attacking almost every ship that goes by. Iran supports them, sends them arms and will keep doing it until there isn’t a Houthi left standing. This is a tough one.",
            "score": 1,
            "replies": [
                {
                    "author": "Due-Pineapple-2",
                    "body": "So supplying arms makes you complicit. Which is the houthis logic too",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Tydyjav",
                            "body": "And unprovoked attacks targeting civilians like October 7 makes you the bad guy.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Due-Pineapple-2",
                                    "body": "Do all Americans think the world is a movie where it’s good guys vs bad guys? Hamas are the bad guys but shit has been happening there since the 40s",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Valmoer",
                                            "body": "There was **one** moment where a secular left Israeli government and a left Palestinian government met to craft a path to coexistence...\n\n... then the secular Isreali was assassinated by an ultranationalist *specifically for the crime of singing those peace accords*, the leftist Palestinian was overthrown by religious fanatics, and the religious right of both sides have run the show ever since.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Due-Pineapple-2",
                                                    "body": "A one state solution could solve this as it will clear away the extremists in elections. While democracy is still in vogue that is",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "andy1307",
            "body": "He’s not wrong but you have to remember he has no strongly held beliefs. He was a big supporter of the Iraq war. He’s friends with Hunter Biden. Asked Hunter Biden to write a letter of recommendation for his son Buckley",
            "score": 1,
            "replies": []
        },
        {
            "author": "Makuson04",
            "body": "Wtf has this turned into here",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stkittsdad",
            "body": ">don't let the propagandists lie to you.\n\n![gif](giphy|J4HP3FcGqP6Yo)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Best-Hotel-1984",
            "body": "I generally side with Tuckers' opinions. It's interesting to see this sub now siding with him all of a sudden.\n\n![gif](giphy|Aausss8uUBIe3bZ3d2)",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandoDude124",
            "body": "Well it’s a relief Trump listens to him and y’know…\n\nNot Netanyahu, right?\n\n#RIGHT???",
            "score": 1,
            "replies": []
        },
        {
            "author": "disposable_hat",
            "body": "Most coherent Tucker statment...not even joking!",
            "score": 1,
            "replies": []
        },
        {
            "author": "yamers",
            "body": "as long as russia wages war then its ok",
            "score": 1,
            "replies": []
        },
        {
            "author": "SA1NT_F3AR",
            "body": "Broken clock alert.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlackTransAm02",
            "body": "![gif](giphy|lT4Ix992z2zfO|downsized)\n\nUnless...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Individual_Mess_7491",
            "body": "as John McCain would sing \"Bomb, Bomb, Bomb, Bomb Bomb Iran\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "traviij",
            "body": "Wow. Tucker.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrTurtleHurdle",
            "body": "I'm all for least amount of violence possible but tucker Carlson saying ' don't let the propagandists lie to you ' is the biggest POT calling the kettle black moment EVER",
            "score": 1,
            "replies": []
        },
        {
            "author": "bababadohdoh",
            "body": "Smart strategy. \n\nAlienate the rest of the world, then engage in a war where support would likely be needed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "corksoaker84",
            "body": "Well if it does happen just remember that America doesn't need any help whatsoever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dsm1995gst",
            "body": "So I read the post, but is Trump planning on bombing Iran?  What is this in reference to?",
            "score": 1,
            "replies": []
        },
        {
            "author": "stackered",
            "body": "Tucker may be right here, but as the ultimate propagandist it's next level ironic for him to say such a thing as if he wasn't the face piece of Faux news",
            "score": 1,
            "replies": []
        },
        {
            "author": "force4good390",
            "body": "Says the guy who thinks Putin is a stand up fella",
            "score": 1,
            "replies": []
        },
        {
            "author": "cyberphunk2077",
            "body": "ok so y did u support trump",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thermometer91",
            "body": "This is the Joe Rogan subreddit?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zestyclose_Code_8818",
            "body": "Trump can do no wrong amirite guys?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Latenighredditor",
            "body": "MAGA talked about how Trump didn't start any wars. \n\nIt's only been 2 months in since his return and hes talking about taking over Canada and Greenland and triggering new wars in the middle east",
            "score": 1,
            "replies": []
        },
        {
            "author": "blueprint_01",
            "body": "They’ll get to Tucker eventually. Not sure how but they will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Evilton",
            "body": "I thought Jon Stewart had already put Tucker Carlson in his place, a long time ago...",
            "score": 1,
            "replies": []
        },
        {
            "author": "AR_Harlock",
            "body": "Who would have guessed one of them really woke up",
            "score": 1,
            "replies": []
        },
        {
            "author": "NugKnights",
            "body": "He is not even pretending to be Republican any more. He's just Russian.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oblique9043",
            "body": "Trump had 10 different tweets about how convinced he was that Obama was going to start a war with Iran. So that pretty much guarantees that that's exactly what he's going to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "adenasyn",
            "body": "Tucker is making sense?  Either he lost his mind or I did….",
            "score": 1,
            "replies": [
                {
                    "author": "Fine_Land_1974",
                    "body": "Mushrooms",
                    "score": 0,
                    "replies": [
                        {
                            "author": "adenasyn",
                            "body": "Texas Catholics.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shadowthron8",
            "body": "Glad he waited until after helping Trump get elected to look at him with a critical eye.",
            "score": 1,
            "replies": []
        },
        {
            "author": "guydogg",
            "body": "Not an ideal time to start a war with another nuclear superpower seeing he's alienating every ally the USA had/has.",
            "score": 1,
            "replies": [
                {
                    "author": "ABirdJustShatOnMyEye",
                    "body": "Lmfao if you think Iran could do anything against the strongest military in the world",
                    "score": -2,
                    "replies": [
                        {
                            "author": "guydogg",
                            "body": "Put the pipe down, bud.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ABirdJustShatOnMyEye",
                                    "body": "You’re in Canada, you should be well aware of this, seeing as your country relies on the U.S. for all of their defense.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "_Administrator_",
            "body": "OP trying hard to blame the puppeteer Jeeewz",
            "score": 0,
            "replies": [
                {
                    "author": "Due-Pineapple-2",
                    "body": "Is he? Oh right because Netanyahu is Jewish and therefore has no influence on US foreign policy because that would be an antisemitism’s. Great logic.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jey3349",
            "body": "Tucker is not going against his lord’s wishes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nortontwo",
            "body": "I’m not convinced. It would likely result in Iranian retaliatory strikes, but whether or not they are strikes in earnest is up to debate. Iran knows the US would retaliate against retaliation, they remember Op Praying Mantis well. Plus to accomplish successful strikes on enough bases to achieve a kill count that high would require a such massive saturation barrage that they could only really send once, after which… they’d be in a pickle",
            "score": 1,
            "replies": []
        },
        {
            "author": "Late_Stage-Redditism",
            "body": "Iran is Russia's regional vassal and the fact that Tucker would turn on Trump shows how well he is controlled my Moscow.\n\nNot that I'm advocating a war in Iran but you could've chosen any other issue and Tucker would toe the Moscow line against any american leader any day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "buttbiter88",
            "body": "This is again Russian propaganda. Iran is Russias ally and Russia is telling Tucker to misinform the population. Trump should bomb Iran, it would be the only good thing he dose so far. If Iran develops a nuke it’s only a matter of time until a terrorist get ahold of a briefcase sized nuke.",
            "score": 0,
            "replies": [
                {
                    "author": "mwa12345",
                    "body": "Trump should bomb Iran to please daddy netanyahu?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "NormalWorker2776",
                    "body": "It’s wild to see libs be so hawkish for war.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "commanderfish",
            "body": "Tucker is taking the Russian stance as usual",
            "score": 0,
            "replies": [
                {
                    "author": "mwa12345",
                    "body": "Right. We are supposed to take the Benji/ neo con view always!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sad_Food9258",
            "body": "Thanks Vladi Carlson.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Pzd1234",
            "body": "Even if everything he said is true, allowing Iran to get nukes would be 10 times worse. \n\nMaybe if Trump didn't fuck up the previous agreement no one would have to worry about this.",
            "score": 0,
            "replies": []
        },
        {
            "author": "StickAForkInMee",
            "body": "Tuck the cuck Carlson",
            "score": -4,
            "replies": [
                {
                    "author": "dieno_101",
                    "body": " ad hominem",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Afc1014",
                            "body": "Add homo Eminem",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Correct_Path5888",
            "body": "Tucker Carlson is a fucking idiot",
            "score": -1,
            "replies": []
        },
        {
            "author": "hotlineforhelp",
            "body": "Tucker is so wrong here lmao",
            "score": -1,
            "replies": []
        },
        {
            "author": "carrtmannn",
            "body": "If he bombs Iran, tucker will fall in line immediately.",
            "score": -7,
            "replies": [
                {
                    "author": "dieno_101",
                    "body": "Presumptive thinking",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "TooMuchButtHair",
            "body": "He's not wrong, but Americans are already under attack. A strong and truly decisive strike may reduce the number of long term casualties.\n\nMaybe not though.",
            "score": 0,
            "replies": []
        },
        {
            "author": "mvpevy",
            "body": "Well we just sunk their most advanced ship lol",
            "score": 0,
            "replies": []
        },
        {
            "author": "poonman1234",
            "body": "Tucker is s Russian puppet.\n\nNo one should care what he says",
            "score": 0,
            "replies": []
        },
        {
            "author": "curly_spork",
            "body": "Well, this will break the brain of liberals. ",
            "score": -9,
            "replies": [
                {
                    "author": "cannot_walk_barefoot",
                    "body": "Liberals agree, just not for the reasons Tucker believes this (bad for Russia)",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "SwitchCube64",
                    "body": "why?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "curly_spork",
                            "body": "Agreeing with Tucker, who I'm told is a Nazi. ",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "SwitchCube64",
                                    "body": "oh, you're just shitbag moron. My bad\n\nYes, Tucker is a fascist neo-nazi and going to war with Iran is a terrible idea.  \n\nYou sure your brain is alright?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "curly_spork",
                                            "body": "Do you agree this fascist neo-nazi tweet? ",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "SwitchCube64",
                                                    "body": "I do",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "curly_spork",
                                                            "body": "Wow... You agree with fascist neo-nazi... Wow.... ",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SwitchCube64",
                                                                    "body": "On not going to war with Iran? Absolutely. Is that breaking your brain or something?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "curly_spork",
                                                                            "body": "Yeah, you openly agreeing with fascist neo-nazi s is breaking my brain. ",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SwitchCube64",
                                                                                    "body": "damn, guess you are just a moron. [Ich gebe dir mein Herz](https://media1.tenor.com/m/cMOyNR_tnB8AAAAC/elonmusk-elon-musk.gif)",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "curly_spork",
                                                                                            "body": "If not agreeing with fascist neo-nazi makes me a moron in your eyes, I accept. ",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "SwitchCube64",
                                                                                                    "body": "You want war with Iran?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "curly_spork",
                                                                                                            "body": "We are already killing their proxies, what do you think that is? ",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "SwitchCube64",
                                                                                                                    "body": "Don't dodge. You want war with Iran?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "curly_spork",
                                                                                                                            "body": "It's not a dodge. We are actively killing Iranian proxies. Bombing the shit out of them. What do you call that? ",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "SwitchCube64",
                                                                                                                                    "body": "It's called a proxy war. Do you want war with Iran? Or do you want to keep proxy answering?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "curly_spork",
                                                                                                                                            "body": "Sounds like war already, but with more steps. ",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "SwitchCube64",
                                                                                                                                                    "body": "Never thought of it that way, you're right. What's the difference then. You heard it Mr Trump, curly_spork says let it rip! All targets locked on Iran and launch\n\no7",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PompeiiDomum",
            "body": "At this point Tucker is either a legitimate fearful bitch in all circumstances, or just obviously compromised.",
            "score": -1,
            "replies": [
                {
                    "author": "truespaghet",
                    "body": "It can be both",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ThatOldDustyTrail",
                    "body": "You should go check out the Fox News deposition and read how Tucker really feels and talks about Trump and other select republicans behind closed doors. Dude is sleazy as hell and fake as they come, but he’s no dummy.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PompeiiDomum",
                            "body": "I have, I don't think he's dumb. I just don't know if he's a bitch or actually bought and paid for. There is a fine line, but he's on one side or the other firmly.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GestureArtist",
            "body": "Who cares. Fuck Tucker. The Americans voted for this and the republicans need to learn what it costs.",
            "score": -1,
            "replies": []
        },
        {
            "author": "yazzooClay",
            "body": "While I greatly admire Tucker, let's just be Frank about things. We can not let there be Iranian nuclear power. It could erupt the whole region into war. They already have blocked the suez Canal. Tbh, they are already attacking us.",
            "score": -5,
            "replies": [
                {
                    "author": "chickennuggetscooon",
                    "body": "We? We we we we we we we\n\n\n\nNo we. There is Israel, and there is the United States. Two separate entities. Let them fight their stupid fucking war, and let the U.S stay out of it. Tel Aviv getting nuked doesn't affect the U.S in any way, shape, or form.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "yazzooClay",
                            "body": "They are part of the judeo Christian empire.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Maintenance5920",
            "body": "Good job Tucker.  You got the lefties to back you for a minute.  Now smack them with the other side of the hand after our next move.  The impact is deepened when they have their noses so close in your rear",
            "score": -2,
            "replies": []
        },
        {
            "author": "yiang29",
            "body": "Terrible take. A nuclear Iran is a threat to the whole region and would put even more American lives at risk. All they need to do is arm one of their many proxies(HAMAS, Hezbollah, Houthi, etc) and deny blame like they already do. They don’t have the ability to wage war with us, a regime change is more likely to happen. Anyone hoping for a theocracy like Iran to have nukes is insane.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Beneficial-Piano-428",
            "body": "Oh shit we agreeing with Tucker now on here?! Y’all trolls can’t decide and  just go with which ever way the way the wind blows up your own ass. But he’s not wrong. Glad you can see that.",
            "score": -3,
            "replies": []
        }
    ]
}