{
    "title": "I mean, who could it even be? It's so hard to know.",
    "author": "Not_a_housing_issue",
    "subreddit": "JoeRogan",
    "rank": 6,
    "score": 416,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 33,
    "url": "https://i.redd.it/8wbt9gkpwgpe1.png",
    "id": "1je7ty8",
    "selftext": "",
    "comments": [
        {
            "author": "DannkDanny",
            "body": "For the newer Joe Rogan listers, the guy on the bottom is Tim Robinson. He's what's called a comedian.",
            "score": 77,
            "replies": [
                {
                    "author": "MartinTheMorjin",
                    "body": "He tells jokes. Yes there’s more than one.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "AdCrafty9098",
                            "body": "Jokes, are those the things you nod your head on agreement to become we all hate liberals?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "MartinTheMorjin",
                                    "body": "Wut?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "AdCrafty9098",
                                            "body": "It was a joke. Do you need the joke explained to you?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ElementalRhythm",
                                                    "body": "Slow it down, Einstein,  where's his barstool? 🤣",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Nuttygoodness",
                    "body": "Wow! \n\nIsn’t there only like 200 of those in the whole world?",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Lazy-Damage-8972",
                    "body": "Tim Robinson is amazing. Love his style of humor.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Goodnight_April",
                    "body": "Does he take his shirt off? Because if he doesn't take his shirt off, I don't think you can say he is a comedian. Or maybe if he bends over a stool and humps it aggressively, that probably means he is a comedian. But he has to do at least one of those things or he is just some guy.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lazy-Damage-8972",
            "body": "So anyway; the liberals are so unhinged and out of touch. They actually believe billionaires are not operating in our best interest. That’s wild they believe this. You guys know why my mom’s social security checks stopped? Probably Odumbo deep state if I had to guess.",
            "score": 23,
            "replies": [
                {
                    "author": "ElementalRhythm",
                    "body": "Your fraud of a mom is wasteful and abusive, didn't you know?  /s",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Lazy-Damage-8972",
                            "body": "That is a strategic /s 😂",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MostlySlime",
            "body": "Obviously the worlds richest man who's been granted billions in subsidies / loans / incentives / tax breaks / contracts from the deep state government for a decade plus has nothing to do with the deep state",
            "score": 57,
            "replies": [
                {
                    "author": "Not_a_housing_issue",
                    "body": "Yup. That dork just wants to set a high score for having money. He doesn't care at all about the rest of us.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Frosty-Beans",
                            "body": "He already set the high score dork.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Not_a_housing_issue",
                                    "body": "But who will be the first trillionaire?\n\n\nHe probably thought he had that on lock when Trump got elected.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Frosty-Beans",
                                            "body": ">But who will be the first trillionaire?\n\nAlex Jones",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Not_a_housing_issue",
                                                    "body": "Or was it a Zimbabwe citizen in 2009. They printed a $100 Billion dollar bill, and I bet somebody had at least 10 of em",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MidWestMind",
                    "body": "You’re saying this like no one else has benefited from his decisions and actions.",
                    "score": -22,
                    "replies": [
                        {
                            "author": "Definitelymostlikely",
                            "body": "How many of the others used those subsidies/loans/incentives/tax breaks to become the richest man in the world and pay for complete control of an administration in government?",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "MidWestMind",
                                    "body": "You're saying this like Lobbyists never existed.",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "author": "Lazy-Damage-8972",
                                            "body": "The lobbyist pipeline in the trump administration is a solid round dot. That has never exist until this administration. You act like “Billionaires for a Better America” are telling the truth.",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "Definitelymostlikely",
                                            "body": "So lemme ask again. \n\n>How many of the others used those subsidies/loans/incentives/tax breaks to become the richest man in the world and pay for complete control of an administration in government?",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "MidWestMind",
                                                    "body": "Many.   Why do you think CEO's of companies get put into control of a sector or committee that many that left head of a sector to be CEO of a company it helped while in office.",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "hfdjasbdsawidjds",
                                                            "body": "What the fuck is a sector when it comes to USFG?",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThorFinn_56",
            "body": "What blows my mind is this department of efficiency has cut billions in spending and they've still some how added 4% to the national debt in only 30 days. Wtf",
            "score": 25,
            "replies": [
                {
                    "author": "Lazy-Damage-8972",
                    "body": "4.5 Trillion in tax cuts to the already mega wealthy.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Silveruleaf",
            "body": "I think it's ironic how the guy that abuses third world countries is pretending to fight the guys that abuse third world countries. Reminds me how there's companies protecting the environment that are own by Monsanto, the company most known to fuck up the environment",
            "score": 1,
            "replies": []
        },
        {
            "author": "Abel_Table",
            "body": "I mean the Deep state is a thing",
            "score": -2,
            "replies": [
                {
                    "author": "NastyMothaFucka",
                    "body": "Yup, and he’s part of it",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ElementalRhythm",
                    "body": "Sure it is, now go back to sleep.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Heathen_Inc",
            "body": "Need to change this sub name to the Anti-Trumpalon Confederation, lately. \nIts seriously nothing but mindless political dribble, at least half of which have nothing to do with Rogan or the pod, besides the fact hes had these people on in the past and that clearly causes PTSD in many.\n\nAmericans see the opposing political side as idiotic, reactionary, lesser-beings. What they dont realise, is their constant shit flinging at each other, is causing the rest of the world to see the entirety of the US that way. \nThe entire country appears to have the emotional maturity of a 3 year old.",
            "score": -4,
            "replies": [
                {
                    "author": "gibgabberr",
                    "body": "You can't even vote in our election, no one cares mate ",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}