{
    "title": "Moronic Monday - March 17, 2025",
    "author": "AutoModerator",
    "subreddit": "sysadmin",
    "rank": 0,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/sysadmin/comments/1jd91u5/moronic_monday_march_17_2025/",
    "id": "1jd91u5",
    "selftext": "Howdy, /r/sysadmin!\n\nIt's that time of the week, Moronic Monday!  This is a safe (mostly) judgement-free environment for all of your questions and stories, no matter how silly you think they are.  Anybody can answer questions!  My name is AutoModerator and I've taken over responsibility for posting these weekly threads so you don't have to worry about anything except your comments!",
    "comments": [
        {
            "author": "maskedhypocriter",
            "body": "Just starting out as an assistant sys admin what should I really focus on to progress in this career? I’m just basically monitoring a bunch of VM’s on Zabbix (for clients). if there are any issues I just report the alert. My other duties an are just checking daily Veeam back ups, checking dell hardware. I am not responsible for setting up any software or infrastructure. I mainly deal with the simple stuff like reporting and documenting hundreds and hundreds of network devices on our company’s system. I’ve done a tiny amount of VLAN configuration. What should I focus on? I work a lot of night duty so I have it so I have a bunch of time to focus on skills.",
            "score": 2,
            "replies": [
                {
                    "author": "Zenkin",
                    "body": "Networking makes the world go round. Since you're already working in the field, I would not bother with CompTIA, and I would say go straight for the CCNA.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "maskedhypocriter",
                            "body": "Yup, I was thinking of just that. What should the next 5-10 years look like for me? I’m worried that I entered a dying field 😅. What new skills should I keep an eye on? I’m open to doing masters on cybersecurity etc",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Zenkin",
                                    "body": "I think it's kind of backwards for people to start in the security field. You should have a very strong system/network skill set *first*, and then work your way into security if you want to go in that direction, but that shouldn't be a big part of your next five years.\n\nBut I think there's a **lot** of opportunity out there, and I am not particularly concerned about the field dying. Your near term will be dictated more by what you can work on in a professional capacity versus what you're most interested in. If your employer is willing to let you get into the guts of Zabbix, that's a great opportunity to take. What else do they need? Someone to manage their databases? SANs? Hypervisors? Alternatively, which of the seniors that does training with you is the most open? Learn from them, and hopefully take some of their responsibilities off of their plate, and build from there.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "maskedhypocriter",
                                            "body": "Sounds lovely. We’re definitely getting our hands dirty with Zabbix and Hypervisors more than dealing with Databases. I’ll look into that! Thanks a lot!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "shipsass",
            "body": "Is enabling the side-channel speculative execution vulnerabilties worth the performance hit for servers not in the public cloud? As I understand it, a this vuln could allow a compromised server to spy on the memory of its neighbors. This is a real problem for servers in the public cloud, but in my VMware infra, I don't see the fix's value considering how much slower it would make the server run.",
            "score": 1,
            "replies": [
                {
                    "author": "MrYiff",
                    "body": "iirc a lot of the performance hit was solved on the vmware side with changes to their code, I'm not sure but it may also have fixed it enough that applying the Windows changes may not be needed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZoomerAdmin",
            "body": "2 person IT team. How can I convince my boss that the Brother PTE-110 is worth the $60 spend? We already have a brother PT-D210 in the IT department, and that maybe I can pawn that off to another department and get the edge instead. The thing is I don't know how I would say that the buttons for faceplate, cable wrap, and cable flag are worth it.",
            "score": 1,
            "replies": [
                {
                    "author": "OptimalCynic",
                    "body": "Write up a document laying out how much time you're spending with the D210, estimating how much you'd save with the PTE-110 features. Then calculate how long it would take to pay back the $60 at your hourly rate.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ivanthegreat27",
            "body": "Silly question for my panini Chase bank scanner (miDeal model)\n\nI can’t access IP address to configure the scanner.\n\nIt was working a week ago and I updated my computer now it’s not working…\n\nhttps://preview.redd.it/dqwb7f5b9cpe1.png?width=1413&format=png&auto=webp&s=bf8c30fab0181eb00ee0930f4ec005f519ac9d59",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sk1rm1sh",
            "body": "Any idea what I can do to power a HP Procurve 1800-8G (J9029A) without an original power adapter?\n\nThe power rating is pretty standard but the connector is a bit harder to track down.\n\nThe plug has a 5mm negative shell with a centre ~0.75mm positive pin. It's not like any standard DC plug I've seen.\n\n&nbsp;\n\nIs there actually a non-proprietary plug name I could look for?\n\nAre there any cheap physically compatible plugs I could hack the end off?\n\nAny prebuilt adapters?\n\nCould the original jack be removed from the PCB and replaced with a more common one using a hobby-level soldering iron?\n\n&nbsp;\n\n[Power plug from side](https://i.imgur.com/51Yaj9Y.png)\n\n[Power plug from front](https://i.imgur.com/OTzGBnU.png)\n\n[Power jack](https://i.imgur.com/BWdwIH3.png)",
            "score": 1,
            "replies": [
                {
                    "author": "MrYiff",
                    "body": "Have you checked ebay, a quick search shows 3rd party compatible adapters for like $15:\n\nhttps://www.ebay.com/itm/292208577479",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ZAFJB",
                            "body": "Ebay search term: \"HP Procurve 1800-8G (J9029A) power adapter\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MrYiff",
                                    "body": "I think mine was even simpler than that at just the J9029A part number.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ZAFJB",
                                            "body": "But won't find you ads only listing HP Procurve 1800-8G power adapter",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BigWayneX",
            "body": "Not sure if this would go here but I got here by searching. I'm having an issue where OBS will randomly disconnect while I'm streaming and reconnect after a couple of seconds. I'm looking for a network monitoring tool that is (hopefully) simple and can tell me where the point of failure is: I have an ethernet cable going from my router to a Network switch then to my computer and multiple other devices. If not here, can you recommend other places where I might ask and be able to find what I'm looking for.\n\nSo far, I've power cycled my ONT and router, power cycled the switch and am currently running a test where I'm bypassing the switch and plugging direct into my PC.",
            "score": 1,
            "replies": [
                {
                    "author": "chum-guzzling-shark",
                    "body": "Simple is running a continuous ping and see if it drops at same time as your obs.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Frothyleet",
                    "body": "Could try /r/techsupport",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}