{
    "title": "Is IT just an endless grind? Or does it ever get better?",
    "author": "edward_ge",
    "subreddit": "sysadmin",
    "rank": 4,
    "score": 266,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 205,
    "url": "https://www.reddit.com/r/sysadmin/comments/1jdxsfy/is_it_just_an_endless_grind_or_does_it_ever_get/",
    "id": "1jdxsfy",
    "selftext": "Some days, I wonder am I actually building something meaningful, or am I just duct taping a sinking ship while everyone complains the tape isn’t good enough?\n\nI wake up to a flood of emails, half of them marked URGENT (they never are). I log in, and there’s already a fire to put out because, of course, something critical broke overnight. By the time I fix it, there’s another problem. Then another. And another.\n\nIt’s like IT isn’t about solving problems, it’s about keeping things just functional enough for the next disaster. I don’t mind working hard, but I can’t shake the feeling that we’re stuck in a cycle that never actually gets better.\n\nFor those who have been in this loop for years, does it ever change? Or is this just what IT is: an endless treadmill of firefighting, underappreciation, and burnout?",
    "comments": [
        {
            "author": "myutnybrtve",
            "body": "IT is not building a barn. It's pruning a bonsai tree and trying to shape it over time. Also the bonsai tree is trying to set itself on fire while being a dick to you.",
            "score": 1,
            "replies": [
                {
                    "author": "therealRustyZA",
                    "body": "I feel this and sadly concur.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mcgreggers_99",
                    "body": "Legendary quote.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "slopezau",
                    "body": "Never have I felt so seen.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "unclesleepover",
                    "body": "I look at it the same as my first job when I was 14. I’m putting up grocery carts. I’m never done I just keep doing it for paychecks.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NeverLookBothWays",
                    "body": "It's also like working on a passenger jet... sometimes while it's in a hangar...too often while it is in flight.\n\nBut it really depends on the culture of the company/department too, not all IT jobs are stressful all the time like this. Some allow room for investing into better tools, technologies, training, etc",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "smpreston162",
                    "body": "been doing this crap for 18 years and this is hand down the best description",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "triwyn",
                    "body": "Either a shirt or a tattoo will become of this.  I’m undecided.  Perhaps both.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Robeleader",
                            "body": "Center image of a Bonsai, maybe some light cyberpunk elements (LEDs, wires, etc.).\n\nText above arcing over the tree, \"IT is like a bonsai tree and trying to shape it over time.\"\n\nText below the tree, maybe a smaller font, \"Also the bonsai tree is trying to set itself on fire while being a dick to you\" with maybe a lit match or with the ends of the text being burnt/on fire",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "uptimefordays",
                    "body": "Our job is running systems—for the most part that means taking over and improving what we inherit from teams before us.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "notHooptieJ",
                    "body": "No. \n\nThats like we're building something beautiful worthy of reverence and respect. \n\nWe're diggin holes, and fillin em back up, just to dig em again tomorrow. Accept the reality and detach from it. \n\nIT is work, the thing you do for money 8 hours a day.\n\ndo yourself a favor spend the other 2/3rds of your life NOT thinking about IT.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JJaX2",
                    "body": "While cobra Kai is trying to beat you up.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dracotrapnet",
                    "body": "Usually bonsai trees don't have teeth and don't need toilet training.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Wonder_Weenis",
                    "body": "you are my spirit animal",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "looncraz",
                    "body": "And don't forget the hidden gnomes in the Bonsai tree trying to steal your shtuff, and the djinn trying to move the leaves all over the place until you give them a bucket of gold and a piece of your soul to put them back in place.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "valmartinico",
                    "body": "I like the analogy, but sadly, my IT-bonsai will never get the chance to look nice and inspire harmony to anyone",
                    "score": 1,
                    "replies": [
                        {
                            "author": "myutnybrtve",
                            "body": "That's ok. Most IT-Bonsai are ugly skraggly looking things, just barely clinging to life. But they are atill alive. And thats sonething.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "blofly",
                    "body": "Oh I am Soooo saving this for future use. Absolutely brilliant.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "oyarasaX",
                    "body": "so, playing Elden Ring.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "myutnybrtve",
                            "body": "I have found Elden Ring to be way kess rewarding.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "steveatari",
                    "body": "And everyone else is either admiring the person who bought the bonsai, hired you, or desperately pulling at it while you're gone to make it better.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "scytob",
                    "body": "That’s brilliant :-)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Think_Vehicle913",
                    "body": "Also, sometimes you just gotta shoot the printer",
                    "score": 1,
                    "replies": [
                        {
                            "author": "space_nerd_82",
                            "body": "If you haven’t contemplated shooting the printer, are you even in IT?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KJatWork",
                    "body": "Well, there we have it, the new IT shirt.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "myutnybrtve",
                            "body": "I would like to have any proceeds donated to myself.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EsotericEmperor",
                    "body": "Hands down the funniest comment I've seen on reddit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheSh4ne",
                    "body": "A poetic and apt description, sir/madam. Would that I had more than 1 upvote to give you.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "myutnybrtve",
                            "body": "Just mail me a bonsai tree and we'll call it even.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MrHundredand11",
                    "body": "O.u.c.h.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "unix_heretic",
                    "body": "You. I like you. Well-played.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MalletNGrease",
                    "body": "IT is maintaining a running train that's on fire. The light at the end of the tunnel is also a train on fire.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Kuipyr",
                    "body": "Add the axe wielding mob trying to cut it down when you're not looking.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "L3TH3RGY",
                    "body": "Exactly 💯",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Humorous-Prince",
                    "body": "![gif](giphy|11OOAQSnUaZT2M)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nicknacksc",
            "body": "Depends where you work and if they give you money to fix things",
            "score": 1,
            "replies": [
                {
                    "author": "irrision",
                    "body": "This, my current job started like this 15 years ago and it gradually got better as IT grew and matured to the point that there were enough people to handle the daily load AND make progress improving things.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "reserved_seating",
                            "body": "This was me.  Then they outsourced us overseas.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DarthtacoX",
                    "body": "This is such a huge thing. If the company you work for doesn't support you then IT is horrible. Really any position probably isn't great at those companies. But if the company supports you and has your back and allows you to make proper procedures and provides you the funding to get things repaired properly then things can be awesome.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Carter-SysAdmin",
                    "body": "Agree - I worked somewhere once where suddenly IT was actually given a budget to fix things - and we DID and then we won the next quarterly department/team award for the entire global company.    \n\nFelt great actually being acknowledged and it powered us going into 2020 where we were able to successfully roll out timely and airtight WFH policies to help everyone manage that year better.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sssRealm",
            "body": "It's a mirage. Once you achieve the destination you saw before, the goal is now further ahead.",
            "score": 1,
            "replies": [
                {
                    "author": "Phlynn42",
                    "body": "That or you just made the scope of your problems bigger and more critical",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jamblia",
                    "body": "So true.  Ive been in that loop, ive been able to dig companies out of that loop - with a good team and the boards backing with cash!  But how did that end?  With me on fire instead.  Im 20 years in and on my second time at an MSP! Its one client focused so more like internal IT thankfully.  I do what I have to now and no more.  I earn more than I did as an Inf manager and have a lot less stress now Ive learned to chill. Im going for a nap now as I have been in since 6 am sorting patching that the Night Shift didnt do :D All the best :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DaNoahLP",
            "body": "Accept your fate and chill your base\n\nhttps://preview.redd.it/nyjcn5ybydpe1.jpeg?width=630&format=pjpg&auto=webp&s=703c3727ef9a9d096665d78a91e9ddd1783e27e1",
            "score": 1,
            "replies": [
                {
                    "author": "Baedran04",
                    "body": "I found this on a coffee mug somewhere",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarthJarJar242",
            "body": "What you have just described is not unique to IT. Welcome to the working class struggle. The work is always there it never goes away. \n\nThe key is to not let it get to you.",
            "score": 1,
            "replies": [
                {
                    "author": "Delicious-Wasabi-605",
                    "body": "Most accurate answer.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gregsting",
                    "body": "You are paid to work, you better wish the work doesn’t go away",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vermyx",
            "body": "It depends. The companies that have seen like this have been:\n\n* aggressive growth software development prioritizing software releases over stability i.e. startups because money flow is tight\n* company that believes IT is a cost center instead of the price of doing business. The management mentality tends to be \"everything's broken/everything works why do I pay you\" (bad upper management)\n* bad IT management that isn't pushing back/not understanding what is needed for stability\n* poor change control\n\nI placed then in this order because the topmost is the one you have the least control over going to the one you have most control over. If IT is properly funded and staffed, you would be dealing with fires pretty infrequently and it would be more maintenance more than anything else. This sounds like the first one though being in that situation.",
            "score": 1,
            "replies": [
                {
                    "author": "fennecdore",
                    "body": "I think I would have put bad IT management higher. You can reason with the startup mindset by showing them the benefits of having a stable environment, you can use the same logic to argue with the one seeing IT as a cost . You won't always win but sometimes you will and the more they see you as someone who actually is able to see their side and speak their language the more they will actually listen to you.\n\nBut there's no fix to stupid, a management who say yes to everything can't be reason with. I have tried an always failed.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Yellowterminal",
                    "body": "This is the grown- up answer. Put out your markers and highlight \"change control\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TwinkleTwinkie",
                    "body": "Poor Change Control is a big one, especially at companies that are growing.  One day you're a 300+ Org with a skeleton IT crew and next thing you know it's 1000+ with a few more cooks in the kitchen, then it's 2000.  If you don't have good change management in place it can be a major shit show.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnooMachines9133",
            "body": "Is work and life an endless grind? \n\nI'd say there are moments of joy. But RFN is not one of them. \n\nThough for IT specifically, I'd suggest finding the few things, systems, or people *you* care about;  make sure they're well taken care of, and have pride in that. For me, that went a long way. And they'll likely be appreciative as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whatzrapz",
            "body": "Lol thats why i contract. Do what im contracted to do then leave. If it breaks they can pay to have it fixed. I used to care until i figured out, they dont care about me. Why should i care about their problem.",
            "score": 1,
            "replies": [
                {
                    "author": "223454",
                    "body": "I've thought about going that route. I get tired of poorly thought out plans (without IT input) not going well, then we're responsible for the mess.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NotYetReadyToRetire",
            "body": "I spent 25+ years as basically the entire IT department at one of my past employers; there I did everything from building the servers and PCs to writing the software to doing Ethernet cabling to installing the 120V and 240V outlets we needed, plus the dreaded \"other duties as assigned\" - I never did figure out why I was in charge of raising and lowering the flag in front of the building or dealing with the vending machine company.\n\nThe good news is that eventually it does end - after 47 years, I retired 13 months ago.  No more users for me!  After retiring, I even outsourced tech support for my wife to my kids (Comp Sci degree for one, Comp Sec/Networking for second, third builds his own PCs), so now all I deal with are my devices - and sometimes I ask for help on those.",
            "score": 1,
            "replies": [
                {
                    "author": "ronin_cse",
                    "body": "Username does not check out",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NotYetReadyToRetire",
                            "body": "No, it doesn't - but I don't want to start over with a new one, so I just go with it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "terraformist0",
                    "body": "You can retire from IT, but can you ever really retire from \"other duties as assigned\"? I bet the wife still has you raising and lowering all of your domestic flags and stocking the home vending machine",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NotYetReadyToRetire",
                            "body": "No, grocery shopping today and loading & starting the dishwasher tonight were today's other duties, despite my (joking) protests that men aren't allowed to compete in women's sports!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "I_Want_Waffles90",
                    "body": "I spent 15+ years as the entire IT department at my past employer, and I also handled payroll and accounting functions. The company had 100+ employees and 3 locations in it's glory days, but the corporate office had maybe about 50 employees. I ended up as the admin because no one else knew anything about computers or networking, so I learned how to do everything else (cabling, building servers, database management, etc.). There was never enough money, which made things even more grueling. I knew I wasn't going to stay at this company forever, so I slowly convinced management to outsource some of the functions - especially when they cut half the staff and closed their other two locations which gave me even less time to focus on IT. I knew I wouldn't be able to leave with a good conscience until they had some actual IT infrastructure, so when they agreed to hire an outside company I knew it was time. I had documented as many work instructions as I possibly could, made sure that the new IT company was settling in, and then I bailed.\n\nI moved out of the state, and I took a job that was NOT in IT (and for significantly less money, woe). Since my resume was mostly IT and accounting, word got around at my new gig that I could \"do IT stuff.\" The only difference now is that it's just random end user stuff (with no server, exchange, web filtering, routers, etc.), so it's not bad ... especially because I miss the challenges that are specific to computer/tech. But, aside from retiring, working at a fully staffed/supported company, or moving out of IT in general, those are the only ways out.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "imthatsysadmin",
            "body": "It definitely sounds like you're stuck in a tough loop, and I think a lot of people in IT can relate to the feeling of constantly fighting fires without ever getting a chance to step back and focus on long-term progress.\n\nOne thing that's helped me handle this type of environment is prioritizing work and setting clear expectations. When everything feels like an urgent fire, it can be easy to get lost in the weeds and lose sight of what really matters. \n\n**Set Clear Boundaries & Prioritize**: Not everything that’s marked \"urgent\" is really urgent. I’ve learned to set boundaries by distinguishing between truly critical issues and things that can wait. Sometimes, it's just about triaging: tackling the most impactful problems first and letting others simmer until you have the bandwidth. Prioritization tools like the Eisenhower Matrix (important vs. urgent) can help make this more concrete.\n\n**Expectations**: A lot of times, the issue is a mismatch between what people expect from IT and what we can realistically deliver. I’ve found that setting realistic expectations early on can reduce the stress and pressure later. Whether it’s letting stakeholders know about ongoing issues or giving them a clearer idea of timelines, having those conversations upfront can help set a healthier tone.\n\n**Long-Term Solutions vs. Short-Term Fixes**: It’s tempting to just keep putting out fires, but I try to carve out time (even if it’s just an hour here and there) to look for the root causes of recurring problems. Building longer-term solutions might not solve everything immediately, but it can prevent those same fires from coming back over and over again.\n\n**Celebrate the Wins**: It’s easy to get bogged down by the feeling of \"I’m just fixing stuff,\" but when I take a step back and reflect on the impact I’ve had, whether that’s getting something working again or improving a process, it can be really rewarding. It’s important to remember that even if you're not solving the \"big\" problems every day, you’re still making things better.\n\n**Self-Care**: I’ve learned the importance of balancing work and personal life. The grind of constant firefighting can lead to burnout, so it’s crucial to take care of yourself physically and mentally. Sometimes, stepping away for a little while can help you come back with fresh eyes and a clearer head.\n\nAs for whether this ever changes – there will always be firefighting in IT, but over time, you can get better at managing it. The key is learning to manage your work, set boundaries, and keep a bigger perspective on the long-term goals. If you don’t, the cycle can feel endless.\n\nStay strong and keep building! You’re making an impact, even if it doesn’t always feel that way.",
            "score": 1,
            "replies": [
                {
                    "author": "Quietwulf",
                    "body": "\\^ Really great, practical advice.  It is absolutely possible to mitigate some of the endless grind.  You **can** make material differences in how things run.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fine-Palpitation-528",
            "body": "My management always said \"You know the reward for great work is? More work!\"\n\nIt's cringe worthy but that's corporate America. The better you do, the more responsibility you get. Doesn't stop until you can stop working. Hopefully, you can find some cool people along the way that help make the corporate slog not suck too badly.",
            "score": 1,
            "replies": [
                {
                    "author": "Maximum_Bandicoot_94",
                    "body": "eh, increasingly my job has shifted from \"doing things\" to \"knowing things/analyzing things\" as I climb up the IT engineering ladder.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "paleologus",
                    "body": "The reward for competency is more responsibility.   ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CollegeFootballGood",
            "body": "Always a grind, it’s nonstop but such is life.\n\nUnless you can truly be free, life is relentless",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThimMerrilyn",
            "body": "It never gets better.  At best it’s a case of: Same shit, different laxative.",
            "score": 1,
            "replies": []
        },
        {
            "author": "accidentalciso",
            "body": "25 years in, still waiting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ajrc0re",
            "body": "That’s an issue with your job not the career. My job isn’t like that at all, we have level 1 help desk staff and a ticketing system taking care of “urgent requests”, we plan out our goals and deliverables every two weeks, when emergencies happen or surprises take priority, original commitments are shifted to another resource or shelved until the next coordination meeting. I don’t have any of the issues you described and have built an awesome environment because of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "meesersloth",
            "body": "Its like Sisyphus digitally pushing a boulder up hill.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaluteMaestro",
            "body": "Been doing it for 30 years same shit different day, the problem isn't the systems it's the morons that use them.",
            "score": 1,
            "replies": [
                {
                    "author": "oyarasaX",
                    "body": "Problem Exists Between Chair and Monitor",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gh0styD0g",
            "body": "What’s your change/incident ratio? At my spot we’re running roughly 50:50, stability requires a low change rate, it’s hard to maintain stability in an org with a high change rate. It’s bloody exciting though. 😁",
            "score": 1,
            "replies": [
                {
                    "author": "edward_ge",
                    "body": "50:50 is honestly impressive. At my place, it feels like 80:20  \n  \n80% incident response, 20% planned changes that somehow still turn into incidents. Stability is a dream, but when the business wants ‘innovation’ at breakneck speed, you end up playing cleanup instead of building anything meaningful.\n\nI totally get the excitement part, though. When things work, it’s a rush. But damn, does it ever slow down?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Gh0styD0g",
                            "body": "Honestly, I wouldn’t beat yourself up about it, no matter how well you plan somebody won’t be happy, most times just because they don’t like change. Folk are fickle, just do the best you can and if you feel you did that, then don’t let the feckers burst your bubble 💪🏻",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "soulreaper11207",
            "body": "Ticketing systems with priority levels are a good send when working as a one man team. Though you need the management to back you on it. If not, jump ship cus they will never respect IT or anything you have to say.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BAdinkers",
            "body": "Yes.\n\n\"We've duct taped so many holes our entire ships made out of it at this point\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "apple_tech_admin",
            "body": "Does it get better? Not really. I'm just finally paid enough that I indulge in retail therapy (heavily and often) and I cry in my office before the 8 AM abuse begins. Wash. Rinse. Repeat.",
            "score": 1,
            "replies": [
                {
                    "author": "oyarasaX",
                    "body": "yikes",
                    "score": 1,
                    "replies": [
                        {
                            "author": "apple_tech_admin",
                            "body": "Yeah. Not a fun time to be inside the beltway right now.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Automatic-Evening-61",
            "body": "From someone who has worked in IT for 30 years I can honestly say it’s an endless grind. Technology changes every 4-5 years and if you are not willing to re-learn all of your skills then you’re immediately obsolete. As such, long term experience is mostly irrelevant in IT as most roles and openings prefer younger candidates or even fresh graduates.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kerosene31",
            "body": "Sadly, always like this.  Back in the old days, it wasn't this way.  IT used to be respected.  I joke that back in the 90s, we were kind of the \"rock stars\" of the org.  I remember being all of 22 years old and sitting in on high level executive meetings.  \n\nSomething shifted slowly over time.  We're now the IT janitors.  If you're looking for a metaphorical pat on the back or \"good job\", this is the wrong line of work.  IT is a necessary evil and a big cost.  \n\nBack in the day, e-mail went down for an hour, and they thanked you for getting it back so fast.  Now, someone tries to log in at 4am during a scheduled maintenance outage, and we get yelled at for the system being \"unreliable\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "TouristGloomy6342",
            "body": "When I started as the IT guy, we were 20 people in one building. We grew into more people, buildings in more states but still just me. I used off the shelf stuff so if I needed someone to go to BB to get a replacement they could and I would walk them through how to config. \n\nEventually i got the company to invest in Meraki to help me manage all these sites remotely. Now with a solid backbone I didnt have as much \"urgent\" issues with things being down. I could tell. If your life is fixing things then you didnt build it right.\n\nNow, 20 years later, its still me, 375 people, 20 sites, 5 states, its getting easier as the years progress. Some weeks its cake, maybe 15 hours of \"work\". Im training a new guy thats 21 now, but never had to do that so its a new task for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd_Secret9132",
            "body": "I've been doing this 20 years. It is an endless grind, but that's pretty much any job. The work is never done.\n\nSadly, I've found that IT is usually the most mis-understood thing, even in good companies. It exists in an almost quantum state, being a 'cost centre' and critical to operations at the same time. There's a constant push to cut costs and produce value, while demanding that everything operate with no interruptions.\n\nCouple that with what seems to be an ever expanding ranges of duties that always seem to fall at ITs feet (primarily because 'they run on computers', but that's literally everything these day), you end up operating under a 'keep the wheels on the bus' mantra moving from one event to another.\n\nThe worse part for me personally. It's always been expected of me, regardless of job, to be 'available or reachable' 24/7 (usually without compensation), meaning work is also lingering at the forefront of your mind. You can never truly disconnect and I find myself always slightly on edge.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PositiveBubbles",
            "body": "It's an endless grind if an org lacks any// decent/ documented processes and has more politics. If you work with a solid team and manager who shields you from the politics and manages resources and doco is decent you can escape the daily grind.\n\nI was about to lose hope until my current manager and his manager and even counterpart offered me an opportunity after I interviewed well. \n\nI was 1 of 3 that moved teams last year because being silod isn't great, and SMEs without sharing the tasks/loads/ skills and knowledge is a contributor to the daily grind and they shouldn't be",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dopeaz",
            "body": "Most companies I worked for are a grind for a couple of years until you get all the fires out and remove the fuel and spark that created them. Then it's implementing new stuff that will catch fire for the next guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "USarpe",
            "body": "You are a firefighter in IT, the badest possible situation. IT should be proative searching for weak points and fix that, before something can happen. If your system already breaking down, you are doomed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "phjils",
            "body": "Be careful not to automate all the things, then the most exciting part of your day can be spinning in your chair.\nSome days I get home utterly mentally drained because I’ve spent 8 hours of my day doing absolutely nothing of worth or value.",
            "score": 1,
            "replies": [
                {
                    "author": "Lord-Of-The-Gays",
                    "body": "Depends how you look at it. I recently automated a lot of our processes and it has taken a lot of the workload off my hands, especially the stupid ass tickets that they submit nonstop. So now I can concentrate on other meaningful things. I was so burnt out that I was about to quit. Now I have more free time to learn new things and improve my skills.\nBut again, automation comes with its own risks. One day you might wake up and find out that you’re getting laid off because almost everything is automated now and they don’t need you anymore even tho you’re the one who automated everything 😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Delakroix",
            "body": "you wait for thenext big thing, be smart enough to know how it works, and solve the problems that come with it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zeeblefritz",
            "body": "Sounds like you need to move up and out of your current position into one where you are building and not fixing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThunderGodOrlandu",
            "body": "It totally depends on the type and size of the company you work for.  If you work at a regular small/medium size company, constant problems is not good and might be a sign of a poorly established infrastructure.  When do you get to work on regular projects if all you deal with are fires?  One question I always ask during an interview with a new company is \"How many fires have you guys had to put out this month?\"  And if their answer is \"Man we put out fires on the daily\", then you have to realize you are probably walking into a shit-show. I currently work for a medium sized finance company and we maybe have a fire a month at most. 90% of my work time goes towards projects.",
            "score": 1,
            "replies": []
        },
        {
            "author": "djaybe",
            "body": "Identify common help desk issues and address the source.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnrulyThesis",
            "body": "There is only one thing you can be sure about in IT: something will break at some point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StormSolid5523",
            "body": "The work is always there and it’s “Job security” and when people say it’s Urgent my take is I will decide if it’s Urgent or not , I write a lot of documentation and even then people ask dumb questions or don’t read email instructions at all , I force them to read",
            "score": 1,
            "replies": []
        },
        {
            "author": "mautobu",
            "body": "Automation, a ticketing system, and adequate monitoring can help, but it's a lot of putting out fires.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rhubear",
            "body": "IMO, the problem is that your users, even in management, are idiots, & unless you are the IT decision maker, you have no control over what happens.\n\nNow if you were either Head of IT, or ran & designed your own shop, you could have much better control of WHAT systems to run & HOW to run them..... This in the end is what it takes for an IT pro to actually enjoy the task of maintaining an IT system.\n\nNot the reality for most engineers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chefnee",
            "body": "Yes to all three! Management needs metrics if you want to improve your department. You might need another resource to reduce your workload. Many companies run lean. By doing this it keeps the labor within budget. If they find that you’re working too many overtime hours, then they may have a use case to bring in a new hire. Before they do that, manage needs data or metrics of what’s currently happening. \n\nFor example, you have X amount of minutes you spend on emails. Fielding these requests and the time spent triaging and actually fixing said issues. Build these metrics and present them to your leader and they will have a case to get you some help. \n\nAs far as your question? Grind baby grind!",
            "score": 1,
            "replies": []
        },
        {
            "author": "fdeyso",
            "body": "And the “duct tape supplier” runs around with a state-of-the-art SDS hammer drill making new holes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "niceoldfart",
            "body": "Work on ticket system, and reporting.\nYou need to create one process for all, and communicate time you work on each issue, nobody cares about you when you don't expose your problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bindermichi",
            "body": "If fhat is your current company environment, get out now!\n\nFind a more professional place to work at.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valkeyere",
            "body": "No. It will never get better. Whores in Denmark have a union but we don't. Or maybe it was Belgium.\n\nYou're going to be expected to do things you're untrained to do constantly, and there is no recognition of a job well done 364 days of a year, only a reprimand when there is an outage the 1 day a year. You're facilities, HR and PA to basically everybody. Why should Susan learn how to set an out of office, that's what she has you for. While you're here can you also build this IKEA cabinet.\n\nThat outage was also caused because either you've had to work with dated equipment that needed to be replaced when you started, or was bought at half the cost and a quarter of the spec you recommended and it couldn't cope.\n\nIf you're lucky, your direct report will understand the handcuffs you have, and shield you from nonsense. More likely is they are someone with a business degree and no technical knowledge and all they're doing is padding their resume so they can apply for a Director of IT role somewhere and show how much work they got out of you and how much money they saved.\n\nIf you're unlucky, you're being hired expected to fail. They just need someone to blame.\n\nThe industry is this way because greybeards used to be paid WAYYYYY more than greybeards now, but locked IT staff into a race to the bottom to prove how good we were at our jobs. We love what we do, and so it's a badge of honor to show just how much work we can do for some reason.\n\nNoone else in the business is doing 2 or 3 things at a time if they can help it. We do that routinely, probably because we are all on the spectrum somewhere and the idea of watching a bar go up drives us mental, so we multitask.",
            "score": 1,
            "replies": [
                {
                    "author": "Different-Hyena-8724",
                    "body": "Such an eloquently described way of explaining the circling the drain with the race to the bottom problem.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "My_Legz",
            "body": "There is another side of the ship as well, if you fix everything you can end up in a situation where hardly have to do anything since they hired you for a situation that just doesn't exist anymore. Then you are, on one hand, in a positive spiral where things get better and better but if you have a restless personality that can be its own kind of hell.",
            "score": 1,
            "replies": [
                {
                    "author": "ITrCool",
                    "body": "Until they look at your utilization data. Then suddenly they start talking about outsourcing or not backfilling your job because your ticket and project quantity have gone down since you fixed everything.\n\nFormer colleague of mine at a previous employer literally fixed and automated himself out of a job. He had everything so optimized, he barely did anything anymore except socialized and sat at his desk, monitoring stuff. Eventually the boss realized and while he was proud of him for what he did, the boss had a LOT of trouble justifying his position with the lack of utilization data beyond the point where he had automated things. \n\nSo my colleague went elsewhere because he knew what was coming otherwise.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Different-Hyena-8724",
                            "body": "So I'm one of those folks you just can't quantify with numbers but everyone knows my name and everyone reaches out to me (in a 250k+ user environment) for critical issues in my domain.  So I've already made a name for myself and thus don't feel like I need to keep up with the admin side of the house of proving my worth anymore.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "False-Ad-1437",
            "body": "IT is a services industry more than everything else. If you are sitting around doing nothing all the time then you’re probably not giving good service. (There are exceptions, and those are likely exceptional people)\n\nWhat you provide is a multiplier for the business unit to make money. So they will always be coming through you to bring in that revenue. In that sense it will feel never ending. You’re always in their way at least a little bit, even if you’re giving them 1000x productivity. That’s where managing expectations is really key, because they are always going to have pressure on you.  I could go on for a long time about that aspect. \n\nCybersecurity has one of the largest direct fully outside pressures to IT, and this drives a lot of the device churn, OS churn, etc. that makes it seem never ending as well. Between the attackers and compliance, it can make that existing treadmill a little harder to deal with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jaydizzleforshizzle",
            "body": "It sounds like you don’t have any backup and are a sole point of failure, I’ve done this, it kills your body. Need to get some help or find a new job OR the truly hard one, don’t give a fuck, if you can in your own head say “I’ve done what I can with what I’m given”then you can find some peace. These are the only ways to soothe your issue.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guyver1-",
            "body": "IT is a journey that never ends. things you 'fix' are just toilet stops along the way",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zealousideal_Ad642",
            "body": "I'm sure you'll build meaningful stuff. It wont be meaningful for very long however.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Superb_Raccoon",
            "body": "And then you learn to do root cause analysis and automate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jetcamper",
            "body": "Any job is a grind. What do you mean gets better? You’re literally getting paid so other people don’t do it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glass_Call982",
            "body": "This is what working at an MSP is like. Add on top of it some old boomer hassling you about timesheets and threatening to not pay you because you didn't track every 15 minutes of your day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crimesonclaw",
            "body": "Keeps you busy at least. That's a good thing \n\nThough from how that sounds like, seems to me that there's something fundamentally going wrong at your place",
            "score": 1,
            "replies": []
        },
        {
            "author": "GhoastTypist",
            "body": "Depends on your environment.\n\nMy place is pretty crazy, when I started we were a small staff of 30 with very minimal infrastructure setup.\n\nNow we're 100+ employee's in our main company as an internal IT department, we have 3 other companies that we support. I'm also apparently a consultant because my top levels keep giving my contacts out to people they meet at conferences like \"here's our IT guy, get your IT guy to reach out to him, he knows his stuff, he can help you out\".\n\nThere is a mountain of project work that I have to deal with, my helpdesk staff though they just stay in their own lane and its pretty routine. Sometimes they might get an email or message that is not something they can deal with so they just pass it along.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blueshelled22",
            "body": "25+ years in IT here. We are very blessed in our field because it pays well, and can be a bit of a black box to most people. It allows you to develop expertise as a go-to. Sure it’s painful at times but imagine the folks in other professions who are struggling to get by. \n\nAfter 20 years in the enterprise, I moved to consulting, where I get paid for my time and expertise. Not just a “cost center”.  It is not sunshine and roses but it is far more rewarding.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HsuGoZen",
            "body": "I once had a boss say “there will always be something on fire, don’t stress about it”. At that moment I realized, I did not want to work in IT anymore. \n\nThankless, bottomless pit of problems, with everyone always mad that you aren’t doing your job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FierySunXIII",
            "body": "It will never end. There are various reasons, sometimes because user refuse to learn( taught them one thing BY THEIR REQUEST, forgets it the next day ). Sometime it's because of higher ups wanting things they don't fully understand ( wanting fast internet for the company but refuses to pay the ISP for faster speed ). Some are stuck with the past on how things work (Before, my department was an EDP which prints out report for user. They wanted us to become IT support. But because they don't pay us enough to do 2 workloads, management pushed EDP responsibilities to the staff instead and we mainly focus on IT support. But guess what? They still think of us as EDP, so still do 2 workload with same pay ).As long as people refuse to understand IT, it will never end. \n\n\nWorst part, some of my friends in IT received a ticket to FUCKING.CLEAN.THE.TOILET",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrainWaveCC",
            "body": "Every job has those moments of reward and futility.\n\nSometimes, it is about the industry or the role, but most times, it is more about the specific employer...",
            "score": 1,
            "replies": []
        },
        {
            "author": "th3groveman",
            "body": "You are stuck in the “reactive cycle” where when you only work putting out fires, you don’t have time to actually address underlying issues, develop better processes, etc. \n\nIt is possible to dig out, to address those issues, improve processes and start to work proactively, but it takes additional manpower. It will all depend on your management and other leadership recognizing the problem and being willing to invest in the solution. It’s worth it, as working proactively also cycles, and it’s possible to get to a point where things are stable and you are focused on future projects: working on next month’s problems instead of last month’s problems.\n\nMany people in your position will work OT to keep things going, which often backfires as the organization does not “feel” the effects of the understaffing until you inevitably burn out. It’s not worth it. I hope you have some supportive management that can be made to see the problems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoSellDataPlz",
            "body": "Sounds like you might need to make a play at arguing for help. Maybe a part-timer who can handle low hanging fruit while you figure out the underlying cause of some of these problems and either fix them better or create automated scripts to fix them. You can more quickly execute 4 different scripts than manually fixing each issue.",
            "score": 1,
            "replies": []
        },
        {
            "author": "New_Set7087",
            "body": "IT is about solving problems. Is there ways to enable users to empower themselves? How about automation for yourself to make toil and menial tasks somewhat easier or have less steps?\n\nIt’s a constant refinement of process until the process can’t be refined any further, or the process is replaced entirely",
            "score": 1,
            "replies": []
        },
        {
            "author": "BonezOz",
            "body": "It really depends. If you stick to support, or SysAdmin roles where you're responsible to put out fires, you'll always deal with fires, just eventually you get really good at putting out those fires. \n\nIf possible throw your name in the ring for some project work, break away from the admin side of it for a while.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bdunk17",
            "body": "Life is a seemingly endless grind. It’s no different.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TotallyNotIT",
            "body": "This is highly dependent on the organization. Being a consultant was awesome for this because I got the clients who were actively looking to make things better, more efficient, more resilient, etc. I rebuilt lots of environments and made shit better for a great many people.\n\n\nI'm now an internal IT manager at a technology company and we're all in on doing all of those same things. I'm currently driving multiple initiatives to revamp large parts of our infrastructure and processes and it's fucking awesome.\n\n\nA common problem around this sub is that there is a disconnect between the business and IT. IT blames the business for not giving them money but the business has no idea what the fuck IT is trying to do with it because no one is translating it into a language they can understand - risk and value. \n\n\nVery simplified example - just saying you need to replace something because it's out of support means fuck all. Aren't you support? Instead, this piece of hardware that is responsible for $x of revenue which we lose if it fails, it costs us $y to maintain but will cost $z to replace. You might still get a no but at least they understand better what they're saying no to.\n\n\nIf you have no one who is doing this, you either become that person or look to leave. Some people enjoy grinding, some people are able to just shut their brains off and disassociate. I am not one of those people and it sounds like you aren't either. Feeling like your work is meaningless is one of the biggest factors leading to burnout according to piles of research spanning decades.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zenjabba",
            "body": "I find it's about getting that crazy bush slightly under more and more control every few growing seasons till you have it \"managed\". Just watch out for the weed that appears to grow overnight that you didn't even know you had!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ILikeTewdles",
            "body": "Depends on how you architect things. If your IT systems are built right, it's pretty smooth sailing. I ran 3 data centers across the US basically by myself for 10 years at my last org. I'd have the occasional issue but fire fighting was minimal as I built redundancies.\n\nIt sounds like eh org you work for needs to take a look at root cause and start fixing things. If it's end user issues you need to empower them to find solutions and fix things by themselves. Self service password resets for example, automated permissions approval for access to files or software, Automating user onboarding and off boarding. Stuff like that to free up your time and stop users from coming to you with \"urgent\" requests.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ballzsweat",
            "body": "Why shit this person? YES! Endless grind! Regardless of money or leadership.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whoa_Bundy",
            "body": "Replace IT with life and yes, if you make it that way internally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lamark80",
            "body": "Endless grind",
            "score": 1,
            "replies": []
        },
        {
            "author": "1a2b3c4d_1a2b3c4d",
            "body": ">  I wonder am I actually building something meaningful\n\nThats what your hobbies and personal life is about.  Work is about getting skills and getting paid.  Then, when you have enough new skills, you move up or out to get better pay.  And you repeat the cycle.\n\nAnd then you go home and spend your money on the things you love to do with the people you love the most.\n\nI could care less if the company I work for gets any meaningful benefit from my work.  I work to get paid.  And get skills at the same time.\n\n>  Or is this just what IT is: an endless treadmill of firefighting, underappreciation, and burnout?\n\nIf you don't grow, get skills, and move up or out, then yes, you will never advance and it will suck.   \n\nThis is why you work to get skills.  Then you move up or out.   Seriously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IndividualStretch506",
            "body": "never changes really... only you change, learn to roll with it, maintain personal time etc etc, find exercise and activities to get your mind off it and stick to that for health",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheRealBilly86",
            "body": "I worked corporate for 15 years and pivoted to product support for a company that makes cyber security appliances for the federal government. HSMs key managers high speed encryptors and authentication.  Now I get to find bugs in our products and replicate customer networks here in the lab. Its non-stop education, new skills, and troubleshooting.  Finally, a company that completely embraces my Jack of All Trade Solo IT guy skill set, yet this place is forcing me to specialize all at the same time.\n\nIt's the difference between front of house and back of house. My work directly effects the people buying our equipment which equites to more money and product development experience. It's actually impactful work.\n\nYou might want to think about changing careers from back-office IT to front-office product support. Look for Sales Engineer or Product Support Engineer roles for companies that build things. If you're lucky you live close to some good ones.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jhaand",
            "body": "IT is like tending a garden via a ticketing service. But there's no end. Otherwise there could be a budget cut to the IT department. \n\nSee the book. \nGene Kim and others. - \nThe Phoenix Project: A Novel about IT, DevOps, and Helping Your Business Win\n\nhttps://www.amazon.nl/-/en/Gene-Kim/dp/0988262592",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cheesedoff",
            "body": "Just when you think it is getting better, it gets worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tech_Mix_Guru111",
            "body": "You aren’t doing anything meaningful, you aren’t paving the way for future generations… you’re being burned out to make your company money and keep the social club members in place by trickling ideas up the chain in hopes you’ll curry favor and be allowed out of the peasant pit, but it never comes bc the social club doesn’t allow hard working members",
            "score": 1,
            "replies": []
        },
        {
            "author": "jerf42069",
            "body": "you're supposed to sandbag: tell them it's gonna take longer to fix than it will, be lazy and complain about how busy you are and that you need some subordinates to help out, then when you get them, make them do most of the work",
            "score": 1,
            "replies": []
        },
        {
            "author": "jpsreddit85",
            "body": "I was in IT for 5 yrs before I moved into dev. From what I could tell, if you did an amazing job and everything worked perfectly, everyone thought you didn't do anything, if you had one thing go down, everyone thought you were useless and didn't know what you were doing. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otto-Korrect",
            "body": "20 years.  Slightly different fires every time, but always a fire. \n\nAnd what you build today will be obsolete in 3 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dalgeek",
            "body": ">I just duct taping a sinking ship while everyone complains the tape isn’t good enough?\n\nI prefer \"rearranging deck chairs on the Titanic\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "WantDebianThanks",
            "body": "Well, I sort of stopped caring about career advancement and have been working on an exit strategy (writing romance novels), so that's an option",
            "score": 1,
            "replies": []
        },
        {
            "author": "PWarmahordes",
            "body": "Endless grind.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wewe_nou",
            "body": "The beauty of IT, is that we are needed.  \n\nAs for work, do whatever you want, there is enough work and not enough competent people.  \nBut you know how life is ... it's about the journey maaaan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "STGItsMe",
            "body": "I’ve been doing this since the mid 90s. It is endless. \n\nThere are things you can do when it’s quiet to help make fires less frequent. But shit happens. I had someone accidentally delete a critical database the other day. It was a major outage, but short lived because the way things are set up, it didn’t take much to bring it back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItaJohnson",
            "body": "Sounds like MSP work.  Just one dumpster fire after another while responsibilities increase for higher tier people and escalating tickets becomes trivial to Tier1.  Got something harder than a password reset?  Just escalate it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "giovannimyles",
            "body": "Whatever systems break the most is where you invest your effort. Had a gig where the VMware was horrible. All RDMs tied to individual hosts. Nothing could vmotion. It was several versions old. Something always had an issue. Same with their NetApp. Took me about a year but I rebuilt it all from scratch and the job was basically cake for the next 2 years. Had a job where the design of the supporting systems were bad and the thresholds for alerts were out of the box. Tuned the alerts, redesigned the support architecture and the job was cake for a year. Put the effort in early and the job becomes stress free.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bhones",
            "body": "Try working at an MSP where you’re literally only there because things break and in case things break. We free up our clients to plan and effectuate changes in the environment (usually with our help) but man… I had the realization after 13 years of MSP (sr voice engineer) that I’m really only here to unlock C Suite and Director voicemails, reset their pins and be available when shit hits the fan and the business can’t make calls or faxes or critical servers are down.\n\nWhen that’s not happening there’s down time, but… it’s a grind and for me as a specialist in an MSP it’s the same issues day in day out just swap the company name.",
            "score": 1,
            "replies": [
                {
                    "author": "phillymjs",
                    "body": "> When that’s not happening there’s down time,\n\nI worked at an MSP that ran short staffed on purpose and took on any new client that was willing to pay, no matter how shit their network was. Downtime was a four letter word at that place. When the open ticket count got too high (and how could it not, with a shortage of techs and no shortage of clients with janky infrastructure?), they held what was called a \"blitz\"-- the techs worked on the helpdesk from 5-8pm for a week, closing as many tickets as they could, and the company magnanimously fed them dinner from the crappy takeout joint across the street-- to be eaten while continuing to work, of course.\n\nAt first these blitzes were voluntary and there was extra pay, but by necessity they became more and more frequent, and then the extra pay got stripped away, and then it became mandatory.\n\nSmall wonder that I burned out twice while I was there. The first time was at the height of the Great Recession, so I just had to grit my teeth and power through it. The second time, they fired me before I could find a new job.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jazzlike-Vacation230",
            "body": "I wish IT evolved a bit more, the understanding needs to be, to an extent, if your IT systems are decent, it will give you the right setup to help the business guys do what they gotta do.\n\nAll the insourcing, outsourcing, lay offs, hire on processes keep focusing on cost control\n\nBut here's hoping with security being an increasing threat, the old school higher ups will start paying attention to the fact that for example: a 30 year old sedan can get you from point a to b, but a 10 year old one will do it a lot better, and you don't have to have the latest and greatest, but you need the right setup to take on challenges in security and business",
            "score": 1,
            "replies": []
        },
        {
            "author": "denc_m",
            "body": "It depends on budget allocation. With sufficient funding, you can invest in resilient systems, streamline workflows, and hire skilled personnel. \n\nThis allows you to move from constant firefighting to proactive improvements, including automation and long-term solutions. \n\nWithout proper resources, IT often remains a cycle of quick fixes and reactive support.",
            "score": 1,
            "replies": []
        },
        {
            "author": "steveatari",
            "body": "All of this, and I wager nearly all of the country's/world's problems, is due to money and profits. We live in a time where a quarter can NEVER BE DOWN and profits even, literal money, has to increase year after year after year. \n\nTeams get smaller, companies buy out competition and integrate or gut them, corps fire entire divisions only to have to pay more or rehire after. \n\nIt's never the best interests of the company + the staffing. It's only profits always. And that leads to the nightmare hellscape of today we're in. \n\nSome businesses or industries are better than others. Some places will be incredible. Try nonprofits, you matter, you affect change, and if nothing is broke/needing improved, you're on easy street.\n\nI'd say seek Federal but in this administration it's the worst you could do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smoothvibe",
            "body": "Either get the funds to improve things permanently and thus reduce daily load or get another job. This is not the normal way how IT is handled.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EEU884",
            "body": "Companies will only abuse your good will if you have good will to be abused. If they wont fix things then get a new contract elsewhere. Loyaly isn't a thing in 2025 - if the company doesn't serve your needs and pile you with shite then march on and let them burn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gotamalove",
            "body": "Yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "iloveemmi",
            "body": "I think IT is fine. It's the state of modern business that is horrible (at least in the US), and sometimes it disproportionately impacts us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "notHooptieJ",
            "body": "if it came to an end you'd be out of a job.\n\nits being paid to dig a hole, then fill it up, then dig it again.\n\nDo your 8 hours, then hit the showers. \n\nthis is a job, not your life. \n\nyou'll be much healthier mentally if you can separate what you do for money from who you are, they Arent the same thing.\n\nSingle facet personalities are unhealthy and unattractive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "86yourhopes",
            "body": " I'll build a fire proof house. As soon as I put out all these fires",
            "score": 1,
            "replies": []
        },
        {
            "author": "Working_Astronaut864",
            "body": "Yes. No.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TranslatorCold5968",
            "body": "always a grind. Shit always breaks and you have to always be on the lookout for new tech. I hate IT. The money is good though...usually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "collectivedisagree",
            "body": "IT would be great if is wasn't for the users.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thegreatcerebral",
            "body": "Well the truth is it is a bit of everything.  The problem is that IT is generally regarded as just a department that does nothing but spend money.  On top of that...  A LOT OF MONEY.\n\nThere are a few companies that do not treat it this way and working for them you don't feel the way you are now.  \n\nThat is what usually creates the situation you are in honestly.\n\nI take it you are new and possibly too low level to really see the cost of IT: personnel, hardware, licensing costs, SaaS costs etc.  It's never-ending.  Even to get say a business class 1Gbps connection is $2,000/mo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Prune_1731",
            "body": "Most places don't wanna put forth the money to fix things so yeah duct tape it is. That's why I look for a new job before it gets to bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Prune_1731",
            "body": "Most places don't wanna put forth the money to fix things so yeah duct tape it is. That's why I look for a new job before it gets to bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Backieotamy",
            "body": "The primary response I give people who ask me about getting into tech is that you can't be afraid to read.\n\nTo call it a grind would be misleading a bit, but the fact of the matter is that tech is constantly evolving and you can't stay complacent or you will become as obsolete as the technology you work on.\n\nNew/updated certs are almost a mandatory now, not just in tech but in ITIL, SOX, Fedramp etc..\n\nVmware, NetApp, AWS (and so many more) are all primary vendors to enterprise organizations and federal entities and have changed so much over the last 15 years have to remain at least partially hands-on with them to remain relevant.\n\nIT to not be a grind is definitely for people who enjoy not just using tech but people who get excited for where it's going and the \"cool shit\" it brings with it, and we want to know how it works.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dented-spoiler",
            "body": "You burn out due to lack of resources (staff, systems, or both) and then at the next job they group bullying you into a deeper depression because you don't fit their clique.\n\n\nRinse, repeat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dented-spoiler",
            "body": "You burn out due to lack of resources (staff, systems, or both) and then at the next job they group bullying you into a deeper depression because you don't fit their clique.\n\n\nRinse, repeat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rcade2",
            "body": "Yes. Unless you change career paths in IT, this is how it is in support.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thepotplants",
            "body": "Since this isnt r/shittysysadmin i'll try and give a real answer. \n\nIt can get better, but it's hardwork breaking the cycle. \n\nIt takes a long time to shift the needle from reactive work to proactive planned replacement and preventative maintenance. But it can be done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Carlos_Spicy_Weiner6",
            "body": "IT is not a quick and simple game of checkers. It's a long game of chess. You wanna do stuff fast and loose, your life is gonna suck. You plan shit out multiple moves ahead, your life will suck a little less.",
            "score": 1,
            "replies": []
        },
        {
            "author": "halxp01",
            "body": "Never ending. And always evolving.  Replace desktops Replace servers . Replace storage. New OS. New Server OS. New software.  Replace switches/routers etc.  replace phones. Replace printers.  List goes on and on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "50PieceNug",
            "body": "It depends if you want to stay in your position then it might seem endless but i would focus on how you can advance. Give yourself a baseline and see how you can grow from that and give yourself little goals to achieve so it doesnt feel like you are working just to work at least youre seeing yourself work for something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pycior",
            "body": "Embrace the journey :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "HugeAlbatrossForm",
            "body": "Build your wealth not another mans company. None of this is YOURS. It can all be torn down and will at some point ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Juggernaut-4698",
            "body": "You have to create the environment you want. If critical systems are going offline on a nightly basis, you need to figure out why. \n\nWhen an environment is running and properly maintained, your days are much easier.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hippychemist",
            "body": "Lots of grind.  Computers break, and people are totally reliant on them now.  But, if you can get out of the hole, then you can spend your time thinking how things should be and how to get there \n\nGotta find what you want out of this job, and get there",
            "score": 1,
            "replies": []
        },
        {
            "author": "djgizmo",
            "body": "depends on the org",
            "score": 1,
            "replies": []
        },
        {
            "author": "unccvince",
            "body": "Use the Pareto principle and automate the 20% of the stuff that takes 80% of your time.\n\nAnd budget shouldn't be an issue while you start with automation, there are many FOSS solutions that work well on the server and network side.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ncc74656m",
            "body": "Obviously there is a lot of this that depends on what your title is and level of ability to effect change, but if you can in any way get ahead of the curve on that, there's a lot of stuff you'll find that isn't just putting out fires.\n\nI've always had a bit of a proactive mindset towards IT, even as a simple technician. Looking at the common issues, everything from drive fragmentation to extended uptime on shared devices, and trying to figure out how I can get ahead of those issues. I ended up in some places reducing our calls from 1-3 a week to zero just by not accepting \"this is how it is,\" and some of those fixes were functionally no push at all.\n\nAs a good example of that, I noticed that our Operating Rooms (ORs) had their keyboards and mice constantly being accidentally disconnected by the users. After a couple recurrences and being told \"Oh, that always happens, now that we know you're not scared of being in there you'll see all those tickets,\" I realized it was happening because we used PS2 devices and cheap, worn out extension cables that were too short for the maximum range of the keyboard arm. I convinced management to buy USB instead since they have a more positive engagement, longer extension cables, and buy me some extra wraps and zip ties, and in around an hour of work converted all the ORs and never had it recur.\n\nThe proactive mindset matters a lot, and while I know not every tech has it, or wants to deal with it if they do, or is just plagued by shitty metrics designs, at the end of the day it's up to you to start building a new proper dam, not just slapping more mud on the levee.",
            "score": 1,
            "replies": []
        },
        {
            "author": "finevcijnenfijn",
            "body": "It gets worse, and you get older too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hnaq",
            "body": "I had one job that was constant fires and then with some direction of leadership, started ignoring a lot of it. Of course, mileage varies on your actual responsibilities and so forth, but I stopped worrying about getting to every single email to fix little logon issues and people pinging me because it was easier than calling the help desk... and started concentrating on better processes, automation, and just overall making things better.\n\nAs you probably know, a quick favor to do the simplest thing can turn into 30 minutes of figuring out what someone actually needs done or dumb troubleshooting of a simple problem.. and it's hard to say you don't have a minute to do seemingly the simplest tasks. \n\nIt's obviously highly dependent on your department structure and your manager. At one point I felt like I was ignoring a lot of fires, yet one of the directors complimented me on really starting to get things done, so at least I knew they had my back if something got escalated or they got a complaint. \n\nThe main thing was pushing work down or to those who are most qualified to complete it, allowing your admins to do the work they're most qualified to do (easier said than done for a lot of reasons, of course).",
            "score": 1,
            "replies": []
        },
        {
            "author": "SweepTheLeg69",
            "body": "It's a terrible grind that's gets harder and more of a stuggle every year. You need to know the truth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "techdog19",
            "body": "If your systems are crashing everyday you need to think long and hard about what you are doing. I have been a Sysadmin for over 14 years and after the first couple of years of cleaning up other people's crap my systems run. Yes sometimes things legitimately break but you should not have an emergency every day at most once a month.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBigBeardedGeek",
            "body": "Even if it is a grind, you are the stone. Let the work course over you, until the groove is formed",
            "score": 1,
            "replies": []
        },
        {
            "author": "dude_named_will",
            "body": "The thing I like about IT is it feels like the more work I put into it, the easier the job is. Yes there are days where I struggle for air, but there are also days where I can't believe they pay me for this. It'll get better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chodan9",
            "body": "Yes\n\nBut that’s because I retired so maybe that’s cheating ;-)",
            "score": 1,
            "replies": []
        },
        {
            "author": "LeadershipSweet8883",
            "body": "It changes when you change your perspective and start making daily decisions with the long term health of your company in mind.  Endless break/fix work is a feedback loop - more unplanned work means less planned work done which leads to more breaks.  If users email in urgent issues, just forward the emails to the ticketing system.  Working too much and stressing about it causes burnout and your burnout doesn't get more work done, so don't do it.\n\nA good exercise is to break down your efforts into percentages by goal.  My view of healthy is around 30% break fix, 30% preventative work, 20% new projects, 5% administrative, 10% meetings, 5% communication for an IT organization in crisis.  If you can get out of crisis mode, you should probably dedicate 10% time to training or deliberate practice or networking.  Come up with a percentage breakdown that you think is appropriate and then bring it to your boss.  They may adjust it a little but they'll probably agree to the general idea.  Then you take those percentages and set quotas for the week - 12 hours of break fix, 12 hours of preventative work, 8 hours of new projects, 2 hours of admin work, 4 hours of meetings, 2 hours of emails and phone calls.  Make it into a daily  / weekly schedule and just stick to the hours.  If there are complaints, work with your boss to revise the percentage breakdown or decide together that it already makes sense and the reasons just need to be clarified back up the chain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LeoTheBigCat",
            "body": "Depends on where you work. If you are a cog in a machine, your chances to just put in your 8h and go home are actually great!\n\nIf you are what I call a \"one person IT department\", your chances are slim to none. There usually is no money to prevent problems and even if there is money, it just generates more work. \n\nSo, to answer your question - mostly yes, it is endless grind and mostly no, it probably wont get better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Generico300",
            "body": "> It’s like IT isn’t about solving problems, it’s about keeping things just functional enough for the next disaster. I don’t mind working hard, but I can’t shake the feeling that we’re stuck in a cycle that never actually gets better.\n\nThis is usually the result of not actually having enough staff to allow for anyone to take the time to actually **solve** a problem.  Instead, band-aids are implemented to treat the symptom of the problem, because that's all there's time and energy for.\n\nThis of course isn't unique to IT.  It's pretty much the same situation shitty corporate management culture creates for everyone in every department.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Young_Busac",
            "body": "Technology never stops changing, and businesses become obsolete if they don’t keep up with those changes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ivy1974",
            "body": "Endless grind.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ummgh23",
            "body": "Life is an endless grind.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bi_polar2bear",
            "body": "Learn which emails to read. Any from your chain of command is read and taken care of now. Severity 1 is next, then Sev 2. No ticket, no work, because you can't prove your worth through emails. Any other emails are at your discretion. \n\nMy personal way is if an email comes without my name in the greeting or directly addresses me, I give it a quick glance, maybe,  depending on the person. If you want my attention, ask. Otherwise, it's not important. One person tried to fight me on it, and nothing got done until they asked. If I provide the solution, you have to meet me halfway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Great_Sephiroth",
            "body": "Built right, everything you said does not happen. The problems start with bad ideas. I know people who believe that a static IP is a reservation in Windows DHCP and that person built IT around that. Guess what happened when DHCP died. No IP phones worked. The physical hosts? Who knows what addresses they were on. DCs, everything died. Days lost instead of using statics on critical infrastructure.\n\nIt can be simple things though. Fix problems by the book and for that user that believes they have the most urgent issue in the world? Unless it's your boss, go get a coffee and get to them when you can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cincar10900",
            "body": "Same could be said for anything. I think its mostly what you make of it plus some luck as is with anything else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bib_fortune",
            "body": "It greatly depends on the customer you work for. Try to find a slow-paced one, maybe a non-profit or similar.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Social_Gore",
            "body": "Everything is an endless grind nowadays because our comfort is money left on the table",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baedran04",
            "body": "Start looking at systemic problems and planning to improve the future.  As you make progress on cleaning up trends and repeated problems you can start reclaiming time to re-invest in doing this more and more.  It takes time",
            "score": 1,
            "replies": []
        },
        {
            "author": "jay8771",
            "body": "No, it never changes. Being an IT guy among meatware will always be hell and the nature of our work is always trying to fill a bag full of holes when we're working with them. If the bag isn't full of holes, some boss will see a trend on social media and will want you to implement it. \n\nUsers and managers are just like whiny babies. There is no hierarchy when the network is down. You'll be shat on by everyone equally, the cleaning lady, your boss, the office assistant, etc. They have to respond to their boss so when they have the chance to put pressure on somebody (the IT guy that's trying to help, for instance or any technician), they will do it fiercely in order to compensate their frustration. \n\nIt doesn't matter if you are in tech support, sysadmin, infrastructure, or the poor generic IT guy. Do your best, don't fry your head, put on a poker face, give muggles a cold shoulder, respond to your direct superior and specially, **work your way out of this area.** Nobody gives a damn about your well being or your health as long as you're solving their BS. \n\nI'm not saying \"give up IT\". I'm saying go specialize and find your crew. IT guys, programmers, DBAs or anyone that's very technical, we don't belong with normies. Fortunately, I'm starting to see some light in my path.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Acanthaceae5198",
            "body": "That's called work.\n\nIt's an easy job sitting in front of a computer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "davy_crockett_slayer",
            "body": "It depends on where you work. That's why you need to jump every 2-3 years early on in your career. You need exposure to different things. And yes, IT is a grind. I'm always in courses and studying for certs or labbing things out.",
            "score": 1,
            "replies": []
        }
    ]
}