{
    "title": "Remember the old days when you worked with computers you had basic A+ knowledge",
    "author": "Turbulent-Falcon-918",
    "subreddit": "sysadmin",
    "rank": 2,
    "score": 747,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 367,
    "url": "https://www.reddit.com/r/sysadmin/comments/1je386z/remember_the_old_days_when_you_worked_with/",
    "id": "1je386z",
    "selftext": "just a vent and i know anyone after 2000 is going to jump up and down on me , but remember when anyone with an IT related job had a basic understanding of how computer worked and premise cabling  , routing etc .\n",
    "comments": [
        {
            "author": "pentangleit",
            "body": "Hah - I remember in the old days computer programs came with printed manuals which went into exceptional detail, and if you didn't find what you needed to know you could call up the company and ask the developers directly.",
            "score": 1,
            "replies": [
                {
                    "author": "tankerkiller125real",
                    "body": "Fun fact, where I work, we used to sell Sage products (notably 500 and Intacct), and they still shipped us printed manuals for 500. All 3 4-inch binders of it. And this was just a few years ago.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Professional_Hyena_9",
                            "body": "how do i get a detailed manual for intacct",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tankerkiller125real",
                                    "body": "As far as I know they hide all the Intacct stuff behind \"Sage University\" and partner portals. Additionally, the only thing I really know about Intacct is the developer stuff (which is public) and it's a royal PITA to work with.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Professional_Hyena_9",
                                            "body": "i am wanting to learn what I can before we move over to it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "tankerkiller125real",
                                                    "body": "My only experience with it was some dev work, and I found their portal stupidly complex, not to mention it's built on Oracle databases. Needless to say I personally wasn't impressed. However, I only spent 3-4 hours in said portal max with no prior training of any kind.\n\nYour partner/reseller should be giving you/the teams using it training. Which should help out a bunch. If they aren't... Then all I have to say is good luck honestly, I don't know how the hell anyone could use it long term with no training.\n\nWe got out of the business entirely because Sage based cuts for partners based on new customers being brought in, which for a small company trying to compete with major resellers and Sage itself was impossible.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "brianinca",
                                            "body": "As soon as I heard it had an Oracle backend, I told our CFO, never, ever will we.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "tankerkiller125real",
                                                    "body": "Trust me, I'm right there with you, which is why internally I'm making to push to move to Acumatica (something we started looking at selling) to replace our own aging 500 install (we have no need for the advanced 500 features)",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "brianinca",
                                                            "body": "We looked at Accumatica for a Sage 300 CRE replacement, some obstacles but that would be a valid exit plan if/when we need to.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "pabskamai",
                                                            "body": "X3 it’s pretty good, not cheap, but really good, MS SQL backed. Not cheap but not oracle.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "tankerkiller125real",
                                                                    "body": "Acumatica is also MS SQL, and both cloud or self-hosted. Plus even better, not Sage.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "pabskamai",
                                                                            "body": "Nice!",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Problably__Wrong",
                                    "body": "haha Homie you're going to have to ask your Var for help on that one ;)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "speel",
                            "body": "Not sure about now but maybe 6 years ago you could call up Manage Engine and you’d get a support person asap and they had connections with the devs whom would jump on the line. I was blown away by that.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tankerkiller125real",
                                    "body": "ExtremeDNC when I worked in manufacturing had support that was the devs. Real fun to call and describe a problem only for the person your talking on the phone with to say \"oh, I wrote that part, let's see where it's having a problem\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "OxymoronSemantic",
                            "body": "We don’t mention the S-Word here…",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gonewild9676",
                    "body": "Back in the day I worked as the intern in a small mainframe room. There was a wall of binders of manuals in the back, and every once in a while we'd get the errata update and we'd get a stack of papers with instructions on which book and page they went with.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "joshbudde",
                            "body": "My old boss was the head programmer/data manager for a midsized companies machine room. Checking out programs to work on them meant you literally went up to Tim, pulled out the binder for the program you were going to work on, put down your name to 'check out' the program, then you took it back to your desk, worked on it, then printed it off, put it in the binder, and 'checked it back in' by putting it on the shelf again.\n\nObviously a bit clunky, but it stopped people from stepping on one another's changes, and the binder had everything you needed in it to work on the program--documentation in the front describing what it did, things it relied on, etc, then you had the full history of changes in the binder so you could see how it evolved over time.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jmbpiano",
                    "body": "Not just the programs, the computers too!\n\nThe spiral bound [Commodore 64 Programmer's Reference Guide](http://cini.classiccmp.org/pdf/Commodore/C64%20Programmer%27s%20Reference%20Guide.pdf) was a thing of beauty and included full schematics for the whole system.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PC509",
                            "body": "I really wish I was old enough to understand 90% of that when I was a kid. I was ~8 or 9 when we got our C64 (83/84). Over the next few years, I was the \"debugger\" in the family (great at finding mistakes and pattern inconsistencies), and I learned a lot from the magazines, that book, etc.. But, I never really understood memory, arrays, etc. until I got older into the x86 stuff. I did do some nice things with that old computer on my own, but nothing of what it could have done. \n\nBut, I'm in my retro era, now. Still working on a 6502 homebrew machine and programming that. :)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jmbpiano",
                                    "body": "I'm a few years younger than you and similar. The most I did with our Commodore back in the day was type in games from *Compute!'s Gazette* or use a bunch of PRINT statements and the naturally slow speed of the computer to make an ASCII art rocket ship \"launch\". :D\n\nIt wasn't until GW-BASIC on the PC that I actually started writing my own stuff.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "auto98",
                                            "body": "My proudest moment from the very early days was typing out a POKE for the speccy for Lords of Midnight and finding it didn't work.\n\nIt contained a lot of hex, so I wrote a hex calculator (literally the first thing I ever wrote) to find out how different it was from the checksum.  It was out by 1, so I (at something like 8 years old) realized the most likely mistake was an an E being an F (or the other way round, cant remember), and luckily there was only one F/E as the second of each hex pair, so swapped it over and it worked!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Smith6612",
                            "body": "Meanwhile, today, if you dare ask for Schematics or the meaning of an error code, that's deemed proprietary and confidential. I've  been banned from other IT-related groups for complaining about that very thing with APC/Schneider Electric because I kept having UPSs fail with error codes that weren't in anything but a service manual I needed to pirate to get the meaning of. Like, I just wanted to know if I need to call an electrician, or if I need to ditch that model of APC UPS. Tell me the transfer relay is breaking in the manual.\n\nI miss the olden days of computing sometimes.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "mangonacre",
                            "body": "Wow, I used my C64 for 10 years and never knew this existed!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "wrosecrans",
                            "body": "These days, the level of detail that used to be normal boring end-user documentation that everybody was encouraged to at least know existed in case they needed to refer to it later, would now be \"ZOMG, major leak of internal documents!  Secrets about product revealed, litigation in progress to get it removed!  FBI raids of hackers happening now!\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Lock_Squirrel",
                            "body": "Also the women and younglings?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ValeoAnt",
                    "body": "Now we just poke around at things and hope it works, as the documentation says 3 conflicting things in 3 different places",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Real-Abrocoma-2823",
                            "body": "I am doing it all the time with linux. In windows I would think twice before doing anything with administrator rights but on linux I do most things with root or sudo and it is way more fun to explore and learn than read full arch wiki.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mr_ToDo",
                                    "body": "Hey now, the Arch wiki/forums was a god send when I found them. So many other resources seem to make assumptions about what I have installed/done. A little aggressive at times, but super helpful.\n\nIf I could find the same sort of resources for some of windows resources I'd be so happy. Still grumpy there's really no central place for the default registry stuff(And for some reason people online get weird when you want to go in the registry)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pdp10",
                            "body": "You reverse engineer the commercial software with a debugger, and keep all the notes to yourself because your competitor uses the same application.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "grandtheftzeppelin",
                            "body": "if you get documentation at all.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thunderbird32",
                    "body": "I called a vendor for support on an old application we were using up until last year. The version we were on was from 1998, and we needed to migrate to the new version (one that didn't only support backup to floppy disk, lol). The guy that wrote it was not only still at the company but was willing to help me through the migration process, up to \"jumping on a Zoom call for moral support\" if I wanted. Luckily it was a smooth upgrade and I only needed to email him a couple times. All this to say, **some** companies still let you contact the developer directly.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MaIakai",
                            "body": "name and praise the software/company",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "the_federation",
                    "body": "Nowadays, I open a ticket with support, and they send me a link to the KB article that I directly referenced as unhelpful, then close the ticket.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "frac6969",
                    "body": "We were in a meeting where the CFO from our corporate HQ is asking all the subsidiaries to use Workiva. (I was in the meeting because it’s a “computer program”.) My boss asked the CFO to send an instruction manual so our users can learn the program.\n\nAfter a very long silence the CFO said there’s a help menu that we can go into, but my boss insisted on paper manuals. He also insisted that he gets a printout of the data that we input into Workiva and he has to sign off the printout.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jdsmith575",
                    "body": "I have fond memories of learning new products by printing out manuals, four pages per sheet, and marking them up heavily with red pen. There’s no way my eyes could do that now.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FlatusGiganticus",
                    "body": "I remember the days when computers came with schematics and office networking wasn't a thing yet for all but the largest companies and agencies.  The first coax ethernet cards I purchased cost around $1400 in today's money.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SilverseeLives",
                    "body": ">Hah - I remember in the old days computer programs came with printed manuals which went into exceptional detail, and if you didn't find\n\n\nHah. I remember when vendors actually wrote documentation period. Instead we get stuff like this for supposedly production ready features: \n\n\nhttps://learn.microsoft.com/en-us/powershell/module/storagebuscache/?view=windowsserver2025-ps",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jmbpiano",
                            "body": "{{ This space unintentionally left blank. }}",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "bentbrewer",
                            "body": "At least there’s a page for it when someone is ready to write the docs.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JimiJohhnySRV",
                    "body": "I remember RTFM.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PC509",
                    "body": "I remember ordering the demo version of Harvard Graphics on 5.25\" floppies and it came with a huge ass manual. \n\nI did love being able to call the actual devs for software and they were always available. That was even in the early/mid 90's when I was still in high school and then right after when I was starting my IT career. They were so chill back then. Now, a call with the devs, everything is my fault, our systems fault, our firewall, etc.. We check everything and it's all good, still doesn't work. They check everything, find absolutely nothing wrong, and now it works.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pentangleit",
                            "body": "I'm now picturing you flicking through a manual full of huge asses.  I dunno what's wrong with me.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "eXtc_be",
                                    "body": "there's an xkcd for everything: https://xkcd.com/37/",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jmbpiano",
                                            "body": "Never before, have I hesitated to click an xkcd link.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fost1692",
                    "body": "I was once onsite consulting for a client. They said that the thing that impressed them the most was that I knew where to find the relevant information in the massive number of manuals that came with the supported software.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OniNoDojo",
                    "body": "We had a client with an AS/400 box the size of a fridge that ran their whole inventory management. All of the custom code for it was PRINTED and in binders that filled wall to wall shelves on 3 walls of the IT manager's office. In case they needed a reference to the original code base. It was the worst tree graveyard I've seen in my 25+ years in this field.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "inanemantra",
                    "body": "I worked with a few products that I’m pretty sure support was the developer working out of a garage. The support was great.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NotTheCoolMum",
                    "body": "I have a colleague who keeps pestering me for the manual for Microsoft's Power Platform...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "djaybe",
                    "body": "I still have 3 binders for tcp IP protocol. 1400 pages?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "geekonamotorcycle",
                    "body": "You still can. Especially with FOSS projects that have support for sale.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "strifejester",
                    "body": "I remember when DRM was the manual for shit and you had enter the first word on page 97.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Belchat",
                    "body": "I tried looking these up but couldn't find such in a pdf format, nor at a local library. Could you give me a hint? I assume this knowledge has grown into other procedures / schemes etc and may be helpful, if not it's just fun to read",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "withdraw-landmass",
            "body": "I just remember people power cycling monitors when asked to restart.",
            "score": 1,
            "replies": [
                {
                    "author": "Blade4804",
                    "body": "my favorite! back in my first tech job. \"I was watching a video and it froze and i can't do anything\" \"ok ma'am just hold the power button and make sure it turns off, is it off?\" \"yes, it's off\" \"ok turn it back on\" \"it's back on but's its still frozen\" (facepalm) \"Ma'am, you turned of the Monitor not the computer\"....",
                    "score": 1,
                    "replies": [
                        {
                            "author": "borborpa",
                            "body": "Do you mean turn off my hard drive?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "kilkenny99",
                                    "body": "I think it may be regional. I know for a lot of people they called the computer itself the hard drive, but where I am they tended to call it the CPU.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "aldoushxle",
                                            "body": "In my region when I sold computers in the mid 2000s, it was known as the modem. ",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "fnordhole",
                                            "body": "And they're both very, very wrong.\n\n\nThere are folks in this subreddit who will defend calling a computer a CPU until their death.  Doesn't make them right.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Kad1942",
                                                    "body": "Not to out myself as one of these people you reference, but one is much less wrong than the other.  You can have a computer without a harddrive.  You cannot have a computer without a cpu, or its analog.  It's the defining difference between computing and not computing.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "rynoxmj",
                                                            "body": "Stop.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "techy804",
                                                                    "body": "Force Me >:D",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "derfy2",
                                                                            "body": "*holds down power button for 5 seconds*\n\nShhh... shhh.... it's ok.... just go to sleep.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Taur-e-Ndaedelos",
                                                                            "body": "taskkill /pid techy804",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "GrognokTheTiny",
                                                    "body": "I mean, wrong sure, but not *that* wrong.\n\n\nIts like if you see someone's severed arm lying on the ground you'd look pretty silly if you went \"That's a person\".\n\n\nBut if you see a severed head on the ground and go \"That's a person\" then I don't think many would fault you for that.\n\n\nAlthough I guess a better analogy would be calling a whole person a brain... which would be a bit silly...",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "auto98",
                                                    "body": "In the old days, any time there was a computer opponent in any sort of game it was called \"CPU\".  IRC even pong had it, and coin-ops all had it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "nowildstuff_192",
                                            "body": "In the local language 'round here the word for \"drive\" is the same as the word for \"small cabinet\", and when I was first starting out here everybody was using that word to mean \"desktop\", as in to refer to the case as a cabinet. I was really confused until I figured out what they were talking about.\n\nI was in my 30's and I'd never heard that word used that way before.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Charlie_Mouse",
                                            "body": "Used to get that a lot where I worked in the U.K. about 25-30 years ago - mostly older workers. Sometimes they called base units ‘modems’ instead too. It annoyed me more than I ever let on!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "EldestPort",
                                                    "body": "To be fair the base unit of their home PC probably got all noisy when the modem inside it was dialing up to the Internet.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rynoxmj",
                                            "body": "We have both still haha",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "YLink3416",
                                            "body": "> the CPU\n\nRidiculous. It's clearly \"the tower\".",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Maxplode",
                                            "body": "Had an manager like this. He was an arse and when he emailed me to ask if I can remove the CPU's from an office I was almost tempted to actually remove the CPU's but I knew in the long run it would F me in A.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Powerful-Share-2090",
                                            "body": "Yup where I am they call it a cpu. I am honestly just fascinated about where they heard that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "auto98",
                                                    "body": "> In the old days, any time there was a computer opponent in any sort of game it was called \"CPU\". IRC even pong had it, and coin-ops all had it.\n\nJust copying from where I posted this elsewhere:\n\nIn the old days, any time there was a computer opponent in any sort of game it was called \"CPU\". IRC even pong had it, and coin-ops all had it.\n\nIn effect, \"CPU\" was \"the computer\"",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "squirrel_crosswalk",
                                    "body": "Park",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DoctorOctagonapus",
                                    "body": "Yeah. Make sure it's that and not your telly.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "agoia",
                                    "body": "No, the [modem](https://m.media-amazon.com/images/I/61OMT3B6JOL.jpg) on the back of the monitor!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mc_it",
                            "body": "And you could hear the \"bit-twang\" of the CRT power change over the phone.  \n\nNowadays, noise canceling would probably block it out.  (The fact that CRTs are pretty much not being used at all, is notwithstanding.)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Blade4804",
                                    "body": "I kind of miss the sound of degaussing my 19\" CRT tho lol may need to find a yt video lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Coffee_Ops",
                                            "body": "Confession: I used to use weak magnets to mess with the screen so I could then get the pretty colors from the degauss.\n\nI've been holding that secret in for decades-- its a relief to get that out there.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RamblingReflections",
                                    "body": "I found one the other day hooked up as the monitor for a very old, seldom accessed server supporting some critical piece of legacy software when I was helping another department track down a cabling issue. I looked at it, remembering how I used to have to lug them across campus back in my first IT role when setting up a new workstation. I swear they weighed almost as much as I did!\n\nAnd here this thing was, still working, VGA cable and all, and when I heard it, I was immediately taken back to the original PC labs I worked in. I didn’t realise what a strong association I had between the high pitched electrical whine of CRTs and the lab in my first *real* IT role until that memory hit me.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "I_Want_Waffles90",
                                    "body": "I can almost guarantee that the manufacturing company I worked at for 20+ years is still using CRTs in their warehouse. Those things were damn near indestructible.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Academic_Deal7872",
                            "body": "![gif](giphy|FspLvJQlQACXu)\n\nReminds me of Roy's shirt and, \"are you from the past?\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Lock_Squirrel",
                                    "body": "You do know how a button works, don't ya? No not on clothes....",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Blade4804",
                                    "body": "reminds me of a web series called BOFH man those were fun to read lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "shrekerecker97",
                            "body": "this still happens",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "therealtaddymason",
                    "body": "Oh God yes. \"I've rebooted it three times!\"\n\nSysteminfo: \"so that was a lie\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "2FalseSteps",
                    "body": "Or back with dialup ISP support, walking a customer through rebooting their machine and \\*click!*, their phone would hang up because it was plugged into the modem.\n\nThose calls could be entertaining. At least, until they called back and got the next tech and started ranting about getting disconnected.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "auto98",
                            "body": "*Obviously* I never did this personally but back when I did tech support for a phone provider, running a PSTN line test dropped the call 90% of the time.  Never be an arse while reporting a line fault, cos you ain't getting a call back.\n\nThis was 30 years ago, don't know if it is still the same for the remaining PSTN lines.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "havocspartan",
                    "body": "I’ve had two different people at two different companies that I still talk about.\n\nOne is a lady who used her mouse as a foot pedal; like a sewing machine pedal.\n\nThe other was someone (whose DB server stopped working) who spilled their coffee while using the “cup holder” on the PC. Yes, it was the CD-ROM drive.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tymanthius",
                            "body": "Working in phone based support for cow spotted computer company.\n\nClient calls in, gives his info, so we have his name, address, phone number, etc.\n\nGets mad b/c it's something not covered by warranty (virus maybe?).  Proceeds to threaten us.  Tech lead gets on the phone and says 'so your address is XXXX?', yes, 'your phone number is XXXX?\", yes, \"And you know where we are?\", uhhhhhh \"and you just threatened my employee? In a room full of geeks who know everything about you. Think about that.\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Uberutang",
                            "body": "Sadly I’ve seen this more than once in the late 90s/ early 2000s.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EIsydeon",
                    "body": "They still do that unfortunately. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "YLink3416",
                            "body": "> They still do that\n\nI had a user press the power button on the monitor, then press the power button on the workstation. Baby steps.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wendals87",
                    "body": "Still happens today",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Upper-Affect5971",
                    "body": "i drove 180 miles round trip to turn on a monitor.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "iJcxf6ZTsDyM",
                            "body": "That's nothing, I've made that same trip to ssh into a switch while sitting in a different office for \"visibility\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Evernight2025",
                    "body": "Or hitting the degauss button on the monitor thinking they were restarting it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tonsure_pod",
                    "body": "This is a few times a week for me.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Iusethis1atwork",
                    "body": "They still do that where i work every now and then.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rynoxmj",
                    "body": "Are you trying to tell me your users stopped doing that?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "vonkeswick",
                    "body": "My last job, I'd ask people to restart and they'd close their laptop lid and open it again thinking that restarted it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Pioneer1111",
                    "body": "I still run into this. Thought admittedly it doesn't help that I supported a hospital that uses All-in-ones for anything a patient can be near, and desktops everywhere else. The monitor IS the computer in that case.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FeesShortyFees",
                    "body": "\"It's faster\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SudoDarkKnight",
                    "body": "It hasn't gone anywhere lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "_haha_oh_wow_",
                    "body": "We would simulate this one in interviews for desktop support staff lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rad_Dad6969",
            "body": "Well, I passed my A+ when job hunting for my first IT job. \n\nThey didn't give a shit about the cert. But I was able to do basic things that other applicants were not. Some of that was the cert training, most of it was common sense stuff I had known since grade school.",
            "score": 1,
            "replies": [
                {
                    "author": "K12onReddit",
                    "body": "And that's is basically the essence of certs, and degrees in general.  No one cares about the cert or degree, but they care about the studying you did along the way to get it, and chances are it makes you a better worker for having one.  Will the cert alone make you a good tech?  Of course not.  But it can give you the skills to separate from the pool of applicants who don't have it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HairyMechanic",
                            "body": "I can agree with your comment when it comes to the team hiring within IT or other IT colleagues - hell, I got an apprenticeship over other candidates who had done courses and self development because I was approachable and personable.\n\nThe problem is that certs and degrees do matter to get your foot in the door these days, especially where IT aren't in the initial phase of looking at candidates. HR are very much *\"it says you need 'x', so you need 'x'\"*, even if 'y' more than covers it or years of experience also cover it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sonicdm",
                                    "body": "When I did my hiring recently HR let me filter everyone myself. That was definitely the best way to get a team member that actually is passionate about things. 100% can recommend",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HairyMechanic",
                                            "body": "It's actually the dream, our team has had to put up with both sides.\n\nThe positive times - seamless, easy, able to recruit someone with knowledge and personability.\n\nThe negative times - struggled, narrowed down to three candidates before we even saw CVs or interviewed them, HR forced our hand to recruit one of them. Shock horror, they lasted three months.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DDOSBreakfast",
                            "body": "Certs seemed to have previously involved needing to understanding a concept and an example I'd give is Cisco CCNA where one needs to grasp networking concepts.\n\nMicrosoft certs nowadays seem to be more focused on memorizing many irrelevant things and focused more on their sales.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cantuse",
                                    "body": "MS has always been that way. I was one cert away from an MCSE in the late 90s when they changed the testing for 98SR2 or something like that. It was ridiculous because some of the questions seemed tailor made to try and highlight the miniscule changes to where things where in Control Panel.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DDOSBreakfast",
                                            "body": "I have written and passed a few of the MCSA's over the years and a few other Microsoft certs.  They've always had bull questions but at least I found some value in setting up labs and truly learning content.\n\nNow they are seemingly created by the 365 marketing team.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Secure_Quiet_5218",
                            "body": "exactly lol people kill me when they say certs are useless. No, studying to pass the exam is useless, but actually figuring what the cert is asking you to study makes it good.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "IsilZha",
                            "body": "Some people are good at test taking, but terrible at application... and others are bad at test taking but great at application. \n\nGranted they're generally out liars, but I've encountered techs with long list of certs attached to their signature and didn't know a how to do a lot of basic stuff.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "anxiousinfotech",
                    "body": "I swear most of my success has been a combination of common sense and basic logic. A logic course was actually part of my degree and probably the most useful out of all of them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Anlarb",
                    "body": "> They didn't give a shit about the cert.\n\nEmployers deliberately step around acknowledging any of your accomplishments so you don't get a big head and start trying to negotiate for a raise or better working conditions.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HuthS0lo",
            "body": "\"remember when anyone with an IT related job had a basic understanding of how computer worked and premise cabling , routing etc .\"\n\nYou mean when you had competent coworkers?  Yeah, I dont ever remember that.",
            "score": 1,
            "replies": [
                {
                    "author": "joshuamarius",
                    "body": "Ill get downvoted for this...but years ago even replies in forums were totally different. In this Sub I've noticed a swift change from solid, detailed, confident answers to simple IT questions, to more \"generalized\", \"enthusiast-based\" and \"that's what everybody else does\", generic answers.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Stonewalled9999",
                            "body": "I believe that the sysadmin thread is 10% Sysadmin and 90% \"I stayed at a Holiday Inn Express last night\" types.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "joshbudde",
                                    "body": "There's an amazing number of people here that I think are glorified form fillers, and few that actually do the nitty gritty sysadmin work.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Stonewalled9999",
                                            "body": "If you haven't killed a server cluster (or three) and a SAN and a phone system can you really be called a SysAdmin ?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MycologistWhich",
                                                    "body": "I accidentally shut off power to an entire rack of servers doing a UPS firmware update. It never even crossed my mind that the UPS would kill all power during a restart. I thought it would continue supplying power and just reboot itself. Nope. Just completely shut down power to everything. Definitely made for a stressful 5-10 minutes as everything came back online.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Meat_PoPsiclez",
                                                            "body": "I've done this, but during a battery test where the documentation for the ups specifically said it wouldn't trigger a shutdown, which was a lie.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Stonewalled9999",
                                                            "body": "sounds like you learned servers need have one PSU on mains and one in UPS eh?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MycologistWhich",
                                                                    "body": "I learned very quickly lol.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "tommydickles",
                                                    "body": "I hate gatekeeping, but I feel this sentiment. For me it'd be knowing the rush you get when you've made a configuration change that *shouldn't* cause any issues, but then you hear all the phones either start or stop ringing. But I don't make the rules.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "itishowitisanditbad",
                                                    "body": "All at once or one at a time?\n\nI'm not quite *there* yet but i've taken down some prod before",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Stonewalled9999",
                                                            "body": "once I let Dell install firmware to my PS4100 which ran most of my employer's stuff.   Then after it crashed the primacy controller Dell tried the other and kill my SAN then blamed me for \"beta\" firmware.   The firmware the Dell guy install.  Dell ruins everything they touch - Force 10, SonicWall, the M1000e chassis. the VRTX, Equalogic, and when they owned a chunk of VMware they nobbled that too.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "jgo3",
                                                    "body": "Actual conversation with the CEO:\n\n\"Did you know the Web server is down?\"\n\n\"Yes.\"\n\n\"And do you know what's wrong with it?\"\n\n\"Yes.\"\n\n\"And you know what you need to do to fix it?\"\n\n\"I think so.\"\n\n\"OK, have at it.\"\n\nSo it turns out there's a right way and a wrong way to upgrade the C libs on a running system.  When the libraries the updater depended on are gone it definitely causes a spot of trouble.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "joshuamarius",
                                    "body": "LMAO!!! 😂😂😂😅",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "maximumtesticle",
                                            "body": "How was your stay at the Holiday Inn /u/joshuamarius?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "joshuamarius",
                                                    "body": "Refreshing. I had no clue your mom could do 240 Hz.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "agoia",
                                                            "body": "That sounds like friction burn territory.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "maximumtesticle",
                                                            "body": "All caps, excessive use of exclamation points and emoji laden responses, followed by a \"your mom\" joke.  Thanks for adding nothing to the conversation bud.\n\nlol, fuck me for not wanting reddit to look like facebook, I guess?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "joshuamarius",
                                                                    "body": "No idea what you are talking about, but it was just a joke, maximumtesticle 😅",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "SudoDarkKnight",
                                                                    "body": "I can tell you are a real sysadmin by the lack of humor",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "jeenam",
                                    "body": "If you think r/sysadmin is bad, head over to r/proxmox. Every time i drop in there it's a case of the blind leading the blind.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "joshuamarius",
                                            "body": "Precisely my point! Tons of cults forming around \"enthusiast\" / \"pro-sumer\" applications and devices that make it easier for a lot more people to make the switch to \"Sysadmins\" - Yet they skip a lot of critical, important stuff that classic-styled sysadmins trained on. You can clearly see the differences!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lewkiamurfarther",
                                    "body": "> I believe that the sysadmin thread is 10% Sysadmin and 90% \"I stayed at a Holiday Inn Express last night\" types.\n\nHelp. I don't understand the second bit. What are \"I stayed at a Holiday Inn Express last night\" types?\n\n^(Edit: it's sort of shocking that this question proved controversial.)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ms6615",
                                            "body": "It’s a reference to a series of ads where “I’m not an expert in X but I did stay at a Holiday Inn Express last night” was the punchline",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "lewkiamurfarther",
                                                    "body": "> It’s a reference to a series of ads where “I’m not an expert in X but I did stay at a Holiday Inn Express last night” was the punchline\n\nThanks. I remember now. Sort of a similar ad-feel to \"There are some things money can't buy; for everything else, there's MasterCard.\"\n\n^(The takeover of cultural headspace by corporate branding is really sad, even if funny.)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DL72-Alpha",
                                            "body": "Typical [example](https://www.youtube.com/watch?v=8dOHEw8izno).\n\nHint: Nuclear Reactor",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "boli99",
                            "body": ">replies in forums were totally different\n\nthey probably didnt have a smartphone in their pocket. they'd have to own a computer, and have signed up with an ISP. (this immediately eliminates a whole bunch of lazy timewasters who didnt manage to accomplish that by themselves.)\n\nfolk would need to create an account, verify it, log in - and then post (or possibly even wait until their account was a certain age before they could post)\n\nthey might even have had to think about the question all day, before they got near a computer that was connected enough for them to post from it.\n\nthey could often form coherent paragraphs and sentences, having been used to asynchronous comms. not so much anymore. everything is 'chat' - so they only need to know how to create 1 badly spelled string of words with awful grammar in order to participate. \n\nadditionally, ignorance has become a badge of honour in some circles - for example '*im not reading all that - can't you just tell me the answer?*' aka '*tl;dr*' - some folk are *proud* not to read paragraphs. its nuts.\n\n>In this Sub I've noticed a swift change\n\nthe barrier to entry has been lowered so far that it no longer serves a purpose - its a bit like the '[eternal september](https://en.wikipedia.org/wiki/Eternal_September)' \n\npreviously there were the 'old guard' who 'knew how things were done round here'\n\nyou'd get a steady stream of newcomers, but not too many. they were managable, and could be taught 'the ancient ways' (aka told to go RTFM , or use the search field) until they became part of the guard too. \n\nbut that only works when the guards outnumber the newcomers. and that's no longer the case.\n\nthese days the newcomers are flooding in faster than they can be onboarded. its just 'log in with your google/facebook account and immediately start spouting that same question that has been asked a thousand times before in this very same sub'. anyone suggesting that 'using the search box first' might be a good idea gets shot down in flames\n\nadd to that the bots that are pushing agendas, bots that are 'promoting engagement' (i.e. asking simple questions to drive engagement with other users, aka 'more ad views'), and bots that are karma-farming so that their accounts can be sold later - and the whole landscape becomes very depressing.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Lock_Squirrel",
                                    "body": "I remember about 10 years ago on this sub, on an account that's old and gone, posting about having been in tech support for X amount of time and itching to get into a Jr. admin role, and /u/CrankySysadmin, if they're still around, looked at my list of accomplishments and went, \"There's nothing here that makes you any different than anyone else. You're milquetoast. You've done nothing that sets you apart.\" He was far less diplomatic about it, and it pissed me off. But he was \\*right\\*.\n\n10 years later, I'm an admin for a credit union. Those of us who were new and asking questions are now supposed to bring up the next line of IT folks. It's OUR job to teach them how it works. We can't just slap their hand away for asking a silly question. Demonstrate HOW to ask the question.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Bladelink",
                                    "body": "That's an interesting point about the asynchronous communication, in that it forces you to encapsulate your whole motivation and purpose for contacting the other person. If people 20 years ago started a message chain with \"hey\", then a simple chat would take 3 weeks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "tech2but1",
                                    "body": "And people used to use the shift key!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "boli99",
                                            "body": "tl;dr",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Xambassadors",
                            "body": "I think that's you remembering the good replies from back then and filtering out the bad ones. Never forget the rule of \"90% of everything is shit\".",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RikiWardOG",
                                    "body": "That's definitely what it is. rose colored glasses and heavy dose of nostalgia. I think the actual issue is sysadmin is a catch-all term for IT Ops people. Don't have a title that fits your job all that well? Then you're a sysadmin. MDM, Azure, on prem, sass, aws, software, hardware etc its all just lumped in together and people want to play gatekeeper instead of contributing they spew hatred",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "tech2but1",
                                    "body": "I am guilty of this. There's a couple of pet peeves of mine that I thought \"didn't happen in my day\". Looking back at old threads and posts from years back (and even from printed media) some of those peeves still exist so it's just me, I've become some miserable moaning curmudgeon.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "UltraEngine60",
                            "body": "> but years ago even replies in forums were totally different.\n\nQuestion: How do I use PowerShell to call native Win32 libraries?\n\nBefore:\n\n> You need to do *this*, and you need to do *that*, here's a doc link: (link).\n\nNow: \n\n>Why would you need to do that? That's a stupid way of doing it. (leaves no solution)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "fearless-fossa",
                                    "body": "Nah, you're making that up. The before section was 99%:\n>Learn to use the search function.\n\nYeah there were generally some useful answers around, but often enough mods would just close threads because they remember there was a similar question asked five years ago in a thread that won't come up unless you use three keywords that have nothing to do with the topic and are misspelled on top of that.\n\nOn the other hand some of the most informative posts ever can be found on Reddit, although most of them were around in the earlier days when there were still mainly enthusiasts and professionals on Reddit and shitposting less a culture that would be carried into every sub no matter where you are.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "srbmfodder",
                            "body": "There are a lot of people that would rather just sound smart than be smart.  It's a lot easier to parrot than actually learn how things work, unfortunately.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "joshuamarius",
                                    "body": "To add to this; you now have a ton of pro-sumer/enthusiast software/hardware that allows you to get pretty far with very little knowledge.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "srbmfodder",
                                            "body": "I believe it.  I'm out of the industry now, but a lot of pointy double clicky and we are there type stuff is out there.  I worked with a guy who built his whole career on doing everything manually, like double clicking every installer one at a time to build a work PC, and then he got fired because he was behind by about 3 years.  Anyone with modern imaging and install tools even building their environment from scratch would have them done in days or weeks.    \n  \nI'm a Cisco snob, I \"grew up\" on it, and I always feel a tinge of pain when I see Ubiquiti in a business.  I'm sure it does fine.  I've recommended them to people even.  Sometimes it seems like their wifi is really struggling.  Of course, they paid a fraction of what they'd pay for Cisco, unless they used older gen stuff, like I do in my house!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "joshuamarius",
                                                    "body": "UniFi stuff is the perfect example of this Topic. I've installed almost every line of their product, but when I get into the more complex corporate stuff, there is no way I would use their gear. A lot of it is overpriced. But again...talk to somebody who swears by Ubiquiti/UniFi stuff; you would think they had every Cert out there and know every thing about corporate networks. Prosumer stuff has seriously changed the IT World.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "srbmfodder",
                                                            "body": "Yeah, I've advised people on bridges and stuff like \"I want this by my pool\" and it was perfect.  \n\nThen I know someone who's coworker was hellbent on installing it in their 12,000 user/endpoint network and it fell right on it's face.   They are ripping it out.  Not cheap.  \n\nLike man, if it was that easy where I could pay 20% (a guess) for what I need this network to do, I'ld be all over it.  Of course I drink the Cisco Koolaid, but the amount of times I've had their stuff just never die or fold up when lesser stuff would.... well it's a lot.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WWWVWVWVVWVVVVVVWWVX",
                            "body": "I think a lot of that has to do with the fact that younger people don't use google anymore; they use social media as a search engine. Nothing inherently wrong with that, but it does clog the sub up.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ResponsibilityLast38",
                                    "body": "To be fair, have you used Google lately? Its gone to absolute shit, and the easiest way to get useful info from it is to use it to search reddit. Dont get me wrong, first rule of IT club is RTFM and a lot of people cant be arsed to even look at the onsite documentation anymore. But google has fallen victim to enshittification.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "RevLoveJoy",
                                    "body": "> Nothing inherently wrong with that\n\nHard disagree.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kwuahh",
                            "body": "I also think this is in part due to the increased complexity of systems. A lot of applications are no longer open-book, simple solutions but instead are a network of different components which are proprietary and require in-depth knowledge to grasp.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "anyAnomaly",
                            "body": "And I'm asking for downvotes myself by voicing this, but all those 'generalized' answers are just bot spam.\n\nAll of those are just useless regurgitated crap from google/reddit searches that you would immediately get if you typed that question into search engine of your choice.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "joshuamarius",
                                    "body": "I agree. But the scary part is seeing how many people give advise or have their setups, maintenance cycles and jobs based on this mentality and what they have learned online. Even scarier is that when they share this knowledge, they do it with the utmost confidence; like they have a PHD on the subject.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheAfterPipe",
                            "body": "That's because years ago you *could* have confidence that the direction you were providing was correct. Back in the WinXP days (and earlier), I could navigate the system with my eyes closed. Now, everything is so customizable, and there are so many more points of failure, you can tell someone how to reasonably check certain things, but there could be an extra dialogue box between you and the configuration, there are four different paths to getting to the settings if you're going through Control Panel vs. Settings from the Start Menu, want them to take a particular action within a web app? You can direct someone, but any number of network- or server-related messages could pop up to give you erroneous info or some telemetry data notification that is just not expected.\n\nComputers used to have a lot less going on and were so much easier to be confident about.\n\n  \nAt this point, the best I can give someone for an answer is \"Click this and *you should be able to do* xyz\".\n\nYears ago, I could just take a phone call while I was shopping and walk someone through to fix their problem. Now, I can't because of all the unique customization options, network issues on webapps, or random telemetry notifications.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Cory123125",
                            "body": "I think this has been an observation listed in multiple computer related fields.\n\nI imagine its more to do with the increased segmentation of computer specialties and normal users.\n\nThis means that in a more public setting, you'll have people just looking in, and people really in it not really participating as much. Like the wall between professional, hobbyist and random individual is even larger.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "auto98",
                            "body": "\"I have X problem\"\n\n\"Just reinstall windows\"\n\nThat annoys me more than anything, just on the sheer passiveness of it, and the unwillingness to actually work out what the problem is.  In my opinion, it is the reason so many \"techs\" know so little compared to 10/20 years ago.\n\n*On an entirely unrelated note, why the hell isn't my spellcheck recognising \"passiveness\" as a word",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PC509",
                    "body": "I remember... That we always had that one guy that didn't know shit, but hyped himself up to be the best. Anything he did wrong or didn't know, it was put on someone else. He'd say he had to \"look into it and to call back tomorrow\", but he didn't work tomorrow... I did. Or he'd make a change on something then claim he didn't know anything about it... Couldn't answer basic or advanced questions without a ton of bullshit going round and round. \n\nThen there were the SysAdmin Gods. You could be a great admin, but these guys come out of the shadows and could do anything and everything. Just brilliant. And, they were an open book with anything you wanted to know or learn. It was excellent. They also didn't know everything and would come to you for your expertise, like a real team. Made you feel smart, never put you down, helped out with anything, asked for help from you because they know you want to learn it, just an all around great person.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HuthS0lo",
                            "body": "People who won’t give up their secrets are always phonies.\n\nIf you’re good; you won’t ever be replaced.  So there’s no reason to be guarded.  If the person that asks, understands what you taught them; you should be proud of that; not scared that they’ll replace you.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "leehofook",
                            "body": "And always referred to himself as a guru!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CollegeFootballGood",
                    "body": "Most people I’ve worked with have been really smart.\n\nHowever, I’ve worked on a few help desk call center jobs where I’m shocked they were hired. One guy said he had 8 years experience but the dude was younger than me. His troubleshooting was crazy. Our boss cut him right before his 90 days",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rootbeerdan",
                    "body": "They just moved to fields that paid better. Most I know went \"DevOps\" and are now \"SRE\" or went all in on programing and pivoted to UNIX and lower level programming (which is actually really easy for a lot of older school techs I know because they have a lot of fundamental knowledge about how computers actually work, even if they don't realize it).\n\nIf you just float around as a Sysadmin you are basically useless to most companies because they just need someone to click buttons on a website for their fancy SaaS platforms, the standards are just really low now because of how easy it is, and the rest of the companies with complex environments now just employ consultants that do the bare minimum and just move everything to SaaS platforms.\n\nExample in Networking I've noticed as someone who does consultancy on the side: nobody needs a network team when everything you need is one click Unifi or you hired developers that could on-house their own solution, security vendors are a joke outside of highly optimized cloud environments (good luck telling a regular sysadmin you need confidential compute or immutable infrastructure, that's obscure knowledge even in this sub for a reason), and in general most sysadmin jobs are glorified manager jobs which are now on the cutting board since you don't need to be technical to run an IT department anymore.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "punklinux",
                    "body": "Yeah, it amazes me how little networking skills a lot of programmers have. Basic stuff, like DNS, ICMP, subnet masks, and gateways. Just last week, one of the app developers for a client had an issue where they couldn't connect to the server, and wanted me to \"remove the firewall.\" First, no. Second, I asked what IP they were trying to connect to?\n\n\"0.0.0.0\"\n\n\"That's not an IP.\"\n\nIn a conceding tone, \"Uh, yes it is. It means ANY and ALL IPs, okay?\" \n\n\"So how does your client application connect to a specific IP?\"\n\n\"I want it to connect to any IP, not just a single one. Can I speak to an actual technical person?\"\n\n\"Just think about the client. The client wants to connect to a server. How does it know what IP address it wants to connect to? If you wanted to call someone on the phone, you need to know the specific number. You can't just call seven zeros. Just try and put \\[the server's external IP\\] nex to \"APP\\_SERVER=\" and see if it connects.\"\n\n\"Jesus Christ, kid, Get me an adult on the phone!\" \\[I am 46, FWIW\\]\n\nMy boss spent about 5 minutes with him, and later told me, \"I asked to speak to HIS boss, and \\[his boss\\] said he wasted an hour of our time, which he will take out of his paycheck if didn't follow or even try our simple directions. He put the server IP in there, an voila!  Connected!\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "punklinux",
                            "body": "Ooh, another one I run into ALL the time.\n\n\"I can't ping the server.\"\n\n\"AWS has ICMP disabled. You can't ping anything, but I assure you, the system is up. I am ssh'd into it right now.\"\n\n\"This is TCP/IP. I tried the address, the spelled out IP \\[he meant domain name\\] and everything.\"\n\n\"Ping is disabled. ssh is not. Try to ssh into the box.\"\n\n\"But I can't ping it!\"\n\n\"Can you ssh into it?\"\n\n\"If I can't ping it, I can't ssh into it.\"\n\n\"Try to ssh into it.\"\n\n\"... It says WARNING: REMOTE HOST IDENTIFICATION HAS CHANGED! See?  It's down!\"\n\n\\[sigh\\]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jgo3",
                                    "body": "I once complained to the college's (!) network manager that outgoing connections were taking a long time to set up because it had to wait for the remote system's reverse DNS lookup to time out, because we weren't running reverse DNS on the NAT pool.  \n\nHis response was \"Someone else tried to tell me about that once but I just don't see what it's good for.\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Geminii27",
            "body": "You kind of had to. Most computer jobs needed that knowledge to be able to do, well, the job.\n\nThese days you have 'helpdesks' which are untrained script-readers about to be replaced by AI, and increasing numbers of theoretically-IT jobs that never touch anything technical and spend most of their times in meetings or updating project management documents.\n\nRoot cause analysis is nearly a lost art - so many 'fixes' or how-tos are little more than the modern equivalent of chanting and waving a chicken over a cauldron.",
            "score": 1,
            "replies": [
                {
                    "author": "Kodiak01",
                    "body": "> Root cause analysis is nearly a lost art - so many 'fixes' or how-tos are little more than the modern equivalent of chanting and waving a chicken over a cauldron.\n\nHey, [RFC 2321](https://datatracker.ietf.org/doc/html/rfc2321) has a very high reliability rating!\n\n>Specific Problem Methodologies:\n\n>Physical Layer: Wave RITA unit towards malfunctioning components.\n\n>Network Layer: Wave RITA unit towards malfunctioning  components.\n\n>Transport Layer: Wave RITA unit towards malfunctioning components.\n\n>Application Layer: Strike product vendor representative (or programmer, if available) with RITA, preferably on the top of the skull, while shouting, \"Read The Fine RFC's comma darn it!\"\n\n>Political Layer: Strike advocates of disruptive or obstructive policies with RITA, preferably on the top of the skull. In extreme cases insertion of RITA into bodily apertures may become necessary. WARNING: subsequent failure to remove RITA\nmay cause further problems.\n\n>Religious Layer: Strike advocates of disruptive or obstructive religions, and their vendor representatives, with RITA, preferably on the top of the skull. In extreme cases, the RITA may be used as a phlactory, funerary urn, or endcap for bus-and-tag cables.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Unboxious",
                    "body": "> Root cause analysis is nearly a lost art - so many 'fixes' or how-tos are little more than the modern equivalent of chanting and waving a chicken over a cauldron.\n\nThere's always been a decent amount of this. Ever let Windows XP diagnose basically any problem?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shelfside1234",
            "body": "I remember, and yearn for, the days when people in IT would see an issue and troubleshoot it for themselves",
            "score": 1,
            "replies": [
                {
                    "author": "LoveTechHateTech",
                    "body": "My technician kicks dead simple tickets up to me with no notes. I ask what they did to troubleshoot, they say “nothing” and then walk off.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_T_Gamer",
            "body": "These days are long gone...  We hire on designers that will then ask for help with software in their specialty,  \"Revit\", \"Solidworks\", etc. its a good time!!  /s\n\nAnd this isn't \"it doesn't work\" type questions, think more like, \"how do I do this\" type questions.",
            "score": 1,
            "replies": [
                {
                    "author": "bulletman360",
                    "body": "The amount of times I’ve had to teach accounting how to do certain things in office/Excel is mind-boggling. This is literally part of your job description to know how to do this.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Bladelink",
                            "body": "Back when I was a tier 1 support type guy maybe 12 years ago, I recall helping some hideously inept user who had to ferry adobe docs around with revisions, comments, suggestions, that type of thing. She did her job by basically following an actual laminated page of steps on what to do in Acrobat. \n\nLong story short, after an update to Acrobat, she had no idea wtf to do. I eventually had to straight up tell her \"I only know as much as I've mentioned this far. Anything in Acrobat past this point is where your job starts.\" Like goddamn, have some responsibility for your own competence.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sir_mrej",
                            "body": "Seemingly it's literally not part of their job description, and their boss doesn't care.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sy5tem",
                    "body": "So many times, its crazy!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ChabotJ",
                    "body": "I'm in the engineering industry and I get this so often. How have you spent 20 years in this program and you're asking me for help?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NoNamesLeft600",
                            "body": "You should try working for lawyers (not so much the young ones, but the older ones).  These are well-educated, smart, seasoned corner office guys who have gotten rich from their knowledge.  Then you set them down in front of a computer.  Suddenly they have the intelligence of a babbling 2-year-old.  And take out their frustration on IT.\n\nGlad those days are well behind me!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ReputationNo8889",
                    "body": "I regularly have to show marketing folks how to export a pdf from Photoshop. They only converse in psd files, so using anything else breaks their reality.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Killstick",
                    "body": "I had a VP ask me to teach him how to use excel. Fuck that shit. Told him it's not my job to teach him how to do his job.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Best_Taste_5467",
                    "body": "I get so so so fucking tired of this. Like motherfucker if I was a accountant then i would be in accounting. You SHOULD KNOW HOW TO WORK THE SOFTWARE!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "QuesoMeHungry",
                    "body": "I have to keep telling myself those days are gone. I still think of anyone working in tech as someone who is tech minded and has passion for the industry. Now you have developers who don’t know the first thing outside of their specific programming languages, when back in the day to be a developer you had to understand all the underlying fundamentals.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NorthStarTX",
            "body": "At this point I'd settle for people having a basic understanding of filesystems to the point where they can remember where they put stuff.",
            "score": 1,
            "replies": [
                {
                    "author": "pdp10",
                    "body": "They don't even have to remember if they can use `find` and/or `grep`.\n\nThat's what people used to mean when they said they didn't know the answer, but they knew how to find it. With `find` and `grep`, not Perplexity LLM.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NorthStarTX",
                            "body": "Eh, tools are tools. From a \"getting things done\" perspective replacing local tools with LLM equivalents should be the equivalent of replacing a slide rule with a calculator.\n\nBut if you don't understand filesystem basics, `find` isn't going to help you if you don't know to search in the context of `/`.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bio_Hazardous",
                    "body": "I install Everything by default on every system to counteract this exact problem. Now I have yet to solve the subsequent issue of \"oh uh I don't know what I called it lol\"...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "themanonthemooo",
            "body": "https://preview.redd.it/4zflve8owfpe1.jpeg?width=1170&format=pjpg&auto=webp&s=dec7c1e0030f07b29fae60c798c39ef8606a5d34",
            "score": 1,
            "replies": [
                {
                    "author": "Ytrog",
                    "body": "So, the state of a USB is `│up⟩ + │down⟩`? 🤔",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NotATypicalTeen",
                            "body": "Bra-ket notation in my sysadmin subreddit? It’s more likely than you think.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "geekg",
                    "body": "USB A plugs should typically conform to the standard. If the USB fork logo is on top that is the way it goes into a standardized USB A port. If the port is vertical though, all bets are off.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ChrisC1234",
                            "body": "But the problem is the ports.  I've seen devices with the ports not all oriented the same way.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "doubled112",
                                    "body": "Yes.  I have a few mini PCs where the ports are upside down.  I guess they wanted me to mount them to the underside of my desk?  It is both the USB and HDMI ports",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DoctorOctagonapus",
                                            "body": "I don't think so, it's more likely lazy design or two teams not talking to each other. The intended orientation is memory DIMMs and board connectors on the top, but case designers want the removable cover on the bottom. Simplest solution: flip the board and mount it upside down. That way you only need to remove one cover in order to install memory, storage, etc.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "doubled112",
                                                    "body": "You're probably right.  The labels for those ports on the case are not upside down.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SGgrafix",
                            "body": "That's assuming I'm even looking at it while I'm attempting to plug it in the 1st time.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RevengyAH",
                    "body": "😂😂😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YahenP",
            "body": "Basic knowledge in my \"good old days\":  \nAbility to glue a torn magnetic tape.  \nDisassembly, wiping contacts and assembling the processor unit basket. Soldering, of course. Ability to find the phase in the socket.  \nSkills in transporting fragile and large-sized items, worth an apartment.  \nAnd also sacred tribal  knowledge, about the ability to make patches in software using scissors and a hole punch.  \nAnd then these \"new generation IT guys\" appeared, who can only connect several computers with a cable, and insert a plug into a socket. And then press a few keys on the computer to \"set it up\".  \nThis is how it looked in the 2000s, from my point of view. Times change, and so do basic knowledge.",
            "score": 1,
            "replies": [
                {
                    "author": "Redemptions",
                    "body": "How are your knees this morning chief?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "YahenP",
                            "body": "They died many years ago. And so did the back.  \nDamn, I miss the days when the user session would show how many meters of paper were available for printing  for you.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Anthony_Roman",
                                    "body": "i have reddit solely to read and learn about things like this. thank you.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Redemptions",
                                    "body": "Hopefully you have since retired to your alpaca farm. Thanks for blazing the trails for us.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "YahenP",
                                            "body": "I wish I could, but no. Right now I'm closing task #232. Life is unpredictable and sometimes dangerous. But interesting. So no farms, no alpacas.  \nAnd the path... the path was paved by those who are much older than me. I am more from the generation that got into a period of rapid growth, not innovation.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Jealentuss",
                                    "body": "Respect.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "north7",
                    "body": "If you aren't manually setting IRQs are you even *in* IT?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ProtectionSubject615",
                            "body": "Don’t forget setting the memory space for your scsi adapter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "north7",
                                    "body": "I'll show you my config.sys if you show me yours.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "brother_yam",
                            "body": "At least when you set an IRQ via DIP switches, IT STAYED SET",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tymanthius",
                    "body": "My mother was a punch card programmer.\n\nAs of ~2005 her program was still in use at our state DOT.  Modified, but the core was there.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "brother_yam",
                    "body": "Card sorters FTW!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DoctorOctagonapus",
                            "body": "\"Sorry we couldn't run your program, someone dropped the stack of cards and we don't know what order they're meant to be in.\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pdp10",
                    "body": "I was with you until 2000s. You were hanging reels in the 2000s?! You were using *cards* or paper tape in the 2000s? Was this a national defense system? Blink twice if you can't talk right now.\n\nHere I was on my dinosaur herders to stop using chain printers as their primary output device in the 1990s.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "YahenP",
                            "body": "No. I just moved this topic to 2000.  If Reddit had existed back then, I could have been in the OP's place and discuss about young professionals.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RabidBlackSquirrel",
                    "body": "> Soldering, of course\n\nIt's funny, we had a server that had several bad solder joints from the factory (HP, nough said) just a couple years ago. Guys ask \"uhh so who knows how to solder? We can't wait for RMA.\" \n\nTurns out, it's me and only me. Brought in my station and ordered a nice roll, reflowed those joints, machine booted right up. After having gone into management and had my hands off for a number of years, it felt good to do cool shit again. \n\nAlso soldering is fun. I was pretty well practiced from doing a Bottlehead Crack tube amp build recently too, which was incredibly fun and fulfilling.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "richf2001",
                    "body": "DIP sweet switches.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "anonymousITCoward",
                    "body": "lol i remember needing to change the IRQ's to get a sound card to work",
                    "score": 1,
                    "replies": [
                        {
                            "author": "YahenP",
                            "body": "And you also inserted some p-n-p network card made by a crooked manufacturer into the computer, and at the first boot after that, Windows 95 happily wrote \"65535 new devices detected\", and configured p-n-p devices so that they began to conflict with those where irq was set manually.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "anonymousITCoward",
                                    "body": "Windows 3.1, and it was a  modem... besides that every thing conflicted with every thing else... it was the wild west back then lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "anonymousITCoward",
                    "body": "lol i remember needing to change the IRQ's to get a sound card to work",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StarSlayerX",
            "body": "Never took the A+ in 2010s... got my experience with MSP bootcamp. 50-60 hour work weeks and a whole lot of coping.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dirtyredog",
            "body": "replaced by code camps and everyone being expert job hoppers",
            "score": 1,
            "replies": [
                {
                    "author": "GoogleDrummer",
                    "body": "> everyone being expert job hoppers\n\nI mean, that's not really anyone's fault. It's just the only way to get any sort of substantial raise.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Conscious-Rich3823",
                            "body": "That's true across all industries. I worked in fundraising for the past five years and job hopping is the only way to get a better title and higher earning potential. Companies incentivize this behavior.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "rosseloh",
                            "body": "Doesn't mean we have to like it. :(",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Best_Taste_5467",
                    "body": "I once got into a argument with a CCNA that didnt know he could have multiple putty sessions open. I wanted to shoot myself.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dirtyredog",
                            "body": "wow wait until he hears about tmux :mindblown:",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Kodiak01",
                    "body": "> everyone being expert job hoppers\n\nYou can expect that [to significantly decrease](https://allwork.space/2025/03/job-hopping-loses-its-payoff-as-salary-bumps-all-but-vanish) for the foreseeable future.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bascule",
            "body": "The A+ exam originally had a lot of crazy details you had to memorize, like the structure of the hives of the NT4 registry, and all of the steps of the laser print process.\n\nThat was removed around the late '90s.",
            "score": 1,
            "replies": [
                {
                    "author": "claytonjr",
                    "body": "I managed to take and pass my a+ on the last day it was available in 1999 or 2000? The one that was based on win3.1, and maybe 95? After that it was being updated to the newer stuff. I had some experience with nt4, but don't recall that stuff on the test. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BloodFeastMan",
            "body": "Used to go to the geek store, rub elbows with other geeks, buy a box of parts, go back to the shop, make a computer, install OpenBSD, and then configure a router box, email / ldap server, whatever. I remember coming back one day, and showed one of the guys a HDD I just bought .. I told him, \"3.6 gigs baby!\". Those days were fun.",
            "score": 1,
            "replies": [
                {
                    "author": "pdp10",
                    "body": "It used to be that when you bought new hard disk [drives](https://en.wikipedia.org/wiki/Disk_pack), everyone would ask when the liftgate truck was scheduled to arrive.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "k8mnstr",
            "body": "As a BOFH, I mourn the loss of our profession. The amount of “Senior Staff Engineer”s that cannot navigate a command line much less tell you the basic 101 of how a POSIX system functions is staggering.\n\nI know I’m a dinosaur complaining about change, but I deeply miss the industry I used to work in. You used to actually have to understand how shit worked.",
            "score": 1,
            "replies": [
                {
                    "author": "Regen89",
                    "body": "Buddy it's barely 9 am, you can't trigger me like this before I've been through a single meeting, the only words you left out were cyber security",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kodiak01",
                            "body": "I've been stuck in the same Monday morning, 8:53am, since August of '93.   I'm never disappointed that way!  If it's a bad day, it's exactly what I expected.  If it's a good day, it's a pleasant surprise.  Either way, I'm prepared.\n\nWhy this exact time and day?\n\nIt's Monday.   You're sitting at your desk, head down, digging into the never-ending slog.  You reach for your coffee, bring it to your lips, and stop just short.\n\nYou look to the left.\n\nYou look to the right.\n\nYou look to the left.\n\nYou mutter to yourself, \"Fuuuuuuuuuuuuuuuck...\"\n\nAnd you continue with your day.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Pallidum_Treponema",
                    "body": "Dude, I have a \"Senior Windows Sysadmin\" coworker that can't even figure out basic shit like changing the hostname of a client without googling.\n\nThe sad thing is that he's senior because he's spent almost 30 years as a sysadmin.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NotMyUsualLogin",
            "body": "No - I had zero formal training yet I was fritzing with soldering 25 pin RS-232 cables, joining IPX/SPX DOS Workstations running with Novell with our Ethernet System V Unix system, doing UUCP transfers under Cron from our Satellite offices etc., all in the early 1990s.\n\nStill had no idea on how a computer actually worked behind the scenes - just what I could do with it.",
            "score": 1,
            "replies": [
                {
                    "author": "Kodiak01",
                    "body": "> fritzing with soldering 25 pin RS-232 cables, joining IPX/SPX DOS Workstations running with Novell with our Ethernet System V Unix system\n\nIn high school (Vocational, Data Processing shop) in the early 90s I rolled out a coaxial ARCNet topology throughout the shop and hooked it up to a 386 running Unix and later Netware.\n\nThe year before that, it was a year of COBOL on a B1900, with a year of double-ledger accounting to go with it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unable-Entrance3110",
            "body": "When we were hiring a new helpdesk person, I sat in on the interviews. The one question that I added to the interview was \"What does your home computing setup look like?\"\n\nI was sort of amazed at how many people didn't even have a computer at home...\n\nWe didn't hire any of those people.",
            "score": 1,
            "replies": [
                {
                    "author": "Grizzalbee",
                    "body": "My home PC and server have been disconnected since i moved 2 years ago. I have no desire to futz with anything more complicated than a playstation in my off hours.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Unable-Entrance3110",
                            "body": "Yeah, but you aren't applying for helpdesk / entry level positions are you?\n\nIt's one thing to no longer want to look at computers after years in the trenches, but when you are just starting out, I want to see that passion on display.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yeehawjinkies",
            "body": "I don’t have the A+ guess you’re talking about me",
            "score": 1,
            "replies": [
                {
                    "author": "Visible_Spare2251",
                    "body": "90% of the information you have to memorise for A+ is not useful in real life.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SousVideAndSmoke",
                            "body": "What IRQ does the floppy drive take?\n\nTimes I had to know that outside the test, 0.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jcpham",
                                    "body": "I guess 6",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "K12onReddit",
                                            "body": "Not sure if you're just joking, but that's correct.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Kodiak01",
                                                    "body": "It is possible to manually reassign the IRQ of a device or port as well, but as for why someone would WANT to, I do not know, other than it being occasionally necessary back in the Athlon days when you could have a slot assigned the same IRQ as USB for example.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "UMustBeNooHere",
                                    "body": "Now that's a name I've not heard in a long time...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "yeehawjinkies",
                            "body": "I studied at the MSP university where you get thrown into fires on day 1.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "utopia8102",
                            "body": "I still know IEEE1394B and it's intricacies, number of devices you can daisy-chain off one connection.\n\nSuper useful stuff /s",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Conscious-Rich3823",
                            "body": "I've noticed that I'm learning more on the job rather than any of the studying I'm doing for my cert.  I'm sure it's usefull to know different speeds and sizes with devices, but in reality, most people in the workplace are not engaged in needing to weight those things daily. \n\nWhat I'm trying to say is that I agree with you, the A+ just tests your ability to memorize information in the short term and also test well.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "HairyMechanic",
                            "body": "I got forced to rush through A+ in 2018 before they updated it to be more relevant, so I don't think any of my A+ was useful!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "scarlet__panda",
                    "body": "I also do not have the A+ lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "yeehawjinkies",
                            "body": "A+ is a scam lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "smiffer67",
            "body": "Been doing IT that long I remember buying shit loads of books to learn how to do things. My first IT certification was MCP for DOS 6.22 & WfWG 3.11.",
            "score": 1,
            "replies": [
                {
                    "author": "TechBitch",
                    "body": "I still have those books on my shelf.  Along with my NT 4 books, 98, 2000, and so on. And all those dummies books, because dangit, lots of helpful tips in those things.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tamrail",
            "body": "Yes and I also remember the rash of paper MCSEs in the 90s",
            "score": 1,
            "replies": [
                {
                    "author": "Turbulent-Falcon-918",
                    "body": "Related i have been teaching myself sap because so many people hound me on how to even though not my job … so the first video i watch the most like comment was “dont know sap lied to get the job and need to learn” the most popular reply “i just call the it people and make them show me, if they can not  i just complaintheir boss they are not helpful”\nI wartched the first video and it wasa good video but told me stuff i Already knew  and had not even logged into sap: juT  what it is , who produces and what it does \nAnd i am like “merit based pay system my ass “",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PC509",
                    "body": "Some of those are the \"fake it until you make it\" and they actually made it and are successful admins now. Others are working as carpenters now. :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReputationNo8889",
            "body": "I remember users beeing able to navigate a UI with a mouse\n\nAnd hell, we have network admins that dont even know how routing works, never mind what an ARP table is.",
            "score": 1,
            "replies": [
                {
                    "author": "Turbulent-Falcon-918",
                    "body": "Yea there was a time you could say on most things what the issue is and tell them where to fix the problem or how , not literally walk them through literally step by step … not really related but simpe example — oh that display issue is either driver , setting or hardware : update and post boot eliminates  the first two then go through  the display setting verse ok so right click kn the desktop, sorry i mean an empty space , now you are still right clicking on am icon , ok just click on the window start logo , its located at the far left of the task bar … ok at the bottom of the screen is a task bar , on one side is tome day and date opposite  that is  the window start logo : no oppsite the day date and time",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mnemoniker",
            "body": "While I share your gripes, I think the path to competency is less clear now than it's ever been and it will only get worse. I didn't need to learn about cloud computing when I started because it didn't exist. Now it is arguably where you can start, if all you want is to be employed (and annoy your broadly skilled coworkers).",
            "score": 1,
            "replies": []
        },
        {
            "author": "tsaico",
            "body": "I am shocked at how many people in our industry that have zero understanding about DNS.",
            "score": 1,
            "replies": [
                {
                    "author": "wwbubba0069",
                    "body": "especially when its always DNS.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nl-robert",
            "body": "I learned 25 years ago that soon IPv4 would be exhausted. Nothing changed.",
            "score": 1,
            "replies": [
                {
                    "author": "Unable-Entrance3110",
                    "body": "Actually IPv4 is exhausted now. as in, there is no more IPv4 that doesn't belong to someone.\n\nThat's the reason we now have such things as CGNAT.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "_skimbleshanks_",
            "body": "Specialization is a bitch, indeed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "New_Set7087",
            "body": "I do remember those days. Long gone they are. I was that kid at 18 who had to get A+ lol. Now I’m in DevOps. Time has flown.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad_Copy_9196",
            "body": "I heard stories about new interns not knowing what a folder structure was or how they worked. I am so glad to be working in a small team sometimes LOL",
            "score": 1,
            "replies": [
                {
                    "author": "wwbubba0069",
                    "body": "I would hope that IT oriented would not be like this, but it could be due to how schools are handling tech now.\n\nI know most of the young (20-sometings) that have come into the office over the last couple years, windows is foreign to them. Give them an iPad and Google Doc's they are golden. Set them in front of Windows and they are lost. Last couple clerk temps couldn't type for shit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "juanzelli",
            "body": "So much trial-and-error for me back in the 90s and 00s. So many cables, connectors, cards, and boxed software collected.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ObiLAN-",
            "body": "Yea... i had to show an ISP tech 2 months back how to set his laptops static IP so he could configure their modem.\n\nLike i get it, dudes a cable puller and was great at that, but like damn, thats the last 20% of their job duties just missing from their skill set.\n\nI also have had a T1 support team member ask me what AUX was and where it plugs in...\n\nI also find software devs are 50/50.  Either they have a \"i dont need to know how the hardware works\" attitude,  or they know more than the basics lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "countsachot",
            "body": "I'm still generally annoyed when someone doesn't know what a register is. Does that count?",
            "score": 1,
            "replies": [
                {
                    "author": "texan01",
                    "body": "cash, air, or compute?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AmateurishExpertise",
            "body": "We went from an artisan craft studied by the socially awkward smartest people off in their tiny back rooms motivated by a desire to make the world a better place, to a hot career option for undergraduates who didn't want to be doctors or lawyers. Love for the craft, and comradery with our peers in this thing we do, are two of the biggest things I miss from the old days. I can still smell the cafeteria at Bell Labs. Sigh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "liquid00level",
            "body": "Are you getting at something like you’re working with folks in IT that don’t have basic understanding of this stuff?",
            "score": 1,
            "replies": [
                {
                    "author": "NoSellDataPlz",
                    "body": "Exactly. We’re not mind readers, here. Out with it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GNUr000t",
                    "body": "Competent people are not given W-2 work anymore. Those positions go to zoomers who don't even know what ssh is.\n\nI'm lucky to get 1099 table scraps after said zoomer introduces ransomware with the domain admin account he was given.\n\nI stopped getting callbacks for IT positions after I turned 23. They only want young people and unfortunately young people don't know how to use a computer except to dance in front of it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AngELoDiaBoLiC0",
            "body": "I had a user pull out an AS/400 command on me during a remote sesh!!I was like WHOAH!!!\n\n![gif](giphy|U3t66z4OHIH7i)",
            "score": 1,
            "replies": [
                {
                    "author": "wwbubba0069",
                    "body": "IBM iOS, its a whole other animal lol. Few years back when we changed firewall brands I was working out some tunnel issues, firewall help tech was like \"what is that, that's not Linux\"... no, no its not lol.. ended up in a 10 minute tangent. He learned enough to decide he never wanted anything to do with it lol.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Unable-Entrance3110",
                            "body": "Wouldn't that be AIX not iOS?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "518doberman",
                    "body": "I work in local government and we still use it for our finances. Migrating away this year!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Fortune6415",
            "body": "There’s the other side to this.. smart people who do know how computers work but their day to day job isn’t infrastructure. All of a sudden, if a reboot fixes something, it’s not enough. They want to know why. Oh they have a problem? They have 3 ideas they give you on how to proceed on the ticket they’re raise before you’ve even spoken to them. \n\nSometimes, I wish my users were simple. Sometimes.",
            "score": 1,
            "replies": [
                {
                    "author": "YLink3416",
                    "body": "That depends heavily on the user. Sometimes I'd prefer that over the user who just wants thing fixed and move on. Especially if it's an intermittent issue. \n\nWhile their suggestions are often wrong. You can, read between the lines and extract context clues from what they believe to snag a root cause. Which will often completely resolve an intermittent. \n\nBut yeah, sometimes you're just playing whack-a-mole and don't have time to outline a detailed explanation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RangerNS",
            "body": "> but remember when anyone with an IT related job had a basic understanding of how computer worked and premise cabling , routing etc\n\nI do not.",
            "score": 1,
            "replies": []
        },
        {
            "author": "largos7289",
            "body": "Some people never messed with token ring and a voltmeter and it shows... Those dam terminators always would go bad too. I remember messing with motherboard jumpers to make the right voltage for the CPU. Then IRQ's for com1 and such, for devices. Scsi forget it may as well learn a different language. Always had a add in card and you had to configure that too. It was better but the same when you think about it. You don't have to do that now because the hardware and OS got way better, but now you concentrate on the higher end stuff.",
            "score": 1,
            "replies": []
        },
        {
            "author": "This_guy_works",
            "body": "Well, it depends.  Entry level help desk is full of dinguses that don't know much but ideally should want to learn.  Level 2 or 3 Sysadmin or field tech or network tech who needs to be effective and interface with end users - they better have some core skills.  \n\nThough, 8 or 9 years ago I worked with a newly hired field tech who just completed his 4-year bachelor degree in computer science and he couldn't figure out how to disconnect a monitor VGA cable because it was screwed in.  So I guess you get all kinds out there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "apathyzeal",
            "body": "Remember in the 1940s when everyone who could work on a car had basic mechanic's knowledge? No? Of course not. Same damn argument though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Background-Clerk-357",
            "body": "I also remember when CS graduates actually knew how to code as opposed to asking their favorite LLM to generate a solution. Gen X and millennials are the most tech literate generations, it's all downhill from here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lordkappy",
            "body": "I remember it well. I got hired with no background, just being enthusiastic about computers, Linux, and FreeBSD. I haven't been out of work since the whole Y2K fiasco. They needed bodies helping boomers and silent generation peeps learn to use computers and to keep them patched, virus free, and regularly rebooted. I got MCPs and an MCSE (NT 4.0) I never got A+.\n\nIt only took me about 2 years to transition away from helping baboons use the r-click and  to empty their trash (btw, one person used the recycle bin as a folder for organization and got pissed when I emptied it on them.) I wanted to get back in the server room and just work with computers. So much less frustrating than the genpop.\n\nThat said, computers weren't as ubiquitous then, so any skill with them was a massive advantage to get into the industry. Those days are long gone, even though it seems peoples' skill hasn't really increased that much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DontTakePeopleSrsly",
            "body": "Almost every credentialed engineer that has come out of UCF, I’ve had to teach basic skills like ping or regedit.",
            "score": 1,
            "replies": [
                {
                    "author": "Best_Taste_5467",
                    "body": "The OSI model is lost on 98% of people these days. \"X isnt working\" where at in the OSI model is it broke? \"Blank stare\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DontTakePeopleSrsly",
                            "body": "Or even worse, you have programmers trying to do things at the application level that are already handled somewhere between the session and data link layers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "njaneardude",
            "body": "I already had MCSE NT when I took A+ and N+, and at least for A+, I really appreciated the hardware insight. Worked with many no certs, A/N + certified techs back in the day. I got in the door with no certs and just cabling experience.\n\nTalking with a Gen Xer yesterday about old tech, wow did I feel old!",
            "score": 1,
            "replies": []
        },
        {
            "author": "A_Deadly_Mind",
            "body": "Even for me getting into IT around 2013, I still had this conceptual knowledge, but everything now is hyper siloed. To an extent I get specialization but it does make collaboration hard when other IT people aren't speaking the same language",
            "score": 1,
            "replies": []
        },
        {
            "author": "RCTID1975",
            "body": "That's your world bias. \n\nAs someone managing and hiring in the late 90s, I can assure you, that wasn't always the case.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wiskinator",
            "body": "I mean it used to be that everyone who drove a car had to know how to crank start it and adjust the fuel air mixture and spark advance as they drove. \n\nThe advancement of technology is, at least partially, there to hide complexity from us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KittysDavid",
            "body": "I went on a service call in the 90's for a printer\n\nthey didn't peel the sticker off the ink cartridge",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Great_Sephiroth",
            "body": "I remember those days too. I've let people go due to having lots of paper (certs, degrees, etc) and no knowledge. Back in the day we made our own cabling and all. 10Base-T anybody?",
            "score": 1,
            "replies": []
        },
        {
            "author": "R1s1ngDaWN",
            "body": "I'm fairly new gen(3 years experience) without an A+, currently studying for my Network+. I've learned through research and practical troubleshooting while on the job and I manage to push way past what any of my other colleagues are capable of. People are just losing the actual drive to troubleshoot and find ways to solve problems. In my (short) experience, that's the best way to learn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CharcoalGreyWolf",
            "body": "My A+ is from 1997; you needed to know printer emulation DIP switches.\n\nOh, and I got a discount because it was the Windows 95 beta exam.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bi_polar2bear",
            "body": "My A+ test was about Windows 3.1, even though 98SE was coming to EOL. I don't miss searching for drivers or struggling with IRQ's. I do miss the LaserJet 4 and 5. It was a beast.\n\nWhat kills me today is that nobody uses Google or YouTube before asking questions. Why trust source material when you can ask Joe Nobody? \n\nI've known AIX admins who couldn't understand RAM. Developers almost universally won't know what the OSI model is, which blows me away. I think if you're going to work in IT, knowing computers, networking, databases, and coding basics should be required.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NorthOfUptownChi",
            "body": "Oh god yes. Though, my one saving grace from having to be a total jack-of-all-trades back in the day is that I'm colorblind, so I was excused from having to make my own ethernet cables.\n\nBack in the 1990s, we configured our internal TCP/IP network before we ever thought about being connected to the internet, so we ended up picking non-safe ranges that conflicted with the University of Tokyo. It was fine, but it made for some weird traceroutes and email headers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoonerMedic72",
            "body": "If it makes you feel better, I interviewed a guy that said he had been working as a MS shop sysadmin since 1994 and he didn't know what Power Shell, Active Directory, or Group Policy were. So some of the people back then didn't understand anything they were doing either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "graffix01",
            "body": "Basic troubleshooting skills are among the most coveted when looking for new hires. Show me you understand the basics and can reason your way through a problem and I can teach you anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Call_Me_Papa_Bill",
            "body": "This is exactly what motivated the team behind the Raspberry Pi to create it - so students could learn basic computer concepts. In 2025, if a high school student says they have a “computer” class, it means they are learning spreadsheets, word processing and how to create presentations, with maybe a bit on navigating the Internet. No foundational stuff, no programming.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrainWaveCC",
            "body": "I don't know that this was universally true...\n\nWe've had plenty folks come into IT to get this basic knowledge. Could you elaborate more on what is driving your complaint at this time?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AbolishIncredible",
            "body": "Mid-30s Experienced software dev lurker here:\n\n* surface level hardware knowledge\n* enough network knowledge to configure a basic network for a relatively simple single location\n* know my way around Mac, windows and basic linux app/web/servers\n* enough DBA knowledge to be very dangerous \n\nI usually know when to ask for help from other specialists in the IT space when I’m out of my depth. \n\nIs there anything I should learn to help out the sys admins I work with?",
            "score": 1,
            "replies": [
                {
                    "author": "ObiLAN-",
                    "body": "This one tends to fall behind but is critical and helps not just sysadmins when you're requesting stuff but everyone down the line:\n\nDocumentation.  It's a skill not many utilise or train. If a dev comes to me with a request and i have all the details, hows, whys and whats in a clean package, theres a 100% chance I'll do my best to get it working/operating for you in a timely fasion.\n\n People underestimate how much of a time waste and pita it is to have to track down the details myself. Especially when i have other work todo.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AbolishIncredible",
                            "body": "Couldn’t agree more for docs. \n\nTried reverse engineering an API yesterday. 10 minute job took hours 🥲",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "wearelegion1134",
            "body": "just my 2 cents, but back when i went to school for IT in the late 90s, early 2000s, we were still getting the broad generalized education.  When i went back for some classes in 2010, it was specialized.  \n\nWhen I first started school, the domain section of class covered microsoft, novell, and I want to say apple maybe.  10 years later and you could take the Microsoft AD security course or any other number of specific technologies.  \n\nI just happened to be the generation where they were still figuring out everything when it came to computers and networks.  So that's what you learned, as much general knowledge as possible, because in two weeks, that knowledge was going to need updated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UncleToyBox",
            "body": "I think there was a brief period in the early 80s that match what is being described.\n\nBy the early 90s, I had users asking me what the foot pedal was for and if they could get a replacement tray for their drink holder.\n\nThinking back, it was the introduction of the mouse and the graphic interface when things started going downhill.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Karfedix_of_Pain",
            "body": "> Remember the old days when you worked with computers you had basic A+ knowledge\n\nNo?\n\nI mean, I was pretty clueless when I started.  Had to ask lots of questions.  Made lots of stupid mistakes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DGC_David",
            "body": "Computers are my tism... It was never just the basics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigchizzard",
            "body": "I oversee a bunch of college kids doing their first IT roles, and find it really satisfying to help them fill in the gaps in their knowledge. \n\nA+ focuses a lot on historic artifacts that really have zero place in modern stacks imo. The more modern bits+ Net+ bits seems to be about what they need to know to perform.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redvelvet92",
            "body": "I do miss the simpler times but I don’t miss the pay checks and being broke. It’s a hard compromise.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shrekerecker97",
            "body": "I am in the dilemma now. I have all that knowledge and not everyone has it. Even when I watched my employer hire another sysadmin they didn't have their A+ already and aren't able to pass it because it was never anything mandatory for them. it is beyond frustrating.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jordanl171",
            "body": "By my estimation user's tech knowledge peaked around 2008 and has been declining since then.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RunAwayFromShame",
            "body": "Windows NT domain with an \\_ in the name.",
            "score": 1,
            "replies": []
        },
        {
            "author": "identicalBadger",
            "body": "I mean, I’ve had especially bad luck trying to crimp network cables. I’ve probably destroyed 100 connectors out of 101 attempts. But otherwise, I’m fairly competent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GhostInThePudding",
            "body": "I mean these days you get automatic updates for a lot of stuff on a weekly basis and the patch notes are \"Fixes several bugs. Improves performance.\" WHAT BUGS? HOW DID YOU IMPROVE PERFORMANCE?!?!?!?!?!?\n\nIt's disgusting. Basically trying to cover up everything being done and turn everything into black boxes that remain under the control of the licensing company rather than the customer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vato915",
            "body": "Shit, I'm lucky if I find anyone WILLING to learn!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jellovator",
            "body": "Do yourself a favor and don't go into r/pcmasterrace or r/computerhelp. People wondering why their brand new computer that they've just built won't turn on, and they haven't connected the front panel headers. No one knows how to troubleshoot no post/no video, and the comments are even worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "0ld_Gr1m",
            "body": "My company recently had a large piece of machinery installed. The tech the machine company sent didn't even know how to map a network drive. \n\nSent him full folder path, username/password, and server ip. Nope, had to have me drive an hour out of my way to set it up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdAffectionate3143",
            "body": "CompTIA A+ sucks ass and CompTIA lobbied against right to repair.  \n\nI got an 86 on the practice test without even studying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KiNgPiN8T3",
            "body": "You have to remember that a lot of people entering the workplace now have grown up on tablets and touchscreens. The premise of sitting in front of an actual PC is fairly alien! (Coming from a 40 year old that hit it just right and grew up with a PC. lol)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fallingdamage",
            "body": "Yeah, working on PCs you really needed to understand how things worked.  \n  \nEven building PCs these days is easier than following directions in a lego booklet.   \n  \nWhen that new nvidia card started melting power cables, everyone was aghast. I knew exactly why that was happening.  \n  \nNowdays, even programmers dont know how to program anymore. They just use the 'vibe coding' method and think they're prodigies.  \n  \nIts a Wall-E world out there now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "doctorevil30564",
            "body": "Yep, I have one of the lifetime A+ certifications issued in 2003. Now they expire them after a certain amount of time so you constantly have to get recertified.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pertexted",
            "body": "I do remember this. It's invaluable and continues to serve me well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Backieotamy",
            "body": "I remember getting my A+ in Jan 2001.  \nI remember Token Ring was the predominant protocol and 1 year later I was driving around to dozens of sites replacing NIC's and learning TCP\\\\IP.  \nA+, as I recall taught the basics of Windows OS networking connectivity but did not get into switch or routing outside knowing the different topologies and protocols but did not get into them at all. I knew of the 7 layer model but it wasnt until I took a CCNA class a few years later I learned how the OSI model actually worked together.  \nThe only cabling training was inside the PC, or from NIC to the wall; I did not have any cabling training outside of that as I recall. Matter of fact my first job is where I learned to terminate CAT5.\n\nI think we tend (me included) to elevate the skills we acquired, even early on and forget how much we had to actually learn, especially how much in the first couple of months of your first job in the tech field.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Club-2308",
            "body": "We just had a new level2 support who looked at me with a straight face and asked if know about virtualbox",
            "score": 1,
            "replies": []
        },
        {
            "author": "XanII",
            "body": "Well yeah, we also had stacks of paper on the desk. A woe to the fool that moved those papers as that was our 'Google'",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unixhackerdotnet",
            "body": "cd d: setup.exe (with a manual on how to)",
            "score": 1,
            "replies": []
        },
        {
            "author": "wisco_ITguy",
            "body": "I remember when there were 3 separate parts to the A+, for Windows, Mac, and DOS.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Murky-Breadfruit-671",
            "body": "i worked at an ISP and we had a couple of brilliant minds above us, but I was used for several different things and didn't get a lot of time with them directly. I learned a lot, but the best thing I learned was people love a good acronym.  \"No, s m TP, like Susie Makes Toilet Paper\" because every person alive thinks it should be smpt for some reason.  It was well over a decade around my small town later, people still remembered it.\n\nGood ol' windows 98, deleting tcp/ip and all the email info and rebuilding them every week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sir_mrej",
            "body": "I know how old you are! You know how I know? There have been computer eras:\n\nRoom-sized computers\n\nCabinet-sized computers\n\nFull-desk-sized computers\n\nDesktop computers\n\nLaptop computers\n\nTouchscreen pocket etc computers\n\n  \nYour \"old days\" are referencing the \"desktop computers\" days. Just remember - That's just one point in time!",
            "score": 1,
            "replies": []
        },
        {
            "author": "raffey_goode",
            "body": "I find it wild that I read posts here and other places online where \"cyber security\" people don't know jack all about computers. Just makes me wonder how the hell do you know how to secure shit on something you barely know about?",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Wkwied",
            "body": "We still get WFH users who try to daisy chain their monitors together.\n\nYes, you can plug the HDMI wire from one monitor into another. No, it won't do anything.",
            "score": 1,
            "replies": [
                {
                    "author": "iPlayKeys",
                    "body": "umm..While HDMI doesn’t support this, there are some DisplayPort monitors that support this, so they aren’t totally off base.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "The_Wkwied",
                            "body": "I know that newer HDMI standards can daisy chain. But we not utilizing hardware that can do that at all. We also include an ikea-like hardware setup guide with pictures. People can't follow them.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comfortable_Gap1656",
            "body": "It boils down to hiring practices. When you hire the bottom of the barrel you get the bottom of the barrel. Don't expect people to just magically develop skills.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ncc74656m",
            "body": "LMAO, I've been in tech formally for right on about 20 years, and informally since before 2000, including some, shall we say \"intern\" experience in formal environments. Cable routing and things like that have ALWAYS been an issue to the point where the network teams would not give closet access to non-network staffers bc they didn't want loose cables tossed everywhere or the network rooms turned into storage for the tech packrats.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pw1111",
            "body": "I don't miss the days of people having to mention that they are MCSE certified whenever they get the chance.",
            "score": 1,
            "replies": [
                {
                    "author": "JimmySide1013",
                    "body": "It’s super fun to see MCSE required in job postings. Especially since they retired it in 2021. Just goes to show everyone is faking it and nobody really knows anything about anything.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nik_Tesla",
            "body": "I don't bother fully learning a program any longer, because within 6 months it'll be completely changed or we'll change to a different software, and everything I learned will be irrelevant. I just learn what I need when I need it, and then my brain releases that knowledge back into the ether so I can move on to the next thing to learn and forget.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slick8086",
            "body": "At my former company we just hired a jr. sysadmin out of college (he was 22-23 something like that) and one of the reasons we picked him is that he built his own PC.  He was able to do stuff like replace batteries in laptops from the start.  Definitely had a lot to learn as a sysadmin, but he had PC fundamentals down pat.   \n\nI think people with that base knowledge and skill can learn the sysadmin job much faster and better than those without those skills.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kiernian",
            "body": "About 7 or 8 years ago, I came rolling into the office from an off-site and the ENTIRE team **and** the project manager are gathered around the conference table staring down at an open case.\n\nThe project manager sees me, points at me, and yells \n>\"/u/Kiernian! 5 seconds or less, what's wrong with this box?\"\n\nI walk over, look down, and see the VERY OBVIOUSLY RUPTURED AND EXPLODED capacitor, say \"Popped cap\" and get a super loud\n\n>\"HE KNOWS!!!~~~\n\n>WHAT THE FUCK IS THE MATTER WITH THE REST OF YOU?!?!?!?!\"\n\nA dozen and change people, they were only a few years my junior, and one of them was, like myself, THIRD TIER ESCALATIONS for server issues.\n\nSince the advent of SaaS/Datacenter/Cloud architecture, nobody does hardware work anymore.\n\n(It was later brought to my attention that the whole lot of them had been staring at the inside of this case for more than five minutes)",
            "score": 1,
            "replies": []
        },
        {
            "author": "3rdCoastChad",
            "body": "I don't really need my help desk to do much other than know how to gather data and document a problem. Desktop break -fix is an issue that can wait...replace the unit and get the money makers back to making money, fix the broken unit later.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chum-guzzling-shark",
            "body": "I dont remember that because a lot of my coworkers were dumb as  hell 20 years ago and didnt know the basics of shit and I suspect its always been that way",
            "score": 1,
            "replies": []
        },
        {
            "author": "goretsky",
            "body": "Hello,\n\nWhen I started doing support in the late 1980s, PC users had a basic knowledge and understanding of how their computer operated, and the terminology used.   That changed in the mid-1990s with the arrival of Windows 95.\n\nRegards,\n\nAryeh Goretsky",
            "score": 1,
            "replies": []
        },
        {
            "author": "awfl",
            "body": "Dont know what A+ is, really; I managed and wrote software for thousands of PCs and their users, and responsible for their daily minute to minute productivity. Learned machine language on mainframe and M6800 and UNIX? before PCs were really even a thing. Datacomm was twisted pair, coax, leased line, teletype current loop, acoustic modems eventually, so many arcane standards. NFS, AFS, DECnet, Bang! email addressing, uucp, ftp, usenet, gopher, xmodem, ymodem, Compuserve, Tymshare?, PARNet, SerialNet, 3COM, Banyan Vines, Netware, *ALL* before the web. So sure I missed so many others.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dizzy_Bridge_794",
            "body": "In the early days you also most likely were self taught.   Everybody was building and deploying their own equipment.    I loved the 1980’s and 1990’s.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jgo3",
            "body": "I still have a few old VAX manuals I keep just because I think they're neat.  I also bought an old copy of *The Kermit Book* just to remind myself of all the crap I learned about SLIP and RS232 &c.  I miss those days.",
            "score": 1,
            "replies": []
        },
        {
            "author": "freedoomed",
            "body": "My A+ is so old it doesn't expire.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Social_Gore",
            "body": "Id blame your employer instead of a generation, they could hire people who know that, but people who don’t are cheaper",
            "score": 1,
            "replies": []
        },
        {
            "author": "therealatri",
            "body": "Memba jumpers?\n\nI memba",
            "score": 1,
            "replies": []
        },
        {
            "author": "zoharel",
            "body": ">remember when anyone with an IT related job had a basic understanding of how computer worked and premise cabling , routing etc .\n\nNo.  No, I don't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gscjj",
            "body": "To be fair, anyone born after 2000 getting into IT today probably knows  just enough to barely fail an A+ exam, and could probably pass it the next time with very little studying. \n\nWe're living in different times",
            "score": 1,
            "replies": []
        },
        {
            "author": "Candid_Ad5642",
            "body": "Eh\n\nBack in 2001 I worked for a small software company, and did a bit of tech support. Typically around updates. This was a bit of a niche market, and we had something like 300 of the 350 potential customers, so update was just unpack this zip file into you installation directory and it will replace the files that need to be replaced\n\nEven that generate calls, and one particular customer would always require 45 minutes of phone support for this operation, after the inevitable click the link in the mail, download that file somewhere you remember and can find it\n\nThe same user would also never ever bother trying to remember or write down any error message. Her words: It was all just Greek, I couldn't understand any of it.\n\nSo no, there were plenty of users that did their daily work an a PC that didn't have a clue back then as well",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Jelly_6990",
            "body": "It's weird watching middle aged and boomers take comptia \"seriously.\" Like taking the code bootcamp folks serious. The big data folks seriously. The data scientist people seriously. The MIS folks seriously. The crypto currency folks seriously. And so forth... Now, the Whitehouse is full of completely incompetent dickheads from wall st and so on. Idk, just the time...",
            "score": 1,
            "replies": []
        }
    ]
}