{
    "title": "'Segregated facilities' are no longer explicitly banned in federal contracts",
    "author": "dystopiadattopia",
    "subreddit": "news",
    "rank": 8,
    "score": 1054,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 76,
    "url": "https://www.npr.org/sections/shots-health-news/2025/03/18/nx-s1-5326118/segregation-federal-contracts-far-regulation-trump",
    "id": "1je3dwg",
    "selftext": "",
    "comments": [
        {
            "author": "Sour_baboo",
            "body": "McKinley, Gulf of America, so much winning",
            "score": 263,
            "replies": [
                {
                    "author": "mossling",
                    "body": "Denali is Denali. It was Denali before the first white foot stepped in Alaska, it remained Denali last time folks in DC decided otherwise, it is still Denali today. Come to Alaska, call it McKinley, and you're likely to get shoved into a snowbank. ",
                    "score": 158,
                    "replies": [
                        {
                            "author": "Alwayssunnyinarizona",
                            "body": "Went on a gold panning trip outside of Talkeetna with a local woodchuck who kept calling it McKinley.  My kid enjoyed that part of the trip, but I'd never recommend it to anyone.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "mossling",
                                    "body": "There is a certain type of transplant who wants to \"escape the gubment\" and run away to Alaska to become rugged individualists; yet they bring their lower48 ideals with them. My new very Texan neighbors from Texas, always telling us how they do things in Texas. They are the kind who focus on what they can *take* from Alaska. They have no respect for the land, the people, and the cultures that were here before. ",
                                    "score": 62,
                                    "replies": [
                                        {
                                            "author": "Alwayssunnyinarizona",
                                            "body": "Agreed.  Former marine previously stationed at JBER IIRC.  Trouble is there's a few of them along that Anchorage-Fairbanks corridor.  We passed on several airbnbs that were obvious transplants like you mentioned - it was actually pretty hard to find ones that weren't in that part of the state.\n\nSeward and Homer were the highlights of the trip, apart from our overnight in Denali.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "yourlittlebirdie",
                            "body": "I think he was being sarcastic.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "mossling",
                                    "body": "Indeed. I was simply adding. ",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DragonFireCK",
                            "body": "Sorry, Alaska voted for Trump, so it is now McKinley. As MAGA says, Trump won, get over it.\n\n If Alaska had voted for Kamala, they'd have an argument to fight Trump's agenda.",
                            "score": -32,
                            "replies": [
                                {
                                    "author": "mossling",
                                    "body": "\"Trump won, get over it\" is the saddest, weakest, most pathetic argument ever. I did everything in my power leading up to the election, and I will continue to do everything in my power to fight against this administration. I will not roll over and just take it because y'all say I should. \n\n\nAnd while alaska is traditionally red, our votes literally do not matter one single bit. Hard to take the blame when the election has been called before you even make it to the polls.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "DragonFireCK",
                                            "body": ">\"Trump won, get over it\" is the saddest, weakest, most pathetic argument ever.\n\nTell that to all the MAGA people who love using that excuse for reasons to accept the illegal deportations, anti-LGBTQ laws, rewriting of history, and dismantling of science.\n\n> I did everything in my power leading up to the election, and I will continue to do everything in my power to fight against this administration. I will not roll over and just take it because y'all say I should. \n\nYou said \"Alaska\" not \"me\" in the previous post. Alaska voted for Trump and thus *wants* want Trump is doing. That is not something *you* have to accept, but something *Alaska* needs to accept.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "mossling",
                                                    "body": "The election was called for Trump around 5pm local time. I still went to vote when i got off work at 7pm. Did it matter? At all??? **Would** it have mattered at all, if alaska had gone for Harris? ",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "mossling",
                                                                    "body": "The original commenter told *me* to get over it, and I won't. \n\n\nAgain, Alaska's 3 measly electoral votes don't make a difference. Have never made a difference. Due to the nature of our villages, our election results aren't even finalized until nov 20. The only thing that would be different today if alaska had flipped for Harris is that y'all wouldn't be telling me to get over it. ",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "notfork",
                                                                            "body": "Yes, because I think you are missing his point. His point is not that you should have done more to vote. Or that or electoral votes matter. His point is that the majority of the people in your state WANT the trump administration and things like calling It McKinley come with that.  While your are just saying No true Scotsman would want this, but they do wants this because they voted for it, even knowing their votes (paraphrasing you here) are just symbolic, the populace of your state chose this.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BrickFun3443",
                    "body": "And the military bases that are having their names reverted back to confederate leaders.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Busty_Ronch",
            "body": "Is this “Great Again”?🤦🏻‍♂️",
            "score": 366,
            "replies": [
                {
                    "author": "irrelevantnonsequitr",
                    "body": "Yes. Great again seems to be code for somewhere between the 1890s and 1950s.",
                    "score": 181,
                    "replies": [
                        {
                            "author": "Chesapeake_Hippo",
                            "body": "I bet quite a few would prefer pre 1860.",
                            "score": 83,
                            "replies": [
                                {
                                    "author": "JoLudvS",
                                    "body": "Pre- 1492 would be preferred by some native people...",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "oneeighthirish",
                                            "body": "I'd prefer 2005. Let me be a kid again I'm tired of all this adult crap.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "meatball77",
                                                    "body": "1995 would be nice.  Everything seemed exciting.  Technology changed every year and was fancy and new.  The US was a peacekeeper and troops weren't being sent off to war.  Rents were affordable.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "ffnnhhw",
                                                            "body": "and travelling by air was a much better experience pre 911 and post smoking ban",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Cathlem",
                                    "body": "I think we need to go back to 1864 and take a nice long march through Georgia.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WienerDogMan",
                            "body": "Looking like they are shooting for 1929",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Initial-Shop-8863",
                                    "body": "Oh, goodie. Crash and then another world War.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "finalremix",
                            "body": "Maybe if Krasnov makes the country more like when his daddy was alive, Fred Trump will rise from the grave to tell him he did a good job.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "meatball77",
                            "body": "They want 1950's middle class for the home and the Golden Age for Society.  They want to go back to the robber barrons and debtor prisons.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ajaxfetish",
                                    "body": "Would those by chance be the 1950s when both houses of congress were controlled by the Democrats and the top marginal tax rate was over 90%?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "YomiKuzuki",
                            "body": "They wanna separate the whites from \"the icky Others\" and have complete and total control over women again.\n\n  \nAsk one of them when America was economically great, and they'll be unable to give a date.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FreddyForshadowing",
                    "body": "We're the greatest dumpster fire of any major nation since Germany at the end of WWI.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "richareparasites",
                    "body": "A high school in calaveras county California changed its name from redskins to the reds. They love to do the most racist thing they can get away with. Fucking deranged shit, bro.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "DoublePostedBroski",
                    "body": "To the cult it is",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "DisclosureEnthusiast",
                    "body": "Great Again for super racist and sexist white people. Bad for literally everyone else.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "NetZeroSun",
                    "body": "You mean White Again.\n\nMake America White Again.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FreddyForshadowing",
            "body": "I'd like to say this sort of thing isn't needed anymore, but just look at what happened after they said the Voting Rights Act had served its purpose. All kinds of laws aimed at diluting the black vote started going into effect.",
            "score": 55,
            "replies": []
        },
        {
            "author": "mehrotr",
            "body": "What the hell is wrong with America? Is this a second Civil War that is being fought and the absolute worst kind of ideology is being resurrected? I have no words to describe the wanton destruction of the American constitution. Absolute anarchy. ",
            "score": 120,
            "replies": [
                {
                    "author": "Ms74k_ten_c",
                    "body": "Yup. As they say, the South lost the battle but won the war.",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "fruitsnvegggies",
                    "body": "this is opposite of anarchy and is full blown fascism. we will have to tear down this fascist regime and start from scratch with a whole new constitution by the time this is over",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Competitive_Mind_829",
            "body": "Tennessee lawmakers will be the first to bring back segregated facilities",
            "score": 14,
            "replies": []
        },
        {
            "author": "EternalGandhi",
            "body": "The \"Good 'ol Days\" they want to bring us back to.",
            "score": 28,
            "replies": []
        },
        {
            "author": "strugglz",
            "body": "Of course this is the next step after declaring diversity to be bad.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Advanced-Summer1572",
            "body": "This looks real,but only Congress can change the law and rules of Federal government procurement rules and procedures.",
            "score": 19,
            "replies": [
                {
                    "author": "finnerpeace",
                    "body": "From the article:\n\n>\"The way that they're implementing this in the contracting field is essentially subverting democracy — you're supposed to allow agencies to comment on this, contracting officers to comment on it, and think through the implications carefully,\" the worker said. \"By doing this, they're essentially ramming things through hoping no one's going to notice.\"\n\n>The General Services Administration did not answer NPR's question about why the agency did not follow the usual public notice and comment procedure, or a question about why the \"segregated facilities\" clause was removed.\n\n>In a statement, GSA spokesperson Will Powell wrote: \"GSA has taken immediate action to fully implement all current executive orders and is committed to taking action to implement any new executive orders.\"",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Advanced-Summer1572",
                            "body": "Three years, 9 months and counting...",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "frostcoh",
                                    "body": "Until the country once again votes R because it is stupid",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OrangeJr36",
                    "body": "That only matters if Congress is willing to enforce rules. \n\nThey have already allowed Trump to usurp their power of the purse and make a hostile takeover of the Institute for Peace, which is explicitly an independent congressionally made agency with no connection to the executive. \n\nCrying \"Buh Congress\" is a hilarious amount of ignorance and naivety.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "richareparasites",
                    "body": "I don’t know if you’ve noticed but this administration doesn’t care much about the law. They’re going the “let them enforce it” route.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "JimBeam823",
            "body": "TBH, it seems like this language was redundant because there are plenty of other laws that cover the same thing. \n\nEven if there wasn't, no contractor in 2025 is going to be maintaining \"separate but equal\" facilities based on cost alone.",
            "score": 24,
            "replies": [
                {
                    "author": "Informal_Process2238",
                    "body": "Doubt equal will have anything to do with it \n\nYou have to ask why would someone make a point to go after this language and why is this important to them. Given what these people have already done with their racism based attacks on service members it can’t be anything but a vile motive",
                    "score": 57,
                    "replies": []
                },
                {
                    "author": "hamoc10",
                    "body": "If it didn’t matter, why remove it? There’s another reason.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "GastricallyStretched",
                    "body": "You say \"laws\" but this administration has shown that they treat laws more as \"suggestions\".\n\nThey'll follow laws to the letter when it serves their interests, and outright ignore them otherwise. There should be no expectation going forward that laws will protect anyone from anything.",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "yourlittlebirdie",
                    "body": "Removing it sends a message. It wasn’t accidental.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "KDR_11k",
                    "body": "Racism is never economically wise but that doesn't stop it.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "dystopiadattopia",
                    "body": "Yes, most segregation is illegal anyway, but Trump probably objected to the \"gender identity\" part that was added by Obama. And gender identity isn't protected federally or by all states. So it looks like he wants to make segregation of trans people legal. I'm sure if some \"Christian\" company decided to treat any trans employees like shit - assuming they hired any in the first place - this EO would allow that in jurisdictions without trans protections.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "AJDx14",
                    "body": "Not equal, but I think plenty of contractors could afford to have a restroom for whites and a bucket for everyone else.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RobbRen",
            "body": "https://www.acquisition.gov/sites/default/files/caac/CAAC_Letter_2025-01.pdf\n\nSecond page",
            "score": 1,
            "replies": []
        },
        {
            "author": "sniffstink1",
            "body": ">After a recent change by the Trump administration, the federal government no longer explicitly prohibits contractors from having segregated restaurants, waiting rooms and drinking fountains.\n\nOy MAGAs, are you now at the point where you can be honest with yourselves and admit it's all about \"Make America White Again\"? Or are you not there yet? Blankie needed?",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoodMix392",
            "body": "Wait till they segregate schools. That’s a few months away I think. Got to get people used to the idea that it’s ok to send people to concentration camps in another country without due process first. Get the population warmed up to the fascism.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Justmmmoore",
            "body": "Racists, bigots, criminals and assholes have taken over the federal government.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImmediatelyOrSooner",
            "body": "Republicans and republican voters are taking America back to its very racist roots.",
            "score": -1,
            "replies": []
        }
    ]
}