{
    "title": "Minnesota state Sen. Eichorn arrested on suspicion of soliciting a minor",
    "author": "Hrekires",
    "subreddit": "news",
    "rank": 1,
    "score": 2605,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 341,
    "url": "https://www.mprnews.org/story/2025/03/18/state-senator-eichorn-arrested-suspicion-of-soliciting-a-minor",
    "id": "1jebiv4",
    "selftext": "",
    "comments": [
        {
            "author": "Goldwood",
            "body": "They didn't state the party in the title because you already know it.",
            "score": 2177,
            "replies": [
                {
                    "author": "pomonamike",
                    "body": "I assumed the rule and it was a correct assumption.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Strobooty4",
                            "body": "I love this game because I’m right about 93% of the time. There are occasional Democrats that do this sort of thing. I even saw a transgender person a few days ago (first time I’ve seen that). But almost always it’s a member of the family values party ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mydogsdad",
                                    "body": "It’s not that they don’t value family, it’s that the *value family* ( ͡• ͜ʖ ͡• )",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "IamDDT",
                                    "body": "Yep.  The difference comes in the reaction to these revelations.  Republicans cannot condemn their own, and are *shocked* when Democrats do.  Over and over, they keep thinking that Democrats will defend pedophiles and sex offenders.  If Bill Clinton is on Epstein's list, if Joe Biden is, I want them investigated to the fullest extent of the law.  That is it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MandiLandi",
                                            "body": "Exactly. This shouldn’t even be a politicized topic. If they’re on Epstein’s list, they should have the book thrown at them regardless of party affiliation.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "PraxicalExperience",
                                            "body": "I always get reminded of that cartoon (which I cannot seem to find right now) where you've got a (dem) guy in a room with a button.  Another (repub) guy says something like: \"If you press that button, a republican will be prosecuted for something they did, but a democrat will be too!\"  And the first guy just starts smacking the button.\n\nI want everyone to be investigated for any crimes they've committed in office.  I might be *hoping* the accusations turn out to be true or false depending on the accused, but if the courts and law process works as it should -- good, fucking go after 'em.  And this is something that they'll never understand, because they hold tribalism more holy than the constitution.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ertri",
                                            "body": "So many republicans yell about how franken shouldn’t have had to resign but like… he needed to resign. \n\nYou don’t have a constitutional right to a congressional seat and if you’re shitty (and your governor is of the same party), you shouldn’t hold on to a seat for the sake of holding on to it. ",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "SkeevyMixxx7",
                                            "body": "Exactly. I don't care who any of them fucks if everyone involved is adult, consenting and human. I don't care what party they belong to if they're guilty of a crime. Prosecute them for crimes. Please. Because right now, there's a lot of crimes happening.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ClitEastwood10",
                                            "body": "Trumps on the list. What about him?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "IamDDT",
                                                    "body": "I'm not a Republican.  Ask one of them what they think.  I think he should be investigated, but the American people at large think differently.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cyclonitron",
                                            "body": "> Republicans cannot condemn their own, and are shocked when Democrats do.\n\nInterestingly enough, from the linked article:\n\n>On social media, Minnesota House Rep. Elliott Engen, R-White Bear Township, called for Eichorn to “resign in disgrace” and be prosecuted.\n\nI don't know if Engen means it, but maybe he [Engen] is actually not a horrible person.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "IamDDT",
                                                    "body": "Thank you for pointing this out! We should always praise principled stands.  People will say \" he's doing the bare minimum\", but having a good moral response should always be celebrated.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "-something_original-",
                                            "body": "That’s the whole thing. They never condemn just use whataboutism. My brother was defended musk that it wasn’t a Nazi salute. I told him maga should be up in arms not making excuses. If Obama did that I’d be just as pissed. There’s no place for any of this shit.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Forward_Operation_90",
                                                    "body": "Guarantee Musk had bee practicing in front of a mirror.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "1JoMac1",
                                    "body": "But you'll hear about the *possibility* of transgender transgressions non-stop, like you'll hear about the *absolute terror* coming over the border. It's all fearmongering and scarecrows.\n\nBut when push comes to shove and solutions are presented, like holding people accountable, or passing a border bill, they'd rather run on a problem than work on a solution.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Wolf_in_CheapClothes",
                                    "body": "Democrat would be in the title",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "USSMarauder",
                                            "body": "The Hill was famous for this\n\nYou knew the crook was GOP if the headline was something like \"State Senator arrested\"\n\nIf the crook was a dem it was \"Democrat State Senator Democrat John Smith arrested\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "4runninglife",
                                    "body": "Don Lemon literally said when he has to cover the RNC convention, he stays in his hotel due to the amount he gets hit on by republican men.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "stiffgordons",
                                            "body": "Presumably he’s doing this to avoid being hit on, but your wording leaves open another possibility…",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Snuggle__Monster",
                                    "body": "It's time to play America's favorite game show: GUESS WHICH PARTY\n\nhttps://www.youtube.com/watch?v=G8iOmVd1W_g\n\nIf you guessed >!Republican!< you've won!\n\nhttps://en.wikipedia.org/wiki/Justin_Eichorn",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "savois-faire",
                    "body": ">They didn't state the party in the title\n\nThey basically did, by including the crime.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "redvelvetcake42",
                    "body": "Ding ding ding. \n\nIf it's a liberal the affiliation is pronounced, if it's a conservative they won't allow that R anywhere nearby.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ICPosse8",
                            "body": "Just like both failed assassinations and a ton of school shooters.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Clownsinmypantz",
                    "body": "how many pages does that list make up now?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "purplegladys2022",
                            "body": "The Daily Kos posts comprehensive lists of convicted Republicans, the 54th installment was published last month.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "where_is_the_cheese",
                                    "body": "Because I've not heard of this and was curious...\n\n[https://www.dailykos.com/stories/2025/2/22/2305554/-Republican-Sexual-Predators-Abusers-and-Enablers-Pt-54](https://www.dailykos.com/stories/2025/2/22/2305554/-Republican-Sexual-Predators-Abusers-and-Enablers-Pt-54)\n\nBy there count, the number of people is 1,350.\n\nEdit: For whatever it's worth, the page says it's from the a member of the community and not subject to review by the editors or staff. But each entry does appear to link to a news story or other source.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "junction182736",
                    "body": "Funny how that works.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Stix85",
                    "body": "RRRRRRRRRRRReally no need to question which party.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WarWorld",
                    "body": "It's always the case.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FoxyInTheSnow",
                    "body": "It’s the same in the everywhere. Whenever you see a news story about a member of parliament—an old Eton/Oxford lad—who was found dead, naked, trussed up like an Easter lamb with a sprig of spearmint sticking out of his anus: Conservative Party. When you see a story about an MP who charged £4.78 for two cups of tea to her expense account (instead of out-of-pocket) while attending a climate conference in Glasgow: Labour Party. \n\nGuess which story gets the bigger, more faux-outraged coverage above the fold on the right wing tabloids?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mdmd33",
                    "body": "Pedo-conservative theory is a theory in the way that gravity is…",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Wizinit29",
                    "body": "The Grand Old Pedo party.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FreddyForshadowing",
                    "body": "Right there in the photo caption, though in cases like this, it really ~~should~~ shouldn't matter what the party affiliation is.\n\n>Minnesota state Sen. Justin Eichorn, R-Grand Rapids\n\nAnd also in the body of the article\n\n>Police say Eichorn, R-Grand Rapids, was booked into the Bloomington city jail and remains in custody.\n\nEdit: Damn typos.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "absenteequota",
                            "body": "but it does matter, when this is a common, repeated problem among members of that party. when everyone seeing the headline rightly assumed the dude was a republican it's worth noting.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Necessary_Chip9934",
                            "body": "Interesting. Grand Rapids is on the other side of the state from Bloomington. (The airport is in Bloomington, for what it's worth.)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pass_nthru",
                    "body": "as is tradition",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "-Raskyl",
                    "body": "If it was a democrat they certainly would have",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Prudent-Blueberry660",
                    "body": "Lol I figured Republican and sure enough...it never fails!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IronRakkasan11",
                    "body": "They did, second paragraph “R-Grand Rapids”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NiteSlayr",
                    "body": "I get so tired of seeing the adjectives when it's a person on the left and none when it's a person on the right.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "-something_original-",
                    "body": "I was coming to the comments to confirm it was a republican. My first thought when no party was listed.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Necessary_Salad1289",
                    "body": "Drag queen? no? oh 😳",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OkSample7",
                    "body": "This is the same chump that introduced the trump derangment syndrome bill. \nI can’t say I’m surprised.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "User-no-relation",
                    "body": "He's a drag queen right?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "uolen-",
                    "body": "Why is it when it's a Democrat its \"we don't care what party,  no one should do this\" but if it's republican its \"of course he's republican\"?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FalstaffsGhost",
                            "body": "Because Democrats condemn it no matter who does it. \n\nThe republicans claim that democrats and lgbtq people are the ones doing it despite the evidence that conservatives do it a whole hell of a lot more. \nIt’s the hypocrisy",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "recyclopath_",
                            "body": "Because democrats don't protect predators. We oust them.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Shradow",
                            "body": "Well, those aren't mutually exclusive or anything. No one should do it, whether they're R or D. Your first quote still applies here, I'm not sure why you're implying it doesn't. But historically speaking, the vast majority are R, so people expect it more.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dantrash2",
                    "body": "I'm sure he's a democrat",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Persona_Non_Grata_",
                            "body": "Good thing you're not a betting man for your sake.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GodKamnitDenny",
                            "body": "Takes you about five seconds to open up the article and find out how wrong you are",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MaikeruNeko",
                            "body": "\"It's a dangerous thing to mistake speaking without thought for speaking the truth.\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OverlyExpressiveLime",
                            "body": "As always with you conservatives, you're in the wrong",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ProfChubChub",
                            "body": "lol Republicans love electing predators. Just check the stats.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "No-Appearance1145",
                            "body": "Well you're wrong.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TheWolrdsonFire",
                            "body": "Not a drag queen.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "purplegladys2022",
                            "body": "You're 100% wrong.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "IamMe90",
                            "body": "I love how you could have taken five seconds to open the article and find out for yourself, but instead you had to leave a factually incorrect comment \n\nIt’s almost like you’re not commenting in good faith or something. Strange..",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gamergirlpeeofficial",
            "body": "It took 7 paragraphs before this article mentioned Eichorn's political party. (Republican, btw. You already knew that.)",
            "score": 1,
            "replies": [
                {
                    "author": "Deeschuck",
                    "body": "It is also in the caption of the photo at the very top of the page before the article begins.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "merrittj3",
                            "body": "Man, i hate it when I miss stuff like that !",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dookieshoes97",
                    "body": "It's just assumed that they're all sex pests.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bareback_cowboy",
                    "body": "Did it mention of he's a crossdresser or transgender or drag show aficionado? Because I've been told those are the real culprits!\n\n\n/S",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SekhWork",
                    "body": "If it's not mentioned in the headline, you know who it is.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ICPosse8",
                    "body": "Even in blue af Minnesota these GOP clowns are raping people.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DjToastyTy",
                    "body": "it says “R-Grand Rapids” in the second paragraph and under his picture after the third paragraph",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "peon2",
                    "body": "Did you skip past sentence number 3?\n\n> Minnesota state Sen. Justin Eichorn was arrested Monday in Bloomington for allegedly soliciting a minor for prostitution.\n\n>According to Bloomington police records, Eichorn was arrested near the 8300 block of Normandale Avenue at around 6 p.m. **Police say Eichorn, R-Grand Rapids,** was booked into the Bloomington city jail and remains in custody.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpatialDispensation",
            "body": "I'll save you all a click.  Yes it was a republican",
            "score": 1,
            "replies": [
                {
                    "author": "ShaperLord777",
                    "body": "I didn’t need to check, I already knew.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ComfortableBell4831",
                            "body": "Im Canadian and I already knew lmfao",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BetterZedThanDead",
                                    "body": "But he was at least a drag queen, right? Right?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ShaperLord777",
                                    "body": "If you guys become the 51st state, can I come over? It sucks here.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ComfortableBell4831",
                                            "body": "Pretty sure wed take up arms before that even remotely comes to pass (Cant wait for the bots on this one)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ShaperLord777",
                                                    "body": "If you need backup, holler at me. 😂",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "treedemolisher",
                    "body": "Is he Christian too?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Muzzlehatch",
                            "body": "Of course he was.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "The_Bitter_Bear",
            "body": "Ya know. \n\n\nRepublicans constantly going on about pedophiles and protecting the children is really starting to seem like some severe projection. \n\n\nEdit: notable typo.",
            "score": 1,
            "replies": [
                {
                    "author": "KingNosmo",
                    "body": "I think you meant projection, but, yeah. Both work.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "The_Bitter_Bear",
                            "body": "Haha I sure did. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fuddykrueger",
                    "body": "They really like to hide behind the guise of being a good, upstanding Christian. Me thinks he doth protest too much.\n\nI think ‘moral Christian’ is becoming an oxymoron.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PraxicalExperience",
                    "body": "I've known people on the sex offender registry that I'd feel safer to leave a child with than a republican politician drawn at random from the available pot.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LazarusKing",
            "body": "What a surprise!  He's a Republican.",
            "score": 1,
            "replies": [
                {
                    "author": "Saneless",
                    "body": "I didn't even have to check. It was known already",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sniffstink1",
            "body": "Ah, but of course. A Republican.",
            "score": 351,
            "replies": [
                {
                    "author": "Strider794",
                    "body": "So there will be no lasting consequences then, gotcha. Even if he did it and the courts decide to function, the Administration will just pardon him and that mob will still vote for him",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BubbhaJebus",
                            "body": "Minnesota state law. DOTUS can only pardon federal crimes.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Strider794",
                                    "body": "Oh, that's good. I still don't think that he'll get anything but a slap on the wrist, and that creature might just declare that his pardons work on state crimes too",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Necessary_Chip9934",
                                    "body": "And the governor is Tim Walz.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "caligaris_cabinet",
                            "body": "On the contrary he just qualified himself for president",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "wirenutter",
                            "body": "Given that it’s Minnesota I have hope the judges there will deal out punishment. Now if it was Florida and they had the Venmo payments and testimony of a co conspirator then yeah no consequences and he would be nominated for Attorney General.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UntimelyApocalypse",
                    "body": "Countdown to him receiving a cabinet position.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Both_Painter_9186",
                            "body": "Future Ambo to Thailand",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_Bitter_Bear",
                    "body": "I'm starting to think all their constant concerns about pedophiles might be a wee bit of projection. \n\n\nAlso, still not a drag queen or transgender person. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ConfederacyOfDunces_",
                            "body": "How about like, people just stop fucking kids\n\nWhat the fuck is even happening. Why is there so many creepy pedaphiles all around us? \n\nI had no clue how prevalent this was until my brother googled the sex offender list thing and a million fucking bubbles popped up all around our neighborhood/city. \n\nThey are literally everywhere. I was shocked.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "omgitsdot",
                    "body": "The secret is to look for the political party in the title. They'll never put Republican if not forced to.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "frawgster",
                    "body": "Jesus forgives.\n\n\n😂 Sorry. It’s hard for me to say that with a straight face.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "meandmrt",
            "body": "Guy thought he was talking to a 16 year old girl. He's married with 4 kids. Article says he hasn't been charged with a crime. Apparently being a pedo is okay if you're a republican.",
            "score": 1,
            "replies": [
                {
                    "author": "thejimbo56",
                    "body": "He hasn’t been charged with a crime yet. He will.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Desmond_Jones",
                            "body": "He will... get a slap on the wrist.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DDRDiesel",
                                    "body": "The absolute worst punishment he'll get is a fine. He'll then get a glazing statement from Trump on Truth Social and the RedCaps will be none the wiser",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "notsanni",
                                            "body": "He might even get a cabinet position",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "PraxicalExperience",
                                            "body": "My money's on 'convicted then sentence commuted,' unless he was particularly useful.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "thejimbo56",
                                    "body": "It’s a felony with a 5 year prison term and/or 10k fine. \n\nHe won’t get the full term if he’s a first time offender, but this isn’t going to just go away. \n\nMN takes this shit pretty seriously.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Zlesxc",
                            "body": "He was just arrested yesterday. Charges are coming per the Hennepin County Attorney’s Office",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MadAstrid",
                    "body": "Have you noted how many sex criminals are besties with the sex criminal who is currently president? At this point it is essentially required.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MaievSekashi",
                            "body": "Trump literally had a meeting with a known rapist yesterday. Someone so violent that his victim had to have her tampon surgically removed from her body after what he did. He was seemingly invited basically just for being a racist, misogynistic man with a following amongst incels...\n\nhttps://en.wikipedia.org/wiki/Conor_McGregor\n\nThe \"Charges and controversies\" section is the longest I've ever seen on wikipedia. Hell, he was accused of attempting to rape a woman in Miami just two months ago.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "monkeyhind",
                    "body": "After checking his photo and party affiliation, I assumed he was soliciting a boy.  My gaydar needs tuning.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ThreeDrunkenBees",
                            "body": "Same. That face screams I like little boys.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "recyclopath_",
                            "body": "Something about that combination of deep closeted self hatred and homophobia creates this kind of pedophilic toxicity.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "restore_democracy",
                    "body": "It’s a prerequisite.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "xzyleth",
                    "body": "Damn near a requirement at this point!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zlesxc",
                    "body": "Another article says charges are pending by Hennepin County. He was just arrested late yesterday, it takes a little time for things to go through the system: https://www.fox9.com/news/minnesota-senator-justin-eichorn-arrest",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ashamed-Distance-129",
            "body": "I guess he had Trump Depravity Syndrome.",
            "score": 1,
            "replies": [
                {
                    "author": "effinmetal",
                    "body": "Dipshit was one of the sponsors of the bill too. Incredible.\n\nEdit to add: he was the one who INTRODUCED IT. Not just a sponsor. Wowzers.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FelneusLeviathan",
                    "body": "Devotion* trump loves to walk in the changing rooms of teen beauty pageants so this guy is just emulating his idol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CowManLives4Ever",
            "body": "Wasn't this scumbag one of the guys trying to push legislation in Minnesota to make hating Trump a mental illness?",
            "score": 1,
            "replies": [
                {
                    "author": "rachelmaryl",
                    "body": "Yes, his name was one of five on [the bill.](https://www.revisor.mn.gov/bills/bill.php?f=sf2589&b=senate&y=2025&ssn=0)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PraxicalExperience",
                            "body": "Ooh, that makes this doubleplus satisfying.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "FaithfulSkeptic",
                    "body": "“Why would Antifa do this?”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BubbhaJebus",
            "body": "Title correction: \"**Republican** Minnesota state Sen. Eichorn...\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "servocomputer",
            "body": "Party of family values, it just might be your child",
            "score": 1,
            "replies": []
        },
        {
            "author": "GonePostalRoute",
            "body": "r/NotADragQueen\n\nWhat a surprise, another republican",
            "score": 1,
            "replies": [
                {
                    "author": "ruin",
                    "body": "Maybe the 'R' actually stands for 'Reprobate'",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MoiraBrownsMoleRats",
                            "body": "I figured it stood for \"Rapist\", given who they elected President, him letting Tate back into the country, him palling around with Connor McGregor, and the fact that so many of them are rapists.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Blofish1",
            "body": "The GOP - Grand Old Pedophile party.",
            "score": 1,
            "replies": []
        },
        {
            "author": "polysemanticity",
            "body": "What I find *shocking* is that the conservative subreddit doesn’t seem to have a single post on this topic. You’d think they’d be all over this!",
            "score": 1,
            "replies": [
                {
                    "author": "LuriemIronim",
                    "body": "Twenty bucks says posting it on their sub gets you banned.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "No-Appearance1145",
                            "body": "Even if you are a flaired conservative.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LuriemIronim",
                                    "body": "I’ve legitimately never seen a safer safe space on Reddit.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Magicedh",
            "body": "Without opening the article let me guess he is an republican.",
            "score": 1,
            "replies": []
        },
        {
            "author": "twistedstigmas",
            "body": "Still not a drag queen. Crazy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "R67H",
            "body": "Is he interviewing for a cabinet post?",
            "score": 1,
            "replies": []
        },
        {
            "author": "commanderclif",
            "body": "Another one. From the party of “family values”. If it ever was a joke it’s not anymore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HDauthentic",
            "body": "Party of morals and taking care of kids right here folks",
            "score": 1,
            "replies": []
        },
        {
            "author": "boxofstuff",
            "body": "Ah, but of course. A Republican.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ghuunhound",
            "body": "Ah, but of course. A republikkkan",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capnshiner",
            "body": "the most recent items on his official fb page are congratulating the crosby-ironton girls hs basketball team 🤔",
            "score": 1,
            "replies": []
        },
        {
            "author": "theguytomeet",
            "body": "But was it a member of the LGBTQ+? I’m guessing it was a conservative Christian, super wild guess",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jonas_VentureJr",
            "body": "Another win for the -R-? Party of family/ethics/law. /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuercusSambucus",
            "body": "Pedocon theory has yet to fail",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrdevil413",
            "body": "Still not a drag Queen",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 17,
            "replies": [
                {
                    "author": "SNP_MY_CYP2D6",
                    "body": "Figures. Family values and whatnot",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Alice-Planque",
                    "body": "*surprised pikachu*",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "De-Le-Metalica",
                    "body": "Must be a day that ends in ‘y’.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "schadkehnfreude",
            "body": "This arrest will certainly strike a chord with his voter base, especially given his party affiliation ",
            "score": 1,
            "replies": []
        },
        {
            "author": "moskowizzle",
            "body": "It doesn't say it in the headline, but can someone confirm if this was or wasn't a drag queen?",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigdonpaul",
            "body": "Was he a drag queen or trans?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MatrimCauthon95",
            "body": "Didn’t even need to confirm that it’s another republican.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TrailBlanket-_0",
            "body": "Married, 4 kids together.\n\n\nhttps://www.senate.mn/members/member_bio.html?mem_id=1219",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silly-Scene6524",
            "body": "Off to the Republican sex crimes list, quite extensive now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeptaBitchface",
            "body": "Why do Republicans love pedophiles so much?",
            "score": 1,
            "replies": [
                {
                    "author": "AtomMorris",
                    "body": "They vote for pineapples* because they are desperate for a world where they can openly molest children themselves.\n\nedit: pedophiles. Not pineapples. Even my autocorrect is trying to protect these people.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "outerproduct",
            "body": "Still not a drag queen?",
            "score": 1,
            "replies": []
        },
        {
            "author": "reluctant_lifeguard",
            "body": "I don’t see a lot of details in the title, but let me guess with no context\n\n-Republican -Married -Children- Believes trans people are grooming minors- involved with the church-upstanding moral character-volunteer youth coach- Will claim he was hacked?\n\nHow’d I do?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZuliCurah",
            "body": "Not a Trans person, drag queen or generally queer person. Just another \"I'm a good person guided by God\" republican",
            "score": 1,
            "replies": []
        },
        {
            "author": "sniffstink1",
            "body": "Ah, but of course. A Republican.",
            "score": 26,
            "replies": []
        },
        {
            "author": "sniffstink1",
            "body": "Ah, but of course. A Republican.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Mystyblur",
            "body": "Oh, boy. It sure seems like the repugnicans just can’t help themselves, when it comes to soliciting teenagers for illegal and immoral purposes. GOP= Grand Old Pedophile.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cb4u2015",
            "body": "Not surprising since there is a convicted felon as the President.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JagerAkita",
            "body": "The leader of their party was an Epstein fan boy with multiple girls describing what he did, this will do nothing to hit career. Shoot he might even get a national position",
            "score": 1,
            "replies": []
        },
        {
            "author": "SavageCucmber",
            "body": "He's trying to get into the Trump cabinet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JiovanniTheGREAT",
            "body": "Ah, so it wasn't the trans woman, it was the family values Republican. Shame on mpr for not leading with that in the headline.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accomplished_Trip_",
            "body": "Once again, not a drag queen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "peroleu",
            "body": "Republican by the way, since they want to bury that in the article for some reason.",
            "score": 1,
            "replies": []
        },
        {
            "author": "poompoomppuh",
            "body": "A fucking Republican...not surprising",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Information6622",
            "body": "Lack of integrity and not fit for public office .",
            "score": 1,
            "replies": []
        },
        {
            "author": "grandmawaffles",
            "body": "Now the asshole is gross for at least 3 things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thebadparker",
            "body": "Now he's eligible for a position in Trump's cabinet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSleepingPoet",
            "body": "#Minnesota State Senator Arrested in Underage Solicitation Sting\n\nA Minnesota state senator has been arrested after allegedly attempting to meet what he believed was a 16-year-old girl for prostitution.\n\nRepublican Senator Justin Eichorn, 40, was taken into custody by Bloomington police on Monday evening after detectives posing as a minor arranged a meeting with him. Officers arrested Eichorn without incident outside his vehicle near Normandale Avenue. He was booked into the Bloomington city jail, where he remains in custody.\n\nEichorn, who represents Grand Rapids, has served in the Minnesota Senate since 2016 and is described in his official biography as an entrepreneur and family man with four children. His arrest has sent shockwaves through state politics, with Senate Republican Leader Mark Johnson saying he was still gathering information and would comment later. Democratic Senate Majority Leader Erin Murphy called the allegations deeply troubling and said they raised serious questions for Eichorn’s colleagues and constituents.\n\nThough he has not yet been formally charged, the case has already drawn widespread attention. Authorities have not released further details, but more developments are expected in the coming days.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tensei-coffee",
            "body": "# just so everyone knows, yes he is a republican.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JFontenot",
            "body": "Imagine that, some freaky Christian Republican",
            "score": 1,
            "replies": []
        },
        {
            "author": "SluttyDev",
            "body": "Not to poke fun at someone’s appearance but that face alone suggests he solicits children.",
            "score": 1,
            "replies": []
        },
        {
            "author": "coldazice",
            "body": "Take my good hand lookin ahh",
            "score": 1,
            "replies": []
        },
        {
            "author": "citizenh1962",
            "body": "He hardly looks the type. And by *hardly* I mean *completely*.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedBeardsCurse",
            "body": "What is that? Do I hear a special election coming?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImmediatelyOrSooner",
            "body": "Republican voters love their child molesters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "temperofyourflamingo",
            "body": "Was he tryna strike a chord?",
            "score": 1,
            "replies": [
                {
                    "author": "DeepRoot",
                    "body": "♫ \"*A-minorrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr...*\" ♪",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Earthling1a",
            "body": "At this point it might be easier to list the repigs who have NOT been arrested for some kind of disgusting behavior.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Goddamnpassword",
            "body": "Pedocon theory is undefeated",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kidatrickedya",
            "body": "Special election time? his seat should immediately be vacated. One less vote for republican traitors.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible-Pain-620",
            "body": "It's *always* the ones you most suspect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustSpirit4617",
            "body": "Him and Matt Gaetz should share a cell",
            "score": 1,
            "replies": []
        },
        {
            "author": "Illustrious_Listen_6",
            "body": "Should be jailed for life",
            "score": 1,
            "replies": []
        },
        {
            "author": "acuet",
            "body": "Minnesota State Senator Eichorn (GOP) arrested on suspicions of soliciting a minor.    This r/notadragqueen",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shadowthron8",
            "body": "Eh he’ll be offered a position in the White House the way priests are moved around and promoted",
            "score": 1,
            "replies": []
        },
        {
            "author": "MasterinAz",
            "body": "Not a drag queen or a trans person. Go figure",
            "score": 1,
            "replies": []
        },
        {
            "author": "CellyAllDay",
            "body": "It’s always the ones you suspect the most",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustMeAndMyKnickas",
            "body": "Check out this bill he recently co authored in Minnesota. \n\nhttps://www.revisor.mn.gov/bills/text.php?number=SF2589&version=0&session=ls94&session_year=2025&session_number=0",
            "score": 1,
            "replies": []
        },
        {
            "author": "Braided_Marxist",
            "body": "I didn’t know Minnesota had any transgender or drag queen state reps! /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "sierrat0nin",
            "body": "It’s always the ones you expect",
            "score": 1,
            "replies": []
        },
        {
            "author": "slumvillain",
            "body": "I remember there was a huge document with all the names of all the Republican members of senate and congress who have been brought up on child sex crimes. \n\nYep there's democrats on there too. \n\nBut for like the dozen democrats on that list, there's more than 100 Republicans who have been convicted of assault of a minor. And if it's not that, it's usually DUIs and Family Violence. \n\nFamily values and all that. Buncha drunk pedo rapists trying to tell US what's moral. Trying to designate our fellow Americans as abominations when they're only part time politicians. And spend the other part of their lives raping children. \n\nWhy are so many Republicans also pedophiles? That's a venn diagram that never surprises.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GaiusMarcus",
            "body": "FYI:  \n[https://ballotpedia.org/Justin\\_Eichorn](https://ballotpedia.org/Justin_Eichorn)",
            "score": 1,
            "replies": []
        },
        {
            "author": "SourCreamV2",
            "body": "Republican leaders and sex crimes name a better duo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WestinghouseXCB248S",
            "body": "“In the criminal justice system, sexually-based offenses are considered especially heinous…”",
            "score": 1,
            "replies": []
        },
        {
            "author": "jdozr",
            "body": "how long before he is pardoned?",
            "score": 1,
            "replies": []
        },
        {
            "author": "oasisarah",
            "body": "TIL there is a grand rapids minnesota (and wisconsin, ohio, and even manitoba)",
            "score": 1,
            "replies": []
        },
        {
            "author": "mortalcoil1",
            "body": "It's so easy to control politicians who are pedophiles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "airheadtiger",
            "body": "I guess this means he will be running for president on the republican party ticket next election. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Allah_Akballer",
            "body": "If it was a Democrat the right would have advertised it on the moon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ehrgeiz91",
            "body": "Republican? Color me shocked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CantAffordzUsername",
            "body": "Ah yes, the pro lifer with a child….how typical",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nunovyadidnesses",
            "body": "Without reading, I already know which party this guy belongs to…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ecko4Delta",
            "body": "Yet, not another drag queen. How about that",
            "score": 1,
            "replies": []
        },
        {
            "author": "LunarMoon2001",
            "body": "Do we need to guess the party?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ilikechickenwings1",
            "body": " What a surprise, a male in power!",
            "score": 1,
            "replies": []
        },
        {
            "author": "elciano1",
            "body": "Wait til yall find out Maga Mike is gay and is living with a pastor in DC.  Thr plot thickens",
            "score": 1,
            "replies": []
        },
        {
            "author": "William_R_Woodhouse",
            "body": "So, still not a drag queen?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HuTaosTwinTails",
            "body": "Classic maga. Always obsessed with kids genitals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "greenthumbum",
            "body": "Republicans are trying to normalize pedophilia",
            "score": 1,
            "replies": []
        },
        {
            "author": "KlingonLullabye",
            "body": "This bolsters his conservative bona fides and he'll be supported for even higher office by the GOP",
            "score": 1,
            "replies": []
        },
        {
            "author": "One-Arachnid-2119",
            "body": "Please don't be a Democrat, please don't be a Democrat...\n\nPhew, thank goodness!\n\nI assumed he was Republican, but Dems do stupid/illegal shit, too.  Luckily it seems to be more aligned to taking bribes than diddling kids.",
            "score": 1,
            "replies": [
                {
                    "author": "Informal_Process2238",
                    "body": "The big difference is when a democrat rapes a kid the other democrats want them locked up when republicans rape kids the become the party leader",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jeff1955slack",
            "body": "what they accuse us of is actually who they are",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minute-Nebula-7414",
            "body": "Pedocon theory remains undefeated",
            "score": 1,
            "replies": []
        },
        {
            "author": "MasterToon",
            "body": "I'm so shocked, who would have thought?  /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldBob10",
            "body": "“Eichorn, 40, is listed in his Senate biography as an entrepreneur who is married with four children” that he knows of. 🤷‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "designer-paul",
            "body": "Trump will soon announce that this person is the new senator for Epstein Island",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Raisin-9606",
            "body": "Democrat or Republican?",
            "score": 1,
            "replies": [
                {
                    "author": "eddiestarkk",
                    "body": "you know which one",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}