{
    "title": "am i wrong for being upset over my boyfriend being friends with someone he’s slept with?",
    "author": "Educational_Ad7820",
    "subreddit": "amiwrong",
    "rank": 6,
    "score": 28,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 49,
    "url": "https://www.reddit.com/r/amiwrong/comments/1je17o7/am_i_wrong_for_being_upset_over_my_boyfriend/",
    "id": "1je17o7",
    "selftext": "my boyfriend (M23) and i (F22) have been together since last year july, i know almost every little thing about him and other people he’s told me about. however, it has only been brought to my attention around a month ago that he’s been in contact & is currently friends with a girl (F23) he’s slept with in the past. \n\nwe’re going to call this girl willow. willow and my boyfriend met around the age of 16 and have been what he would call it “tight” ever since then. he had faintly told me about her 2 months ago but i had NO idea that they’ve had sex and what not. i ended up finding that information out myself when i went through his phone and found multiple texts exchanged between them. \n\nin their conversation, she had stated: \n\n“i wonder what it would be like if we actually got together x” and he replied “i wonder that too x”\n\nbut it didn’t stop there. it just kept going. \n\n“we’d probably have like 3 or 4 kids together by now, you would’ve never met your partner (me) and we’d most likely be married x” she says. \n\n“we would x” he says. \n\n“you know, i also had a dream about you. about being with you x” he also adds.\n\nonce i read that, i couldn’t even BARE to look at him. my nostrils were literally flaring, i could feel my face growing red and my eyes were stinging with tears. hours later, i ended up confronting him about it and he looked very much unbothered. he told me with a straight face: “you don’t ever wonder what it would be like with someone else?” \n\nLIKE WHAT? NO! I DON’T BECAUSE I’M WITH YOU! \n\nhe goes on to tell me what he meant about the “dream” he had of her and tells me that it was ages ago. he continues to tell me that they are just friends, nothing would ever happen between them. \n\nobviously i start to cry because i feel so overwhelmed by the situation and i’m just hurt overall. whilst crying, i confront him about not telling me that he had slept with her and his excuse was: “i thought i already told you?” no, he didn’t. \n\nin the end, he believed that i was overthinking the whole situation and that i’m paranoid. \n\ndo i sound crazy? please let me know. \n\n",
    "comments": [
        {
            "author": "Fit_Try_2657",
            "body": "It doesn’t matter too much that he slept with an old friend. It does matter that he’s texting her that he wants to be with her.",
            "score": 82,
            "replies": [
                {
                    "author": "Karamist623",
                    "body": "I think it was ok that he remained friends with someone he slept with.  Keeping it from his partner and texting the old flame those types of messages is the problem.\n\nOP needs to drop this guy.  Nothing good is going to happen from here on.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "WornBlueCarpet",
                    "body": ">It doesn’t matter too much that he slept with an old friend.\n\nThat's up for debate. Some will be fine with it while others won't. Neither is right or wrong, just personal feelings and boundaries. \n\n>It does matter that he’s texting her that he wants to be with her.\n\nBut this is basically cheating. Back to the streets with him!",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "CompetitiveWallaby57",
                    "body": "The naivety of this comment is startling, you're literally watching what happens when \"friends\" with sexual history keep in touch as \"friends\".",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Fit_Try_2657",
                            "body": "I amused that you’re “startled by the naivety” of my comment. Sounds instead like you’re judgemental about any situation that doesn’t align with your self-righteous morality, but that doesn’t necessarily mean that you have the life experience to realize that yes, people can actually be friends after fucking.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "No_Bandicoot2301",
                                    "body": "I think it just depends on the relationship and boundaries. OPs bf obviously never took time to enforce platonic friendship only. Would I personally be ok with this friendship, texts aside? No. But I know couples who are friends with old flames and flings and they're completely fine as long as this line isn't crossed.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Your_Dogs_Cat",
            "body": "When were the messages sent? If they're during your relationship, you're right to be angry.",
            "score": 17,
            "replies": [
                {
                    "author": "Educational_Ad7820",
                    "body": "it was sent during our relationship, recently in fact.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Your_Dogs_Cat",
                            "body": "Sounds like the comment about thinking what other people are like was not really a comment, but a warning. But talk to them, see if they keep denying or not. And move from there. I'd dump them if the messages were real",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "grumpy__g",
                            "body": "Happy cake day.\nHe is not your bf. He is longing for her. Let them be. Let them see that there was a reason they were never together. You go and find cursing someone who doesn’t lust for someone else. \n\nHave self respect. Never let someone treat you like that.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "SomeInvestigator3573",
                            "body": "Your boyfriend is emotionally cheating on you if nothing else. Are you going to put up with that?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Darkest_Visions",
                                    "body": "Definitely cheating, poor girl, cheaters suck.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Darkest_Visions",
                            "body": "Yeah thats blatantly cheating.... sry for you =(",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Darkest_Visions",
                            "body": "Yeah thats cheating.... sry girl =(",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AdLongjumping5641",
            "body": "If these are messages sent while you’re together you need to not be together with him anymore.",
            "score": 12,
            "replies": []
        },
        {
            "author": "ohjasminee",
            "body": "I know this word gets thrown around a lot, but babe, [he’s gaslighting you](https://health.clevelandclinic.org/gaslighting). You’re not wrong at all.\n\nETA: There’s a reason you felt the need to go through his phone, and it might be time to unpack why. If your gut led you through that process, he’s been showing you signs that caused you to not trust him. Whether you suspected that you’d find something or not, the urge to look is key to acknowledging that you don’t trust him, and he’s given you a good reason why. \n\nListen to your gut, love, and trust it. It’s not guiding you wrong, but he’s hoping it will by trying to convince you otherwise.",
            "score": 17,
            "replies": []
        },
        {
            "author": "pears_htbk",
            "body": "It’s not always bad to still be in contact/friendly with someone you’ve had sex with before. \n\nIt IS always bad to send stuff like “i hAd a dReAm aBout bEing wiTh yOoOu” to anyone. Especially someone you’ve had sex with. \n\nYNW 100000% I would have dumped him on the spot. He can go be with her and dream about you instead! He sucks!",
            "score": 7,
            "replies": []
        },
        {
            "author": "StnMtn_",
            "body": "YNW. Sounds like they are still into each other. So why did he start dating you then?",
            "score": 5,
            "replies": []
        },
        {
            "author": "MajorYou9692",
            "body": "It's a newish relationship, and if you're unhappy and he's acting like a jerk, I'd seriously reevaluate the relationship.",
            "score": 6,
            "replies": []
        },
        {
            "author": "No-Frosting-4763",
            "body": "🚩",
            "score": 4,
            "replies": []
        },
        {
            "author": "Civil_Confidence5844",
            "body": "The problem isn't that he slept with the friend in the past. The problem is the messages. Leave.",
            "score": 4,
            "replies": []
        },
        {
            "author": "750turbo11",
            "body": "Nope\nFor me, once you have an ex they are cut for good, unless you have kids with them.",
            "score": 4,
            "replies": []
        },
        {
            "author": "rhaegvr",
            "body": "YNW. That is not a conversation respectful to your relationship at all. I have a friend like Willow and he was told immediately that I had a boyfriend who I wanted to respect. My friend was completely cool with that. Your boyfriend does not seem serious about you and is leaving the door with this girl open. Being that you’re so young still, I say dump him and find someone who will respect and cherish your relationship.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SmileAggravating9608",
            "body": "I'm of the opinion that if two people are serious about a long-term relationship, there can be no entertaining of others. If I knew my SO said or thought things like that about anyone else, I'd no longer consider them a serious partner and would likely end it. I'd consider the whole context and any factors, etc.\n\nHere I would end it unless it made sense to stay casual. Given that you're young and likely building a life, maybe marriage in the future, with this guy, I would absolutely end it. The only mitigating factor might be if you've been together a pretty short time. Often there's some rockiness as you're just getting together. It's not always 110% from week 1.\n\nBut generally I need someone who's on board and not shopping around or dreaming of others. I don't want to risk it with someone who is.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Specialist_Concern_9",
            "body": "Just end it. Clearly he's being shady and you obviously don't trust him if you were going through his phone so what's the point of being with him?",
            "score": 2,
            "replies": []
        },
        {
            "author": "ShelizaA",
            "body": "Let him go. It sounds like they deserve each other...that's clearly what they wanted from their messages. If he wanted to be with you, he wouldn't have been encouraging her messages.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Recent-Sun3981",
            "body": "i think it's definitely wrong to look through someone's phone without their permission because it's an invasion of privacy, but i don't think you're wrong to be upset about what you foubd. if he was sending those texts while you two were together that's super fucked up and although he might not have slept w her while you've been in a relationship i still feel like that's a form of emotional cheating.",
            "score": 2,
            "replies": []
        },
        {
            "author": "annod75",
            "body": "Dump him. They are opening the gates to cheat.",
            "score": 2,
            "replies": [
                {
                    "author": "Darkest_Visions",
                    "body": "Its already solidly in cheater territory, say shit like that to someone while youre in a relationship, is flat out cheating",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "generationjonesing",
            "body": "He’s not over her and visa a versa, he’s not boyfriend material never mind husband or LTR material",
            "score": 2,
            "replies": []
        },
        {
            "author": "dawnyD36",
            "body": "You are not wrong and you deserve better. You are too young to settle for this bs! Best of luck ✨️ 🙏",
            "score": 2,
            "replies": []
        },
        {
            "author": "oshiesmom",
            "body": "The problem is they are still in love with each other. She isn’t going away and will always be an obstacle in your relationship no matter how much he downplays it. Those messages are very intimate.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThrowRACoping",
            "body": "No.  That is fucked up.  You are ok to be upset.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ginger630",
            "body": "This was a RECENT conversation? Oh he’s going to cheat on you with her. Do yourself a favor and dump him!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Complete-Design5395",
            "body": "That sounds like emotional cheating and like they aren’t just friends. If he was up front with you about her and the past they shared and introduced you, and kept conversations appropriate, etc… this would be a different story. But this is shady and crossing lines. You’re young, you can find someone better, tbh. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Itimfloat",
            "body": "I’m a huge proponent of making and keeping platonic friends. In fact, I think less of people who use gender to try to control their partner instead of building real trust. If someone is going to cheat, they will find a way even if they aren’t allowed to have attraction gender friends. And if someone won’t cheat, being controlling only harms the relationship. \n\nBut this is not that. \n\nMy boundary isn’t the friend’s gender, but their shared romantic/sexual intimacy. I do draw the line at previous romantic or sexual partner. I don’t believe you can be truly platonic with a past lover. And if that’s not your cup of tea, then *adieu*.\n\nThis was probably platonic. However, if they didn’t have a shared romantic history, this conversation wouldn’t have happened because he wouldn’t even bring this topic up with a platonic friend. \n\nBut Reddit can’t answer if you’re wrong for being upset about this because it’s all about what you feel is right in a relationship. We can answer that him not being honest about her is a huge red flag and shows he isn’t trustworthy and transparent about her. You need to decide if it’s worth ending your relationship over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Living_Plant3916",
            "body": "Your his second choice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DLH64",
            "body": "You need to get out now, rather than waiting for them to hook up again.  The way they are texting each other, to me, means it’s a case of when not if.  Respectfully, move on, don’t wait for the heartbreak.",
            "score": 1,
            "replies": []
        },
        {
            "author": "awnawkareninah",
            "body": "Those messages are way worse than having a sexual history with her and are not \"friend\" messages. I think you're missing the forest for the trees.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative-Wheel-71",
            "body": "He'd be really pissed off if you did the same thing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fulminic88",
            "body": ">do i sound crazy? please let me know.\n\nYes, you do. You're also young and naive, but how you feel about what you found is perfectly valid.  That's not the communication of someone in a happy relationship.  Obviously I don't actually know you guys, but to add a touch of benefit of the doubt, I've thought I've told someone something *all the time*, but I have severe ADD and will forget what I'm doing quite literally in the middle of doing it.  No need to deal with this sort of crap *and* be unhappy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agile-Wait-7571",
            "body": "Who needs this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Demand-2569",
            "body": "Yes you sound pretty “crazy” but also he went way past the line and is in the wrong and you should find someone you’re more compatible with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "observer46064",
            "body": "Neither of you are ready for an adult relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YeahlDid",
            "body": "Allergic to capital letters?",
            "score": 0,
            "replies": [
                {
                    "author": "OhNoWTFlol",
                    "body": "Seriously. WTF",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "L-Lawliet23",
            "body": "Weird how this would be seen as ok/less of a problem if the roles were reversed.",
            "score": 0,
            "replies": []
        },
        {
            "author": "SheepherderOk1448",
            "body": "Yeah, you do. Shouldn’t be nosy and go through other people’s text messages. Boyfriends aren’t personal property.",
            "score": -2,
            "replies": []
        }
    ]
}