{
    "title": "Am I going too far here?",
    "author": "sexy-throwaway-7741",
    "subreddit": "amiwrong",
    "rank": 15,
    "score": 1,
    "upvote_ratio": 0.55,
    "num_comments (reported by reddit)": 21,
    "url": "https://www.reddit.com/r/amiwrong/comments/1jeb3xr/am_i_going_too_far_here/",
    "id": "1jeb3xr",
    "selftext": "I (25M) am friends with a girl (23F) who *might* be into me. \n\nI met her at a bar recently with my other female friend and we all had fun. 2 weeks later, at her request, I hung out with her at another bar with my girlfriend (24F). This girl and my girlfriend… didn’t get along. Not that they don’t like each other, but that this girl mostly talked to me, didn’t ask my gf for her instagram, phone number, etc. We all chatted a bit but it was clear to my gf that I was the center of attention here.\n\nFlash forward and my girlfriend was upset and kind of suspicious of her. We had an issue like this before because my gf’s best friend tried to sleep with me a while ago and this caused a rift in our relationship. I told her everything was fine and not a big deal.\n\nSo this new friend invited us to her birthday party and I gave my gf her number to text her. This friend replied to all my texts but never texted my gf back and at the party barely talked to her, only me. Am I treading a line here?\n\nTL/DR: friends with a girl who might be into me, worried I’m taking this too far",
    "comments": [
        {
            "author": "illiter-it",
            "body": "The friend and your gf can't both be in your lives it seems, you have to make a choice. Friend seems toxic and gf doesn't deserve to be treated like that.",
            "score": 14,
            "replies": [
                {
                    "author": "sexy-throwaway-7741",
                    "body": "I mean I just met her a couple weeks ago so it wouldn’t be a hard choice. But she’s now friends with my other friends too so it wouldn’t be easy to ice her out and she is fun to be around.",
                    "score": -13,
                    "replies": [
                        {
                            "author": "Beatleslover4ever1",
                            "body": "Do you respect your girlfriend at all, or is she not “fun” enough for you? I feel so bad for her.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "bennyboy20",
                                    "body": "This guy is so full of himself, lol in the post he literally sounds like he's bragging about his gfs friend trying to sleep with him",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "rocketmn69_",
                            "body": "You need to have one of your close friends say to her, \" We've noticed that you're going out of your way to talk to OP. He's very committed to his gf, please don't make waves\"",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "YogurtclosetOk2886",
                            "body": "I’ll take a shot in the dark and guess that the friend is also attractive 😂",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "sexy-throwaway-7741",
                                    "body": "Not really my girlfriend is objectively gorgeous and leagues above her",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "HeartAccording5241",
                                            "body": "Then why do you want to f it up she will only take so much before she ends it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Optimal-Brick-4690",
            "body": "Info: Do you often act stupid, or is it just this post?",
            "score": 7,
            "replies": [
                {
                    "author": "Billiam911",
                    "body": "It’s a lifestyle, baby!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Expensive-Opening-55",
            "body": "You cut this new girl out. It’s obvious to everyone else she is into you and you’re enjoying the attention and playing dumb. Grow up or let your gf go be with someone better.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MaeSilver909",
            "body": "She’s not your friend.  Respect your girlfriend. No contact with this woman.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DAWG13610",
            "body": "If you want to keep your GF it might be best to stay away.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NoMoreBeers69",
            "body": "Dick move dude😡",
            "score": 3,
            "replies": []
        },
        {
            "author": "Full_Campaign5430",
            "body": "You Are as WRONG as it gets.\n\nSwitch this to your gf and another bloke, would you actually be thinking he has any intention of just being friendly with you gf?\n\nEven if your gf trusts you, she will never trust her as her game plan is so obvious even you basically admit it in what you have written.",
            "score": 6,
            "replies": [
                {
                    "author": "sexy-throwaway-7741",
                    "body": "I trust my gf and I wouldn’t really be bothered by some orbiter. I just wonder why it can’t happen the other way too",
                    "score": -7,
                    "replies": [
                        {
                            "author": "Full_Campaign5430",
                            "body": "Orbiters can be eaily ignored when things are good.\n\nThey become a problem when you have a big fight, get too drunk or just drop your guard. They move in at times of weakness. They make things that are resolvable into break up scenarios as they are just waiting to pounce. \n\nKnowing who they are and willingly letting them in is a dangerous game.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EitherWriting4347",
            "body": "OP is it an ego thing? Your obviously not a complete idiot so you see what the 'friend' is doing so Why are you putting your girlfriend thought this?",
            "score": 2,
            "replies": [
                {
                    "author": "Fulminic88",
                    "body": "because OP is a fuckboi. He literally just met this other girl and already can't sever the option *despite* already being in a relationship.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dan_jeffers",
            "body": "That's not a 'friend.' She doesn't respect your girlfriend and by extension, she doesn't respect you. I'm usually all in favor of friendships, but this isn't.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HeartAccording5241",
            "body": "End the friendship unless you want your gf to break up with you",
            "score": 1,
            "replies": []
        }
    ]
}