{
    "title": "Am I wrong for not consoling my wife when her dad leaves from a visit?",
    "author": "Mission_Ad_8821",
    "subreddit": "amiwrong",
    "rank": 1,
    "score": 14,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/amiwrong/comments/1jedmbz/am_i_wrong_for_not_consoling_my_wife_when_her_dad/",
    "id": "1jedmbz",
    "selftext": "Going to try to give you each side as objectively as possible. \n\nMy wife is a little emotionally immature. Her family lives across the country, and doesn’t visit often. Her dad recently came and we had a great visit. When he left, she broke down. She has daddy issues and this factors a lot into the equation. There’s trauma and unresolved childhood issues wrapped in this.\n\nI, on the other hand, am pretty even-keel. Not  unemotional by any means. In fact, I think I tend to lean emotional, but am more down to earth. While she is sad and becomes anxious by the possibility she might never see him again, I would be sad but reason that it’s life… and I will see him again soon.\n\nAnyways… it’s not that she wants a hug and is sad for 20 minutes. The world stops that day… she mopes and writes in her journal… she has to talk with friends on the phone about it… it’s a thing… sometimes for more than on day.\n\nThen, she gets mad at me for not being there for her. Again, I am… but for like what I feel is a reasonable amount of time. After that, it’s not like I scold her for it… I just go about my life. She needs the validation or something. Again… lot wrapped into this with the daddy issues. \n\nSelfishly, I also don’t want to get mixed up with the daddy issues or any of her family issues. I’m here for support, but I have a long history of consuming my SO’s problems and making them my own… to the point it’s unhealthy for me. I do my best to avoid that, or at least reserve it for when it’s necessary. \n\nAm I wrong for letting her feel this on her own?\n",
    "comments": [
        {
            "author": "LeaJadis",
            "body": "You: “I’m going to be as objective as possible”\n\nAlso You: “my wife is emotionally immature”.\n\n\nWhy did you (a self described even keel man) intentionally marry someone you feel has daddy issues and is emotionally immature?",
            "score": 91,
            "replies": [
                {
                    "author": "Houseleek1",
                    "body": "Good catch. Everything written after that does nothing but support that. I also like how they say that support her as long as they feel It’s reasonable. \n\nI’m betting she gets shut out a lot and due to this she’s especially sad to see someone who loves without condition is gone.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Own_Can_3495",
                    "body": "Yeah that's my thoughts too.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "HouseMuzik6",
                    "body": "This is what I want to know",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Mission_Ad_8821",
                            "body": "Why I married her? Because I love my wife. She has a million incredible qualities that very heavily outweigh this one issue.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "LeaJadis",
                                    "body": "Then if she has a million positive qualities, it would be wrong of you to focus on the one minor inconvenience of a wife sad after her dad’s visit ends.  Be emotionally supportive because she’s amazing in a million different other ways you won’t resent her for this one.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Admirable-Respond913",
                                    "body": "I los my dad almost 33 years ago, I'm now 55. I still miss him and have my moments of grief  3 decades later. She may have daddy issues, but if you can't help her, you certainly shouldn't further hurt her. It's not easy watching your parents age from far away for some of us. It's even harder to say goodbye,  potentially for the last time. Show her the same grace you yourself may need one day.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Magic-Happens-Here",
                                            "body": "It's been almost 20 years since my dad died and I still have days where it physically hurts. \n\nTime may heal all wounds, but for some wounds a lifetime isn't enough.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mission_Ad_8821",
                    "body": "How is this relevant to my post or question?",
                    "score": -33,
                    "replies": [
                        {
                            "author": "booksiwabttoread",
                            "body": "It speaks to compatibility. She needs someone who is more emotionally supportive than you are capable of being.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Mission_Ad_8821",
                                    "body": "So had it been phrased like you just did, I would agree. But that was clearly not how she intended her comment lol.",
                                    "score": -26,
                                    "replies": [
                                        {
                                            "author": "Poppypie77",
                                            "body": "You say your wife becomes really emotional for the whole day, needs a lot of comfort, cries, journals, talks to friends, wants cuddles etc. \n\nBut you cant comfort your wife on and off for 1 day? You can only support for her for however long YOU think is a reasonable time to be upset?? \nIs that 30 mins? 1hour? 2 hours? How long do YOU feel she's allowed to grieve the loss of her dad? How long do YOU think is long enough for her to be upset before you think she's got to \" get over it.\"? \n\nYour opinion on how long is a reasonable amount of time to grieve her dad leaving, not knowing when she'll see him again, worried if he may pass away and that visit would be their last. Missing being able to be physically with him to hug him and spend quality time with him. Your opinion on how long she should be sad for is IRRELEVENT. \n\nHer feelings are the only ones that matter in this situation. She is the one losing someone she loves, and doesn't know the next time she'll see him. Of course she's going to be devastated, and you can't just get over that in 1hour or 2 hours. \n\nI lost my dad a couple of years ago, and we were extremely close, strong bond, and I cared for him throughout his dementia journey. I miss him every single day and wish I could just hold him and hug him again. \nAlthough her dad is still alive, she still has daily grief over not being able to see him regularly and do things together, and have a hug from him when she's going through a difficult time etc. \n\nHave you lost someone you love? Are your parents alive, and do they live close by that you're able to see them easily? Are you close to your parents? \nIf you're close to your parents and see them frequently, you can't begin to understand how being away from her father deeply hurts her. \nAnd if you don't have a close bond with your parents you can't begin to understand the devastation of being away from them. \n\nI'm also curious as to why you live far away from her family? Did you have to move away for your job? Did her dad move away? If you chose to move far away from her family/ or your family, then you need to appreciate the sacrifice she's made for you leaving her loved ones so far away. (If you play a role in why he's not close by) \n\nBut really, why can't you just be there for your wife for 1 day of sadness? Why do you feel she's too overly emotional? It kind of says more about you than it does about her. \nIt's how's how deeply shelves and misses herdad, and how much she treasures the time with him, and how devastating it is when he leaves. But it seems to imply like you're quite unattached and don't have that kind of close relationship with your family as you can't even try and imagine how upsetting it is for her to say goodbye. \n\nShe's allowed to be upset and sad and struggle to say goodbye for another long period of time. And as her husband, I don't understand why you can't support her for 1 day. Just know that for the day he leaves, she'll need support and comfort and maybe some distractions, maybe go for a walk together or go do something to try and ease her mind. Cuddle up on the sofa and watch some films etc. \n\nIt's sad that you feel comforting your wife for 1 day is too much of a big ask and that you feel it's an over reaction. Your role as a husband is to be there for her through difficult times, but you're literally deciding yourself what you think is an appropriate time for HER to feel sad about saying goodbye to her dad. \n\nI think you need to look at yourself and your actions and try to be more supportive and understanding. \nIt doesn't matter if YOU think she's upset for too long, it matters how she feels and how it's affecting her to have to say goodbye. \n\nYou need to step up your support and understanding, because I guarantee that when the day comes that she loses her dad for good, she will be grieving so much worse and that kind of grief never ends.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Next-Drummer-9280",
                                            "body": "So, you're getting wrapped up in how it was presented, even though you clearly understand the question?\n\nThat's a little emotionally immature, too.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "author": "LeaJadis",
                                                    "body": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BlueRazzGuy",
                    "body": "Because all women are emotionally immature. Just something we have to deal with.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Mr_Fuzzo",
                            "body": "Wow.  That sure is an arsehole thing to say.  I hope you never impose that paternalistic attitude on any women in your life.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ChiGrandeOso",
                            "body": "Riiiiiiggghhht. Let's go with that fantasy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "danger_floofs",
                            "body": "Says the highly emotionally immature man",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "notsopeacefulpanda",
            "body": "“Going to try to give you each side as objectively as possible\n\nMy wife is a little emotionally immature.”\n\nI literally laughed out loud. Objective?!? It sounds like you don’t even like your wife. \n\nJudging from the daddy issues you describe, she had a fear of abandonment and you being thee for her would help. \n\nTry and be better about being supportive than you are at objectivity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Timesup21",
            "body": "Without knowing what the daddy issues are, it’s hard to say who’s not reacting properly. \n\nWhat I mean by that is, some women grew up being all out Daddy’s girls. Some craved approval that never came. Some were rejected by daddy. Some went through major health battles with daddy. So many daddy issues.",
            "score": 21,
            "replies": [
                {
                    "author": "Mission_Ad_8821",
                    "body": "Fair enough, her dad wrote her off from ages 12-17 when he divorced mom. Went to a new family that didn’t work out. Came back later. Over simplified, but you get the picture.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Timesup21",
                            "body": "Translation, she’s scared he’s going to walk out on her again. That being said, giving her reassurance, to a degree, would be a good thing. Doing much more would only feed into and enable her fears. If the day of journaling isn’t therapeutic enough, she may need to see an actual therapist to help her through this. \n\nI get where she’s coming from. My father rejected me growing up because I was supposed to be a boy. We didn’t start working our issues out until I grew up and he needed me due to being in the end stages of cancer. I had to go to therapy for all of it.",
                            "score": 36,
                            "replies": []
                        },
                        {
                            "author": "Must_Love_Dogs0331",
                            "body": "I would urge her to go to therapy to learn some coping skills. To expect you to drop everything indefinitely every time she sees him is unreasonable.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Jamaican_me_cry1023",
                            "body": "Tell her to go to therapy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Lisa_Knows_Best",
                            "body": "You don't mention your ages but assuming that happened at least a few years ago she needs to move past that insecurity. It's kind of pathetic that she (as an adult) is crying when daddy leaves. Maybe send her to visit him when she wants to see him so you don't have to deal with her immaturity. It's kind of ick to be honest.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LeaJadis",
                                    "body": "I’m betting his wife is young and there is a significant age gap between OP & his wife.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoMoreBeers69",
            "body": "Just support her,  give her time\n\nLet her talk to her friends because you obviously don't want to talk to her because \"air quotes\" \"\" she's too emotional \"\"\n\n\nStop bring a DICK😜",
            "score": 19,
            "replies": []
        },
        {
            "author": "TwinsiesBlue",
            "body": "You think a day is long enough to process going through an emotionally charged situation either a parent nonetheless, do you even like your wife?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wickedbitchoftheuk",
            "body": "You need to accept that she has this issue, that she can't stop the way it impacts her, and that if you love her, you'll put your own 'even' feelings aside and wrap her in love and warmth and show her you are not the same and abandonment is not in your vocabulary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Consistent_Spring853",
            "body": " Sounds like she has abandonment issues and might be co-dependent. She needs therapy. Have a conversation with her without blaming and shaming her for her feelings.",
            "score": 5,
            "replies": []
        },
        {
            "author": "EssentiallyEss",
            "body": "Perhaps consider a few things:\n\n1) some people take ALOT more processing time than others and that doesn’t necessarily mean they’re emotionally immature. I see that\nYour wife is clearly taking steps to hold space for this emotion, process it verbally with friends, journaling through it. Some people also must verbalize to process and that can understandably be exhausting for people around them. \n\n2) Abandonment often results in “arrested development”. So, although you may be right that she’s emotionally immature, perhaps you can give her some grace that someone else kind of forced that quality upon her by being … sketchy … \n\nYou’re NOT WRONG by placing a boundary here. Actually I think you’re probably actively fighting off some codependency issues. you realizing that you are her support system often to the point of your own detriment is notable.\n\nCan you find some boundaries where she’ll feel loved and protected by you and you’ll also protect your own well-being? Perhaps by offering that she’s welcome to tell you where she’s landed after a visit once she’s had 2 days to process? Or perhaps schedule therapy appointments around the visits?",
            "score": 1,
            "replies": []
        },
        {
            "author": "introspectiveliar",
            "body": "I don’t know if you are wrong. You don’t get points for trying to sound fair by saying you are going to try and give both sides, if you don’t do that. Because you only gave your side. Plus, you presented yourself as some level headed, emotionally healthy, paragon of a man and she is an emotionally immature, anxiety-ridden, overly dramatic woman child with “Daddy Issues” (the use of that condescending and derogatory phrase alone makes me believe you are more than wrong but I am trying to be fair) I don’t have enough info to determine if your wife’s response to her father leaving is over the top or reasonable.",
            "score": 1,
            "replies": [
                {
                    "author": "Similar_Corner8081",
                    "body": "Right. Sounds like abandonment issues to me not daddy issues. Just reads like he's talking bad about her because she shows her emotions.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "emax4",
            "body": "Not wrong. It's important to support your partner, but don't let them see you as a therapist, especially if or when you're not a professional therapist.\n\nMy gf has gone above and beyond for me without me asking or expecting it. Because of our issues I didn't always feel equal enough to do the same for her but that's changed for the better. \n\nYou can only do so much, but support without the expectation to fix or cure that daddy issue is not one of those things that should be expected. Maybe there's something else going on causing the sadness too.",
            "score": 6,
            "replies": [
                {
                    "author": "lucidpopsicle",
                    "body": "He didn't say she expected him to bend over backwards for her. He's annoyed that she feels depressed and to be it sounds like she's found a way to work though her feeling even if he isn't going to be supportive. Talking to her friends and writing in a journal and just being sad doesn't give him the right to try to get her to hide her emotions and pretend like she's happy when she's not.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Mission_Ad_8821",
                    "body": "Thanks, yeah, I do think I’m her “therapist” sometimes, and I’m trying to fix that. It’s not intentional, I just enjoy talking about life and am an insightful individual. So a lot of people push problems onto me.",
                    "score": -7,
                    "replies": [
                        {
                            "author": "TastyComfortable2355",
                            "body": "Do not be her \"emotional sponge\" support her to a reasonable degree but do not try to fix her issues that is a job for a professional",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kristtt67",
            "body": "You are not wrong, her sadness seems pretty extreme for the issue.  I mean, if he was dying then I can see it but not for any other reason.",
            "score": 6,
            "replies": [
                {
                    "author": "Mission_Ad_8821",
                    "body": "Good to hear, I thought so too.",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "lucidpopsicle",
            "body": "You both need counseling. While this would be horrible draining for me to deal with as a spouse I would understand I probably need to also work on being emotionally available to a partner who embraces their emotions. In this case I would give a gentile you are wrong. Don't judge people for how they manage their emotions if they aren't lashing out at you over them. It sounded like you want her to hide how she feels and pretend she's fine and that's not a healthy relationship",
            "score": 2,
            "replies": [
                {
                    "author": "Mission_Ad_8821",
                    "body": "Thanks for the fair feedback!",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OverlordMau",
            "body": "I get feeling sad, i mean, live in another country, and i miss my parents, but she sounds like she takes it to the next level where you need to also stop your life for her, i don't know, from the sound of it, to me, it exceeds from i would expect a normal response. Get her to therapy, your partner shouldn't be a therapist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Similar_Corner8081",
            "body": "I wouldn't say she has daddy issues I would say she has abandonment issues. I lost my dad almost 24 years ago  and I still cry sometimes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mimic-man77",
            "body": "What exactly is she expecting from you?\n\nWhy doesn't she get help for this?\n\nYou may also need couples counseling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nicchy",
            "body": "“Going to try to give you each side as objectively as possible.” Immediate next sentence: “My wife is a little emotionally immature.” \n\nBro. YTA",
            "score": 1,
            "replies": []
        },
        {
            "author": "MotherofSons",
            "body": "She sounds like my MIL. When she gets emotional or has a health issue, even minor, she has to call everyone and cries all day. It's exhausting. I just avoid her, but since she's your wife, you gotta do better.\n\nCounseling would really help her. Being sad he's leaving is fine, but ruining an entire day is a lot, imo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkProgress8545",
            "body": "Men and women take everything different.  Maybe she’s sad she has to go back to her normal routine and this is screaming “I need hobbies or people to hang out with” besides you.",
            "score": 1,
            "replies": [
                {
                    "author": "Mission_Ad_8821",
                    "body": "Good point! Definitely something I’ll think about.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ginger630",
            "body": "You aren’t wrong. You do console her, but she wants YOUR life to stop while she’s sad. She expects everyone to drop what they’re doing and make it about her. She’s not only emotionally immature but selfish. \n\nMy own kids don’t even behave that way. They get sad, I console them, we talk about their feelings and we move about our lives. I’d be very concerned if my child cried all day over something like a family member leaving. I’d be on the phone with a therapist or school counselor. Your wife is an ADULT. \n\nShe needs therapy to learn how to regulate her emotions. She also needs to learn that this is a HER problem. You can’t control her anxiety. Even if you sat next to her all day and hugged her, she’d still be upset. That’s not normal.",
            "score": 0,
            "replies": [
                {
                    "author": "Mission_Ad_8821",
                    "body": "Thanks, I agree. I just feel like shit not giving her more. I know it’s the right and probably good for her long run, but sometimes it just feels like I should  as her husband. I have a lot of conflicting feelings about it. I’m part of the problem here (but am trying not to be). I would drop everything and help her for many years… I enabled her.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ginger630",
                            "body": "You are NOT part of the problem. Her father abandoning her is the problem. How she’s dealing with it is the problem. While she cannot help her anxiety about her issues, she needs to get help for them. \n\nOnce she’s feeling better and she’s more rational, talk to her about needing therapy. Maybe even go together so you are better equipped to help her. Maybe the therapist will convince her do therapy on her own.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Live_Western_1389",
            "body": "I’m a cryer when leaving my family, too. But I’m got married soon after I turned 18, got pregnant on the honeymoon & lived across the country from family, so I think I was justified…a little bit, anyway. (DH was in the Air Force when we got married.)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real_Cake_hmm",
            "body": "Your wife needs some help in handling her emotions better. You live with her so you bear the brunt of her sadness however longs it takes her to stop missing her daddy who left after a VISIT! He didn’t die; you shouldn’t “grieve” for that long for someone who just came for a visit. I understand sadness about missing a loved one but being so extremely sad over it for days as an adult and expecting you to drop everything and be sad with her isn’t healthy at all. She needs psychotherapy. Be as supportive as you can be without being burnt out. You’re Not Wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "etabagofdix",
            "body": "So, she doesn't process like you do, so she's emotionally immature? \n\nWhat is it that she wants you to do, specifically, that you find abhorrent? Or is it you just don't want to deal with her emotions?",
            "score": 1,
            "replies": []
        },
        {
            "author": "traciw67",
            "body": "Nw. She sounds exhausting. This would give me the \"ick!\"",
            "score": -1,
            "replies": []
        },
        {
            "author": "Jazz_Man9",
            "body": "Great post !!! No you are not wrong ….. your way of supporting her isn’t what she is expecting so she’s hurt emotionally ?? . Wow really I have seen so many post on the different channels about people feelings . I think she needs to go to counseling \n\nIs she an only child ? I heard no mention of her mother . if her mother is deceased then that could be the genesis of her obsession with the father daughter dynamic . If so it’s also about abandonment and there is nothing you can do but YES DEAR . Sorry he left dear . Can we talk for 5-10 minutes about it . It won’t kill you and bring her comfort . \n\nGood luck",
            "score": 0,
            "replies": []
        },
        {
            "author": "Acceptable_Branch588",
            "body": "Therapy.",
            "score": 0,
            "replies": []
        },
        {
            "author": "lovemyfurryfam",
            "body": "She needs to attend psychological counseling for this. She seeking the unhealthy validation.",
            "score": -2,
            "replies": [
                {
                    "author": "Mission_Ad_8821",
                    "body": "She does see a therapist.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "lovemyfurryfam",
                            "body": "It's the specialized intensive 1 that I'm thinking of because that therapy isn't really working.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}