{
    "title": "Am I wrong for cutting off this guy?",
    "author": "Important_Book8023",
    "subreddit": "amiwrong",
    "rank": 9,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/amiwrong/comments/1jednhq/am_i_wrong_for_cutting_off_this_guy/",
    "id": "1jednhq",
    "selftext": "met this guy on Reddit, and we instantly clicked. We had long, fun conversations for almost two months. I was the one who added him first, but after that, he was always the one initiating. Sometimes, though, he'd just disappear in the middle of a conversation or take a while to reply, which made me feel like the interest wasn’t mutual. I still don’t know if it was, but what I do know is that he was aware I liked him. And whenever he initiated, I always matched his energy.\n\nEventually, I asked for his Instagram, and we started talking there. One day, while chatting, he told me that all online conversations eventually fade out, and so will this one. That completely threw me off. I got confused and didn’t know what he meant. It felt like he was either preparing me for him to ghost me or just downplaying whatever connection we had before anything could even happen.\n\nI asked him what he meant, but his explanation was vague and didn’t clarify how he actually saw me. He said something about us ending up as strangers and even joked that I might inspire him to write a song one day. He could tell I was confused by what he was saying, yet he still doubled down on it—offering no explanation beyond that’s just the rational reality.\n\nThat moment stuck with me. After a few more conversations, I couldn’t shake the feeling that I was investing in something that wasn’t real.It felt like I was holding onto something one-sided and that he was so ready/okay to just let go. \n\nSo, I decided to be direct and told him we shouldn’t talk anymore. I didn’t want to play guessing games.\n\nNow, I’m wondering—was I too quick to cut him off? Or was that comment a red flag, and I made the right choice?",
    "comments": [
        {
            "author": "Intrepid_Raccoon_626",
            "body": "Not wrong. Sounds like that guy has issues he needs to work through.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkProgress8545",
            "body": "You’re good.",
            "score": 1,
            "replies": []
        }
    ]
}