{
    "title": "Am I wrong for having followed my gym crush on social media?",
    "author": "skylourdes",
    "subreddit": "amiwrong",
    "rank": 12,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/amiwrong/comments/1jegq5k/am_i_wrong_for_having_followed_my_gym_crush_on/",
    "id": "1jegq5k",
    "selftext": "\n\nMy gym crush and I (27F) had a few conversations in the past, all initiated by him. He wouldn’t talk to anyone else, seemed pretty introverted, so him approaching me made me think that he could be interested in a friendship, at least. I’d always keep the conversation going to show him I liked talking to him. \n\nFor a whole month, he stopped coming to the gym, and I started to wonder if he had switched to a different one. Still, I hoped I’d run into him again. I have terrible social anxiety, and I regretted not asking for his name when I had the chance.\n\nAfter two months of not seeing him, I finally moved on… until I stumbled across his profile on Instagram. The gym’s page follows him, so his account popped up as a suggested follow.\n\nI didn’t want to seem like a creep, so I thought it through carefully. Eventually, I decided to follow him. But then… he declined my request and sent me a follow request instead!! It wasn’t just that he ignored my request —he actively declined it right away. What? I mean, one usually checks the other person’s profile first and then decides what to do: either accept or decline.\n\nI didn’t message him because, well, he rejected my request. I don’t want to come across as pushy or anything.\n\nAt this point, I’m just waiting for him to unfollow me. I’ve never had this happen before —has it ever happened to you? I feel a little shitty rn.",
    "comments": [
        {
            "author": "PreviousMotor58",
            "body": "This isn't his first rodeo",
            "score": 1,
            "replies": []
        },
        {
            "author": "d8ed",
            "body": "\"Hey you popped up in my follow suggestions and I hadn't seen you at the gym in a couple of months and wanted to say hi.. So hi\"\n\n  \nStop feeling shitty and just say hello FFS.  Worst case he can ignore you and you move on, like you already did remember?",
            "score": 1,
            "replies": []
        }
    ]
}