{
    "title": "Trans athlete rights should not be a federal issue. AIW?",
    "author": "Pile-of_Junk",
    "subreddit": "amiwrong",
    "rank": 14,
    "score": 0,
    "upvote_ratio": 0.4,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.reddit.com/r/amiwrong/comments/1jegtof/trans_athlete_rights_should_not_be_a_federal/",
    "id": "1jegtof",
    "selftext": "I feel like this issue should trickle down to the lowest possible level. Why do we continue to rely on the federal government to solve all of our issues with law?\n\nFor context, there are fewer than 10 out of 510,000 collegiate athletes that identify openly as trans, so it’s nowhere near being a widespread issue.\n\nI understand and appreciate the argument from both sides. I support the right of trans athletes to compete, and woman (by birth) have every right to be concerned for their safety and competitiveness regardless if everyone agrees with the scientific evidence (or lack there of) to support that issue. But this also applies to every athletic competition regardless of gender, especially in combat sports.\n\nI also personally don’t buy into the safety aspect to justify FEDERAL involvement. Rules, regulations, weight classes, and professionally trained mediators (refs etc) exist for a reason. I used to wrestle in high school in the same-ish weight class as a girl on our team. She kicked ass and we were sometimes neck and neck to earn starting spot, else the loser had to compete for a different weight. I watched her mop the floor with other guys, and likewise get her ass whooped…just like me and every other wrestler that wasn’t #1. We all cheered, we all shook hands after the match, and nobody was offended. I’ve also seen male athletes get their ass handed to them by a woman on the basketball court, volleyball court, and in the boxing ring. Sometimes there’s levels to talent that you can’t beat with the help of genetics. Likewise there’s levels of genetics that simply can’t be beat with talent. Thats what’s fun and interesting about competitive sports. It goes both ways.\n\nIn the end I just don’t think it can or should be solved with federal law, or even state law for that matter. Leave it to the organizations, athletic commissions, and individual athletes. Have these people vote and agree before entering competition. No one is forcing a professional boxer to sign a contract to enter the ring if they don’t think they can take their opponent, and the same should apply at every non-professional level. I only see this becoming a controversial issue if they’re competing for the top spots, and the trans athlete for instance has yet to begin HRT. It should be so simple. If every party signs off and accepts the outcome, there’s no room for dispute or challenge. If #3 refuses to sign off or to compete 1:1 out of fear of being injured or bumped from the platform, she should have every right to do so. Allow the trans athlete to compete against those who do sign off, have the commission create an Honorary placement, and let the individual parties deal with the repercussions bound to their agreed upon conditions. If you agree to compete and win, congrats you get to brag about beating a trans athlete if you so choose. If you agree and lose, that’s also on you. If you disagree and win, also congrats because you’ve already earned your spot at the top, but you shouldn’t  get to cloak your ego and moral compass behind federal law.\n\nNOBODY is immune from social repercussions. Everyone has the 1st amendment right to scrutinize the situation from either direction, and it cannot be avoided either way. I genuinely feel bad for the trans athletes that have to deal with the negativity from society, but she should also accept that other woman should have a choice as well. \n\nAm I wrong? What am I missing here? \n\nAgain I acknowledge and appreciate the controversy and argument from both sides, and am only interested to understand why it should be handled with state and federal law, and not by the sports or athletes themselves. ",
    "comments": []
}