{
    "title": "What can socialism do for YOU",
    "author": "Hacksaw6412",
    "subreddit": "LateStageCapitalism",
    "rank": 322,
    "score": 87,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 3,
    "url": "https://v.redd.it/nkdm98t6elie1",
    "id": "1incfml",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "PPPRCHN",
            "body": "Okay then, I have to ask, if socialism puts the money back to the people- by giving them bigger wages, what's stopping it from basically becoming an aristocracy?\n\nCertain trades are far more profitable than others, so what would change for say, a family of iron workers vs a family of sewage cleaners? They're both necessary, but obviously not to the same degree.",
            "score": 1,
            "replies": [
                {
                    "author": "Straight-Razor666",
                    "body": "You need to read Marx and what he said about commodity fetishism.  Under socialist systems goods and services are produced and distributed based on human need and value to society, not for profit.  You question really doesn't mean anything because you are framing it under a capitalist paradigm where \"profit\" is used to measure a resource's value instead of the benefits resources have to humanity.  People earn various wages under socialism, but all are guaranteed a wage sufficient for a meaningful life and have the rights to housing, health care, education, nutrition, etc.   \n\nMost importantly, money isn't the motivating force in socialism.  To me, a sewage worker is a hero.  It's awful work and they are great people for doing it, and they are recognized as such in meaningful and material ways in a socialist system.  In the end, it's the value the work and production has for society that matters.  And all work people do is focused on that effort, not making some sociopath richer.\n\nShake off your bourgeois programming and get a copy of the Manifesto and read it.  Then read Principles of Communism by Engels.  Then go learn about Marx's labor theory of value.  It's all out there and easy to understand.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}