{
    "title": "Any good newspapers I can subscribe to?",
    "author": "sidjournell",
    "subreddit": "LateStageCapitalism",
    "rank": 269,
    "score": 1,
    "upvote_ratio": 0.55,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iqa1go/any_good_newspapers_i_can_subscribe_to/",
    "id": "1iqa1go",
    "selftext": "I enjoy paper newspapers but seeing as how most main stream ones have lost their way to put it mildly. Are there any national level newspapers worth subscribing to? I’m US based. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "tenantofthehouse",
            "body": "Sounds dumb but the Financial Times",
            "score": 6,
            "replies": [
                {
                    "author": "tenantofthehouse",
                    "body": "FT, or if you're a podcaster, Africa Confidential is only $1500/yr.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Manufacturer_1911",
            "body": "https://communist.red/subscribe/",
            "score": 2,
            "replies": []
        },
        {
            "author": "BestKnee5618",
            "body": "I would recommend local. You’re not going to get any class consciousness but if it’s locally owned you will get articles without product placement, you will get someone asking questions when something comes up. You can also let them know you’re interested in articles with a class consciousness angle. The corporate rag wouldn’t care.",
            "score": 2,
            "replies": []
        },
        {
            "author": "blanky1",
            "body": "Where are you based? I have reccs for the UK.",
            "score": 2,
            "replies": [
                {
                    "author": "DrunkStoleATank",
                    "body": "When my mum was in a hospice, dad asked me to get him a paper from the shop. \"If they haven't got the Daily Mail get me anything\". So, I got him the Morning Star. 🤣",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "sidjournell",
                    "body": "Oh dang. I can’t believe I missed that critical piece of information. I’m in the US.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ErectionQuest",
            "body": "Daily Wire",
            "score": -14,
            "replies": [
                {
                    "author": "0ff_The_Cl0ck",
                    "body": "Wrong sub bruh",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}