{
    "title": "Capitalism is just feudalism with extra steps",
    "author": "MrFenric",
    "subreddit": "LateStageCapitalism",
    "rank": 176,
    "score": 680,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iuoer9/capitalism_is_just_feudalism_with_extra_steps/",
    "id": "1iuoer9",
    "selftext": "It may have taken a while, but the 1% live like kings, and the general population will starve if they don't serve them - Oliver Cromwell must be spinning in his grave",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "LetterheadAshamed716",
            "body": "Replaced chattel slavery with debt slavery",
            "score": 155,
            "replies": [
                {
                    "author": "rumagin",
                    "body": "David Graber has a great paper on this\n\n'Turning Modes of Production Inside Out Or, Why Capitalism is a Transformation of Slavery' - [https://davidgraeber.org/wp-content/uploads/2006-Turning-modes-of-production-inside-out-short-version.pdf](https://davidgraeber.org/wp-content/uploads/2006-Turning-modes-of-production-inside-out-short-version.pdf)",
                    "score": 46,
                    "replies": [
                        {
                            "author": "Solomon_Grungy",
                            "body": "Maaaan I love reading me some David Graeber. RIP to my favorite anarchist anthropologist!",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "FlummoxedFlummery",
                                    "body": "The GOAT",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MrFenric",
                    "body": "Exactly - slaves only got food, lodgings and basic care for their labour. Wage workers generally don't have significant expendables income and live from month to month. Basic wages are barely keeping up with necessities- most people are free in name only, even if they don't get whipped",
                    "score": 49,
                    "replies": []
                },
                {
                    "author": "jackist21",
                    "body": "There was almost no slavery in the feudal system.  Slavery was reintroduced during the transition to capitalism.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ITCoder",
                            "body": "What about serfdom ?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "jackist21",
                                    "body": "Serfdom is fundamentally different than slavery.  It's a mixture of rights and obligations.  In this sub, we're generally a fan of union because they protect workers.  Imagine living where you work with your co-workers and family from birth to death with your boss being unable to fire you or evict you -- that's serfdom.  Labor had considerable rights enforced by real-world solidarity that today's workers lack.  Now some people didn't like the \"small town\" environment or restrictions of serfdom.  If you ran away to a town and lived there for a year, then you were \"free\" of the serf's rights/obligations.  Lots of people went from free to serf and vice versa so it wasn't a fixed social status.  Slavery is ownership of people with no choice / options / rights.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Low-Pangolin-8932",
                                            "body": "Serfs had rights. Lol U delusional you not leave the land without the lords permission. You can't marry without the lords permission. Yes u had a house and land but u were forced to give some of ur crops away as a tax. Any children u had while u were a serf became the lords property. Most serfs died in slavery.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FeonixRizn",
            "body": "With the important distinction that even kings could be overthrown if sufficient numbers of serfs rose up against them. Men in armour with poleaxes Vs thousands of pitchforks and sticks is a far more favourable matchup than a bunch of unorganised rebels with whatever ammo they could buy before the revolution against aircraft carriers and cruise missiles.\n\nThe treasury of a King was also a tangible thing, their wealth actually existed and could be fought over or captured, money now is just numbers on a screen, impossible to seize if the ruler controls the apparatuses through which it is managed.",
            "score": 70,
            "replies": [
                {
                    "author": "Arisotura",
                    "body": "Even the way political institutions are built - it's like you have a figurehead that acts as a lightning rod for popular dissent. They can be removed, by election or by force, but in the end another figurehead takes their place and the system continues on with no changes.\n\nEven if you were to storm your government's buildings -- then what? The true power is elsewhere.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "MrFenric",
                            "body": "Exactly, politics is just the color they paint the monster, the monster is always there. Big capital is the monster, and master, behind the state",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Erraunt_1",
            "body": "In the sense that there's exploitation--exploiter and exploited--yes.\n\n\nIn the terms of social arrangements for exploitation, no.\n\n\n>It may have taken a while, but the 1% live like kings, and the general population will starve if they don't serve them\n\n\nThis has been happening under capitalism for a long time. Irish potato famine was going on while the royals laughed it up in London. Also see the book, \"Late Victorian Holocaust.\"",
            "score": 18,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "Agreed, but in the potatoes famine, those were aristocrats with generational wealth and governement ordained titles. Now it is the billionaire class with no appointment nor responsibility to a crown or people - I'd say it's worse",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Erraunt_1",
                            "body": "The leadership of the genocidal British empire was as bad, at least, as the ghouls of today.\n\n\n\nIn literal numerical terms, many many times more starved to death under the British empire's free market fundamentalism in the late Victorian period than are starving to death currently.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "MrFenric",
                                    "body": "Starving, no, we are not starving. I would argue that we are losing agency and choice though",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zachmorris4184",
            "body": "Not really, capitalism was actually an advancement from feudalism in many ways, but it looks like were basically headed back to a new form of feudalism, techno-surveillance state feudalism.",
            "score": 23,
            "replies": [
                {
                    "author": "rjojo",
                    "body": "We can end it whenever we want, we outnumber them million to one, but I guess that's why they put so much energy into keeping us divided.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrFenric",
            "body": "https://prospect.org/economy/rise-of-neo-feudalism/",
            "score": 6,
            "replies": []
        },
        {
            "author": "zeth4",
            "body": "[Cory Doctorow has a great article about how capitalist gravitate towards feudalism](https://locusmag.com/2024/03/cory-doctorow-capitalists-hate-capitalism/)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Repulsive_Comfort_57",
            "body": "It's almost as if all history is the history of class struggle or something.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Forgotlogin_0624",
            "body": "What we’re in the process of developing is techno feudalism, which is feudalism without the previous social technology of the church to manufacture consent.  The disparity between the worker and the ruler is such that they don’t need us to believe in the society anymore.  From here on out it’s naked force that will do the trick.\n\nWhen I have to explain feudalism to people I prefer to explain the arrangement that they, the worker, lives under.  Who gives a shit about political arrangements that you’re not part of.  We’re not nobility’s or clergy, we’re workers.  Feudalism for us is when you have to kick up a percentage of your product, your labor, to someone else.  In exchange that someone doesn’t kill you, or allow someone else to kill you.  Unless they do.  And that’s it, no services are provided, it’s not taxes it’s protection.  That’s what we’re about to get back.  They’re going to end every service the federal government provides, your taxes and requirements to obey their laws will not change.",
            "score": 4,
            "replies": []
        },
        {
            "author": "233up",
            "body": "Yes, that's how Marx describes the progress towards communism and the withering of the state.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jackist21",
            "body": "This isn’t remotely accurate.  There are some holdovers from feudalism, but it’s a fundamentally different system.  The land owning warrior class is gone, the religious class is small and weak, and the wealthy capital class is in charge.",
            "score": 3,
            "replies": [
                {
                    "author": "lich_house",
                    "body": "The capital class is backed by one of the most militarized police forces on the planet.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MrFenric",
                    "body": "If you replace the warrior class with the capital class, it looks pretty similar to me...",
                    "score": 0,
                    "replies": [
                        {
                            "author": "jackist21",
                            "body": "That's because you--almost certainly an urbanite who does not work the land--have no idea what a land-owning warrior class in agricultural society looks like.  The two systems are similar in that there are people in classes above your class in a social hierarchy, but the hierarchy and structure of the means of production are totally different.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "MrFenric",
                                    "body": "In the fuedal age, the farmers did not own the land, the lord did. Which worker owns the factory? How many farmers are truly independent, and how many work for massive corporations? How many that work the land directly benefit from their toil, and how many get money from their lords and masters?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "jackist21",
                                            "body": "Serfs didn't own the land, but they couldn't be separated from it.  A work environment where you can't be fired or evicted is fundamentally different than today's working conditions.  The idea that anyone could be \"independent\" was foreign to the feudal system -- everything was recognized as interconnected.  \"Independence\" as a \"good\" thing was a product of liberal ideology that is post-feudal.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "MrFenric",
                                                    "body": "Serfs could *absolutely* be evicted and replaced!",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Imaginary_Mirror2245",
                                                            "body": "In the overwhelming majority of cases they couldn’t. They were hereditarily bound to the land. In certain periods such as after the plague the lords could not even afford to evict their serfs.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "I will check this out - sounds very interesting",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fun-Cricket-5187",
            "body": "Um. Certainly not...Socialism wasn't possible in feudalism.",
            "score": 1,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "With the global inequality of wealth, I'd argue it's not possible now",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "commoddity",
            "body": "I've been really enjoying Yanis Varoufakis' new definition of the state of things as 'Technofeudalism'. Highly recommend his book by the same name or any of his many recent podcast/interview appearances. \n\ntl;dr:  \n\"Technofeudalism—you might already have some sense of what the term means, even if you haven’t sat down and unpacked it fully. A mode of production with one hand in the past and another the future—an updated form of feudal relations married to an advanced epoch of the productive forces that mark late capitalism—forces that we often associate with futuristic feats of technology. Except this is not some kind of techno-utopia—it’s really a dystopia.\"\n\n  \nTaken from his recent interview on Upstream where he gives a solid breakdown of the topic:\n\n[https://podtail.com/en/podcast/upstream/technofeudalism-w-yanis-varoufakis/](https://podtail.com/en/podcast/upstream/technofeudalism-w-yanis-varoufakis/)",
            "score": 1,
            "replies": []
        },
        {
            "author": "thetasteoffire",
            "body": "There is exploitation and misery, but the relationships to production are very different in important ways. And I hope Cromwell is miserable in hell regardless.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fremenator",
            "body": "Of you watch Richard Wolff he describes it this way as well.  Very interesting perspective.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imaginary_Mirror2245",
            "body": "You’re describing class society, not specifically feudalism. Any society with appropriators and appropriated have the effects of capitalism you’re describing. Feudalism is a fundamentally different system and has more in common with slave societies than with capitalism.",
            "score": 1,
            "replies": [
                {
                    "author": "MrFenric",
                    "body": "My thought is around wage slavery and oligarchy - it is earily similar to the fuedelist past",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}