{
    "title": "Kill the boer: a note on etymology",
    "author": "RupertHermano",
    "subreddit": "LateStageCapitalism",
    "rank": 165,
    "score": 102,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1ivnsel/kill_the_boer_a_note_on_etymology/",
    "id": "1ivnsel",
    "selftext": "As South Africa is back in the news and there have been a few posts about the country and the Trump regime's targeting of it, the song \"Kill the boer\" has come up. I thought I'd add a note on the etymology of \"boer\" to provide better context to the protest song.\n\nAs many will know, \"boer\" literally translates as farmer. British colonials in SA (remember, the Cape Colony was territory over which the Dutch and British fought each other) likened the non-British settlers in South Africa to \"boors\"; eventually \"boer\" became associated with (white) Afrikaans-speaking people, who were mostly farming folk.\n\nBUT, \"boer\" is - or was - also slang for police. \"Kill the boer\" originally was directed at police, i.e. the ultimate enforcers, representatives and symbol of apartheid oppression.\n\nHere is novelist JM Coetzee on a slogan with similar intent, \"One settler, one bullet\":\n\nhttps://preview.redd.it/4n01f38w4qke1.png?width=418&format=png&auto=webp&s=20e78a12b2086395559b5f159954c340759bb837\n\nfrom GIVING OFFENSE: ESSAYS ON CENSORSHIP (University of Chicago Press, 1996)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "RupertHermano",
            "body": "I see some posters doubt the accuracy or veracity of my etymology. Here is the [Dictionary of South African English](https://dsae.co.za/project/about-the-dictionary) with one of the glosses for \"boer\":\n\nhttps://preview.redd.it/d1s6shwe9ske1.png?width=1586&format=png&auto=webp&s=2ed16500f5c89974423a80b740c09fddd7fb9db9\n\n(Edit: Damn, a boer on here got corrected but he was so confidently incorrect, he deleted. Don't you hate it when that happens...)",
            "score": 18,
            "replies": []
        },
        {
            "author": "LuxTheSarcastic",
            "body": "Oh neat so it's even more based",
            "score": 25,
            "replies": [
                {
                    "author": "LuxTheSarcastic",
                    "body": "And I think DOGE basically counts as cops these days doesn't it",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "ohnicholas",
            "body": "https://preview.redd.it/5zfxu2osdrke1.jpeg?width=2317&format=pjpg&auto=webp&s=3cbcece4f6f82f95444fd965cdc3ff3e549df5d2\n\nI made this shirt a couple of days ago… seemed fitting (sorry if not allowed)",
            "score": 10,
            "replies": []
        },
        {
            "author": "EndTimesBeUponYe",
            "body": "Kill The Boer!",
            "score": 3,
            "replies": []
        },
        {
            "author": "GuybrushThreepwo0d",
            "body": "I'm sorry dude but \"boer\" is absolutely not slang for \"police\" lol",
            "score": -15,
            "replies": [
                {
                    "author": "RupertHermano",
                    "body": "Oh, my community, friends and I, who grew up using that word to signify “cops”, must have been living in an alternate reality. Smh.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "RupertHermano",
                    "body": "Dictionary of South African English:\n\nhttps://preview.redd.it/jq61w6uz9ske1.png?width=1586&format=png&auto=webp&s=3be48a1c94634072b116ee71068b138d51a698af",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "MattSouth",
                    "body": "It is in a limited context, but as I understand it is just used by Afrikaans speakers. I don't see Zulus for example using that term.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "RupertHermano",
                            "body": "It may actually come from Zulu, see \"[amabhunu](https://dsae.co.za/entry/amabhunu/e00197)\" in the Dictionary of South African English. It's cross-referenced with \"boere\" n.6 in same dictionary.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "GuybrushThreepwo0d",
                            "body": "I... Am an Afrikaans speaker",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "MattSouth",
                                    "body": "Nou maar ja, party ouer mense en Kapenaars verwys na die polisie as boere, spesifiek speedcops. Dit is ook iets wat ek al gesien het. Maar ek twyfel 'n Afrikaanse slang woord soos dit sal gebruik word deur nie-afrikaans sprekers nie.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RupertHermano",
                                            "body": "Toe ek ń laaitie was het mense wat beide Engels and Afr praat dit gebruik.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "GuybrushThreepwo0d",
                                            "body": "Dis vreemd, ek kom van die kaap af maar het dit nooit teëgekom nie. Party diep Afrikaanse  mense sal dalk \"boer\" sê as 'n vorm van aanspraak, maar ek het nooit gehoor dat iemand na die polisie só verwys nie",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "RupertHermano",
                                                    "body": "Miskien was jou sosiale sirkel bietjie eng?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "GuybrushThreepwo0d",
                                                            "body": "Ek meen, sienende dat ek op reddit is is dit 'n sterk moontlikheid",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "RupertHermano",
                                                                    "body": "Net omdat dit nie in jou verwysingsveld lê nie, beteken dit nie dat iets nie bestaan nie, nê…",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "capnza",
            "body": "Regardless of it's history, it's generally considered to be extremist language now and the political party run by the guy who most often says it only polls at about 9.5%",
            "score": -11,
            "replies": []
        },
        {
            "author": "oliviermichel",
            "body": "I’m just confused though. Is this making the term defensible ? As in, it’s not saying kill the farmer, it’s only saying kill the police, therefore it’s fine ?",
            "score": -2,
            "replies": [
                {
                    "author": "RupertHermano",
                    "body": "Not my game. I'm providing historical, sociolinguistic context to the song or slogan's recent (re-)deployment as a meme in Nazi disinformation campaigns.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "monoatomic",
                    "body": "'Defensible'?",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}