{
    "title": "The U.S. Economy Depends More Than Ever on Rich People | The highest-earning 10% of Americans have increased their spending far beyond inflation. Everyone else hasn’t.",
    "author": "ilir_kycb",
    "subreddit": "LateStageCapitalism",
    "rank": 130,
    "score": 122,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.wsj.com/economy/consumers/us-economy-strength-rich-spending-2c34a571",
    "id": "1ixkojt",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anti_colonialist",
            "body": "Well, seeing that they've become $5 trillion richer over the last five years and we have become $5 trillion poorer. It makes sense that they're spending more than we are.",
            "score": 78,
            "replies": []
        },
        {
            "author": "Bongiovanni",
            "body": "Who writes this stuff? It reads like it’s by rich people for rich people who want to feel superior. This article glorifies parasitic investors and denigrates working people who own less than ever. I can’t tell if it’s an attempt at propaganda or completely out of touch. The bottom 90% might be spending less because they don’t have enough, meanwhile they’re talking about the rich like they’re doing some charity for the economy. Is the WSJ trolling us or are my plebeian eyes just not meant to see this bourgeoisie literature?",
            "score": 63,
            "replies": [
                {
                    "author": "4spooky6you",
                    "body": "It's manufacturing consent for more tax cuts for the Capital owners; it's just a modernized packaging of trickle down economics.",
                    "score": 37,
                    "replies": []
                }
            ]
        },
        {
            "author": "StreicherG",
            "body": "It’s easy to tell where I am. Stores are closing one after another, in order of how “unnecessary” they are. The Fancy Olive Oil company and the Cinnabon were the first to go. Now they are being followed by clothing stores and the movie theaters.\n\nOnly things holding out right now are grocery stores and gas station lottery sales.",
            "score": 26,
            "replies": [
                {
                    "author": "Bongiovanni",
                    "body": "Almost like the working class are the actual economic engine of the economy and without us it all crashes.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "italiangoalie",
                    "body": "That’s one economy. The digital economy is the others, that’s why you increasingly see more “luxury” brands and VIP experiences than ever before. New arenas are not constructed for capacity, but for maximum revenue via box suites for corporations/extremely wealthy",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cthulusuppe",
            "body": "When inflation is high, the wealthy are highly incentivized to spend their cash on assets. Sitting on devalued currency is a bad idea for anyone, but worst for them.  I would be surprised if their spending was ever below inflation rates.\n\nEveryone else is maxed out.",
            "score": 16,
            "replies": []
        },
        {
            "author": "EmpressofFoxhound",
            "body": "Not to their workers lol",
            "score": 7,
            "replies": []
        },
        {
            "author": "ilir_kycb",
            "body": "Archive.today link (no Paywall): [U.S. Economy Being Powered by the Richest 10% of Americans - WSJ](https://archive.ph/xcOwb)",
            "score": 5,
            "replies": []
        },
        {
            "author": "MissionFormal209",
            "body": "Economy depends on rich people spending, but not on everybody else who produces the goods and services that they're spending their money on. Makes perfect sense.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jangussupreme",
            "body": "Hmm, maybe we should redistribute the wealth so that the rest of us can help prop up the economy with our spending and not just our exploited labor? I’m sure the oligarchs would be eager to share their spending burden since it’s so vital to our economy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "I noticed this years ago and said this much... Only thing holding up the house of cards is the joker card.\n\nhttps://i.redd.it/4hbpv8iti7le1.gif",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheEPGFiles",
            "body": "Yeah, well, since their money is worth less, because of the aforementioned inflation, it would be mathematically impossible for them to spend more than they can possibly have, RIGHT?\n\nWhoever wrote this, probably thinks they're some kind of economist genius, but nope, this is perfect nonsense.",
            "score": 2,
            "replies": []
        }
    ]
}