{
    "title": "Schrodinger's Socialist",
    "author": "Anti_colonialist",
    "subreddit": "LateStageCapitalism",
    "rank": 64,
    "score": 3407,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 15,
    "url": "https://i.redd.it/kpxxidxj70me1.jpeg",
    "id": "1j0r0gw",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaptainColdSteele",
            "body": "*poor people aspiring for class solidarity with the wealthy",
            "score": 96,
            "replies": []
        },
        {
            "author": "throwaway264269",
            "body": "I found this fun. Let's see if I can over explain it.\n\nSocialism is wrong and evil! And by evil I mean it doesn't serve capital, but that's too literal... let's say that me not having capital is as bad as you poors not having food! Yes...\n\nAnd also, giving free food costs money which is bad! It may even be as bad as... what are you poors afraid of... right, socialism! Giving free food would be scary socialism!\n\n...Jesus, this kind of made sense for a moment. Got scared I was going senile... which would be bad, because then I might accidentally become president. Not good.",
            "score": 44,
            "replies": []
        },
        {
            "author": "Jojithewise",
            "body": "Doublethink",
            "score": 16,
            "replies": [
                {
                    "author": "Far-9947",
                    "body": "Cognitive dissonance clowns.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Optimal_Effect1800",
            "body": "Well, Capital will do its best to ensure no food in socialist country, think of blocade of Cuba by USA for example.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Kaymish_",
            "body": "We're having this fight right now here in New Zealand. About 5 years ago when Jacinda Ardern and her labour party were in power the ministry of education started a lunch in schools programme with delicious nutritious food from local providers. About 18 months ago a new center right coalition was elected and one of the co leaders is an American chaos agent from the atlas network. He has systematically destroyed both the public health system so they can privatize it into an American style monstrosity and destroyed the food in schools programmes including the school lunch replacing it with a British company that has already lost contracts with prisons and hospitals because they couldn't provide suitable food on time. He is crowing about the private market stepping up but in the meantime kids are going hungry.",
            "score": 10,
            "replies": []
        },
        {
            "author": "FourthmasWish",
            "body": "Paradoxical characterization, like when they describe the left as simultaneously supremely incompetent and supremely powerful (or cunning). It's a means of delegitimization, covering all the bases to then claim either point when evidence appears to fit it.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Sugbaable",
            "body": "I think the thinking is: if children can eat healthy, that will take away the food I can eat, and then I won't be able to eat half pounder burgers so cheap.  Which means I'd be starving!\n\nWhich, if the environment wasn't a problem, wouldn't really be the case.  We waste like 40% of our food a year in USA",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Professor-8452",
            "body": "Well, duh, the children will eat all the food",
            "score": 2,
            "replies": []
        },
        {
            "author": "Intelligent_Dealer46",
            "body": "Sponge bob meme's leftist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "172brooke",
            "body": "Fire truck",
            "score": 1,
            "replies": []
        },
        {
            "author": "Consistent_Body_4576",
            "body": "capitalists usually refers to the bourgeoisie, not people who ideologically advocate for capitalism",
            "score": 1,
            "replies": []
        },
        {
            "author": "WillemRWD",
            "body": "Quite simple, socialist regimes gave all the nation's food to children letting everyone else starve, duh",
            "score": 1,
            "replies": []
        },
        {
            "author": "SrSecretSecond",
            "body": "potential goomba fallacy? Tho libs don't really care for what's true and what will happen in the future, so whatever",
            "score": 0,
            "replies": []
        }
    ]
}