{
    "title": "Trump sends crypto prices soaring after surprise announcement of strategic government reserve",
    "author": "GregWilson23",
    "subreddit": "LateStageCapitalism",
    "rank": 32,
    "score": 287,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 32,
    "url": "https://apnews.com/article/trump-crypto-bitcoin-digital-assets-reserve-2f4246434a657f248cd85296f14382f9",
    "id": "1j2q8j1",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Erocdotusa",
            "body": "May as well delete this post,  he already crashed it again",
            "score": 201,
            "replies": []
        },
        {
            "author": "Online_Commentor_69",
            "body": "![gif](giphy|3oriO5t2QB4IPKgxHi)",
            "score": 222,
            "replies": [
                {
                    "author": "Online_Commentor_69",
                    "body": "https://preview.redd.it/4hpa0lpryjme1.png?width=624&format=png&auto=webp&s=55c38bedf29d03f64b11975627d1c28ec7c53b9f\n\nlife comes at you fast.",
                    "score": 114,
                    "replies": [
                        {
                            "author": "____trash",
                            "body": "think that might be the last pump itll ever get",
                            "score": 15,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ashibah83",
            "body": "Rug pull in 3.....2.....",
            "score": 91,
            "replies": [
                {
                    "author": "n3m37h",
                    "body": "That happened over a month ago",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Inevitable_Silver_13",
                            "body": "That was the last rug pull.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "BlackGabriel",
                                    "body": "Yes we’ve had one rug pull but what about second rug pull?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "ashibah83",
                                            "body": "Dinner rug pull? SUPPER RUG PULL????",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "DB-601A",
                                            "body": "ahh the old double rug pull technique.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "IguessIliveinaCHAIR",
            "body": "ELI5: for what reason/benefit would there be to put cryptocurrency as a strategic reserve? Other than fucking over the American people, many of whom do not have or are not investing in cryptocurrency?",
            "score": 64,
            "replies": [
                {
                    "author": "uber_poutine",
                    "body": "Because if he says this will happen, line go up, and he and his friends can sell their holdings for more money.",
                    "score": 96,
                    "replies": [
                        {
                            "author": "CaptinACAB",
                            "body": "And that’s exactly what happened.",
                            "score": 42,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Straight-Razor666",
                    "body": "basically what you've said.  \"cui bono?\"...Parenti stressed that we must ask this question at all times.  When the bouge speak about \"our democracy\" they mean it for them, not us unwashed poors.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "GooseinaGaggle",
                    "body": "People might think that any crypto or meme coin is a valid investment. They buy ridiculous amounts of trump coin. When trump can sell his 80% trump coin he'll get rich and the price of trump coin will plummet making those who bought them lose money",
                    "score": 11,
                    "replies": [
                        {
                            "author": "VintageVitaminJ",
                            "body": "If you buy Trump coin, you get what you deserve",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "nmkensok",
                                    "body": "Especially since this isn't even the first time it's happened with TrumpCoin specifically",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "etoilech",
                    "body": "Corruption.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Straight-Razor666",
            "body": "lol no...BTC is \\~86k USD right now, down from the high of 103 +/- from a few months ago.  Crypto has lost value recently, so there's that.",
            "score": 29,
            "replies": [
                {
                    "author": "JeffThrowSmash",
                    "body": "High was nearly 109k in January. And currently it's ~84k, after spiking to almost 94k yesterday. It dropped to ~78k last week. I could see it dropping further; this cycle is much harder to predict than previous ones. \n\nFor reference: In early 2022, when it became evident that there would be a sustained pullback on cryptocurrencies, I suggested that the United States Reserve might want to covertly begin to accumulate a reserve if Bitcoin dropped under 30k, and to accelerate buying if the price went close to 20k or under. It did drop, the US did not accumulate.  Build up a portfolio of 1-4M Bitcoin for well under $100B. (Stimulus checks were far far higher than these numbers)\n\nAt 4M Bitcoins, the US reserve would hold almost 1/4 of the recoverable BTC in the world or more. And it would make the remaining 17M (minus the lost forever coins which is probably 2-6M already) even more scarce for investors and speculators. So if the price of BTC rose to $1M, the US government would have several Trillion to back its ability to honor its debt/deficit.\n\nCurrently, the price to hold those 4M Bitcoin is nearly $500B, which is a lot more than DOGE can ever cut from the federal workforce (and elsewhere) and nearly the equivalent of the Turmp tax cuts).  Also, the United States is not in a stable enough position (big stick) to make those coins valuable to others. Or itself.\n\nAnyway I've been following this for \nA long time and it's really stupid for the US Government or Reserve to blab their mouths before they were ever to pursue such a tactic. And it would be incredibly stupid to do it right now, when Bitcoin is nearly its All Time High, with an economy in turmoil vs 2022.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jadsonbreezy",
                            "body": "Your framing of \"it's really stupid\" takes what they are doing at face value of actually wanting a crypto reserve. They don't, just wanted the pump.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "JeffThrowSmash",
                                    "body": "Well in those terms: for anything that they do, they only want to see how much traction (controversy) it gains. The more we click, the harder they stick. And we all lose so hard in this stupid petty game they play unless someone can enlighten the enablers (MAGAstan) that they're the most victimized out of everyone.\n\nI think I have (or did have) the tools to do so but I am constrained by my environment.\n\nI'm in a similar relationship (have been for a very long time) and my only respite from the day to day is that I am able to gain huge amounts of insight about how people think and how they're likely to respond to things. This knowledge stays in my household so nobody can be helped by it.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "pinniped90",
            "body": "Trumpers getting rugged, couldn't happen to a bunch of nicer people.",
            "score": 10,
            "replies": []
        },
        {
            "author": "233up",
            "body": "Bitcoin is down 7%, Ethereum down 12%.",
            "score": 7,
            "replies": []
        },
        {
            "author": "nomadicSailor",
            "body": "Well, that aged like milk......",
            "score": 7,
            "replies": []
        },
        {
            "author": "Unable_Competition55",
            "body": "This should end well.",
            "score": 6,
            "replies": []
        },
        {
            "author": "thesleepjunkie",
            "body": "When the fuck did that happen what alternate universe. Cause my 15 different holdings are all down.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Objective-Elk-7988",
            "body": "![gif](giphy|bjB3gtFvREqqr5NAHW)",
            "score": 4,
            "replies": []
        },
        {
            "author": "Historical-Edge-9332",
            "body": "They aren’t soaring lol",
            "score": 10,
            "replies": []
        },
        {
            "author": "badgerbob1",
            "body": "Government sanctioned rug pulls incoming ...",
            "score": 4,
            "replies": []
        }
    ]
}