{
    "title": "Surgeon was called by UHC: demanded she step out of surgery (in progress) to question and later deny the patient’s overnight stay after major surgery.  Now they’re suing her for complaining.",
    "author": "GimmeFalcor",
    "subreddit": "LateStageCapitalism",
    "rank": 53,
    "score": 1435,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 21,
    "url": "https://www.yahoo.com/news/unitedhealthcare-threatens-legal-action-against-170028021.html",
    "id": "1ilmkxx",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "dingboodle",
            "body": "JFC. It’s like they’re trying to single handedly start a class war.",
            "score": 522,
            "replies": [
                {
                    "author": "jwely",
                    "body": "They are *winning* a class war. Have been for 50 years.",
                    "score": 358,
                    "replies": [
                        {
                            "author": "Hadhmaill",
                            "body": "“In general you must either pamper people or destroy them; harm them just a little and they’ll hit back; harm them seriously and they won’t be able to. So if you’re going to do people harm, make sure you needn’t worry about their reaction.”\n\nYou can bet your ass they’ve read Machiavelli like it’s a how-to guide",
                            "score": 118,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Diogenes_the_cynic25",
                    "body": "They started the class war long ago",
                    "score": 58,
                    "replies": [
                        {
                            "author": "sockovershoe22",
                            "body": "It's not really a war when only one side is fighting.",
                            "score": 30,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Corius_Erelius",
            "body": "There's a little Luigi in all of us and it's about time we all started listening to it.",
            "score": 260,
            "replies": [
                {
                    "author": "Kidkaboom1",
                    "body": "Mine usually just goes \"M-m-m-*mario*?\"",
                    "score": 28,
                    "replies": []
                }
            ]
        },
        {
            "author": "PaxtiAlba",
            "body": "Props to UHC for Streisand effect-ing themselves so brutally.",
            "score": 136,
            "replies": [
                {
                    "author": "Gods_pubichair",
                    "body": "They don’t care. What’s anybody gonna do? Try to shoot the next CEO? Wait…",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ninaslazyeye",
            "body": "The greatest hack in the American Healthcare system is to just not have insurance.  My wife just had to have life saving emergency surgery and the doctors and surgeons are keeping her in the hospital for as long as possible. Had we had insurance I know we would have already been booted because they would have only approved X amount of days stay. The bill is probably going to be over a million for over a months stay plus procedure and stay, but, that's better that letting her die.",
            "score": 116,
            "replies": [
                {
                    "author": "FlatteringFlatuance",
                    "body": "The good news is that you’ll likely be able to negotiate with the hospital for lower costs, because they still want to get paid and if they’re not soul sucking vampires like the insurance companies they’ll want her to live without you being destitute as well! I hope your wife recovers well.\n\nhttps://www.health.com/money/negotiate-medical-bills (Section 5/7 is what you should look at)",
                    "score": 70,
                    "replies": [
                        {
                            "author": "ninaslazyeye",
                            "body": "Yeah we have spoken with patient services. We just have to get all our ducks in a row with the paperwork and stuff. Thanks for the well wishes.",
                            "score": 34,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Upstairs-Region-7177",
                    "body": "Best wishes to your wife and her recovery",
                    "score": 21,
                    "replies": [
                        {
                            "author": "ninaslazyeye",
                            "body": "Thank you, she is slowly starting to recover.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "the-thieving-magpie",
                    "body": "This works for stuff like emergency surgery, but it’s not feasible for people with chronic health issues. \n\nMy neurologist charges $450 for a self-pay visit, and if you can’t pay that when they check you in you just don’t get seen. It’s pretty similar for my gynecologist and orthopedist.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Vector_Heart",
                    "body": "Holy shit, as a European this sounds dystopian as fuck. Sorry for the language, but sometimes it's needed, because it's how I feel. I'm sorry for all you two are going through, and best wishes to your wife!",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "RezFoo",
            "body": "Including hotels and airfare, travel to a reasonable country could be cheaper.",
            "score": 26,
            "replies": [
                {
                    "author": "Tsobe_RK",
                    "body": "_Greatest country on earth_",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robertgarners",
            "body": "Damn this company really doesn't care about it's execs. Normal people out there may see this as a taunt ...",
            "score": 8,
            "replies": []
        },
        {
            "author": "ashtreemeadow16",
            "body": "How can we support this surgeon?",
            "score": 5,
            "replies": []
        }
    ]
}