{
    "title": "Malema, cook that fraud",
    "author": "Ok-Musician3580",
    "subreddit": "LateStageCapitalism",
    "rank": 30,
    "score": 3293,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/gallery/1im81tw",
    "id": "1im81tw",
    "selftext": "",
    "comments": [
        {
            "author": "Straight-Razor666",
            "body": "Posted here:  \n\n[https://www.reddit.com/r/LateStageCapitalism/comments/1ilvbfb/the\\_afrikkkaner\\_is\\_coping/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/LateStageCapitalism/comments/1ilvbfb/the_afrikkkaner_is_coping/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "score": 1,
            "replies": []
        },
        {
            "author": "timeemac",
            "body": "I’m really concerned that an unelected Govt official with seemingly limitless power is starting to define anything he doesn’t like as “illegal”.",
            "score": 758,
            "replies": []
        },
        {
            "author": "SolomonBelial",
            "body": "Oh no, the oligarch doesn't like the way someone is criticizing his politically agenda laden social media propaganda platform. How dare someone call it out. The only response is to use my power and influence to act like a megalomaniacal man child.",
            "score": 431,
            "replies": []
        },
        {
            "author": "SelfAwareLitterBox",
            "body": "I owe you an apology Malema, I wasn't familiar with your game",
            "score": 438,
            "replies": []
        },
        {
            "author": "bdevi8n",
            "body": "International criminal? Maybe they should contact the International Criminal Court.. oh wait they're sanctioning the ICC",
            "score": 192,
            "replies": []
        },
        {
            "author": "The-Lord_ofHate",
            "body": "Imagine wanting to be equal to other humans and Elon considers that a threat.",
            "score": 127,
            "replies": []
        },
        {
            "author": "hoptagon",
            "body": "White People Stop Conflating Ending Whiteness As a Concept With Killing All White People Challenge",
            "score": 223,
            "replies": [
                {
                    "author": "eu_sou_ninguem",
                    "body": "I wish white people realized that whiteness only came into being because slave masters realized how massively they were outnumbered by slaves, and so to build a bigger non-slave population, more races became considered white. But that would involve learning about the history of slavery and that's woke, DEI, communistic nonsense.",
                    "score": 130,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrTubalcain",
            "body": "Is his family still in South Africa?",
            "score": 76,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "They apparently live in Texas.",
                    "score": 68,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}