{
    "title": "DOGE marks man dead and takes money out of his bank account",
    "author": "jameskchou",
    "subreddit": "nottheonion",
    "rank": 12,
    "score": 11666,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 237,
    "url": "https://www.teamblind.com/post/Elon-and-DOGE-declares-a-living-people-in-seattle-dead-cancels-his-social-security-and-steals-5201-from-his-account-Sck5wKNH",
    "id": "1jdiefs",
    "selftext": "",
    "comments": [
        {
            "author": "LbGuns",
            "body": "Start taking money out of people’s bank account, what could go wrong? Definitely not a bank run, definitely not.",
            "score": 5133,
            "replies": [
                {
                    "author": "kevinds",
                    "body": "If it can be done to a city's bank account, it can be done to a person's.",
                    "score": 1372,
                    "replies": [
                        {
                            "author": "jeff0106",
                            "body": "My parents who recently had their account stolen recently said they will probably have an account that they give out to no one and an account that is given out but has very little money in it. I guess you might have to deal with overdraft, but at least you still have your money.",
                            "score": 454,
                            "replies": [
                                {
                                    "author": "PM_ME_MH370",
                                    "body": "That's called a Zero balance account in finance ops",
                                    "score": 225,
                                    "replies": [
                                        {
                                            "author": "Applebomber24",
                                            "body": "What is it called when all my accounts are zero balance accounts?",
                                            "score": 36,
                                            "replies": [
                                                {
                                                    "author": "kevinds",
                                                    "body": "Poverty?",
                                                    "score": 55,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Baelgul",
                                                    "body": "“The American Dream”\n\nJust not yours",
                                                    "score": 51,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "cmoked",
                                            "body": "Banks don't like those for consumers lol",
                                            "score": 126,
                                            "replies": [
                                                {
                                                    "author": "Coulrophiliac444",
                                                    "body": "Which is why most, to avoid it, will require a minimum balance that they can hit with monthly administration fees and quietly shutter if someone forgets to keep an eye on it unless its waived for things like direct deposit, etc.",
                                                    "score": 140,
                                                    "replies": [
                                                        {
                                                            "author": "cmoked",
                                                            "body": "Yep if I didn't have 4k in my chequings I was paying 16$/mo for ultd transactions when I was making 4 per month lol",
                                                            "score": 57,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "fuqdisshite",
                                                            "body": "i keep a zero balance account.\n\ni sell eBay so there is money moving through it but it is spent down almost immediately.  no fees and overdraft including ATMs so i can get cash any time i know a payment is coming the next day.",
                                                            "score": 36,
                                                            "replies": [
                                                                {
                                                                    "author": "Baelgul",
                                                                    "body": "Dang, what bank is this through? All that I’ve seen require a minimum balance of some bature",
                                                                    "score": 14,
                                                                    "replies": [
                                                                        {
                                                                            "author": "fuqdisshite",
                                                                            "body": "Huntington.\n\nbeen there 12 years and i did use it as a regular account for a while but for 3 years now it has just been a transfer space.",
                                                                            "score": 23,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "GrynaiTaip",
                                                            "body": "I knew that your healthcare system is messed up, but the banks too? I've had several bank accounts from a couple EU countries over the years, none cared about my balance. Only one had monthly fees, all others were entirely free.",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "137dire",
                                                                    "body": "It's worse than that, if you keep stacks of money around instead of a bank balance, cops can charge the money with a crime. Since it's not a person it has no rights to a speedy trial so it can just get stolen by the cops and you never see it again.\n\nIn other words, it's 100% legal for cops to steal whatever cash you have on hand, whether that's $100 or $100k. Good luck getting it back in court.",
                                                                    "score": 32,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Confused-Raccoon",
                                                                            "body": "If it's not a person, thus no rights, how can they charge it with a crime? What kind of bullshit is that?",
                                                                            "score": 9,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Illiander",
                                                                                    "body": "American cops don't need to understand the law, they can make it up and it gets enforced.",
                                                                                    "score": 13,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Coulrophiliac444",
                                                                                            "body": "6+ years to practice law, 6 months to read and enforce it. Thats the disparity. Make LEOs require a 2 year associates degree for ENTRY and you fundamentally change the quality and types of officers you attract.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Illiander",
                                                                                                    "body": "I know, but the rest of the legal system supports them when they make shit up on the spot.\n\nBecause they don't want justice, they want slave catchers and strike breakers.",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "TheCrimsonDagger",
                                                                                    "body": "Lol welcome to America. It’s called civil asset forfeiture. They accuse the money (or any other item) of being used in a crime, but not the person whose money it is. This allows them to bypass all due process and reasonable suspicion requirements because only people have rights, not objects. If you want it back you then have to go through a lengthy and expensive legal process. So it’s often not worth even trying to get it back.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "shiekhgray",
                                                                                    "body": "The legal name of this bullshit is \"Civil Asset Forfeiture\" and has resulted in some crackhead cases names in the few cases it HAS gone to court. \n\n[https://en.wikipedia.org/wiki/United\\_States\\_v.\\_Article\\_Consisting\\_of\\_50,000\\_Cardboard\\_Boxes\\_More\\_or\\_Less,\\_Each\\_Containing\\_One\\_Pair\\_of\\_Clacker\\_Balls](https://en.wikipedia.org/wiki/United_States_v._Article_Consisting_of_50,000_Cardboard_Boxes_More_or_Less,_Each_Containing_One_Pair_of_Clacker_Balls)",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "pholan",
                                                                                    "body": "Originally, it was a legal fiction to allow authorities to seize contraband(tariff not paid on imported or illegal goods) when there was no one available who was willing to claim ownership, such as with a cargo shipment. Since then law enforcement has found that they can assert that they believe cash they’ve found is the proceeds of a crime and seize it. If the seizure is upheld typically the money goes into the seizing department’s budget so they have an obvious incentive to search for cash. As the owner you do have a right to joint the case and defend your asset but you’ll be paying your own attorney and the seizing agency’s burden of proof is much lower than in a criminal trial. For small to medium seizures it could literally cost you more to prevail than the value of the original seizure.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "pTarot",
                                                            "body": "I just get a low limit credit card for online purchases and make sure it’s only got a small limit to cover exposure tolerance.  If the card is compromised shut it down.  It wouldn’t protect from someone running my account but it’s the only valid protection for online purchases I could come up with easily.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ElGuano",
                                                    "body": "You can do that with a savings and checking acct.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Bacon4Lyf",
                                                    "body": "Sure they do, it’s the main way Monzo is used",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "cmoked",
                                                            "body": "Banks want you to maintain a balance, mostly",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Bacon4Lyf",
                                                                    "body": "I get that, but other banks like Monzo or starling know what their target audience is and play to their strengths. They know no one’s going to use it as their main account, so they don’t target that with their products",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cmoked",
                                                                            "body": "That's like 2 banks lol out of at least more than two",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bacon4Lyf",
                                                                                    "body": "How’d you crack that one Sherlock\n\nYou said banks, I said not all banks, I provided examples, this should not be difficult to comprehend",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "cmoked",
                                                                                            "body": "You know I was speaking in general, don't be facetious",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GrumpyCloud93",
                                            "body": "Do you have to then transfer to another bank, or would any freeze or retrieve order only work against the account in question? \n\n(Do banks automatically report to some government agency when a person has one? How does the government know where to look?)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "KinderGameMichi",
                                    "body": "Check with any local credit unions. Neither of mine have the stupid fees every month and the minimum balances are actually pretty minimum.",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "Zauberer-IMDB",
                                    "body": "It won't matter because half the time our personal info is given away by third parties the banks and others hire and we don't even know about.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Bowl-Accomplished",
                                    "body": "I do that. Keep a few grand in it and transfer money to it as necessary. ",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wipedout89",
                            "body": "It literally was done to this person",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "kevinds",
                                    "body": "Yes..",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Darth_Inconsiderate",
                            "body": "\"Cities are people too, my friends\" -Plato, 2012 Presidential campaign trail",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PM_ME__YOUR_HOOTERS",
                    "body": "Nothing makes people run to the bank and drain their accounts to stuff under the mattress faster than losing confidence in the safety of your funds in the bank",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "Objective-Stay5305",
                    "body": "Truly terrifying that Musk is appointing himself judge, jury, and executioner of American citizens' bank accounts with no due process.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "aRandomFox-II",
                            "body": "The truly terrifying thing is that no one is stopping him. Musk doesn't have any supernatural ability to force other people to do his bidding, he's still just an ordinary human being. He only has power because other people *allow* him to have power and *choose* to obey him.\n\nThe same can be said for any other authority figure.",
                            "score": 52,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Gh0st287",
                    "body": "I mean, [this went super well here in Brazil](https://pt.m.wikipedia.org/wiki/Confisco_da_poupan%C3%A7a), so why not do it again, this time on the US?\n\n/s",
                    "score": 90,
                    "replies": [
                        {
                            "author": "skwerlee",
                            "body": "How could anyone possibly think this could be a good idea!? Insane.  Wow.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "bielgio",
                                    "body": "Wanna know the best part?\n\nHe ran against the current president of Brazil, Lula, during that campaign he said Lula would do this...\n\nAfter that, he ran and won 2 times as senator",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "AdriftSpaceman",
                                            "body": "Fun fac: his dad, a former senator, shot and killed another senator in Congress during session and nothing happened, this was in 1963.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "Aplicacion",
                                                    "body": "And the guy he killed and the guy he was *trying* to kill were *not* the same person!",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "AdriftSpaceman",
                                                            "body": "Yep!",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "K1ngPCH",
                            "body": "Am I doing something wrong? That link takes you to a dead page.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Drachefly",
                                    "body": "try pt.m.wikipedia.org/wiki/Confisco_da_poupan%C3%A7a with https:// before it",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Xiten",
                    "body": "Weren’t they saying something about 150 yr olds getting paid? So, once again, projection.",
                    "score": 50,
                    "replies": [
                        {
                            "author": "YourUncleBuck",
                            "body": "[They were talking about Donald 'Crypt-Keeper' Trump](https://imgur.com/a/vesV43B)",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SigmundFreud",
                    "body": "Everyone gets spooked into moving a portion of their liquid assets into crypto, the sovereign wealth fund value goes up, the dollar value goes down, and net exports increase. Just according to keikaku.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "luummoonn",
                    "body": "It is a significant, huge problem if they are taking payments back through the payment system itself instead of challenging payments through the legal system.  It upsets the foundation of how the monetary system works.  If a payment cannot be considered \"final\" it messes with the value of the currency itself.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MarshallMandango",
                    "body": "Purple monkey dishwasher",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -61,
                    "replies": [
                        {
                            "author": "Ottawa104",
                            "body": "This absolutely did not happen during the freedumb protests.",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -61,
                                    "replies": [
                                        {
                                            "author": "Ottawa104",
                                            "body": "Bank accounts of a very few were frozen not seized because some people were receiving very dodgy financing.  There were no bank runs.",
                                            "score": 35,
                                            "replies": []
                                        },
                                        {
                                            "author": "nelrond18",
                                            "body": "All to selfishly refuse a vaccine and protect their neighbours.\n\nWhat the truckers did was domestic terrorism.",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -67,
                                                    "replies": [
                                                        {
                                                            "author": "Eldanoron",
                                                            "body": "What it does is make it harder to spread. That’s why you need certain percentage of the population to vaccinate to achieve herd immunity. Yes, some will get sick still but they will also have a milder and likely also shorter run of it. \n\nWant to see herd immunity in action? Just look at the measles epidemic in progress in Texas in an area that is about 80% vaccinated. The compare it to the fact that we haven’t had anything major measles related for more than ten years before that.",
                                                            "score": 24,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Xianio",
                                            "body": "And an independent commission & judiciary found said seizure to be both lawful and warranted. \n\nIt did not cause a run on the banks. Almost all Canadians did not see any cause for concern.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RIP_Pookie",
            "body": "Now I don't know much about the precise circumstances but why would a government agency be able to just...take the money out of a private bank account even if the owner of the account was dead?\n\n\nWouldn't these funds then go to the estate, still held by the bank? Does the US government take possession of all properties and estates of any deceased person for a period of time?\n\n\nIt's a horrifying vision into the present where these oligarchs and dictators see the banks as their own personal funds for the taking.",
            "score": 2157,
            "replies": [
                {
                    "author": "Muroid",
                    "body": "My assumption is that they decided he was dead and someone was falsely using his name to cash social security checks, so they reversed the transactions and pulled the money back.",
                    "score": 985,
                    "replies": [
                        {
                            "author": "SugarTacos",
                            "body": "Which is completely legitimate and normal, \\*if it's true\\*. The problem is these nitwits are doing 0 due diligence so the chances they're going to be f'ing over real people is high.",
                            "score": 933,
                            "replies": [
                                {
                                    "author": "Tripperbeej",
                                    "body": "They have like .... five 19-year-olds running DOGE, so I'm really not sure how they could make any mistakes like this.",
                                    "score": 493,
                                    "replies": [
                                        {
                                            "author": "Luminter",
                                            "body": "And what these 19 year olds probably don’t realize is that THEY are the fall guys when this inevitably goes badly and they need someone to blame. They aren’t super geniuses. \n\nThey hired that young because anyone over 30 would realize they are being played could end up in jail. So would either do so much CYA that it would make Musk and others nervous or they simply wouldn’t take the role because it wouldn’t be worth the risk.",
                                            "score": 299,
                                            "replies": [
                                                {
                                                    "author": "rollthedye",
                                                    "body": "They aren't going to suffer any consequences. They're all kids of ultra wealthy white families. One of them was literally fired for corporate espionage and he's the grandson of an actual Soviet Spy.",
                                                    "score": 199,
                                                    "replies": [
                                                        {
                                                            "author": "Luminter",
                                                            "body": "I think that they think that it will protect them, but I don’t think it will. Fascism always eats its own and there is no such thing as “loyalty”. \n\nAnd if we do somehow manage to get out of this mess then they, unlike Trump, are all young enough to face criminal charges eventually.",
                                                            "score": 97,
                                                            "replies": [
                                                                {
                                                                    "author": "torpedoguy",
                                                                    "body": "That's not good enough. Fascism expels and others its outermost layers once it's running low on out-groups and things to deprive the out-groups of... but by then it's too late for the rest of us.\n\n* To wait until they turn on each-other is to say \"let the zombies eat ALL our brains, and then they'll have nothing left but each-other to consume! THAT'LL TEACH THEM!\"\n\nThey are a mortal threat to us all **now**.",
                                                                    "score": 44,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Luminter",
                                                                            "body": "Oh yes I’m not denying that they are a threat now. I’m just saying they are dumb to think that they aren’t going to be used as a scapegoat eventually and it’s the whole reason Musk chose naive kids to begin with.",
                                                                            "score": 15,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "DeaddyRuxpin",
                                                                            "body": "No one is saying they aren’t a threat to us now. They are simply saying that those people have been deliberately set up as the fall guys and their wealthy families aren’t going to mean anything if/when it comes time to pin the blame on someone.",
                                                                            "score": 12,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "rollthedye",
                                                                    "body": "I wish. But I'm not holding my breath.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "clintCamp",
                                                            "body": "And another resigned because he claimed online  he was racist before it was cool.  Then republicans begged him to come back",
                                                            "score": 15,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Ardat-Yakshi23",
                                                            "body": "How do you make up all this dribble. All kids of ultra wealthy white families?!? Do you even read what you write ? Do you think if these kids existed they would work 80 hours a week for a low wage. Come on. You're allowed to think for yourself.",
                                                            "score": -31,
                                                            "replies": [
                                                                {
                                                                    "author": "rollthedye",
                                                                    "body": "The Ultra Wealthy work. They work in positions of power. The DOGE department is a position of power. They took these positions with the promise it'd lead to more power and wealth. It's called networking. Do you think they don't work?",
                                                                    "score": 20,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Tripperbeej",
                                                    "body": "As much as I wish what you were saying was true -- there's just no way these kids see any repercussions for what they're doing.  Remember, Trump just pardoned every single J6 convicted felon.  He views the justice department as his personal legal team.  Who is going to prosecute them for doing the biding of President Musk and VP Trump?  And even if someone does prosecute them, they'll just get a blanket pardon anyway.  \n\nI think the bigger mistake you're making here is in believing there's justice in this country (world) and that the good guys will ultimately prevail.  There is no justice. There is only the will of the oligarchs and their useful idiots. There is only greed and hate.  The decline of Pax Americana is accelerating.",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "torpedoguy",
                                                            "body": "Even the \"will ultimately prevail\" part of the handwaving is vile all on its own. It's basically declaring that it's okay for horrible things to happen to you NOW - that there's no emergency and you shouldn't defend yourself from your abusers because 'they'll totally hypothetically maybe face the possibility of being held accountable for it someday in the eventuality of the fullness of time'. That to protect yourself NOW instead of letting entropy take them would make YOU the real baddie.\n\n*\"Shh. Don't fight back. Just let it happen. If what I'm doing to you really is wrong, I'll get punished for it one day.\"*",
                                                            "score": 12,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "CPNZ",
                                                    "body": "Musk himself is dispensable once he has played his role (ask Rudy Giuliani or Mike Lindell how much Trump has helped them). Whether he is left with any of his current wealth remains to be seen (check the fate of many Russian oligarchs).",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "queefcritic",
                                                    "body": "I believe these people are called Useful Idiots.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "GrumpyCloud93",
                                                    "body": "This was my thought. If there is an actual retaking of the American government by the Democrats, there should be a serious scorched-earth campaign to rain retribution on everyone who enabled this whole mess.  \"Just followink orders\" has been demonstrated as not a valid defense. Creatively over and above orders should bring down even more fire and brimstone.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Tripperbeej",
                                                            "body": "You mean, sort of like when the democrats took power in 2021 and sweat scorched earth on the rioters who tried to overthrow democracy on January 6?  The same rioters who all received a “get out of jail” card the day Trump returned to power?  What’s the point when you have one political party playing by the rules still and one who does whatever the fuck they want regardless of law, ethics, or precedent?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "jfsindel",
                                    "body": "But it's not normal. This isn't how a fraud investigation is done. It's extremely possible it could be survivor benefits or some sort of special benefits given to a trustee for children/disabled children. \n\nIf DOGE concluded it to be fraud, where is their crackjob investigation showing it to be fraud? They would normally send a letter requesting a hearing or potentially freezing the payment until a response is given after a certain date. There would be hearings with an officer. \n\nMusk's agents don't believe in all that nonsense because they clearly believe they know better. But they obviously don't and about to find out that this is exactly why nobody does things like this.",
                                    "score": 65,
                                    "replies": [
                                        {
                                            "author": "username_elephant",
                                            "body": "No person shall be... deprived of life, liberty, or property, without due process of law; nor shall private property be taken for public use, without just compensation.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "odigon",
                                                    "body": "That stuff absolutely does not matter anymore in the US.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ShyElf",
                                    "body": "That isn't close to legal, even if true.  They can contact the bank, notify them of the irregularity, on which report the bank will probably freeze the account, and then ask a judge to give them the money back.  Just stealing the money back is bank fraud, even if you're working for the government.",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "SugarTacos",
                                            "body": "Any institution you authorize for direct deposit has the authority to reverse those deposits. That's why you should be careful about who/what you approve that use for.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "wingedespeon",
                                    "body": "They are not complete nitwits.  Fucking real people is the point.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "GrumpyCloud93",
                                    "body": "These are the brainiacs who thought a picture of the \"Enola Gay\" was a diversity photo. They thought a date of \"zero\" or unknown (stored as 1875 in the antique computer program) meant the social security  recipient was 150 years old.  They thought \"probationary\" meant a recent hire, and fired many highly trained recently promoted civil servants. They fired air traffic controllers, nuclear weapons maintenance techs, this year's forest fire fighter trainees, they cut off funding for the guards working at prison camps for ISIS detainees in Iraq, they thought transgenic mice (special gentetic configuration for research) meant \"transgender mice\" and gutted thousands medical of research projects, ...\n\nI'm guessing the required diligence is overdue.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Sometimes_Stutters",
                                    "body": "He was marked dead in December",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ClickAndMortar",
                                    "body": "0 due diligence would frankly be an improvement.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LooseSeal88",
                            "body": "Yes, that is confirmed in the article. They asked the bank to reverse the ACH. Sounds like the bank got that order and just sent the money back without calling the customer to find out he was still alive.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Eldanoron",
                                    "body": "I mean that also assumes the bank was informed why the ACH was being reversed.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "LooseSeal88",
                                            "body": "Right, they probably weren't",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kloiberin_time",
                            "body": "My assumption is that they found a John Smith who was pulling social security and went, \"That motherfucker died in 1631.\" because they are all morons and crooks.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZipperJJ",
                    "body": "This happens all the time with social security, when someone dies. They move pretty quickly. Social security is indeed able to pull back any payments made after the recipient's death date. \n\nIt's not all of a person's properties and estate, just their last 1 or 2 Social Security payments that were made before Social Security realized they were dead.",
                    "score": 51,
                    "replies": [
                        {
                            "author": "pholan",
                            "body": "Specifically payments made in months after the month where the individual died. Social Security is paid in arrears, so you are still entitled to the payment made in the month of your death. That is to say that you’re paid in March for the month of February so if you lived into March your estate is entitled to the payment made in March even if you died before it was delivered. On the other hand if you died on February 28th that’s too bad and your estate would have to return any payment received in March and thereafter.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "RIP_Pookie",
                            "body": "Thanks for the insight",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Daren_I",
                    "body": "The Social Security Administration received notice he had died in November, so his payments for December and January were clawed back from his account thinking they were overpayments.\n\nEdit: There really needs to be financial accountability on any company or agency who employee(s) create such a nightmare when submitting reports to the SSA. I've known two people who were accidentally made \"dead\" by the SSA which took months to restore.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "you-create-energy",
                            "body": "How do you know this? I didn't see it in the article",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Shellyj4444",
                                    "body": "They probably read it in another article. I didn’t read this one but the article I read last night mentioned it.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "caishaurianne",
                            "body": "Source?\n\nWhen my dad died, we had to send out death certificates to all of his accounts, so it’s puzzling how this could happen by accident.  What was the explanation with your friends?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Daren_I",
                                    "body": "It was in the article linked in other comments here.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tetrasodium",
                    "body": "There are a lot of conditions that could cause social security to recover a deposit if they think you are dead.  Being really old and not responding to a regular confirm you are alive notice.  Somehow getting a death certificate (ie 2 people similar age same city and human error) Not showing up for Dr appointments hard enough to trigger a few conditions depending on your situation, etc.\n\nIt mostly depends on why it happened and what his situation was.  Doge may or may not have been directly involved",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "GregSimply",
                    "body": "Look up civil asset forfeiture.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RIP_Pookie",
                            "body": "That's a good point but also distinct in that it is a local police force seizing assets and not the federal government. That feels different although I'm having difficulty articulating the exact why.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IerokG",
                    "body": "Because the Land of the Free™ 🇺🇸🦅🍔🦅🇺🇲!!!!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mutex70",
            "body": "\"Some of you may die, but that's a sacrifice I'm willing to make\"\n\n\\- ~~Lord Farquad~~ Donald J Trump",
            "score": 371,
            "replies": [
                {
                    "author": "CliffsNote5",
                    "body": "I was thinking that was Zap Brannigan",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Hndlbrrrrr",
                            "body": "No, Zap just sends wave after wave of his men until the killbots reach their preset limit and shutdown like a true modern leader.",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "impreprex",
                                    "body": "Well, that’s because Brannigan’s law is like Brannigan’s love: Hard and fast.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "247Brett",
                            "body": "[Hmm…](https://youtu.be/VA8vQorhAE0?si=QgqZUWOUnj3QRcRs)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bart9611",
                    "body": "\\- Lord ~~Farquad~~ Donald J Trump  \n  \nFTFY",
                    "score": 0,
                    "replies": [
                        {
                            "author": "XShadowborneX",
                            "body": "- Lord Fuckwad",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "OhNoJoSchmo",
                            "body": "Not my lord. Felon, Rapist, and racist Donald Trump to me. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "5050Clown",
            "body": "This is how they will start going after Tesla protesters.",
            "score": 443,
            "replies": [
                {
                    "author": "badaimarcher",
                    "body": "This is how they will go after anyone who defies the regime",
                    "score": 169,
                    "replies": [
                        {
                            "author": "CliffsNote5",
                            "body": "The Amazon powered facial recognition will perform credit checks to form ranked targeting of protesters.",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "Throw-a-Ru",
                                    "body": "[Thiel's Palantir](https://www.tandfonline.com/doi/full/10.1080/01972243.2022.2100851) would likely take care of the facial recognition, etc.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "f1del1us",
            "body": ">Said his wife Pam: “You sort of have no choice but to laugh it off. But it seems like it’s going to get worse.”\n\n\nThis sounds like someone who voted for trump, because my mom does the same thing, laughs about the politics and says 'they know what they're doing'",
            "score": 340,
            "replies": [
                {
                    "author": "ZipperJJ",
                    "body": "Get madder, Pam!",
                    "score": 71,
                    "replies": []
                },
                {
                    "author": "CuckBuster33",
                    "body": "stop complaining and asking questions, just live laugh love, its not that hard bro.",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "MrBigTomato",
                    "body": "Obama wears a tan suit and eats ice cream -- \"This is outrageous!!\"\n\nTrump literally drains your bank account -- \"LOL just gotta laugh it off tee hee\"",
                    "score": 49,
                    "replies": [
                        {
                            "author": "azthal",
                            "body": "While I hate Trump as much as the the next guy, lets not pretend that the fake outrage is one sided. There's been plenty of absolutely ridiculous news stories about Trump as well. Remember when there was absolute outrage about Trump being crass enough to want additional ice cream?\n\nThe fake outrage pieces are part of the larger problem, and unlike the fascism, the fake outrage really is a \"both sides\" issue. When fluff pieces like this gets more attention, interaction and clicks than well thought through and researched articles, this directly help drive distrust in media and the rise of the fascist state that we are now seeing.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "OIlberger",
                                    "body": "> Remember when there was absolute outrage about Trump being crass enough to want additional ice cream?\n\nAbsolute outrage? No, I don’t recall that. I *do* recall that a few news outlets reported in 2017 how Trump let TIME magazine spend the day with him and TIME noted that at dessert Trump was served two scoops of ice cream while all other guests received one scoop. Most articles treated that fact light-heartedly; they were mocking Trump for his childishness, for sure, but was there fucking “absolute outrage”? No, try again. Overturning “Roe V. Wade” caused outrage, see the difference?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "azthal",
                                            "body": "I'm not comparing it to Roe V. Wade. I am comparing it to Tan suit outrage.\n\nThis was the context in which I replied. Context matters.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "OIlberger",
                                                    "body": "Tan suit was discussed ad nauseam in the conservative media (which included Fox News, the top-rated cable news outlet). \n\nCongressman Peter King said at the time about the tan suit: “There’s no way, I don’t think, any of us can excuse what the president did yesterday. I mean, you have the world watching”\n\nThe Trump ice cream thing was mentioned in a few articles, I don’t see the parity here between the reaction to Obama’s suit and Trump’s ice cream thing. There was manufactured outrage from conservatives about Obama’s suit not being presidential, while Trump’s extra scoop of ice cream was lightly mocked for being quite in-character for a spoiled trust fund brat like Trump.\n\nCan we find any members congress saying Trump’s extra scoop of ice cream was inexcusable or unpresidential? This is why tan suit was a mountain made out of a molehill, ginned up by conservatives, while the Trump double-scoop thing was not a huge controversy that had Democrats publicly criticizing it as if it mattered.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "mybustlinghedgerow",
                                                            "body": "Yeah, I didn’t even hear about the ice cream thing but heard about the tan suit.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mybustlinghedgerow",
                    "body": "She’s not saying “they know what they’re doing,” she’s saying things are going to get worse.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aceldamor",
            "body": "This is how it starts, with lawsuits against the Government, specifically DODGE (naming Elon directly), now that there are presidents labeling it as a government agency...",
            "score": 104,
            "replies": [
                {
                    "author": "xaeru",
                    "body": "They don't care about the law.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RosieQParker",
            "body": "Ladies and gentlemen, the Department of Government Efficiency.",
            "score": 69,
            "replies": [
                {
                    "author": "mmoe54",
                    "body": "I would expect DOLCE - Department of Lazy Citizen Efficiency.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Zireall",
                    "body": "Completely unelected and basically a position that was bought. ",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "MrBigTomato",
                    "body": "I can smell the efficiency!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tripperbeej",
                    "body": "Well, they are pretty damn efficient a doing ***something***.  It's just not quite exactly what the Trump voters thought they getting.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Esternaefil",
            "body": "Performing as intended.  Sadly.",
            "score": 123,
            "replies": [
                {
                    "author": "TheFillth",
                    "body": "That's one way to push for bitcoin adoption...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MBSMD",
            "body": "Working as intended. They don't care at all if someone alive is marked dead and loses money. They don't believe that money should be received in the first place. Because billionaires already got theirs, so F-off the rest of you.",
            "score": 54,
            "replies": [
                {
                    "author": "CliffsNote5",
                    "body": "They are pulling this ladder up and plan to use it as an art installation.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "Techn028",
            "body": "What do you mean people survive past retirement age?!",
            "score": 18,
            "replies": [
                {
                    "author": "LorenzoStomp",
                    "body": "We let people stop working?!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Ban-Circumcision-Now",
                    "body": "Trump admin: we are working on lowering environment quality and eliminating toxic pollution limits as fast as we can to address this issue!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DaveOJ12",
            "body": "You couldn't link to the actual article?\n\nhttps://www.seattletimes.com/seattle-news/politics/heres-a-dead-person-on-social-security-in-seattle-with-plenty-to-say/",
            "score": 115,
            "replies": [
                {
                    "author": "BlueRajasmyk2",
                    "body": "Why do that when you can link to a post in another subreddit, which is itself a link to some weird Reddit clone that puts business names next to everyone's usernames for some reason, which then links to the actual article.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "blackangelsdeathsong",
                    "body": "because they have to use the original headline and the original headline doesn't mention DOGE or Musk so it wouldn't have been upvoted as high if he did that",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "miarmstr",
            "body": "Welp. I am taking all my cash out of the bank now. They will never get my $25.78!",
            "score": 11,
            "replies": []
        },
        {
            "author": "jameskchou",
            "body": "[https://www.seattletimes.com/seattle-news/politics/heres-a-dead-person-on-social-security-in-seattle-with-plenty-to-say/](https://www.seattletimes.com/seattle-news/politics/heres-a-dead-person-on-social-security-in-seattle-with-plenty-to-say/)",
            "score": 28,
            "replies": [
                {
                    "author": "Jack_Lad",
                    "body": "Better: https://archive.is/IJxJr \n\nNo annoying popups.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "International-Eye117",
            "body": "Sorry sir we have you dead therfore you obviously dead even if I am talking you.",
            "score": 21,
            "replies": [
                {
                    "author": "CliffsNote5",
                    "body": "My partner Craig here will correct the error with a minimum loss of vital organs or fluids.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "CaptainLucid420",
                    "body": "Monty Python could run this.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mr_biteme",
            "body": "Because they’re (doge)  IDIOTS!!!!",
            "score": 16,
            "replies": [
                {
                    "author": "torpedoguy",
                    "body": "```never attribute to stupidity that which is adequately explained by malice```",
                    "score": 10,
                    "replies": [
                        {
                            "author": "AdvancedSandwiches",
                            "body": "You probably know this, but for anyone who doesn't, that's the opposite of the saying.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "namdor",
            "body": "Not very oniony. This is completely expected.",
            "score": 5,
            "replies": []
        },
        {
            "author": "assassbaby",
            "body": "let me guess…they are not real people they are AI generated right? ",
            "score": 4,
            "replies": []
        },
        {
            "author": "That-Makes-Sense",
            "body": "So this answers my question on whether to take direct deposit or a check, for my tax refund.  I'm not giving the government my direct deposit info.  Sure, they could get it, but the harder you make it, the better chance you have of them not stealing your money.",
            "score": 5,
            "replies": []
        },
        {
            "author": "ElGuano",
            "body": "I can just imagine Elon Musk shrugging “it’s only $56,000, why is he so upset?”",
            "score": 5,
            "replies": []
        },
        {
            "author": "grumpyRob1960",
            "body": "The work of Elon's band of incels, this was what they were after , emptying bank accounts and selling info on the dark web",
            "score": 7,
            "replies": [
                {
                    "author": "Malphos101",
                    "body": "Its no coincidence the nation has started getting tons of scam texts about \"unpaid toll fees\".",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jetpack_hypersomniac",
                            "body": "Wait—you’re telling me that the text that’s saying I have past due toll fees, and that I need to copy/paste a URL into a browser in order to resolve, are *A SCAM???!*\n\n\n/s in case it wasn’t obvious",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sometimes_Stutters",
                    "body": "He was marked dead in December before DOGE existed. The money that was removed from the bank account was for SS payments after he was allegedly marked dead. This is common. He went thru a process with SS to be “alive”, which while not common is something that does occur.\n\nLiterally all of this can and has happened long before DOGE.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "asdacool",
            "body": "Just another day at the office from DOGE. Nothing new.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Guillotine-Wit",
            "body": "Turns out, he was only mostly dead.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mykepagan",
            "body": "I would not mess with that guy. Pretty sure he’s Emperor Palpatine.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PhotoBN1",
            "body": "I think i lost the thread of this reality. Wtf is DOGE now? Last I remember it was a crypto thing",
            "score": 3,
            "replies": [
                {
                    "author": "Sycod",
                    "body": "It originally was an internet meme, a picture of a shiba captioned with phrases like \"such wow\". Someone named a cryptocurrency after it, afaik it was one of the more popular ones. Now it refers to Musks Department of Government Efficiency, which he likely deliberately named after either of the former, because he has the sense of humor of a fourteen year old 4chan addict.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "PhotoBN1",
                            "body": "Gotcha",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sign_Outside",
            "body": "lol as if the government hasn’t done that million times before",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fujinn981",
            "body": "Imagine being broke, having a thousand bucks in the bank, your account gets emptied and you find out it was a fucking multi billionaire who took your thousand bucks. Not some other poor bastard or small time criminal, some one who has enough wealth to pay for the global populations retirement fund.",
            "score": 3,
            "replies": []
        },
        {
            "author": "bradrame",
            "body": "How many people did they do this to?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jellybean-Jellybean",
            "body": "Comments on the article are supporting this, because \"fraud!\" Everyone concerned about the welfare of people affected by this, or worried it will happen to them is just a fraudster apparently.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Sassrepublic",
            "body": "Am I the only person who read the article? DOGE did not mark this guy dead. It happened in November, before Trump was even in office. The only DOGE-related issue here is the staffing cuts that made it impossible for the guy to get ahold of anyone. ",
            "score": 9,
            "replies": [
                {
                    "author": "getoutofheretaffer",
                    "body": "> He called the bank first, and they said an electronic notification had been triggered on Feb. 18 that he had died back in November.\n\nSo it happened in February. Notably, the article says that he received no explanation at all as to why he was marked as dead on 18 February.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Sassrepublic",
                            "body": "He was not marked as dead on February 18th. The bank was notified on February 18th. He was marked as dead in November. The sentence that you just quoted says he was marked as having died in November, not in February. \n\nAnd it’s not at all notable that the bank could not explain why he was marked as dead because the bank didn’t mark him as dead. Why the fuck would they know, they just receive a death notice and update their record. \n\nThere is a reason that the *actual* title of the article doesn’t say shit about DOGE. ",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "getoutofheretaffer",
                                    "body": "It doesn't say anything about DOGE because no explaination has been provided. \n\nIn February, I found out that David Lynch died in January. \n\nNed Johnson *'died'* in November. Social Security *'found out that he died'* in February, and notified his bank.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Scalage89",
                    "body": "Apparently you didn't read it either.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "LeRascalKing",
            "body": "So their plan is getting more and more clear: break all government institutions, fire the workers that you legally cannot fire, ignore the judges and watch said /institutions collapse rapidly. Then replace them with privatized entities, while millions of people lose their SS benefits and more. \n\nIt’s only a matter of time, and I hope the guillotines and gallows are brought out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ridemooses",
            "body": "Efficiently creating the most lawsuits.",
            "score": 2,
            "replies": []
        },
        {
            "author": "angry-democrat",
            "body": "Impeach Trump and Boycott Musk and Twitter and Tesla",
            "score": 2,
            "replies": []
        },
        {
            "author": "wanderwithsam",
            "body": "Trial balloon",
            "score": 2,
            "replies": []
        },
        {
            "author": "wumr125",
            "body": "Elon won't even need tesla stock soon, he'll have your cash",
            "score": 2,
            "replies": []
        },
        {
            "author": "chocolatechipbagels",
            "body": "next week: doge decides it will pay down the US's debt directly from everyone's checking accounts",
            "score": 2,
            "replies": []
        },
        {
            "author": "BeepBopARebop",
            "body": "I have a dear friend who was informed by her bank that Social Security said she was dead. What probably happen is that somebody at a funeral home keyed in a Social Security number wrong. My friend has limited mobility and it took two trips to a Social Security office to prove she is still alive. That happened a year ago. Imagine how that would go now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "soccersprite",
            "body": "Crooks and looters, the lot of them. Not sure how they think they'll continue to be propped up by the nation once everyone has lost trust in the stability of this place.",
            "score": 2,
            "replies": []
        },
        {
            "author": "unhott",
            "body": "Next: \"We believe these people are dead. We're putting together a team of enforcers to ensure we have it right.\" /s",
            "score": 2,
            "replies": []
        },
        {
            "author": "Party-Ring445",
            "body": "Lets do that to Elons account",
            "score": 2,
            "replies": []
        },
        {
            "author": "gobbluthillusions",
            "body": "Any person who is against what’s going on in Washington needs to be touting this everywhere they can. This is the anecdote that will sway the white heads who have money, power, and influence.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Astromanatee",
            "body": "To be fair, he does look dead.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Equivalent_Buyer4260",
            "body": "But I thought they didn't have that power, that they were only advisors /s",
            "score": 3,
            "replies": []
        },
        {
            "author": "ChimpScanner",
            "body": "Elon Musk: \"why do people hate me?\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "ozymandiez",
            "body": "I was warned by a friend of mine that works in the Pentagon to move my money overseas. He had already moved everything he had, minus his retirement account (TSP) overseas. Now I can see what he was warning me about.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AlNeutonne",
            "body": "Sounds like a bank robbery to me. Federal time!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rainbike80",
            "body": "We need to get Musk and Elon the Fuck out of the ACH system.\n\nThis is crossing the Rubicon people.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Misubi_Bluth",
            "body": "And he wants me to feel sympathy for him because someone tagged \"Fascist\" on a Tesla. I don't support the vandalization of someone's private property, but I'm not gonna shed a tear over the world's richest thief's brand being dragged through the mud.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tooncake",
            "body": "Elon: Yep, definitely Ukraine's fault.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bernpfenn",
            "body": "how do you roll back that move?",
            "score": 1,
            "replies": []
        },
        {
            "author": "gundamxxg",
            "body": "This must be the magic computers making money out of thin air that Elmo recently referenced.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Afraid_Whole1871",
            "body": "“I’m sorry sir, it says right here you are dead. Have you tried dying?”",
            "score": 1,
            "replies": []
        },
        {
            "author": "miarmstr",
            "body": "Welp. I am taking all my cash out of the bank now. They will never get my $25.78!",
            "score": 1,
            "replies": []
        },
        {
            "author": "arctor2343",
            "body": "How efficient",
            "score": 1,
            "replies": []
        },
        {
            "author": "spilk",
            "body": "Even before all this nonsense my level of paranoia is such that when I pay my taxes I use a separate savings account that I only put the exact dollar amount into. Not so crazy anymore...",
            "score": 1,
            "replies": []
        },
        {
            "author": "classycatman",
            "body": "If only there was a process to validate something suspicious and give someone their due in ensuring that they're on the up and up.  We could even call it 'due process' maybe?\n\nI can't believe no one ever thought of this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oni-oji",
            "body": "The DOGE assholes are the types of guys who would push to production without testing or peer review.  In other words, morons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YurtlesTurdles",
            "body": "\"the most efficient way to remedy this problem is to kill this guy\" - Doge goon after discovering mistake",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sparrowsabre7",
            "body": "That's ruff buddy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "paulovitorfb",
            "body": "Efficient ",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Schrodingers_Gat_",
            "body": "Bring out yer dead..., Bring out yer dead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "frankylicksjflo",
            "body": "My husband had an ex that was here illegally in the US and using a dead persons social. She even went by the name and filed her taxes every year. He ended up leaving her when he found out. He was always suspicious why the family was always pushing them to get married. He really did avoid a big mess!  We live in Texas and I always wondered if she ever got caught. If that’s what they are looking for then they really need to be more careful not to mess with real people who are citizens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoleLocus",
            "body": "I've seen enough. Welcome Back Fernando Collor",
            "score": 1,
            "replies": []
        },
        {
            "author": "smashing-gourds127",
            "body": "If you receive SS, you should have more than one bank account. One for the deposit, and one to transfer the $ to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yummy_7377",
            "body": "The situation was resolved after Johnson visited an SSA office, provided proof of life (such as his passport), and had his benefits restored, with the deducted funds returned to his account. The article also notes that while some have speculated a connection to Elon Musk’s Department of Government Efficiency (DOGE) initiative, which aims to remove deceased individuals from government rolls, DOGE has denied any involvement, calling such claims “maliciously misleading.” There’s no evidence linking Johnson’s case to DOGE; it appears to be an independent administrative error.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThinNeighborhood2276",
            "body": "That's a bizarre and concerning situation. Do you have more details on how this happened?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ambitious_Cup5249",
            "body": "I hope he voted for this....",
            "score": 2,
            "replies": []
        },
        {
            "author": "dartard",
            "body": "how can these bastards take money out of your bank account?  That can not be legal.",
            "score": 1,
            "replies": [
                {
                    "author": "Plastic-Caramel3714",
                    "body": "Not even if you are dead",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "soysubstitute",
            "body": "Well, Elon's a genius, so somebody else must have f\\*\\*\\*ed up.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ineedyoursway",
            "body": "I AM NOT DEFENDING ELON, DOGE, OR TRUMP. \n\nBUT…from a banking procedures standpoint, when someone is reported dead to social security, they claw back any payments made since the date of death. This is standard procedure any time someone dies and has social security payments deposited after death.\n\nThis is as simple as uninformed people misinterpreting messy data and hastily taking action. It won’t be the last time either.",
            "score": -13,
            "replies": [
                {
                    "author": "Puzzled-Story3953",
                    "body": "No one is blaming the bank, so why are you defending them?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Ineedyoursway",
                            "body": "Not trying to defend anyone. I’m trying (poorly) to explain what actually happened since the headline is a bit misleading.\n\nDOGE takes money from man’s bank account may get clicks, but it’s not really the truth in this case. \n\nDOGE is screwing enough up that we shouldn’t need misleading headlines to make the point that they’re flawed.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Puzzled-Story3953",
                                    "body": "I don't understand how this doesn't go back to DOGE's incompetence... The bank account would not have been emptied if DOGE had any idea of what they were doing and/or had conducted any amount of due diligence. \n\nSo, what, specifically, is misleading here? I mean, I guess DOGE didn't remove the money, but the money was removed as a direct consequence of DOGE's actions with that exact intended effect.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Muffafuffin",
                    "body": "If you have seen it anywhere, let me know, but did they st all try to verify? The issue isn't that this all happened, it's that it happened with seemingly no attempt to check if this guy was alive or not.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fox15",
            "body": "Read the damn article, this has nothing to do with DOGE",
            "score": -3,
            "replies": [
                {
                    "author": "Isaac_Shepard",
                    "body": "I only half agree with you. I think it was more a clerical error, spurred by the actions of musk and DOGE (moreso an indirect byproduct, if will).",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrashnServers",
            "body": "I call bs",
            "score": -15,
            "replies": []
        },
        {
            "author": "Commercial_Rule_7823",
            "body": "Not a fan of DOGE, but no proof they did this. Also, social security does this normally and often. \n\nDOGe will hurt people though by closing offices and stopping in person help.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Ardat-Yakshi23",
            "body": "Doge can't take money out. Only report that something is wrong . Read access only. \nDon't believe the clickbait. He probably already had something coming for a while, and it only now was executed.",
            "score": -31,
            "replies": [
                {
                    "author": "sfxpaladin",
                    "body": "Presented proof and still in denial. You're cooked bud",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Sassrepublic",
                            "body": "You did not read the article, did you. ",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "sfxpaladin",
                                    "body": "Are you assuming I think DOGE personally took his money? No, they did not PERSONALLY, PHYSICALLY take his money. Just because they didn't personally do it doesn't mean it isn't their fault",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Sassrepublic",
                                            "body": "He was marked as dead in November. ",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "author": "Infamously_Unknown",
                                                    "body": "No, he was marked a month ago.\n\n>He called the bank first, and they said an electronic notification had been triggered on Feb. 18 that he had died back in November.\n\nYou're complaining about others not reading the article, but it looks like it doesn't actually do much for you if you don't have the reading comprehension to get through a simple sentence.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Sassrepublic",
                                                            "body": "The sentence you just quoted says that the BANK received the notice in February that he was reported as dead to the government *in November.* ",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}