{
    "title": "Tesla Autopilot drives into Wile E Coyote fake road wall in camera vs lidar test",
    "author": "fuzzball517",
    "subreddit": "nottheonion",
    "rank": 18,
    "score": 1577,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 127,
    "url": "https://electrek.co/2025/03/16/tesla-autopilot-drives-into-wall-camera-vs-lidar-test/",
    "id": "1jdiunx",
    "selftext": "",
    "comments": [
        {
            "author": "supercyberlurker",
            "body": "The future's gonna be real weird.\n\nSome criminal digitally face-camo'ed to be your uncle, will steal billions in keanukoin by a complicated heist involving a giant fake tunnel.",
            "score": 320,
            "replies": [
                {
                    "author": "sagevallant",
                    "body": "Thanks man. Finally I have a future that I kind of want to see now.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Equivalent_Buyer4260",
                    "body": "I take comfort that world war IV is around the corner.\n WWII happened on November 5th and America lost",
                    "score": -131,
                    "replies": [
                        {
                            "author": "YourPhoneIs_Ringing",
                            "body": ">I take comfort that world war IV is around the corner.\n\n> WWII happened on November 5th and America lost\n\n...What?",
                            "score": 83,
                            "replies": [
                                {
                                    "author": "sittinginaboat",
                                    "body": "He missed an \"I\".",
                                    "score": 44,
                                    "replies": [
                                        {
                                            "author": "YourPhoneIs_Ringing",
                                            "body": "Calling an election WWIII is still stupid, so regardless I'll keep my original response of \"...What?\"",
                                            "score": 69,
                                            "replies": [
                                                {
                                                    "author": "SecretAgentVampire",
                                                    "body": "I bet that they meant the Cold War, but then forgot it's name and decided to push through.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "persepolisrising79",
                                                            "body": "Rather trumpian",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "opensourcefranklin",
                            "body": "Your version of WWIII is really underwhelming compared to the first two heavyweight bouts.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SelectiveSanity",
            "body": "Meep Meep, mother fucker.",
            "score": 110,
            "replies": [
                {
                    "author": "ecmcn",
                    "body": "Do you read Dungeon Crawler Carl by any chance?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SelectiveSanity",
                            "body": "Nope, came up with that thinking of a Family Guy sketch about why Wily E. Coyote keeps going after the Road Runner despite all the failures.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "wwarnout",
            "body": "Six tests, LiDAR-equipped car passed all of them, camera-equipped car (Tesla) failed on half of them.\n\nSure, LiDAR is more expensive than cameras.  But then again, air bags are more expensive than just seat belts; crash-absorbing structures are more expensive than none; etc.\n\nSo, is Musk a cheapskate?",
            "score": 143,
            "replies": [
                {
                    "author": "XB_Demon1337",
                    "body": "I will say it. YES he is. Aside from all his other scummy things. He is very much a cheapskate. These cars were supposed to be affordable and they just are not as affordable as they could be. They take so many shortcuts on the cars and further take the Apple approach instead of a properly build vehicle with actual safety measures. \n\nIt is a car that has always been for the memes.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "gneiman",
                            "body": "What is the apple approach?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "XB_Demon1337",
                                    "body": "Expensive repairs and part design that makes them hard to fix as well as locking down their charger system.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "ExMorgMD",
                                            "body": "My iphone has never crashed into a wall. Just sayin.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "FigWeak5127",
                                                    "body": "Your IPhone hasn’t crashed into a wall, yet!",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "XB_Demon1337",
                                                    "body": "I should expect this kind of response from someone with the IQ of a potato.",
                                                    "score": -24,
                                                    "replies": [
                                                        {
                                                            "author": "ExMorgMD",
                                                            "body": "Funny…your mom thinks I’m the smartest guy she’s met.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "XB_Demon1337",
                                                                    "body": "I know children with better comebacks than you. I coach 9 year old girls who could best you in a battle of the minds.",
                                                                    "score": -21,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sodaMartin",
                                                                            "body": "Swing and a miss",
                                                                            "score": 13,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "welchplug",
                                                                            "body": "Apparently, you're not as smart as a 9 year old.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WantEvolution",
                    "body": "Have you been inside a Tesla? Slap an Ipad on a blank space is not minimalism, it is cheap garbage for people who know or care nothing about design.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Lem0n_Lem0n",
                    "body": "Musk, cheap, a person who got rich from blood emeralds?? Man it's really hard to know",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Jolly_Reaper2450",
                    "body": "No Musk is Jurassic Park book Hammond",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "FauxReal",
                    "body": "Didn't Tesla start out with LiDAR? I didn't know they stopped using it. Or maybe I'm remembering wrong??? No wonder they're so far behind on self-driving capabilities.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "PocketMonsterParcels",
                            "body": "they ripped out most sensors during the Covid shortage and started to claim they didn’t need them. It was just a ruse to sell more cars while other automakers were dealing with shortages. ",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DeusSpaghetti",
                    "body": "Much as I despise Muskolini it's more complicated than that.\n\nVision system autonomous driving is a LOT more complicated than lidar, but it's much cheaper to build being mostly a software issue. \nEven Tesla competitors say that Tesla might be able to eventually solve it, which would be a massive boon to mass production.\n\nElon is a bit of a fanatic and so won't change tack even though Tesla autonomy is currently stuck.\n\nThe other autonomous car makers using Lidar aren't marketing to the general public. To make money with a much more expensive system, they are targeting taxis, freight movements, etc, where the base cost of the vehicle is a lower consideration.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "DrHemroid",
                            "body": "It's more than a software issue. There are limitations with what our current technology can handle, in terms of processing power and software, and then there are physical limitations that can never be overcome.\n\nReframing the problem, the question that should be asked is \"what is the best way to detect objects while driving,\" and not \"how do we make a car drive the way a human can.\" Humans are limited to visible light. Our eyes can be fooled. Our brains can learn the difference between a painted wall and a real road, but we can still be tricked. Our eyes are useless in that test where the road is covered in fog. Visible light gets us pretty far, but it is not the optimal way to detect objects on a road. Why limit the car to using only one kind of sensor? The only advantage is cost. The camera only solution is doomed to fail from inception, but it saves money.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "iamtehryan",
                    "body": "Yes. He's a cheap, pillaging piece of shit. That's hardly news.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JerHat",
                    "body": "Yes. Musk is cheap, and also stupid.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lolersters",
                    "body": "Basically, yes. Also, there aren't too many manufacturers right now for lidar sensors. \n\nTesla is convinced that they can bypass lidar sensors by using multiple cameras and using AI to interpret the image. It is much cheaper, but I'm pretty sure every robotaxi on the road right now is equipped with a lidar and IMO this is the main reason that Tesla is behind its competitors in this space right now.\n\nKeep in mind though that Musk has <15% stake in Tesla and probably makes more money personally from SpaceX than Tesla right now.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Und3adShr3d",
            "body": "The Elon simps are going wild over this on X. Makes for an interesting read if you’re bored.",
            "score": 100,
            "replies": [
                {
                    "author": "bebe_laroux",
                    "body": "already  got one on here after making a comment saying Rob was paid off by a LIDAR car company and cheated. Same bullshit when Whistlin Diesel trashed a Cyber truck, they just can't escape their cult.",
                    "score": 55,
                    "replies": [
                        {
                            "author": "Und3adShr3d",
                            "body": "I do love watching the MAGA rage I have to admit. It’s a strange boiling pot of crazy when you have them all trying to agree yet half hate EVs and half have some cult like obsession over them. Even the orange overlord was mocking EVs before Musk started buying White House.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "CAPSLOCKCHAMP",
                                    "body": "ya, as a former Tesla driver, the /r/cars vibe change around Tesla was palpable. It was hated (you would get downvoted to oblivion if you said anything good about the cars), then they were cool with them and when I wrote about my experience getting rid of my Model 3, I got downvotes and some guy losing his shit over me saying stuff like \"Elon gonna Elon\" because the range estimate on my Model 3 Performance was so hilariously fake. Anyway, none of what I'm seeing in that video is surprising. The Model 3 still beeps at cars on the side of the road like you're going to hit them if the road has a slight incline. Phantom braking, etc. It's a joke",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bighurb",
            "body": "LIDAR car > Tesla eyes.. in a few tests\n\nRIP little Timmy",
            "score": 46,
            "replies": [
                {
                    "author": "CMDR_omnicognate",
                    "body": "Cameras have inherent flaws with them and the reason muskrat uses them is because they’re cheaper than better tech like lidar. In a surprise to literally nobody, they go with the cheaper option while pretending it’s more advanced so people don’t get mad at them skimping out.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "gaflar",
                            "body": "He INSISTS that any and all shortcomings of the existing cameras can be solved in software by throwing more AI at the problem. The people who have been working on vision systems for decades longer than Tesla continue to laugh and point.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "helium_farts",
                                    "body": "He also thinks F35s are \"shit\" and can be defeated using \"elementary AI\" and cameras because \"they're not invisible\" \n\n\n\n\nI'm starting to think he's not the brightest crayon in the box. Or maybe he just really hates radar for some reason. \n\nOr maybe both",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Gamebird8",
                                            "body": "The AI: \"That dark spec zooming around my FOV is a F-35, must shoot down\"\n\nThe Operator: \"No, that's just a fly\"\n\nAI: *Ignores Operator, fires Missile at the fly* \n\n\nIt's actually kinda funny, we do use vision tracking on many modern missiles (Saint Javelin of Ukraine uses vision tracking) but there are loads of other sensors and guidance parameters that aid in hitting the target.  Radar being the most common",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "thatblu3f0x",
                                            "body": "More scary, maybe he knows exactly what he's doing in order to make money for himself or someone he knows.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "canidude",
                                    "body": "Elon Musk seems more and more like Stockton Rush.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "gaflar",
                                            "body": "He's basically the same except with way more money to keep throwing at whatever the problem is. Stockton probably would have replaced the hull if he could afford to build another one. His final form is the billionaire character in Don't Look Up.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DeusSpaghetti",
                                    "body": "They mostly shake their head and say,'Well, if you insist on playing on hard mode, good luck'.\nTheoretically, vision could eventually do some stuff better than lidar.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "gaflar",
                                            "body": "Vision alone will never beat sensor fusion. Vision + lidar can do most things better than either one alone.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DeathHopper",
                            "body": "One isn't inherently better than the other as they both have pros/cons. The best case scenario is to use both so they cover each other's weaknesses, but that would be even *more* expensive.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "ERedfieldh",
                                    "body": "Nah....LIDAR is far better for this application.  You're not tricking LIDAR with a photograph of a tunnel.  LIDAR can account for backscattering, even.  I'm finding it difficult to find a scenario that cameras would handle better than LIDAR.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "DeathHopper",
                                            "body": "Nah what? Yes, LIDAR is great for 3d mapping and can't be fooled by illusions. But LIDAR can't tell you if a traffic light is green or red, or read road signs. As I said, both have limitations.\n\nLIDAR *has* to be supplemented with cameras. Cameras can get by, in most cases, without LIDAR. The best scenario is to not be cheap and use both.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "k410n",
                    "body": "You really don't need tests for that. Common sense is enough.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sodaMartin",
                            "body": "> Common sense is enough.\n\nBut that is in very short supply these days.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "HereticBanana",
                            "body": "Anyone with any knowledge on the two systems already knew what the outcome was going to be when they started.\n\nBut a nice visual showing the Tesla smoke a Styrofoam child is much more effective for the general public.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RedComet313",
            "body": "Of course it’s Mark Rober. I just saw his first squirrel video the other day.",
            "score": 11,
            "replies": [
                {
                    "author": "Shopworn_Soul",
                    "body": "I really appreciate that he does point out the Tesla used in the tests is his personal car. He's been driving that for a few years now.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "o8Stu",
            "body": "https://www.reddit.com/r/nottheonion/comments/1jcsjup/tesla_autopilot_drives_into_wile_e_coyote_fake/\n\nPosted a day ago and is currently on the front page.",
            "score": 12,
            "replies": []
        },
        {
            "author": "vsmack",
            "body": "I can see the current administration nuking all the regulations so these death machines can roam the streets without drivers, but no company will insure them. Maybe the answer is also nuking the requirement to be insured to drive. Total wild west.",
            "score": 13,
            "replies": [
                {
                    "author": "spaceporter",
                    "body": "My friend who works in car insurance adjustment thinks that the manufacturers will be required to take on the insurance, and then they'll insure that liability with the insurance companies at a portfolio level.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "PaxNova",
                    "body": "These death machines are safer than human drivers, even with only cameras. The question is more \"who is at fault, the driver or the programmer\" than it is \"these are inherently unsafe.\"",
                    "score": -27,
                    "replies": [
                        {
                            "author": "ERedfieldh",
                            "body": "So far that's proven to be false, but keep on sucking Muskrat's deformed dick.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "PaxNova",
                                    "body": "What does the NHTSA data say? \n\nNot against the obviously better lidar enhanced system that also includes cameras in a looney tunes test, but against actual humans in road data? \n\nThis is like those Cutco knife commercials. Cuts through cans! Like that's something you want to do with a kitchen knife.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "Suckage",
                                            "body": ">What does the NHTSA data say?\n\nThat Tesla is number 1 in safety recalls.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "saschaleib",
            "body": "Now I know why the neighbour has recently painted a street going to the horizon onto his garage wall!\n\nGood thinking, mate, I hate Teslas as much as you! 👍",
            "score": 10,
            "replies": []
        },
        {
            "author": "_ALH_",
            "body": "I haven’t tried ”FSD” but I love how my 2014 Golf has a more reliable adaptive cruise control then my brother in laws brand new Tesla that keeps doing random break checks because it thinks it’s about to collide with some road block or oncoming traffic it hallucinates…",
            "score": 16,
            "replies": [
                {
                    "author": "DameonKormar",
                    "body": "I have a 2023 Model 3 and the adaptive cruise control is the best I've seen in any car I've driven, and I've driven a lot of high end cars.  Mercedes, BMW, Lexus, etc.  Granted, I have *not* driven a 2014 Golf, so maybe there's some magic there.\n\nFSD is a joke though.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "sodaMartin",
                            "body": "I had a rental Model 3 on a trip about 8 months ago. It tried to kill me and my three children within about an hour of picking it up from the airport. Do not trust Tesla.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "_ALH_",
                            "body": "Well, I’ve driven my Golf for the last 8 years and use the adaptive cruise control for like 75% of the time I’m driving if not more and never had an issue, works perfectly. Well maybe a few times in that time it did a minor thing it shouldn’t, but nothing like when I drove my BILs tesla for a day and it kept doing those random break checks where you had to intervene to not be a traffic danger. Like 5 or 6 times in 100km, and he said it was a regular thing… It was horrible. Things like thinking a mailbox on the side of the road is an obstacle, or thinking we are about to collide with a truck we’re meeting just because it doesn’t understand we are in a curve to the right…\n\nSure the golf might not have as many fancy features, but that’s also part of why it ”just works” without bullshit. (And it also does emergency breaks, but pretty much every time it's done it, it has actually been needed)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SportsterDriver",
            "body": "Ah yes but it's cheaper to manufacture just sticking cameras in instead of also using lidar.",
            "score": 5,
            "replies": []
        },
        {
            "author": "marksrod",
            "body": "America loves their fraudsters",
            "score": 4,
            "replies": []
        },
        {
            "author": "mudokin",
            "body": "So I can paint myself to fit into the background, and go wait for a tesla to hit me, then collect insurance?",
            "score": 2,
            "replies": []
        },
        {
            "author": "KosherClam",
            "body": "Asking for a friend, if someone painted the back of their car like the open road and proceeded drive in front of Teslas and they rear ended them, would they be at fault?",
            "score": 2,
            "replies": []
        },
        {
            "author": "ghost_in_the_potato",
            "body": "Looks like Elon's cars are only about as smart as he is",
            "score": 2,
            "replies": []
        },
        {
            "author": "holdrio_pen",
            "body": "Even vacuum robot manufacturers put lidar sensors on their products but Tesla can't afford them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "angry-democrat",
            "body": "Boycott Musk and Twitter and Tesla",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThinNeighborhood2276",
            "body": "Looks like Tesla's Autopilot still has some challenges with visual trickery.",
            "score": 1,
            "replies": []
        },
        {
            "author": "40ozSmasher",
            "body": "People drive into buildings all the time. It's normal.",
            "score": -1,
            "replies": []
        },
        {
            "author": "XB_Demon1337",
            "body": "Just so people understand. \n\nThe reason the Tesla drove into the wall was because the Tesla uses only cameras to do driving and braking. While the other car they used actually uses LIDAR. So logically it makes sense why it failed the test. If you made a test that absorbed LIDAR the other car was likely to fail this test as well. \n\nThat isn't to defend the Tesla, it SHOULD have BOTH systems. But we can't pretend it failed a fair test.",
            "score": -18,
            "replies": [
                {
                    "author": "HereticBanana",
                    "body": "The vehicle with LIDAR stopped in fog and rain.  Something that's to be expected in day to day life.  \n\nThe 'brick wall' test was just showing off the technology.  \n\nIf it passed all the other test and only failed the Wile E. Coyote setup, you would have a point.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "XB_Demon1337",
                            "body": "The point is that all the tests were going to favor LIDAR. The fog test being so thick for sure and the water test equally so. Though the LIDAR car had some issues with the water test, which could mean that the LIDAR car could have failed this test easily and once again it makes perfect since that the Tesla failed both of them. But the point isn't either of these. The point is that the Wile E. test is SPECIFICALLY designed to defeat the Tesla. If they wanted a fair test it would have included a wall that absorbed the LIDAR's signal. But that isn't the point of the video as it was to show off LIDAR and how cool it was. \n\nAnd as I said, a vehicle should have BOTH systems to cut out any issues.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "HereticBanana",
                                    "body": "That's because LIDAR is the better technology for this specific purpose.  So anything that tests for this purpose, is going to show LIDAR as the victor against cameras. \n\nCan you describe an obstacle avoidance test where you think cameras will outperform LIDAR?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "XB_Demon1337",
                                            "body": "LIDAR is for sure the better tech for the specific use case. However again, both should be in the car. The cost of implementation for LIDAR is about equal to cameras alone. Hardware cost is very different but the implementation such as for the housing for the equipment and routing cables in the car is the same. \n\nCoating a wall in LIDAR absorbing paint that otherwise looks like a wall would be same version of this test but for LIDAR to lose and Cameras to win.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "HereticBanana",
                                                    "body": "The other car likely has both because LIDAR can't read signs. Only the Tesla comes without the LIDAR, which as you said, is the superior technology. \n\nThe Acme wall, while a joke, is something that exists in reality.  Stealth walls however...",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "XB_Demon1337",
                                                            "body": "You are right LIDAR can't read signs (though the coating on signs makes me wonder if you could make it) but it is unknown if that car has both. I actually am not certain if cards with LIDAR have both at all. But I think we both agree they should.\n\nThe Acme wall over a road is not something that exists. So arguing a 'stealth' wall not existing is moot. \n\nI am not saying this was done in a malicious fashion at all mind you. Mark Rober genuinely wanted to know what would happen. But people calling out Tesla for this is quite stupid. No one should be using auto-pilot when the weather conditions are adverse, and certainly no one should rely on any safety feature completely. \n\nMy entire point with the post (that people seem to have misunderstood) is that this testing was not completely fair and that the video itself was purely for entertainment. So using it to bash on Tesla as many articles have done, is quite silly.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HereticBanana",
                                                                    "body": ">The Acme wall over a road is not something that exists. So arguing a 'stealth' wall not existing is moot.\n\n[https://www.reddit.com/r/funny/comments/1lluv4/mural\\_on\\_the\\_back\\_of\\_acme\\_incorporated/](https://www.reddit.com/r/funny/comments/1lluv4/mural_on_the_back_of_acme_incorporated/)\n\nThis isn't the only one. And I agree they're dangerous for human drivers.  But they absolutely do exist.  \n\n> I actually am not certain if cards with LIDAR have both at all. \n\nIf they're self driving, then they absolutely do. \n\nTesla failed 3 tests.  You're only concentrating on the one that was done as a joke. \n\nElon wanted to cheap out and didn't use the better but more expensive option.  It's as simple as that.  That change makes the Tesla less safe for autonomous driving.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "XB_Demon1337",
                                                                            "body": "That is in a parking lot, not over a road. Also, that is not a continuation of a road. It has a bit of a campy style to it. This would be a more interesting test as Mark Rober was trying to replicate a known scene that was set to mimic what was actually there. \n\nI won't say they have both 100%. I will only say they should if they don't. I simply don't know and won't make an uneducated guess.\n\n  \nAs for the two failed tests from the Tesla (not the wall one). I addressed both twice, but they were not the focus of the post. So missing them was easy enough.  \n\n1. They are simulated. They are 10x worse than anyone would be experiencing. Having a either fog or rain that thick and not being able to see it would be to dangerous to even drive in let alone use self driving in. Ultimately the tests were too 'perfect' to realistically simulate the rain. Instead they should be using something like the rain fall simulations they use in some movies. While not 100% accurate it is more accurate based on how rainfall actually happens.\n\n2. The water test the LIDAR car struggled with as well. This test showed the system mostly not understanding what was going on and realistically should be run a number of times with an active attempt to understand the success of failure. Which was not the point of the video specifically. \n\n  \nThe two points here are really that the tests were not definitive and more or less for entertainment purposes, which Mark Rober himself came out and said was the case (about them being for entertainment). The only one that was really scientific was the wall crash, but it did lack the inverse test.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HereticBanana",
                                                                                    "body": "You think the Tesla cares if it's over a road or in a parking lot?  It would just think it's an exit. \n\nWhy is the wall crash more scientific than the other tests? \n\nYou keep bringing up humans driving but that's not what was being compared.  It's irrelevant what a human would do when testing what the obstacle avoidance system is doing. \n\nYou can say it was too foggy or too much rain all you want, but at the end of the day, one car hit the fake child and the other did not. Pretend it's a broken fire hydrant if that makes a difference somehow.  \n\nThe whole point of the automated systems is to be better than a human.\n\nIt may have been done for the entertainment value, but it clearly shows why other manufactures are safer than a Tesla.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "aceinagameofjacks",
            "body": "But what real world application does this prove. If cameras work in real life, who cares about a painted wall and lidar. EDS in full effect.",
            "score": -31,
            "replies": [
                {
                    "author": "cheshire-cats-grin",
                    "body": "Because the same issue happens with fog and heavy rain. A visual camera is defeated whereas a Lidar system still works.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "aceinagameofjacks",
                            "body": "A quick search on the subject. Both are not perfect, but I prefer cameras … but I don’t trust either tech in bad weather, fog, and rain. This is nothing more than a hit piece on Elon and Teslas. Like I said, full EDS. \n\nCameras\nPros:\n\t•\tCost-Effective: Cameras are generally cheaper to produce and install compared to LiDAR systems, making them more accessible for widespread use in vehicles.\n\t•\tColor and Texture Detection: They excel at identifying colors, signs, lane markings, and traffic lights, which are critical for understanding road rules and navigation.\n\t•\tHigh Resolution: Modern cameras provide detailed images, allowing for precise object recognition (e.g., pedestrians, cyclists, or animals) under good lighting conditions.\n\t•\tCompact Size: Cameras are small and easy to integrate into a car’s design without affecting aerodynamics or aesthetics.\n\nCons:\n\t•\tLighting Dependency: Performance drops significantly in low-light conditions, fog, rain, or glare, where visibility is compromised.\n\t•\tDepth Perception Limits: Cameras struggle with accurately measuring distances, especially at high speeds or with fast-moving objects, relying on software to estimate depth.\n\t•\tVulnerability to Obscuration: Dirt, snow, or scratches on the lens can obstruct the view, reducing reliability.\n\t•\tProcessing Intensive: Interpreting camera data requires complex algorithms and significant computational power, which can introduce latency or errors.\n\nLiDAR\nPros:\n\t•\tAccurate Distance Measurement: LiDAR uses laser pulses to create precise 3D maps of the environment, offering superior depth perception and object detection, even at long ranges.\n\t•\tWeather Resilience: It performs well in low-light or dark conditions and is less affected by glare or shadows, though heavy rain or snow can still scatter laser beams.\n\t•\t360-Degree Awareness: LiDAR can scan in all directions, providing a comprehensive view of the surroundings, which is ideal for detecting obstacles in complex scenarios.\n\t•\tReliability: Less dependent on external lighting or color, making it consistent across various conditions.\n\nCons:\n\t•\tHigh Cost: LiDAR systems are expensive to manufacture and integrate, which can drive up vehicle prices and limit adoption in mass-market cars.\n\t•\tSize and Aesthetics: Traditional LiDAR units are bulky and can be challenging to blend into a car’s design, though newer solid-state versions are more compact.\n\t•\tLimited Texture Recognition: LiDAR doesn’t capture color or fine details like text on signs, requiring pairing with other sensors (e.g., cameras) for full functionality.\n\t•\tWeather Sensitivity: While better than cameras in some conditions, heavy precipitation or fog can still degrade its performance by scattering laser beams.\n\nSummary\nCameras are affordable and great for visual interpretation but falter in poor conditions and depth accuracy. LiDAR offers precision and reliability in diverse scenarios but comes with a higher cost and integration challenges. In practice, many advanced safety systems (like those in autonomous vehicles) combine both to leverage their strengths—cameras for visual context and LiDAR for spatial accuracy. The choice depends on the specific safety goals, budget, and driving environment.",
                            "score": -23,
                            "replies": [
                                {
                                    "author": "WelpSigh",
                                    "body": "Waymo's cars use radar, cameras, and lidar together. Tesla decided to use cameras because Musk wanted to roll out autopilot sooner and LIDAR was too expensive at the time to add to cars ready for the market. He continued to defend this decision with the idea that \"your eyes are just cameras,\" and suggesting that \"sensor fusion\" would actually make it harder to achieve full self-driving.  \n  \nWaymo is now doing 200k paid rides with no driver per week, and Tesla is doing zero. Waymo can go tens of thousands of miles without a critical disengagement, while Tesla [can go around 230.](https://teslafsdtracker.com/) Tesla zigged while every other self-driving automation company zagged, and it seems pretty clear that zagging was the right move as LIDAR is now pretty cheap.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "aceinagameofjacks",
                                            "body": "Have you seen a Waymo car? You really wanna be driving around with sensors all over the fucking place, seriously. \n\nBusinesses make decisions, sometimes you have to believe in what you believe, and push on. He believes in cameras, let him push the boundaries and see where it takes him. You are welcome to buy a lidar car, your $, I’ll buy cameras, my $. \n\nAll you’re trying to do is shit on Elon, and Tesla. Without acknowledging the push Tesla has made to the overall fsd tech…",
                                            "score": -22,
                                            "replies": [
                                                {
                                                    "author": "BoingBoingBooty",
                                                    "body": ">I’ll buy cameras, my $. \n\nAnd will your $ be paying the damages when the car kills someone?  \nOr more appropriately are you ready to go to jail for manslaughter when the car kills someone?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "aceinagameofjacks",
                                                            "body": "As an adult, yes, I would take responsibility for my mistakes, therefore, never use the tech without being aware, and ready to intervene in case of emergency. If you are driving in heavy fog with your hands off the wheel, and 100% relying on cameras or lidar, you my friend are a total dumbass.",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "WelpSigh",
                                                    "body": ">Have you seen a Waymo car? You really wanna be driving around with sensors all over the fucking place, seriously.\n\nA lidar car doesn't necessarily need a sensor on the roof. They put one there because it improves the car's self-driving functionality - it's just the best place for one. Tesla would also be improved by having a roof camera, but that would make the car look a lot worse and people wouldn't want to buy it. As it stands, they chose aesthetics over functionality and they've paid the price. \n\n>Businesses make decisions, sometimes you have to believe in what you believe, and push on. He believes in cameras, let him push the boundaries and see where it takes him. You are welcome to buy a lidar car, your $, I’ll buy cameras, my $.\n\nI don't really care whether his FSD stack is camera-only or not. Only whether the product is safe. I don't think it is right now. I don't think it will ever be as safe as a lidar/camera combo. Even then, it's largely a tolerable situation as long as drivers need to be behind the wheel. If Tesla truly does attempt a driverless FSD taxi service in June as promised (and I doubt this meet this timeline), I would be very concerned about the safety of other people on the road. \n\n>All you’re trying to do is shit on Elon, and Tesla. Without acknowledging the push Tesla has made to the overall fsd tech…\n\nTesla didn't start equipping their vehicles for Autopilot until around 5 years after Waymo had already been founded. They've been the most forward-facing of companies developing autonomous driving, but they've never been on the bleeding edge. Don't confuse publicity with progress.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "aceinagameofjacks",
                                                            "body": "I agree with you, it’s not 100%, and I don’t trust it, but it’s great in most situation with supervision. Let’s give it time, and see where we end up in 10 years. The mistake is made where people trust it without questioning, and then when it goes wrong, oh look, Tesla bad. Yeah dumbass, (not you), why are you driving in fsd on a foggy rainy night.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "zoobrix",
                                    "body": "All of your lidar cons all revolve around aesthetics and cost, saying that cameras might be needed to is still about cost.\n\n\nBut what does it what it matter what it looks like or how cheap it is if it isn't safe? That's why other companies use lidar and waited until it was cheap enough to do so, even if still expensive. A good looking, cheaper solution that gets you killed is not a trade off anyone should be making.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "aceinagameofjacks",
                                            "body": "You’re gonna argue aesthetics, and drag coefficients don’t matter when it comes to car design. Really? 🫠. Especially on an electric vehicle. \n\nAgain, it comes down to taste. If you like lidar, your $, go buy an Audi, BMW, Chrysler, Honda, Hyundai, GM, Kia, Mazda, Mercedes-Benz, Toyota, Volvo, etc. What’s stopping you. The winner will emerge in the free market, but I wonder why the Y was the best selling vehicle in the world. Must be the lidar.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "zoobrix",
                                                    "body": "They don't matter nearly as much as maybe *fucking dying.* And you can easily integrate lidar in a way that doesn't cause drag or look bad, people aren't not buying those cars because they don't like the look of a lidar sensor somewhere. The aesthetic choices you're talking about aren't anything to do with lidar.\n\n\nBesides due to musk going full neo Nazi Tesla sales are dropping faster than the stock price, it's nothing to do with the tech but the model Y won't be the top seller this year that's for sure.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "aceinagameofjacks",
                                                            "body": "I rented an a7 in Germany for a week or so last year, cool car, but the large black “boxes” in the grill were ugly. You can’t convince me they are aesthetically pretty. They are not! The new Y will sell well, this shit with Elon will blow over, like it or not, the news cycle is short in the US, you’ll see. Might not be the top seller, but will be top 3 in two years.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "zoobrix",
                                                                    "body": "> The new Y will sell well, this shit with Elon will blow over\n\n\nYa about as quick as Trump is going to blow over after alienating every single ally... people aren't going to forget this shit because him and Trump never shut up. Once Trump and his minion Musk has cratered your economy I'm sure everyone that didn't vote for him will be rushing to buy a Tesla. International sales and US sales are permanently damaged by this.\n\n\nAnd you tell me like it or not....  too funny.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "aceinagameofjacks",
                                                                            "body": "Permanently. lol. BMW, Benz, VW literally made cars for AH, 10 years after he offed himself, they were best selling cars in Europe.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "zoobrix",
                                                                                    "body": "Did you just use the devastation of the second world war and Hitler as a comparison as to how bad Trump is going to be for America? The irony is hilarious.\n\n\nYa sure in a decade or two Tesla will be doing so great again, fantastic business strategy....",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "aceinagameofjacks",
                                                                                            "body": "What I am saying, if VW made it after actually being a Nazi mobile, I am sure Tesla, as a company will survive Elon’s bullshit.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "zoobrix",
                                                                                                    "body": "Oh I got what you were saying and that that was the comparison you came up with only proves my point how bad this will be for Tesla.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "cheshire-cats-grin",
                                    "body": "Sure but the choice is not an either or one. Most systems have both (or more!). Tesla is, as far as I am aware, the only one continuing with only cameras.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "aceinagameofjacks",
                                            "body": "The reasoning is cost and complexity. They believe in cameras and ai, and will contribute to push that boundary as much as possible. Is it perfect, no, will it improve, yes! Lidar is old tech, complex, and not perfect either. \n\nListen, you can shit on Elon all you want, but politics aside, dude has advanced auto tech by decades. Literally made legacy automakers shift focus and their own advancement. If not for Tesla, legacy would still be on combustion, and cheat scandals.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "BoingBoingBooty",
                                                    "body": ">Lidar is old tech,\n\nA stupid and pointless sound bite. \n\nCameras are even older tech if you want to get dumb about it.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "aceinagameofjacks",
                                                            "body": "Take a snapshot in time, and see how much has the camera tech improved, vs lidar. Yes, lidar is old tech, we are not talking about 1950’s cameras here. 🤦‍♀️. \n\nJust come out and say it, I hate Elon, and Tesla for political reasons, and that’s it, not disguise it in some tech advancement bullshit argument.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "ERedfieldh",
                                                                    "body": "Okay but we're not talking about 1970s LIDAR either.  You can't just say \"Yea but cameras have improved\" while ignoring that LIDAR has as well, and by leaps and bounds more.",
                                                                    "score": 9,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "BoingBoingBooty",
                                                                    "body": ">Just come out and say it, I hate Elon, and Tesla for political reasons\n\nJust come out and say it, I slurp Elon's nuts for political reasons",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "PM_ME_STUFF_N_THINGS",
                                    "body": "Stop simping for a Nazi",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WelpSigh",
                    "body": "that's the point of the video? even beyond the wile e coyote wall, the camera performed worse than lidar (or failed completely) in reduced visibility situations.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Leelze",
                    "body": "That the camera system can be easily fooled.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ASmallTownDJ",
                    "body": "Quit trying to make everything a fucking \"derangement syndrome.\"",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "HereticBanana",
                    "body": "TIL: Rain and Fog are abnormal weather conditions.\n\nI guess who cares if we just watched a video proving you wrong...  Somehow you're still right.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "aceinagameofjacks",
                            "body": "No, but driving fsd in heavy fog and rain in lunatic. So in that sense, who cares, unless you’re a dumbass and you trust the tech 100%.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "internetlad",
            "body": "Okay so I know this is a weird take but consider that a human would do the exact same thing if they were tired/not paying close attention.",
            "score": -12,
            "replies": [
                {
                    "author": "HereticBanana",
                    "body": "But the LIDAR vehicle didn't.  And that's what they were testing against.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "internetlad",
                            "body": "It feels disingenuous that everybody is making comments like \"I worry about the future seeing videos like this\".\n\n\nObviously hating on Tesla is the cool thing to do right now because fuck Musk. I've seen this post on Reddit about five times since the video went up so it just seems especially echo chambery.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "HereticBanana",
                                    "body": ">It feels disingenuous that everybody is making comments like \"I worry about the future seeing videos like this\".\n\nWhere are all these comments? \n\nAll I see is people pointing out how Tesla is behind other manufacturers.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}