{
    "title": "Columbia University Human Rights Fellow Convicted For Having A Slave",
    "author": "Sexy_Art_Vandelay",
    "subreddit": "nottheonion",
    "rank": 11,
    "score": 179,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 38,
    "url": "https://www.msn.com/en-us/news/world/columbia-university-human-rights-fellow-convicted-for-having-a-slave/ar-AA1AT8is",
    "id": "1je6woh",
    "selftext": "",
    "comments": [
        {
            "author": "supercyberlurker",
            "body": "A judge, who attends both Columbia and Oxford.. and was a Human Rights Fellow - literally having a human trafficked slave.\n\nProbably one of those times to remember that power, prestige, wealth - are not indicators of good character.",
            "score": 120,
            "replies": [
                {
                    "author": "jagdpanzer45",
                    "body": "In fact I’d argue they’re the opposite of indicators of good character.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "MrLanesLament",
                            "body": "Hard agree. If you see a rich person, the money is hiding the people they stepped on and sacrificed to get that money.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sexy_Art_Vandelay",
            "body": "“**All animals are equal, but some animals are more equal than others.**”",
            "score": 36,
            "replies": [
                {
                    "author": "Early-Sort8817",
                    "body": "4 legs gooooood",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Kachda",
                            "body": "Stupid bot",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rpanich",
            "body": "Man, Columbia’s reputation is just dirt now. I wonder how many applicants they’re going to get this upcoming fall semester.  ",
            "score": 45,
            "replies": [
                {
                    "author": "iampuh",
                    "body": "This won't even make a dent",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "Fermented_Fartblast",
                    "body": "Proof once again that Ivy League schools are all about the children of the rich and privileged networking with fellow rich and privileged people and nothing more.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "cogginsmatt",
                    "body": "I used to work there, it's crazy how brainwashed they have the students. It's all a grift. They'll brag about their great job placement rate without mentioning a huge chunk of Columbia grads work for Columbia. For a degree that costs infinitely more than it's worth.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Fark_ID",
                            "body": "So the B School eh?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Early-Sort8817",
                    "body": "If you go to that sub you won’t have a high opinion of them. At least when it comes to politics I see more critical thinking and questioning in city/state subs",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AUkion1000",
            "body": "Yeah max whatever sentencing.\nSlavery should be treated with the highest potential horrific we can give. The fact it's 2025 and ppl- I don't need to explain why it's bad, only that this needs to not be left lightly",
            "score": 7,
            "replies": []
        },
        {
            "author": "WhineyLobster",
            "body": "Not a good look.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jdmb0y",
            "body": "What is with this school",
            "score": 1,
            "replies": []
        },
        {
            "author": "lawyerjsd",
            "body": "So long as she hasn't claimed that Palestinians are people who should not be subject to genocide, I don't see Columbia having a problem with this.",
            "score": -7,
            "replies": []
        },
        {
            "author": "oldfogey12345",
            "body": "Hmm. Human Rights Fellow would be great to put on a tinder profile and I have never owned a slave.  Where do I sign up?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ban-Circumcision-Now",
            "body": "I’m sure many “pro human rights/bodily rights” individuals also force circumcision on their kids and don’t see the huge amount of hypocrisy",
            "score": -34,
            "replies": [
                {
                    "author": "supercyberlurker",
                    "body": "Male circumcision is an interesting topic to see the internet respond to.\n\nWe objectively know it's pointless, the medical reasons were made-up, and it's only done for religious reason.. but...\n\nYou only ever see it get traction in threads about female circumcision in another country, where people get annoyed at it 'being brought up because it's not as bad'.\n\nThen it goes right back to being a common everyday occurrence in America we ignore.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "BatHickey",
                            "body": "This is actually my favorite subject to troll about on reddit. People get so bent out of shape about male circumcision but compared to FGM it really is a non-issue. I say non-issue only by comparison and weirdly, folks who are advocates of banning the practice rarely ever seem to care about the women's side of the issue and call them equally bad which is absurd.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "crazynerd9",
                                    "body": "Both need to be stopped, but the comparison here is like if men ritualisticlly had their left pinky finger removed at birth, and women had their left hand removed at birth\n\nLike, both forms of common genital mutilation are barbaric and pointless, but one is absolutely a more significantly severe issue than the other",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FreneticAmbivalence",
                            "body": "I think it’s another loose thread to start the red pilling process.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EyezLo",
                    "body": "I like my cut penis thanks",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Ban-Circumcision-Now",
                            "body": "If you were left intact, would you feel the same? How do you know it couldn’t be better? Perhaps your “like” is just a coping strategy from not having a choice in the matter?\n\nI restored my foreskin, love the benefits",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "trentreynolds",
                                    "body": "https://youtu.be/sFKdZsAkMqs?si=V7u5PUb2ZDtJD4tI",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "EyezLo",
                                    "body": "Uncut dicks look weird and scare the hoes",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Googoo123450",
                                            "body": "It's just cause they're not as common in the U.S. I've literally heard girls talk shit about uncut penises then date a friend who I know is uncut and guess what? They didn't actually care. It was just trendy to shit on. Also, if you notice tons of Hollywood movies with Jewish directors have jokes about intact penises. Some of my favorite comedies do this. I think that obvious bias has actually skewed perception over time. It's wild.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ban-Circumcision-Now",
                                            "body": "Most of the world has no issue with them.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}